{
    "data": [
        {
            "id": "cointelegraph:577c34cbe094b:0",
            "title": "Bitcoin manipulation claims face pushback as ETFs snap 5-week outflow run: Finance Redefined",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>This week, rumors of a “10 a.m. Bitcoin dump” blamed on quantitative trading company Jane Street gained traction online after it was sued by Terraform Labs’ court-appointed administrator, but market watchers said the data does not support a consistent, company-driven selloff.</span></p><p class=\"\"><span>The accusations mounted a day after Jane Street was sued by Terraform Labs’ administrator amid allegations of insider trading that worsened the collapse of Terra’s algorithmic stablecoin ecosystem in May 2022.</span></p><p class=\"\"><span>Elsewhere in the market, demand for spot Bitcoin exchange-traded funds returned after five consecutive weeks of net negative outflows. US-listed spot Bitcoin ETFs took in over $1 billion in three consecutive days this week, with $254 million in cumulative inflows on Thursday, according to Farside Investors data.</span></p><p class=\"\"><span>Corporate Ether treasuries also came under pressure. The leader in corporate Ether </span><span>, Bitmine Immersion Technologies, was seen facing an $8.8 billion paper loss on its holdings amid the ongoing market downturn. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:682.5396825396825px;aspect-ratio:1.1375661375661374\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-7d0f7dadef9dd037baee8cd4a378f2c6-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-7d0f7dadef9dd037baee8cd4a378f2c6-resized.webp\" style=\"background-color:#daded8\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Analysts reject Jane Street “10 a.m. dump” claims, say Bitcoin isn’t easily manipulated</span></strong></p><p class=\"\"><span>Cryptocurrency investors accused quantitative trading company Jane Street of pressuring Bitcoin’s price with a daily, programmatic sell-off at the US market open, but market analysts and data suggest the pattern is not consistent, and no single company can force Bitcoin into a prolonged bear market.</span></p><p class=\"\"><span>The claims surged online a day after Terraform Labs’ court-appointed administrator sued Jane Street, alleging insider trading tied to transactions that worsened the collapse of Terra’s algorithmic stablecoin ecosystem in May 2022.</span></p><p class=\"\"><span>Several market watchers, including crypto influencer Justin Bechler, have argued that Jane Street’s holding of BlackRock’s iShares Bitcoin Trust exchange-traded fund (ETF), known as IBIT, could mask a net short Bitcoin position through hedges that do not appear in public filings. Bechler argued that Jane Street conducted coordinated algorithmic selling of Bitcoin at 10 a.m. EST daily, manipulating the Bitcoin (BTC) price to buy the ETF at a discount.</span></p><p class=\"\"><span>”When Jane Street reports holding $790 million in IBIT shares, the filing tells you nothing about whether those shares are hedged by puts, offset by short futures, or wrapped in a collar that makes the firm's net Bitcoin exposure zero or even negative,” wrote Bechler, adding that the ”actual position could be a massive short that looks like a long because the offsetting half of the trade is invisible under current disclosure rules.”</span></p><p class=\"\"><span>CryptoQuant’s head of research, Julio Moreno, cautioned that the activity Bechler described is not unique to one company. He said buying spot exposure while selling futures is a common approach for delta-neutral funds seeking to capture spreads rather than directional price moves.</span></p><p class=\"\"><span>Jane Street’s latest 13-F filing also disclosed holdings in Strategy, as well as sizable positions in Bitcoin mining companies Bitfarms, Cipher Mining and Hut 8. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:508.6651053864169px;aspect-ratio:0.8477751756440282\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-88022825fc116d1458c6644c83653ce1-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-88022825fc116d1458c6644c83653ce1-resized.webp\" style=\"background-color:#b3b1b0\"/></picture></div></button></figure><p class=\"\"><span>Continue reading</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Vitalik sells 17,000 ETH in one month after earmarking $45 million for privacy</span></strong></p><p class=\"\"><span>Ethereum co-founder Vitalik Buterin has reduced his Ether balance by about 17,000 ETH in one month after announcing plans to earmark $45 million worth of tokens for privacy projects.</span></p><p class=\"\"><span>Buterin’s wallets tracked by Arkham held about 241,000 Ether (ETH) in early February, before a series of outflows reduced the combined balance to 224,000 ETH on Tuesday.</span></p><p class=\"\"><span>The reduction came amid continued selling by Buterin, including about 2,961 Ether worth $6.6 million over a three-day period earlier in the month. Onchain analysts reported that this accelerated recently as he sold $7 million worth of tokens in three days. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1142.857142857143px;aspect-ratio:1.9047619047619047\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-a8ea4955fe5ea2add535b7514d0cc81d-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-a8ea4955fe5ea2add535b7514d0cc81d-resized.webp\" style=\"background-color:#302523\"/></picture></div></button></figure><p class=\"\"><span>Arkham Intelligence data shows the ETH sales were routed via decentralized exchange (DEX) aggregator CoW Protocol using numerous smaller swaps instead of one large transaction, a method typically employed to minimize market impact.</span></p><p class=\"\"><span>Continue reading</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Bitmine paper loss nears $8.8 billion as Ether slump tests cyclical thesis</span></strong></p><p class=\"\"><span>Corporate Ether treasuries are coming under increasing pressure as the crypto downturn deepens, with analysts warning the market is approaching a make-or-break phase for Ether’s investment case.</span></p><p class=\"\"><span>Bitmine Immersion Technologies, one of the biggest corporate holders of Ether (ETH), is sitting on a large unrealized loss as ETH trades well below the company’s average acquisition price, according to third-party tracker Bitminetracker. Some estimates put Bitmine’s paper losses in the $8.8 billion range after Ether’s slide over recent months.</span></p><p class=\"\"><span>ETH’s price has fallen 60% during the past six months, dropping well below Bitmine’s average cost basis of $3,843 per token, Bitminetracker data shows.</span></p><p class=\"\"><span>Crypto research outlet 10x Research said Monday that Ether is now trading near valuation and cost-basis levels that test whether the asset is simply in a cyclical downturn or entering a period of deeper, structural weakness.</span></p><p class=\"\"><span> “Investors must therefore assess carefully whether the asset is simply in a cyclical downturn or entering a phase of deeper structural impairment.”</span></p><p class=\"\"><span>Bitmine continues to buy ETH despite the mounting paper losses. Last week, Bitmine acquired 45,749 Ether at an average aggregate cost basis of $1,992 per ETH, signaling confidence from the world’s largest Ether treasury firm. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:827.3684210526316px;aspect-ratio:1.3789473684210527\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-92b5a7a650d06ff55e57e04c5f80d248-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-92b5a7a650d06ff55e57e04c5f80d248-resized.webp\" style=\"background-color:#121217\"/></picture></div></button></figure><p class=\"\"><span>Big Wall Street participants are maintaining exposure to Bitmine despite the market downturn.</span></p><p class=\"\"><span>The top 11 Bitmine shareholders, including Morgan Stanley, Ark Investment Management and asset manager BlackRock, have all increased their exposure to the treasury company during the fourth quarter of 2025.</span></p><p class=\"\"><span>Bitmine’s stock price has fallen by about 59% over the past six months and traded at $19.68 in the pre-market on Monday, data from Google Finance showed.</span></p><p class=\"\"><span>Continue reading</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Aave surpasses $1 trillion in lending volume amid institutional expansion</span></strong></p><p class=\"\"><span>Decentralized finance protocol Aave has surpassed $1 trillion in cumulative lending volume, marking a historic first in the DeFi industry.</span></p><p class=\"\"><span>“A decade ago, DeFi and Aave didn’t exist. They were just ideas. Today, Aave stands as the backbone of onchain lending, powering a new financial system that is open, global, and unstoppable,” Aave Labs CEO Stani Kulechov said in an X post on Wednesday.</span></p><p class=\"\"><span>The feat marked another step toward Aave’s goal of becoming the “largest, most efficient liquidity network in the world,” Kulechov added. “One that builders, banks, and fintechs plug into by default, fundamentally improving liquidity and cost structures across global finance.” </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:483.6734693877551px;aspect-ratio:0.8061224489795918\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-62f8c7ddee7c9b4b4a8dedfe9cc8f839-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-62f8c7ddee7c9b4b4a8dedfe9cc8f839-resized.webp\" style=\"background-color:#76748a\"/></picture></div></button></figure><p class=\"\"><span>In August, Aave Labs launched Aave Horizon, a new lending market on Ethereum, specifically for traditional finance firms and other institutional investors to borrow stablecoins against real-world assets.</span></p><p class=\"\"><span>VanEck, WisdomTree and Securitize were among the first participants to use Aave’s institutional offering.</span></p><p class=\"\"><span>On Feb. 15, Kulechov said DeFi lending could benefit from tokenizing “abundance assets,” such as solar, batteries for energy storage and robotics for labor. He expects those assets to be worth a combined $50 trillion by 2050.</span></p><p class=\"\"><span>Kulechov originally launched Aave as ETHLend in November 2017 before rebranding to Aave in September 2018. It now secures over $27.2 billion in total value locked, enabling users to earn interest on deposits and borrow instantly using crypto as collateral.</span></p><p class=\"\"><span>Aave leads several prominent DeFi lending platforms in TVL, including Morpho, JustLend, SparkLend, Maple, Kamin Lend and Compound Finance, each of which holds over $1 billion in total value locked.</span></p><p class=\"\"><span>Aave has generated over $83.3 million in fees over the last 30 days, nearly four times that of its next-closest competitor, Morpho.</span></p><p class=\"\"><span>Continue reading</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Curve founder says DeFi must ditch token emissions for real revenue</span></strong></p><p class=\"\"><span>Decentralized finance (DeFi) can no longer rely on inflationary token incentives to sustain growth, according to Curve Finance founder Michael Egorov. </span></p><p class=\"\"><span>In an interview with Cointelegraph, Egorov said protocols must generate real revenue rather than depend on emissions to attract liquidity.</span></p><p class=\"\"><span>“Your yield should come from revenues, not from tokens,” Egorov told Cointelegraph. “You need real revenues flowing.” He added that if a token “is not doing something, maybe it’s better for you to not do token at all.”</span></p><p class=\"\"><span>Egorov contrasted the current environment with the “DeFi summer” of 2020, when triple-digit and even 1,000% annual percentage rates drew capital into new protocols. He said that at the time, speculative premiums drove token prices and bootstrapped total value locked (TVL) for protocols. </span></p><p class=\"\"><span>“Right now, news doesn’t change prices of tokens anymore,” he told Cointelegraph, arguing that users have “re-evaluated the risks.” </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:446.69856459330146px;max-width:1200px;aspect-ratio:2.6863753213367607\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-96d3cf6c969a2654db9228be9207edd4-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-96d3cf6c969a2654db9228be9207edd4-resized.webp\" style=\"background-color:#1a232f\"/></picture></div></button></figure><p class=\"\"><span>His comments came as DeFi’s TVL has fallen about 38% over the past six months, according to DefiLlama. Data from the analytics platform shows TVL dropped from $158 billion on Aug. 23, 2025, to about $98 billion as of Monday.</span></p><p class=\"\"><span>Continue reading</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>DeFi market overview</span></strong></strong></p><p class=\"\"><span>According to data from Cointelegraph Markets Pro and TradingView, most of the 100 largest cryptocurrencies by market capitalization ended the week in the green.</span></p><p class=\"\"><span>The Pippin (PIPPIN) token rose 55% as the week’s biggest gainer in the top 100, followed by the Decred (DCR) token, up over 44% during the past week. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1032.0284697508896px;aspect-ratio:1.7200474495848161\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-95ecce3676da451d4ddf218bb08c1df9-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:577c34cbe094b-95ecce3676da451d4ddf218bb08c1df9-resized.webp\" style=\"background-color:#f9f5ea\"/></picture></div></button></figure><p class=\"\"><span>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:577c34cbe094b:0-bitcoin-manipulation-claims-face-pushback-as-etfs-snap-5-week-outflow-run-finance-redefined/",
            "pub_date": "2026-02-28 03:00:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:be88048a2094b:0",
            "title": "XRP Emerging As Safe Haven? CEO Points To Steady Inflows As BTC, ETH Struggle",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Most crypto funds have been losing investors lately. XRP hasn’t gotten that memo. While Bitcoin and Ethereum exchange-traded funds have faced weeks of steady outflows, XRP-linked products have quietly been doing something different — attracting fresh money even on the market’s worst days.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>XRP Takes Half Of All New Altcoin ETF Money</span></strong></p><p class=\"\"><span>According to Canary Capital CEO Steven McClurg, XRP is capturing roughly 50% of all new capital flowing into altcoin ETFs. That’s a commanding share of a market that includes several competing assets.</span></p><p class=\"\"><span>Solana comes in second, drawing around 30% of fresh inflows, while Hedera accounts for the remaining 20%. McClurg made the comments publicly, pointing to XRP’s staying power at a time when investor confidence across the broader crypto market has been shaky at best.</span></p><p class=\"\"><span>The numbers behind that claim are hard to dismiss. Reports show that so far this month, XRP ETFs have recorded negative flow days on just three occasions. Bitcoin ETFs, by comparison, have posted outflows on nine separate trading sessions during the same period. That gap tells a story about where some investors are choosing to put — or keep — their money right now.</span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">Xaif Crypto🇮🇳|🇺🇸</div><div class=\"username-n2KCMK3i\">@Xaif_Crypto</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>🚨 BREAKING: Canary Capital CEO just dropped something the market isn't ready for.</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://twitter.com/search?q=%24XRP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">$XRP</a><span> quietly absorbing capital while BTC &amp; ETH see outflows.</span></p><p class=\"\"><span>Even on red days. Even when Bitcoin ETFs bled. 😎 </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/MrCwbmUnPC\" rel=\"nofollow\" target=\"_blank\">https://t.co/MrCwbmUnPC</a><span> </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/xEAMaMm80e\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/xEAMaMm80e</a></p></div><span class=\"date-n2KCMK3i\">Feb 25, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/Xaif_Crypto/status/2026705564043194858\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>Last week offered perhaps the clearest snapshot of this divide. Bitcoin and Ethereum investment products together shed $250 million in outflows. XRP, meanwhile, pulled in $3.5 million. Modest in size, but striking given the conditions surrounding it.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Steady Inflows Since Launch</span></strong></p><p class=\"\"><span>Reports say XRP ETFs got off to a strong start when the first spot product was listed on Nasdaq in mid-November last year. From that point through January 7, 2026, inflows came in consistently without a single day of net outflows — an unbroken streak that lasted nearly two months.</span></p><p class=\"\"><span>That first outflow day in January was an exception to an otherwise clean run. Since then, XRP funds have largely held their footing while competing products struggled.</span></p><p class=\"\"><span>The cumulative result of that run: $1.24 billion in total net inflows, with assets under management now sitting at a little over $1 billion. Among the individual products, the Canary XRP ETF leads with $280 million in net assets.</span></p><p class=\"\"><span>Bitwise’s XRP ETF trails narrowly at $278 million — a gap thin enough that the rankings could easily shift with a few strong trading days.</span></p><p class=\"\"><span>Bitcoin and Ethereum ETFs have faced sustained selling pressure for months. New buyers have been hard to come by. XRP funds stepping into that environment and continuing to attract capital — rather than lose it — is a departure from what most of the market has been experiencing.A Shift In Where Investors Are Looking </span></p><p class=\"\"><span>Reports from Canary Capital suggest the pattern reflects something more than short-term trading behavior. Investors appear to be reallocating toward assets they see as having specific utility, with XRP’s established role in cross-border payments drawing attention from both institutional and retail buyers.</span></p><p class=\"\"><em><span>Featured image from Vecteezy, chart from TradingView</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:be88048a2094b:0-xrp-emerging-as-safe-haven-ceo-points-to-steady-inflows-as-btc-eth-struggle/",
            "pub_date": "2026-02-28 03:00:19",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947628:0",
            "title": "EDYOU: Heavy impairments and restructuring led to deep losses, but SaaS growth and global rollout are prioritized",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew year-over-year but Q4 saw a sharp decline, with significant impairments in Germany driving deep losses. Strategic restructuring shifts focus to SaaS and international expansion, with key partnerships and product launches set for 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947628-2aeed3eb9d301ae59822a4563b8069ae\" target=\"_blank\">EDYOUTEC AB [EDYOU] Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947628:0-edyou-heavy-impairments-and-restructuring-led-to-deep-losses-but-saas-growth-and-global-rollout-are-prioritized/",
            "pub_date": "2026-02-28 03:00:32",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947630:0",
            "title": "SBI: Strong H1 2025 growth and strategic progress, with robust hotel performance and improved outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>H1 2025 saw strong revenue and EBITDA growth driven by London and Gibraltar hotels, following a transformative share exchange and new group structure. Strategic projects in London, Vancouver, and Sevilla are advancing, with stable outlook and improved financial position.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947630-91007cfeb8cb5f9f8785e3573b2e2903\" target=\"_blank\">Sunborn International Plc [SBI] Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947630:0-sbi-strong-h1-2025-growth-and-strategic-progress-with-robust-hotel-performance-and-improved-outlook/",
            "pub_date": "2026-02-28 03:00:40",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN0VI:0",
            "title": "Brookfield's new AI unit Radiant valued at $1.3 billion after merger with UK startup, sources say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Radiant valued at $1.3 billion after merger with Ori, sources say</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>All of Ori's pre-deal investors rolled assets into Radiant, sources say</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Radiant aims to address AI supply-demand imbalance</span></li></ul></span></div><span><p class=\"\"><span>By Sam Tabahriti</span></p><p class=\"\"><span>    Brookfield Asset Management's </span><span> new AI infrastructure company Radiant has been valued at $1.3 billion after merging with London-based cloud computing firm Ori Industries, according to three people with knowledge of the matter and a document seen by Reuters.</span></p><p class=\"\"><span>Radiant, a new company the Canadian asset manager created to provide on-demand access to artificial intelligence chips, said it had combined with Ori in a deal announced on Tuesday without disclosing any financial terms.  </span></p><p class=\"\"><span>All of Ori's existing investors have rolled their stakes into Radiant, the sources said, adding that Brookfield injected fresh capital into the new company. Reuters could not determine how much of the valuation reflected Ori's contribution.</span></p><p class=\"\"><span>The valuation was established earlier this month, according to the document and one of the people. Reuters could not determine if it had changed since then.</span></p><p class=\"\"><span>Brookfield and Ori declined to comment.</span></p><p class=\"\"><span>The sources declined to be identified because the terms were not made public.</span></p><p class=\"\"><span>RACE TO BUILD AI INFRASTRUCTURE</span></p><p class=\"\"><span>Companies House filings show that Ori had 42.5 million pounds ($57.2 million) in total assets less current liabilities at the end of 2024. Total debt was 11.3 million pounds from 4.4 million pounds a year earlier, according to its filed accounts.</span></p><p class=\"\"><span>The deal comes as investors race to build the data-centre, power and chip infrastructure needed for advanced AI, amid a shortage of high-performance compute capacity.</span></p><p class=\"\"><span>Mahdi Yahya, the founder of Ori, a startup backed by Saudi Aramco's </span><span> venture arm, will now be president of Radiant.</span></p><p class=\"\"><span>\"For more than seven years we have been designing software to support AI infrastructure at scale, and it was clear Brookfield was the right partner,\" he said in a statement on Tuesday. \"Through Radiant we can help address the supply-demand imbalance that has defined AI since 2023.\"</span></p><p class=\"\"><span>Vishal Padiyar, executive chair of Radiant, said the company blends infrastructure and software to support governments and major enterprises, aiming to lower computing costs and improve performance at scale.    </span></p><p class=\"\"><span>Radiant is one of the first projects backed by Brookfield's AI infrastructure fund, which is seeking $10 billion in investor commitments and aims to scale to as much as $100  billion through co-investment and financing.</span></p><p class=\"\"><span>The fund includes up to $5  billion earmarked for Bloom Energy </span><span> to install up to 1 gigawatt of behind-the-meter power solutions for data centres and AI factories, while chipmaker Nvidia </span><span> contributed to the fund's initial capital and will supply chips to Radiant. </span></p><p class=\"\"><span>Britain is ramping up data-centre construction and plans to expand national computing capacity 20-fold by 2030 as data centres are classed as critical infrastructure. </span></p><p class=\"\"><span>Global players such as Google </span><span> and Microsoft </span><span> have pledged multi-billion-pound investments to the sector in the UK, alongside up to 2 billion pounds ($2.70 billion) in public funding under the UK's Compute Roadmap. </span></p><p class=\"\"><span>($1 = 0.7403 pounds)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN0VI:0-brookfield-s-new-ai-unit-radiant-valued-at-1-3-billion-after-merger-with-uk-startup-sources-say/",
            "pub_date": "2026-02-28 03:01:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009144:0",
            "title": "United Airlines, Delta Stocks Fall. Why Airlines Are Getting Crushed. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Nate Wolf</span></p><p class=\"\"><span>Shares of United Airlines Holdings and Delta Air Lines fell sharply Friday as geopolitical tensions and rising oil prices grounded airline stocks.</span></p><p class=\"\"><span>United stock was down 8.4%, making it one of the worst performers in the S&amp;P 500 on the day. Delta shares dropped 6.6%, American Airlines Group tumbled 6.2%, and Southwest Airlines was down 3.3%.</span></p><p class=\"\"><span>The U.S. Global Jets exchange-traded fund — which also holds aerospace manufacturers, booking services, and other travel-related companies — fell 4%. The ETF was on pace for its largest single-day percent decline since July 24, 2025, according to Dow Jones Market Data.</span></p><p class=\"\"><span>Oil prices were one likely culprit. Brent crude futures rose 2.6% to $72.71 a barrel as the U.S. and Iran failed to reach a deal over Iran's nuclear program, sparking fears of American military action. Iran is both one of the world's largest oil producers and can block the Strait of Hormuz, a vital shipping chokepoint.</span></p><p class=\"\"><span>Jet fuel is one of the largest expenses for air carriers, and the industry broadly expected costs to decline in 2026. The International Air Transport Association's year-ahead outlook in December included a projection that crude prices would decline 11% and jet fuel prices would fall 2.4% from 2025.</span></p><p class=\"\"><span>Tensions between the U.S. and Iran have instead seen crude futures prices jump by almost 20% this year.</span></p><p class=\"\"><span>\"The biggest stock risk near-term is oil spiking from a conflict in the Middle East,\" wrote Seaport Research Partners analyst Daniel McKenzie in an airlines update Friday. Even a temporary spike in crude prices, as oil experts have modeled in the event of U.S. strikes, would blunt Seaport's 2026 earnings outlook, McKenzie said.</span></p><p class=\"\"><span>Write to Nate Wolf at nate.wolf@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009144:0/",
            "pub_date": "2026-02-28 03:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN2IY:0",
            "title": "Pampa Energia SA expected to post earnings of $1.04 a share - Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Pampa Energia SA </span><span>, </span><span> is expected to  show a rise in quarterly revenue when it reports  results on March 2 for the period ending December 31 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The Buenos Aires-based  company is expected to report a 22.2% increase in revenue to $535.792 million from $438.41 million a year ago, according to the mean estimate from 2 analysts, based on LSEG data.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>​LSEG's mean analyst estimate for Pampa Energia SA is for earnings of $1.04 per share. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 3 \"hold\" and no \"sell\" or \"strong sell.\"  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months. ​</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Pampa Energia SA is $103.50, about 30.5% above its last closing price of $79.31</span></p></li></ul><p class=\"\"><span>Previous quarterly performance (using preferred earnings measure in US dollars). ​</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>STARMINESMARTESTIMATE®</span></p></td><td><p class=\"\"><span>LSEG IBES ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td><td><p class=\"\"><span>SURPRISE %</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025</span></p></td><td><p class=\"\"><span>1.90</span></p></td><td><p class=\"\"><span>1.75</span></p></td><td><p class=\"\"><span>0.56</span></p></td><td><p class=\"\"><span>Missed</span></p></td><td><p class=\"\"><span>-68.3</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025</span></p></td><td><p class=\"\"><span>1.65</span></p></td><td><p class=\"\"><span>1.73</span></p></td><td><p class=\"\"><span>0.94</span></p></td><td><p class=\"\"><span>Missed</span></p></td><td><p class=\"\"><span>-45.7</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025</span></p></td><td><p class=\"\"><span>1.09</span></p></td><td><p class=\"\"><span>1.09</span></p></td><td><p class=\"\"><span>2.82</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>159.9​</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2024</span></p></td><td><p class=\"\"><span>0.59</span></p></td><td><p class=\"\"><span>0.44</span></p></td><td><p class=\"\"><span>1.90</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>335.3</span></p></td></tr><tr><td><p class=\"\"><span>​​Sep. 30 2024</span></p></td><td><p class=\"\"><span>1.71</span></p></td><td><p class=\"\"><span>1.84</span></p></td><td><p class=\"\"><span>2.70</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>46.6</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2024</span></p></td><td><p class=\"\"><span>1.62</span></p></td><td><p class=\"\"><span>1.67</span></p></td><td><p class=\"\"><span>1.80</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>8​</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2024</span></p></td><td><p class=\"\"><span>1.02</span></p></td><td><p class=\"\"><span>1.24</span></p></td><td><p class=\"\"><span>4.90</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>294.9</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2023</span></p></td><td><p class=\"\"><span>-0.12</span></p></td><td><p class=\"\"><span>-0.09</span></p></td><td><p class=\"\"><span>-2.85</span></p></td><td><p class=\"\"><span>Missed</span></p></td><td><p class=\"\"><span>-2,931.9</span></p></td></tr></tbody></table></div><p class=\"\"><span>This summary was machine generated February 27 at 19:02 GMT.  All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN2IY:0-pampa-energia-sa-expected-to-post-earnings-of-1-04-a-share-earnings-preview/",
            "pub_date": "2026-02-28 03:02:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009147:0",
            "title": "Zscaler Is Maintained at Buy by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:03 GMT) </span></strong><span>Zscaler Price Target Cut to $220.00/Share From $260.00 by TD Cowen</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009147:0/",
            "pub_date": "2026-02-28 03:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260227012923:0",
            "title": "United's stock and other airline shares get a reality check from rising oil prices, market jitters",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By CLAUDIA ASSIS</span></p><p class=\"\"><span>United Airlines' stock leads S&amp;P 500 decliners</span></p><p class=\"\"><span>United Airlines' stock was on track for its worst percentage decline since April.</span></p><p class=\"\"><span>United Airlines' stock was leading S&amp;P 500 index decliners on Friday and heading for its worst drop in 10 months, with other airline stocks also seeing steep declines amid rising oil futures prices and increased market jitters.</span></p><p class=\"\"><span>United shares (UAL) were on pace for their largest one-day percentage decline since April 10, when they fell 11%. Shares of Delta Air Lines (DAL) and American Airlines (AAL) were down about 6% each.</span></p><p class=\"\"><span>Shares of Southwest Airlines (LUV) were down more than 3% even as analysts at Cowen raised their rating on the stock to buy on Friday and praised the industry's backdrop. Such ratings changes usually provide a boost for a company's shares.</span></p><p class=\"\"><span>Oil futures jumped on Friday after nuclear talks between the U.S. and Iran in Geneva ended with no concrete agreements. Negotiations are set to resume next week.</span></p><p class=\"\"><span>Many airlines shield themselves from volatility in the price of fuel, which makes up a large part of their operational costs, by hedging it, usually using financial derivatives to try to spread their risk. But there has been a clear negative correlation between oil futures prices and airline stocks in recent years.</span></p><p class=\"\"><span>Signs that inflation may persist and broader fears about artificial intelligence and tech stocks were also at play for U.S. equities, with some fearing that March will be another tumultuous month for the market.</span></p><p class=\"\"><span>U.S. airlines enjoy broad-based demand and capacity is \"rational,\" the Cowen analysts said in their note about Southwest. The \"rising industry tide\" bodes well for the company, they said.</span></p><p class=\"\"><span>The airline for years stuck with a one-size-fits-all approach that fell out of sync with competitors, which dove deeper into tiered fares and charging for different services as a way to drum up more profits.</span></p><p class=\"\"><span>Amid pressure from activist investors, Southwest announced sweeping changes a couple of years ago, including the end of its hallmark policies of open seating and no fees for checked baggage. It started charging baggage fees earlier this year, while extra-legroom and assigned-seating options went live in January.</span></p><p class=\"\"><span>-CLAUDIA ASSIS</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260227012923:0/",
            "pub_date": "2026-02-28 03:03:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009152:0",
            "title": "Hut 8 Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:04 GMT) </span></strong><span>Hut 8 Price Target Raised to $70.00/Share From $62.00 by Canaccord Genuity</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009152:0/",
            "pub_date": "2026-02-28 03:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN29S:0",
            "title": "Cutix PLC Posts Q3 Group Revenue 3.58 Bln Naira",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Cutix PLC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CUTIX PLC: Q3 GROUP REVENUE 3.58 BILLION NAIRA, LOSS BEFORE TAX 115.9 MILLION NAIRA</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN29S:0-cutix-plc-posts-q3-group-revenue-3-58-bln-naira/",
            "pub_date": "2026-02-28 03:04:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009158:0",
            "title": "Middleby Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:05 GMT) </span></strong><span>Middleby Price Target Raised to $203.00/Share From $187.00 by Canaccord Genuity</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009158:0/",
            "pub_date": "2026-02-28 03:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN1VO:0",
            "title": "Truth Social parent explores spinning off social media platform",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Trump Media &amp; Technology Group </span><span> said on Friday it is in discussions with TAE Technologies and Texas Ventures Acquisition III about spinning off businesses including Truth Social into a new publicly traded company.</span></p><p class=\"\"><span>Under the proposal, shares in the spun-off company will be distributed to eligible TMTG shareholders, after which the new entity would merge with the special purpose acquisition company. </span></p><p class=\"\"><span>TMTG said no definitive agreement has been reached and discussions remain ongoing.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN1VO:0-truth-social-parent-explores-spinning-off-social-media-platform/",
            "pub_date": "2026-02-28 03:05:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260227010716:0",
            "title": "Trump suggests military attack on Iran is still on the table, boosting oil prices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Barbara Kollmeyer</span></p><p class=\"\"><span>U.S. government on Friday urges nonemergency government workers to leave Israel</span></p><p class=\"\"><span>The State Department on Friday urged nonemergency U.S. workers to leave Israel after talks on Tehran's nuclear program ended Thursday without a deal.</span></p><p class=\"\"><span>Oil prices were up sharply Friday after President Donald Trump reportedly suggested that a U.S. military strike on Iran is still being considered after a deal to end Tehran's nuclear ambitions didn't materialize this week.</span></p><p class=\"\"><span>Trump told reporters outside the White House that he would \"love not to use\" the U.S. military to attack Iran, but \"sometimes you have to,\" according to a report from CNBC.</span></p><p class=\"\"><span>Oil prices moved back up toward session highs in the wake of those reported comments. April West Texas Intermediate crude (CLJ26) (CL.1) rose 2.6% to $66.91 a barrel. The contract is set to gain nearly 1% for the week and over 3% for the month of February, FactSet data show.</span></p><p class=\"\"><span>April Brent crude (BRNJ26) was up 2.5% to $72.50 a barrel, with the contract set to gain 1% for the week and 4.6% for the month.</span></p><p class=\"\"><span>The oil market is providing a reminder that until \"documents are signed and money changes hands, there is no deal,\" Colin Cieszynski, portfolio manager and chief market strategist at SIA Wealth Management, told MarketWatch.</span></p><p class=\"\"><span>The Oman-mediated talks between the U.S. and Iran in Geneva ended on Thursday with \"significant progress,\" Badr Albusaidi, Oman's foreign minister, said in a post on X Thursday. He said talks would resume after \"consultation in the respective capitals,\" with the two sides holding \"technical level\" discussions next week in Vienna.</span></p><p class=\"\"><span>\"Talks are extending into another week, but ironically, the longer they go on, the higher oil prices seem to go. This is because the markets are sensing that the Iranians could be stringing [President] Trump along and at one point, Mr. Trump may lose his patience and tell his negotiators to come home,\" Edward Meir, an analyst at Marex, said in comments emailed Friday morning.</span></p><p class=\"\"><span>\"At the end of the day, it should not take weeks and weeks to come to an agreement and the markets are getting nervous waiting,\" Meir added.</span></p><p class=\"\"><span>Read: U.S.-Iran nuclear talks end, but with hope that negotiations continue. That still leaves the oil market in limbo.</span></p><p class=\"\"><span>Congressional Democrats are expected to force a vote on a war powers resolution linked to Iran next week, in a bid to prevent Trump from taking military action against Iran without the prior approval of Congress.</span></p><p class=\"\"><span>Friday saw the U.S. State Department authorize nonemergency U.S. government personnel and their family members to leave Israel \"due to safety risks,\" which weren't specified. The order also warned of potential restrictions on travel to areas of Israel, the Old City of Jerusalem and the West Bank, while suggesting \"persons may wish to consider leaving Israel while commercial flights are available.\"</span></p><p class=\"\"><span>Trump has said the U.S. military has assembled an armada of warships and fighter jets near Iran.</span></p><p class=\"\"><span>David Morrison, senior market analyst at Trade Nation, said markets are also focused on the meeting of the Organization of the Petroleum Exporting Countries and its allies on Sunday. There has been speculation that members may resume production increases starting in April, he said, after the group decided to leave output quotas unchanged for the first quarter of 2026.</span></p><p class=\"\"><span>\"While OPEC+ estimates that supply and demand will be in balance throughout this year, the International Energy Agency maintains its forecast of an oversupply of 3.7 million barrels per day throughout 2026,\" Morrison said in a note to clients.</span></p><p class=\"\"><span>-Barbara Kollmeyer</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260227010716:0/",
            "pub_date": "2026-02-28 02:55:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:8373a4c61c7bf:0",
            "title": "iShares Silver Trust SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The iShares Silver Trust, a grantor trust formed under New York law, has released its 2025 10-K report, showcasing a year of substantial growth driven by a significant increase in silver prices. The Trust, which aims to reflect the performance of the price of silver, provides investors with a cost-effective alternative to investing in physical silver. The Trust's shares are backed by silver held by JPMorgan Chase Bank N.A., London Branch, and are listed on NYSE Arca under the ticker symbol SLV.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Asset Value:</span></strong><span> $38,046 million, increased 183.90% from $13,401 million at December 31, 2024, primarily due to a 149.01% increase in the price of silver.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Resulting from Operations:</span></strong><span> $21,306.9 million, driven by a net realized gain of $23.6 million from investment in silver bullion sold to pay expenses and an unrealized gain on investment in silver bullion of $17,752.9 million.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Investment Loss:</span></strong><span> $95.5 million, primarily due to the Sponsor’s fees, which were 0.50% of the Trust’s average weighted assets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $23.75 for the quarter ended December 31, 2025, reflecting the significant appreciation in silver prices.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Objective:</span></strong><span> The iShares Silver Trust aims to reflect the performance of the price of silver, providing a cost-effective alternative to investing in physical silver. The Trust's shares are backed by silver held by the Custodian and are listed on NYSE Arca under the ticker symbol SLV.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Structure:</span></strong><span> The Trust is a grantor trust formed under New York law, with no officers, directors, or employees. It issues and redeems shares in exchange for silver, only in Baskets of 50,000 shares, and only with Authorized Participants.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Custody and Valuation:</span></strong><span> Silver is held by JPMorgan Chase Bank N.A., London Branch, and valued using the LBMA Silver Price. The Trust's net asset value is calculated daily by subtracting accrued fees and liabilities from the total value of silver and other assets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Secondary Market Trading:</span></strong><span> Shares may trade at, above, or below their net asset value due to market supply and demand, with arbitrage opportunities potentially mitigating price discrepancies.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Activities:</span></strong><span> The Trust's activities are limited to issuing Baskets in exchange for silver, selling silver to cover fees and expenses, and delivering silver for redeemed Baskets. It does not engage in active management or lend its silver.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Insurance and Liability:</span></strong><span> The Custodian maintains insurance for its custodial obligations, but the insurance is for the Custodian's benefit, not the Trust's. The Custodian's liability is limited to the market value of any lost silver.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust seeks to continue reflecting the performance of silver prices, with the Sponsor assuming most administrative and marketing expenses. The Trust's only ordinary recurring expense is the Sponsor's fee, which is 0.50% of the net asset value.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Discussion:</span></strong><span> The Trust's net asset value increased significantly in 2025 due to a rise in silver prices and an increase in outstanding shares. The Trust remains a passive investment vehicle, not engaging in activities to profit from or mitigate losses due to silver price changes.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives:</span></strong><span> The Trust is a passive investment vehicle that seeks to reflect the performance of the price of silver. It does not engage in activities designed to obtain a profit from changes in the price of silver, focusing instead on maintaining its holdings in silver bullion. The Trust's strategic initiative is to provide a vehicle for investors to gain exposure to silver prices without the complexities of physical silver ownership.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The Trust's capital management activities include issuing and redeeming shares in exchange for silver, only in Baskets or integral multiples thereof, and only in transactions with Authorized Participants. During 2025, the Trust created 411,600,000 shares and redeemed 337,600,000 shares. The Trust's only source of liquidity is its sales of silver, and it does not declare cash distributions to shareholders. The Trust's expenses are primarily covered by the Sponsor's fees, which were $95,546,277 for 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust does not anticipate any material changes to its liquidity needs and will continue to operate as a passive investment vehicle reflecting the price of silver. The Trust will maintain its current strategy of issuing and redeeming shares in exchange for silver and does not plan to make periodic distributions to shareholders.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The price of silver is subject to wide fluctuations due to factors such as changes in economic conditions, investor sentiment, and global supply and demand. Events like the Russia-Ukraine conflict have added to market volatility, impacting silver prices and, consequently, the Trust's performance.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> The Trust relies heavily on electronic systems for trading and record-keeping, which are susceptible to failures and cyber incidents. Any disruption could adversely affect the Trust's operations and the value of the Shares.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Changes in government policies, such as those affecting trading in physical commodities, could impact silver prices. The Trust is also subject to regulations by the Financial Conduct Authority in the UK, which oversees the LBMA Silver Price.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Custodial Risks:</span></strong><span> The Custodian's operations are not directly regulated, and the Trust's silver is not insured. Any loss or damage to the silver could result in a decrease in the Trust's NAV and the value of the Shares.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Liquidity Risks:</span></strong><span> A lack of active trading in the Shares could lead to price volatility and affect the ability of investors to sell their Shares at desired prices.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Discussion:</span></strong><span> Management acknowledges the inherent risks in the silver market and the Trust's exposure to these risks due to its passive investment strategy. The Trust does not engage in active management or hedging strategies to mitigate price fluctuations. The Trust's performance is solely dependent on the price of silver, and any decline in silver prices will directly impact the value of the Shares. Investors are advised to consider these risks carefully and assess their ability to bear potential losses associated with an investment in the Trust.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1330568/000143774926006059/slv20251231_10k.htm\" rel=\"nofollow\" target=\"_blank\">iShares Silver Trust [ SLV ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:8373a4c61c7bf:0-ishares-silver-trust-sec-10-k-report/",
            "pub_date": "2026-02-28 02:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:c65979f50b3c6:0",
            "title": "iShares S&P GSCI Commodity-Indexed Trust SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The iShares S&amp;P GSCI Commodity-Indexed Trust, a Delaware statutory trust that issues units of beneficial interest representing fractional undivided beneficial interests in its net assets, has released its 2025 10-K report. The Trust, operated by iShares Delaware Trust Sponsor LLC and advised by BlackRock Fund Advisors, aims to track the results of a fully collateralized investment in futures contracts on a diversified group of commodity futures. The report highlights the Trust's financial performance, business operations, strategic initiatives, and the challenges and risks it faces.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Investment Income:</span></strong><span> $34.25 million, reflecting a strong performance in interest income from U.S. Treasury bills.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Realized and Unrealized Gain:</span></strong><span> $22.71 million, driven by gains on futures contracts.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Resulting from Operations:</span></strong><span> $56.97 million, indicating a positive operational performance for the year ended December 31, 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $0.98 for the quarter ended March 31, 2025, highlighting a significant increase in value per share.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $0.87 for the quarter ended September 30, 2025, showing continued growth in share value.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $0.19 for the quarter ended December 31, 2025, reflecting a modest increase in share value.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Overview:</span></strong><span> The Trust's assets consist of long positions in exchange-traded index futures contracts on the S&amp;P GSCI™ Excess Return Index, along with cash and U.S. Treasury securities.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Structure:</span></strong><span> The Trust is a commodity pool as defined by the Commodity Exchange Act and is not registered under the Investment Company Act of 1940.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Investment Objective:</span></strong><span> The Trust aims to match the investment returns of the S&amp;P GSCI Total Return Index before fees and expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Share Issuance and Redemption:</span></strong><span> Shares are offered on a continuous basis in blocks of 50,000 Shares, known as 'Baskets,' and can only be purchased or redeemed by registered broker-dealers with an authorized participant agreement.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Index Futures and Collateral Assets:</span></strong><span> The Trust holds long positions in Index Futures and Collateral Assets to satisfy margin requirements, with the Advisor authorized to manage these assets on behalf of the Trust.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Trading and NAV:</span></strong><span> The Trust's Shares are traded on NYSE Arca, and the NAV is determined based on the settlement prices of Index Futures, which may fluctuate due to market value changes.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Expenses:</span></strong><span> The Sponsor covers various administrative, operational, and marketing expenses in exchange for a fee of up to 0.75% of the Trust's Adjusted Net Asset Value, while the Trust is responsible for brokerage commissions and extraordinary expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Liquidity and Capital Resources:</span></strong><span> The Trust's assets consist of Index Futures and Collateral Assets, with interest income used to cover expenses. The Trust does not anticipate further liquidity needs as creations and redemptions occur in kind.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market and Credit Risk:</span></strong><span> The Trust's capital is at risk due to market fluctuations in Index Futures and potential defaults by the CME's clearing house or its FCM. The Trust is also exposed to credit risk from its U.S. Treasury bill holdings.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust continues to focus on tracking the S&amp;P GSCI Total Return Index and managing its positions in Index Futures and Collateral Assets to achieve its investment objectives.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Shift:</span></strong><span> The Trust transitioned from a two-tiered structure to directly holding and transacting in Index Futures, aiming to streamline operations and potentially reduce costs associated with managing a subsidiary. This change was completed following the liquidation of the Investing Pool on December 31, 2013.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The Trust's capital management activities included the creation and redemption of Shares, with 17,800,000 Shares created and 15,450,000 Shares redeemed in 2025, resulting in a net increase in the number of outstanding Shares and contributing to the increase in the Trust's net asset value. No cash distributions were declared to Shareholders during the fiscal years ended December 31, 2025, and 2024. Additionally, 2,100,000 Shares were redeemed during the fourth quarter of 2025 at an average price of $23.05 per Share.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust does not anticipate any further need for liquidity due to the in-kind nature of Share creations and redemptions and the use of interest income to cover ordinary expenses. However, the limited number of market participants in the Index Futures market could pose a risk if the Trust is required to liquidate its positions. The Sponsor is unaware of any trends or events likely to materially change the Trust's liquidity needs.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The Trust faces significant market risks due to the volatility of commodity prices, influenced by factors such as production costs, demand fluctuations, geopolitical events, and speculative trading. The COVID-19 pandemic has exacerbated these risks, leading to increased market volatility and potential for negative pricing, as seen in the May 2020 WTI crude oil futures contract.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> These include the potential for illiquidity in commodity futures trading, disruptions in market trading, and the impact of contango and backwardation on futures contracts. The Trust's reliance on electronic systems and the potential for cybersecurity incidents pose additional operational challenges.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Potential changes in futures and OTC derivatives market regulations, including position limits imposed by the CFTC and exchanges, could affect the liquidity and pricing of the Trust's investments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management and Oversight Risks:</span></strong><span> The Trust's performance is subject to risks related to the management and oversight by the Sponsor, Trustee, and Advisor, as well as the operational integrity of key service providers. The interconnectedness of these entities, many of which are affiliated with BlackRock, may amplify these risks.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Interest Rate Risks:</span></strong><span> The Trust is exposed to interest rate risks, which could affect the value of its cash equivalents and marketable securities. Changes in interest rates may lead to increased market volatility and reduced liquidity, impacting the Trust's performance.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1332174/000143774926006060/gsg20251231_10k.htm\" rel=\"nofollow\" target=\"_blank\">iShares S&amp;P GSCI Commodity-Indexed Trust [ GSG ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:c65979f50b3c6:0-ishares-s-p-gsci-commodity-indexed-trust-sec-10-k-report/",
            "pub_date": "2026-02-28 02:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw30fypd:0",
            "title": "Astron Connect Inc. Reports First Quarter 2026 Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>(TheNewswire)</span></p><p class=\"\"><span>VANCOUVER, BC – TheNewswire - February 27, 2026 –Astron Connect Inc. (the “Company” or “Astron”) (TSX-V:AST) today announced its first quarter results for the threemonths ended December 31, 2025. </span></p><p class=\"\"><span>Highlights for the three months ended December 31,2025:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net loss of $105,892for</span><br/><span>the three months ended December 31, 202</span><br/><span>(202– net loss of $28,162), aincrease of 70</span><br/><span>% from FY202 </span><br/></p><br/></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Operating expenses of $105,729</span><br/><span>for the three months ended December 31,</span><br/><span>202 (202 - $29,064), a</span><br/><span>decrease of 73% from</span><br/><span>FY202 </span><br/></p><br/></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>As of December 31, 202, the</span><br/><span>Company had a working capital of $149,216(202 - $151,477deficiency).  </span><br/></p><br/></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Selected First Quarter</span><br/><span>Information</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><span> </span></td><td colspan=\"1\" rowspan=\"1\"><span> </span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span> </span></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>December 31, 2024</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>December 31, 2023</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span> </span></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>CAD$</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>CAD$</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Operating expenses</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>105,729</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>29,064</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Other loss (income)</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>163</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>(902)</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Net loss</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>         (105,892)</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>         (28,162)</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Basic and diluted EPS</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>               (0.00)</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>               (0.00)</span><br/></p><br/><br/></td></tr></tbody></table></div><p class=\"\"><br/><span>For further financial information, please refer to the</span><br/><span>annual audited consolidated financial statements www.sedar.com or</span><br/><span>www.astronconnect.com. </span><br/></p><p class=\"\"><br/><span> Financial Statements and</span><br/><span>MD&amp;A</span><br/></p><p class=\"\"><br/><span>The Company's Financial Statements and</span><br/><span>Management's Discussion and Analysis (MD&amp;A) for the three</span><br/><span>months ended December 31, 2022 will be accessible on SEDAR at</span><br/><span>www.sedar.com under Astron's profile and on the Company's websiteat www.astronconnect.com.</span></p><p class=\"\"><span>ABOUT ASTRON CONNECT</span></p><p class=\"\"><span>Astron Connect Inc. (TSX-V:AST) helps Canadianenterprises in the food and beverage industry break through the noiseand bring their products to new international markets in the emergingworld. Astron Connect brings Canadianfood and beverage companies to the world through its extensive connections and export logistics capabilitiesin China and emerging markets. Manna Water and Sachiel Water (both Astron brands) supply China and other emerging markets with pure Canadian bottled spring water. For more information, visit www.astronconnect.com.</span></p><p class=\"\"><span>For more information, pleasecontact:</span></p><p class=\"\"><span>S. Randall Smallbone Chairman and Director AstronConnect Inc.</span></p><p class=\"\"><span> rsmallbone@cogeco.ca</span></p><p class=\"\"><span>The TSXV has neither approved nor disapproved the contents of this news release. Neither the TSXV nor its Regulation Service Provider (as that term is defined in the policies of the TSXV) accepts responsibility for theadequacy or accuracy of this release.</span></p><p class=\"\"><span>Notice regardingforward looking statements:</span></p><p class=\"\"><span>This press release may contain “forward-lookinginformation” within the meaning of applicable Canadian securitieslegislation. All statements, other than statements of historical fact,included herein may be forward-looking information. Generally,forward-looking information may be identified by the use offorward-looking terminology such as “plans” “expects” or“does not expect”, “proposed”, “is expected”,“estimates”, “forecasts”, “intends”, “anticipates” or“does not anticipate”, or “believes”, or variations of suchwords and phrases, or by the use of words or phrases which state thatcertain actions, events or results may, could, would, or might occuror be achieved. This forward-looking information reflects the currentbeliefs of Astron and is based on information currently available toAstron and on assumptions Astron believes are reasonable. Theseassumptions include, but are not limited to, management’sassumptions about receiving TSXV acceptance of the Transaction asconstituting Astron’s “qualifying transaction”.</span></p><p class=\"\"><span>Forward-looking information is subject to known andunknown risks, uncertainties and other factors that may cause theactual results, level of activity, performance or achievements ofAstron to be materially different from those expressed or implied bysuch forward-looking information. Although Astron has attempted toidentify important factors that could cause actual results to differmaterially from those contained in forward-looking information, theremay be other factors that cause results not to be as anticipated,estimated or intended. Accordingly, readers should not place unduereliance on forward- looking information as there can be no assurancethat the plans, intentions or expectations upon which theyare placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove tobe incorrect and actual results may differ materially fromthose anticipated. Forward-looking statementscontained in this press release are expressly qualified by thiscautionary statement.</span></p><p class=\"\"><span>The forward-looking statements contained in this pressrelease represent the expectations of Astron as of the date of this press release and, accordingly, aresubject to change after such date. However, Astron expressly disclaimsany intention or obligation to update or revise any forward-lookingstatements, whether as a result of new information, future events orotherwise, except as expressly required by applicablesecurities law.</span></p><p class=\"\"><span>Investors are cautioned that, except as disclosed inthe filing statement prepared in connection with the Transaction, anyinformation released or received with respect to the Transaction maynot be accurate or complete and should not be relied upon. Trading inthe securities of a capital pool company should be considered highlyspeculative.</span></p><p class=\"\"><span>The TSX Venture Exchange has in noway passed on the merits of the Transaction and has neither approved or disapproved thecontents of this press release.</span></p><p class=\"\"><span>Neither TSX Venture Exchange nor its RegulationServices Provider (as that term is defined in the policies of the TSXVenture Exchange) accepts responsibility of the adequacy or accuracyof this press release.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw30fypd:0-astron-connect-inc-reports-first-quarter-2026-results/",
            "pub_date": "2026-02-28 02:55:18",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009104:0",
            "title": "Elastic Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:56 GMT) </span></strong><span>Elastic Price Target Cut to $90.00/Share From $115.00 by Canaccord Genuity</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009104:0/",
            "pub_date": "2026-02-28 02:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009106:0",
            "title": "American Woodmark Raised to Neutral From Underperform by Zelman & Assoc",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009106:0/",
            "pub_date": "2026-02-28 02:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009112:0",
            "title": "Sure, Inflation Has Cooled. But It's a Long Way From Cold, No Matter What Trump Says. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Megan Leonhardt</span></p><p class=\"\"><span>Federal Reserve officials and politicians like to trumpet the fact that inflation has cooled dramatically from its peak of nearly 9% in June 2022. But for those of us who buy groceries or pay utility bills, that's small consolation. Have you seen the price of a skirt steak, or even ground beef these days? It's enough to consider becoming a vegetarian.</span></p><p class=\"\"><span>President Donald Trump attempted to assuage consumers' concerns last Tuesday night during his State of the Union address, citing the \"roaring\" economy and plummeting prices. \"The cost of chicken, butter, food, hotels, automobiles, rent is lower today than when I took office, by a lot, and even beef, which was very high, is starting to come down significantly,\" Trump said.</span></p><p class=\"\"><span>While the president is right that prices for some items, such as eggs and gasoline, have fallen from a year ago, inflation hasn't been tamed. Official measures indicate that it's still well above the Fed's 2% annual target. Friday's release of the producer price index reading for January showed that wholesale inflation rose by a higher-than-expected 0.5% month over month.</span></p><p class=\"\"><span>The president called out the price of eggs, which he noted are down 60% from their high. While he got the direction right, the consumer price index indicates that the average price of a carton of large Grade A eggs has fallen by 48% since Trump took office in January 2025. Prices plummeted last year as a bird flu outbreak eased, but the pace of cooling has slowed in recent months.</span></p><p class=\"\"><span>Gasoline prices, which Trump also highlighted, fell significantly over the past year. Prices at the pump were $2.98, on average, this past week, according to AAA. That's down from $3.14 a year ago.</span></p><p class=\"\"><span>Trump touted that inflation averaged 1.7% in the final three months of 2025. The administration's measure, which it has used before, is based on the average of the annualized rates of the monthly CPI change during specific periods — for example, from the start of Trump's second term or in the final three months of the year.</span></p><p class=\"\"><span>Official calculations, considered standard by economists, tell a less celebratory story. The Bureau of Labor Statistics calculates the change in the consumer price index compared with one year earlier. By that measure, inflation rose 2.4% year over year in January. The Fed's preferred inflation gauge, the personal consumption expenditures price index, rose 2.9% in December, the latest data available.</span></p><p class=\"\"><span>Sticky inflation has been driven by rising prices for a range of goods and services. Beef costs, for example, rose substantially in the past year. Ground beef prices were up 22% in January from a year earlier, and steak prices rose about 12% year to year.</span></p><p class=\"\"><span>Electricity costs, which Trump didn't mention, were up 6.3% year over year in January on a seasonally adjusted basis, according to the BLS.</span></p><p class=\"\"><span>Price trends like this help to explain why surveys show that consumers remain focused on inflation, prices, and affordability. Consumer confidence improved slightly in February, but is still down by almost 9% from a year ago and remains at historically low levels, according to the latest report, released this past week.</span></p><p class=\"\"><span>Regarding the impact of tariffs, Trump said that \"there was no inflation, tremendous growth.\" But there is mounting evidence that tariffs are increasing prices, even if not by the levels that economists initially assumed. Core goods inflation was unchanged in the January CPI report, largely due to a sizable drop in used-car prices. But core goods excluding autos rose 0.36% in the month, and at a 4.4% annualized rate, according to Omair Sharif, founder of Inflation Insights.</span></p><p class=\"\"><span>Prices for household furnishings, personal-care products, and electronic devices such as computers, tablets, and smart-home assistants all rose sharply in January.</span></p><p class=\"\"><span>The Supreme Court recently struck down the tariffs that the Trump administration issued under the International Emergency Economic Powers Act, but consumers are unlikely to see any relief in prices. If refunds are issued, companies aren't likely to pass those savings along to consumers. And, the White House has already implemented workarounds to keep tariffs in place.</span></p><p class=\"\"><span>\"Trump gave no indication he would relent from his tariff agenda,\" said Thierry Wizman, global foreign-exchange and rates strategist at Macquarie Group.</span></p><p class=\"\"><span>That alone suggests consumers shouldn't expect price growth to ease soon.</span></p><p class=\"\"><span>Write to Megan Leonhardt at megan.leonhardt@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009112:0/",
            "pub_date": "2026-02-28 02:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009114:0",
            "title": "NCR Atleos Cut to Neutral From Outperform by Wedbush",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009114:0/",
            "pub_date": "2026-02-28 02:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009120:0",
            "title": "Globant Is Maintained at Hold by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009120:0/",
            "pub_date": "2026-02-28 02:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN12F:0",
            "title": "Nordic Fibreboard Q4 revenue rises",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Fibreboard producer's Q4 2025 revenue grew 14.7% yr/yr</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company's Q4 net loss widened to €580,000</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 EBITDA remained negative, impacted by planned factory shutdown</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nordic Fibreboard did not provide specific guidance for future quarters or fiscal year</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>INDUSTRIAL CLIENTS - Increased order volumes from industrial sector clients supported revenue growth in Q4 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FINNISH MARKET - Revenue growth in Q4 2025 was bolstered by sales to Finland, the largest export market</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FACTORY SHUTDOWN - Planned shutdown in December for new gas boiler house transition impacted Q4 2025 results</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>-EUR 580,000</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 EBITDA</span></p></td><td></td><td><p class=\"\"><span>-EUR 335,000</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 EBITDA Margin</span></p></td><td></td><td><p class=\"\"><span>-19%</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating Income</span></p></td><td></td><td><p class=\"\"><span>-EUR 466,000</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN12F:0-nordic-fibreboard-q4-revenue-rises/",
            "pub_date": "2026-02-28 02:58:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009122:0",
            "title": "Employment Report and Retail Sales on the Docket — Data Week Ahead",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The following are median forecasts for next week's U.S. data from a survey compiled by The Wall Street Journal.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>DATE      TIME  RELEASE                       PERIOD     CONSENSUS    PREVIOUS </span><br/><span>Monday    0945  S&amp;P Global U.S. Mfg PMI        Feb        NA           51.2* </span><br/><span>          1000  ISM Mfg PMI                    Feb        52.0   (11)  52.6 </span><br/><span>Wednesday 0815  ADP Jobs                       Feb       +50K    (5)   +22K </span><br/><span>          0945  S&amp;P Global U.S. Svcs PMI       Feb        NA           52.3* </span><br/><span>          1000  ISM Non-Mfg PMI                Feb        53.5   (9)   53.8 </span><br/><span>Thursday  0830  Jobless Claims                 Feb 28     215K   (8)   212K </span><br/><span>          0830  Import Prices                  Jan       +0.4%   (4)  +0.1% </span><br/><span>          0830  Productivity (Prelim)          4Q        +1.8%   (10) +4.9%** </span><br/><span>          0830  Unit Labor Costs (Prelim)      4Q        +2.0%   (9)  -1.9%** </span><br/><span>Friday    0830  Nonfarm Payrolls               Feb       +54K    (12) +130K </span><br/><span>          0830  Unemployment Rate              Feb        4.3%   (12)  4.3% </span><br/><span>          0830  Avg. Hourly Wages M/M***       Feb       +0.3%   (11) +0.41% </span><br/><span>          0830  Avg. Hourly Wages Y/Y***       Feb       +3.7%   (4)  +3.71% </span><br/><span>          0830  Retail Sales                   Jan       -0.4%   (10) +0.0% </span><br/><span>          0830    -- ex autos                  Jan       -0.1%   (9)  +0.0% </span><br/><span>          1000  Business Inventories           Dec       +0.1%   (3)  +0.1% </span><br/><span>          1500  Consumer Credit                Jan      +$10.0B  (5) +$24.0B </span><br/><span> </span><br/><span>*Feb Flash Reading </span><br/><span>**3Q Final Reading </span><br/><span>***All private-sector workers </span><br/><span> </span><br/><span> </span><br/><span>(Figures in parentheses refer to number of economists surveyed.) </span><br/><span> </span><br/><span>Write to Donna Huneke at dataweekahead@wsj.com </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009122:0/",
            "pub_date": "2026-02-28 02:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009125:0",
            "title": "This Innovation Could Make the Perfect Silicon Chip — and End Moore's Law — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Christopher Mims | Photography by Justin T. Gellerson for WSJ</span></p><p class=\"\"><span>Sometime in the next 15 years, the same technology that produced the world's first photograph will allow us to make the most powerful, densely packed silicon microchips allowed by physics. It will be a triumph of engineering — and the final step in the march of chip-industry progress known as Moore's Law.</span></p><p class=\"\"><span>Getting there is the multitrillion-dollar challenge the entire semiconductor industry now faces. It's so difficult that experts believe it won't happen commercially until 2040. Without this final step, electronics will only gain capability by bulking up.</span></p><p class=\"\"><span>The most valuable companies on earth are all watching this space. And that's why an innovation currently being tested at Johns Hopkins University is so interesting to them all.</span></p><p class=\"\"><span>Moore's end</span></p><p class=\"\"><span>Moore's Law says that every two years, the number of transistors packed into a microchip doubles. That can only happen so many times before there's no physical way to shrink transistors down any further — at least not on silicon wafers, which is what microchips have been made from since their inception.</span></p><p class=\"\"><span>The technology that will get us to this endpoint, photolithography, is familiar to anyone who remembers how film used to be developed: Light shines through a negative and onto a sheet of paper coated with a light-sensitive chemical, re-creating the image.</span></p><p class=\"\"><span>With chips, the precision of that \"image\" is measured in tens of atoms. A light source with a very tight wavelength, somewhere between ultraviolet light and X-rays, shines through a chip-shaped stencil and onto the silicon wafer. On the wafer's surface, a chemical substrate called a photoresist reacts to the light, and etches the stencil pattern into the silicon.</span></p><p class=\"\"><span>The most advanced version of this tech currently in use today — building the chips that go into Nvidia-powered AI supercomputers and potentially Apple's next-generation iPhones — gets to a precision of 10 nanometers, or roughly 60 silicon atoms. The final frontier of silicon etching aims to cut that down to about 5 nanometers. If it's any smaller than that, the electric current flowing through the chip just won't stay in its lanes.</span></p><p class=\"\"><span>More transistors packed into a smaller space means you get the same processing power with less energy demand — or it means for the same energy, you get more processing power. So Moore's Law has fueled both the mobile-computing revolution and the artificial-intelligence datacenter boom.</span></p><p class=\"\"><span>From camera obscura to X-ray lithography</span></p><p class=\"\"><span>The problem with etching patterns with atomically precise beams of light is that the material you shine it on also has to be atomically precise, or the pattern comes out blurry.</span></p><p class=\"\"><span>Back in the 1990s, chemists invented a weird substance called a metal-organic framework. It's a nearly perfect pattern of alternating shapes, where metal atoms hold longer carbon-based molecules in place in a sort of lattice. Best of all, it's self-organizing: Under the right conditions, it automatically forms a regular, crystalline pattern. The chemists who discovered it just won the Nobel Prize for their invention.</span></p><p class=\"\"><span>These properties make metal-organic frameworks an ideal photoresist — that chemical layer on a silicon wafer that absorbs light to create the etched pattern of transistors and connections. Another advantage of metal-organic frameworks: You can create them using a huge variety of metals and organic molecules.</span></p><p class=\"\"><span>The key to designing a photoresist? \"Making sure you have some type of regular structure that is very, very small,\" says Kayley Waltz, a fifth-year Ph.D. student at Johns Hopkins. Recently, I visited the labs of Waltz's adviser, chemical engineer Michael Tsapatsis, and Howard Fairbrother, a chemist. Together, their students and postdocs collaborated on a string of papers pioneering chip-making techniques involving metal-organic frameworks.</span></p><p class=\"\"><span>On a screen, Waltz showed me a super-magified image of a blue jay — the Johns Hopkins mascot. She etched it into silicon using the metal-organic photoresist invented by the team she led. (Waltz's success at the university landed her a job at Micron, one of the top makers of memory chips.)</span></p><p class=\"\"><span>To take advantage of the atomic precision of this new photoresist, the light beam needs to be sharpened as well. Today's cutting-edge chips with 10nm features are created using extreme ultraviolet light sources from machines made by Dutch company ASML. Each can cost up to $400 million, and is as big as a city bus. To etch features any smaller, ASML or one of its nascent competitors will have to find a way to go from extreme UV light to X-rays, which have an even tighter wavelength.</span></p><p class=\"\"><span>Barriers to commercialization</span></p><p class=\"\"><span>I spoke to three additional researchers who lauded the Johns Hopkins team for its pathbreaking work. But all of them have explored alternative photoresist chemicals that will compete to be the one semiconductor companies settle on.</span></p><p class=\"\"><span>Whichever substance will win must be compatible with existing microchip fabrication processes, because so many billions have already been invested in them, says Kaiying Wang of the University of South-Eastern Norway. \"How to adopt this process into the current, mature semiconductor industry is a challenge,\" he adds.</span></p><p class=\"\"><span>Chang-Yong Nam, a senior scientist at Brookhaven National Laboratory, says he thinks the properties of metal-organic frameworks make them an alluring candidate, though he himself is currently at work on a photoresist option that builds on current approaches.</span></p><p class=\"\"><span>Given the enormous engineering challenge of integrating metal-organic frameworks into commercial chip-making, we probably won't see it in fabs until 2040 at the earliest, says Tsapatsis of Johns Hopkins.</span></p><p class=\"\"><span>Even so, today's technological momentum is probably enough to get us there. Assuming Apple stays on its yearly cadence of device renewal, we will be on the iPhone 32 by then. Makers of smartglasses need such more powerful yet less power hungry chips. Same goes for all the AI companies, which seek computational power that doesn't add to the energy demands already threatening to drive our electricity bills higher than our mortgages.</span></p><p class=\"\"><span>Beyond 2040, if we want features on chips to become any smaller and gadgets to become more capable, we will probably have to abandon silicon altogether, according to every expert I spoke with. The good news for the Johns Hopkins team: The metal-organic frameworks they've pioneered are potentially so precise that future microchips made of graphene or other exotic materials might be patterned using them.</span></p><p class=\"\"><span>What comes after silicon microchips — pocket quantum computers, say, or transistors only an atom thick — could be as strange to people living today as microchips were in the 1960s, when Gordon Moore started laying down the law.</span></p><p class=\"\"><span>Write to Christopher Mims at christopher.mims@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009125:0/",
            "pub_date": "2026-02-28 03:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009129:0",
            "title": "Major Canadian Economic Indicators Expected Next Week",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>All dates are in ET Time. </span><br/><span> </span><br/><span>Monday, March 2, 2026                                        Exp        Prev </span><br/><span> ET/GMT </span><br/><span>0930/1430  Feb      Canada Manufacturing PMI </span><br/><span> </span><br/><span>Wednesday, March 4, 2026                                     Exp        Prev </span><br/><span> ET/GMT </span><br/><span>0815/1315  Feb      Official International Reserves </span><br/><span>                       Monetary Reserves (USD)                          +868M </span><br/><span>0830/1330  Q4       Labour productivity, hourly compensation &amp; unit labour cost </span><br/><span>0930/1430  Feb      Canada Services PMI </span><br/><span>1030/1530           Global Risk Institute (GRI) fireside chat with Bank of Canada </span><br/><span>                    Governor Tiff Macklem </span><br/><span> </span><br/><span>Thursday, March 5, 2026                                      Exp        Prev </span><br/><span> ET/GMT </span><br/><span>0830/1330  Mar      Intentions of principal field crop areas </span><br/><span> </span><br/><span>Friday, March 6, 2026                                        Exp        Prev </span><br/><span> ET/GMT </span><br/><span>1000/1500  Feb      Ivey Purchasing Managers Index </span><br/><span>                       Ivey PMI                                         47.0 </span><br/><span>                       Ivey PMI-SA                                      50.9 </span><br/><span> </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009129:0/",
            "pub_date": "2026-02-28 03:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009029:0",
            "title": "MannKind Cut to Sector Perform From Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009029:0/",
            "pub_date": "2026-02-28 02:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009034:0",
            "title": "Bank Stocks Head for Worst Day Since April — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By WSJ staff</span></p><p class=\"\"><span>Worries about AI and problems in the private-credit market hit bank stocks on Friday, sending the KBW Nasdaq Bank Index down more than 5% and headed toward its worst day since April's tariff turmoil.</span></p><p class=\"\"><span>Shares of large U.S. lenders slumped across the board, with Goldman Sachs recently leading the way with a 7.5% decline. Morgan Stanley fell 6.9%.</span></p><p class=\"\"><span>This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009034:0/",
            "pub_date": "2026-02-28 02:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0YA:0",
            "title": "Paramount expected to easily secure EU nod for Warner Bros deal, sources say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Paramount's market share below 20% in Europe, faces fewer hurdles</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Paramount open to divesting minor channels if required</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Regulatory approvals needed from US, UK, EU</span></li></ul></span></div><span><p class=\"\"><span>By Foo Yun Chee</span></p><p class=\"\"><span>    Paramount Skydance </span><span> is expected to easily gain European Union antitrust approval to buy Warner Bros Discovery </span><span> while divestments, if required to address regulatory concerns, will likely be minor, two people with direct knowledge of the matter said on Friday.</span></p><p class=\"\"><span>Unlike Netflix's </span><span> aborted bid, Paramount's offer faces fewer regulatory hurdles because a combined Paramount and Warner Bros has a market share of below 20% in all markets across Europe, the people said. They spoke anonymously because of the sensitivity of the matter.</span></p><p class=\"\"><span>European Commission antitrust regulators usually take a tough line when market share is 30% or more. Paramount has yet to formally seek EU approval, but is providing information on its businesses.</span></p><p class=\"\"><span>The deal would also require approval under the EU's foreign subsidies regulation because Saudi Arabia's Public Investment Fund, Abu Dhabi's L'imad Holding Company and the Qatar Investment Authority are also bankrolling the bid. The FSR targets unfair foreign state aid.</span></p><p class=\"\"><span>Paramount declined to comment. The Commission did not immediately respond to a request for comment.</span></p><p class=\"\"><span>PARAMOUNT OPEN TO DIVESTING MINOR CHANNELS: SOURCES</span></p><p class=\"\"><span>While Paramount hopes to secure unconditional EU approval, the company is willing to divest minor channels such as its children's brands if required, the people said. Overlapping businesses include the combination of two studios and several TV channels.</span></p><p class=\"\"><span>Paramount has Nickelodeon while Warner Bros owns the Cartoon Network.</span></p><p class=\"\"><span>Paramount will likely seek formal EU approval in the coming months, the people said, which will then kick off a 25-working-day preliminary review, which can be extended by 10 working days if remedies are offered at the end of the 25 days.</span></p><p class=\"\"><span>California may be the biggest obstacle to the deal. Regulatory approvals from the U.S. and UK are also key deal requirements.</span></p><p class=\"\"><span>Paramount has been on the charm offensive in Europe since January, with CEO David Ellison meeting French President Emmanuel Macron that month while Chief Legal Officer Makan Delrahim met the European Commission's top merger official Guillaume Loriot that same week, the people said.</span></p><p class=\"\"><span>Delrahim is well-acquainted with Loriot from his previous stint as assistant attorney general at the U.S. Department of Justice's antitrust division.</span></p><p class=\"\"><span>European Parliament lawmaker Andreas Schwab, who has criticised Netflix's bid and led the negotiations in several pieces of tech legislation in recent years and also met Delrahim last month, said a Paramount bid poses fewer issues.</span></p><p class=\"\"><span>\"I think Paramount is something we could accept. It is a concentration in the production of films. There is no risk of a digital champion taking over the video streaming market,\" he said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0YA:0-paramount-expected-to-easily-secure-eu-nod-for-warner-bros-deal-sources-say/",
            "pub_date": "2026-02-28 02:41:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009042:0",
            "title": "Arbe Robotics Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009042:0/",
            "pub_date": "2026-02-28 02:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}