{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1MW:0",
            "title": "Centene falls on higher Q4 Medicaid costs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of health insurer Centene  fall 3.50% to $62.55 </p><p class=\"\">** Co reports Q4 medical loss ratio - the percentage of premiums spent on medical care - of 93.4% in its Medicaid business </p><p class=\"\">** Costs for health insurers which offer Medicaid plans for lower income individuals have been elevated due to an influx of sicker patients after the end of pandemic era policy</p><p class=\"\">** \"We think the stock reaction reflects the fact that the core Medicaid medical loss ratio came in worse than expected in Q4\"- Stephens analyst Scott Fidel </p><p class=\"\">** Co however beats Q4 adj.profit estimates helped by a settlement related to its plans it offers through the Affordable Care Act</p><p class=\"\">** Reports Q4 adj.profit of 80 cents per share, beating estimates of 49 cents per share as per data compiled by LSEG </p><p class=\"\">** Co leaves its forecast of adj. 2025 profit of greater than $7.25 per share unchanged</p><p class=\"\">** CNC fell 18.4% in 2024 </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1MW:0-centene-falls-on-higher-q4-medicaid-costs/",
            "pub_date": "2025-02-05 00:13:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0SA:0",
            "title": "COMMENT-RBA, tariff risks still plague AUD/USD despite bullish techs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    AUD/USD rallied above the 21-day moving average and struck a 2-session high Tuesday but the pair's upside may be limited due to threats from RBA rate cuts and ongoing U.S.-China trade tensions.</p><p class=\"\">Australia price increases cooled according to Q4 CPI data which helped send interest rates broadly lower as investors pulled forward expectations for rate cuts to begin with the February 18 decision priced at 82% probability for a 25bps cut.</p><p class=\"\">Trade tensions escalated as China retaliated on the U.S. by imposing tariffs of 15% and 10% on selected imports, but U.S. President Donald Trump and Chinese President Xi Jinping are expected to hold a call, which could defuse the situation. </p><p class=\"\">Should an agreement be reached, riskier assets and AUD/USD could rally sharply.</p><p class=\"\">An AUD/USD rally would validate technical signals highlighting upside risks.</p><p class=\"\">Daily and monthly RSIs are rising after they diverged on the 58-month low struck Monday.</p><p class=\"\">A monthly bull hammer has formed and two consecutive daily bull hammers have been put in place.</p><p class=\"\">The monthly bull hammer formed after the 76.4% Fibo of the 0.5510-0.8007 rally was pierced. That Fibo is frequently a retracement level where existing trends reverse.</p><p class=\"\">AUD/USD bulls may be rewarded handsomely if trade tensions ease and the RBA leans less dovish than rate markets expect.</p><p class=\"\">For more click on </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:672.6744186046511px;aspect-ratio:1.121124031007752\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0SA-b78413e548cc28ea40c3eba5afc647e5-resized.webp\" type=\"images/webp\"/><img alt=\"audusd\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0SA-b78413e548cc28ea40c3eba5afc647e5-resized.jpeg\" style=\"background-color:#e3e3e3\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">audusd</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0SA:0-comment-rba-tariff-risks-still-plague-aud-usd-despite-bullish-techs/",
            "pub_date": "2025-02-05 00:13:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0KE:0",
            "title": "Aon: D&O price declines decelerate slightly sequentially to 10.6% in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Aon’s latest US D&amp;O pricing index shows the average price per million decreased by 10.6 percent year on year in Q4, which was a slight sequential deceleration from the 11.1 percent drop in the third quarter of 2024.</p><p class=\"\">The pricing index decreased to 1.26 from 1.41 in the prior-year quarter.</p><p class=\"\">The decrease in Q4 2024 marked the 11th consecutive quarterly year-on-year price decrease, following a period of 17 quarterly pricing increases over the prior four years.</p><p class=\"\">However, Aon believes a better comparison is to look at only those programs that renewed in both the fourth quarters of 2024 and 2023. On that basis, pricing decreased 4.3 percent.</p><p class=\"\">Primary policy pricing down 3.5%</p><p class=\"\">The broker also said that looking at only primary policies in the quarter that renewed with the same limit and deductible as the prior year eliminates some “noise” and focuses only on those policies that renewed on a “like-for-like” basis. </p><p class=\"\">The overall price change for primary policies renewing with the same limit and deductible in the fourth quarter was down 3.5 percent. The average price decrease was 8 percent, while the average price increase was 10 percent. </p><p class=\"\">In the fourth quarter 60 percent of primary policies received a price decrease, 29 percent of policies renewed “flat” and 11 percent of companies received a price increase. </p><p class=\"\">Aon also noted that 95 percent of primary policies renewed with the same limit in Q4 2024, and 91 percent of policies renewed with the same deductible. </p><p class=\"\">Historically, the percentage of clients renewing with the same limit was in the mid- to high 90s, and the percentage of clients renewing with the same deductible was in the low to mid-90s.</p><p class=\"\">“Concurrently with the primary layer rate increases that started in first-quarter 2018, the percentage of clients renewing with both the same limit and deductible had been dropping steadily,” Aon said.</p><p class=\"\">“After bottoming out in third-quarter 2020, that percentage has returned to more historical levels. For the fourth quarter of 2024, 88 percent of clients renewed with the same limit and deductible as the prior-year quarter,” it continued.</p><p class=\"\">Despite movements in limit and deductible levels, 97 percent of primary policies renewed with the same carrier in Q4 2024.</p><p class=\"\">On average, primary policies that renewed with the same limit, deductible and carrier experienced a 3.8 percent premium decrease in Q4.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0KE:0-aon-d-o-price-declines-decelerate-slightly-sequentially-to-10-6-in-q4/",
            "pub_date": "2025-02-05 00:14:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008357:0",
            "title": "Palantir Shares Surge to All-Time High as Growth, Outlook Upstages Competitors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">Shares of Palantir Technologies hit an all-time high after the company's earnings blew past Wall Street's expectations and the company showed it's on track for stronger growth than some of its competitors.</p><p class=\"\">The stock climbed 25% to $104.98 after touching a record high of $106.91 on Tuesday morning, making it the best performer on the S&amp;P 500 and Nasdaq 100. The shares are on pace for their largest percentage increase in a year, and the stock has seen an almost five-fold increase in price in the last 52 weeks.</p><p class=\"\">Palantir's earnings showed no signs of growth deceleration heading into 2025, outshining Microsoft and ServiceNow's forecasts. The artificial intelligence company expects revenue to expand roughly 36% in the first quarter, on par with growth in the fourth quarter.</p><p class=\"\">Competitors, by contrast, posted mixed results and saw their stock prices fall after reporting results last week. Microsoft's earnings beat analysts' expectations, but declining growth in its Azure cloud infrastructure unit gave investors pause. ServiceNow forecast slightly slower revenue growth in its first quarter compared with a 21% rise in the fourth quarter.</p><p class=\"\">Palantir's U.S. revenue was one of its best performing metrics with a 52% increase, and the company expects the same level of growth this year. Business in the U.S. has nearly five times the number of commercial customers compared with three years ago and is still growing, Chief Revenue and Legal Officer Ryan Taylor said. Palantir also signaled that any boost from the Trump administration's Department of Government Efficiency wasn't included in its 2025 guidance, UBS analysts led by Karl Keirstead said in a note.</p><p class=\"\">Palantir's pricing structure may help insulate it from any AI price deflation from falling model costs related to DeepSeek, the UBS analysts said.</p><p class=\"\">The company said it has been ready for the affect that a cost-efficient AI product like DeepSeek would have on the market. For the past two years, Palantir has argued that open- and closed-source AI models are becoming more similar and performance will eventually converge, Chief Technology Officer Shyam Sankar said.</p><p class=\"\">\"With the release of DeepSeek R1, that has gone from a contrarian position to consensus,\" Sankar said.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008357:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309043:0",
            "title": "Novo Nordisk on Lookout for Next-Generation Obesity Drug Candidates, The Wall Street Journal Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309043:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008356:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beijing's Retaliation Intensifies Trade War With U.S.</strong></p><p class=\"\">China's tariff increases and other countermeasures were mostly symbolic and apparently designed to project strength while leaving the door open to talks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Job openings fall close to 4-year low. Finding work gets harder.</strong></p><p class=\"\">It's gotten harder for the unemployed to find work. Job openings in the U.S. fell at the end of 2024 to the second-lowest level since the end of the pandemic</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Rise Despite Tariff Concerns</strong></p><p class=\"\">U.S. stocks staged a small recovery despite China's retaliation against the new U.S. tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RFK Jr. Clears Committee Vote, Putting Him on Track to Become Health Secretary</strong></p><p class=\"\">The committee was scheduled to vote on Tuesday morning.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Antitrust Shouldn't Become Trade War Weapon, EU Says</strong></p><p class=\"\">Competition enforcement is not a tool to be used in trade disputes, the European Commission said after U.S. tariffs triggered a tit-for-tat reaction from China.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says</strong></p><p class=\"\">European officials need to manage diplomatic negotiations in a more volatile geopolitical environment, the commission president said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</strong></p><p class=\"\">Digital-asset prices slid after Beijing said it would hit back with levies of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">India's Budget Plots Path for Sustainable Growth</strong></p><p class=\"\">Focus now turns to policy execution, with economists watching to see if policymakers can deliver on their aim of supporting growth without sacrificing fiscal prudence or financial stability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008356:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008355:0",
            "title": "News Highlights: Top Financial Services News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Direct Lenders Face Rising Default Risks, Analysis Firm KBRA Says</strong></p><p class=\"\">Highly leveraged middle-market borrowers with worsening business performance face higher default risks unless rates drop and asset sale activities recover.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Raiffeisen Swings to Loss on Provision, Deconsolidation</strong></p><p class=\"\">The lender has been contending with a provision booked through its Russian subsidiary and the deconsolidation of Belarusian assets.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BNP Paribas Earnings Grow; Raises Dividend</strong></p><p class=\"\">The lender intends to buy back more than 1 billion euros worth of shares after posting an earnings rise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS to Boost Buybacks as Net Profit Beats Expectations</strong></p><p class=\"\">The group plans to repurchase $1 billion of its stock in the first half and buy back up to an additional $2 billion in the second.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Services Roundup: Market Talk</strong></p><p class=\"\">Find insight on BNP Paribas, UBS, Kasikornbank and more in the latest Market Talks covering Financial Services.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Vanguard Is Delivering Its Biggest Fee Cut Ever. New CEO Salim Ramji Explains Why.</strong></p><p class=\"\">The asset manager says the move at 87 funds will save investors $350 million this year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bessent Takes Helm of Consumer Finance Watchdog, Orders Halt to Work</strong></p><p class=\"\">Treasury Secretary Scott Bessent is ordering a freeze to work at the Consumer Financial Protection Bureau, after being named its acting director by President Trump</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008355:0-news-highlights-top-financial-services-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008354:0",
            "title": "News Highlights: Top Energy News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil prices fall after U.S. imposes tariffs on China, Beijing retaliates</strong></p><p class=\"\">Oil futures fell Tuesday as the U.S. implemented an additional 10% tariff on China imports and Beijing retaliated with measures of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV's Net Profit Rises Despite Weak Refining Margins</strong></p><p class=\"\">The oil-and-gas company's refining margin fell to $5.9 a barrel, compared with $9.9 a barrel a year ago.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Find insight on OMV, Origin Energy, Galp Energia and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Won't Sink Canadian Oil Companies</strong></p><p class=\"\">The U.S. has become reliant on their crude, and Canada has ways to limit any financial hit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Shell Keeps $3.5 Billion Buyback Amid Earnings Miss</strong></p><p class=\"\">The oil-and-gas company's adjusted earnings fell more than expected, weighed by lower oil prices and refining margins.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008354:0-news-highlights-top-energy-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008353:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Merck Shares Hit After Guidance Falls Short, Gardasil Challenge</strong></p><p class=\"\">The drugmaker's guidance was affected by a pause in shipments of its top-selling vaccine to China from February through at least the middle of the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Okta to Cut 3% of Workforce to Reallocate Resources Toward Growth Priorities</strong></p><p class=\"\">The digital identity verification provider will recognize $11 million in restructuring charges during the fourth quarter, which will primarily be paid in the first quarter of fiscal 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novartis Sets High Bar in Pursuit of Obesity Deals, CEO Says</strong></p><p class=\"\">The Swiss pharmaceutical company has set a high bar for any potential obesity-treatment acquisition as it scans the market for deals to fill its drug pipeline and power sales growth into the 2030s, CEO Vas Narasimhan said in an interview.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PepsiCo Revenue Slips on Volume Drop for Frito-Lay, Quaker</strong></p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estée Lauder to Cut Up to 7,000 Jobs</strong></p><p class=\"\">The cosmetics company has been struggling with weak demand, especially in Asia.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fox Plans to Launch New Streaming Service by Year-End</strong></p><p class=\"\">The offering, which will include news and sports content, is the company's biggest foray yet into subscription streaming.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Stock Rises on Fourth-Quarter Earnings Beat and Reaffirmed Guidance</strong></p><p class=\"\">CEO Albert Bourla says Pfizer has met the strategic goals it had set for itself in 2024, and that it was 'executing transformative changes.'</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Archer Daniels Midland laying off up to 700 in face of uncertain profit</strong></p><p class=\"\">The company says 2025 guidance reflects \"weaker\" market view on biofuel and trade-policy turmoil.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Spotify Reports First Full-Year Profit</strong></p><p class=\"\">Price increases and cost discipline helped the audiostreaming giant pivot from heavy spending on growth to sustained profits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008353:0-news-highlights-top-company-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008360:0",
            "title": "Here's What Could Cost More Under Trump's Tariffs on China — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joseph De Avila</p><p class=\"\">President Trump's 10% tariff on all Chinese goods could lead to more expensive goods for a host of products sold in the U.S., including electronics, apparel and medicine. Here's some items that could see higher prices.</p><p class=\"\">Smartphones: While previously exempt from earlier tariffs imposed during the first Trump administration and the Biden administration, smartphones would now be more expensive due to the across-the-board 10% tariff on Chinese-made goods.</p><p class=\"\">Tools: Tools made in China such as sledgehammers already have a 25% import tariff upon arrival in the U.S. An additional tariff will raise costs for importers and possibly pass through to stores and consumers.</p><p class=\"\">Toys: More than 80% of toys sold in the U.S. are made in China, according to the Toy Association, an industry group. A 10% import tariff on Chinese goods would raise the retail price of Tonka trucks from about $29.99 today to between $34.99 and $39.99, according to Basic Fun, the toy's manufacturer.</p><p class=\"\">Prescription Drugs: The U.S. imported $6 billion worth of pharmaceutical products from China in 2023, according to Trading Economics. Generic manufacturers rely on a global supply chain to make their medicines and will be squeezed to absorb new costs, said the Association for Accessible Medicines, which represents generic pharmaceutical manufacturers. Tariffs will make pharmaceutical production even harder, it said.</p><p class=\"\">Groceries: China imports a wide variety of food into the U.S. including fruits and vegetables, meat and cereals. Tariffs will lead to higher prices for food that will pass to shoppers, said FMI, the Food Industry Association.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008360:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008361:0",
            "title": "Dycom Is Maintained at Strong Buy by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:15 GMT) </strong>Dycom Price Target Raised to $215.00/Share From $210.00 by Raymond James</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008361:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_AQN2K0IE4:0",
            "title": "Table-Non-competitive bids for U.S. 42-day cash management bills",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 4 (Reuters) - Below are results from non-competitive bids on U.S. 42-Day Cash Management Bills</p><p class=\"\">Security              42-day cash management billsIssue Date            Feb 06, 2025CUSIP                 912797KJ5Maturity Date         March 20, 2025Offering Amount     $85,000,000,000Non Comps Accepted     $348,666,000Tentative Tendered*    $348,666,000Approximate Comp Remaining     $84,651,334,000SOMA Tendered**                  $0</p><p class=\"\">*Total of Non-comps accepted and FIMA**SOMA - Bids from Federal Reserve in the System Open Market Account</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_AQN2K0IE4:0-table-non-competitive-bids-for-u-s-42-day-cash-management-bills/",
            "pub_date": "2025-02-05 00:15:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSsrGbGa:0",
            "title": "Valsoft Enters the Latin American Market with the Acquisition of VHL Sistemas",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pioneering cloud-based solutions for notary management across Brazil</p><p class=\"\">MONTREAL, QC / ACCESS Newswire / February 4, 2025 / Valsoft Corporation Inc. (\"Valsoft\"), a Canadian company specializing in the acquisition and development of vertical market software businesses, is pleased to announce its first acquisition in Latin America with the purchase of VHL Sistemas Ltda (VHL Sistemas), a leading provider of cloud-based notary management solutions.</p><p class=\"\">Based in Brazil, VHL Sistemas has established itself as a trusted name in the notary space, delivering cutting-edge technology to optimize productivity, enhance usability, and ensure information security. Its flagship platform, Asgard, has set a benchmark for operational efficiency, enabling transparency and security for notaries and their clients across the region.</p><p class=\"\">\"This acquisition marks an exciting milestone for Valsoft as we expand into Latin America,\" said Costa Tagalakis, Investment Partner at Valsoft. \"VHL Sistemas represents everything we look for in a company-a strong product, an innovative approach, and a highly experienced management team. We are thrilled to partner with them to further enhance their offerings and grow their presence across Brazil.\"</p><p class=\"\">\"For the past decade, VHL Sistemas has led innovation in the Brazilian notary sector,\" said Jonathan Cleiton Alves, Partner and CEO of VHL. \"Joining forces with Valsoft represents an exciting new chapter, as we leverage their resources and expertise to accelerate innovation, strengthen our solutions, and expand our impact, while continuing to simplify complex processes and ensure efficiency and security for our clients.\"</p><p class=\"\">This acquisition not only signifies Valsoft's entry into the dynamic Latin American market, with a strong base in Brazil, but also underscores its commitment to fostering growth and innovation in vertical market software. Valsoft is excited to work with VHL Sistemas leadership team to strategically focus on geographic expansion and further strengthening VHL's position as a leader in its field.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About VHL Sistemas</strong></p><p class=\"\">Founded in 2015, VHL Sistemas specializes in creating advanced technological solutions tailored to the notary sector. Their cloud-based solutions, including the flagship Asgard platform, are designed to optimize productivity, enhance usability, and provide unparalleled information security. VHL is committed to fostering an environment of security, authenticity, and transparency for its clients and employees. For more information, visit: https://vhlsistemas.com.br/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Valsoft</strong></p><p class=\"\">Valsoft acquires and develops vertical market software companies that deliver mission-critical solutions. A key tenet of Valsoft's philosophy is to invest in established businesses and foster an entrepreneurial environment that shapes a company into a leader in its respective industry. Unlike private equity and VC firms, Valsoft does not have a predefined investment horizon and looks to buy, hold, and create value through long-term partnerships with existing management and customers. Learn more at www.valsoftcorp.com.</p><p class=\"\">Valsoft was represented internally by Oliver Gray (Senior Legal Counsel), David Felicissimo (General Counsel), and Elisa Marcon (Corporate Paralegal). Externally, Valsoft was represented by Lefosse Advogados. VHL Sistemas was represented by Píer Partners and Teixeira Freire Advogados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media contact information</strong>:</p><p class=\"\">Communications and Public Relations</p><p class=\"\">Valsoft Corporation</p><p class=\"\">communication@valsoftcorp.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Valsoft Corporation</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSsrGbGa:0/",
            "pub_date": "2025-02-05 00:15:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309023:0",
            "title": "BlackBerry Completes Sale of Cylance Assets to Arctic Wolf",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BlackBerry  and Arctic Wolf said that Arctic Wolf has completed the acquisition of BlackBerry's Cylance endpoint security assets. </p><p class=\"\">Under the terms of the transaction, announced in December, BlackBerry will receive $160 million in cash and about 5.5 million Arctic Wolf shares. </p><p class=\"\">Shares of BlackBerry were up 4.5% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309023:0/",
            "pub_date": "2025-02-05 00:05:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:cb63fb7c6094b:0",
            "title": "Spotify Beats Q4 Estimates, Raises Forecasts as User Growth Accelerates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spotify  shares soared 9.82% to $603 as of 10:55 a.m. ET Tuesday after the company reported better-than-expected Q4 earnings and raised guidance for the current quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Q4 Earnings &amp; Growth Highlights</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net income: 367 million (1.76 per share) vs. 70 million loss (0.36 per share) YoY</li><li class=\"listItem-bmN0_SHH\">Total revenue: 4.24 billion (+16% YoY), beating consensus of 4.16 billion</li><li class=\"listItem-bmN0_SHH\">Total MAUs: 675 million (+12% YoY), exceeding Bloomberg estimate of 664.94 million</li><li class=\"listItem-bmN0_SHH\">Premium subscribers: 263 million (+11% YoY), above estimates of 259.99 million</li><li class=\"listItem-bmN0_SHH\">Average revenue per premium user: 4.85, up 5% YoY</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Upbeat Q1 2025 Guidance</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Total MAUs: 678 million, surpassing Bloomberg's estimate of 677.71 million</li><li class=\"listItem-bmN0_SHH\">Revenue forecast: 4.2 billion, ahead of the 4.18 billion consensus</li><li class=\"listItem-bmN0_SHH\">Gross margin: 31.5% vs. 31.2% expected</li><li class=\"listItem-bmN0_SHH\">Premium subscribers: 265 million, exceeding expectations of 259.27 million</li><li class=\"listItem-bmN0_SHH\">Operating income: 548 million, beating analysts' projection of 460.1 million</li></ul><p class=\"\">Spotify's strong user and revenue growth boosted investor confidence, driving shares higher as the company continues expanding its premium subscriber base and improving profitability.</p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:cb63fb7c6094b:0-spotify-beats-q4-estimates-raises-forecasts-as-user-growth-accelerates/",
            "pub_date": "2025-02-05 00:05:58",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "barchart:12019ead6094b:0",
            "title": "Lean Hog Futures Prices Were Hit Hard by the U.S.-Mexico Trade Row. Will Hog Bulls Again Show Resilience?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">April lean hog <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/quotes/HEJ25\" rel=\"nofollow\" target=\"_blank\">(HEJ25)</a> futures prices dropped the <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/story/news/30746212/hogs-go-limit-down-as-tariff-fever-takes-hold\" rel=\"nofollow\" target=\"_blank\">daily permissible trading limit of $4.00</a> a hundredweight on Monday following weekend news that President Donald Trump’s administration was set to <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/story/news/30737606/trump-agrees-to-pause-tariffs-on-canada-and-mexico-after-they-pledge-to-boost-border-enforcement\" rel=\"nofollow\" target=\"_blank\">implement new tariffs</a> on its major trading partners, including Mexico. The specter of reduced U.S. pork shipments to Mexico, which accounts for over 25% of total U.S. pork exports, would likely lead to more abundant domestic pork supplies and drive hog prices lower in the coming months.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:877.9026217228464px;aspect-ratio:1.463171036204744\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-06c5d107d0b55e9aba6f43a673cbc03a-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-06c5d107d0b55e9aba6f43a673cbc03a-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></p><p class=\"\">Just last week, April lean hog futures hit a seven-week high of $92.75, which is just shy of the contract high of $93.60 scored in December of last year. However, last Friday, hog futures traders began to sense new trade tariffs on Mexico, Canada and China were not going to be avoided and prices dropped sharply. Then came Monday’s limit-down trading action. On Tuesday, lean hog futures have an expanded daily trading limit of $6.00</p><p class=\"\">On Monday morning, Trump and Mexican President Claudia Sheinbaum agreed to delay any new tariffs until March 1. However, the U.S. maintained its tariffs against China that took effect Tuesday. China, also a U.S. pork importer, immediately launched targeted tariffs in what is being called a controlled retaliation. China’s limited response to the U.S. duty of an additional 10% tariff on all Chinese imports underscores the attempt by Chinese officials to engage in talks that could avert an all-out U.S.-China trade war. China’s new tariffs against the U.S. will not take effect until Feb. 10, giving both parties time to try and reach a deal. Trump said he will speak with Chinese leader Xi Jinping in the next few days. </p><p class=\"\">Hog traders will continue to closely monitor the Trump trade tariff situation, which remains very fluid.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Hog Market Bulls Have Been Tough When the Going Gets Rough</strong></p><p class=\"\">The lean hog futures market bulls in recent months have shown keen price-rebounding resilience during significant price setbacks. Such could be the case again following what may turn out to be just a knee-jerk overreaction to the Trump tariff threats.</p><p class=\"\">On the positive fundamental side of the lean hog futures and cash hog (HEY00) markets, futures prices have been supported by continued strength in the CME Lean Hog Index. The latest CME index is up $0.29 to $83.77 as of Feb. 3. The cash index has gained $3.34 from the seasonal low scored on Jan. 9. Pork cutout (KMG25) value has also been climbing, despite cutout falling $0.94 to $93.81 on Monday amid the limit-down trade in hog futures.</p><p class=\"\">Last week’s U.S. hog slaughter was estimated at 2.574 million head, which is a 4.5% decline from last year at the same time. Combined with the week prior’s large year-over-year reduction in slaughter, it suggests that hog supplies are tighter than the USDA projected in its December quarterly hogs and pigs report. The agency at that time reported there were 75.8 million hogs and pigs on U.S. farms, up 1% from December 2023, but down slightly from Sept. 1, 2024.</p><p class=\"\">Seasonally, the hog market has had a pattern of price gains into mid- to late-February from annual lows in late December or early January. Also, the late Easter holiday this year may keep retailers and packing plants buying hams for Easter dinner through early March. </p><p class=\"\">The cash hog and futures markets are likely to be significantly influenced by price action in the cash cattle (GFY00) (LEY00) and futures markets in the coming weeks. Last week, live (LEJ25) and feeder cattle (GFH25) futures markets hit record highs, as did the weekly average cash cattle price. If the cattle markets have or are close to posting major peaks, retailers may decide to pass on to consumers their increased costs for wholesale beef. That could create better consumer-substitution demand for pork at the meat counter. This could buy the hog market bulls some more time until the grilling season begins in late spring and consumer demand for pork rises.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:887.1859296482412px;aspect-ratio:1.4786432160804022\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-b999e7d295530ce0d83ac5acfa66cd1f-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-b999e7d295530ce0d83ac5acfa66cd1f-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trading Late This Week Likely Will be Extra Important</strong></p><p class=\"\">As of this writing Tuesday morning, April lean hog futures prices were posting a decent rebound from Monday’s limit-down trade. How the lean hog futures market closes on Friday (prices near the weekly high or near the weekly low) may be a good indicator for price-trending direction during the rest of February.</p><p class=\"\"><em>On the date of publication, Jim Wyckoff did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policyhere. </em></p><p class=\"\"> More news from Barchart </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cattle and Hogs in Q4 and 2024 - Where are they Heading in 2025?</li><li class=\"listItem-bmN0_SHH\">Where are Animal Protein Prices Heading as the Offseason for Demand Approaches?</li><li class=\"listItem-bmN0_SHH\">Where are Animal Proteins Prices Heading in Q3 and Beyond?</li><li class=\"listItem-bmN0_SHH\">Can the Meats Rally During the Peak Season in 2024?</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/barchart:12019ead6094b:0-lean-hog-futures-prices-were-hit-hard-by-the-u-s-mexico-trade-row-will-hog-bulls-again-show-resilience/",
            "pub_date": "2025-02-05 00:06:06",
            "source": "Barchart",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008298:0",
            "title": "United Airlines Is Maintained at Positive by Susquehanna",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:07 GMT) </strong>United Airlines Price Target Raised to $130.00/Share From $120.00 by Susquehanna</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008298:0/",
            "pub_date": "2025-02-05 00:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX7094gC:0",
            "title": "Canadian Large Cap Leaders Split Corp. Completes Preferred Share Private Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em>[Not</em> <em>for</em> <em>distribution</em> <em>to</em> <em>U.S.</em> <em>newswire</em> <em>services</em> <em>or</em> <em>for</em> <em>dissemination</em> <em>in</em> <em>the</em> <em>United</em><em> States</em><em>.]</em></p><p class=\"\">TORONTO, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">(TSX: NPS, NPS.PR.A)</strong> – Canadian Large Cap Leaders Split Corp. (the “Company”) is pleased to announce that it has completed the previously announced private placement of its preferred shares for aggregate gross proceeds of approximately $2.5 million (the “Private Placement”). Pursuant to the Private Placement, 235,000 preferred shares were offered to investors at a price of $10.65 per preferred share.</p><p class=\"\">The Company’s previously announced split of its Class A shares (the “Share Split”) will be effected at the close of business today. Following the Share Split, there will be approximately 1,795,547 Class A shares and 1,796,353 preferred shares outstanding. DBRS has confirmed that the rating of the preferred shares will continue to be Pfd-3 (high) following the completion of the Share Split.</p><p class=\"\">The Company invests, on an approximately equally-weighted basis, in a portfolio comprised primarily of equity securities of Canadian Dividend Growth Companies (as defined below), selected by the portfolio manager, that at the time of investment and immediately following each periodic reconstitution and rebalancing: (i) are listed on a Canadian exchange; (ii) pay a dividend; (iii) generally have a market capitalization of at least $10 billion; (iv) have options in respect of its equity securities that, in the opinion of the portfolio manager, are sufficiently liquid to permit the portfolio manager to write options in respect of such securities; and (v) have a history of dividend growth or, in the portfolio manager’s view have high potential for future dividend growth (“Canadian Dividend Growth Companies”).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About</strong> <strong class=\"root-Tkn6WL2y\">Ninepoint Partners LP</strong></p><p class=\"\">Ninepoint Partners LP is the Manager, Portfolio Manager and Promoter of the Company and provides all administrative services required by the Company. Based in Toronto, Ninepoint Partners LP is one of Canada’s leading alternative investment management firms overseeing approximately $7 billion in assets under management and institutional contracts. Committed to helping investors explore innovative investment solutions that have the potential to enhance returns and manage portfolio risk, Ninepoint offers a diverse set of alternative strategies spanning Equities, Fixed Income, Alternative Income, Real Assets, F/X and Digital Assets.</p><p class=\"\">For more information on Ninepoint Partners LP, please visit www.ninepoint.com or please contact us at 416.362.7172 or 1.888.362.7172 or invest@ninepoint.com.</p><p class=\"\">You will usually pay brokerage fees to your dealer if you purchase or sell shares of investment funds on the TSX or another alternative Canadian trading <em>system</em> <em>(an “exchange”). If shares</em> <em>are</em> <em>purchased</em> <em>or</em> <em>sold</em> <em>on an exchange,</em> <em>investors</em> <em>may pay more</em> <em>than the current net asset</em> <em>value when</em> <em>buying shares</em> <em>of the</em> <!-- -->investment fund and may receive less than the current net asset value when selling them.</p><p class=\"\">There are ongoing fees and expenses associated with owning shares of an investment fund. <!-- -->An investment fund must prepare disclosure documents that <em>contain key information about the fund.</em> <!-- -->You can find more detailed information about the Company in the public filings available at <em>www.sedarplus.ca.</em> <em>Investment</em> <!-- -->funds are not guaranteed, their values change frequently and past performance may not be repeated.</p><p class=\"\">Certain statements contained in this document constitute forward-looking information within the meaning of Canadian securities laws. Forward-looking <em>information may relate to matters</em> <!-- -->disclosed in this document and to other matters identified in public filings relating to the Company, to the future outlook of the <!-- -->Company and anticipated events or results and may include statements regarding the future financial performance of the Company. In some cases, forward-looking <!-- -->information can be identified by terms such as “may”, “will”, “should”, “expect”, “plan”, “anticipate”, “believe”, “intend”, “estimate”, “predict”, <!-- -->“potential”, “continue” or other similar expressions concerning matters that are not historical facts. Actual results may vary from such forward-looking <em>information.</em> <!-- -->Investors should not place undue reliance on forward-looking statements. <!-- -->These forward-looking statements are made as of the date hereof <!-- -->and we assume no obligation to update or revise them to reflect new events or circumstances.</p><p class=\"\"><em>The securities have not</em> <em>been registered under</em> <em>the U.S. Securities</em> <em>Act of 1933, as</em> <em>amended, and may not</em> <em>be offered or</em> <em>sold in</em> <em>the United</em> <em>States</em> <em>absent</em> <!-- -->registration or any applicable exemption from the registration requirements. This news release does not constitute an offer to sell or the solicitation of an <!-- -->offer to buy securities nor will there be any sale of such securities in any state in which such offer, solicitation or sale would be unlawful.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX7094gC:0-canadian-large-cap-leaders-split-corp-completes-preferred-share-private-placement/",
            "pub_date": "2025-02-05 00:07:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309029:0",
            "title": "Update: Aya Gold & Silver Expands Boumadine Project in Morocco",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Adds analyst comment and updates shares.)</p><p class=\"\">Aya Gold &amp; Silver  on Tuesday said it expanded its Boumadine project in Morocco by 28% after securing the right to four additional mining licenses. </p><p class=\"\">The four licenses totaled 59.9 square kilometers, increasing the property's size to more than 272 square kilometers. </p><p class=\"\">The company also secured the rights to a 600 square-kilometer exploration authorization, allowing it to carry out exploration activities over any unclaimed land within the authorized area. </p><p class=\"\">\"Over the past 15 months we have increased our footprint at Boumadine by 848%, aligning with our vision to consolidate ground around this world-class asset,\" said Benoit La Salle, Aya's chief executive. </p><p class=\"\">Aya completed 17,034 meters of drilling at Boumadine in January, with over 30,000 assays pending. </p><p class=\"\">\"By systematically applying advanced technology and modern exploration techniques, we will continue to generate drill targets potentially leading to a significant resource increase at Boumadine and driving further growth in the near future,\" La Salle added. </p><p class=\"\">National Bank of Canada kept its outperform rating and $21.25 price target im place following the update. </p><p class=\"\">The bank cited Aya's promising pipeline prospect in Boumadine with ongoing exploration, and noted that the company is only the only pure-play silver producer in its coverage. </p><p class=\"\">Aya's shares were last seen up $0.25 to $11.99 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309029:0/",
            "pub_date": "2025-02-05 00:07:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008163:0",
            "title": "RFK Jr.'s Health Secretary Nomination Moves Forward to a Senate Vote — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis</p><p class=\"\">The Senate's finance committee voted Tuesday to favorably refer Robert F. Kennedy Jr.'s nomination to serve as Secretary of Health and Human Services to a vote of the full Senate, moving him a big step closer to confirmation.</p><p class=\"\">Health care stocks fell slightly following the vote. The Health Care Select Sector SPDR fund was down 0.9% Wednesday.</p><p class=\"\">This is breaking news. Check back for more analysis soon.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008163:0/",
            "pub_date": "2025-02-05 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008304:0",
            "title": "PayPal's Branded Checkout Button Getting More Usage — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008304:0/",
            "pub_date": "2025-02-05 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008311:0",
            "title": "Outbrain Up Over 9%, on Pace for Largest Percent Increase Since March 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Outbrain, Inc. (OB) is currently at $6.39, up $0.56 or 9.61%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Jan. 23, 2025, when it closed at $6.43</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since March 2, 2023, when it rose 16.28%</li><li class=\"listItem-bmN0_SHH\">Snaps a four day losing streak</li><li class=\"listItem-bmN0_SHH\">Down 11% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 68.13% from its all-time closing high of $20.05 on Aug. 9, 2021</li><li class=\"listItem-bmN0_SHH\">Up 54.72% from 52 weeks ago (Feb. 6, 2024), when it closed at $4.13</li><li class=\"listItem-bmN0_SHH\">Down 15.92% from its 52-week closing high of $7.60 on Dec. 24, 2024</li><li class=\"listItem-bmN0_SHH\">Up 84.15% from its 52-week closing low of $3.47 on March 1, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $6.51; highest intraday level since Jan. 22, 2025, when it hit $6.64</li><li class=\"listItem-bmN0_SHH\">Up 11.66% at today's intraday high; largest intraday percent increase since March 2, 2023, when it rose as much as 16.74%</li></ul><p class=\"\">All data as of 11:01:28 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008311:0/",
            "pub_date": "2025-02-05 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309036:0",
            "title": "Latin Metals Reports La Flora Assay Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Latin Metals  on Tuesday reported recent exploration results at La Flora project, within the Cerro Bayo property in Argentina. </p><p class=\"\">At La Flora, samples were collected from two outcropping structures where visible gold was observed. Assay results from these samples returned values of up to 82 g/t gold and 1,239 g/t silver. </p><p class=\"\">Initial exploration in the Cerro Bayo project was completed by Barrick Gold , the company said. Last year, Latin Metals completed additional mapping at Cerro Bayo and expanded exploration to La Flora for the first time, using Barrick's historical data as a foundation. </p><p class=\"\">The company has completed all work and met all requirements for granting of an exploration and drilling permit, and hopes the permit will be approved in the first quarter. </p><p class=\"\">Latin Metals was last seen up $0.005 to $0.08 on the TSX Venture Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309036:0/",
            "pub_date": "2025-02-05 00:08:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008320:0",
            "title": "Community Health Systems to Webcast Fourth Quarter and Year-End 2024 Conference Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Community Health Systems to Webcast Fourth Quarter and Year-End 2024 Conference Call</p><p class=\"\">FRANKLIN, Tenn.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Community Health Systems, Inc.  today announced that it will webcast its fourth quarter and year-end 2024 conference call.</p><p class=\"\">The Company will issue a press release announcing its results on Tuesday, February 18, 2025, after the regular close of trading. The conference call is scheduled to begin at 10:00 a.m. Central Time, 11:00 a.m. Eastern Time, on Wednesday, February 19, 2025. During this call, Community Health Systems will review the Company's financial and operating results for the fourth quarter and full year ended December 31, 2024.</p><p class=\"\">A live webcast of the conference call will be available online at https://www.chs.net/investor-relations/investor-tools/webcasts/. An online replay will follow shortly after the call and continue for approximately 30 days.</p><p class=\"\">You can join the live call by dialing 1-833-630-1961 (domestic) or 1-412-317-1842 (international). Once connected, request to be joined into the Community Health Systems, Inc. call. A telephonic replay of the conference call will be available through February 26, 2025, by dialing 1-877-344-7529 and entering the confirmation number, 3917263.</p><p class=\"\">About Community Health Systems, Inc.</p><p class=\"\">Community Health Systems, Inc. is one of the nation's largest healthcare companies. The Company's affiliates are leading providers of healthcare services, developing and operating healthcare delivery systems in 38 distinct markets across 15 states. The Company's subsidiaries own or lease 67 affiliated hospitals with more than 11,000 beds and operate more than 1,000 sites of care, including physician practices, urgent care centers, freestanding emergency departments, occupational medicine clinics, imaging centers, cancer centers and ambulatory surgery centers. Shares in Community Health Systems, Inc. are traded on the New York Stock Exchange under the symbol \"CYH.\" The Company's headquarters are located in Franklin, Tennessee, a suburb south of Nashville. More information about the Company can be found on its website at www.chs.net.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204507392/en/</p><p class=\"\">CONTACT:    Investor Contacts:</p><p class=\"\">Kevin Hammons</p><p class=\"\">President and</p><p class=\"\">Chief Financial Officer</p><p class=\"\">(615) 465-7000</p><p class=\"\">Anton Hie</p><p class=\"\">Vice President — Investor Relations</p><p class=\"\">(615) 465-7012</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008320:0/",
            "pub_date": "2025-02-05 00:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008331:0",
            "title": "LAURENTIAN BANK OF CANADA DECLARES DIVIDEND ON ITS PREFERRED SHARES",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LAURENTIAN BANK OF CANADA DECLARES DIVIDEND ON ITS PREFERRED SHARES</p><p class=\"\">Canada NewsWire</p><p class=\"\">MONTREAL, Feb. 4, 2025</p><p class=\"\">MONTREAL, Feb. 4, 2025 /CNW/ - The Board of Directors of the Laurentian Bank of Canada  (the \"Bank\") declared yesterday a dividend of $0.38725 on the preferred shares Series 13, payable on March 15, 2025 (the \"Payment Date\"), that will be paid out on March 17, 2025, the first business day after the Payment Date, to shareholders of record at the close of business on March 7, 2025.</p><p class=\"\">The above-mentioned dividends are designated as eligible dividends for the purposes of the Income Tax Act (Canada) and any similar provincial and territorial legislation.</p><p class=\"\">The preferred shares are eligible shares under the Bank's Shareholder Dividend Reinvestment and Share Purchase Plan (the \"Plan\"). Consequently, the holders of such shares may elect to reinvest their dividends in newly issued common shares of the Bank. Such purchases will be made at the applicable investment price as defined in the Plan, less a discount of 2%, and no brokerage commissions or service charges of any kind will apply.</p><p class=\"\">In addition, holders of such shares are entitled to make monthly optional cash payments to purchase additional common shares in accordance with the terms of the Plan.</p><p class=\"\">For more information, please contact Computershare Trust Company of Canada by phone at 1-800-564-6253 or by e-mail at service@computershare.com, or by mail 650 De Maisonneuve West 7th floor, Montreal, QC H3A 3T2. Beneficial or non-registered owners of common and preferred shares must contact their financial institution or broker for instructions on how to participate in the Plan.</p><p class=\"\">Registered holders who participate in the Plan who wish to terminate that participation so that cash dividends to which they are entitled to be paid on and after March 15, 2025, are not reinvested in common shares under the Plan, must deliver written notice to Computershare Trust of Canada at the above address by no later than March 7, 2025. Beneficial or non-registered holder who participate in the Plan and who wish to terminate their participation so that cash dividends to which they are entitled to be paid on and after March 15, 2025, are not reinvested in common shares under the Plan must contact their financial institution or broker for instructions on how to terminate participation in the Plan in advance of March 7, 2025.</p><p class=\"\">About Laurentian Bank</p><p class=\"\">Founded in Montréal in 1846, Laurentian Bank wants to foster prosperity for all customers through specialized commercial banking and low-cost banking services to grow savings for middle-class Canadians.</p><p class=\"\">With a workforce of approximately 2,800 employees, the Bank offers a wide range of financial services and advice-based solutions to customers across Canada and the United States. Laurentian Bank manages $47.4 billion in balance sheet assets and $24.7 billion in assets under administration.</p><p class=\"\">SOURCE Laurentian Bank of Canada</p><p class=\"\">View original content to download multimedia: http://www.newswire.ca/en/releases/archive/February2025/04/c2244.html</p><p class=\"\">/CONTACT:</p><p class=\"\">Frédérique Lavoie-Gamache, Lead Advisor, Media and Investor Relations, 438-364-1596, media@blcgf.ca</p><p class=\"\">Copyright CNW Group 2025</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008331:0/",
            "pub_date": "2025-02-05 00:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1I0:0",
            "title": "Toronto stocks rise as US-Canada tariff pause lifts sentiment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Canada's main stock index rebounded on Tuesday led by energy stocks, as U.S. President Donald Trump's decision to temporarily pause tariffs on Ottawa kept the overall sentiment upbeat.</p><p class=\"\">The Toronto Stock Exchange's S&amp;P/TSX composite index  was up 0.66% at 25409.78.</p><p class=\"\">    Trump on Monday     paused     steep tariffs on Mexico and Canada, agreeing to a 30-day halt for concessions on border and crime enforcement. The suspension relieved domestic investors who saw hopes of renewed negotiations to avert trade conflict among key allies.  </p><p class=\"\">    The benchmark index had pared some of its losses on Monday after Trump's decision.  </p><p class=\"\">    \"Today is just a positive sentiment carried from yesterday given the one-month delay in imposing tariffs on Canada, while Canada and the U.S. continue to negotiate over trade tariffs and border control,\" said Ian Chong, Portfolio Manager at First Avenue Investment Counsel.  </p><p class=\"\">    But Trump's 10% tariff on top metal consumer China remain in effect. Following the implementation of the tariffs at 12:01 a.m. ET (0501 GMT) on Tuesday, China     retaliated with tariffs     on targeted U.S. imports.                                     </p><p class=\"\">    At least ten sectors on TSX gained. Heavyweight energy  climbed 1.5% as crude prices rose after trading lower earlier in the session.   </p><p class=\"\">    Healthcare  added 1%, with cannabis firm Tilray Brand  boosting the sub-sector with an almost 5% rise.  </p><p class=\"\">    Canadian 10-year benchmark yield (CA10YT=RR) jumped to 3.043%, in tandem with its U.S. counterpart.   </p><p class=\"\">    Among individual stocks, TMX GROUP  rose 6.3% as the financial services company     reported     fourth-quarter profit and revenue above estimates.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1I0:0-toronto-stocks-rise-as-us-canada-tariff-pause-lifts-sentiment/",
            "pub_date": "2025-02-05 00:10:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008252:0",
            "title": "InMode Is Maintained at Hold by Needham",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008252:0/",
            "pub_date": "2025-02-05 00:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463521:0",
            "title": "Three People Banned for Misleading Investors in UK Student Accommodation Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Three individuals linked to Prosperity Cathedral View Development were banned from serving as company directors for misleading 42 investors in a student accommodation project in Derby, UK. </p><p class=\"\">Investor Relations Director Fraser MacDonald, Chief Executive Gavin Barry and Chief Operating Officer Edward Fowkes were disqualified as directors for seven years after they were found to have diverted more than 2 million pounds sterling of the invested funds to another company, the UK's Insolvency Service said Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463521:0/",
            "pub_date": "2025-02-05 00:02:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008262:0",
            "title": "Red Rock Resorts Is Maintained at Positive by Susquehanna",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:03 GMT) </strong>Red Rock Resorts Price Target Cut to $60.00/Share From $66.00 by Susquehanna</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008262:0/",
            "pub_date": "2025-02-05 00:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008257:0",
            "title": "CurrentBody Owner Mulls GBP350 Mln London IPO, Sky News Says, Citing Sources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The Beauty Tech Group, which owns the LED light therapy mask CurrentBody, is looking to float on the London Stock Exchange in an initial pubic offering that could value it at around 350 million pounds ($435.7 million), Sky News reports, citing unnamed sources.</li><li class=\"listItem-bmN0_SHH\">The company--whose beauty technology is used by celebrities such as Kim Kardashian and Serena Williams and featured in Netflix's series Emily in Paris--has hired bankers to work on a possible IPO that could see it float on London's main market later this year, according to Sky News.</li><li class=\"listItem-bmN0_SHH\">\"The group is considering its strategic options, which includes a London IPO later this year,\" Co-founder and Chief Executive Laurence Newman told Sky News.</li></ul><p class=\"\">Full story: https://tinyurl.com/3myaejk3</p><p class=\"\">Write to Ian Walker at ian.walker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008257:0/",
            "pub_date": "2025-02-05 00:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}