{
    "data": [
        {
            "id": "DJN_DN20250204008949:0",
            "title": "Snap Reports Earnings Today. Expect Another Big Move for the Stock — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Levine</p><p class=\"\">Snapchat-parent Snap has a lot riding on the company's earnings seemingly every quarter. That could continue Tuesday, when the company is scheduled to report fourth-quarter earnings after the close.</p><p class=\"\">Since 2020, the company's stock has moved by an absolute average of 22% the day after earnings reports. After the fourth quarter 2021 release, the stock was up 59%. Two quarters later, it was down 39%. Last quarter shares rose by 16% after earnings.</p><p class=\"\">\"Snap shares don't trade on traditional valuation metrics like near-term GAAP EPS, Free Cash Flow or even Ebitda,\" Wells Fargo analyst Ken Gawrelski says. \"As a result, shares are exceptionally volatile as it feels like there is a referendum every earnings print on future growth.\"</p><p class=\"\">Oppenheimer analyst Jason Helfstein notes that there is \"reasonably high short interest\" in the stock, and investors entering or exiting those positions after the earnings release can have a large effect.</p><p class=\"\">He also sees TikTok's saga — will they be banned in the U.S. or not? — as another contributing factor to the volatility. Finally, he noted that Snap's direct response advertising has lagged behind digital ad leaders Alphabet and Meta Platforms, a point of frustration for investors.</p><p class=\"\">Gawrelski has a Buy rating and a $15 price target. Helfstein has a Hold rating and no price target. A quarter of analysts have the equivalent of a Buy, and 68% have a Hold rating. Just three out of 44 analysts have a Sell. The average price target is $13.06.</p><p class=\"\">Sales growth accelerated through the first three quarters of 2024. For the fourth quarter, Wall Street expects $1.55 billion in sales, up 14% from last year, driven by a 9% rise in users and a 5% rise in average revenue per user. Three months ago, Snap guided to $1.54 billion in revenue at the midpoint.</p><p class=\"\">In the 39 quarters that have been reported publicly by Snap, it has seen positive earnings per share once, back in 2021. But it has been able to keep last-twelve-months free cash flow positive, and occasionally uses some of it for share repurchases, including three of the last four quarters.</p><p class=\"\">For the fourth quarter, Wall Street expects the company to report a loss of four cents loss-per-share, up from a loss of 15 cents a year ago, with free cash flow of $161 million.</p><p class=\"\">Write to Adam Levine at adam.levine@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008949:0/",
            "pub_date": "2025-02-05 01:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008950:0",
            "title": "Chevron Is Maintained at Hold by Truist Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(17:13 GMT) </strong>Chevron Price Target Cut to $160.00/Share From $164.00 by Truist Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008950:0/",
            "pub_date": "2025-02-05 01:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309091:0",
            "title": "1911 Gold Releases Assay Results From the True North Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1911 Gold  Tuesday released assay results from 10 drill holes of the exploration-drilling program currently in progress at the True North Project on the Rice Lake Gold property in Manitoba. </p><p class=\"\">Drill results confirmed the extension of quartz vein hosted, near-surface gold mineralization on both the San Antonio West and Hinge East targets. </p><p class=\"\">Best results included 3.45 meters testing at 2.85 grams per tonne of gold and 4.84 gpt of gold over 3.7 meters</p><p class=\"\">\"Now that we are seeing the initial results from our first phase of drilling, we are excited about the potential for a parallel vein structure at San Antonio West, as well as the possible near-surface mineralization at Hinge East,\" said chief executive Shaun Heinrichs. \"A second drill rig will mobilize in the coming weeks as we expand the drill program and continue advancing these targets alongside the ongoing drilling underway at the San Antonio Southeast target.\"</p><p class=\"\">The company's shares were last seen down $0.005 to $0.195 on the TSX Venture Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309091:0/",
            "pub_date": "2025-02-05 01:13:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203010380:0",
            "title": "Pepsi Earnings Beat Expectations. Why the Stock Is Having Its Worst Day Since 2023 — and Why It Could Bounce Back. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Evie Liu</p><p class=\"\">PepsiCo beat Wall Street estimates for profit in the fourth quarter but missed on revenue. The stock is falling on Tuesday, but some analysts say shares in the snack and beverage giant could bounce back as it invests in new products and further expands internationally.</p><p class=\"\">The maker of Pepsi and Mountain Dew sodas said on Tuesday that adjusted earnings per share were $1.96 in the final three months of 2024. Analysts polled by FactSet expected earnings of $1.94. Revenue came in at $27.78 billion, slightly below the expectations of $27.89 billion.</p><p class=\"\">Pepsi's revenue was hurt by subdued trends in the North America market, with numbers particularly disappointing in the Quaker Foods business, which suffered from a fallout due to product recalls in 2024.</p><p class=\"\">Pepsi shares tumbled 4.4% to around $144 in Tuesday trading, on pace for largest percent decrease since Oct. 5, 2023, when it fell 5.2%. The stock has declined 16% over the past 12 months.</p><p class=\"\">Still, while sales came slightly lower than a year ago, fourth-quarter earnings were up 14% on a constant currency basis.</p><p class=\"\">\"Our enhanced multiyear productivity initiatives enabled us to invest in our businesses, and deliver improvements in our gross margin, operating margin expansion and EPS in 2024,\" said CEO Ramon Laguarta in a statement.</p><p class=\"\">Pepsi, along with many packaged-food companies, has faced some challenges over the past year. Consumers are pulling back from spending amid inflation pressure, while the rising popularity of GLP-1 weight-loss drugs could further dampen appetite for snacks and sugary drinks.</p><p class=\"\">This year, Donald Trump's administration might bring more changes that could negatively affect the food industry, including more prominent labels about harmful ingredients, restrictions on food additives, and cuts to the food stamp program that many low-income households rely on for consumption.</p><p class=\"\">On top of the regulatory pressure, there is also a general trend toward healthier foods. Pepsi's most popular products have historically catered to taste rather than health. The company has been working to evolve its portfolio toward more health and wellness options.</p><p class=\"\">Laguarta said the company will continue to expand in international business, while improving performance in North America. He expects the productivity initiatives to help fund investments and aid profitability.</p><p class=\"\">For 2025, management expects a low-single-digit increase in organic revenue and a mid-single-digit increase in core constant currency earnings per share.</p><p class=\"\">Weaker foreign currencies are expected to hurt revenue and earnings by about three percentage points, the company said. That means a low-single-digit increase to core earnings per share in 2025 compared with 2024 results of $8.16.</p><p class=\"\">Pepsi announced a 5% increase in annualized dividend per share, beginning with the June 2025 payment. Total cash returns to shareholders in 2025 are guided at $8.6 billion, comprised of dividends of $7.6 billion and share repurchases of $1 billion.</p><p class=\"\">Some analysts say uncertainties facing Pepsi might be priced in, and the company is better positioned than peers to grow in the coming years.</p><p class=\"\">\"Pepsi's diversified product offering, which includes globally known brands in snacks and beverages, is often a competitive advantage, as it provides a nice mix of at- and away-from-home products,\" wrote Edward Jones analyst Brittany Quatrochi in a Tuesday note.</p><p class=\"\">The analyst noted that Pepsi's product innovation has driven solid growth in snacks, and it's improving with beverages. With nearly 40% of its sales outside of North America, Pepsi is also geographically diverse.</p><p class=\"\">\"International growth, especially in emerging markets, should benefit Pepsi,\" she wrote. \"Usually when people reach the middle class in those markets, they tend to spend more on packaged beverages and snacks.\"</p><p class=\"\">Pepsi's strong distribution system could help it gain share in those growing markets versus smaller competitors, said Quatrochi, who has a Buy rating for the stock and expects Pepsi to grow earnings at a high-single-digit rate.</p><p class=\"\">Garrett Nelson, a senior equity analyst at CFRA Research also maintained his Buy rating on the stock, but trimmed the 12-month price target to $175 from $190.</p><p class=\"\">Pepsi has a \"masterful track record of providing conservative guidance and then exceeding it,\" he wrote. Despite headwinds, Nelson sees value in Pepsi shares at current levels following the recent slide.</p><p class=\"\">Write to Evie Liu at evie.liu@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203010380:0/",
            "pub_date": "2025-02-05 01:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309101:0",
            "title": "Update: Spotify Technology Swings to Q4 Earnings as Revenue Rises; Shares Gain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with recent stock move in the headline and first paragraph.)</p><p class=\"\">Spotify Technology  shares were over 9% higher Tuesday after the company reported Q4 diluted earnings of 1.76 euros ($1.82) per share, swinging from a loss of 0.36 euros a year earlier. </p><p class=\"\">Analysts polled by FactSet expected earnings of 1.99 euros per share. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was 4.24 billion euros, up from 3.67 billion euros a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected 4.15 billion euros. </p><p class=\"\">Spotify said it had 675 million total monthly active users in Q4, up 12% year over year. </p><p class=\"\">The company said it expects Q1 revenue of 4.2 billion euros. Analysts polled by FactSet expect 4.17 billion euros.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309101:0/",
            "pub_date": "2025-02-05 01:14:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008956:0",
            "title": "SPHERE ENTERTAINMENT NAMES GLENN DERRY EXECUTIVE VICE PRESIDENT, MSG VENTURES",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SPHERE ENTERTAINMENT NAMES GLENN DERRY EXECUTIVE VICE PRESIDENT, MSG VENTURES</p><p class=\"\">PR Newswire</p><p class=\"\">BURBANK, Calif., Feb. 4, 2025</p><p class=\"\">BURBANK, Calif., Feb. 4, 2025 /PRNewswire/ — Sphere Entertainment Co.  announced today that Glenn Derry, an Academy Award winning technologist with over 30 years of industry-defining entertainment technology experience, has joined the Company as Executive Vice President of MSG Ventures.</p><p class=\"\">In this role, Mr. Derry will oversee a wide range of technology initiatives across MSG Ventures, a wholly-owned subsidiary of Sphere Entertainment focused on developing advanced technologies for live entertainment. MSG Ventures also supports Sphere Studios, the immersive content studio dedicated to creating multi-sensory entertainment experiences exclusively for Sphere, and the Sphere platform overall, including future Sphere venues. Mr. Derry will work across the organization to deploy both new and existing technologies that enhance Sphere's live entertainment and experiential content, which has been redefining immersive experiences since the first Sphere opened in Las Vegas in September 2023. He will be based at Sphere Studios in Burbank, and report to Jim Dolan, Executive Chairman and Chief Executive Officer, Sphere Entertainment.</p><p class=\"\">\"Our vision for Sphere was to combine cutting-edge technologies with storytelling — bringing audiences together to share in experiences they cannot experience anywhere else,\" said Mr. Dolan. \"Glenn is a creative technologist whose work has had a significant impact on the entertainment industry. His expertise will be an asset to Sphere as we continue to build on this next generation entertainment medium and reinforce our position at the forefront of immersive experiences.\"</p><p class=\"\">\"Throughout my career I have focused on developing technologies in service of creative visions that expand the possibilities of entertainment, and there is no better opportunity to continue that work than at Sphere,\" said Mr. Derry. \"Sphere sets a new standard for immersive experiences, and together with my colleagues across the organization we look forward to creating new tools and experiences that push creative boundaries and drive innovation across the industry.\"</p><p class=\"\">As one of Hollywood's leading technological innovators, Mr. Derry brings to Sphere extensive experience from various facets of the film and gaming industry, where he is credited with introducing the concept of \"virtual production.\" He joins Sphere Entertainment from AGBO, an Academy Award winning independent film, television, and gaming studio, where he served as President of Production Technology. In this role, he helped lead the establishment of AGBO's innovative virtual production and animation pipelines that service transmedia explorations of the company's intellectual property.</p><p class=\"\">Prior to joining AGBO Mr. Derry served as Vice President of Visual Effects at 20(th) Century Fox Studios following the acquisition of Technoprops, an R&amp;D firm specializing in motion capture and emerging visual production technology. Mr. Derry was the founder and CEO of Technoprops, and over nearly 20 years he built the company into a force recognized for redefining creative and technical innovation in the film industry. Among Technoprops' achievements was developing a state-of-the-art head-mounted camera system widely adopted for capturing an actor's facial movements. Mr. Derry and his team received an Academy of Motion Picture Arts and Sciences Technical Achievement Award for the groundbreaking design and engineering of this system. Over the course of his tenure at Technoprops, Mr. Derry was involved in some of the most technically ambitious projects in film and video games, including Avatar, Star Wars: Rogue One, Avengers — Age of Ultron,  Zero Dark Thirty, The Jungle Book, Minority Report, and Halo 4, among many notable others.</p><p class=\"\">Mr. Derry began his career in the film industry creating practical effects, including advanced puppets for movies, before transitioning into his work in visual effects and virtual production.</p><p class=\"\">About Sphere Entertainment Co.</p><p class=\"\">Sphere Entertainment Co.  is a premier live entertainment and media company. The Company includes Sphere, a next-generation entertainment medium powered by cutting-edge technologies to redefine the future of entertainment. The first Sphere venue opened in Las Vegas in September 2023. In addition, the Company includes MSG Networks, which operates two regional sports and entertainment networks, MSG Network and MSG Sportsnet, as well as a direct-to-consumer and authenticated streaming product, MSG+, delivering a wide range of live sports content and other programming. More information is available at sphereentertainmentco.com.</p><p class=\"\">Contact:</p><p class=\"\">Sphere Entertainment — spherepr@thesphere.com</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/sphere-entertainment-names-glenn-derry-executive-vice-president-msg-ventures-302367619.html</p><p class=\"\">SOURCE Sphere Entertainment Co.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008956:0/",
            "pub_date": "2025-02-05 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008957:0",
            "title": "Global Commodities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Commodities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1149 ET - Base metal prices rise, with LME three-month copper up 0.5% at $9,158.50 a metric ton and LME three-month aluminum up 0.6% at $2,636.50 a ton. The market has bounced back from losses incurred by President Trump's proposed tariffs on Canada and Mexico, which have been postponed a month after last-minute agreements on Monday. An additional 10% China tariff has proceeded. This has eased market worries of reduced industrial growth and demand. Canada and Mexico are significant suppliers to the U.S. across the whole base-metals complex, ranging from around 20% of copper imports to nearly half of its aluminum imports. News of the delay also sent the U.S. dollar lower, a tailwind for metals as it becomes cheaper for international buyers to purchase dollar-denominated commodities. (joseph.hoppe@wsj.com)</p><p class=\"\">1141 ET - Gold futures rise, having set a fresh record slightly earlier in the session. Futures are up 0.5% at $2,871.60 a troy ounce, having peaked at $2,874.50 in European late afternoon trading. The precious metal has traded in a relatively narrow range, with rising U.S. bond yields and a stronger dollar limiting the upward rally, XS.com's Rania Gule says in a note. That said, concerns about potential economic fallout from President Trump's tariffs and other inflationary policies provide strong support for gold as a safe-haven asset, Gule writes. The overall upward trend for gold remains intact, and any corrective pullbacks should be seen as buying opportunities as supportive factors haven't fundamentally changed, Gule says. As markets remain uncertain, gold will likely stay a focus for investors both as a hedge and an investment opportunity, Gule adds. (joseph.hoppe@wsj.com)</p><p class=\"\">1132 ET - JBS, the world's largest meatpacker, says it's investing $200 million in two of its largest U.S. beef plants at a time when meatpackers are broadly struggling to make a profit because of a lack of cattle, driving up costs. The company said $150 million will go to its Cactus, Texas, plant to improve the part of the facility where carcasses are processed into primal cuts and expand its ground beef room. JBS says it will put $50 million toward its Greeley, Colo., plant to build a new distribution center. JBS said the investments will improve efficiencies and could increase production capacity at the two plants that both have the capability to slaughter about 6,000 cattle a day. \"We believe now is the time to invest in the United States,\" said Wesley Batista Filho, JBS' U.S. CEO. (patrick.thomas@wsj.com)</p><p class=\"\">1127 ET - U.S. farmers carried an optimistic outlook into 2025, according to the latest Ag Economy Barometer published by Purdue University and the CME Group. Surveyed farmers say that their view of current conditions of the agricultural economy have improved, buoyed by a month of gains for row crop prices on the CBOT. Farmers are increasingly expecting to have a 'more robust' year financially than last year — although some concerns remain. Some 42% of surveyed farmers identified trade policy as their top policy concern over the next five years. Even so, 40% of farmers now say a trade war is likely or very likely, down 8 points from last month's survey. Some 29% say a trade war is unlikely or very unlikely, which is an 8 point increase from last month. (kirk.maltais@wsj.com)</p><p class=\"\">1042 ET - Grain merchant ADM says as part of its plan to cut costs it could shutter or divest facilities that are in need of repair, have a history of poor performance or are located in areas with excess capacity. CEO Juan Luciano said on a call with investors that the company has identified about $2 billion worth of opportunities. The company is facing pressure from low crop prices and falling profit margins in its oilseed processing business. \"We will execute on this over time,\" Luciano said. (patrick.thomas@wsj.com)</p><p class=\"\">1010 ET - Lean hog futures on the CME are higher in early trading, with the most-active contract up 0.8%. Traders appear to be pulling back from the steep selling seen to start the week, with contract limits in today's session extended to 6 cents a pound after the limit-down close Monday, following a drop of 4 cents a pound. While the hog market recalibrates amid tariff turmoil, there exists fundamental pressure points for hog demand. Pork carcass cutout prices shed 94 cents per hundredweight on Monday, according to USDA data, following a strong start to 2025 pricewise. Live cattle futures are down 0.2%. (kirk.maltais@wsj.com)</p><p class=\"\">0952 ET - CBOT grain futures are mixed, with traders maintaining a reserved approach as China responds to Trump tariffs with retaliatory measures of its own targeting energy exports among other things. The tariffs make no mention of raw soybeans, but traders are wondering nonetheless about whether China will curb its purchases. \"Remember, we are looking to see if there is any new commodity buying by China, versus just 'maneuvering to avoid tariffs,\" says Naomi Blohm of Total Farm Marketing in a note. The USDA announced a new flash sale of corn to South Korea for 132,000 metric tons. (kirk.maltais@wsj.com)</p><p class=\"\">0936 ET - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">0928 ET - New U.S. tariffs on Chinese goods were met with retaliation from China, resulting in selling in CBOT soybean futures overnight. But that selling has moderated, with the most-active soybean contract now down only 0.3% pre-market. Traders who have spoken to WSJ say that a lot of market activity has become reactive to new headlines, but is showing restraint in light of trade uncertainty. \"I think the trade is well braced for this,\" says Terry Reilly of Marex. Reilly adds that many traders likely \"learned their lesson\" after handling the fallout of the trade war with China in Trump's first term. (kirk.maltais@wsj.com)</p><p class=\"\">0922 ET - The dollar recovers some ground after yesterday's choppy session, which ended with a small decline in the WSJ Dollar Index as tariffs on Mexico and Canada were delayed. The trade war with China goes on and markets remain worried about the potential fallout of a prolonged period in which tariffs would loom over the global economy. BBH says in a report that investors should look through the noise and focus on the fact that the U.S. still has strong growth and elevated inflation, \"and a more hawkish Fed continues to favor higher U.S. yields and a stronger dollar.\" The greenback strengthens 0.3 against the yen and is stable versus the euro. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0910 ET - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0853 ET - ADM falls 2% premarket after saying it expects an uncertain 2025 and posts a 6% decline in sales for the quarter ending Dec. 31 compared with a year ago, and below analyst estimates. ADM says operating profit at its crushing subsegment, which turns oilseeds into oils and biofuels, was 46% lower versus the prior year quarter, because of higher manufacturing costs among other issues. \"With softer market conditions and policy uncertainty around the world going into 2025, we are focused on improving our operational performance, accelerating costs savings, and simplifying our portfolio,\" says ADM CEO Juan Luciano in a statement. (patrick.thomas@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008957:0/",
            "pub_date": "2025-02-05 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008960:0",
            "title": "Brussels Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  BEL-20 Index                4,277.18      +3.43      +0.08 <br/>  Index Components <br/>  Groupe Bruxelles Lambert       66.30      +0.65      +0.99 <br/>  KBC Group                      73.08      -0.32      -0.44 <br/>  Solvay                         29.46      +0.46      +1.59 <br/>  Umicore                         9.80      +0.18      +1.87 <br/>  Ackermans &amp; Van Haaren        185.40      -0.20      -0.11 <br/>  Lotus Bakeries             10,140.00     +80.00      +0.80 <br/>  Cofinimmo                      54.00      -0.30      -0.55 <br/>  D'Ieteren                     161.60      -0.40      -0.25 <br/>  Sofina                        235.40      -2.20      -0.93 <br/>  UCB                           184.50      -1.30      -0.70 <br/>  Ageas                          49.32      +0.10      +0.20 <br/>  Warehouses de Pauw             20.26      -0.08      -0.39 <br/>  Anheuser-Busch InBev           47.07      -0.32      -0.68 <br/>  Melexis                        61.75      +3.80      +6.56 <br/>  Elia Group                     67.75      +2.35      +3.59 <br/>  Aedifica                       58.30      +0.05      +0.09 <br/>  argenx                        631.40      -3.80      -0.60 <br/>  Azelis Group                   19.74      +0.05      +0.25 <br/>  Syensqo                        76.86      +1.63      +2.17 <br/>  Galapagos                      22.02      -0.34      -1.52 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008960:0/",
            "pub_date": "2025-02-05 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008962:0",
            "title": "Amsterdam Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  ING Groep                      10,024,082       16.050       +0.246        +1.56 <br/>  Royal KPN                       8,900,696        3.472       -0.017        -0.49 <br/>  Shell                           5,376,398       32.070       +0.220        +0.69 <br/>  Prosus                          3,660,719       37.940       +0.930        +2.51 <br/>  Pharming Group                  3,270,544        0.827       -0.010        -1.19 <br/>  ABN AMRO Bank                   3,146,258       15.920       +0.010        +0.06 <br/>  Ahold Delhaize                  2,873,807       34.910       +0.790        +2.32 <br/>  Aegon                           2,445,215        6.264       +0.036        +0.58 <br/>  Havas                           2,437,989        1.530       -0.020        -1.29 <br/>  ArcelorMittal                   2,256,501       24.220       +0.460        +1.94 <br/>  TomTom                          2,051,923        4.300       -0.710       -14.17 <br/>  Ebusco Holding                  1,978,363        0.792       -0.086        -9.81 <br/>  Just Eat Takeaway.com           1,608,269       11.715       +0.125        +1.08 <br/>  Koninklijke Philips             1,456,986       25.940       -0.350        -1.33 <br/>  NN Group                        1,182,880       43.110       -0.450        -1.03 <br/>  Universal Music Group           1,151,539       27.100       +0.020        +0.07 <br/>  Unilever                          935,430       55.420       -0.460        -0.82 <br/>  Heineken                          725,514       65.480       -0.720        -1.09 <br/>  PostNL                            673,924        0.987       +0.003        +0.30 <br/>  ASML Holding                      673,080      712.400       +2.500        +0.35 <br/>  Akzo Nobel                        647,412       54.700       +1.180        +2.20 <br/>  Koninklijke BAM Groep             554,728        4.048       -0.058        -1.41 <br/>  RELX                              519,962       48.140       -0.260        -0.54 <br/>  Allfunds Group                    490,269        5.060       +0.040        +0.80 <br/>  Signify                           404,733       20.480       -0.040        -0.19 <br/>  CVC Capital Partners              385,142       22.920       +0.090        +0.39 <br/>  InPost                            372,954       15.790       -0.080        -0.50 <br/>  EXOR                              357,945       92.100       +3.250        +3.66 <br/>  BE Semicon Industries             350,112      120.500       -1.350        -1.11 <br/>  JDE Peet's                        344,151       16.380       -0.050        -0.30 <br/>  OCI N.V.                          327,817       10.900         unch         unch <br/>  Wolters Kluwer                    327,282      174.800       -0.600        -0.34 <br/>  DSM-Firmenich                     324,722       96.400       -1.280        -1.31 <br/>  Fugro                             320,056       15.160       +0.080        +0.53 <br/>  SBM Offshore                      270,598       18.380       +0.140        +0.77 <br/>  Heineken Holding                  254,158       56.650       -0.700        -1.22 <br/>  Alfen                             245,444       14.340       +0.050        +0.35 <br/>  Randstad                          242,957       41.800       +0.530        +1.28 <br/>  Avantium                          224,326        1.708       -0.012        -0.70 <br/>  MKB NedSense                      215,382        0.060       -0.003        -4.03 <br/>  ASR Nederland                     195,170       47.210       -0.010        -0.02 <br/>  Accsys Technologies               142,755        0.523       -0.012        -2.24 <br/>  ASM International                 124,913      549.400       -9.800        -1.75 <br/>  ARCADIS                           105,509       53.550       -0.800        -1.47 <br/>  Basic-Fit                         104,021       23.880       -0.260        -1.08 <br/>  AMG Critical Materials            100,746       13.910       -0.100        -0.71 <br/>  Galapagos                          94,575       22.020       -0.340        -1.52 <br/>  Koninklijke Vopak                  91,249       44.120       +0.380        +0.87 <br/>  Aperam                             88,511       26.480       +0.220        +0.84 <br/>  Aalberts                           78,946       33.780       -0.120        -0.35 <br/>Prices in Euros <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008962:0/",
            "pub_date": "2025-02-05 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008961:0",
            "title": "Amsterdam Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  Amsterdam AEX Index           919.47      +3.20      +0.35 <br/>  Index Components <br/>  ABN AMRO Bank                  15.92      +0.01      +0.06 <br/>  Adyen                       1,599.60     +47.20      +3.04 <br/>  Aegon                           6.26      +0.04      +0.58 <br/>  Ahold Delhaize                 34.91      +0.79      +2.32 <br/>  Akzo Nobel                     54.70      +1.18      +2.20 <br/>  ArcelorMittal                  24.22      +0.46      +1.94 <br/>  ASM International             549.40      -9.80      -1.75 <br/>  ASML Holding                  712.40      +2.50      +0.35 <br/>  ASR Nederland                  47.21      -0.01      -0.02 <br/>  BE Semicon Industries         120.50      -1.35      -1.11 <br/>  DSM-Firmenich                  96.40      -1.28      -1.31 <br/>  EXOR                           92.10      +3.25      +3.66 <br/>  Heineken                       65.48      -0.72      -1.09 <br/>  IMCD                          149.65      +0.85      +0.57 <br/>  ING Groep                      16.05      +0.25      +1.56 <br/>  Koninklijke Philips            25.94      -0.35      -1.33 <br/>  NN Group                       43.11      -0.45      -1.03 <br/>  Prosus                         37.94      +0.93      +2.51 <br/>  Randstad                       41.80      +0.53      +1.28 <br/>  RELX                           48.14      -0.26      -0.54 <br/>  Royal KPN                       3.47      -0.02      -0.49 <br/>  Shell                          32.07      +0.22      +0.69 <br/>  Unilever                       55.42      -0.46      -0.82 <br/>  Universal Music Group          27.10      +0.02      +0.07 <br/>  Wolters Kluwer                174.80      -0.60      -0.34 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008961:0/",
            "pub_date": "2025-02-05 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446600:0",
            "title": "Canada 10-Year Bond Yield Halts Decline",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canada’s 10-year government bond yield stabilized at around 3.04%, halting its decline after reaching seven-week lows, as safe-haven demand eased following Prime Minister Trudeau’s confirmation that U.S. tariffs on Canadian goods would be paused for at least 30 days.</p><p class=\"\">This delay alleviated immediate concerns over potential trade disruptions, which had fueled risk aversion stemming from fears of reduced demand for Canadian exports and limited foreign exchange inflows.</p><p class=\"\">However, the Bank of Canada has taken an increasingly dovish stance, marking the conclusion of its quantitative tightening program, limiting support for yields.</p><p class=\"\">The BoC’s recent 25 basis point rate cut to 3% was accompanied by plans to resume asset purchases starting in March.</p><p class=\"\">Initially, these purchases will occur through the repo program, followed by the acquisition of Government of Canada bills via auctions, with the BoC targeting a return to secondary market bond purchases by the end of 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446600:0-canada-10-year-bond-yield-halts-decline/",
            "pub_date": "2025-02-05 01:15:28",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463531:0",
            "title": "Swiss Market Index Closes Lower as Global Trade War Concerns Linger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Swiss stocks remained in negative territory, reflecting cautious market sentiment as China strikes back against US tariffs. </p><p class=\"\">The Swiss Market Index was down 0.57% on Tuesday's close. </p><p class=\"\">China unveiled targeted tariffs on select US imports after President Donald Trump's additional tariffs on Chinese goods took effect, Reuters reported. Meanwhile, the European Union is aiming for swift discussions with the US in a bid to avert potential tariffs on the bloc. </p><p class=\"\">\"Markets are readjusting after Trump's last-minute deals with Mexico and Canada which delayed tariffs by a month,\" ING said. \"Looking at the implications of Trump's handling of the Mexico and Canada tariff threat, sentiment in the eurozone has improved on the back of expectations that a deal can be struck and protectionism averted.\"</p><p class=\"\">\"Still, extra caution is warranted in this sense. If part of Trump's motive to delay tariffs on US neighbours was domestic backlash for potential immediate economic pain for US consumers, that is not necessarily true for EU tariffs,\" analysts added. </p><p class=\"\">On the corporate front, UBS Group  plunged 7.05% as it reported a drop in 2024 net profit attributable to shareholders to $5.09 billion from $27.37 billion a year before. The Swiss banking group's total revenue, however, rose over the period to $48.61 billion from $40.83 billion. </p><p class=\"\">Meanwhile, SoftwareOne  confirmed its plan to list its shares on Euronext Oslo Børs, following Swiss financial market regulator FINMA's recognition of the bourse as a foreign trading venue for Switzerland-listed companies. The secondary listing is part of its planned merger with Norwegian software and cloud technology company Crayon Group, expected to complete in June. SoftwareOne's shares edged down 0.51% at closing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463531:0-swiss-market-index-closes-lower-as-global-trade-war-concerns-linger/",
            "pub_date": "2025-02-05 01:15:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309066:0",
            "title": "Spectrum Brands Likely to Report In-Line Q1, RBC Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spectrum Brands  is expected to report an about in-line fiscal Q1 results, with modest growth in every segment, RBC Capital Markets said in a Tuesday note. </p><p class=\"\">The report also said the firm could face some margin pressure over increased investment. The results are due Thursday. </p><p class=\"\">\"We remain positive on the SPB recovery story and think there is a lot to like here, with reasonable potential for upside to FY'25 numbers should guidance prove conservative,\" RBC analysts, including Nik Modi, said in an earnings preview. </p><p class=\"\">RBC has an outperform rating on the stock with a price target of $114, saying that \"SPB is now operating from a position of strength with meaningful optionality/flexibility.\"</p><p class=\"\">\"We think its current stock price does not reflect fair value as a result,\" the analysts said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309066:0/",
            "pub_date": "2025-02-05 01:15:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008928:0",
            "title": "Cigna Group Is Maintained at Buy by Truist Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(17:07 GMT) </strong>Cigna Group Price Target Cut to $375.00/Share From $390.00 by Truist Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008928:0/",
            "pub_date": "2025-02-05 01:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309092:0",
            "title": "Argus Adjusts Price Target on Meta Platforms to $775 From $686, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meta Platforms  has an average rating of buy and mean price target of $753.38, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309092:0/",
            "pub_date": "2025-02-05 01:07:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008931:0",
            "title": "Toronto Stocks Rebound On Tariff Pause; TMX Group Rises on 4Q Profit, Revenue Beats",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adriano Marchese</p><p class=\"\">Toronto's indexes rebounded on Tuesday at midday from Monday's turmoil, regaining ground after Canada and the U.S. called a month-long pause to the tariffs between the two countries. The reprieve of the pause drove most sectors higher, with tech leading the gainers, followed by health services and consumer services. Only consumer-durables and commercial-services stocks were in the red.</p><p class=\"\">Canada's S&amp;P/TSX Composite Index rose 0.4% to 25342.62 and the blue-chip S&amp;P/TSX 60 rose by 0.2% to 1525.09.</p><p class=\"\">TMX Group shares rose 8% to 48.89 Canadian dollars ($33.89) after the company reported better-than-expected profit and revenue in the fourth quarter and a 5% dividend hike.</p><p class=\"\">Other market movers:</p><p class=\"\">Bombardier shares benefited from the pause, with the stock rising 3.6% to C$85.75 as investors breathed a sigh of relief regarding the pause on tariffs that would have affected deliveries and orders for the business-jet manufacturer.</p><p class=\"\">Write to Adriano Marchese at adriano.marchese@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008931:0/",
            "pub_date": "2025-02-05 01:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008930:0",
            "title": "Regeneron Pharmaceuticals on Pace for Largest Percent Increase Since August 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Regeneron Pharmaceuticals, Inc. (REGN) is currently at $700.00, up $33.15 or 4.97%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Jan. 15, 2025, when it closed at $703.43</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Aug. 3, 2023, when it rose 5.37%</li><li class=\"listItem-bmN0_SHH\">Snaps a three day losing streak</li><li class=\"listItem-bmN0_SHH\">Down 1.73% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 41.75% from its all-time closing high of $1201.76 on Aug. 27, 2024</li><li class=\"listItem-bmN0_SHH\">Down 25.36% from 52 weeks ago (Feb. 6, 2024), when it closed at $937.81</li><li class=\"listItem-bmN0_SHH\">Down 41.75% from its 52-week closing high of $1201.76 on Aug. 27, 2024</li><li class=\"listItem-bmN0_SHH\">Up 4.97% from its 52-week closing low of $666.85 on Feb. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Traded as high as $709.98; highest intraday level since Jan. 15, 2025, when it hit $712.60</li><li class=\"listItem-bmN0_SHH\">Up 6.47% at today's intraday high; largest intraday percent increase since Aug. 3, 2023, when it rose as much as 7.61%</li><li class=\"listItem-bmN0_SHH\">Third best performer in the Nasdaq 100 today</li></ul><p class=\"\">All data as of 11:51:35 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008930:0-regeneron-pharmaceuticals-on-pace-for-largest-percent-increase-since-august-2023-data-talk/",
            "pub_date": "2025-02-05 01:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309090:0",
            "title": "Barclays Adjusts Price Target on Chevron to $171 From $174, Keeps Overweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chevron  has an average rating of overweight and mean price target of $176.43, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309090:0/",
            "pub_date": "2025-02-05 01:08:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446596:0",
            "title": "European Stocks Jump on Strong Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">European stocks closed firmly higher on Tuesday, supported by strong corporate earnings and eased concerns of a trade war in North America.</p><p class=\"\">The Eurozone’s STOXX 50 added 1% to close at 5,268 and the STOXX 600 advanced rose by 0.3% to 536.</p><p class=\"\">US President Trump delayed tariffs on Mexico and Canada to back hopes that trade restrictions against North American neighbors may be avoided altogether, but maintained softer tariffs against China.</p><p class=\"\">Banks led the gains, with BNP Paribas and Intesa Sanpaolo gaining 4.2% and 3.2%, respectively, after unveiling their income statements and balance sheets for the fourth quarter.</p><p class=\"\">These were enough to support other banks in the Eurozone, offsetting the earnings-induced 6.8% plunge for UBS. Also on the earnings front, Ferrari soared by 8.3% after reporting record-setting results for 2024 and Infineon surged 10.2% on strong results.</p><p class=\"\">In turn, the healthcare sector was in the red ahead of NovoNordisk and GSK results tomorrow and AstraZeneca results Thursday.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446596:0-european-stocks-jump-on-strong-earnings/",
            "pub_date": "2025-02-05 01:08:08",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446597:0",
            "title": "DAX Rebounds Slightly",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The DAX closed about 0.4% higher at 21,511 on Tuesday after a volatile session, following sharp losses the previous day.</p><p class=\"\">The temporary halt in tariffs on Canada and Mexico and ongoing talks with China fueled optimism for a full tariff rollback, while traders also monitored fresh corporate earnings and key US labor data.</p><p class=\"\">On the corporate front, chipmaker Infineon stood out, surging over 10%, following the release of its first-quarter results and a slight upward revision of its full-year revenue outlook.</p><p class=\"\">Additionally, auto stocks and tech stocks saw some recovery.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446597:0-dax-rebounds-slightly/",
            "pub_date": "2025-02-05 01:08:15",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309076:0",
            "title": "Update: Troilus Gold Up 5% as It Launches the 2025 Exploration Program at Its Namesake Project in Quebec",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates shares.)</p><p class=\"\">Troilus Gold  said Tuesday it launched its 2025 exploration program at the Troilus copper-gold project in Quebec. </p><p class=\"\">The program includes a 15,000-meters drill program targeting near-mine, high-grade zones; over 2,100 line-kilometers of versatile time-domain electromagnetic surveys; and 23.3 line-kilometers of induced polarization surveys. </p><p class=\"\">The company will also collect 3,700 soil samples to infill key data gaps in existing geochemical surveys, and conduct detailed geological mapping across multiple targets. </p><p class=\"\">\"This year's exploration plans are designed to optimize planning, assess opportunities to integrate higher-grade mineralization into the early years of production, and further unlock the district-scale potential of our property through continued regional exploration,\" CEO Justin Reid said. </p><p class=\"\">Troilus shares were last seen up $0.02 to $0.39 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309076:0/",
            "pub_date": "2025-02-05 01:08:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309093:0",
            "title": "Barclays Adjusts Clorox Price Target to $140 From $130, Maintains Underweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clorox  has an average rating of hold and mean price target of $163.22, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309093:0/",
            "pub_date": "2025-02-05 01:08:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309083:0",
            "title": "Update: PJT Partners Shares Jump After Q4 Results Beat Estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with stock move in the headline and first paragraph)</p><p class=\"\">PJT Partners  shares jumped 13% in recent Tuesday trading after the company reported Q4 results that topped estimates by analysts. </p><p class=\"\">In the three months ended Dec. 31, adjusted earnings rose to $1.90 per diluted share from $0.96 a year earlier. </p><p class=\"\">Four analysts polled by FactSet expected $1.12. </p><p class=\"\">Revenue rose to $477.3 million from $328.6 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $376.1 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309083:0/",
            "pub_date": "2025-02-05 01:09:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008932:0",
            "title": "Pebblebrook Hotel Trust Is Maintained at Hold by Truist Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(17:09 GMT) </strong>Pebblebrook Hotel Trust Price Target Cut to $13.00/Share From $14.00 by Truist Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008932:0/",
            "pub_date": "2025-02-05 01:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446598:0",
            "title": "The CAC 40 Index Closes 0.66% Higher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In Paris,  the CAC 40 Index rose 51 points or 0.66 percent on Tuesday.</p><p class=\"\">Leading the gains are Dassault Systemes (8.43%), BNP Paribas (3.78%) and STMicroelectronics (2.64%).</p><p class=\"\">Top losers were Pernod Ricard (-1.81%), Sanofi (-1.76%) and Danone (-1.53%).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446598:0-the-cac-40-index-closes-0-66-higher/",
            "pub_date": "2025-02-05 01:10:00",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309096:0",
            "title": "Update: Lancaster Colony Shares Rise After Fiscal Q2 Net Sales Beat Consensus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with stock price movement in the headline and first paragraph.)</p><p class=\"\">Lancaster Colony  shares were up almost 10% in recent Tuesday trading after the company's fiscal Q2 revenue exceeded analysts' consensus. </p><p class=\"\">The company reported fiscal Q2 earnings of $1.78 per diluted share, down from $1.87 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.94. </p><p class=\"\">Net sales for the quarter ended Dec. 31 were $509.3 million, up from $485.9 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $495.3 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309096:0/",
            "pub_date": "2025-02-05 01:10:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008839:0",
            "title": "Kyndryl Holdings Is Maintained at Outperform by Oppenheimer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(17:03 GMT) </strong>Kyndryl Holdings Price Target Raised to $43.00/Share From $37.00 by Oppenheimer</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008839:0/",
            "pub_date": "2025-02-05 01:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309084:0",
            "title": "Update: Atkore Shares Fall After Fiscal Q1 Net Sales Miss Analysts Estimates; 2025 Outlook Lowered",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with stock price movement in the headline and first paragraph.)</p><p class=\"\">Atkore  shares were down more than 19% in recent trading on Tuesday after fiscal Q1 net sales missed consensus estimates and the company lowered its 2025 net income outlook. </p><p class=\"\">The company reported fiscal Q1 adjusted net income of $1.63 per diluted share, down from $4.12 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.55. </p><p class=\"\">Net sales for the fiscal quarter ended Dec. 27 was $661.6 million, down from $798.5 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $679.8 million. </p><p class=\"\">The electronic components maker said it now expects fiscal 2025 adjusted net income outlook of $5.75 to $6.85 per diluted share. That compares with its previous guidance of $7.80 to $8.90. Analysts polled by FactSet expect $8.38.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309084:0/",
            "pub_date": "2025-02-05 01:03:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUCBV1JJL:0",
            "title": "Dormakaba Expects Net Sales And Adj Ebitda Margin To Be In Line With 2024/25 FY Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DORMAKABA HOLDING AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PROFIT HIKE – SIGNIFICANT INCREASE IN PROFIT EXPECTED FOR THE FIRST HALF-YEAR 2024/25</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">NET SALES AND ADJUSTED EBITDA MARGIN ARE EXPECTED TO BE IN LINE WITH 2024/25 FULL-YEAR GUIDANCE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SIGNIFICANT INCREASE IN REPORTED OPERATING PROFIT AND NET PROFIT IS ATTRIBUTABLE TO LOWER RESTRUCTURING COSTS AND GOODWILL AMORTIZATION AS WELL AS SALE OF A SITE IN MONTREAL.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">IS EXPECTING TO REPORT A SIGNIFICANT INCREASE IN REPORTED OPERATING PROFIT AND NET PROFIT FOR FIRST HALF-YEAR 2024/25 FOR PERIOD ENDING 31 DECEMBER 2024 RELATIVE TO PERIOD ENDING 31 DECEMBER 202</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUCBV1JJL:0-dormakaba-expects-net-sales-and-adj-ebitda-margin-to-be-in-line-with-2024-25-fy-guidance/",
            "pub_date": "2025-02-05 01:04:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008911:0",
            "title": "Stockholm Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  OMX Stockholm 30 Index      2,638.46      +5.83      +0.22 <br/>  Index Components <br/>  ABB                           597.20      +0.60      +0.10 <br/>  Alfa Laval                    487.80       unch       unch <br/>  Assa Abloy Series B           333.60      +1.70      +0.51 <br/>  AstraZeneca                 1,522.00     -44.00      -2.81 <br/>  Atlas Copco A                 185.20      +2.20      +1.20 <br/>  Atlas Copco Series B          163.95      +1.75      +1.08 <br/>  Boliden                       334.50      +3.80      +1.15 <br/>  Electrolux Series B            96.74      -0.58      -0.60 <br/>  Ericsson B                     83.22      -0.30      -0.36 <br/>  Essity Series B               275.80      -2.00      -0.72 <br/>  Evolution Gaming Group        842.00      +6.60      +0.79 <br/>  Getinge Series B              214.50       unch       unch <br/>  H&amp;M Hennes &amp; Mauritz B        148.30      +2.70      +1.85 <br/>  Hexagon Series B              129.35      +0.75      +0.58 <br/>  Investor Series B             306.70      +0.25      +0.08 <br/>  Kinnevik Series B              87.48      +0.32      +0.37 <br/>  Nibe Industrier Series B       43.49      -0.01      -0.02 <br/>  Nordea Bank                   128.55      -1.55      -1.19 <br/>  Saab AB Series B              237.65      -5.65      -2.32 <br/>  Samhaellsbyggnadsbolaget        5.43      -0.05      -0.98 <br/>  Sandvik                       226.60      +1.40      +0.62 <br/>  Sinch                          23.59      +0.77      +3.37 <br/>  Skandinaviska Enskilda A      155.95      +1.00      +0.65 <br/>  SKF Series B                  218.40      +0.70      +0.32 <br/>  Svenska Cellulosa Ser B       152.00      -0.35      -0.23 <br/>  Svenska Handelsbnkn Ser A     121.90      +0.30      +0.25 <br/>  Swedbank Series A             239.80      +1.40      +0.59 <br/>  Tele2 Series B                121.55      -1.00      -0.82 <br/>  Telia                          32.78      +0.16      +0.49 <br/>  Volvo Series B                307.10      -0.40      -0.13 <br/>Prices in Swedish Krona <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008911:0/",
            "pub_date": "2025-02-05 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}