{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV08S:0",
            "title": "TomTom Q4 EBIT Loss EUR 6.1 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TomTom NV :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025: LOCATION TECHNOLOGY REVENUE EUR 440 MILLION - EUR 490 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 FREE CASH FLOW IS OUTFLOW OF EUR 5.1 MILLION VERSUS OUTFLOW OF EUR 10 MILLION IN COMPANY-COMPILED CONSENSUS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 REVENUE EUR 142 MILLION VERSUS EUR 141 MILLION IN COMPANY-PROVIDED CONSENSUS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 REVENUE IN LOCATION TECHNOLOGY EUR 122 MILLION VERSUS EUR 124 MILLION IN COMPANY-PROVIDED CONSENSUS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025: FREE CASH FLOW BREAK-EVEN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 REVENUE IN CONSUMER EUR 20.0 MILLION VERSUS EUR 17 MILLION IN COMPANY-PROVIDED CONSENSUS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 EBIT EUR -6.1 MILLION VERSUS EUR -3 MILLION IN COMPANY-PROVIDED CONSENSUS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025: REVENUE EUR 505 MILLION - EUR 565 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 GROSS RESULT EUR 124.4 MILLION VERSUS EUR 124 MILLION IN COMPANY-PROVIDED CONSENSUS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV08S:0-tomtom-q4-ebit-loss-eur-6-1-million/",
            "pub_date": "2025-02-04 14:14:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:f31cfeb5d094b:0",
            "title": "Tokenized RWA markets return to ATH levels as tokens lead crypto recovery",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Real-world asset tokenization markets have returned to their all-time high in terms of value tokenized onchain as related RWA tokens led crypto market recovery on Feb. 3. </p><p class=\"\">The total value locked onchain for real-world asset (RWA) tokenization markets has reached an all-time high of $17.1 billion, just under the level first tapped in mid-January. </p><p class=\"\">Additionally, TVL for the sector has increased 94% since the same time last year, according to industry analytics platform RWA.xyz. <span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:590.1840490797546px;max-width:1200px;aspect-ratio:2.0332640332640333\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:f31cfeb5d094b-90b9e4b6fd957d3630958072720fc83d-resized.webp\" type=\"images/webp\"/><img alt=\"RWA, RWA Tokenization\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:f31cfeb5d094b-90b9e4b6fd957d3630958072720fc83d-resized.jpeg\" style=\"background-color:#f3f5f8\"/></picture></div></figure></span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RWA tokens leading markets </strong></p><p class=\"\">It comes as RWA-related digital assets lead the crypto market recovery on Feb. 3, boosted by news that US President Donald Trump has put a temporary hold on tariffs aimed at Canada and Mexico.</p><p class=\"\">While total crypto market capitalization has gained around 7% over the past 24 hours, RWA-related digital assets have been surging even more. </p><p class=\"\">Blockchain oracle provider for real-world assets Chainlink  saw its native token surge 22% over the past 24 hours to top $21 at the time of writing, recovering from a dump to $17 on Feb. 3. </p><p class=\"\">RWA-focused layer-1 blockchain Mantra (OM) saw its native token surge 23% to reclaim $6, while DeFi platform Ondo Finance (ONDO) skyrocketed almost 27% to reach $1.40 after slumping below $1.10 the previous day, according to CoinGecko. </p><p class=\"\">The native token of Chintai (CHEX), a tokenization platform regulated by the Monetary Authority of Singapore, has surged 38% to reach $0.60, following a fall below $0.40 on Feb. 3.</p><p class=\"\">Other RWA-focused crypto assets such as Algorand (ALGO), XDC Network (XDC), Quant (QNT) and Pendle (PENDLE) are also performing better than the wider market at the time of writing. </p><p class=\"\">Pav Hundal, lead analyst with Australia-based crypto platform Swyftx, told Cointelegraph that “nothing about the market is normal right now, including this rebound,” adding: </p><div class=\"blockquote-xrkxvh37\">“I read this as a speculative rotation by the market. Tokenization has been a bit of a market wallflower recently for reasons that are not easily explicable. But we are talking about projects that create real solutions to support markets like bonds and equities.”</div><p class=\"\">“This market rebound gives us a whole new perspective on the altcoin buffet. All of a sudden investors have a larger menu to choose from,” he said. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Wall Street positive on RWA wave</strong></p><p class=\"\">RWA tokenization market TVL started to skyrocket in early November coinciding with the crypto market surge. Since then it has gained around 26% or roughly $4 billion. </p><p class=\"\">The lion’s share of onchain value, or almost 70%, is private credit, followed by US Treasury debts representing 21%, according to RWZ.xyz. </p><p class=\"\">Meanwhile, Wall Street giants are also betting on the projected $30 trillion RWA tokenization market, wrote Haqq Network co-founder Andrey Kuznetsov on Feb. 1. Asset tokenization is “fundamentally changing financial markets,” he said, adding, “Wall Street titans are sensing the signs and preparing to lead this change.”</p><p class=\"\">Eli Cohen, general counsel of the RWA tokenization platform Centrifuge, expects the Trump administration to publically renounce restrictive policies, further encouraging RWA market growth this year. </p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:f31cfeb5d094b:0-tokenized-rwa-markets-return-to-ath-levels-as-tokens-lead-crypto-recovery/",
            "pub_date": "2025-02-04 14:15:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000547:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 1 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Pauses Tariffs on Mexico, Canada. China Levies Are Still Happening-for Now.</strong></p><p class=\"\">Tariffs on Canada and China are still going ahead for now.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Will Be Especially Bad for Europe. What They Mean for European Stocks.</strong></p><p class=\"\">The continent's economies are weaker than those in North America.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</strong></p><p class=\"\">Manufacturers anticipate higher costs for steel and aluminum would arise from Trump administration tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</strong></p><p class=\"\">The department said it began the year with more cash on hand than planned.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bitcoin rebounds after Trump pauses Mexico, Canada tariffs. Here's why the crypto reacts to tariffs.</strong></p><p class=\"\">Bitcoin rebounded to above $100,000 Monday evening, after President Donald Trump said he would pause imposing tariffs on Mexico and Canada, respectively.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Futures Set New Record on Safe-Haven Demand</strong></p><p class=\"\">Gold futures set a fresh record in volatile trading as traders digested U.S. President Trump's tariff plans.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed interest-rate cuts might not come anytime soon, two top officials say</strong></p><p class=\"\">Two senior Federal Reserve officials said Monday that they are in no rush to cut interest rates further given the uncertainty surrounding the U.S. economic outlook and the White House's new policies, including tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bessent Takes Helm of Consumer Finance Watchdog, Orders Halt to Work</strong></p><p class=\"\">Treasury Secretary Scott Bessent is ordering a freeze to work at the Consumer Financial Protection Bureau, after being named its acting director by President Trump</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000547:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-1-am-et/",
            "pub_date": "2025-02-04 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000548:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 1 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">China Probes Google Over Potential Violation of Antitrust Law</strong></p><p class=\"\">The country's market regulator has initiated an investigation into technology giant Google on suspected violation of antitrust law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apple escaped tariffs last time. This time, it may have to raise prices.</strong></p><p class=\"\">Apple was one of the luckier consumer-electronics companies when it got exemptions on the tariffs imposed by the first Trump administration on many goods made in China. But this time, it might not be quite as fortunate.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gardasil Worries Loom as Merck Reports Earnings</strong></p><p class=\"\">Merck shares are down more than 20% over the past 12 months after trouble with sales of its Gardasil vaccine in China</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nvidia's stock falls as these two questions dog investors</strong></p><p class=\"\">Wall Street is trying to assess how tariffs would impact the chip sector. Plus, the DeepSeek fallout lingers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Berkshire Adds to Its Sirius Position</strong></p><p class=\"\">It now holds a $2.9 billion stake in the satellite radio company.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</strong></p><p class=\"\">Manufacturers anticipate higher costs for steel and aluminum would arise from Trump administration tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Outdoor Apparel Brands Retailer Liberated Files for Bankruptcy</strong></p><p class=\"\">Liberated Brands, an apparel seller under labels that include Volcom, Billabong and Spyder, has filed for bankruptcy and plans to shut more than 120 stores in North America after struggling with shoppers shifting to fast fashion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pepsi Has Lost Some Fizz. Watch for Snack Sales in Earnings.</strong></p><p class=\"\">The rising popularity of weight-loss drugs could further dampen appetite for snacks and sugary drinks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Is About to Report Its Earnings. The Stock Has Been Floundering.</strong></p><p class=\"\">The CEO said last month that the drugmaker had cut costs, revamped its sales operation, and made other big fixes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000548:0-news-highlights-top-company-news-of-the-day-tuesday-at-1-am-et/",
            "pub_date": "2025-02-04 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV08M:0",
            "title": "Grab and GoTo in advanced merger talks, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Southeast Asian ride-hailing and food delivery company Grab (Grab.O) is in advanced talks to merge with its smaller Indonesian rival GoTo  as the firms seek to stem years of losses, two sources familiar with the matter told Reuters.</p><p class=\"\">A new round of merger talks, which were last held in 2024, resumed in December, with investors eager to reach a deal in 2025. An agreement may not happen, said the sources, with on-and-off negotiations in previous years all falling through. The people declined to be identified as the talks are private.</p><p class=\"\">Grab and Gojek declined to comment. The revived talks were first reported by DealStreetAsia.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV08M:0-grab-and-goto-in-advanced-merger-talks-sources-say/",
            "pub_date": "2025-02-04 14:16:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446479:0",
            "title": "Dollar Edges Higher as US-China Trade War Escalates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The dollar index rose toward 109 on Tuesday as the 10% US tariffs on imports from China took effect, marking the start of a trade war that could have significant economic repercussions.</p><p class=\"\">China immediately retaliated by imposing its own tariffs on selected US exports, including oil, gas, coal, cars, and farm equipment, effective February 10.</p><p class=\"\">Markets are now weighing the potential impacts of these tariffs on growth and inflation, further clouding the outlook for Federal Reserve monetary policy.</p><p class=\"\">Meanwhile, President Trump agreed late on Monday to \"immediately pause\" planned tariffs on Mexico and Canada for a month, following successful negotiations with their leaders.</p><p class=\"\">Elsewhere, traders are closely watching Friday's nonfarm payrolls report, which is expected to offer more insight into the health of the labor market.</p><p class=\"\">The dollar saw the most significant appreciation against the Australian dollar and the New Zealand dollar, both of which are liquid proxies for the Chinese yuan.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446479:0-dollar-edges-higher-as-us-china-trade-war-escalates/",
            "pub_date": "2025-02-04 14:16:30",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463222:0",
            "title": "Gland Pharma's Consolidated Profit Increases in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gland Pharma  said its attributable consolidated profit increased to 2.05 billion Indian rupees in the fiscal third quarter from 1.92 billion rupees a year ago, according to a Monday filing with the Indian exchanges by the pharmaceuticals company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 12.42 rupees from 11.65 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 dropped year on year to 13.8 billion rupees from 15.5 billion rupees, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463222:0/",
            "pub_date": "2025-02-04 14:17:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV06H:0",
            "title": "Romania's OMV Petrom Q4 operating result falls 57% year-on-year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Romanian oil and gas group OMV Petrom  reported on Tuesday a 57% fall year-on-year in its fourth-quarter adjusted operating profit, citing weaker commodity prices as well as the impact of gas and power regulations. </p><p class=\"\">The Bucharest-listed company posted an operating profit adjusted for clean current cost of supply of 955 million lei ($197.61 million), compared to 2.24 billion lei a year earlier.</p><p class=\"\">($1 = 4.8328 lei)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV06H:0-romania-s-omv-petrom-q4-operating-result-falls-57-year-on-year/",
            "pub_date": "2025-02-04 14:18:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446480:0",
            "title": "Oil Drops Further After China Announces Retaliatory Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WTI crude oil futures fell below $72 per barrel on Tuesday after China announced a package of tariffs on a range of U.S. products in response to President Donald Trump's tariffs, heightening concerns about a potential trade war between the world’s two largest economies.</p><p class=\"\">China said it will impose tariffs of 15% on coal and LNG imports from the U.S. and 10% on crude oil, farm equipment, and certain cars, effective February 10.</p><p class=\"\">This move came after the passing of a deadline that imposed a 10% U.S. tariff on all Chinese goods.</p><p class=\"\">Trump had earlier delayed planned levies on Canada and Mexico by a month after both countries agreed to boost border enforcement to address Trump's concerns over immigration and drug smuggling.</p><p class=\"\">Elsewhere, OPEC and its allies upheld their existing oil production plans at a review meeting on Monday, despite Trump’s calls to lower crude prices by expanding output.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446480:0-oil-drops-further-after-china-announces-retaliatory-tariffs/",
            "pub_date": "2025-02-04 14:19:38",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446481:0",
            "title": "Brent Drops Further After China Announces Retaliatory Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brent crude oil futures fell toward $75 per barrel on Tuesday after China announced a package of tariffs on a range of U.S. products in response to President Donald Trump's tariffs, heightening concerns about a potential trade war between the world’s two largest economies.</p><p class=\"\">China said it will impose tariffs of 15% on coal and LNG imports from the U.S. and 10% on crude oil, farm equipment, and certain cars, effective February 10.</p><p class=\"\">This move came after the passing of a deadline that imposed a 10% U.S. tariff on all Chinese goods.</p><p class=\"\">Trump had earlier delayed planned levies on Canada and Mexico by a month after both countries agreed to boost border enforcement to address Trump's concerns over immigration and drug smuggling.</p><p class=\"\">Elsewhere, OPEC and its allies upheld their existing oil production plans at a review meeting on Monday, despite Trump’s calls to lower crude prices by expanding output.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446481:0-brent-drops-further-after-china-announces-retaliatory-tariffs/",
            "pub_date": "2025-02-04 14:19:58",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0H3:0",
            "title": "Indian shares rise on easing global trade worries",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** India's benchmark indexes NSE Nifty 50  and BSE Sensex  rise about 0.8% each after the U.S. pauses its planned tariffs on Canada and Mexico    </p><p class=\"\">** Meanwhile the U.S. tariffs on Chinese imports come into effect, China responds in kind </p><p class=\"\">** The usage of tariffs as a tool for negotiation by the U.S. adds to market uncertainty, but the situation is unlikely to spiral out of control as evidenced by the pause on Mexico and Canada, says Harish Krishnan, co-chief investment officer and head of equity at Aditya Birla Sun Life AMC    </p><p class=\"\">** 12 of 13 major sectors advance; small-caps  and mid-caps  gain 0.3% and 1%, respectively</p><p class=\"\">** The three heaviest Nifty 50 stocks advance; private lender HDFC Bank  gains 1%, while Reliance Industries  and ICICI Bank  rise 1.6% each</p><p class=\"\">** Divi's Labs  rises 4% on third-quarter profit beat</p><p class=\"\">** ONGC  adds 2.5% after brokerages highlight scope for better earnings due to robust production growth</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0H3:0-indian-shares-rise-on-easing-global-trade-worries/",
            "pub_date": "2025-02-04 14:20:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463228:0",
            "title": "Saudi Fisheries Signs 12-month Contract for Feed Production with Arasco",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Saudi Fisheries (SASE:6050) on Monday signed a 12-month nonbinding memorandum of understanding with Arabian Agricultural Services Co., or Arasco. </p><p class=\"\">The fishing company and the agricultural products manufacturer will develop a general framework, define the work's scope, and explore potential areas for cooperation in feed production, according to a Tuesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463228:0/",
            "pub_date": "2025-02-04 14:11:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CA:0",
            "title": "Navigation specialist TomTom's 2024 revenue drops on automotive market concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dutch digital mapping specialist TomTom  reported a 2% drop in its full-year revenue on Tuesday, slightly above expectations, impacted by a deterioration of the global automotive market.</p><p class=\"\">The Amsterdam-based company posted a revenue of 574.4 million euros ($591.17 million) for the year ended Dec. 31, above the 573 million euros expected in a company-provided consensus.</p><p class=\"\">It now expects group revenue between 505 million euros and 565 million euros, location technology revenue between 440 million euros and 490 million euros, and free-cash flow at break-even in 2025.</p><p class=\"\">($1 = 0.9716 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CA:0-navigation-specialist-tomtom-s-2024-revenue-drops-on-automotive-market-concerns/",
            "pub_date": "2025-02-04 14:12:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1C7:0",
            "title": "Austrian OMV reports FY results led by chemicals division",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Austrian oil and gas firm OMV  on Tuesday reported full-year results in line with expectations, as better performance at its chemicals division offset weakness at its fuel and feedstock and energy divisions. </p><p class=\"\">The Vienna-based company reported a clean operating result of 5.14 billion euros, down 15% year-on-year but roughly in line with expectations of 5.13 billion euros, according to a consensus compiled by Vara Research.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1C7:0-austrian-omv-reports-fy-results-led-by-chemicals-division/",
            "pub_date": "2025-02-04 14:12:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463226:0",
            "title": "Arab National Bank Closes SAR3.4 Billion Additional Tier 1 Capital Sukuk Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab National Bank (SASE:1080) finalized its private placement of a 3.35 billion-Saudi-riyal additional tier 1 capital sukuk. </p><p class=\"\">A total of 3,350 perpetual bonds, with a par value of 1 million riyals and carrying an annual return rate of 6.20% were issued, according to a Tuesday release from the Saudi Arabia-based bank.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463226:0/",
            "pub_date": "2025-02-04 14:14:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0A6:0",
            "title": "OMV FY Group Sales Of Eur 34 Bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OMV AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GROUP SALES OF EUR 34 BN WITH HIGHER OPERATING CASH FLOW IN FY 2024</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CLEAN CCS OPERATING RESULT AT EUR 5.1 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CASH FLOW FROM OPERATING ACTIVITIES EXCLUDING NET WORKING CAPITAL EFFECTS STRONG AT EUR 5.3 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY 2025 OMV GROUP EXPECTS ORGANIC CAPEX AT AROUND EUR 3.6 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CLEAN CCS NET INCOME ATTRIBUTABLE TO STOCKHOLDERS OF EUR 2.1 BILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CLEAN CCS EARNINGS PER SHARE WERE EUR 6.39</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025:  OMV GROUP ORGANIC CAPEX PROJECTED AT AROUND EUR 3.6 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 AVERAGE BRENT PRICE USD 75/BBL EXPECTED</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 OMV HYDROCARBON PRODUCTION AROUND 300 KBOE/D EXPECTED</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 AVERAGE REALIZED NATURAL GAS PRICE AROUND EUR 35/MWH, WITH A PRICE FORECAST OF EUR 40-45/MWH</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025:  REFINERY UTILIZATION RATE EUROPE BETWEEN 85 AND 90%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 REFINERY UTILIZATION RATE EUROPE BETWEEN 85 AND 90%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0A6:0-omv-fy-group-sales-of-eur-34-bln/",
            "pub_date": "2025-02-04 14:14:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CB:0",
            "title": "Siltronic reports FY preliminary sales in line with market expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">German semiconductor materials supplier Siltronic  reported a 7% drop in its preliminary annual sales on Tuesday, citing high inventory levels amid a delay in demand recovery.</p><p class=\"\">    The company, which makes silicon wafers used in semiconductor chips, posted revenue of 1.41 billion euros  ($1.45 billion) for 2024, down from 1.51 billion euros a year earlier but in line with analysts' forecast of 1.40 billion euros in a poll by Vara research.</p><p class=\"\">($1 = 0.9713 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CB:0-siltronic-reports-fy-preliminary-sales-in-line-with-market-expectations/",
            "pub_date": "2025-02-04 14:14:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463230:0",
            "title": "UBS Plans $3 Billion Share Repurchases in FY25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group  plans to repurchase $1 billion worth of its shares in the first half and another $2 billion in the second half. </p><p class=\"\">The Swiss bank announced the repurchase targets with its 2024 results on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463230:0/",
            "pub_date": "2025-02-04 14:15:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463219:0",
            "title": "Container Throughput at Chinese Trade Corridor Rises in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Container throughput at China's New International Land-Sea Trade Corridor, which connects the western part of the country to the world, jumped 31% to 104,000 twenty-foot equivalent units in January, Xinhua News Agency reported Monday, citing the China Railway Nanning Group. </p><p class=\"\">The 100,000 TEU milestone was achieved the fastest during the period since its opening in 2017, the report said. </p><p class=\"\">Among those transported through the corridor in January include phosphate rock powder, zinc concentrate, pyrophyllite, paper pulp and other goods, the report said. </p><p class=\"\">The trade corridor is based in Chongqing and spans railways, sea routes, and highways in southern Chinese provincial regions, the report said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463219:0/",
            "pub_date": "2025-02-04 14:15:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV008:0",
            "title": "Reka Kumi Invests In Energy Efficiency And Co2 Emissions Reduction",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reka Industrial Oyj :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">REKA KUMI INVESTS IN ENERGY EFFICIENCY AND CO2 EMISSIONS REDUCTION AT THE AURA FACTORY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">TOTAL INVESTMENT IN ENERGY PROJECT IS ABOUT 1.35 MILLION EUROS, BUSINESS FINLAND HAS GRANTED PROJECT 20% ENERGY SUBSIDY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV008:0-reka-kumi-invests-in-energy-efficiency-and-co2-emissions-reduction/",
            "pub_date": "2025-02-04 14:03:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:0b2e09f68094b:0",
            "title": "Thomas Cook shares drop 12% after firm's Q3 net profit falls 40% to Rs 50 crore",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thomas Cook shares dropped over 12 percent on February 4, a day after the company announced its Q3 FY25 earnings results. The company reported a major decline of nearly 40 percent in its Q3 net profit during the post-market hours of February 3.</p><p class=\"\">Shares of Thomas Cook (India) Ltd are trading at Rs 143.95 apiece, as seen at 11.24 am. This marks a decline of 12.01 percent from the stock's previous closing price.</p><p class=\"\">Read about Stock Market updates LIVE</p><p class=\"\">Thomas Cook's consolidated results for the quarter ended December 2024 reflected higher sales, with an increase of 8.87 percent to Rs 2,061.01 crore, as against Rs 1,893.13 crore in the same quarter of the previous year (December 2023).</p><p class=\"\">Despite the rise in sales, the company experienced a significant decline in net profit, which dropped by 39.82 percent to Rs 49.58 crore in the quarter ended December 2024, from Rs 82.39 crore in the corresponding quarter of the previous year. Therefore, higher sales did not translate into proportional profitability, possibly due to increased costs or reduced margins.</p><p class=\"\">In another exchange filing, the company notified that Madhavan Menon, chairperson of Thomas Cook India, has been redesignated as non-executive chairman of the board of the travel company. In its filings to BSE on Monday, the travel company said that he will change from his current role starting 1 June.</p><p class=\"\">Menon was re-appointed as executive chairman of the company for another term of five years, back in July 2023. However, the board has now redesignated him as non-executive chairman upon him having requested for the same.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:0b2e09f68094b:0-thomas-cook-shares-drop-12-after-firm-s-q3-net-profit-falls-40-to-rs-50-crore/",
            "pub_date": "2025-02-04 14:05:30",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUABM8LCD:0",
            "title": "Fagron Acquires Guinama In Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fagron NV :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FAGRON SOLIDIFIES ITS LEADERSHIP POSITION WITH THE ACQUISITION OF GUINAMA IN SPAIN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACQUISITION VALUED AT €22 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">KEY SYNERGIES INCLUDE OPTIMIZED SOURCING AND CENTRALIZED WAREHOUSING</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUABM8LCD:0-fagron-acquires-guinama-in-spain/",
            "pub_date": "2025-02-04 14:06:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CD:0",
            "title": "At & S Says Anticipates Price Pressure To Continue Beyond End Of Fiscal Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AT &amp; S Austria Technologie &amp; Systemtechnik AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ANTICIPATES PRICE PRESSURE TO CONTINUE BEYOND END OF FISCAL YEAR</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">AT&amp;S NOW ASSUMES FY 2026/27 REVENUE OF ABOUT EUR 2.1 TO EUR 2.4 BILLION (PREVIOUSLY: EUR 3 BILLION)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY 2026/27 EXPECTS AN EBITDA MARGIN OF 24 TO 28% (PREVIOUSLY: 27 TO 32%)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">REDUCTION OF UP TO 1,000 EMPLOYEES TAKING PLACE AT EXISTING LOCATIONS, NEARLY COMPLETED</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2024/25: PLANNING INVESTMENTS OF JUST UNDER EUR 500 MILLION (PREVIOUSLY: ROUGHLY EUR 500 MILLION)</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CD:0-at-s-says-anticipates-price-pressure-to-continue-beyond-end-of-fiscal-year/",
            "pub_date": "2025-02-04 14:06:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA32HSXF:0",
            "title": "Lugman Group Withdraws From Purchase Of “Industrial Park Fechenheim”",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clariant AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">LUGMAN GROUP WITHDRAWS FROM PURCHASE OF “INDUSTRIAL PARK FECHENHEIM”</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLARIANT AG - REMAINS COMMITTED TO DIVEST \"INDUSTRIAL PARK FECHENHEIM\" AS COMPANY HAS NO OPERATIONAL ACTIVITIES IN INDUSTRIAL PARK</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA32HSXF:0-lugman-group-withdraws-from-purchase-of-industrial-park-fechenheim/",
            "pub_date": "2025-02-04 14:06:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV055:0",
            "title": "US dollar ratchets higher as China tariffs kick in; Aussie slides with yuan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Deadline passes without deal, spurring reciprocal measures from Beijing</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. President Trump earlier granted 30-day reprieve to Canada, Mexico</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Yuan, Aussie, Canadian dollar, Mexican peso, euro all see selling</li></ul></span></div><span><p class=\"\">    The dollar strengthened broadly on Tuesday after U.S. tariffs on Chinese goods came into effect, triggering swift retaliation from Beijing and prompting a selloff in the Chinese yuan and the Australian dollar.</p><p class=\"\">        The Canadian dollar and Mexican peso also weakened despite earlier winning a reprieve on their own U.S. tariffs. The euro declined, with the European Union also finding itself in Washington's trade crosshairs.</p><p class=\"\">    U.S. President Donald Trump's administration slapped additional 10% tariffs on imports from China from 12:01 a.m. ET on Tuesday (0501 GMT).   </p><p class=\"\">    Beijing responded with tariffs to take effect Feb. 10 on things such as American cars, farm equipment and energy shipments.  </p><p class=\"\">    That reignited worries about a widening and possibly protracted global trade war, which had receded somewhat overnight following Trump's last-minute deals with Ottawa and Mexico City.  </p><p class=\"\">    \"Unlike Canada and Mexico, it is clearly harder for the U.S. and China to agree on what Trump demands economically and politically,\" said Gary Ng, senior economist at Natixis.  </p><p class=\"\">    \"The previous market optimism on a quick deal still looks uncertain. Even if the two countries can agree on some issues, it is possible to see tariffs being used as a recurrent tool, which can be a key source of market volatility this year.\"  </p><p class=\"\">        The Chinese yuan edged down about 0.3% to 7.3213 per dollar in offshore trading , although that was well back from the record trough reached overnight at 7.3765 yuan. There is no official yuan trading until Wednesday, with mainland markets still closed for the week-long Lunar New Year holidays.</p><p class=\"\">    The Aussie , which often acts as a liquid proxy for the yuan, sank 0.7% to $0.6186, but that was well above Monday's low of $0.60886, the weakest level in nearly five months.  </p><p class=\"\">Those currencies, along with Canada's loonie, Mexico's peso and the euro, had rebounded sharply overnight after both Canadian Prime Minister Justin Trudeau and Mexican President Claudia Sheinbaum said they had agreed to bolster border enforcement efforts in response to Trump's demand to crack down on immigration and drug smuggling, leading to a 30-day reprieve on 25% tariffs.</p><p class=\"\">The loonie  lost 0.4% to C$1.4485 against its U.S. counterpart on Tuesday, following a sharp rebound from a low of C$1.4792 on Monday, the weakest level since 2003.</p><p class=\"\">The peso was about 0.4% lower at 20.4100 per dollar , but well above the previous session's nearly three-year trough at 21.1882.</p><p class=\"\">\"Risk sentiment improved markedly following the late-day announcement, but we'd caution that trade concerns could start to weigh on markets again if there are no tangible signs of progress on a lasting deal by the end of the month,\" TD Securities analysts wrote in a note.</p><p class=\"\">\"Our tracking of trading uncertainty is rising, not falling, suggesting markets will continue to price in a risk premium in FX associated with this theme of disruption.\"</p><p class=\"\">TD expects \"USDCAD dips will be brief and shallow\", and the currency pair will rise to C$1.50 by end-March, based on Canada's \"relatively weak macro story\", as well as trade uncertainty.</p><p class=\"\">The euro  slid 0.4% to $1.0297, after recovering from the lowest since November 2022 at $1.0125 on Monday.</p><p class=\"\">    Sterling  declined 0.4% to $1.24047, despite Trump's suggestion that Britain might be spared tariffs.</p><p class=\"\">The U.S. dollar gained 0.3% to 155.24 yen .</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV055:0-us-dollar-ratchets-higher-as-china-tariffs-kick-in-aussie-slides-with-yuan/",
            "pub_date": "2025-02-04 14:06:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463214:0",
            "title": "Australian Shares Flat as Trump Moves to Delay Taxes on Canada, Mexico;Seek, Xref Agree to Terminate Scheme for Proposed Merger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australian shares were flat with a negative bias on Tuesday's close, as US President Trump agreed with Mexico and Canada to delay tariffs for a month. </p><p class=\"\">The S&amp;P/ASX 200 Index changed little to close at 8,374. </p><p class=\"\">Trump's move to postpone tariffs on Mexico and Canada helped shift market sentiment, reversing Monday's losses, Bloomberg reported. </p><p class=\"\">With no deal yet, it is unclear whether talks have failed or if it is in a \"wait and see\" phase, making markets increasingly edgy, the report said. </p><p class=\"\">On the domestic front, Australia's national home values barely moved in January, with the CoreLogic Home Value Index little changed, the property data provider said in a report. </p><p class=\"\">Consumer confidence in Australia rose to its highest level in nearly three years last week, with households feeling more upbeat about their short-term economic prospects, according to a survey by ANZ Research and Roy Morgan Research. </p><p class=\"\">The Melbourne Institute's monthly inflation gauge edged 0.1% higher in January, according to a Monday report. </p><p class=\"\">In company news, Westpac Banking  appointed Paul Fowler as chief executive of its business and wealth unit. </p><p class=\"\">Woolworths Group  reorganized its retail business, with Metro, red meat supply business Greenstock, and Woolworths Food Company Retail moving into the retail business. </p><p class=\"\">Seek  and Xref  agreed to terminate their scheme implementation deed for Seek to acquire Xref. Shares of Xref fell nearly 23% at market close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463214:0-australian-shares-flat-as-trump-moves-to-delay-taxes-on-canada-mexico-seek-xref-agree-to-terminate-scheme-for-proposed-merger/",
            "pub_date": "2025-02-04 14:07:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463218:0",
            "title": "Court Sides with Shuaa Capital in Former Board Member's Labor Dues Claim",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shuaa Capital (DFM:SHUAA) received a favorable court judgment in a case filed by a former board member claiming labor dues. </p><p class=\"\">The Dubai-listed financial services company said Tuesday the former board member had filed a claim for 22 million Emirati dirhams of labor dues.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463218:0/",
            "pub_date": "2025-02-04 14:09:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV09L:0",
            "title": "Automation Systems Says Consob Suspends Review Period For Offer Document Approval In Bid For Piovan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Piovan SpA  on behalf Automation Systems SpA:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAID ON MONDAY ITALY'S MARKET WATCHDOG CONSOB HAD SUSPENDED TIME LIMIT OF REVIEW PERIOD FOR MANDATORY TENDER OFFER DOCUMENT IN BID FOR PIOVAN </p></li></ul><p class=\"\"> Further company coverage:  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV09L:0-automation-systems-says-consob-suspends-review-period-for-offer-document-approval-in-bid-for-piovan/",
            "pub_date": "2025-02-04 14:09:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463220:0",
            "title": "Dredging Corporation of India's Profit Slides in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dredging Corporation of India  witnessed a decline in its profit to 160.6 million Indian rupees in the fiscal third quarter ended Dec. 31, 2024, from 272.3 million rupees a year ago. </p><p class=\"\">Earnings per share contracted to 5.73 rupees compared with 9.72 rupees of the corresponding period last year, according to a Monday filing with the Indian stock exchanges. </p><p class=\"\">Revenue from operations in fiscal Q3 increased to 3.24 billion rupees from 2.65 billion rupees a year earlier. </p><p class=\"\">Shares of the company were up nearly 2% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463220:0/",
            "pub_date": "2025-02-04 14:09:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0E0:0",
            "title": "Ossdsign Proposes That No Dividend Be Paid For 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OssDsign AB :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOD PROPOSES DIRECTORS PROPOSES THAT NO DIVIDEND BE PAID FOR FINANCIAL YEAR 2024</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0E0:0-ossdsign-proposes-that-no-dividend-be-paid-for-2024/",
            "pub_date": "2025-02-04 14:00:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}