{
    "data": [
        {
            "id": "cryptopotato:f09b50da7094b:0",
            "title": "Are Cardano Bulls in Trouble? Whales Unload Millions Worth of ADA",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">One popular analyst claimed that ADA whales haven’t bought the dip. Instead, they have sold almost $250 million worth of the asset.</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Contrary to the recent crash, analysts predict a reversal to over $1, with factors like a potential Ripple-Cardano partnership and regulatory efforts boosting optimism.</li></ul></span></div><span><p class=\"\">TL;DR</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1000.8333333333333px;aspect-ratio:1.6680555555555554\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cryptopotato:f09b50da7094b-322e85841cd1f421d81489a4fdd01aa2-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cryptopotato:f09b50da7094b-322e85841cd1f421d81489a4fdd01aa2-resized.jpeg\" style=\"background-color:#81adc6\"/></picture></div></figure></span><p class=\"\">Another Correction on the Horizon?</p><p class=\"\">The cryptocurrency market declinewitnessedat the start of the business week has been ravaging for numerous well-known altcoins.</p><p class=\"\">Cardano’s ADA was among the worst affected, with its price plummeting from over $0.90 to as low as $0.60. In the past several hours, it rebounded to the current $0.75 (per CoinGecko’s data), representing a 21% plunge on a weekly scale.</p><p class=\"\">According to one crucial factor, ADA might be on the verge of another substantial correction. The popular X user Ali Martinez recently revealed that whales have sold over 330 million tokens (worth almost $250 million) and haven’t bought the dip yet.</p><p class=\"\">A massive sell-off coming from large investors floods the market with excess supply, potentially outpacing demand and creating a downward pressure on the valuation.</p><p class=\"\">Additionally, the whales’ actions might trigger panic selling among smaller players, which is another bearish element for the price.</p><p class=\"\">It is worth mentioning that accumulating a substantial amount of ADA by large investors may have the opposite effect. As CryptoPotato reported, whales purchased over 130 million tokens towards the end of November when the price was hovering around $1. A few days later, ADA soared to a nearly two-year high of $1.30.The Optimistic Scenario</p><p class=\"\">Despite the latest pullback, some analysts see chances of a revival in the short term. The X user BullishBanter envisioned “a sweep of the lows around $0.75 before a reversal targeting the $0.95 – $1.10 range.”</p><p class=\"\">One factor that may positively impact ADA’s price is the potential collaboration between Ripple and Cardano. As CryptoPotato reported, the bosses of the entities have been actively discussing the possible integration of the stablecoin RLUSD.</p><p class=\"\">Additionally, Charles Hoskinson (Cardano’s founder) revealed his intentions to work alongside Trump’s administration to create a comprehensive and potentially more favorable regulatory environment for the cryptocurrency sector.</p><p class=\"\">To explore other planned upgrades for 2025 that may be welcomed by the bulls, please check out our detailed video below:</p></span></div>",
            "link": "https://www.tradingview.com/news/cryptopotato:f09b50da7094b:0-are-cardano-bulls-in-trouble-whales-unload-millions-worth-of-ada/",
            "pub_date": "2025-02-05 03:10:09",
            "source": "CryptoPotato",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009615:0",
            "title": "Healthcare Stocks Have Gotten a Boost. Now Comes the Hard Part. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jacob Sonenshine</p><p class=\"\">Healthcare stocks have jumped, but the easy money has already been made. Now, these companies have to offer strong profit outlooks to further boost their shares.</p><p class=\"\">The Health Care Select Sector SPDR ETF, home to health insurers, drugmakers, and medical device makers, has gained just over 6% since hitting a multimonth low in late December. That compares with a gain of 1% in the S&amp;P 500 over that period.</p><p class=\"\">Driving the outperformance is that investors and traders have allocated more money to defensive sectors, where demand isn't badly hurt when the broader economy takes a hit. Demand for healthcare doesn't change much, regardless of how much money consumers have to spend.</p><p class=\"\">Interest in defensive shares has grown as the market has become more volatile. Most S&amp;P 500 stocks have stumbled in the past few weeks, partly because President Donald Trump's tariffs would reduce consumer and business demand. Semiconductors stocks have reeled from the tariff issue and because the Chinese artificial intelligence start-up DeepSeek's success in producing AI at lower cost could prompt tech companies to cut back on capital investments. That could reduce chip demand.</p><p class=\"\">The resulting gain in the healthcare fund has pushed the share price to $147, roughly where sellers have consistently come in to knock it lower. Several times in the past year, the fund has gotten knocked down after rallying to the $147 to $150 range.</p><p class=\"\">Headlines showing worsening trade tensions, or other downbeat economic news, could push the fund up to its record high of $157, which it touched in September. That wouldn't be a large gain, and the price didn't remain at a record for long. Sellers came in there, too, promptly knocking it lower.</p><p class=\"\">These stocks, now more expensive, are vulnerable. If earnings don't beat expectations by enough, selling could emerge again. But if the results are satisfactory, the sector could see more gains.</p><p class=\"\">Johnson's &amp; Johnson's earnings in early April are hard to ignore. The company's market capitalization of $366 billion is almost 7% of the total for the entire sector. That gives Johnson &amp; Johnson's stock a significant influence in the movements of the healthcare fund.</p><p class=\"\">The stock has participated in the healthcare rally, so now the market wants to see that its diversified business — just over 60% of revenue is in pharmaceuticals, with a little more than 30% from various medical devices — is providing the stability and mild growth investors expect.</p><p class=\"\">Another company to watch is UnitedHealth, the $504 billion insurer. Its stock has rebounded from its December low as the market has come to the view that bipartisan legislation proposed that month, calling for insurers to part from their pharmacy benefit management businesses, wouldn't hurt much. Analysts estimate that United's PBM business generates just a few hundred million  dollars in annual operating profits, compared with the total of $38.4 billion the company is expected to bring in this year.</p><p class=\"\">The stock is trading at 18 times the per-share earnings expected for the coming year, compared with the peak of 19 over the past decade and 22 times for the S&amp;P 500. The discount was wider in December, and investors have historically rarely bid it up to par.</p><p class=\"\">Now, with the valuation closer to the level for the S&amp;P 500, the company must demonstrate that profits will keep rising rapidly for the stock to rise. In its January earnings release, management told investors to expect full-year sales to fall within a range with a midpoint of $452.5 billion. That implies growth of 13%, which would likely be driven mostly by the millions of new Medicare patients the company continues to sign up each year. The guidance was a few billion dollars above analyst's expectations.</p><p class=\"\">Whether the company demonstrates that type of growth in April, when it next reports its financial results, will be key for the stock. If the company can also keep its medical cost ratio — the percentage of premium revenue that it pays for claims — at near the 86% analysts expect, it will help profit margins remain around where they were last year, supporting earnings growth.</p><p class=\"\">The tax rate was unusually low in 2024, but is expected to go back up this year, keeping earnings from growing as fast as revenue.</p><p class=\"\">But next year, with the tax rate remaining steady and other costs remaining in place, earnings per share should rise to $33.50 from $27.66 last year, FactSet estimates indicate, assuming sales rise to $487 billion. If the market expects EPS at that level at the end of this year, the stock would trade at just over $600, assuming it maintains its price/earnings ratio.</p><p class=\"\">Critical to those expectations is whether sales growth and costs remain on track.</p><p class=\"\">Also worth watching is Eli Lilly, a $769 billion pharmaceuticals gorilla that reports its earnings on Thursday. The stock has rallied recently, so the market needs to see robust growth in its obesity business for the shares to keep rising. Management reduced its forecast for sales in January.</p><p class=\"\">Both Merck and Pfizer reported their earnings Tuesday. Merck stock fell as management released disappointing financial guidance. Pfizer's results were better then expected, helping the stock to rise just over 1% in afternoon trading.</p><p class=\"\">For healthcare investors, identifying the companies that can deliver every quarter will be the key to success.</p><p class=\"\">Write to Jacob Sonenshine at jacob.sonenshine@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009615:0/",
            "pub_date": "2025-02-05 03:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309150:0",
            "title": "Spotify Outlines Strong Quarterly Revenue View After Reporting First Profitable Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spotify Technology  on Tuesday issued an upbeat revenue outlook for the first quarter after closing out its first full year of profitability. </p><p class=\"\">For the ongoing quarter, Spotify expects revenue of 4.2 billion euros ($4.36 billion). Analysts polled by FactSet are looking for 4.18 billion euros. </p><p class=\"\">The company anticipates adding roughly 3 million net new monthly active users, or MAUs, in the first quarter, bringing the total to 678 million. It expects its premium subscribers to increase by 2 million to 265 million. The consensus on Visible Alpha is for 676.5 million MAUs and 263.5 million premium subscribers. </p><p class=\"\">For 2024, the company reported earnings per share of 5.50 euros, swinging from a loss of 2.73 euros in 2023, while revenue grew to 15.67 billion euros from 13.25 billion euros. The Street was looking for EPS of 5.79 euros and revenue of 15.57 billion euros. </p><p class=\"\">Spotify closed out its first full year of profitability, Chief Executive Daniel Ek said on an earnings conference call, according to a FactSet transcript. \"I expect 2025 to deliver healthy growth alongside improved profitability.\"</p><p class=\"\">Spotify's US-listed shares were up 12% in Tuesday afternoon trade. </p><p class=\"\">Revenue jumped 16% year over year to 4.24 billion euros in the quarter through Dec. 31, topping Wall Street's views for 4.15 billion euros. The company posted fourth-quarter earnings of 1.76 euros a share, swinging from a 0.36-euro loss a year earlier. The Street was looking for EPS of 1.99 euros. </p><p class=\"\">Premium revenue grew 17% to 3.71 billion euros, while ad-supported sales increased 7%. MAUs jumped 12% to 675 million, while premium subscribers advanced 11% to 263 million, compared with the Visible Alpha consensus of 666.4 million and 260.4 million, respectively. </p><p class=\"\">\"With respect to the MAU net additions, we had an exceptionally strong (fourth quarter) without performance driven by developing markets, and we are not prioritizing retention of the recent influx of lower engagement users in quarter one as we continue to focus on growing higher value users,\" Chief Financial Officer Christian Luiga told analysts. \"We plan to make targeted investments in our core offerings, which may make our sequential gross margin cadence a bit more variable over the course of this year.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309150:0/",
            "pub_date": "2025-02-05 03:12:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ObinmCQWa:0",
            "title": "Floatel International Ltd: Business update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oslo February 4, 2025</p><p class=\"\">The Company is pleased to present its current trading and Q4-2024 Businessupdate.</p><p class=\"\">HIGHLIGHTSo The Company has placed a USD 15m tap issue on its existing USD 350m seniorsecured bonds. The proceeds will be used to fund capital expenditures on thecurrent fleet.o The revolving credit facility has been temporarily increased from USD 25m toUSD 33.5m and provides further flexibility during a short-term period ofworkingcapital build in connection with contract commencements.o Fleet utilization stood at 37% during the fourth quarter and firm orderbookasof December 31, 2024, was USD 338m.o Recurring EBITDA: USD 50m for the full year; USD 9m in the quarter. The Q4-2024 interim report will be released February 26, 2025, and managementwill host a conference call the same day, at 14.30 CET, to present theresults.Interested persons can register using the details provided on the websitehttps://floatel.no/investors</p><p class=\"\">For further information, please contact:Peter Jacobsson, CEO, +47 934 00 232Tomas Hjelmstierna, CFO, +47 934 00 381Tel: +47 46 50 01 33Email: ir@floatel.no</p><p class=\"\">https://newsweb.oslobors.no/message/637702</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ObinmCQWa:0-floatel-international-ltd-business-update/",
            "pub_date": "2025-02-05 03:13:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6MZrX0:0",
            "title": "New Toll Brothers Model Home Opens at Hidden Oaks Community in Chatsworth, California",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CHATSWORTH, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Toll Brothers, Inc. , the nation’s leading builder of luxury homes, announced the grand opening of its highly anticipated model home at Hidden Oaks, an exclusive community offering 33 luxury new homes in Chatsworth, California. The Sunstone model home, featuring innovative architecture and modern design elements, will be unveiled at a grand opening event this Saturday, February 8, 2025, from 11 a.m. to 2 p.m. at 9563 North Andora Avenue in Chatsworth.</p><p class=\"\">“The new Sunstone model home showcases the exceptional luxury designs that Toll Brothers offers at Hidden Oaks and serves as an inspiration for the finish selections that our home buyers will experience first-hand at the Toll Brothers Design Studio,” said Nick Norvilas, Division President of Toll Brothers in Los Angeles.</p><p class=\"\">Hidden Oaks is an intimate enclave of homes featuring award-winning architecture and innovative new home designs. Just south of the Santa Susana Mountains and located near Westfield Promenade and Topanga Village, this exceptional new community offers a serene and relaxed atmosphere with the convenience of nearby shopping and easy access to freeways, entertainment, and recreation. The four home designs offered range from 3,811 to 5,116+ square feet and feature 5 to 6 bedrooms, 5.5 to 6.5 bathrooms, lofts, flex rooms, and dynamic personalization options that include a floating staircase, prep kitchen, interior and exterior fireplaces, an extended outdoor living room, multi-slide stacking doors, an office, a multi-generational living suite, and a primary suite deck.</p><p class=\"\">Home buyers will experience one-stop shopping at the Toll Brothers Design Studio. The state-of-the-art Design Studio allows home buyers to choose from a wide array of selections to personalize their dream home with the assistance of Toll Brothers professional Design Consultants.</p><p class=\"\">Move-in ready and quick move-in homes with designer-appointed features are available in the community, allowing home buyers the opportunity to move into their new dream home later this year.</p><p class=\"\">For more information on Hidden Oaks, or to request an appointment to learn more about the community and homes for sale, call (844) 700-8655 or visit TollBrothers.com/CA.</p><p class=\"\">About Toll Brothers</p><p class=\"\">Toll Brothers, Inc., a Fortune 500 Company, is the nation’s leading builder of luxury homes. The Company was founded 58 years ago in 1967 and became a public company in 1986. Its common stock is listed on the New York Stock Exchange under the symbol “TOL.” The Company serves first-time, move-up, empty-nester, active-adult, and second-home buyers, as well as urban and suburban renters. Toll Brothers builds in over 60 markets in 24 states: Arizona, California, Colorado, Connecticut, Delaware, Florida, Georgia, Idaho, Indiana, Maryland, Massachusetts, Michigan, Nevada, New Jersey, New York, North Carolina, Oregon, Pennsylvania, South Carolina, Tennessee, Texas, Utah, Virginia, and Washington, as well as in the District of Columbia. The Company operates its own architectural, engineering, mortgage, title, land development, smart home technology, and landscape subsidiaries. The Company also develops master-planned and golf course communities as well as operates its own lumber distribution, house component assembly, and manufacturing operations.</p><p class=\"\">In 2024, Toll Brothers marked 10 years in a row being named to the Fortune World’s Most Admired Companies™ list and the Company’s Chairman and CEO Douglas C. Yearley, Jr. was named one of 25 Top CEOs by Barron’s magazine. Toll Brothers has also been named Builder of the Year by Builder magazine and is the first two-time recipient of Builder of the Year from Professional Builder magazine. For more information visit TollBrothers.com.</p><p class=\"\">From Fortune, ©2024 Fortune Media IP Limited. All rights reserved. Used under license.</p><p class=\"\">Contact: Andrea Meck | Toll Brothers, Senior Director, Public Relations &amp; Social Media | 215-938-8169 | ameck@tollbrothers.com</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/7090110e-aa59-4747-be1c-bdb9b5008623</p><p class=\"\">Sent by Toll Brothers via Regional Globe Newswire (TOLL-REG)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Hidden Oaks by Toll Brothers</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">The new model home at Hidden Oaks by Toll Brothers showcases the community's modern home designs with open floor plans in Chatsworth, Calif.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6MZrX0:0-new-toll-brothers-model-home-opens-at-hidden-oaks-community-in-chatsworth-california/",
            "pub_date": "2025-02-05 03:14:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309165:0",
            "title": "Top Midday Gainers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Quantum BioPharma  said Tuesday that a trial of its dietary supplement, Unbuzzd, confirmed it accelerates alcohol metabolism, speeds the reduction of blood alcohol concentration, and reduces symptoms of intoxication, impairment, and hangover. </p><p class=\"\">Shares surged 72% as intraday trading volume catapulted to over 54.2 million from a daily average of about 114,000. </p><p class=\"\">Lottery.com  shares rose 57% after the company said Tuesday that it launched international lottery operations to generate additional revenue. </p><p class=\"\">More than 105.5 million shares traded intraday compared with a daily average of about 495,000. </p><p class=\"\">Palantir  reported late Monday higher Q4 adjusted earnings and revenue that beat market expectations. Goldman Sachs raised the company's price target to $80 from $41. </p><p class=\"\">Palantir shares jumped 23%, with intraday trading volume rising to over 190.3 million compared with a daily average of about 84.7 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309165:0/",
            "pub_date": "2025-02-05 03:14:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1Q5:0",
            "title": "Goldman Sachs to bring back technology banker Nick Giovanni, memo says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Goldman Sachs  is bringing back Nick Giovanni, who spent more than 20 years at the Wall Street giant in a prior stint, according to an internal memo seen by Reuters on Tuesday.</p><p class=\"\">Giovanni will rejoin Goldman later this month as a partner in the technology, media and telecommunications group of the investment banking segment, the memo said. </p><p class=\"\">He left Goldman in 2021 to become the chief financial officer of grocery delivery platform Instacart , where he contributed to the company's efforts to list on the Nasdaq. He departed Instacart last year.</p><p class=\"\">\"Having operated as a tech executive for the past few years, I hope to bring a new level of insight and empathy to the work in addition to new, innovative solutions that help founders, companies and investors achieve their goals,\" Giovanni said in a LinkedIn post.</p><p class=\"\">During his previous tenure at Goldman, he worked on some of the biggest deals and public offerings for clients including Airbnb , DoorDash  and X, formerly known as Twitter.</p><p class=\"\">A Goldman spokesperson confirmed the contents of the memo. The move was first reported by the New York Times DealBook.</p><p class=\"\">DEALMAKING SURGE</p><p class=\"\">Giovanni's hiring comes as Goldman prepares for a flurry of corporate dealmaking, thanks to the anticipated easing of regulatory burden under President Donald Trump.</p><p class=\"\">\"The backdrop to dealmaking, especially in tech, is quite constructive today,\" said Kim Posnett, global co-head of investment banking, on a podcast Goldman released on Tuesday.</p><p class=\"\">\"In the early days of this year, you've seen a lot of strategic activity. I expect that strategic activity to continue and accelerate throughout the year.\"</p><p class=\"\">Last month, the bank promoted several executives as part of a management reshuffle to reinforce its dominance on Wall Street.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1Q5:0-goldman-sachs-to-bring-back-technology-banker-nick-giovanni-memo-says/",
            "pub_date": "2025-02-05 03:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV132:0",
            "title": "Soybeans climb to highest since July as tariff worries ease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Soybeans avoid hit from Chinese tariffs on US goods</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US suspends planned tariffs against Mexico, Canada</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Weak dollar makes US crops look attractive to importers</li></ul></span></div><span><p class=\"\">    Chicago Board of Trade soybean futures jumped to their highest level since July on Tuesday as concerns eased that trade disputes will disrupt U.S. agricultural exports, analysts said.</p><p class=\"\">Wheat futures  reached their highest level since November, while corn prices  hovered near an October 2023 high reached last week.</p><p class=\"\">Traders have recently been focused on the risk that anticipated tariffs against Canada, Mexico and China could hurt demand for U.S. farm goods as all three nations are major importers.</p><p class=\"\">But U.S. President Donald Trump on Monday postponed tariffs against Mexico and Canada for a month, while China, the world's biggest soybean importer, imposed limited retaliatory tariffs on U.S. goods on Tuesday that did not include the oilseed.</p><p class=\"\">Reports that Trump planned to speak with Chinese President Xi Jinping also suggested to traders that there was scope for China to also receive a temporary reprieve.</p><p class=\"\">\"The general feeling is that China is not going to fight too hard on a trade war, or it's going to get resolved very quickly,\" said Ted Seifried, chief market strategist at Zaner Ag Hedge. </p><p class=\"\">Relief over the suspension of planned U.S. tariffs against Mexico, the biggest importer of U.S. corn, spurred a rebound in CBOT grains on Monday.</p><p class=\"\">Technical buying supported Tuesday's gains, traders said.</p><p class=\"\">Most-active corn futures were up 7-1/4 cents at $4.96 a bushel by 12:35 p.m. CST (1835 GMT), while wheat rose 10-1/2 cents to $5.77-1/4 a bushel.</p><p class=\"\">Soybean futures  climbed 16-1/2 cents to $10.74-3/4 a bushel.</p><p class=\"\">The soy market was capped by a slide in by-product soyoil (BOv1), as the delay of U.S. tariffs against Canada allowed for continued competition from imports of Canadian canola.</p><p class=\"\">But weather risks for South American crops, with drought in Argentina and excess rain in Brazil, continued to underpin corn and soy prices, traders said.</p><p class=\"\">Weakness in the dollar also helped boost prices, as it makes U.S. farm products look more attractive to global buyers, they said.</p><p class=\"\">The U.S. Department of Agriculture confirmed private sales of 132,000 metric tons of U.S. corn to South Korea.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV132:0-soybeans-climb-to-highest-since-july-as-tariff-worries-ease/",
            "pub_date": "2025-02-05 03:05:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009591:0",
            "title": "Premier Shares Fall 15% on Cut to Top End of FY Revenue Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Shares of Premier on Tuesday dropped after the company cut the top end of its revenue outlook for fiscal 2025 and posted lower-than-expected adjusted earnings and revenue for the second quarter.</p><p class=\"\">The stock was down 15.3% to $18.98 in afternoon trading, on pace for the largest percent decrease since May 2023. Shares have fallen more than 12% over the past 12 months.</p><p class=\"\">The Charlotte, N.C.-based healthcare improvement technology company guided for full-year revenue of $940 million to $1.01 billion amid challenges in its performance services segment. It had most recently expected revenue of $930 million to $1.02 billion.</p><p class=\"\">The company raised its adjusted per-share earnings outlook to $1.26 to $1.34 a share from $1.16 to $1.28 a share previously to reflect the impact of the additional $200 million stock buyback completed in early January.</p><p class=\"\">Premier's outlook comes as it swings to a loss in the second quarter ended Dec. 31.</p><p class=\"\">The company posted a net loss of $96 million, or $1.01 a share, compared with a profit of $54.3 million, or 45 cents a share, for the same period a year earlier.</p><p class=\"\">Stripping out one-time items, the company's earnings came in at 25 cents. Analysts polled by FactSet had forecast higher adjusted earnings of 30 cents a share.</p><p class=\"\">Quarterly revenue fell 14% to $240.3 million, missing the $243.2 million expected by Wall Street.</p><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009591:0/",
            "pub_date": "2025-02-05 03:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008596:0",
            "title": "Update: New Tariffs Could Push iPhone Prices Higher. How a Trade War Could Play Out for Tech Devices. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Angela Palumbo</p><p class=\"\">Smartphones, laptops, and other electronics devices could get pricier thanks to tariffs.</p><p class=\"\">President Donald Trump announced over the weekend that he would be implementing 10% tariffs on China and 25% tariffs on Canada and Mexico. Mexican and Canadian tariffs were paused on Monday following talks with those countries' leaders, but the levies on China went into effect overnight into Tuesday.</p><p class=\"\">China has responded by announcing import taxes of 15% on U.S. crude oil, machinery, and some cars, and a 10% increase of tariffs on coal and liquefied natural gas.</p><p class=\"\">Tariffs are taxes that are charged onto goods being imported from other countries. Companies that bring in goods from these impacted countries pay those taxes to the government. It's common for those companies to pass the increased costs from tariffs onto the consumer through higher prices. This time around, a 10% tariff on China — a country where many components and products come from — is likely to lead to higher priced phones, laptops, and more.</p><p class=\"\">According to a report from the Consumer Technology Association in January, tariffs on technology products could lead to a $90 billion to $143 billion decline in U.S. consumer purchasing power.</p><p class=\"\">\"If these tariffs are sticky and they continue to hold on, then I think the time frame for the permanent price escalation is after six to 12 months, when we're going to see that, hey, everything's more expensive,\" Jim Cagnina, senior market analyst at NinjaTrader, told Barron's.</p><p class=\"\">Just a few of the companies that could feel impacts from tariffs include chip company Intel and PC maker Dell Technologies along with smartphone giant Apple. Some of these consumer electronic makers have already spoken about what tariffs could mean for them.</p><p class=\"\">\"We're reviewing the tariff executive orders and subsequent government announcements to understand how they may affect our customers, partners and our business,\" Dell said in a statement to Barron's.</p><p class=\"\">Intel and Apple didn't respond to requests for comment.</p><p class=\"\">Intel reported fourth-quarter revenue of $14.3 billion on Jan. 30, which was higher than Wall Street estimates. On the company's fourth-quarter earnings call, interim co-CEO David Zinsner said that \"we expect a portion of Q4 revenue upside was due to customers hedging against potential tariffs.\"</p><p class=\"\">But Intel also provided disappointing revenue guidance for the current quarter. Zinsner said this was due to \"added pressure coming from macro uncertainty especially around tariffs, balancing of PC inventory and increasing competition.\"</p><p class=\"\">As the China tariffs kicked in on Tuesday, shares of Apple were up 1.7%, while Intel stock was down 0.1% and Dell was up 1.6%.</p><p class=\"\">The trade dynamic could be a problem for an already weakened PC market, which saw demand decline after the Covid-19 pandemic fueled purchases of at-home devices. Companies have been pushing out new AI powered PCs to try to spur consumer excitement, but increased prices along with higher for longer interest rates doesn't bode well for the sector.</p><p class=\"\">\"The overall macroeconomic concerns seem to be overshadowing some of the progress and excitement around AI PCs. However, we maintain the view that the impact that on-device AI will have on the industry will be positive, even if the inflection point is delayed,\" Ryan Reith, group vice president with IDC, wrote in a research report last month.</p><p class=\"\">Meanwhile, iPhone maker Apple is an interesting piece to the tariff puzzle. Most of Apple's manufacturing is done in China. Importantly, though, the Cupertino-based tech giant was exempt from tariffs the last time Trump was in office.</p><p class=\"\">When asked about the potential impacts on tariffs during Apple's first-quarter earnings call on Jan. 30, CEO Tim Cook said the company is monitoring the situation, but had nothing more to add. That's led investors and consumers alike to wonder whether the price of iPhones, MacBooks, and more would increase.</p><p class=\"\">If Trump's new trade policies stick, one possible outcome would be for companies like Apple to move some of their manufacturing to countries that aren't affected by the tariffs. Barron's has previously reported that about 80% of smartphones are imported from China, and if the manufacturing moved to other places, the average cost of smartphones could rise by more than $200.</p><p class=\"\">\"As the new tariff is imposed on imports from China, Apple could have its manufacturing partners ramp up production in India and ship to the U.S. This could also be done for other Apple products that are manufactured in countries including Vietnam, Malaysia, etc.,\" BofA Securities analyst Wamsi Mohan wrote on Monday. \"We have assumed 80% of Apple products sold in the U.S. can be sourced from other countries, apart from China.\"</p><p class=\"\">It's also possible that Apple chooses not to increase prices for consumers to keep a competitive edge.</p><p class=\"\">\"It might be that they take the decision that 'we're actually going to swallow some of this for our consumers,' especially if competitors don't increase the price, at least in the short term,\" Martin Balaam, chief executive of product information management platform Pimberly, told Barron's.</p><p class=\"\">In the long-term, though, a potential trade war means consumers may be dishing out more dollars for new gadgets than they once anticipated.</p><p class=\"\">Write to Angela Palumbo at angela.palumbo@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008596:0/",
            "pub_date": "2025-02-05 03:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV13O:0",
            "title": "COMMENT-US recap: EUR/USD up as dollar jolted by soft openings data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The dollar index fell with Treasury yields on Tuesday after a report showing U.S. job openings fell the most in 14 months, signaling a slowing economy.</p><p class=\"\">While the Trump administration imposed an additional 10% tariff on China imports, fears of an impending global trade war abated. China imposed targeted tariffs on U.S. imports. </p><p class=\"\">Over 20,000 U.S. federal employees, roughly 1% of the government workforce, have signed up for an offer to quit their jobs. Outside of tariffs, focus this week is Friday's payrolls.    </p><p class=\"\">EUR/USD rose above its 21-DMA as easing concerns about tariffs triggered short-covering and a sharp drop in volatility. Techs are positive following a bullish candle Monday as RSIs improve. The top of the 21-day Bollinger Band at 1.0506 is reasonable target on extension. Monthly hedging flows may have also helped to lift the common currency with about EUR10b of NDFs traded.</p><p class=\"\">The pound rose against the greenback but edged down versus the euro ahead of an expected Bank of England rate cut on Thursday. Further cable gains would see it test its 55-day moving average at 1.2512.</p><p class=\"\">USD/JPY fell back into its 153.37 to 154.82 Ichimoku cloud and set a new session low of 154.18 as Treasury yields retreated. The pair would be eyeing a January double-bottom at 153.72-.152.79 on further losses.  </p><p class=\"\">Treasury yields were down 1 to 5 basis points as the curve steepened. The 2s-10s curve was up about 2 basis points to +16.5bp.</p><p class=\"\">The S&amp;P 500 rose 0.5% fueled by tech shares.  </p><p class=\"\">Crude fell 0.2%, paring a deeper loss after a U.S. official said \"maximum pressure\" would be put on Iran oil exports.</p><p class=\"\">Gold rose 1.04% while copper gained 1.3%.  </p><p class=\"\">Heading toward the close: EUR/USD +0.38%, USD/JPY -0.33%, GBP/USD +0.33%, AUD/USD +0.48%, =USD -0.58%, EUR/JPY +0.06%, GBP/JPY -0.04%, AUD/JPY +0.19%.</p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV13O:0-comment-us-recap-eur-usd-up-as-dollar-jolted-by-soft-openings-data/",
            "pub_date": "2025-02-05 03:09:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203010836:0",
            "title": "Pfizer Falls on RFK's Progress Towards Confirmation Despite Good Earnings. Its CEO is Unbothered. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis and Mackenzie Tatananni</p><p class=\"\">The clearing of the way for Robert F. Kennedy Jr.'s confirmation as health secretary Tuesday put pressure on Pfizer shares, despite a positive earnings report form the company early in the morning.</p><p class=\"\">Pfizer CEO Albert Bourla, however, was unbothered when he spoke to Barron's at midday.</p><p class=\"\">\"My stance is that you need to engage with him,\" Bourla said of Kennedy, who has been the country's most prominent and persistent critic of vaccine safety. Some of Pfizer's top-selling products are vaccines, including the Covid-19 vaccine Comirnaty and the pneumococcal vaccines sold under the Prevnar brand.</p><p class=\"\">Bourla said that he had met with Kennedy, and they talked about cancer and chronic cardiovascular diseases. \"I told him many times that there are a lot of things that we can do together,\" said Bourla, who has mantained a notably optimistic outlook about the Trump administration in recent public statements.</p><p class=\"\">\"The Trump administraiton, they have a boldness,\" Bourla said. \"When they go for something, they really go. And they are very much into, let's try to cure cancer.\"</p><p class=\"\">Bourla said Tuesday that the proposed Trump tariffs on China, Mexico, and Canada — most of which were postponed on Monday — would have no major impact on Pfizer.</p><p class=\"\">\"They have a very strong belief, from the president to his chief of staff, to his cabinet to his White House people, that strong business, strong private sector, strong entrepreneurship means strong America,\" Bourla said. \"It was the case of few people in [the Biden administration] — and unfortunately, those few people, they were not the ones that they had the ideological dominance.\"</p><p class=\"\">Investors did not appear to share Bourla's optimism on Tuesday. Pfizer shares dropped after Kennedy cleared a Senate committee just after 10 a.m., and were down 1.7% in afternoon trading.</p><p class=\"\">Things had looked better before the market opened on Tuesday, when the company reported fourth-quarter earnings and revenue that came in ahead of Wall Street expectations, and maintained guidance for 2025 it had laid out in December.</p><p class=\"\">The earnings report brought no major surprises. Fourth-quarter earnings were 63 cents a share, beating calls for 47 cents. Revenue of $17.8 billion surpassed the FactSet consensus estimate of $17.4 billion and marked 21% operational growth from the previous year.</p><p class=\"\">The company didn't provide an update on its closely watched obesity pill danuglipron, though promised data by the end of the first quarter.</p><p class=\"\">Pfizer shares fell nearly 50% from the start of 2023 through the end of 2024, while the S&amp;P 500 climbed just more than 50%. A Pfizer shareholder has halved her money over that period, while missing out on a shot at historic gains.</p><p class=\"\">Most of Pfizer's losses came in 2023, but the stock failed to recover in 2024. \"What differentiates the winners from the losers is not that the winners never fail,\" Bourla told Barron's. \"It's that the winners always rise. So we had a bad year. We made a plan. And executed.\"</p><p class=\"\">He said that 2024 was focused on revamping its marketing operations while cutting costs, and that the focus in 2025 will be on the pipeline. \"We are going to put all the focus now of the senior management time on that, and I'm very optimistic that we will achieve very good results.\"</p><p class=\"\">The company said it was \"on track to deliver\" overall net cost savings of $4.5 billion by the end of this year.</p><p class=\"\">One issue dogging the stock in recent years has been the variability in sales of Pfizer's Covid-19 products, the vaccine Comirnaty, and the antiviral Paxlovid. The company's major errors in projecting sales of the Covid products in 2023 was a significant contributor to the stock slide that year. Pfizer now expects sales of the Covid-19 products to stabilize, Bourla said in comments prepared for a Tuesday investor call.</p><p class=\"\">In December, the company rolled out initial guidance for 2025 that investors took as bullish, sending shares up slightly. The company expects revenue of between $61 billion and $64 billion, and adjusted per-share earnings of between $2.80 and $3. Pfizer stood by that guidance on Tuesday.</p><p class=\"\">Sales of Pfizer's respiratory syncytial virus vaccine Abrysvo were $198 million in the fourth quarter, down from $515 million last year, and well below the $482.8 million consensus estimate. After a strong launch in 2023, the RSV market struggled in 2024. Bourla, however, said in comments prepared for the investor call that Pfizer had a \"market leadership position for the season in shipped doses,\" even as U.S. vaccinations dropped.</p><p class=\"\">Products with fourth-quarter sales that beat expectations included the blood-thinner Eliquis, the migraine drug Nurtec, and the cancer treatment Ibrance.</p><p class=\"\">Bourla seems to have brushed off what had seemed a formidable challenge from Starboard Value, which reportedly built a $1 billion stake in Pfizer last year. The activist investor slammed the company's performance in a much-discussed presentation that asserted that Pfizer \"management has failed\" to deliver on important commitments.</p><p class=\"\">Bloomberg reported last week, however, that Starboard hadn't nominated any new board members ahead of an April annual meeting, and that the deadline for nominations had passed on Jan. 25.</p><p class=\"\">Bourla told Barron's Tuesday he had met a second time with Starboard. \"We had a very productive meeting,\" he said. \"It's my first and only experience with an activist, but it's nothing like what I've read. I don't know, maybe it's my charm.\"</p><p class=\"\">Bourla said that he had taken some of Starboard's suggestions, and had used the activists \"as a sounding board.\"</p><p class=\"\">Pfizer is facing a major string of patent expirations beginning in 2026 that will scrape between $17 billion and $18 billion off the company's revenue by the end of the decade. The company hopes to close that gap with sales of products it has acquired in a recent spending spree.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com and Mackenzie Tatananni at mackenzie.tatananni@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203010836:0/",
            "pub_date": "2025-02-05 03:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1ff6402f3e31e:0",
            "title": "Northwest Bancshares Director Mark A. Paup Acquires 5,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Paup Mark A</td></tr><tr><td>Relationship</td><td>Director</td></tr><tr><td>Type</td><td>Purchase</td></tr><tr><td>Amount</td><td>$63,300</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1672818/000147126525000012/xslF345X05/wk-form4_1738696036.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Northwest Bancshares Director, Mark A. Paup, purchased 5,000 shares of the company's common stock on February 4, 2025, at a price of $12.66 per share, totaling $63,300. Following this transaction, Paup directly owns 54,988 shares and indirectly owns 9,925 shares through his spouse.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1672818/000147126525000012/xslF345X05/wk-form4_1738696036.xml\" rel=\"nofollow\" target=\"_blank\">Northwest Bancshares, Inc. [ NWBI ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:1ff6402f3e31e:0-northwest-bancshares-director-mark-a-paup-acquires-5-000-shares/",
            "pub_date": "2025-02-05 03:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009607:0",
            "title": "CFTC Reorganizes Enforcement Division Into Two Task Forces",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Denny Jacob</p><p class=\"\">The Commodity Futures Trading Commission is reorganizing its enforcement division in a move it said will end the practice of regulation by enforcement.</p><p class=\"\">The derivatives market regulator said previous task forces will be simplified into two new units of the division: the complex fraud task force and the retail fraud and general enforcement task force.</p><p class=\"\">\"This simplified structure will stop regulation by enforcement and is more efficient,\" said Caroline Pham, who was named acting chairman of CFTC by President Donald Trump in January.</p><p class=\"\">The complex fraud task force will be responsible for all matters related to complex fraud and manipulation across all asset classes. The acting chief will be deputy director Paul Hayeck.</p><p class=\"\">The retail fraud and general enforcement task force will focus on retail fraud and handle general enforcement matters involving other violations of the Commodity Exchange Act. The acting chief will be deputy director Charles Marvine.</p><p class=\"\">The changes are the latest shakeup at CFTC. Pham after being appointed announced a series of leadership changes at the agency including naming Brian Young as acting director of the enforcement division.</p><p class=\"\">Write to Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009607:0/",
            "pub_date": "2025-02-05 03:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSKDZrJa:0",
            "title": "Beyond the Beach: RuffleButts Leads the Way in Sun Protection With UPF 50+ Swim & Activewear",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">With the launch of their new UPF 50+ activewear line, RuffleButts is setting the standard for sun protection in the children's swim &amp; apparel markets.</p><p class=\"\">DALLAS, TEXAS / ACCESS Newswire / February 4, 2025 / RuffleButts + RuggedButts, the beloved premium children's apparel brand known for known for lasting quality, playful prints, and family-matching collections for life's special moments, is making waves in the industry by leading the charge in UPF 50+ sun protection. As a trusted name in children's swimwear, RuffleButts has long been a go-to for parents seeking stylish, high-quality swimsuits that offer superior sun safety. Now, the brand is expanding its commitment to sun protection by introducing UPF 50+ fabrics to its activewear line.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:800px;aspect-ratio:1.3333333333333333\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSKDZrJa-72d8a28d1bfcb26c7b131861a4406463-resized.webp\" type=\"images/webp\"/><img alt=\"New Activewear\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSKDZrJa-72d8a28d1bfcb26c7b131861a4406463-resized.jpeg\" style=\"background-color:#c8b3bd\"/></picture></div></figure></span></p><strong class=\"root-Tkn6WL2y\">New Activewear</strong><p class=\"\">Front and Detail shot of new activewear dress.</p><p class=\"\">RuffleButts' best-selling swimwear features a variety of UPF 50+ options designed for the entire family. Featuring playful prints, fun styles, and bright colors both kids and parents love with a lasting quality that resists pilling, snagging, and fading wash after wash, the brand ensures that families can enjoy fun in the sun without compromising on style or safety.</p><p class=\"\">With the new addition of UPF 50+ activewear, RuffleButts is taking sun protection beyond the beach. The new activewear line features lightweight, breathable, and protective fabrics perfect for playdates, outdoor adventures, and everyday wear.</p><p class=\"\">\"Our brand has a strong reputation built on quality and stylish playful designs,\" said Alicia Dewar, VP of Merchandise, Planning, and Design. \"With our UPF 50+ swimwear already a customer favorite, it was a natural expansion to incorporate this same protection into our new activewear line. We are thrilled that our customers will have additional sun protection not only at the pool or beach but also in their daily active lifestyle.\"</p><p class=\"\">As families continue to prioritize sun protection, RuffleButts + RuggedButts remains at the forefront of the industry, providing innovative designs that blend fashion, fun, and function. With their latest UPF 50+ offerings, the brand continues to set the standard for stylish, sun-protective swim &amp; activewear for your little ones.</p><p class=\"\">For more information, visit www.rufflebutts.com or www.ruggedbutts.com and explore the latest in sun-safe swimwear and activewear.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About RuffleButts + RuggedButts</strong></p><p class=\"\">RuffleButts + RuggedButts is a digitally native premium children's apparel company founded in 2007 with a ruffle bloomer that has now grown to a full assortment of premium children's apparel. Known for lasting quality, playful prints, and family-matching collections for life's special moments, RuffleButts has quickly grown to annual revenue exceeding $40M. Our products can be found online at Rufflebutts.com, Ruggedbutts.com, Amazon, select premium retailers such as Nordstrom, Neiman Marcus and hundreds of specialty retail locations around the globe. RuffleButts has been a Summit Park holding since 2020.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Scott Adam</p><p class=\"\"><em>Sr. Director of Marketing</em></p><p class=\"\">sadams@rufflebutts.com</p><p class=\"\">(704) 825-8811</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> RuffleButts, Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Related Images</strong></p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:800px;aspect-ratio:1.3333333333333333\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSKDZrJa-213357889464819883a25559becd65dc-resized.webp\" type=\"images/webp\"/><img alt=\"New Bows\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSKDZrJa-213357889464819883a25559becd65dc-resized.jpeg\" style=\"background-color:#b0a59e\"/></picture></div></figure></span><strong class=\"root-Tkn6WL2y\">New Bows</strong><p class=\"\">Shot of new bows that pair back to activewear.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:800px;aspect-ratio:1.3333333333333333\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSKDZrJa-72a2777f9141e4a403f4f952088bc6f8-resized.webp\" type=\"images/webp\"/><img alt=\"UPF 50+ Activewear\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSKDZrJa-72a2777f9141e4a403f4f952088bc6f8-resized.jpeg\" style=\"background-color:#eac9c0\"/></picture></div></figure></span><strong class=\"root-Tkn6WL2y\">UPF 50+ Activewear</strong></p><p class=\"\">Front and Back shots for new active dress.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSKDZrJa:0/",
            "pub_date": "2025-02-05 03:10:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV12N:0",
            "title": "Thales Alenia Space strikes deal with the Emirates for space station module",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Thales Alenia Space (TAS) has clinched an order from the UAE's Mohammed Bin Rashid Space Centre to develop an airlock module for the Lunar Gateway space station, the joint venture between France's Thales  and Italy's Leonardo  said.     </p><p class=\"\">\"The Airlock will allow astronauts to perform spacewalks, transfer research to and from the lunar station, and serve as an additional docking port for spacecraft vehicles,\" TAS said in a press release on Tuesday.</p><p class=\"\">The order, for an undisclosed amount, is the latest in  a series of contracts awarded to TAS in recent weeks, including two from the European Space Agency for the design of the Venus-bound Envision spacecraft and the Argonaut lunar lander.</p><p class=\"\">The Lunar Gateway is to become the first international space station around the moon as part of the Artemis programme. It is a multinational project involving NASA, the European Space Agency (ESA), the Japan Aerospace Exploration Agency (JAXA), the Canadian Space Agency (CSA), and the Mohammed Bin Rashid Space Centre (MBRSC).</p><p class=\"\">($1 = 0.9633 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV12N:0-thales-alenia-space-strikes-deal-with-the-emirates-for-space-station-module/",
            "pub_date": "2025-02-05 03:10:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309156:0",
            "title": "Goodyear Tire to Redeem $500 Million Worth of Senior Notes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Goodyear Tire &amp; Rubber  on Tuesday said it would redeem in full its outstanding $500 million debt due on Feb. 19. </p><p class=\"\">The debt is in the form of 9.5% senior notes, according to a securities filing. </p><p class=\"\">Shares of Goodyear Tire &amp; Rubber were down 1.7% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309156:0/",
            "pub_date": "2025-02-05 03:01:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr45BWRM:0",
            "title": "DNB Markets: Rips the band-aid off SaaS shift",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>IAR Systems Group AB<p class=\"\">IAR's long-awaited launch of its SaaS offering is set to dent its sales growth and dampen profitability, but we believe this business model change should improve its earnings quality long-term and accelerates the growth profile. During this three- to five-year shift, we expect its defensive recurring revenues, its strong balance sheet, and share buybacks to cushion share price volatility. We have cut our 2025-2026e adj. EPS by 22-41%, but raised our fair value to SEK160-265 (160-240).</p><p class=\"\">New strategy rips the band-aid on long-awaited SaaS transition. We are positive on IAR Systems’ updated three- to five-year strategy, which focuses on: 1) expanding its addressable markets (address more advanced MCUs and also MPUs, which represent a ~65% additional whitespace market opportunity); 2) widening the market reach by targeting focus verticals (higher degree of certifications and regulations) in automotive and industrial automation, and expanding its channel through distributors and partners; and 3) expanding the customer share of wallet through its new subscription offering, allowing access to its entire toolchain in a modern development environment, with the potential to add usage-based revenue parameters (charge for build capacity, etc.).</p><p class=\"\">2025–2026e adj. EPS cut by 22–41%, to factor in the SaaS transition, with: 1) a 2% sales CAGR in 2024–2028e; 2) SaaS revenues representing 60% of 2028e net sales; and 3) an earnings trough for 2027e. Our estimates could prove too conservative, but we prefer to take a prudent stance. For its seasonally important Q4 2024, we expect net sales of SEK119m (-6% organic YOY) on broad-based QOQ improvements facing a tough YOY comparable and adj. EBIT of SEK23m (19.6% margin, -5.8%-points YOY). We expect IAR Systems to propose a DPS of SEK2.00 (+33% YOY).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fair value raised to SEK160–265 (160–240),</strong> where the low-end is based on a 2025e EV/EBIT of 20x (SaaS shift-pressured earnings) and the high-end on a DCF that captures IAR Systems’ targeted ‘rule of 40’ financials beyond 2028–2030e (20%+ sales growth at a 20%+ EBIT margin). On a perpetual-licence basis, the shares would be trading at a 2025e EV/EBIT of ~11x.</p><p class=\"\">Best regards,</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Joachim Gunell </strong>| DNB Markets | Equity Research</p><p class=\"\">DNB Bank ASA, Filial Sverige</p><p class=\"\">Visiting address: Regeringsgatan 59, Stockholm</p><p class=\"\">Postal address: 105 88 Stockholm</p><p class=\"\">E-mail: joachim.gunell@dnb.se | www.dnb.no</p><p class=\"\">https://news.cision.com/se/iar-systems-group-ab/r/dnb-markets--rips-the-band-aid-off-saas-shift%2Cc4100633</p><p class=\"\">IAR Systems - Q4 2024 preview (SaaS shift) - 20250204</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr45BWRM:0-dnb-markets-rips-the-band-aid-off-saas-shift/",
            "pub_date": "2025-02-05 03:01:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV2IV:0",
            "title": "Rambus Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Rambus Inc  reported quarterly adjusted earnings of 56 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 47 cents.  The mean expectation of six analysts for the quarter was for earnings of 58 cents per share. Wall Street expected results to range from 56 cents to 58 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 18.5% to $161.10 million from a year ago; analysts expected $158.47 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Rambus Inc's reported EPS for the quarter was 58 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $62.2 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Rambus Inc shares had risen by 14.2% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 0.6% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 6 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the semiconductors peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Rambus Inc is $70.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 07:02 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.58</p></td><td><p class=\"\">0.56</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.51</p></td><td><p class=\"\">0.51</p></td><td><p class=\"\">Met</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.45</p></td><td><p class=\"\">0.42</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.44</p></td><td><p class=\"\">0.37</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV2IV:0-rambus-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 03:03:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4KBRV9:0",
            "title": "Innovate BC and NRC IRAP Invest $1.5M to Support 12 Cleantech Innovation Pilot Projects in British Columbia",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:900px;aspect-ratio:1.5\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX4KBRV9-ddb3dca640e54f153268e54e319a3948-resized.webp\" type=\"images/webp\"/><img alt=\"pH7 Technologies\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX4KBRV9-ddb3dca640e54f153268e54e319a3948-resized.jpeg\" style=\"background-color:#9b9190\"/></picture></div></figure></span></p><p class=\"\">VANCOUVER, British Columbia, Feb.  04, 2025  (GLOBE NEWSWIRE) — Through the BC Fast Pilot program, Innovate BC and the National Research Council of Canada Industrial Research Assistance Program (NRC IRAP) are investing a combined total of $1.5M in funding across twelve B.C.-based companies to pilot innovation projects. Projects areas include wildfire management, critical minerals, water treatment, artificial intelligence and data analytics in applications to clean technology and agriculture, and more. The funding will support pilot testing for new technologies.</p><p class=\"\">“Through BC Fast, local companies have the opportunity to show what they are capable of by creating new technology solutions to the challenges we’re facing in public health, resource management and so much more,” said Diana Gibson, Minister of Jobs, Economic Development and Innovation. “I look forward to watching these companies grow by selling to local and diversified international markets, and increase global awareness of the talent and business opportunities available in the B.C. tech ecosystem and our rapidly expanding knowledge economy.”</p><p class=\"\">The BC Fast Pilot program helps regional small-medium sized enterprises design, build, and operate a pilot plant or small demonstration of their technology in real-world conditions. This allows B.C. technology companies to demonstrate the impact of their product, measure the value of their solution, and encourage customer adoption, with the goal of scaling their solutions while strengthening key industries, solving local and global challenges, and driving prosperity for British Columbians.</p><p class=\"\">“Innovation transforms industries and helps them remain competitive in global markets, and through the BC Fast Pilot program, we’re supporting the growth of B.C. companies creating new solutions that aim to do just that,” said Peter Cowan, President + CEO of Innovate BC. “This year’s recipients, which are addressing critical areas such as emission reduction, wildfire management, and health sciences, emphasize the immense value in advancing entrepreneurship and the impact of innovation in creating a more prosperous, future-ready British Columbia. We’re proud to deliver this initiative in partnership with NRC IRAP, strengthening the region’s innovation economy and cementing B.C.’s reputation as a global leader in technology.”</p><p class=\"\">Projects funded through this round of BC Fast Pilot are working to provide innovative solutions in support of high-impact sectors such as sustainability, resource management and public health, emphasizing pilot testing to validate effectiveness and scalability. One of this year’s recipients, FireSwarm Solutions, is working to enhance wildfire detection and management through advanced drone technology and is being piloted in Squamish. joni, piloting their project in both Victoria and Richmond, are addressing menstrual care accessibility in public spaces with an IOT-enabled technology.</p><p class=\"\">This is the sixth round of funding through the BC Fast Pilot program, which was launched in 2019. Since the program’s inception, and including this year’s awardees, $11.4M has been invested into 87 B.C. pilot demonstrations.</p><p class=\"\">“Through the BC Fast Pilot program and our partnership with Innovate BC, we are supporting Canadian innovators in bringing their ideas to life,” says Mitch Davies, President, National Research Council of Canada. “By enabling companies to demonstrate their technologies in practical applications, we are helping them gather valuable market insight. This in turn brings them closer to customer adoption, and to providing innovative cleantech solutions to address current challenges.”</p><p class=\"\">Previous program participants include Open Ocean Robotics, which, since receiving funding in 2019/20, has partnered with the Royal Canadian Navy on marine innovation, expanded to Canada’s east coast, secured $800,000 from PacifiCan’s Business Scale-up and Productivity program, and landed major contracts with the National Oceanic and Atmospheric Administration (NOAA). Similarly, pH7 Technologies, a 2022/23 participant, secured $1.5M from PacifiCan, raised $16M USD in a Series A round, and was recognized as one of the Global Cleantech 100 companies in 2024 and 2025.</p><p class=\"\">This funding prioritizes regional projects, with a focus on cleantech and projects that involve physical installations and are capital intensive in nature, and those that involve Indigenous communities or organizations.</p><p class=\"\">To view and download digital assets relating to this announcement, please <strong class=\"root-Tkn6WL2y\">click here.</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\">Michael Gleboff</p><p class=\"\">Communications + Community Manager</p><p class=\"\">mgleboff@innovatebc.ca </p><p class=\"\">604-602-5210</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Innovate BC</strong></p><p class=\"\">A Crown Agency of British Columbia, Innovate BC works to foster innovation across the province and bolster the growth of the local economy through delivering a wide range of programs that help companies start and scale, access talent and encourage technology development, commercialization, and adoption. Innovate BC also harnesses crucial data collection and research, and works to forge strategic industry and community partnerships that create more opportunities for B.C. innovators.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Learn More</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Meet the Round 6 Awardees</li><li class=\"listItem-bmN0_SHH\">About the BC Fast Pilot Program</li><li class=\"listItem-bmN0_SHH\">About NRC IRAP</li></ul><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/eb5a1d30-493a-444a-aa44-ce1dd59987cf</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">pH7 Technologies</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Team photo of BC Fast Round 6 awardee pH7 Technologies, also a program participant in Round 4.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4KBRV9:0-innovate-bc-and-nrc-irap-invest-1-5m-to-support-12-cleantech-innovation-pilot-projects-in-british-columbia/",
            "pub_date": "2025-02-05 03:03:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXmcGCX:0",
            "title": "Blank Rome Welcomes Trio of Leading Regulatory and Litigation Partners in Chicago and Philadelphia",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chicago, Philadelphia, Feb.  04, 2025  (GLOBE NEWSWIRE) — Blank Rome LLP is pleased to welcome Rachael G. Pontikes, Emily L. Hussey, and Shannon E. McClure as partners in the firm’s Life Sciences industry team and Business Litigation group. Rachael and Emily join the firm’s Chicago office and Shannon joins the Philadelphia office. Prior to joining Blank Rome, the attorneys practiced at Reed Smith LLP.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Rachael</strong> and <strong class=\"root-Tkn6WL2y\">Emily </strong>are nationally recognized and sought after for their extensive experience in representing clients in the life sciences and healthcare industries. They counsel clients on a broad spectrum of critical issues in this space, including regulatory compliance, administrative actions, due diligence in healthcare transactions, licensing matters, and industry advocacy. Rachael and Emily represent a diverse array of clients up and down the drug supply chain, including various types of pharmacies such as compounding, commercial/retail, nuclear, hospital, and institutional; manufacturers of drugs, supplements, nutraceuticals, and ingredients; drug distributors; telehealth platforms; online pharmacy and prescription management services; as well as physician and veterinary practices, hospital systems, and outsourcing facilities.</p><p class=\"\">They also represent coalitions of compounding pharmacies and outsourcing facilities to challenge the Food and Drug Administration (“FDA”), state regulators, and other regulatory bodies on critical issues, often engaging with regulators, legislators, and stakeholders to advance the interests of their clients. In addition, Rachael and Emily represent healthcare facilities in high-stakes FDA, Drug Enforcement Administration (“DEA”), and state agency investigations and related litigation. They also regularly advise clients on due diligence, change of ownership, regulatory approvals, and related issues with major life sciences and healthcare transactions.<strong class=\"root-Tkn6WL2y\"> </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Shannon</strong> is a first-chair trial attorney handling disputes before federal and state trial and appellate courts, and in arbitrations and mediations for national and multinational companies. Notably, she served as trial counsel to a global healthcare company in high-profile nationwide federal and state opioid litigation. She also coordinates company resolution strategy, serving as strategic national counsel for large matters. Shannon defends clients in multidistrict litigation, putative class actions, and other complex matters. In the life sciences and healthcare industries, she represents pharmaceutical and medical device manufacturers, distributors, and health systems, and partners with clients to operationalize injunctive relief components of settlement agreements. In addition, Shannon also represents companies operating in the energy, financial services, real estate, transportation and logistics, and telecommunications industries. </p><p class=\"\">Rachael, Emily, and Shannon are each highly ranked by <em>Chambers USA</em>. Rachael and Emily are ranked in the Illinois Healthcare: Pharmaceutical/Medical Products Regulatory category and Shannon is ranked in the Pennsylvania: Philadelphia &amp; Surrounds, Litigation: General Commercial category. </p><p class=\"\">“We are thrilled to welcome Rachael, Emily, and Shannon to Blank Rome,” said Grant S. Palmer, Blank Rome’s Chair and Managing Partner. “They are exceptional attorneys whose multi-faceted practices align with the needs of our clients and will enable us to provide outstanding client service to those operating in the healthcare and life sciences industries and beyond.”</p><p class=\"\">“We are thrilled to join Blank Rome,” said <strong class=\"root-Tkn6WL2y\">Rachael</strong>. “We are committed to providing strategic counsel to clients in the life sciences and healthcare sectors, assisting them in navigating the unique challenges of the market. Blank Rome’s highly regarded reputation in such areas as corporate law, intellectual property, labor and employment, and white-collar defense and investigations, along with the opportunity to further develop the firm’s service offerings in life sciences and healthcare, made this move an ideal choice for us and our clients. Emily and I are pleased to continue our collaboration with Shannon at Blank Rome. We look forward to integrating our complementary practices into the firm and continuing to provide exemplary service to our clients.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Emily</strong> continued, “In addition to the opportunities that moving to Blank Rome creates for our clients, we were particularly drawn to the firm’s inclusive culture, which is incredibly important to our team. This move represents a significant opportunity to further develop our practice within a firm that truly values excellence, innovation, diversity and inclusion, and pro bono. We look forward to tapping into Blank Rome’s collaborative and high-performance culture to provide exceptional service to our clients.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Shannon</strong> added, “Joining Blank Rome was an easy decision due to the firm’s significant presence in Philadelphia and key markets across the country and its reputation as a litigation powerhouse. Leveraging the firm’s extensive capabilities will allow me to better serve clients across a variety of practice areas and industries. I am energized by the firm’s commitment to growth and look forward to collaborating with my new colleagues, as well as continuing to work with Rachael and Emily in our synergistic practices.” </p><p class=\"\">“We are excited to begin working with our new colleagues in Chicago and Philadelphia,” said William J. Dorsey, partner and co-chair of the Business Litigation group. “Rachael, Emily, and Shannon have built a reputation as go-to lawyers who partner with their clients to understand their goals and develop tailored strategies to deliver successful outcomes. Their experience in the in the healthcare and life sciences industries is unparalleled, and their innovative and creative problem-solving skills will benefit our clients immensely.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Additional Information About the Partners</strong></p><p class=\"\">Rachael earned her J.D. from the University of Chicago Law School and her B.A. in Philosophy and Italian studies, <em>with honors</em>, from Wesleyan University. Rachel is a board member of Culture Reframed.  </p><p class=\"\">Emily earned her J.D., <em>cum laude</em>, from Loyola University Chicago, where she served as lead articles editor of the <em>Loyola Law Journal</em>. She also holds a B.A. from the University of Michigan and is a Fellow of the Institute for Consumer Antitrust Studies. </p><p class=\"\">Shannon earned her J.D. from William &amp; Mary School of Law, where she was the executive editor of the <em>William and Mary Law Review</em>, and her B.A. also from the College of William &amp; Mary. Shannon is co-chair of the Philadelphia Bar Association’s Health Care Law Committee; Chair of the Eastern District of Pennsylvania’s Merit Selection Panel, responsible for recommending candidates to be considered to serve as United States Magistrate Judges; and an active member of the Forum of Executive Women, Philadelphia. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Blank Rome</strong></p><p class=\"\">Blank Rome is an Am Law 100 firm with 16 offices and more than 750 attorneys and principals who provide comprehensive legal and advocacy services to clients operating in the United States and around the world. Our professionals have built a reputation for their leading knowledge and experience across a spectrum of industries and are recognized for their commitment to pro bono work in their communities. Since our inception in 1946, Blank Rome’s culture has been dedicated to providing exceptional service to all of our clients and has been rooted in the strength of our diversity and inclusion initiatives. For more information, please visit blankrome.com.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Rachael G. Pontikes, Emily L. Hussey, and Shannon E. McClure      </li></ul><p class=\"\">Abby Moriarty</p><p class=\"\">Blank Rome LLP</p><p class=\"\">3127762597</p><p class=\"\">abby.moriarty@blankrome.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXmcGCX:0-blank-rome-welcomes-trio-of-leading-regulatory-and-litigation-partners-in-chicago-and-philadelphia/",
            "pub_date": "2025-02-05 03:03:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009561:0",
            "title": "Comex Silver Settles 1.53% Higher at $32.888 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Comex Silver for February delivery gained 49.60 cents per troy ounce, or 1.53% to $32.888 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Up 76.00 cents or 2.37% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage gain since Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up five of the past six sessions</li><li class=\"listItem-bmN0_SHH\">Highest settlement value since Wednesday, Oct. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Off 5.58% from its 52-week high of $34.831 hit Tuesday, Oct. 22, 2024</li><li class=\"listItem-bmN0_SHH\">Up 48.84% from its 52-week low of $22.096 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 46.87% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Up 11.03% from its 2025 settlement low of $29.622 hit Thursday, Jan. 2, 2025</li><li class=\"listItem-bmN0_SHH\">Off 32.47% from its record high of $48.70 hit Thursday, Jan. 17, 1980</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up $3.948 or 13.64%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009561:0-comex-silver-settles-1-53-higher-at-32-888-data-talk/",
            "pub_date": "2025-02-05 03:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009560:0",
            "title": "Comex Gold Settles 0.68% Higher at $2853.30 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Comex Gold for February delivery gained $19.40 per troy ounce, or 0.68% to $2853.30 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A new record high</li><li class=\"listItem-bmN0_SHH\">Up for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Up $40.80 or 1.45% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage gain since Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up five of the past six sessions</li><li class=\"listItem-bmN0_SHH\">Up 43.36% from its 52-week low of $1990.30 hit Wednesday, Feb. 14, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 40.25% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Up 8.15% from its 2025 settlement low of $2638.40 hit Monday, Jan. 6, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up $224.10 or 8.52%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009560:0-comex-gold-settles-0-68-higher-at-2853-30-data-talk/",
            "pub_date": "2025-02-05 03:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009562:0",
            "title": "Comex Copper Settles 1.13% Higher at $4.3425 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Comex Copper for February delivery gained 4.85 cents per pound, or 1.13% to $4.3425 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one day dollar and percentage gain since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Up 8.05 cents or 1.89% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage gain since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up five of the past six sessions</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Highest settlement value since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Off 15.17% from its 52-week high of $5.119 hit Tuesday, May 21, 2024</li><li class=\"listItem-bmN0_SHH\">Up 17.81% from its 52-week low of $3.686 hit Friday, Feb. 9, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 14.81% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.54% from its 2025 settlement high of $4.4105 hit Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.88% from its 2025 settlement low of $3.9885 hit Thursday, Jan. 2, 2025</li><li class=\"listItem-bmN0_SHH\">Off 15.17% from its record high of $5.119 hit Tuesday, May 21, 2024</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 35.65 cents or 8.94%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009562:0-comex-copper-settles-1-13-higher-at-4-3425-data-talk/",
            "pub_date": "2025-02-05 03:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV17G:0",
            "title": "Group Of Morgan Stanley-Led Banks Aiming To Sell As Much As $5.5 Bln Of Loans Tied To Musk's X - Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GROUP OF MORGAN STANLEY-LED BANKS AIMING TO SELL AS MUCH AS $5.5 BILLION OF LOANS TIED TO MUSK'S X - BLOOMBERG NEWS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV17G:0-group-of-morgan-stanley-led-banks-aiming-to-sell-as-much-as-5-5-bln-of-loans-tied-to-musk-s-x-bloomberg-news/",
            "pub_date": "2025-02-05 03:04:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1CE:0",
            "title": "IAR Systems Says Have Cut Our 2025-2026E Adjusted. EPS By 22-41%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IAR Systems Group AB :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">IAR SYSTEMS GROUP AB: WE HAVE CUT OUR 2025-2026E ADJUSTED. EPS BY 22-41%, BUT RAISED OUR FAIR VALUE TO SEK160-265 (160-240).</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">IAR SYSTEMS GROUP AB - FOR ITS SEASONALLY IMPORTANT Q4 2024, WE EXPECT NET SALES OF SEK119M (-6% ORGANIC YOY)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">IAR SYSTEMS GROUP AB - EXPECT Q4 EBIT OF SEK23M (19.6% MARGIN, -5.8%-POINTS YOY)</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1CE:0-iar-systems-says-have-cut-our-2025-2026e-adjusted-eps-by-22-41/",
            "pub_date": "2025-02-05 03:04:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309157:0",
            "title": "Piper Sandler Cuts Price Target on PepsiCo to $167 From $171",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PepsiCo  has an average rating of overweight and mean price target of $172.45, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309157:0/",
            "pub_date": "2025-02-05 02:56:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309158:0",
            "title": "Argus Raises Price Target on Roper Technologies to $625 From $600",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Roper Technologies  has an average rating of overweight and mean price target of $642.75, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309158:0/",
            "pub_date": "2025-02-05 02:57:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008368:0",
            "title": "Palantir Shows the AI Trade Is Alive and Well. 2 Stocks That Could Benefit. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Clark</p><p class=\"\">Palantir Technologies is the darling of the artificial-intelligence bulls again. The data-analytics company's upbeat call on how low-cost AI can boost its business should be good news for other software stocks.</p><p class=\"\">Palantir executives hailed a future where their software is set to become the most valuable part of the AI ecosystem, compared with underlying models, following the company's earnings beat. That comes on the back of Chinese firm DeepSeek apparently demonstrating cutting-edge models can be developed for a fraction of the previously assumed cost.</p><p class=\"\">\"I think one of the obvious lessons of DeepSeek-R1 is something that we've been saying for the last two years, which is that the models are commoditizing,\" Palantir's Chief Technology Officer Shyam Sankar told analysts on an earnings call. \"Yes, they're getting better across both closed and open, but they're also getting more similar. And the price of inference is dropping like a rock.\"</p><p class=\"\">Other companies potentially placed to benefit from that shift include cloud-based data storage company Snowflake, its privately owned rival Databricks, and customer-relationship software company Salesforce.</p><p class=\"\">\"[Palantir's] guidance for strong 54% U.S. commercial revs [revenue] growth in 2025 is a positive signal for primarily Databricks (according to our checks, Palantir and Databricks appear best-positioned to see AI pull-through) but to some degree Snowflake,\" wrote UBS analyst Karl Keirstead in a research note on Tuesday.</p><p class=\"\">Snowflake last year launched its own large-language model that the cloud-based data-warehousing firm claimed was the best option for enterprise AI applications. Snowflake said it trained the model in less than three months, with a budget of under $2 million.</p><p class=\"\">Snowflake shares were rising 3.5% in morning trading. Another gainer was Salesforce, which was up 0.7%.</p><p class=\"\">Salesforce is one of the software companies pushing ahead fastest with \"AI agents,\" or agentic AI. The terms refer to systems that can make decisions for businesses, helping them with issues such as customer interaction.</p><p class=\"\">\"A lower cost of compute could bring down AI computing costs of sales and drive better margin on AI enabled offerings. More importantly, agentic application providers could pass savings on to enterprises via lower price, which could provide a catalyst for adoption/proliferation of agents,\" wrote BofA Securities analyst Brad Sills in a recent research note.</p><p class=\"\">Salesforce plans to lay off more than 1,000 employees as it shifts focus to AI products, Bloomberg reported on Tuesday.</p><p class=\"\">Write to Adam Clark at adam.clark@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008368:0/",
            "pub_date": "2025-02-05 02:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA7JCBZ3:0",
            "title": "Firstservice Declares 10% Increase To Quarterly Cash Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FirstService Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FIRSTSERVICE DECLARES 10% INCREASE TO QUARTERLY CASH DIVIDEND</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FIRSTSERVICE CORP - APPROVES 10% INCREASE IN QUARTERLY DIVIDEND TO $0.275 PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA7JCBZ3:0-firstservice-declares-10-increase-to-quarterly-cash-dividend/",
            "pub_date": "2025-02-05 02:58:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}