{
    "data": [
        {
            "id": "DJN_DN20250204003573:0",
            "title": "India's Budget Plots Path for Sustainable Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao and Fabiana Negrin Ochoa</p><p class=\"\">India's budget delivered on several items markets had been hoping for: a lowered deficit target, tax cuts, and support for the country's factories and the middle class. Focus now turns to policy execution, with economists watching to see if policymakers can deliver on their aim of supporting growth without sacrificing fiscal prudence or financial stability.</p><p class=\"\">Here's what we watched:</p><p class=\"\">FISCAL FOCUS: The 50.65 trillion rupee budget for the fiscal year starting April, equivalent to $584.22 billion, stuck to its fiscal consolidation guns, despite pressure to do more to lift the economy.</p><p class=\"\">India again cut its fiscal deficit target, lowering it to 4.4% of gross domestic product from an estimated 4.8% for the current fiscal year ending March.</p><p class=\"\">Fiscal prudence prevailed over calls to spur growth, ANZ economists said.</p><p class=\"\">With policymakers continuing to prioritize macroeconomic resilience over short-term spurts of growth, the budget shows continued focus on strengthening public sector balance sheets to \"create a long runway of high and stable growth,\" Goldman Sachs economists Santanu Sengupta, Arjun Varma and Andrew Tilton said.</p><p class=\"\">The budget targets what Nomura economists view as an \"impossible fiscal trinity\" of fiscal discipline, income tax cuts and steady capex outlay. \"Only two can hold.\"</p><p class=\"\">DOWNSIZE DEBT: The budget also laid out a medium-term fiscal strategy to keep central government debt on a downward path to 50% of GDP by FY 2031.</p><p class=\"\">Increased confidence that the government can stick to that framework and keep debt on the decline would be positive for India's sovereign rating over time, said Jeremy Zook, primary sovereign analyst for India at Fitch Ratings. \"Still, the pace of debt reduction is gradual, which leaves open downside risks from a large economic shock.\"</p><p class=\"\">While India is likely to reach its near-term policy goals, Christian de Guzman, senior vice president at Moody's Ratings, doesn't expect the debt burden to improve enough to put its fiscal strength on par with most of its investment-grade peers.</p><p class=\"\">GROWTH DRIVERS: The budget identified four key engines of development: agriculture, micro, small and medium enterprises, private sector investments and exports. Measures included financial assistance for farmers, expanded credit for startups, and job creation for manufacturing.</p><p class=\"\">The budget is largely neutral for economic growth, and is unlikely to deliver any inflationary impulse, according to Nomura economists led by Sonal Varma.</p><p class=\"\">Given the time it will take to see the impact on consumption, OCBC maintains its real GDP growth forecast for FY 2026 at 6.2%.</p><p class=\"\">TAXES: To boost consumption, the budget tabled income tax relief aimed at freeing up spending power but analysts are not fully sold on the efficacy.</p><p class=\"\">The government raised the income tax exemption limit for annual incomes up to INR1.2 million, specifically targeting the middle class. That will result in a revenue loss of about INR1 trillion in direct taxes.</p><p class=\"\">The tax cuts could raise net incomes among India's upper middle class by 2%-7%, analysts at Emkay Global said, but the \"net effect is inconspicuous.\"</p><p class=\"\">ANZ economists expect to see only a mild boost to household consumption, as the direct impacts seem limited to a narrow base. Consumption could have been boosted more widely by reducing indirect taxes on essential goods like fuel, they said.</p><p class=\"\">OCBC economist Lavanya Venkateswaran noted that there are no clear offsets to compensate for the revenue loss and though there is a shift toward greater tax compliance, implementation will be key. Reliance on nontax revenues leaves fiscal consolidation vulnerable given the uncertainty of such sources, while tax revenue assumptions depend on a growth outlook subject to downside risks, she added.</p><p class=\"\">MARKETS: The implications for markets appear largely neutral, with analysts viewing the budget as a tailwind for consumer-facing stocks.</p><p class=\"\">Yuan Yiu Tsai at Eastspring Investments flags urban consumption-related stocks  as budget winners over capex-driven ones as they can benefit from the boost to disposable income. Immediate beneficiaries include auto, hospitality and retail stocks, the portfolio manager said.</p><p class=\"\">Goldman Sachs strategists also favor consumer-retail oriented lenders, banks and financial firms, as well as urban-discretionary consumption categories.</p><p class=\"\">RBI RESCUE? Eyes now turn to the Reserve Bank of India meeting Friday--its first under a new governor. The budget's fiscal consolidation has firmed up expectations that a rate cut is coming after GDP data signaled that India's growth slowed to a four-year low.</p><p class=\"\">With a paring back of the fiscal deficit likely to impart a negative fiscal impulse on the economy, the task of lifting growth likely rests on the RBI, HSBC economists said.</p><p class=\"\">Write to Kimberley Kao and Fabiana Negrin Ochoa</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003573:0-india-s-budget-plots-path-for-sustainable-growth/",
            "pub_date": "2025-02-04 19:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003577:0",
            "title": "BOE Could Cut Rates Only Twice More, Pausing in Second Half of 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bank of England could cut interest rates only twice more, including once at this week's meeting, pausing rate reductions by the second half of the year, Berenberg's Andrew Wishart says in a note. Concerns about weak growth and rising unemployment rate are likely to result in faster initial rate reductions, but fears about a rebound in U.K. inflation could then cause the BOE to pause, he says. \"Rising government spending and rate cuts will encourage demand and allow firms to cover higher costs by raising prices.\" Berenberg expects U.K. inflation could reaccelerate to 3.0% in 2025. U.K. money markets price in three rate cuts this year, though a second reduction isn't fully priced in until June. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003577:0/",
            "pub_date": "2025-02-04 19:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308485:0",
            "title": "Enterprise Products Partners' Q4 Earnings Rise, Revenue Falls",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Enterprise Products Partners  reported Q4 earnings Tuesday of $0.74 per diluted share, up from $0.72 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.71. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $14.20 billion compared with $14.62 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $14.13 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308485:0/",
            "pub_date": "2025-02-04 19:14:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1AG:0",
            "title": "Atkore Inc Revises Full-year Adjusted Net income Per Diluted Share Outlook To A Range Of $5.75 to $6.85.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Atkore Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY ADJUSTED NET INCOME PER DILUTED SHARE OUTLOOK ADJUSTED TO $5.75-$6.85</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY2025 EARNINGS PER SHARE VIEW $8.39 — LSEG IBES DATA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1AG:0-atkore-inc-revises-full-year-adjusted-net-income-per-diluted-share-outlook-to-a-range-of-5-75-to-6-85/",
            "pub_date": "2025-02-04 19:14:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308493:0",
            "title": "GUIDANCE: (SPOT) Spotify Technology Expects Fiscal Q1 Revenue 4.2 Billion Euros, vs. FactSet Est of 4.15 Billion Euros",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308493:0/",
            "pub_date": "2025-02-04 19:14:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr2VkmvS:0",
            "title": "Notification of transactions by person discharging managerial responsibilities in Penneo A/S",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Penneo<p class=\"\">Company Release no. 9/2025</p><p class=\"\">Copenhagen, Denmark, 4 February 2025</p><p class=\"\">In accordance with the Market Abuse Regulation, Penneo must notify the Danish Financial Supervisory Authority (Finanstilsynet) and publicly disclose transactions made by persons discharging managerial responsibilities and persons closely associated with them on trading of Penneo shares. </p><p class=\"\">Penneo hereby notify and submit the attached transactions of shares in Penneo.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information</strong></p><p class=\"\">CEO, Christian Stendevad</p><p class=\"\">Mobile (+45) 27 29 50 02</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Penneo</strong></p><p class=\"\">Penneo combines digital signing and Know Your Customer (KYC) workflows into a single platform that streamlines critical business processes for anti-money-laundering regulated B2B companies.</p><p class=\"\">Founded in Copenhagen and operating throughout Europe, Penneo is fast becoming the go-to platform for companies looking to save time on administrative tasks while ensuring complete regulatory compliance and peace of mind for themselves and their clients. Penneo is already trusted by +3,000 companies - including the world’s leading auditors.</p><p class=\"\">For information about Penneo, please visit https://penneo.com/investors.</p><p class=\"\">https://news.cision.com/penneo/r/notification-of-transactions-by-person-discharging-managerial-responsibilities-in-penneo-a-s%2Cc4100227</p><p class=\"\">Template for notification pdf writing possible - Kasper Behrens - Sale of shares 03022025</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr2VkmvS:0-notification-of-transactions-by-person-discharging-managerial-responsibilities-in-penneo-a-s/",
            "pub_date": "2025-02-04 19:14:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:73001a78274a6:0",
            "title": "Ingredion Reports Strong 2024 Fourth Quarter and Full-Year Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ingredion Incorporated, a leading global provider of ingredient solutions to the food and beverage manufacturing industry, has released its fourth quarter and full-year 2024 results. The company reported strong financial performance, driven by robust sales volume growth and strategic reorganization efforts.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Ingredion's full-year 2024 reported and adjusted earnings per share (EPS) were $9.71 and $10.65, respectively, compared to $9.60 and $9.42 in 2023. The company generated $1,436 million in cash from operations, benefiting from a $400 million favorable change in working capital balances as corn costs decreased. Additionally, Ingredion returned $426 million to shareholders, including $216 million in share repurchases.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The company saw record fourth-quarter financial results, with significant contributions from the Texture and Healthful Solutions (T&amp;HS) segment and the Food and Industrial Ingredients (F&amp;II) segments in the US/CAN and LATAM regions. The T&amp;HS segment experienced double-digit sales volume growth, while the F&amp;II US/CAN segment benefited from multi-year customer contract renewals, leading to substantial operating income growth.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Ingredion's strategic initiatives included a $100 million investment in its Indianapolis facility to enhance reliability and operating efficiency. The company also completed the sale of its South Korea business, which impacted net sales and operating income. Despite these changes, Ingredion managed to achieve significant cost savings through its Cost2Compete program.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Jim Zallie, president and CEO of Ingredion, highlighted the company's record Q4 financial results and the successful reorganization efforts that positioned the company for future growth. Zallie emphasized the importance of customer collaboration and operational excellence in driving the company's performance.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, Ingredion expects reported and adjusted EPS to be in the range of $10.75 to $11.55. The company anticipates low single-digit growth in net sales, driven by greater volume demand, partially offset by price mix and foreign exchange impacts. Operating income is expected to increase by mid-single digits, with specific growth projections for the T&amp;HS and F&amp;II LATAM segments.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1046257/000104625725000007/ingr-20250204.htm\" rel=\"nofollow\" target=\"_blank\">Ingredion Inc [ INGR ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:73001a78274a6:0-ingredion-reports-strong-2024-fourth-quarter-and-full-year-results/",
            "pub_date": "2025-02-04 19:15:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003580_20250204003597:0",
            "title": "Corvel 4Q Rev $228.0M >CRVL",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003580_20250204003597:0/",
            "pub_date": "2025-02-04 19:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003580_20250204003598:0",
            "title": "Corvel 4Q EPS 46c >CRVL",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003580_20250204003598:0/",
            "pub_date": "2025-02-04 19:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX77KH1W:0",
            "title": "CorVel Announces Revenues and Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FORT WORTH, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — CorVel Corporation  announced the results for the quarter ended December 31, 2024. Revenues for the quarter were $228 million, an increase from $202 million in the December quarter of 2023. Earnings per share for the quarter were $0.46, compared to $0.33 in the same quarter of the prior year. Revenues for the nine months ended December 31, 2024 were $664 million, an increase from $588 million during the nine months ended December 31, 2023. Earnings per share for the nine months ended December 31, 2024 were $1.32, compared to $1.09 during the nine months ended December 31, 2023. The earnings per share numbers for the current and prior year have been adjusted to reflect the three-for-one stock split of its common stock which was paid on December 24, 2024.</p><p class=\"\">Third Quarter Fiscal Year 2025 Highlights </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue increased 13% to $228 million, compared to the third quarter of fiscal year 2024.</li><li class=\"listItem-bmN0_SHH\">Gross profit increased 25% to $52.9 million, at 23.2% gross margin, compared to the third quarter of fiscal year 2024 gross profit of $42.2 million.</li><li class=\"listItem-bmN0_SHH\">Diluted earnings per share increased 39% to $0.46, compared to the third quarter of fiscal year 2024 diluted earnings per share of $0.33.</li><li class=\"listItem-bmN0_SHH\">Exited the quarter with $163 million cash, cash equivalents, and no borrowings.</li><li class=\"listItem-bmN0_SHH\">The Company repurchased $9.6 million of common stock during the quarter.</li></ul><p class=\"\">A key to CorVel’s success and differentiation in technological innovation is the development team’s structure, the depth and tenure of the employees, and the lack of impedance in translating business needs into the development and implementation of functioning systems. Due to the depth and strength of the IT team, system updates, and new features are released weekly, which enables rapid progress on enhancements and advancements in automation and innovation. In the December quarter, generative-AI-based functionality was released to streamline document processing and identify claim milestones, and improvements are planned to enhance the integrated communication platform. These enhancements can optimize outcomes, improve the experience of injured workers, and make day-to-day tasks easier, which allows CorVel professionals to focus on higher-level activities.</p><p class=\"\">During the quarter in the healthcare market, the persistent upward trend of medical costs is causing Administrative Services Only, ASO, customers to seek additional medical savings and greater cost efficiency in claims. CERIS is ideally equipped to solve the growing demand by offering multiple audits and lowering claim thresholds. With substantial expertise in prepay, CERIS is able to accommodate ASOs and Payers with the tools needed to reduce medical spend without additional administrative overhead.</p><p class=\"\">Safe Harbor Statement under the Private Securities Litigation Reform Act of 1995 </p><p class=\"\">All statements included in this press release, other than statements or characterizations of historical fact, are forward-looking statements. These forward-looking statements are based on the Company’s current expectations, estimates and projections about the Company, management’s beliefs, and certain assumptions made by the Company, and events beyond the Company’s control, all of which are subject to change. Such forward-looking statements include, but are not limited to, improved productivity resulting from automation and augmentation across enterprise business systems. These forward-looking statements are not guarantees of future results and are subject to risks, uncertainties and assumptions that could cause the Company’s actual results to differ materially and adversely from those expressed in any forward-looking statement results of operations and financial condition is greater than our initial assessment. The risks and uncertainties referred to above include but are not limited to factors described in this press release and the Company’s filings with the Securities and Exchange Commission, including but not limited to “Risk Factors” in the Company’s Annual Report on Form 10-K for the year ended March 31, 2024, and the Company’s Quarterly Report on Form 10-Q for the quarters ended June 30, 2024 and September 30, 2024. The forward-looking statements in this press release speak only as of the date they are made. The Company undertakes no obligation to revise or update publicly any forward-looking statement for any reason.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CorVel Corporation</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Quarterly Results – Income Statement</strong></p><p class=\"\">Quarters and Nine Months Ended December 31, 2024 (unaudited) and December 31, 2023 (unaudited)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Quarter Ended</td><td colspan=\"2\">December 31, 2024</td><td> </td><td colspan=\"2\">December 31, 2023</td><td> </td></tr><tr><td>Revenues</td><td>$</td><td>227,973,000</td><td> </td><td>$</td><td>202,303,000</td><td> </td></tr><tr><td>Cost of revenues</td><td> </td><td>175,115,000</td><td> </td><td> </td><td>160,143,000</td><td> </td></tr><tr><td>Gross profit</td><td> </td><td>52,858,000</td><td> </td><td> </td><td>42,160,000</td><td> </td></tr><tr><td>General and administrative</td><td> </td><td>22,058,000</td><td> </td><td> </td><td>19,798,000</td><td> </td></tr><tr><td>Income from operations</td><td> </td><td>30,800,000</td><td> </td><td> </td><td>22,362,000</td><td> </td></tr><tr><td>Income tax provision</td><td> </td><td>7,029,000</td><td> </td><td> </td><td>5,267,000</td><td> </td></tr><tr><td>Net income</td><td>$</td><td>23,771,000</td><td> </td><td>$</td><td>17,095,000</td><td> </td></tr><tr><td>Earnings Per Share:</td><td colspan=\"2\"> </td><td> </td><td colspan=\"2\"> </td><td> </td></tr><tr><td>Basic</td><td>$</td><td>0.46</td><td> </td><td>$</td><td>0.33</td><td> </td></tr><tr><td>Diluted</td><td>$</td><td>0.46</td><td> </td><td>$</td><td>0.33</td><td> </td></tr><tr><td>Weighted Shares</td><td colspan=\"2\"> </td><td> </td><td colspan=\"2\"> </td><td> </td></tr><tr><td>Basic</td><td> </td><td>51,388,000</td><td> </td><td> </td><td>51,318,000</td><td> </td></tr><tr><td>Diluted</td><td> </td><td>52,038,000</td><td> </td><td> </td><td>51,978,000</td><td> </td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Nine Months Ended</td><td colspan=\"2\">December 31, 2024</td><td> </td><td colspan=\"2\">December 31, 2023</td><td> </td></tr><tr><td>Revenues</td><td>$</td><td>664,075,000</td><td> </td><td>$</td><td>588,078,000</td><td> </td></tr><tr><td>Cost of revenues</td><td> </td><td>512,528,000</td><td> </td><td> </td><td>459,788,000</td><td> </td></tr><tr><td>Gross profit</td><td> </td><td>151,547,000</td><td> </td><td> </td><td>128,290,000</td><td> </td></tr><tr><td>General and administrative</td><td> </td><td>64,043,000</td><td> </td><td> </td><td>55,786,000</td><td> </td></tr><tr><td>Income from operations</td><td> </td><td>87,504,000</td><td> </td><td> </td><td>72,504,000</td><td> </td></tr><tr><td>Income tax provision</td><td> </td><td>18,758,000</td><td> </td><td> </td><td>15,706,000</td><td> </td></tr><tr><td>Net income</td><td>$</td><td>68,746,000</td><td> </td><td>$</td><td>56,798,000</td><td> </td></tr><tr><td>Earnings Per Share:</td><td colspan=\"2\"> </td><td> </td><td colspan=\"2\"> </td><td> </td></tr><tr><td>Basic</td><td>$</td><td>1.34</td><td> </td><td>$</td><td>1.11</td><td> </td></tr><tr><td>Diluted</td><td>$</td><td>1.32</td><td> </td><td>$</td><td>1.09</td><td> </td></tr><tr><td>Weighted Shares</td><td colspan=\"2\"> </td><td> </td><td colspan=\"2\"> </td><td> </td></tr><tr><td>Basic</td><td> </td><td>51,384,000</td><td> </td><td> </td><td>51,372,000</td><td> </td></tr><tr><td>Diluted</td><td> </td><td>51,999,000</td><td> </td><td> </td><td>52,056,000</td><td> </td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">CorVel Corporation</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Quarterly Results – Condensed Balance Sheet</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">December 31, 2024 (unaudited) and March 31, 2024</strong></p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> </td><td colspan=\"2\">December 31, 2024</td><td> </td><td> </td><td colspan=\"2\">March 31, 2024</td><td> </td></tr><tr><td>Cash</td><td>$</td><td>162,944,000</td><td> </td><td> </td><td>$</td><td>105,563,000</td><td> </td></tr><tr><td>Customer deposits</td><td> </td><td>99,496,000</td><td> </td><td> </td><td> </td><td>88,142,000</td><td> </td></tr><tr><td>Accounts receivable, net</td><td> </td><td>106,178,000</td><td> </td><td> </td><td> </td><td>97,108,000</td><td> </td></tr><tr><td>Prepaid taxes and expenses</td><td> </td><td>14,543,000</td><td> </td><td> </td><td> </td><td>11,418,000</td><td> </td></tr><tr><td>Property, net</td><td> </td><td>91,256,000</td><td> </td><td> </td><td> </td><td>85,892,000</td><td> </td></tr><tr><td>Goodwill and other assets</td><td> </td><td>42,420,000</td><td> </td><td> </td><td> </td><td>42,498,000</td><td> </td></tr><tr><td>Right-of-use asset, net</td><td> </td><td>21,940,000</td><td> </td><td> </td><td> </td><td>24,058,000</td><td> </td></tr><tr><td>Total</td><td>$</td><td>538,777,000</td><td> </td><td> </td><td>$</td><td>454,679,000</td><td> </td></tr><tr><td>Accounts and taxes payable</td><td>$</td><td>16,630,000</td><td> </td><td> </td><td>$</td><td>16,631,000</td><td> </td></tr><tr><td>Accrued liabilities</td><td> </td><td>200,108,000</td><td> </td><td> </td><td> </td><td>167,868,000</td><td> </td></tr><tr><td>Long-term lease liabilities</td><td> </td><td>21,189,000</td><td> </td><td> </td><td> </td><td>22,533,000</td><td> </td></tr><tr><td>Paid-in capital</td><td> </td><td>246,698,000</td><td> </td><td> </td><td> </td><td>233,632,000</td><td> </td></tr><tr><td>Treasury stock</td><td> </td><td>(822,514,000</td><td>)</td><td> </td><td> </td><td>(793,905,000</td><td>)</td></tr><tr><td>Retained earnings</td><td> </td><td>876,666,000</td><td> </td><td> </td><td> </td><td>807,920,000</td><td> </td></tr><tr><td>Total</td><td>$</td><td>538,777,000</td><td> </td><td> </td><td>$</td><td>454,679,000</td><td> </td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Contact: Melissa Storan</li><li class=\"listItem-bmN0_SHH\">Phone: 949-851-1473</li><li class=\"listItem-bmN0_SHH\">www.corvel.com</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX77KH1W:0-corvel-announces-revenues-and-earnings/",
            "pub_date": "2025-02-04 19:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003590:0",
            "title": "Amcor plc Files 8K - Operations And Financial Condition >AMCR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Amcor plc (AMCR) filed a Form 8K - Operations and Financial Condition - with the U.S Securities and Exchange Commission on February 04, 2025.</p><p class=\"\">On February 4, 2025, Amcor plc (the \"Company\") issued a press release regarding financial results for the second quarter and first six months of fiscal year 2025. The press release is furnished as Exhibit 99.1 hereto. The Company is also furnishing an investor presentation relating to the second quarter and first six months of fiscal year 2025 (the \"Presentation\"), which will be used by management for presentations to investors and others. A copy of the Presentation is attached hereto as Exhibit 99.2 and incorporated into this Item 2.02 by reference. The Presentation is also available on the Company's website at https://www.amcor.com/investors. The Company is not including the information contained on its website as part of, or incorporating it by reference into, this Current Report on Form 8-K.</p><p class=\"\">The information in this Current Report on Form 8-K shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or incorporated by reference in any filing under the Securities Act of 1933, as amended (the \"Securities Act\"), or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.</p><p class=\"\">The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1748790/000174879025000005/amcr-20250204.htm</p><p class=\"\">Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1748790/000174879025000005/0001748790-25-000005-index.htm</p><p class=\"\">Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003590:0/",
            "pub_date": "2025-02-04 19:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN8lkTy5:0",
            "title": "B2 Impact ASA: Invitation to Q4 2024 results on Thursday 13 February",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">B2 Impact ASA will publish its fourth quarter 2024 results on Thursday 13 February 2025.</p><p class=\"\">07:00 CET: The report and presentation will be made available on www.b2-impact.com and newsweb.oslobors.no</p><p class=\"\">08:30 CET: The fourth quarter results and the following Q&amp;A will be presented in a live audiocast. The audiocast will be available through the following link:</p><p class=\"\">Fourth quarter 2024 Presentation</p><p class=\"\">Live viewers can submit their written questions for the Q&amp;A in the player during the audiocast.</p><p class=\"\">The audiocast can also be accessed through the following link where questions for the Q&amp;A can be asked live:</p><p class=\"\">Call Access</p><p class=\"\">A recording of the audiocast will be available on-demand after the live stream is concluded.</p><p class=\"\">For further information, please contact:</p><p class=\"\">Rasmus Hansson</p><p class=\"\">Head of Investor Relations and M&amp;A, B2 Impact ASA</p><p class=\"\">Mobile: +47 952 55 842</p><p class=\"\">E-mail: rasmus.hansson@b2-impact.com</p><p class=\"\">About B2 Impact</p><p class=\"\">B2 Impact is one of the leading pan-European debt management companies. B2 Impact offers solutions to the challenges created by defaulted loans, and provide liquidity to financial institutions, contributing to a healthier financial system. B2 Impact promote lasting financial improvement through transparent and ethical debt management. B2 Impact is headquartered in Oslo, Norway and the B2 Impact share is listed on the Oslo Stock Exchange under the ticker \"B2I\". For further information, visit www.b2-impact.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN8lkTy5:0-b2-impact-asa-invitation-to-q4-2024-results-on-thursday-13-february/",
            "pub_date": "2025-02-04 19:15:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_PLX2B81B4:0",
            "title": "BRIEF-CorVel Q3 EPS USD 0.46",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 04 (Reuters) - CorVel Q3 revenue USD 228 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_PLX2B81B4:0-brief-corvel-q3-eps-usd-0-46/",
            "pub_date": "2025-02-04 19:15:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463439:0",
            "title": "Arc Minerals, Anglo American JV Extends Copper Mineralization at Zambian Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arc Minerals'  joint venture company with Anglo American's (, AGL.JO) Zambian subsidiary on Tuesday reported additional near-surface copper mineralization 1.5 kilometers from Cheyeza East Oxide Occurrence in Zambia. </p><p class=\"\">The diamond drilling at Cheyeza intersected mineralization including a 40.6 meter section averaging 0.61% copper from 22.25 meters, including 7.70 meters at 1.72% copper from 26.75 meters or 12.75 meters at 1.20% copper from 22.25 meters. </p><p class=\"\">The exploration company said it was now exploring the extent of sulfide mineralization at Cheyeza by identifying additional drill targets.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463439:0/",
            "pub_date": "2025-02-04 19:08:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308487:0",
            "title": "Earnings Flash (INGR) INGREDION INCORPORATED Reports Q4 Revenue $1.80B, vs. FactSet Est of $1.86B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308487:0/",
            "pub_date": "2025-02-04 19:08:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003504:0",
            "title": "U.K. Grocery Inflation Slows as Supermarkets Bet on Discounts, Report Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Michael Susin</p><p class=\"\">U.K. grocery inflation fell in January as intense promotional activity provided some relief for budget-pressured households.</p><p class=\"\">Annual grocery inflation fell to 3.3% for the four weeks to Jan. 26 compared with the previous year. This followed 3.7% grocery inflation recorded in December, according to the latest report from research firm Kantar.</p><p class=\"\">Kantar said take-home grocery sales rose by 4.3% on year, and nearly one third of this spending was on promotions.</p><p class=\"\">Consumers are also ditching brand names and prioritizing keeping costs down, with private-label sales proportionally reaching a record high of more than half of sales in January.</p><p class=\"\">Following the Christmas festivities and related excesses, January's sales were also marked by an increase in wellness trends, with more than 10% of the average consumer's bill spent on fresh staples such as fruit, vegetables and salad.</p><p class=\"\">Sales of low-and-no alcohol drinks were 7% higher than the same period a year prior, as the \"dry January\" trend becomes increasingly popular among older shoppers.</p><p class=\"\">Among the top-performing grocers over the 12 weeks to Jan. 26, sales of the German discounter Lidl rose 7.4% and reached three consecutive years of growth, holding a market share of 7.2%.</p><p class=\"\">Online retailer Ocado was the fastest-growing grocer for the ninth consecutive month, with sales up 11.3% and a 1.9% market share.</p><p class=\"\">The U.K.'s largest grocer, Tesco, achieved a market share of 28.5% and saw a 5.6% rise in sales.</p><p class=\"\">Write to Michael Susin at michael.susin@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003504:0/",
            "pub_date": "2025-02-04 19:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308489:0",
            "title": "Earnings Flash (INGR) INGREDION INCORPORATED Reports Q4 Adjusted EPS $2.63, vs. FactSet Est of $2.56",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308489:0/",
            "pub_date": "2025-02-04 19:09:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463445:0",
            "title": "AB Volvo Teams Up With Canadian AI Group Waabi for Self-driving Trucks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AB Volvo (VOLV-A.ST, VOLV-B.ST) teamed up with Canadian artificial intelligence company Waabi Innovation for self-driving trucks. </p><p class=\"\">The automaker plans to integrate Waabi's virtual driver system into the Volvo VNL Autonomous truck, according to a Tuesday release. </p><p class=\"\">Volvo Autonomous Solutions is scheduled to produce \"a handful\" of trucks through the partnership in 2025, Bloomberg News reported on the same day, citing an interview with Waabi Chief Executive Officer Raquel Urtasun.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463445:0/",
            "pub_date": "2025-02-04 19:09:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0W7:0",
            "title": "SailPoint, investor aim to raise up to $1.05 billion in US IPO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SailPoint and one of its shareholders are aiming to raise as much as $1.05 billion in the cybersecurity firm's initial public offering in the United States, the company said on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0W7:0-sailpoint-investor-aim-to-raise-up-to-1-05-billion-in-us-ipo/",
            "pub_date": "2025-02-04 19:09:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308490:0",
            "title": "Earnings Flash (OCSL) Oaktree Specialty Lending Reports Fiscal Q1 Adjusted EPS $0.09, vs. FactSet Est of $0.53",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308490:0/",
            "pub_date": "2025-02-04 19:09:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0VX:0",
            "title": "Estee Lauder announced job cuts and posts sales beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder  on Tuesday expanded its restructuring plan that would include up to 7,000 job cuts and posted smaller-than-expected drop in second-quarter sales.</p><p class=\"\">The company's sales fell 6% to $4 billion in the quarter, compared with analysts' estimates of 7.3% drop to $3.97 billion, as per data compiled by LSEG.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0VX:0-estee-lauder-announced-job-cuts-and-posts-sales-beat/",
            "pub_date": "2025-02-04 19:09:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308455:0",
            "title": "ING Comments on Euro, Sterling",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Amid the United States-Canada-Mexico tariff saga — which was the main driver of  on Monday — eurozone flash CPI estimates for January came in slightly hotter than expected, said ING. </p><p class=\"\">The core measure was unchanged at 2.7% year-over-year while expectations were for 2.6%. </p><p class=\"\">The upside risks remain significant to inflation, but ING is still confident that the trajectory remains deflationary for the remainder of the year and still predicts rates will be cut at least to 2.0% in the eurozone. </p><p class=\"\">In light of U.S. President Donald Trump's handling of the Mexico and Canada tariff threat, sentiment in the eurozone has improved that a deal can be struck and protectionism averted, wrote the bank in a note. Still, extra caution is warranted. </p><p class=\"\">Part of Trump's motive in delaying tariffs on U.S. neighbors was domestic backlash for potential immediate economic pain for U.S. consumers and that isn't necessarily true for European Union tariffs. On those, Trump can afford to play the longer game and make the EU feel some \"pain\" before striking a deal, ING said. Trump's motives for tariffs on the EU would not be border-related, where a deal is arguably quicker to achieve as seen on Monday, but rather on trade imbalances, which often require longer negotiations. </p><p class=\"\">With all this in mind, ING is somewhat skeptical that the euro is bound for a major rally. Trump has already hinted the EU is next on the tariff list, and markets may probably find better value in buying the dips in currencies that have passed the protectionism peak against the euro, which is still to face the worst of it. ING expects a U.S.-China trade deal to take  close to 1.040, but the rally may lose steam around those levels. </p><p class=\"\">Sterling emerged as a safe haven among pro-cyclical currencies on Monday and seems to be retaining some solid footing after a U.S. trade war was averted, stated ING. The reason is simple: the United Kingdom doesn't have much to lose from U.S. tariffs. U.K. exports to the U.S. are less than 2% of gross domestic product and those to China less than 1%. </p><p class=\"\">Incidentally, Trump seems in no rush to hit the U.K. with tariffs, also considering its goods trade balance with the U.S. is arguably negligible. Trump also seemed to be on rather amicable terms with U.K. Prime Minister Keir Starmer after a recent call, added the bank. </p><p class=\"\">Another factor contributing to sterling strength was Starmer's trip to Brussels. That was officially aimed at strengthening an EU-U.K. defense path, but on which markets may be double reading an intent by Starmer to gradually reconnect with the EU politically. That is inarguably positive for sterling, which remains highly sensitive to any development that can improve a worsening growth outlook, according to ING. </p><p class=\"\">There are however some downside risks for sterling this week, ING foresees headlines Tuesday confirming the fiscal headroom for the U.K. finance minister has evaporated due to higher borrowing costs, and on Thursday the Bank of England may deliver a dovish rate cut. </p><p class=\"\">Still,  may not return to the 0.8450 January peak soon.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308455:0/",
            "pub_date": "2025-02-04 19:09:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003150_20250204003530:0",
            "title": "Estee Lauder Launches Strategic Vision to Restore Sustainable Sales Growth, Achieve Stronger Profitability >EL",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003150_20250204003530:0/",
            "pub_date": "2025-02-04 19:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV029:0",
            "title": "Willis Towers Watson Reported 4% Increase In Q4 Revenue To $3.0 billion.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Willis Towers Watson PLC :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 REVENUE INCREASES 4% TO $3.0 BILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 ADJUSTED DILUTED EPS UP 9% TO $8.13</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WTW: EXPECT SHARE REPURCHASES OF $1.5 BILLION IN FY25</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 EARNINGS PER SHARE VIEW $8.03, REVENUE VIEW $3.06 BILLION — LSEG IBES DATA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV029:0-willis-towers-watson-reported-4-increase-in-q4-revenue-to-3-0-billion/",
            "pub_date": "2025-02-04 19:10:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308479:0",
            "title": "Earnings Flash (IT) Gartner Posts Q4 Adjusted EPS $5.45, vs. FactSet Est of $3.25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308479:0/",
            "pub_date": "2025-02-04 19:10:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308495:0",
            "title": "Commerzbank on Overnight News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Commerzbank in its \"European Sunrise\" note of Tuesday highlighted:</p><p class=\"\">Markets: Tariff volatility continues. United States Treasury futures slip back close to Friday's lows, equities recover unevenly, US dollar softens, oil is weaker. </p><p class=\"\">Tariffs: U.S. President Donald Trump agrees to delay 25% tariffs on Canada and Mexico for one month after both countries agree to take tougher measures to combat migration and drug trafficking. 10% tariffs on China come into effect but Trump wanted to speak to Chinese President Xi Jinping \"probably over the next 24 hours.\" China announces new tariffs on U.S. products, adds U.S. firms to unreliable entities list, probes Google, restricts exports of tungsten materials. European Commission (EC) President Ursula Von der Leyen wants to be \"very pragmatic, engage early, and discuss and debate\" with Trump. </p><p class=\"\">Fed: Atlanta Federal Reserve President Raphael Bostic thinks the Fed might wait \"for a while\", sees nominal neutral rate at 3%-3.5%. Chicago Federal Reserve President Austan Goolsbee says the Fed should proceed with more caution \"because there are risks that inflation is about to start kicking back up again\" due to tariffs. Federal Reserve Bank of Boston President Susan Collins says the Fed could \"look through\" initial inflation hit if expectations remain well-anchored. </p><p class=\"\">U.S.: Trump signs executive action to create sovereign wealth fund, says he has \"great interest\" in Tiktok. On Russia/Ukraine he says he made \"a lot of progress,\" demands a rare-earths deal with Ukraine in return for military support. He will hold a press conference with Israeli Prime Minister Benjamin Netanyahu on Tuesday. </p><p class=\"\">US Treasury reduces Q1 borrowing estimate by $9 billion to $815 billion, expects $123 billion borrowing in Q2. </p><p class=\"\">==EUROPE:</p><p class=\"\">EU: The European Union explores ways to create more fiscal space for the significant increase in defense spending. Geman PM Olaf Scholz speaks out against new joint debt, Finland's PM Petteri Orpo is \"open\". The EC will publish guidance on AI on Tuesday despite Trump's warnings (FT).</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308495:0/",
            "pub_date": "2025-02-04 19:10:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003371_20250204003373:0",
            "title": "Ingredion 4Q Net $95M >INGR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003371_20250204003373:0/",
            "pub_date": "2025-02-04 19:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003371_20250204003371:0",
            "title": "Ingredion 4Q EPS $1.43 >INGR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003371_20250204003371:0/",
            "pub_date": "2025-02-04 19:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003371_20250204003372:0",
            "title": "Ingredion 4Q Adj EPS $2.63 >INGR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003371_20250204003372:0/",
            "pub_date": "2025-02-04 19:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003150_20250204003417:0",
            "title": "Estee Lauder Sees 3Q Organic Net Sales Growth Declining 8% - 10%>EL",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003150_20250204003417:0/",
            "pub_date": "2025-02-04 19:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}