{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308758:0",
            "title": "Citigroup Adjusts Price Target on Tyson Foods to $59 From $61, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tyson Foods  has an average rating of hold and mean price target of $64.55, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308758:0/",
            "pub_date": "2025-02-04 20:52:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308759:0",
            "title": "Stifel Adjusts Price Target on Equity Residential to $82.25 From $85, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equity Residential  has an average rating of overweight and mean price target of $77.70, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308759:0/",
            "pub_date": "2025-02-04 20:52:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:bf53642e9c01c:0",
            "title": "LANCASTER COLONY CORP SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lancaster Colony Corp, a leading manufacturer and marketer of specialty food products, has released its Form 10-Q report for the second quarter of fiscal year 2024. The report provides a comprehensive overview of the company's financial and operational performance, showcasing growth in key segments and strategic initiatives aimed at enhancing production capabilities and market reach.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Sales:</strong> $509.3 million, increased 4.8% from the prior year, driven by higher net sales in both Retail and Foodservice segments.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gross Profit:</strong> $132.8 million, increased by $11.3 million due to higher sales volumes, favorable sales mix, and cost savings initiatives.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $75.7 million, increased by $9.9 million, reflecting higher gross profit despite increased SG&amp;A expenses.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income:</strong> $48.993 million, decreased by 4.8% from the prior year, impacted by a one-time pension settlement charge.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income Per Common Share:</strong> $1.78, decreased by $0.09, affected by the pension settlement charge and costs related to the planned Atlanta plant acquisition.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Retail Segment:</strong> Saw a 6.3% increase in net sales for the three months ended December 31, 2024, driven by higher sales volumes from both licensing programs and own brands. Key contributors included Texas Roadhouse® dinner rolls, Buffalo Wild Wings® sauces, Subway® sauces, and Olive Garden® dressings.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Foodservice Segment:</strong> Experienced a 3.0% growth in net sales for the three months ended December 31, 2024, primarily due to increased demand from national chain restaurant accounts and growth in Marzetti® branded Foodservice products.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Sales Units</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Retail Segment:</strong> Sales volumes increased by 6.0% for the three months ended December 31, 2024, with a notable 7.4% increase when excluding the exited perimeter-of-the-store bakery product lines.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Foodservice Segment:</strong> Sales volumes rose by 1.5% for the three months ended December 31, 2024, reflecting increased demand from national chain restaurant accounts.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">New Product Launches</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The Retail segment benefited from the introduction of new products such as Texas Roadhouse® dinner rolls and gluten-free New York BRAND® Bakery frozen garlic bread, contributing to sales growth.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">New Production Initiatives</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The company completed a significant capacity expansion project at the Marzetti dressing and sauce facility in Horse Cave, Kentucky, in March 2023, enhancing production capabilities.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The company anticipates continued growth in Retail sales driven by an expanding licensing program and innovation in own brands. In the Foodservice segment, volume growth is expected from select national chain restaurant accounts.</li><li class=\"listItem-bmN0_SHH\">The planned acquisition of a sauce and dressing production facility in Atlanta is expected to enhance operational efficiency, provide incremental capacity, and improve proximity to core customers.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/57515/000005751525000005/lanc-20241231.htm\" rel=\"nofollow\" target=\"_blank\">LANCASTER COLONY CORP [ LANC ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:bf53642e9c01c:0-lancaster-colony-corp-sec-10-q-report/",
            "pub_date": "2025-02-04 20:53:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:e06dd279a96ce:0",
            "title": "IES Holdings, Inc. SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IES Holdings, Inc., a diversified holding company with a focus on electrical contracting and infrastructure solutions, has released its Form 10-Q report for the third quarter. The report highlights significant growth in both financial and operational metrics, driven by robust demand across various segments and improved operational efficiencies.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenues:</strong> $749.5 million, an increase of 18.1% compared to the same period last year, driven by growth across all operating segments.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gross Profit:</strong> $178.0 million, representing 23.8% of revenues, up from 22.7% in the prior year, reflecting improved project execution and reduced material costs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $74.6 million, or 10.0% of revenues, compared to 9.1% in the prior year, indicating enhanced operational efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income:</strong> $57.7 million, or 7.7% of revenues, up from 6.9% in the prior year, driven by increased revenues and improved margins.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Diluted EPS:</strong> $2.72, compared to $1.87 in the prior year, reflecting higher net income attributable to common stockholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Communications:</strong> Revenues increased by 36.4% due to heightened demand from data center customers.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Residential:</strong> Experienced a modest revenue increase of 1.3%, driven by a 10.5% rise in multi-family business revenues, despite a decline in single-family electrical revenues.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Infrastructure Solutions:</strong> Revenues surged by 71.9%, largely due to strong demand in custom engineered solutions and contributions from the acquisition of Greiner Industries.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Commercial &amp; Industrial:</strong> Revenues grew by 4.2%, reflecting strong demand and effective backlog execution.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Geographical Performance:</strong> The report highlights strong demand in key end markets such as data centers, which are likely influenced by regional economic conditions and infrastructure needs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> The company anticipates continued strong demand in data center markets, although challenges such as labor availability and capacity constraints may impact growth. The Residential segment faces potential headwinds from high mortgage rates and inflation affecting housing affordability, while the multi-family segment may see reduced revenues due to higher borrowing costs for project owners.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1048268/000104826825000031/iesc-20241231.htm\" rel=\"nofollow\" target=\"_blank\">IES Holdings, Inc. [ IESC ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:e06dd279a96ce:0-ies-holdings-inc-sec-10-q-report/",
            "pub_date": "2025-02-04 20:53:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446557:0",
            "title": "Palm Oil Extends Gain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Malaysian palm oil futures extended their bullish momentum to MYR 4,400 per tonne in February, the highest in three weeks, as new growing regulations in top producer Indonesia offset pressure from lower prices for rival vegetable oils.</p><p class=\"\">The Indonesian government tightened regulations on palm cultivation permits, benefiting local smallholders but risking lower output.</p><p class=\"\">In the meantime, the threat of retaliatory tariffs from China on US energy goods, mainly LNG and petrol fuels, raised the demand outlook for biodiesel alternatives and supported palm oil benchmarks.</p><p class=\"\">On the other hand, lower costs for soy oil drove major consumer India to allocate feedstock inventories for palm oil alternatives, driving imports to plunge by 46% from the previous month to a 14-year low of 272,000 tonnes in January.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446557:0-palm-oil-extends-gain/",
            "pub_date": "2025-02-04 20:53:06",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV143:0",
            "title": "Pfizer rises on better-than-expected quarterly results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of drugmaker Pfizer  rise ~2% to $26.72 premarket</p><p class=\"\">** Co reports Q4 adj. profit of 63 cents per share, above analysts' est. of 47 cents, according to data compiled by LSEG, driven by strong sales of its heart disease drug and COVID-19 vaccine sales</p><p class=\"\">** Co posts Q4 sales of $17.76 bln vs analysts' est. of $17.36 bln - LSEG</p><p class=\"\">** Q4 sales of heart disease drug, sold as Vyndaqel and Vyndamax, came in at $1.55 bln, above estimates of $1.48 bln - LSEG</p><p class=\"\">** COVID vaccine Comirnaty brought in sales of $3.38 bln, above analysts' est. of $3.10 bln - LSEG</p><p class=\"\">** PFE fell 10.8% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV143:0-pfizer-rises-on-better-than-expected-quarterly-results/",
            "pub_date": "2025-02-04 20:53:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0HL:0",
            "title": "Trump tariffs will only add to the pain for hard-hit Nissan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US is top market by sales for Nissan, Honda and Toyota</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Nissan sources more US sales from Mexico than Honda, Toyota</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Tariff threat complicates Nissan-Honda merger plans</li></ul></span></div><span><p class=\"\">    One of the biggest casualties of Donald Trump's potential tariffs on Mexico and Canada is likely to be the Japanese automaker that can least afford the pain: Nissan . </p><p class=\"\">While it's unclear whether the U.S. President will follow through with his promised 25% levies after agreeing to a 30-day pause on Monday, the blowback would be profound for Japan's No.3 carmaker, which is struggling to turn itself around and is in talks to merge with Honda .</p><p class=\"\">The U.S. is the top market by vehicle sales for Nissan and bigger rivals Toyota  and Honda. All three Japanese automakers make some of their most popular U.S. models in either Canada or Mexico. As such, the impact of the tariffs would be significant for all three, analysts and industry experts say.</p><p class=\"\">But Toyota and Honda are better prepared to ride out the tariffs - both in terms of their finances and their ability to hike prices, and pass on some of the tariff costs to consumers.</p><p class=\"\">\"The problem is Nissan, which is basically barely making money in the automotive business,\" said James Hong, head of mobility research at Macquarie. Many of the models it builds in Mexico for export to the U.S. are more compact cars like the Sentra and Kicks, which are targeted at cost-conscious consumers who can't easily absorb higher prices.</p><p class=\"\">\"The longer the tariff stays, I think it can be quite a big threat for Nissan. And eventually, if the merger actually goes through, then it can be a burden to Honda as well.\"</p><p class=\"\">Nissan did not immediately respond to a request for comment. The company said on Jan. 22 it could not speculate on potential policy changes and their impact, but that it remained focused on delivering quality vehicles and would adapt as needed. </p><p class=\"\">Hong estimates that Nissan would face a complete wipe-out in operating profit unless it took action in response to the tariffs - such as re-routing Mexican-made cars to other markets such as Brazil, raising prices or lowering production.</p><p class=\"\">Nissan sources about 27% of its U.S. sales from Mexico, compared to almost 13% at Honda and 8% at Toyota, according to S&amp;P Global Mobility.</p><p class=\"\">Germany's Volkswagen , which like Nissan has a long history in Mexico, has some of the biggest exposure, with 43% of its U.S. sales sourced from Mexico, S&amp;P Global Mobility estimates.</p><p class=\"\">FRESH BURDEN</p><p class=\"\">For Japan's automakers, Trump's move would turn what has long been a stronghold for the industry - a low-cost production base near the U.S. - into a fresh burden.</p><p class=\"\">Nissan has been producing cars in Mexico since 1966, when it opened its first manufacturing plant outside Japan. Toyota, Honda and Mazda  eventually followed. Nissan didn't open a plant in the U.S. until 1983 with its facility in Smyrna, Tennessee.</p><p class=\"\">\"In the case of reasonably priced cars, if the full tariff gets added to the price, consumers are not going to want to buy. So for example 10% gets added to the price of the car and the rest is shouldered by the company,\" said an executive at one Japanese automaker that was not Nissan.</p><p class=\"\">Since production could not be easily stopped in Mexico, another option would be to sell the cars made there to markets in Latin America or elsewhere, the executive added, declining to be identified because of the sensitivity of the issue.</p><p class=\"\">The problem for Japanese automakers has not been lost on South Korean rival Hyundai , which does not have any plants in Mexico or Canada.</p><p class=\"\">Even if Trump introduced tariffs on all markets outside the U.S., the South Korean automaker doesn't expect to be hit as hard as Japanese rivals, Hyundai's CFO said during a recent conference call.</p><p class=\"\">The threat of tariffs also casts a shadow over Nissan's planned tie up with Honda.</p><p class=\"\">\"This complicates an already difficult-to-execute merger,\" said Christopher Richter, senior Japan autos analyst at brokerage CLSA.</p><p class=\"\">Nissan and Honda are due to announce more details about their proposed deal by the middle of this month. </p><p class=\"\">The two are aiming to tie up by 2026, in what would mark a historic pivot for Japan's auto industry and underline the threat Chinese EV makers now pose to legacy carmakers.</p><p class=\"\">The tie-up also comes as Nissan has been battered by slumping sales in the U.S. and China. In November, it announced a plan to cut 9,000 jobs and 20% of its global production capacity.</p><p class=\"\">Honda CEO Toshihiro Mibe has said that Nissan's turnaround was a prerequisite for the merger - and that Honda was not rescuing Nissan.</p><p class=\"\">Nissan's junior partner, Mitsubishi Motors , is considering not joining the merger, sources have said, marking another complicating factor for the plan.</p><p class=\"\">Given the disruption facing the auto industry globally, the tariffs couldn't come at a more inopportune time for most automakers.</p><p class=\"\">\"Mr. Trump doesn't seem to get that you can't change automotive production overnight,\" said CLSA's Richter.</p><p class=\"\">\"In the meantime, they're going to try and charge the consumer as much as they can to offset that and eat as little of the tariff as possible.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0HL:0-trump-tariffs-will-only-add-to-the-pain-for-hard-hit-nissan/",
            "pub_date": "2025-02-04 20:53:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV19T:0",
            "title": "Nokian Tyres shares slump as Q4 results, dividend disappoint",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">  ** Shares in Nokian Tyres  slide 15.8% after the Finnish tyre maker delivered Q4 results below consensus and cut dividend  </p><p class=\"\">   ** Its Q4 EBIT more than halved year-on-year to 15.4 million euros ($15.90 million) from a year ago, missing the 49.3 million euros expected by analysts in a Vara consensus</p><p class=\"\">   ** It posted Q4 sales rising 12.7% to 415.0 million euros, but below 418.6 million euros seen by analysts</p><p class=\"\">   ** The group reduced dividend proposal to 0.25 euro per share, while analyst expected a 0.53 euro payout</p><p class=\"\">       ** J.P.Morgan says the Q4 miss, greater-than-expected cash burn and dividend cut reinforce its \"underweight\" rating on the stock  </p><p class=\"\">       ** \"A closer examination reveals that the core passenger car business underperformed,\" the broker says  </p><p class=\"\">       ** Nokian Tyres said that net sales in the segment were soft in North America, adding that recent trade tariffs announcements are causing uncertainty </p><p class=\"\">   ** The stock is on track for its worst day since March 2022</p><p class=\"\">($1 = 0.9685 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV19T:0-nokian-tyres-shares-slump-as-q4-results-dividend-disappoint/",
            "pub_date": "2025-02-04 20:53:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308761:0",
            "title": "Evercore ISI Adjusts Price Target on Equity Residential to $74 From $76, Keeps In Line Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equity Residential  has an average rating of overweight and mean price target of $77.70, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308761:0/",
            "pub_date": "2025-02-04 20:53:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV15W:0",
            "title": "GoTo Does Not Have Any Material Corporate Action Plans For Next 12 Months",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GoTo Gojek Tokopedia PT Tbk :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DOES NOT HAVE ANY MATERIAL CORPORATE ACTION PLANS FOR NEXT 12 MONTHS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV15W:0-goto-does-not-have-any-material-corporate-action-plans-for-next-12-months/",
            "pub_date": "2025-02-04 20:54:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX13J3lG:0",
            "title": "250 by 2050: Cultivating more million-dollar companies in Saskatchewan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Regina, Saskatchewan, Feb.  04, 2025  (GLOBE NEWSWIRE) — Supporting 250 Saskatchewan companies with annual recurring revenues (ARR) of one million dollars by 2050. That is Cultivator powered by Conexus’ new ambitious target.  </p><p class=\"\">Since 2019, 15 companies in the business incubator’s programming have achieved this revenue milestone. Cultivator is now setting its sights on a “35 by 2030” and a “250 by 2050” target.  </p><p class=\"\">“We know that tech companies and the jobs they create are more likely to exist for the long haul once they reach this revenue target,” says Cultivator Director Laura Mock. “It’s a critical benchmark. One million in ARR also tends to be the magic number for when a company is ready for Series A investment.” </p><p class=\"\">“This new target fastens together Cultivator’s global agtech and Saskatchewan tech incubation portfolios into a singular focus: cultivating companies with million-dollar recurring revenues.”  </p><p class=\"\">The business incubator made the announcement at Cultivator Community Night on Saturday, Feb. 1, 2025. The celebration also featured a founder panel and an announcement of the 24-Hour Startup winners. 24-Hour Startup is a fast-paced event Cultivator hosts where teams formed just the day before build a minimum viable product in 24 hours.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The credit union connection</strong> </p><p class=\"\">Cultivator powered by Conexus prides itself on being the first credit-union led business incubator in Canada. </p><p class=\"\">“900 Conexus employees work tirelessly every day with a singular purpose – championing this province and its people,” explains Conexus CEO Celina Philpot. “Cultivator powered by Conexus’ audacious 250 by 2050 goal demonstrates an unwavering commitment to a thriving Saskatchewan.” </p><p class=\"\">“Your credit union is working alongside you to grow the economic vitality of our province.” </p><p class=\"\">For more information and to arrange interviews, please contact: </p><p class=\"\">Michael Chmielewski </p><p class=\"\">Media Relations Specialist | Conexus Credit Union </p><p class=\"\">media@conexus.ca | 306-751-8201 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cultivator </strong><strong class=\"root-Tkn6WL2y\">powered by Conexus</strong> </p><p class=\"\">Cultivator powered by Conexus is Canada’s first credit union led tech incubator, helping local startups start, grow, and scale their companies right here in Saskatchewan. We believe the prairies are home to some of the world’s most resilient founders. Since launching in 2019, Cultivator has incubated and provided resources, mentorship, and support to over 170 startups. Visit Cultivator.ca for more information. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Conexus Credit Union</strong> </p><p class=\"\">We’re a forward-thinking, Saskatchewan-based credit union committed to our members and their financial well-being. We’re a member-owned cooperative with more than 80 years of serving members and giving back to our community. Conexus’ purpose is to champion every member’s success for a thriving Saskatchewan. Visit Conexus.ca for more information.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Photo of Cultivator Director Laura Mock      </li></ul><p class=\"\">Michael Chmielewski</p><p class=\"\">Conexus Credit Union</p><p class=\"\">306-751-8201</p><p class=\"\">media@conexus.ca</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX13J3lG:0-250-by-2050-cultivating-more-million-dollar-companies-in-saskatchewan/",
            "pub_date": "2025-02-04 20:55:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308764:0",
            "title": "Bernstein Adjusts Price Target on Tyson Foods to $75 From $72, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tyson Foods  has an average rating of hold and mean price target of $64.55, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308764:0/",
            "pub_date": "2025-02-04 20:55:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308731:0",
            "title": "ATI's Q4 Adjusted Earnings, Sales Increase; Q1, 2025 Outlook Issued",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ATI  reported Q4 adjusted earnings Tuesday of $0.79 per diluted share, up from $0.64 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.61. </p><p class=\"\">Sales for the quarter ended Dec. 29 were $1.17 billion, compared with $1.06 billion a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.09 billion. </p><p class=\"\">The specialty materials company said it expects Q1 adjusted EPS of $0.55 to $0.61. Analysts polled by FactSet expect $0.59. </p><p class=\"\">ATI said it expects 2025 adjusted EPS of $2.80 to $3. Analysts polled by FactSet expect $2.92. </p><p class=\"\">ATI shares were up 5% in recent premarket activity Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308731:0/",
            "pub_date": "2025-02-04 20:55:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308745:0",
            "title": "Earnings Flash (IESC) IES Holdings Reports Fiscal Q1 Adjusted EPS $2.64",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308745:0/",
            "pub_date": "2025-02-04 20:46:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SEE8wxD3a:0",
            "title": "Serbia's debt-to-GDP ratio narrows to 47.4% at end-2024 - table",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BELGRADE (Serbia), February 4 (SeeNews) - Serbia's public debt-to-GDP ratio narrowed at the end of December 2024 to 47.4% of the gross domestic product (GDP) projected for the year, from 48% of GDP at the end of 2023, the finance ministry said on Tuesday.</p><p class=\"\">In absolute numbers, Serbia's public debt rose to 38.874 billion euro ($40.128 billion) at the end of 2024 from 36.153 billion euro at the end of the prior year, the finance ministry said in a data release.</p><p class=\"\">On a monthly comparison basis, however, the public debt-to-GDP ratio widened in December from 46.8% of GDP at the end of November, when Serbia's public debt volume stood at 38.393 billion euro.</p><p class=\"\">Following is the country's public debt structure, in billions of euro, as given by the finance ministry:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tr><td></td><td>end-Dec '24</td><td>end-Nov '24</td><td>end-Dec '23</td></tr><tr><td>TOTAL PUBLIC DEBT</td><td>38.874</td><td>38.393</td><td>36.153</td></tr><tr><td>Direct liabilities</td><td>37.043</td><td>36.574</td><td>34.337</td></tr><tr><td>- Internal debt</td><td>10.571</td><td>10.387</td><td>10.272</td></tr><tr><td>- External debt</td><td>26.471</td><td>26.187</td><td>24.065</td></tr><tr><td>Indirect liabilities</td><td>1.832</td><td>1.819</td><td>1.816</td></tr><tr><td>-Internal debt</td><td>0.461</td><td>0.479</td><td>0.519</td></tr><tr><td>-External debt</td><td>1.371</td><td>1.340</td><td>1.297</td></tr></table></div><p class=\"\">($ = 0.969 euro)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SEE8wxD3a:0-serbia-s-debt-to-gdp-ratio-narrows-to-47-4-at-end-2024-table/",
            "pub_date": "2025-02-04 20:46:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308730:0",
            "title": "Archer-Daniels-Midland's Q4 Adjusted Earnings, Revenue Fall; 2025 Non-GAAP EPS Guidance Issued",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Archer-Daniels-Midland  reported Q4 adjusted earnings Tuesday of $1.14 per diluted share, down from $1.36 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.14. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $21.50 billion, compared with $22.98 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $22.77 billion. </p><p class=\"\">The company said it expects 2025 adjusted earnings of $4 to $4.75 per share. </p><p class=\"\">Analysts surveyed by FactSet expect $4.71.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308730:0/",
            "pub_date": "2025-02-04 20:46:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV15T:0",
            "title": "Goldman Sachs rehires former Instacart CFO Nick Giovanni - NYT DealBook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        — Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV15T:0-goldman-sachs-rehires-former-instacart-cfo-nick-giovanni-nyt-dealbook/",
            "pub_date": "2025-02-04 20:48:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0ZG:0",
            "title": "Amcor misses Q2 sales estimates as weak consumer spending weighs on packaging demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Amcor PLC ,  missed Wall Street estimates for quarterly revenue on Tuesday on weak demand for its containers and cartons from consumer goods companies amid a challenging macroeconomic environment.</p><p class=\"\">Consumers have been pulling back on non-essential spending amid high inflation and low wage growth, forcing packaged goods companies to trim their inventories.</p><p class=\"\">Weak demand for packaging from the healthcare industry and the beverage business in North America hit overall volumes by more than 1%, the company said.</p><p class=\"\">The company, which supplies to consumer goods giants like PepsiCo  and Procter &amp; Gamble , reported a second-quarter revenue of $3.24 billion, missing the average of analysts' estimates of $3.35 billion, according to data compiled by LSEG.</p><p class=\"\">The weak sales come on the back of comments from peers Packaging Corp of America  and International Paper  who posted disappointing fourth-quarter results last week.</p><p class=\"\">Amcor's adjusted profit for the quarter was 16.1 cents per share, in line with market expectations.</p><p class=\"\">The company reaffirmed its 2025 adjusted earnings per share forecast of 72 to 76 cents per share. The impact of its $8.43-billion deal for Berry Global was not factored in the outlook, Amcor said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0ZG:0-amcor-misses-q2-sales-estimates-as-weak-consumer-spending-weighs-on-packaging-demand/",
            "pub_date": "2025-02-04 20:49:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308749:0",
            "title": "Wells Fargo Adjusts Clorox Price Target to $161 From $157, Maintains Equal Weight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clorox  has an average rating of Hold and mean price target of $163.78, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308749:0/",
            "pub_date": "2025-02-04 20:49:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463495:0",
            "title": "Tadawul Shares End in Green as Saudi Arabia's PMI Boosts Sentiment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Tadawul All Share Index closed Tuesday trading 0.46% in the green as Saudi's PMI figures hit their highest in over 10 years, boosting investor sentiment. </p><p class=\"\">At the close of trading, the exchange ended at 12,433.93 points, with 155 shares higher and 70 lower. The session was led by Kingdom Holding (SASE:4280) and Allied Cooperative Insurance Group (SASE:8150), closing at 8.89% and 7.25%, respectively. </p><p class=\"\">The Riyad Bank Purchasing Managers' Index climbed to 60.5 in January 2025 from 58.5 in the prior month, data from S&amp;P Global showed. Survey data from the non-oil sector highlighted the sharpest rise in new orders since June 2011. </p><p class=\"\">\"New orders were the primary driver of this expansion. Nearly 45% of firms observed higher sales volumes, attributing this growth to positive economic conditions and the acceleration of infrastructure projects. The rise in export orders further complemented domestic demand, particularly from GCC countries, reflecting effective marketing and competitive pricing strategies,\" Riyad Bank Chief Economist Naif Al-Ghaith commented. </p><p class=\"\">On the corporate front, Saudi Fisheries (SASE:6050) shares closed 1.40% higher as it signed a nonbinding memorandum of understanding with Arabian Agricultural Services Co., or Arasco. The 12-month agreement covers the development of a framework for a feed production partnership. </p><p class=\"\">Meanwhile, Saudi Arabian Mining (SASE:1211), d/b/a Ma'aden, shares closed 0.92% lower as it plans to offer US-dollar trust certificates for general corporate use. The mining company's issuance is subject to market conditions and regulatory approvals.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463495:0-tadawul-shares-end-in-green-as-saudi-arabia-s-pmi-boosts-sentiment/",
            "pub_date": "2025-02-04 20:49:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308754:0",
            "title": "BMO on The Day Ahead in Canada",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">After a wild 72 hours, United States President Donald Trump decided to hold off on tariffs against Canada and Mexico, at least for the next 30 days, even if its levies on Chinese imports move forward, for now, said Bank of Montreal (BMO). </p><p class=\"\">While a collective sigh of relief was heard throughout the North American economies, it still isn't all-clear, noted the bank. </p><p class=\"\">Given the ever-evolving trade environment, BMO will be revisiting its economic forecasts, but one thing is certain: uncertainty will weigh on markets, businesses, and consumers. </p><p class=\"\">News that potentially much higher prices/costs will be \"paused\" for 30 days sent a nervous sigh of relief throughout all countries involved. That relief is clearly showing up in the currency market early Tuesday, pointed out the bank. The US dollar (USD) index is at session lows, while Mexico's peso (MXN) rallied to $20.4 — it was at $21.3 at one point on Monday — while the Canadian dollar (CAD or loonie) is hovering around $1.44. </p><p class=\"\">Both currencies are still considerably weaker over the past six months as the MXN was under $20, while the CAD was at $1.35, added BMO.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308754:0/",
            "pub_date": "2025-02-04 20:49:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308750:0",
            "title": "Stephens Adjusts Price Target on Tyson Foods to $63 From $60, Maintains Equalweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tyson Foods  has an average rating of hold and mean price target of $64.55, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308750:0/",
            "pub_date": "2025-02-04 20:49:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308753:0",
            "title": "BNP Paribas Exane Adjusts Price Target on Equity Residential to $78 From $82, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equity Residential  has an average rating of overweight and mean price target of $77.70, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308753:0/",
            "pub_date": "2025-02-04 20:49:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308735:0",
            "title": "Hubbell Q4 Adjusted EPS Rises, Net Sales Decrease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hubbell  reported Q4 adjusted earnings Tuesday of $4.10 per diluted share, up from $3.69 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $4.02. </p><p class=\"\">Net sales for the quarter ended Dec. 31 were $1.33 billion, down from $1.35 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $1.41 billion. </p><p class=\"\">The company expects 2025 adjusted diluted EPS between $17.35 and $17.85. </p><p class=\"\">Analysts polled by FactSet expect $17.75. </p><p class=\"\">Hubbell shares fell 2% in premarket trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308735:0/",
            "pub_date": "2025-02-04 20:50:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308742:0",
            "title": "Madison Square Garden Sports' Fiscal Q2 Earnings Fall, Revenue Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Madison Square Garden Sports  reported fiscal Q2 earnings Tuesday of $0.05 per diluted share, down from $0.59 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.31. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $357.8 million, down from $326.9 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $351.5 million. </p><p class=\"\">Madison Square shares were down past 1% in recent premarket activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308742:0/",
            "pub_date": "2025-02-04 20:50:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV14X:0",
            "title": "Grain trader ADM misses estimates for Q4 profit, announces layoffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Grain merchant Archer-Daniels-Midland  on Tuesday missed Wall Street expectations for fourth-quarter profit and said it would lay off about 700 employees globally.</p><p class=\"\">Shares of the company were down 1.6% premarket following the results.</p><p class=\"\">Reuters had reported last week that the grain trader would soon start laying off employees in a global effort to cut costs, as low crop prices weighed on the company's profit.</p><p class=\"\">    Corn, soybean and wheat prices hit four-year lows in 2024 as global stocks ballooned to multi-year highs, whittling down margins for agribusinesses such as ADM that make money from storing, processing and trading around the world.  </p><p class=\"\">    The firm expects to deliver about $500 million to $750 million over the next five years through improvements in manufacturing costs, reduction in purchased materials and services.  </p><p class=\"\">    ADM forecast adjusted earnings to be in the range of $4 to $4.75 per share in 2025 due to weaker market fundamentals and ongoing biofuel and trade policy uncertainty.   </p><p class=\"\">    Analysts on average were expecting $4.67 per share.  </p><p class=\"\">    The company, however, increased its quarterly dividend to 51 cents per share from 50 cents earlier.  </p><p class=\"\">The Chicago-based company posted an adjusted profit of $1.14 per share for the three months ended Dec. 31, compared with analysts' average estimate of $1.15 per share, according to data compiled by LSEG.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV14X:0-grain-trader-adm-misses-estimates-for-q4-profit-announces-layoffs/",
            "pub_date": "2025-02-04 20:50:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308733:0",
            "title": "Wolfe Research Initiates Coverage on Zenas BioPharma With Outperform Rating, $19 Price Target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zenas BioPharma  has an average rating of Buy and mean price target of $33, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308733:0/",
            "pub_date": "2025-02-04 20:44:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308699:0",
            "title": "Top Premarket Decliners",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BriaCell Therapeutics  shares slumped 21% pre-Bell Tuesday a day after the company priced a $3.1 million public offering of common stock. </p><p class=\"\">SmartKem  shares fell 18% following a 5.9% loss in the previous session. </p><p class=\"\">eGain  shares were down 14% after Monday's 1.5% gain.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308699:0/",
            "pub_date": "2025-02-04 20:44:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b1e52866b4b83:0",
            "title": "Lancaster Colony Corporation Reports Second Quarter Sales and Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lancaster Colony Corporation, a manufacturer and marketer of specialty food products for the retail and foodservice channels, has released its financial results for the fiscal second quarter ended December 31, 2024. The company reported record sales and gross profit, despite facing some challenges related to legacy pension plans and acquisition costs.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the second quarter, Lancaster Colony reported consolidated net sales of $509.3 million, a 4.8% increase from $485.9 million in the same period last year. The company's consolidated gross profit rose by 9.3% to $132.8 million, setting a new second-quarter record. However, net income declined to $49.0 million, or $1.78 per diluted share, compared to $51.5 million, or $1.87 per diluted share, in the previous year. This decline was primarily due to a $14.0 million noncash settlement charge related to the termination of legacy pension plans and $1.6 million in incremental SG&amp;A expenditures for a planned acquisition.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The Retail segment saw a 6.3% increase in net sales to $280.8 million, driven by growth in both licensing programs and the company's own brands. Notable contributions came from Texas Roadhouse® dinner rolls, Buffalo Wild Wings® sauces, Subway® sauces, and Olive Garden® dressings. The Foodservice segment also experienced a 3.0% increase in net sales to $228.5 million, led by higher demand from national chain restaurant accounts and increased sales of branded Foodservice products.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">During the quarter, Lancaster Colony announced the planned acquisition of an Atlanta-based sauce and dressing production facility, which is expected to close in the fiscal third quarter ending March 31, 2025. This acquisition is anticipated to enhance the company's manufacturing network by improving operational efficiency, increasing capacity, and providing closer proximity to core customers.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">CEO David A. Ciesinski expressed satisfaction with the company's performance, highlighting record sales, gross profit, and operating income. He attributed the Retail segment's growth to the success of licensing programs and the company's own brands, while the Foodservice segment benefited from increased demand from national chain restaurant accounts. Ciesinski also emphasized the positive impact of ongoing cost savings initiatives and modest cost deflation on the company's gross profit margin.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to the fiscal third quarter, Lancaster Colony expects continued growth in the Retail segment from its expanding licensing program and investments in brand innovation. The Foodservice segment is also projected to see growth from select national chain restaurant accounts. The company is optimistic about the strategic benefits of the upcoming acquisition of the Atlanta-based production facility.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/57515/000005751525000004/lanc-20250204.htm\" rel=\"nofollow\" target=\"_blank\">LANCASTER COLONY CORP [ LANC ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:b1e52866b4b83:0-lancaster-colony-corporation-reports-second-quarter-sales-and-earnings/",
            "pub_date": "2025-02-04 20:45:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX23SZzm:0",
            "title": "IES Holdings Reports Fiscal 2025 First Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HOUSTON, Feb.  04, 2025  (GLOBE NEWSWIRE) — IES Holdings, Inc. (or “IES” or the “Company”)  today announced financial results for the quarter ended December 31, 2024.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">First</strong><strong class=\"root-Tkn6WL2y\"> Quarter </strong><strong class=\"root-Tkn6WL2y\">2025</strong><strong class=\"root-Tkn6WL2y\"> Highlights and Recent Developments</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $750 million for the first quarter of fiscal 2025, an increase of 18% compared with $634 million for the same quarter of fiscal 2024</li><li class=\"listItem-bmN0_SHH\">Operating income of $74.6 million for the first quarter of fiscal 2025, an increase of 29% compared with $58.0 million for the same quarter of fiscal 2024</li><li class=\"listItem-bmN0_SHH\">Net income attributable to IES of $56.3 million for the first quarter of fiscal 2025, an increase of 37% compared with $41.0 million for the same quarter of fiscal 2024, and diluted earnings per share attributable to common stockholders of $2.72 for the first quarter of fiscal 2025, compared with $1.87 for the same quarter of fiscal 2024</li><li class=\"listItem-bmN0_SHH\">Adjusted net income attributable to IES (a non-GAAP financial measure, as defined below) of $54.6 million for the first quarter of fiscal 2025, an increase of 33% compared with $40.9 million for the same quarter of fiscal 2024, and diluted adjusted earnings per share attributable to common stockholders of $2.64 for the first quarter of fiscal 2025, compared with $1.86 for the same quarter of fiscal 2024</li><li class=\"listItem-bmN0_SHH\">Remaining performance obligations, a GAAP measure of future revenue to be recognized from current contracts with customers, of approximately $1.2 billion as of December 31, 2024</li><li class=\"listItem-bmN0_SHH\">Backlog (a non-GAAP financial measure, as defined below) of approximately $1.8 billion as of December 31, 2024</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Overview of Results</strong>“Entering fiscal 2025, our teams have continued to execute well, driving an 18% increase in revenue and a 29% increase in operating income for the first quarter of fiscal 2025 compared with the same quarter of the prior year,\" said Jeff Gendell, Chairman and Chief Executive Officer. \"Our Communications, Infrastructure Solutions, and Commercial &amp; Industrial segments continued to benefit from strong demand, particularly in the data center market. While revenue in our Residential segment increased modestly over the first quarter of fiscal 2024 due to weather-related impacts on demand in Florida, we have begun to see normalization of activity in this key market. Operating margins across all businesses remained strong, reflecting robust customer demand, operating leverage from our increased scale and strong project execution. We continue to focus on growing our HVAC and plumbing business across our Residential segment's electrical markets as well as expanding the operations of our Infrastructure Solutions business.\"</p><p class=\"\">Our Communications segment’s revenue was $232.9 million in the first quarter of fiscal 2025, an increase of 36% compared with the first quarter of fiscal 2024. Increased demand across the business, particularly in the data center end market, drove growth, while demand in the high-tech manufacturing and distribution center end markets also remained solid. The segment's operating income increased to $28.6 million for the first quarter of fiscal 2025, compared with $21.4 million for the first quarter of fiscal 2024, as we benefited from increased volumes and strong project execution.</p><p class=\"\">Our Residential segment’s revenue was $320.0 million in the first quarter of fiscal 2025, an increase of 1% compared with the first quarter of fiscal 2024. Single-family demand was impacted by the recent hurricanes in Florida, as well as concerns over housing affordability and consumer expectations about future interest rate reductions. However, our business benefited from the expansion of our plumbing and HVAC service offerings, while successful execution of backlog contributed to revenue growth in our multi-family business. The Residential segment’s operating income decreased slightly to $23.8 million for the first quarter of fiscal 2025, compared with $24.1 million for the first quarter of fiscal 2024. An improvement in gross margin driven by strong project execution and reduced material costs was offset by increased general and administrative expense, as we continue to invest in processes and personnel to support the future growth of the business.</p><p class=\"\">Our Infrastructure Solutions segment’s revenue was $108.1 million in the first quarter of fiscal 2025, an increase of $45.2 million or 72% compared with the first quarter of fiscal 2024, driven by continued strong demand in our custom engineered solutions business, including generator enclosures, primarily for the data center end market. Greiner Industries, which we acquired on April 1, 2024, contributed $12.2 million of the increase. Operating income for the first quarter of fiscal 2025 was $23.3 million, compared with $10.9 million for the first quarter of fiscal 2024. The year-over-year profit improvement was driven primarily by a combination of higher volumes, improved pricing and operating efficiencies at our facilities as well as the impact of investments we have made over the last several years to increase capacity.</p><p class=\"\">Our Commercial &amp; Industrial segment’s revenue was $88.5 million in the first quarter of fiscal 2025, an increase of 4% compared with $85.0 million in the first quarter of fiscal 2024, while segment operating income for the first quarter of fiscal 2025 was $7.1 million, compared with $7.0 million for the first quarter of fiscal 2024. These results reflect solid demand and strong execution across the segment.</p><p class=\"\">Matt Simmes, President and Chief Operating Officer, commented, “During the first quarter of fiscal 2025, we continued to benefit from the ongoing investments we have made in our business, while maintaining strong operating margins across all operating segments. Although the hurricanes that affected Florida in September and October 2024 did not have a significant impact on our overall Residential business in the quarter, Florida housing starts were negatively impacted by the storms. Demand in the Florida market has begun to show signs of recovering in the second fiscal quarter, and we anticipate continued improvement through the remainder of fiscal 2025. Although housing affordability and interest rate issues have resulted in some pockets of reduced demand in certain of our Residential segment's single-family markets, we have focused on maintaining margins and continuing to invest in the scalability of our platform, including a new ERP system, as we believe the longer-term outlook for single-family housing to be strong. Subsequent to the end of the quarter, our Infrastructure Solutions business completed the acquisition of Arrow Engine Company, a Tulsa, Oklahoma based provider of engines, generator sets, compressors and replacement parts primarily for the natural gas production market. This business provides us with the opportunity to continue to expand our product offerings and customer base.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Capital Allocation; Stock Buyback Plan</strong>“We remain focused on capital allocation, seeking to generate strong returns on our operating cash flow,\" added Tracy McLauchlin, Chief Financial Officer. \"The continued strength of our cash flow allowed us to put capital to work while ending the quarter with $59.1 million of cash and $53.0 million of marketable securities.\"</p><p class=\"\">Capital allocation highlights include the following:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">We supported the growth of our operating business with $13.2 million in capital expenditures during the first quarter of fiscal 2025</li><li class=\"listItem-bmN0_SHH\">Subsequent to quarter end, we enhanced our financial flexibility by increasing our revolving credit facility from $150 million to $300 million, extending its maturity to 2030 and transitioning away from the previous asset-based structure</li><li class=\"listItem-bmN0_SHH\">In December 2024, we invested $44.9 million to acquire a minority interest in the CB&amp;I storage solutions business, a designer and builder of storage facilities, tanks and terminals for energy and industrial markets</li><li class=\"listItem-bmN0_SHH\">Subsequent to quarter end, we acquired Arrow Engine Company</li><li class=\"listItem-bmN0_SHH\">During the first quarter of fiscal 2025, we repurchased 21,048 shares of our common stock for $4.4 million, ending the quarter with $193.7 million remaining under our stock repurchase authorization</li><li class=\"listItem-bmN0_SHH\">We used $16.1 million of our excess cash to purchase marketable securities during the first quarter of fiscal 2025</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Non-GAAP Financial Measures and Other Adjustments</strong>This press release includes adjusted net income attributable to IES, adjusted diluted earnings per share attributable to common stockholders, and backlog, and, in the non-GAAP reconciliation tables included herein, adjusted net income attributable to common stockholders, adjusted EBITDA and adjusted net income before taxes, each of which is a financial measure not calculated in accordance with generally accepted accounting principles in the U.S. (“GAAP”). Management believes that these measures provide useful information to our investors by, in the case of adjusted net income attributable to common stockholders, adjusted earnings per share attributable to common stockholders, adjusted EBITDA and adjusted net income before taxes, distinguishing certain nonrecurring events such as litigation settlements, significant expenses associated with leadership changes, or gains or losses from the sale of a business, or noncash events, such as impairment charges or unrealized gains and losses on our investments, or, in the case of backlog, providing a common measurement used in IES's industry, as described further below, and that these measures, when reconciled to the most directly comparable GAAP measures, help our investors to better identify underlying trends in the operations of our business and facilitate easier comparisons of our financial performance with prior and future periods and to our peers. Non-GAAP financial measures should not be considered in isolation from, or as a substitute for, financial information calculated in accordance with GAAP. Investors are encouraged to review the reconciliation of these non-GAAP measures to their most directly comparable GAAP financial measures, which has been provided in the financial tables included in this press release.</p><p class=\"\">Remaining performance obligations represent the unrecognized revenue value of our contract commitments. While backlog is not a defined term under GAAP, it is a common measurement used in IES’s industry and IES believes this non-GAAP measure enables it to more effectively forecast its future results and better identify future operating trends that may not otherwise be apparent. IES’s remaining performance obligations are a component of IES’s backlog calculation, which also includes signed agreements and letters of intent which we do not have a legal right to enforce prior to work starting. These arrangements are excluded from remaining performance obligations until work begins. IES’s methodology for determining backlog may not be comparable to the methodologies used by other companies.</p><p class=\"\">For further details on the Company’s financial results, please refer to the Company’s quarterly report on Form 10-Q for the fiscal quarter ended December 31, 2024, to be filed with the Securities and Exchange Commission (\"SEC\") by February 4, 2025, and any amendments thereto.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IES Holdings, Inc.</strong>IES designs and installs integrated electrical and technology systems and provides infrastructure products and services to a variety of end markets, including data centers, residential housing, and commercial and industrial facilities. Our more than 9,000 employees serve clients in the United States. For more information about IES, please visit www.ies-co.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Company Contact:</strong></p><p class=\"\">Tracy McLauchlin</p><p class=\"\">Chief Financial Officer</p><p class=\"\">IES Holdings, Inc.</p><p class=\"\">(713) 860-1500</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Robert Winters or Stephen Poe</p><p class=\"\">Alpha IR Group</p><p class=\"\">312-445-2870</p><p class=\"\">IESC@alpha-ir.com</p><p class=\"\">Certain statements in this release may be deemed “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, all of which are based upon various estimates and assumptions that the Company believes to be reasonable as of the date hereof. In some cases, you can identify forward-looking statements by terminology such as “may,” “will,” “could,” “should,” “expect,” “plan,” “project,” “intend,” “anticipate,” “believe,” “seek,” “estimate,” “predict,” “potential,” “pursue,” “target,” “continue,” the negative of such terms or other comparable terminology. These statements involve risks and uncertainties that could cause the Company’s actual future outcomes to differ materially from those set forth in such statements. Such risks and uncertainties include, but are not limited to, a general reduction in the demand for our products or services; changes in general economic conditions, including supply chain constraints, high rates of inflation, changes in consumer sentiment, elevated interest rates, and market disruptions resulting from a number of factors, including geo-political events; competition in the industries in which we operate, which could result in the loss of one or more customers or lead to lower margins on new projects; our ability to successfully manage and execute projects, the cost and availability of qualified labor and the ability to maintain positive labor relations, and our ability to pass along increases in the cost of commodities used in our business; supply chain disruptions due to our suppliers' access to materials and labor, their ability to ship products timely, or credit or liquidity problems they may face; inaccurate estimates used when entering into fixed-price contracts, the possibility of errors when estimating revenue and progress to date on percentage-of-completion contracts, and complications associated with the incorporation of new accounting, control and operating procedures; our ability to enter into, and the terms of, future contracts; the existence of a small number of customers from whom we derive a meaningful portion of our revenues; reliance on third parties, including subcontractors and suppliers, to complete our projects; the inability to carry out plans and strategies as expected, including the inability to identify and complete acquisitions that meet our investment criteria, or the subsequent underperformance of those acquisitions; challenges integrating new businesses into the Company or new types of work, products or processes into our segments; backlog that may not be realized or may not result in profits; failure to adequately recover on contract change orders or claims against customers; closures or sales of our facilities resulting in significant future charges or a significant disruption of our operations; the impact of future epidemics or pandemics on our business; an increased cost of surety bonds affecting margins on work and the potential for our surety providers to refuse bonding or require additional collateral at their discretion; the impact of seasonality, adverse weather conditions, and climate change; fluctuations in operating activity due to factors such as cyclicality, downturns in levels of construction or the housing market, and differing regional economic conditions; difficulties in managing our billings and collections; accidents resulting from the physical hazards associated with our work and the potential for accidents; the possibility that our current insurance coverage may not be adequate or that we may not be able to obtain policies at acceptable rates; the effect of litigation, claims and contingencies, including warranty losses, damages or other latent defect claims in excess of our existing reserves and accruals; costs and liabilities under existing or potential future laws and regulations, including those laws and regulations related to the environment and climate change, as well as the inability to transfer, renew and obtain electrical and other professional licenses; interruptions to our information systems and cyber security or data breaches; expenditures to conduct environmental remediation activities required by certain environmental laws and regulations; loss of key personnel, ineffective transition of new management, or general labor constraints; credit and capital market conditions, including changes in interest rates that affect the cost of construction financing and mortgages, and the inability of some of our customers to obtain sufficient financing at acceptable rates, which could lead to project delays or cancellations; limitations on our ability to access capital markets and generate cash from operations to fund our capital needs; the impact on our effective tax rate or cash paid for taxes from changes in tax positions we have taken or changes in tax laws; difficulty in fulfilling the covenant terms of our revolving credit facility, which could result in a default and acceleration of any indebtedness under such revolving credit facility; reliance on certain estimates and assumptions that may differ from actual results in the preparation of our financial statements; uncertainties inherent in the use of percentage-of-completion accounting, which could result in the reduction or elimination of previously recorded revenues and profits; the recognition of potential goodwill, long-lived assets and other investment impairments; the existence of a controlling shareholder, who has the ability to take action not aligned with other shareholders or to dispose of all or a significant portion of the shares of our common stock it holds, which may trigger certain change of control provisions in a number of our material agreements; the relatively low trading volume of our common stock, which could increase the volatility of our stock price and could make it more difficult for shareholders to sell a substantial number of shares for the same price at which shareholders could sell a smaller number of shares; the possibility that we issue additional shares of common stock, preferred stock or convertible securities that will dilute the percentage ownership interest of existing stockholders and may dilute the value per share of our common stock; the potential for substantial sales of our common stock, which could adversely affect our stock price; the impact of increasing scrutiny and changing expectations from investors and customers, or new or changing regulations, with respect to environmental, social and governance practices; the cost or effort required for our shareholders to bring certain claims or actions against us, as a result of our designation of the Court of Chancery of the State of Delaware as the sole and exclusive forum for certain types of actions and proceedings; and the possibility that our internal controls over financial reporting and our disclosure controls and procedures may not prevent all possible errors that could occur, as well as other risk factors discussed in this document, in the Company’s annual report on Form 10-K for the year ended September 30, 2024 and in the Company’s other reports on file with the SEC. You should understand that such risk factors could cause future outcomes to differ materially from those experienced previously or those expressed in such forward-looking statements. The Company undertakes no obligation to publicly update or revise any information or any forward-looking statements to reflect events or circumstances that may arise after the date of this release.</p><p class=\"\">Forward-looking statements are provided in this press release pursuant to the safe harbor established under the Private Securities Litigation Reform Act of 1995 and should be evaluated in the context of the estimates, assumptions, uncertainties, and risks described herein.</p><p class=\"\">General information about IES Holdings, Inc. can be found at http://www.ies-co.com under \"Investor Relations.\" The Company's annual report on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, as well as any amendments to those reports, are available free of charge through the Company's website as soon as reasonably practicable after they are filed with, or furnished to, the SEC.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"9\"> </td></tr><tr><td colspan=\"9\">IES HOLDINGS, INC. AND SUBSIDIARIESCONDENSED CONSOLIDATED STATEMENT OF OPERATIONS(DOLLARS IN MILLIONS, EXCEPT PER SHARE DATA)(UNAUDITED)</td></tr><tr><td colspan=\"9\"> </td></tr><tr><td> </td><td> </td><td colspan=\"7\">Three Months Ended</td></tr><tr><td> </td><td> </td><td colspan=\"7\">December 31,</td></tr><tr><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td colspan=\"2\">Revenues</td><td>$</td><td>749.5</td><td> </td><td> </td><td>$</td><td>634.4</td><td> </td></tr><tr><td colspan=\"2\">Cost of services</td><td> </td><td>571.5</td><td> </td><td> </td><td> </td><td>490.6</td><td> </td></tr><tr><td> </td><td>Gross profit</td><td> </td><td>178.0</td><td> </td><td> </td><td> </td><td>143.8</td><td> </td></tr><tr><td colspan=\"2\">Selling, general and administrative expenses</td><td> </td><td>103.0</td><td> </td><td> </td><td> </td><td>85.9</td><td> </td></tr><tr><td colspan=\"2\">Contingent consideration</td><td> </td><td>0.4</td><td> </td><td> </td><td> </td><td>—</td><td> </td></tr><tr><td colspan=\"2\">Gain on sale of assets</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>(0.1</td><td>)</td></tr><tr><td> </td><td>Operating income</td><td> </td><td>74.6</td><td> </td><td> </td><td> </td><td>58.0</td><td> </td></tr><tr><td colspan=\"2\">Interest expense</td><td> </td><td>0.5</td><td> </td><td> </td><td> </td><td>0.4</td><td> </td></tr><tr><td colspan=\"2\">Other income</td><td> </td><td>(3.6</td><td>)</td><td> </td><td> </td><td>(1.4</td><td>)</td></tr><tr><td> </td><td>Income from operations before income taxes</td><td> </td><td>77.7</td><td> </td><td> </td><td> </td><td>59.0</td><td> </td></tr><tr><td colspan=\"2\">Provision for income taxes</td><td> </td><td>20.0</td><td> </td><td> </td><td> </td><td>15.4</td><td> </td></tr><tr><td> </td><td>Net income</td><td> </td><td>57.7</td><td> </td><td> </td><td> </td><td>43.6</td><td> </td></tr><tr><td colspan=\"2\">Net income attributable to noncontrolling interest</td><td> </td><td>(1.4</td><td>)</td><td> </td><td> </td><td>(2.6</td><td>)</td></tr><tr><td> </td><td>Net income attributable to IES Holdings, Inc.</td><td>$</td><td>56.3</td><td> </td><td> </td><td>$</td><td>41.0</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"2\">Computation of earnings per share:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"2\">Net income attributable to IES Holdings, Inc.</td><td>$</td><td>56.3</td><td> </td><td> </td><td>$</td><td>41.0</td><td> </td></tr><tr><td colspan=\"2\">Increase in noncontrolling interest</td><td> </td><td>(1.1</td><td>)</td><td> </td><td> </td><td>(2.8</td><td>)</td></tr><tr><td colspan=\"2\">Net income attributable to common stockholders of IES Holdings, Inc.</td><td>$</td><td>55.2</td><td> </td><td> </td><td>$</td><td>38.2</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"2\">Earnings per share attributable to common stockholders:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Basic</td><td>$</td><td>2.76</td><td> </td><td> </td><td>$</td><td>1.89</td><td> </td></tr><tr><td> </td><td>Diluted</td><td>$</td><td>2.72</td><td> </td><td> </td><td>$</td><td>1.87</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"2\">Shares used in the computation of earnings per share:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Basic (in thousands)</td><td> </td><td>19,990</td><td> </td><td> </td><td> </td><td>20,200</td><td> </td></tr><tr><td> </td><td>Diluted (in thousands)</td><td> </td><td>20,246</td><td> </td><td> </td><td> </td><td>20,435</td><td> </td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"9\"> </td></tr><tr><td colspan=\"9\">IES HOLDINGS, INC. AND SUBSIDIARIESNON-GAAP RECONCILIATION OF ADJUSTED NET INCOME ATTRIBUTABLETO IES HOLDINGS, INC. AND ADJUSTED EARNINGS PER SHAREATTRIBUTABLE TO COMMON STOCKHOLDERS(DOLLARS IN MILLIONS, EXCEPT PER SHARE DATA)(UNAUDITED)</td></tr><tr><td colspan=\"9\"> </td></tr><tr><td> </td><td> </td><td colspan=\"7\">Three Months Ended</td></tr><tr><td> </td><td> </td><td colspan=\"7\">December 31,</td></tr><tr><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td colspan=\"2\">Net income attributable to IES Holdings, Inc.</td><td>$</td><td>56.3</td><td> </td><td> </td><td>$</td><td>41.0</td><td> </td></tr><tr><td colspan=\"2\">Unrealized gain on trading securities (1)</td><td> </td><td>(2.3</td><td>)</td><td> </td><td> </td><td>(0.1</td><td>)</td></tr><tr><td colspan=\"2\">Provision for income taxes</td><td> </td><td>20.0</td><td> </td><td> </td><td> </td><td>15.4</td><td> </td></tr><tr><td> </td><td>Adjusted income from operations before income taxes</td><td> </td><td>74.0</td><td> </td><td> </td><td> </td><td>56.3</td><td> </td></tr><tr><td colspan=\"2\">Adjusted tax expense (2)</td><td> </td><td>(19.4</td><td>)</td><td> </td><td> </td><td>(15.4</td><td>)</td></tr><tr><td> </td><td>Adjusted net income attributable to IES Holdings, Inc.</td><td> </td><td>54.6</td><td> </td><td> </td><td> </td><td>40.9</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Adjustments for computation of earnings per share:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Increase in noncontrolling interest</td><td> </td><td>(1.1</td><td>)</td><td> </td><td> </td><td>(2.8</td><td>)</td></tr><tr><td> </td><td>Adjusted net income attributable to common stockholders</td><td>$</td><td>53.5</td><td> </td><td> </td><td>$</td><td>38.1</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"2\">Adjusted earnings per share attributable to common stockholders:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Basic</td><td>$</td><td>2.67</td><td> </td><td> </td><td>$</td><td>1.88</td><td> </td></tr><tr><td> </td><td>Diluted</td><td>$</td><td>2.64</td><td> </td><td> </td><td>$</td><td>1.86</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"2\">Shares used in the computation of earnings per share:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Basic (in thousands)</td><td> </td><td>19,990</td><td> </td><td> </td><td> </td><td>20,200</td><td> </td></tr><tr><td> </td><td>Diluted (in thousands)</td><td> </td><td>20,246</td><td> </td><td> </td><td> </td><td>20,435</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"9\">(1) Included in Other income on our Condensed Consolidated Statement of Operations(2) Adjusted for the tax impact of adjustments to pretax income above</td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"11\"> </td></tr><tr><td colspan=\"11\">IES HOLDINGS, INC. AND SUBSIDIARIESCONDENSED CONSOLIDATED BALANCE SHEETS(DOLLARS IN MILLIONS)(UNAUDITED)</td></tr><tr><td colspan=\"11\"> </td></tr><tr><td> </td><td> </td><td> </td><td> </td><td colspan=\"3\">December 31,</td><td> </td><td colspan=\"3\">September 30,</td></tr><tr><td> </td><td> </td><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2024</td><td> </td></tr><tr><td colspan=\"4\">ASSETS</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"3\">CURRENT ASSETS:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Cash and cash equivalents</td><td>$</td><td>59.1</td><td> </td><td> </td><td>$</td><td>100.8</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Marketable securities</td><td> </td><td>53.0</td><td> </td><td> </td><td> </td><td>35.0</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Accounts receivable:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td> </td><td> </td><td>Trade, net of allowance</td><td> </td><td>459.0</td><td> </td><td> </td><td> </td><td>469.8</td><td> </td></tr><tr><td> </td><td> </td><td> </td><td>Retainage</td><td> </td><td>89.1</td><td> </td><td> </td><td> </td><td>89.8</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Inventories</td><td> </td><td>104.3</td><td> </td><td> </td><td> </td><td>101.7</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Costs and estimated earnings in excess of billings</td><td> </td><td>59.6</td><td> </td><td> </td><td> </td><td>60.2</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Prepaid expenses and other current assets</td><td> </td><td>19.8</td><td> </td><td> </td><td> </td><td>14.4</td><td> </td></tr><tr><td> </td><td colspan=\"3\">Total current assets</td><td> </td><td>843.9</td><td> </td><td> </td><td> </td><td>871.7</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Property and equipment, net</td><td> </td><td>138.3</td><td> </td><td> </td><td> </td><td>134.2</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Goodwill</td><td> </td><td>93.9</td><td> </td><td> </td><td> </td><td>93.9</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Intangible assets, net</td><td> </td><td>42.4</td><td> </td><td> </td><td> </td><td>45.9</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Investments</td><td> </td><td>44.9</td><td> </td><td> </td><td> </td><td>—</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Deferred tax assets</td><td> </td><td>23.1</td><td> </td><td> </td><td> </td><td>22.4</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Operating right of use assets</td><td> </td><td>63.6</td><td> </td><td> </td><td> </td><td>62.0</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Other non-current assets</td><td> </td><td>14.9</td><td> </td><td> </td><td> </td><td>13.9</td><td> </td></tr><tr><td colspan=\"4\">Total assets</td><td>$</td><td>1,265.0</td><td> </td><td> </td><td>$</td><td>1,244.0</td><td> </td></tr><tr><td colspan=\"4\">LIABILITIES AND STOCKHOLDERS’ EQUITY</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"3\">CURRENT LIABILITIES:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Accounts payable and accrued expenses</td><td>$</td><td>332.6</td><td> </td><td> </td><td>$</td><td>363.6</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Billings in excess of costs and estimated earnings</td><td> </td><td>170.4</td><td> </td><td> </td><td> </td><td>159.0</td><td> </td></tr><tr><td> </td><td colspan=\"3\">Total current liabilities</td><td> </td><td>503.0</td><td> </td><td> </td><td> </td><td>522.6</td><td> </td></tr><tr><td> </td><td colspan=\"3\">Long-term debt</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>—</td><td> </td></tr><tr><td> </td><td colspan=\"3\">Operating long-term lease liabilities</td><td> </td><td>41.1</td><td> </td><td> </td><td> </td><td>40.4</td><td> </td></tr><tr><td> </td><td colspan=\"3\">Other tax liabilities</td><td> </td><td>17.1</td><td> </td><td> </td><td> </td><td>16.7</td><td> </td></tr><tr><td> </td><td colspan=\"3\">Other non-current liabilities</td><td> </td><td>11.5</td><td> </td><td> </td><td> </td><td>12.2</td><td> </td></tr><tr><td colspan=\"4\">Total liabilities</td><td> </td><td>572.7</td><td> </td><td> </td><td> </td><td>591.9</td><td> </td></tr><tr><td colspan=\"4\">Noncontrolling interest</td><td> </td><td>39.9</td><td> </td><td> </td><td> </td><td>41.0</td><td> </td></tr><tr><td> </td><td colspan=\"3\">STOCKHOLDERS’ EQUITY:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Preferred stock</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>—</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Common stock</td><td> </td><td>0.2</td><td> </td><td> </td><td> </td><td>0.2</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Treasury stock, at cost</td><td> </td><td>(101.8</td><td>)</td><td> </td><td> </td><td>(90.3</td><td>)</td></tr><tr><td> </td><td> </td><td colspan=\"2\">Additional paid-in capital</td><td> </td><td>201.1</td><td> </td><td> </td><td> </td><td>203.4</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"2\">Retained earnings</td><td> </td><td>552.9</td><td> </td><td> </td><td> </td><td>497.8</td><td> </td></tr><tr><td colspan=\"4\">Total stockholders’ equity</td><td> </td><td>652.4</td><td> </td><td> </td><td> </td><td>611.1</td><td> </td></tr><tr><td colspan=\"4\">Total liabilities and stockholders’ equity</td><td>$</td><td>1,265.0</td><td> </td><td> </td><td>$</td><td>1,244.0</td><td> </td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"10\"> </td></tr><tr><td colspan=\"10\">IES HOLDINGS, INC. AND SUBSIDIARIESCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS(DOLLARS IN MILLIONS)(UNAUDITED)</td></tr><tr><td colspan=\"10\"> </td></tr><tr><td> </td><td colspan=\"2\"> </td><td colspan=\"7\">Three Months Ended</td></tr><tr><td> </td><td> </td><td> </td><td colspan=\"7\">December 31,</td></tr><tr><td> </td><td colspan=\"2\"> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td colspan=\"3\">CASH FLOWS FROM OPERATING ACTIVITIES:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"2\">Net income</td><td>$</td><td>57.7</td><td> </td><td> </td><td>$</td><td>43.6</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Adjustments to reconcile net income to net cash provided by operating activities:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"2\">Bad debt expense</td><td> </td><td>0.2</td><td> </td><td> </td><td> </td><td>0.2</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Deferred financing cost amortization</td><td> </td><td>0.1</td><td> </td><td> </td><td> </td><td>0.1</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Depreciation and amortization</td><td> </td><td>11.1</td><td> </td><td> </td><td> </td><td>7.6</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Gain on sale of assets</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>(0.1</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Non-cash compensation expense</td><td> </td><td>2.0</td><td> </td><td> </td><td> </td><td>1.4</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Deferred income tax expense (benefit) and other non-cash tax adjustments, net</td><td> </td><td>0.2</td><td> </td><td> </td><td> </td><td>1.0</td><td> </td></tr><tr><td> </td><td>Unrealized gain on trading securities</td><td> </td><td> </td><td>(2.3</td><td>)</td><td> </td><td> </td><td>(0.1</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Changes in operating assets and liabilities:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"2\">Marketable securities</td><td> </td><td>(15.7</td><td>)</td><td> </td><td> </td><td>—</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Accounts receivable</td><td> </td><td>10.6</td><td> </td><td> </td><td> </td><td>(24.9</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Inventories</td><td> </td><td>(2.6</td><td>)</td><td> </td><td> </td><td>(18.1</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Costs and estimated earnings in excess of billings</td><td> </td><td>0.5</td><td> </td><td> </td><td> </td><td>8.0</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Prepaid expenses and other current assets</td><td> </td><td>(4.8</td><td>)</td><td> </td><td> </td><td>(9.8</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Other non-current assets</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>(4.4</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Accounts payable and accrued expenses</td><td> </td><td>(31.5</td><td>)</td><td> </td><td> </td><td>(2.6</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Billings in excess of costs and estimated earnings</td><td> </td><td>11.4</td><td> </td><td> </td><td> </td><td>23.2</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Other non-current liabilities</td><td> </td><td>0.3</td><td> </td><td> </td><td> </td><td>(0.1</td><td>)</td></tr><tr><td colspan=\"3\">Net cash provided by operating activities</td><td> </td><td>37.3</td><td> </td><td> </td><td> </td><td>25.0</td><td> </td></tr><tr><td colspan=\"3\">CASH FLOWS FROM INVESTING ACTIVITIES:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"2\">Purchases of property and equipment</td><td> </td><td>(13.2</td><td>)</td><td> </td><td> </td><td>(6.5</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Proceeds from sale of assets</td><td> </td><td>0.2</td><td> </td><td> </td><td> </td><td>0.6</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Purchases of equity investments</td><td> </td><td>(44.9</td><td>)</td><td> </td><td> </td><td>(0.1</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Cash paid in conjunction with business combinations, net of cash acquired</td><td> </td><td>(0.5</td><td>)</td><td> </td><td> </td><td>—</td><td> </td></tr><tr><td colspan=\"3\">Net cash used in investing activities</td><td> </td><td>(58.4</td><td>)</td><td> </td><td> </td><td>(6.0</td><td>)</td></tr><tr><td colspan=\"3\">CASH FLOWS FROM FINANCING ACTIVITIES:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"2\">Borrowings of debt</td><td> </td><td>781.2</td><td> </td><td> </td><td> </td><td>654.0</td><td> </td></tr><tr><td> </td><td colspan=\"2\">Repayments of debt</td><td> </td><td>(781.2</td><td>)</td><td> </td><td> </td><td>(654.0</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Cash paid for finance leases</td><td> </td><td>(0.9</td><td>)</td><td> </td><td> </td><td>(1.0</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Settlement of contingent consideration liability</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>(4.1</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Distribution to noncontrolling interest</td><td> </td><td>(4.0</td><td>)</td><td> </td><td> </td><td>(1.3</td><td>)</td></tr><tr><td> </td><td colspan=\"2\">Purchase of treasury stock</td><td> </td><td>(15.7</td><td>)</td><td> </td><td> </td><td>(0.9</td><td>)</td></tr><tr><td colspan=\"3\">Net cash used in financing activities</td><td> </td><td>(20.6</td><td>)</td><td> </td><td> </td><td>(7.3</td><td>)</td></tr><tr><td colspan=\"3\">NET INCREASE IN CASH AND CASH EQUIVALENTS</td><td> </td><td>(41.7</td><td>)</td><td> </td><td> </td><td>11.7</td><td> </td></tr><tr><td colspan=\"3\">CASH and CASH EQUIVALENTS, beginning of period</td><td> </td><td>100.8</td><td> </td><td> </td><td> </td><td>75.8</td><td> </td></tr><tr><td colspan=\"3\">CASH and CASH EQUIVALENTS, end of period</td><td>$</td><td>59.1</td><td> </td><td> </td><td>$</td><td>87.5</td><td> </td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"9\"> </td></tr><tr><td colspan=\"9\">IES HOLDINGS, INC. AND SUBSIDIARIESOPERATING SEGMENT STATEMENT OF OPERATIONS(DOLLARS IN MILLIONS)(UNAUDITED)</td></tr><tr><td colspan=\"9\"> </td></tr><tr><td> </td><td> </td><td colspan=\"7\">Three Months Ended</td></tr><tr><td> </td><td> </td><td colspan=\"7\">December 31,</td></tr><tr><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td colspan=\"2\">Revenues</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Communications</td><td>$</td><td>232.9</td><td> </td><td> </td><td>$</td><td>170.7</td><td> </td></tr><tr><td> </td><td>Residential</td><td> </td><td>320.0</td><td> </td><td> </td><td> </td><td>315.9</td><td> </td></tr><tr><td> </td><td>Infrastructure Solutions</td><td> </td><td>108.1</td><td> </td><td> </td><td> </td><td>62.9</td><td> </td></tr><tr><td> </td><td>Commercial &amp; Industrial</td><td> </td><td>88.5</td><td> </td><td> </td><td> </td><td>85.0</td><td> </td></tr><tr><td colspan=\"2\">Total revenue</td><td>$</td><td>749.5</td><td> </td><td> </td><td>$</td><td>634.4</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"2\">Operating income (loss)</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td>Communications</td><td>$</td><td>28.6</td><td> </td><td> </td><td>$</td><td>21.4</td><td> </td></tr><tr><td> </td><td>Residential</td><td> </td><td>23.8</td><td> </td><td> </td><td> </td><td>24.1</td><td> </td></tr><tr><td> </td><td>Infrastructure Solutions</td><td> </td><td>23.3</td><td> </td><td> </td><td> </td><td>10.9</td><td> </td></tr><tr><td> </td><td>Commercial &amp; Industrial</td><td> </td><td>7.1</td><td> </td><td> </td><td> </td><td>7.0</td><td> </td></tr><tr><td> </td><td>Corporate</td><td> </td><td>(8.2</td><td>)</td><td> </td><td> </td><td>(5.4</td><td>)</td></tr><tr><td colspan=\"2\">Total operating income</td><td>$</td><td>74.6</td><td> </td><td> </td><td>$</td><td>58.0</td><td> </td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"9\"> </td></tr><tr><td colspan=\"9\">IES HOLDINGS, INC. AND SUBSIDIARIESNON-GAAP RECONCILIATION OF ADJUSTED EBITDA(DOLLARS IN MILLIONS)(UNAUDITED)</td></tr><tr><td colspan=\"9\"> </td></tr><tr><td colspan=\"2\"> </td><td colspan=\"7\">Three Months Ended</td></tr><tr><td> </td><td> </td><td colspan=\"7\">December 31,</td></tr><tr><td colspan=\"2\"> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td colspan=\"2\">Net income attributable to IES Holdings, Inc.</td><td>$</td><td>56.3</td><td> </td><td> </td><td>$</td><td>41.0</td><td> </td></tr><tr><td colspan=\"2\">Provision for income taxes</td><td> </td><td>20.0</td><td> </td><td> </td><td> </td><td>15.4</td><td> </td></tr><tr><td colspan=\"2\">Interest &amp; other income, net</td><td> </td><td>(3.1</td><td>)</td><td> </td><td> </td><td>(1.0</td><td>)</td></tr><tr><td colspan=\"2\">Depreciation and amortization</td><td> </td><td>11.1</td><td> </td><td> </td><td> </td><td>7.6</td><td> </td></tr><tr><td colspan=\"2\">EBITDA</td><td>$</td><td>84.3</td><td> </td><td> </td><td>$</td><td>63.0</td><td> </td></tr><tr><td colspan=\"2\">Non-cash equity compensation expense</td><td> </td><td>2.0</td><td> </td><td> </td><td> </td><td>1.4</td><td> </td></tr><tr><td colspan=\"2\">Adjusted EBITDA</td><td>$</td><td>86.3</td><td> </td><td> </td><td>$</td><td>64.4</td><td> </td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"13\"> </td></tr><tr><td colspan=\"13\">IES HOLDINGS, INC. AND SUBSIDIARIESSUPPLEMENTAL REMAINING PERFORMANCE OBLIGATIONS AND NON-GAAP RECONCILIATION OF BACKLOG DATA(DOLLARS IN MILLIONS)(UNAUDITED)</td></tr><tr><td colspan=\"13\"> </td></tr><tr><td> </td><td> </td><td colspan=\"3\">December 31,</td><td> </td><td colspan=\"3\">September 30,</td><td> </td><td colspan=\"3\">December 31,</td></tr><tr><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td>Remaining performance obligations</td><td> </td><td>$</td><td>1,215</td><td> </td><td> </td><td>$</td><td>1,176</td><td> </td><td> </td><td>$</td><td>1,073</td><td> </td></tr><tr><td>Agreements without an enforceable obligation (1)</td><td> </td><td> </td><td>539</td><td> </td><td> </td><td> </td><td>610</td><td> </td><td> </td><td> </td><td>379</td><td> </td></tr><tr><td>Backlog</td><td> </td><td>$</td><td>1,754</td><td> </td><td> </td><td>$</td><td>1,786</td><td> </td><td> </td><td>$</td><td>1,452</td><td> </td></tr><tr><td> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"13\" rowspan=\"2\">(1) Our backlog contains signed agreements and letters of intent which we do not have a legal right to enforce prior to work starting. These arrangements are excluded from remaining performance obligations until work begins.</td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX23SZzm:0-ies-holdings-reports-fiscal-2025-first-quarter-results/",
            "pub_date": "2025-02-04 20:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}