{
    "data": [
        {
            "id": "te_news:529278:0",
            "title": "Stocks in Saudi Arabia Hit 35-month Low",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>TASI decreased to 10214.00 Index Points, the lowest since March 2023.</span></p><p class=\"\"><span>Over the past 4 weeks, Tadawul All Share TASI Index lost 5.91%, and in the last 12 months, it decreased 11.58%.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:529278:0-stocks-in-saudi-arabia-hit-35-month-low/",
            "pub_date": "2026-03-01 15:15:18",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO062:0",
            "title": "Gb Corp Q4 Consol Profit EGP 456.9 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>GB Auto </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GB CORP Q4 CONSOL NET PROFIT EGP 456.9 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GB CORP Q4 CONSOL TOTAL REVENUE EGP 22.70 BILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO062:0-gb-corp-q4-consol-profit-egp-456-9-million/",
            "pub_date": "2026-03-01 15:22:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_Zaw3nkPzW:0",
            "title": "ZAWYA-PRESSR: Statement from Oman Air Cargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Muscat, Oman: </span></strong><span>Due to current airspace closures in the region, Oman Air Cargo is experiencing limited operational disruption affecting some services within the Gulf Cooperation Council.</span></p><p class=\"\"><span>Services to Europe and the Asia Pacific region continue to operate as scheduled, with rerouting implemented where required and minor delays in some instances.</span></p><p class=\"\"><span>As a precautionary measure, the carriage of perishable cargo has been temporarily restricted, while general cargo operations continue as normal.</span></p><p class=\"\"><span>Additional operational safeguards have been introduced to protect the safety and security of staff, customers, and shipments, which remain the company’s highest priority.</span></p><p class=\"\"><span>Oman Air Cargo continues to monitor the situation closely, will provide updates to customers as developments unfold, and remains available to answer any questions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Oman Air Cargo</span></strong></p><p class=\"\"><span>Established in 2009, Oman Air Cargo is a key cargo carrier in the Middle East, focused on high-quality, cost-effective services delivered on time. Operating B-737-MAX and B-787-9 aircraft, Oman Air Cargo offers connections to more than 200 destinations worldwide from its uncongested hub in Muscat. Its modern 22,780 square meter warehouse is CEIV Fresh and Pharma certified and fully air-conditioned including 305 square meters of bulk cold storage for perishables and pharmaceuticals. The facility has a modern, state-of-the-art Live Animals Centre, which includes veterinary inspection, an emergency room, and 24/7 access to Royal Oman Police Customs services.</span></p><p class=\"\"><span>Oman Air was initially founded in 1993 to service important domestic routes; it has since undergone rapid growth and is today an award-winning airline connecting cities around the world to Oman’s stunning nature and rich heritage. With a young and modern fleet, Oman Air is renowned for its exceptional products and services, both in the air and on the ground, and for the signature Omani hospitality it offers to every guest throughout their journey.</span></p><p class=\"\"><span>For more information, visit cargo.omanair.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_Zaw3nkPzW:0-zawya-pressr-statement-from-oman-air-cargo/",
            "pub_date": "2026-03-01 15:25:02",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:89200642c094b:0",
            "title": "6 Polymarket traders net $1M on US-Iran strike, spark insider fears: Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Six Polymarket traders earned roughly $1 million after accurately betting that the United States would strike Iran before the end of February, triggering insider trading suspicions.</span></p><p class=\"\"><span>The six wallets were all created in February and placed nearly all of their activity on contracts predicting the timing of a potential US attack, Bloomberg reported, citing data shared by analytics firm Bubblemaps SA. In several cases, shares were purchased only hours before explosions were first reported in Tehran, with some contracts acquired for around $0.10, per the report. </span></p><p class=\"\"><span>The timing drew attention from onchain investigators, who said the pattern resembles behavior previously linked to suspected insider activity on prediction markets.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:438.8724035608309px;aspect-ratio:0.7314540059347182\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:89200642c094b-411413cf3a4cf449b9ccdf3c2e928d53-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:89200642c094b-411413cf3a4cf449b9ccdf3c2e928d53-resized.webp\" style=\"background-color:#ada9a7\"/></picture></div></button></figure><p class=\"\"><span>“In cases involving war or conflict, information can circulate within a broader circle before becoming public,” Nicolas Vaiman, chief executive of Bubblemaps, reportedly said. “Combined with the fact that Polymarket generally only requires a wallet to trade, which allows for a high level of anonymity, this can create incentives for informed participants to act early,” he added. </span></p><p class=\"\"><span>Cointelegraph reached out to Polymarket for comment, but had not received a response by publication</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><em><strong class=\"root-Tkn6WL2y\"><span>Polymarket user gains $400K betting on ZachXBT investigation</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Polymarket Iran strike bets draw $529 million in volume</span></strong></p><p class=\"\"><span>During the recent escalation, more than $529 million flowed into strike-related contracts on Polymarket. The specific Feb. 28 contract alone attracted roughly $90 million in trading volume, making it the most popular strike date among traders. A Jan. 31 scenario followed with about $42 million.</span></p><p class=\"\"><span>Notably, one of the flagged accounts had previously lost money on an earlier prediction before placing a larger wager that later returned more than $170,000, suggesting that the trades do not by themselves prove wrongdoing. Washington had also publicly warned of possible military action for weeks, drawing speculators to the platform.</span></p><p class=\"\"><span>There have been more instances of insider-trading allegations on Polymarket. This week, a small cluster of crypto wallets earned more than $1.2 million betting on a contract tied to an onchain investigation into DeFi platform Axiom, shortly before investigator ZachXBT published claims that an Axiom employee and associates had been engaged in insider trading since early 2025.</span></p><p class=\"\"><span>Last month, a Polymarket account made about $400,000 from a well-timed wager on the capture of Venezuelan President Nicolás Maduro. The wallet had placed roughly $32,000 on Maduro’s removal shortly before the news became public, raising insider trading concerns.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><span>Polymarket users favor Meteora in bets over ZachXBT crypto takedown</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>US lawmaker moves to ban insider trading on prediction markets</span></strong></p><p class=\"\"><span>As Cointelegraph reported, US Representative Ritchie Torres is preparing legislation called the Public Integrity in Financial Prediction Markets Act of 2026 to limit insider trading on prediction platforms. The proposal would bar elected officials, political appointees and executive-branch employees from trading contracts tied to government policy or political outcomes when they possess nonpublic information.</span></p><p class=\"\"><span>Meanwhile, Polymarket has faced a wave of regulatory actions worldwide, with several countries, including the Netherlands, Hungary, Belgium, France, Italy, Romania, Poland, Singapore and Portugal, blocking or banning the platform after classifying its event-based contracts as unlicensed online gambling rather than financial trading. </span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Magazine: </span></strong></em><span>Bitcoin may take 7 years to upgrade to post-quantum — BIP-360 co-author</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:89200642c094b:0-6-polymarket-traders-net-1m-on-us-iran-strike-spark-insider-fears-report/",
            "pub_date": "2026-03-01 15:16:30",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cnbctv:a9c8a53bc094b:0",
            "title": "People made a million dollars betting that US would strike Iran before Feb ends",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>As US and Israeli bombs fell on Iran this weekend, bettors on Polymarket — where $529 million was traded on contracts tied to the timing of the strikes — were cashing in. Almost immediately, blockchain sleuths began hunting for unusual patterns in recent bets.</span></p><p class=\"\"><span> Six accounts on Polymarket made around $1 million in profit by betting on the US to strike Iran by Feb. 28, according to analytics firm Bubblemaps SA. The accounts were all freshly created in February and had only ever placed bets on when US strikes might occur. Some of their shares were purchased, in some cases at roughly a dime apiece, hours before the first explosions were reported in Tehran.</span></p><p class=\"\"><span> These are the hallmarks that blockchain analysts associate with insider trading in prediction markets, an industry without widespread oversight and no agreed-upon methodology for distinguishing luck from leaks — and they’re far from conclusive on their own. Similar patterns suggested that an insider made a big profit betting on the ouster of Venezuela’s Nicolás Maduro in January, and have also been used to identify several other cases of alleged insider trading.</span></p><p class=\"\"><span> By the time the Feb. 28 contract resolved on Saturday, it had attracted around $90 million in trading volume since its creation — making it by far the most popular date for a strike on the platform. The next most traded was a contract for an attack by Jan. 31, which had drawn $42 million.</span></p><p class=\"\"><span> Polymarket, one of the largest prediction markets platforms, has become a sprawling, largely unregulated clearinghouse for geopolitical speculation, where the line between informed conviction and privileged knowledge is increasingly hard to draw. Polymarket didn’t immediately respond to a request for comment on Saturday.</span></p><p class=\"\"><span> “Prediction markets are some of the first products that allow direct bets on geopolitical events,” said Nicolas Vaiman, chief executive officer of Bubblemaps, in an email. “In cases involving war or conflict, information can circulate within a broader circle before becoming public. Combined with the fact that Polymarket generally only requires a wallet to trade, which allows for a high level of anonymity, this can create incentives for informed participants to act early.”</span></p><p class=\"\"><span> As the strikes continued over the weekend, Polymarket had already opened new contracts for traders to bet on — among them whether a Gulf state would strike Iran within a week, and whether the US would hit neighboring Iraq by the end of March. All have netted minimal volume thus far.</span></p><p class=\"\"><span> Some of the bets identified by Bubblemaps drew additional scrutiny on social media, where users were quick to label them as suspected insiders. The picture is far murkier than that. The US had been telegraphing military action for weeks, drawing in speculators. A contract tracking possible strikes for Feb. 27 — just one day earlier — attracted more than $25 million in volume.</span></p><p class=\"\"><span> Not all of the accounts were successful, either. One of the six accounts had previously bet around $800 on the US to take military action sooner, losing around $300 in the process. A $26,513 bet that the US would strike on Saturday — by far the account’s largest wager — won its owner more than $174,000.</span></p><p class=\"\"><span> In an environment where US strikes had been openly discussed for months, the pool of people willing to make an aggressive, well-informed wager was large. Whether any crossed the line from conviction into privileged knowledge is a question the blockchain alone cannot answer.</span></p><p class=\"\"><span> The timing of US military action wasn’t the only Polymarket contract to draw speculation about possible insider activity. In mid-January, Polysights, another analytics firm, noted a cluster of one-sided activity around a market tracking whether Ali Khamenei would no longer be supreme leader of Iran by the end of March.</span></p><p class=\"\"><span> At the time, traders put the likelihood at 40% — but almost 90% of possible insider transactions tracked by Polysights supported the outcome. Those accounts also fit the profile that blockchain detectives have built up as telltale signs of alleged insiders.</span></p><p class=\"\"><span> The terms of the Khamenei contract do not exclude his death as a qualifying event — an omission that has drawn criticism from those who argue it effectively places a financial incentive on assassination.</span></p><p class=\"\"><span> Kalshi Inc., a Commodity Futures Trading Commission-regulated rival, said Saturday it does not offer markets that settle on death. In the event of Khamenei’s death, it said it would resolve its contract based on the last price offered.</span></p><p class=\"\"><span> Polymarket’s main trading platform is situated offshore and does not accept US-based customers, placing it outside the CFTC’s oversight. The company has argued that its contracts provide valuable data because they crowdsource information in volatile situations and help the public gauge risk, especially when conventional reporting lags.</span></p><p class=\"\"><span> The Iran bets are the latest in a string of well-timed prediction-market wagers around sensitive events. Earlier in February, Israeli authorities filed what appear to be the first criminal charges anywhere in the world linking prediction-market bets to classified military intelligence. An Israeli military reservist and a civilian were indicted for allegedly using secret operational information to place Polymarket wagers on Israeli security operations last year, earning roughly $150,000.</span></p><p class=\"\"><span> Kalshi recently disclosed its first public enforcement actions against two customers who were suspected of using insider information when betting. The company suspended and fined an editor for YouTube star MrBeast, who Kalshi said had used his knowledge of unaired show content to place bets.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:a9c8a53bc094b:0/",
            "pub_date": "2026-03-01 15:16:43",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_ZawbQLXqZ:0",
            "title": "ZAWYA-PRESSR: Acwa Board of Directors names Dr. Samir J. Serhan Chief Executive Officer",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Dr. Serhan was previously President of Saudi Arabia and the Middle East at Acwa, and formerly Chief Operating Officer of US-based Air Products.</span></li><li class=\"listItem-bmN0_SHH\"><span>Marco Arcelli, CEO of Acwa since March 2023, remains as an advisor to the Chairman of the Board of Directors to ensure a smooth transition.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Riyadh, Kingdom of Saudi Arabia:</span></strong><span> Acwa, the world’s largest private water desalination company, a leader in energy transition, and a first mover into green hydrogen, announced the appointment of Dr. Samir J. Serhan as chief executive officer effective March 1, 2026. In line with the natural progression of executive leadership terms and Acwa’s disciplined governance framework, the Board of Directors of the Saudi-listed company made this appointment as part of a planned and structured leadership transition and succession process overseen by the company’s Board Nomination and Remuneration Committee. The Board and the former CEO Marco Arcelli agreed to implement the planned succession process to ensure continuity and stability. The company’s long-term direction remains unchanged.</span></p><p class=\"\"><span>Since joining Acwa last year as President of Saudi Arabia and Middle East, Dr. Serhan has worked closely with the leadership team and is fully prepared to assume this new responsibility. Previously Dr. Serhan was chief operating officer of the US-based company Air Products where he had global responsibility for the company’s operational business and project execution with P&amp;L accountability for the Americas, Asia, Europe, Africa, the Middle East, and India. He also led functions including technology, global engineering, manufacturing, and equipment at Air Products. Earlier in his career he was president, Hydrogen for Praxair. For 14 years prior, he worked for the Linde Group in leadership positions in the US and Germany, culminating in his role as managing director, Linde Engineering. Dr. Serhan brings more than three decades of global leadership experience across large-scale industrial and infrastructure organizations, with a strong track record in driving operational transformation, strengthening institutional capability, and delivering disciplined and profitable growth in complex, capital-intensive environments.</span></p><p class=\"\"><span>Mohammad Abunayyan, Founder and Chairman of the Board of Directors of Acwa, said: “Acwa stands today as a Saudi national champion and a global leader in renewable energy, water desalination, and green hydrogen, and our position continues to strengthen. We are grateful for Marco’s leadership in advancing Acwa’s strategy and accelerating our growth trajectory. This structured leadership transition reflects the strength of our governance and the maturity of our business platform. Our strategic direction remains clear and unchanged. We are pleased to welcome Dr. Samir Serhan to his new role as CEO of Acwa.”</span></p><p class=\"\"><span>Dr. Samir J. Serhan, the incoming CEO of Acwa, said: \"Every day affords us new opportunities to help our customers and meet pressing energy and water needs around the world. I’m honored to lead Acwa at a pivotal moment as the company accelerates profitable global growth in renewable energy, water desalination, and green hydrogen solutions — including advancing green hydrogen to decarbonize heavy industries — to deliver scalable, sustainable impact worldwide. I look forward to working with our talented Acwa teams around the globe to build on the progress we have achieved and shape the next chapter of our journey.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Marco Arcelli, the outgoing CEO of Acwa, said</span></strong><span>: “Over the past three years, Acwa’s portfolio has doubled in size, and we are on track to double it again by 2030, scaling both our footprint and our impact. Acwa now produces around 25% of the world’s desalinated seawater. We have expanded into new markets, including Azerbaijan, China, Kuwait, and Senegal, while advancing energy export opportunities from Saudi Arabia, and cementing our leadership in green molecules. What we have achieved reflects the scale of our ambition, the discipline of our execution, the dedication of our people, and the trust of our partners.”</span></p><p class=\"\"><span>Acwa supports energy and water security as well as supply reliability, which are priorities that are fundamental to economic resilience and community wellbeing worldwide. Today, Acwa provides clean drinking water for nearly 34 million people and power for almost 76 million people every day.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Acwa</span></strong></p><p class=\"\"><span>Acwa </span><span> is a Saudi-listed company and the world’s largest private water desalination company, the first mover into green hydrogen, and a leader in the global energy transition. Registered and established in 2004 in Riyadh, Saudi Arabia, Acwa employs over 4,000 people and is currently present in 15 countries in the Middle East, Africa, Central Asia, and Southeast Asia. Acwa’s portfolio comprises 111 projects in operation, advanced development, or under construction with an investment value of SAR 430 billion (USD 114.8 billion) and the capacity to generate 93 GW of power (of which 52 GW is renewables) and manage 9.3 million m3/day of desalinated water. This energy and water are delivered on a bulk basis to address the needs of state utilities and industries on long-term, off-taker contracts under utility services outsourcing and public-private partnership models.</span></p><p class=\"\"><span>Learn more: www.acwapower.com</span></p><p class=\"\"><span>Acwa Media Contacts: </span></p><p class=\"\"><span>Halah Mohsen</span></p><p class=\"\"><span>Director Media Affairs &amp; External Communications</span></p><p class=\"\"><span>hmohsen@acwapower.com</span></p><p class=\"\"><span>media.inquiries@acwapower.com</span></p><p class=\"\"><span>Liam Clarke</span></p><p class=\"\"><span>Vice President, Corporate Communications</span></p><p class=\"\"><span>Liam.Clarke@acwapower.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_ZawbQLXqZ:0-zawya-pressr-acwa-board-of-directors-names-dr-samir-j-serhan-chief-executive-officer/",
            "pub_date": "2026-03-01 15:20:19",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZP02A:0",
            "title": "Peru consumer prices rose 0.69% in February",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Peruvian monthly consumer prices rose 0.69% in February, according to data published on Sunday by the national statistics agency INEI. </span></p><p class=\"\"><span>In comparison, consumer prices rose 0.10% in January</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZP02A:0-peru-consumer-prices-rose-0-69-in-february/",
            "pub_date": "2026-03-01 14:52:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:288fddc7a094b:0",
            "title": "NVIDIA and Global Telecom Leaders Commit to Build 6G on Open and Secure AI-Native Platforms",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>NVIDIA 6G Commitment</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/globenewswire:288fddc7a094b-571d8eab3e274636243f41f0ed45f7e1-resized.webp\" type=\"image/webp\"/><img alt=\"NVIDIA today announced a commitment — together with Booz Allen, BT Group, Cisco, Deutsche Telekom, Ericsson, MITRE, Nokia, OCUDU Ecosystem Foundation, ODC, SK Telecom, SoftBank and T-Mobile — to build the world’s next generation of wireless networks on AI-native, open, secure and trustworthy platforms.\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/globenewswire:288fddc7a094b-571d8eab3e274636243f41f0ed45f7e1-resized.webp\" style=\"background-color:#2a2a21\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>News Summary:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Leading operators and infrastructure providers including Booz Allen, BT Group, Cisco, Deutsche Telekom, Ericsson, MITRE, Nokia, ODC, SK Telecom, SoftBank Corp. and T-Mobile will build on open and trusted software-defined wireless platforms.</span></li><li class=\"listItem-bmN0_SHH\"><span>The commitment complements NVIDIA’s ongoing collaborations with industry and governments across Europe, Japan, Korea, the U.K. and the U.S. to advance AI-native 6G innovation.</span></li></ul><p class=\"\"><span>BARCELONA, Spain, March 01, 2026 (GLOBE NEWSWIRE) -- </span><strong class=\"root-Tkn6WL2y\"><span>Mobile World Congress—</span></strong><span>NVIDIA today announced a commitment — together with Booz Allen, BT Group, Cisco, Deutsche Telekom, Ericsson, MITRE, Nokia, OCUDU Ecosystem Foundation, ODC, SK Telecom, SoftBank Corp. and T-Mobile — to build the world’s next generation of wireless networks on AI-native, open, secure and trustworthy platforms.</span></p><p class=\"\"><span>The initiative represents a shared commitment to ensure 6G infrastructure — the foundation for the world’s future connectivity — is open, intelligent, resilient and accelerates innovation and safeguards global trust.</span></p><p class=\"\"><span>Beyond traditional connectivity, 6G wireless networks will become the fabric for physical AI, enabling billions of autonomous machines, vehicles, sensors and robots and significantly increasing demands for security and trust. Legacy wireless architectures were not designed to meet these requirements, creating challenges as networks increase in complexity.</span></p><p class=\"\"><span>To address this, NVIDIA is bringing the industry together to advance AI-native, software-defined wireless platforms built on open and trusted principles. By embedding AI across the radio access network (RAN), edge and core, 6G networks must enable secure integrated sensing and communications, intelligence and decision-making while supporting interoperability, supply-chain resilience and faster innovation.</span></p><p class=\"\"><span>“AI is redefining computing and driving the largest infrastructure buildout in human history — and telecommunications is next,” said Jensen Huang, founder and CEO of NVIDIA. “Together with a global coalition of industry leaders, NVIDIA is building AI-RAN to transform the world’s telecom networks into AI infrastructure everywhere.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Uniting on Openness and Trust for the AI-Native, Software-Defined Era of Connectivity</span></strong></p><p class=\"\"><span>6G will be AI-native and software-defined, enabling wireless networks to advance at the pace of innovation. 6G networks, built on AI-RAN architecture, will continuously evolve through software, enabling real-time intelligence and rapid advancement. This transformation opens the door for a diverse ecosystem of participants — from global operators and technology providers to startups, researchers and developers — all contributing through open and programmable platforms.</span></p><p class=\"\"><span>Allison Kirkby, chief executive of BT Group, said: “Connectivity is the backbone of economic growth, and with this collaboration, we’re helping lay the foundations for a future ecosystem that is intelligent, sustainable and secure. By building on open and trustworthy AI native platforms, we can simplify future technologies like 6G, ensuring they build upon the strengths of today’s 5G networks while still unlocking powerful new capabilities at scale.”</span></p><p class=\"\"><span>Tim Höttges, CEO of Deutsche Telekom AG, said: “Best network, best customer experience — that remains our promise. With an open, intelligent and trusted 6G infrastructure, we are laying the foundation for the era of physical AI and unlocking new value for our customers, for industry and for society.”</span></p><p class=\"\"><span>Arielle Roth, Assistant Secretary of Commerce for Communications and Information, and Administrator at the National Telecommunications and Information Administration, said: “America’s 6G leadership will be critical to our nation’s economic prosperity, national security and global competitiveness. Today’s announcement demonstrates that the United States and our allies and partners around the world are leading in this next-generation technology. We look forward to the next steps from this international industry coalition as they advance and implement their shared 6G vision.”</span></p><p class=\"\"><span>Jung Jai-hun, president and CEO of SK Telecom, said: “SKT is evolving telco infrastructure to serve as the foundation for the AI era, where connectivity serves as a platform for intelligence and innovation. Together, we can build open, trusted infrastructure that drives a global ecosystem of AI innovation.”</span></p><p class=\"\"><span>Hideyuki Tsukuda, executive vice president and chief technology officer of SoftBank Corp., said: “Al-native 6G will transform wireless networks into secure, software-defined infrastructure that supports the next wave of global innovation. SoftBank Corp. is driving this innovation with NVIDIA by advancing open and trusted platforms that enable interoperability, resilience and continuous evolution at scale.”</span></p><p class=\"\"><span>Srini Gopalan, CEO of T-Mobile, said: “We’re at a pivotal moment. In the U.S., we’ve laid the foundation with 5G Advanced and AI-native networks where intelligence lives inside the network. As 6G becomes the backbone of the AI era, telecom will serve as the nervous system of the digital economy, enabling autonomous systems and intelligent industries at scale and unlocking new value for customers and businesses alike. T-Mobile is proud to help define what’s next through deep ecosystem collaboration and sustained innovation.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A Shared Vision for 6</span><span>G:O</span><span>pen, Software-Defined, AI-Native </span></strong></p><p class=\"\"><span>NVIDIA participates in global private and public initiatives to advance 6G innovation, contributing open source software, accessible platforms and joint research and development projects:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>In the United States, NVIDIA has joined the FutureG Office-led OCUDU Initiative, aligning with government and industry partners to accelerate open, software-defined and AI-native 6G architectures.</span></li><li class=\"listItem-bmN0_SHH\"><span>NVIDIA is a founding member of the AI-RAN Alliance, which now has over 130 participating companies driving AI-RAN innovation.</span></li><li class=\"listItem-bmN0_SHH\"><span>NVIDIA, along with Booz Allen, Cisco, T-Mobile, MITRE and ODC, in October launched the AI-Native Wireless Networks (AI-WIN) project, an all-American AI-RAN stack to accelerate the path to 6G.</span></li><li class=\"listItem-bmN0_SHH\"><span>In Korea, NVIDIA is collaborating with an industry consortium to help shape intelligent, secure, programmable 6G networks from the ground up.</span></li><li class=\"listItem-bmN0_SHH\"><span>In the U.K., NVIDIA is collaborating with the Department for Science, Innovation and Technology to advance applied research, ecosystem development and trusted AI-native network design.</span></li><li class=\"listItem-bmN0_SHH\"><span>Across Europe and Japan, NVIDIA is actively engaged with public and industry programs aimed at strengthening open innovation, interoperability and trusted infrastructure.</span></li></ul><p class=\"\"><span>Together, these collaborations represent a unified commitment — supported by like‑minded governments, operators and technology partners — to shape secure, intelligent and trusted global connectivity for the next generation of wireless technology.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About NVIDIA</span></strong></p><p class=\"\"><span>NVIDIA </span><span> is the world leader in AI and accelerated computing.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For further information, contact:</span></strong></p><p class=\"\"><span>Kasia Johnston</span></p><p class=\"\"><span>Corporate Communications</span></p><p class=\"\"><span>NVIDIA Corporation</span></p><p class=\"\"><span>+1-415-813-8859</span></p><p class=\"\"><span>press@nvidia.com</span></p><p class=\"\"><span>Certain statements in this press release including, but not limited to, statements as </span><span>to:AI</span><span> and telecommunications redefining computing and driving the largest infrastructure buildout in human history; Together with a global coalition of industry leaders, NVIDIA building AI-RAN to transform the world’s telecom networks into AI infrastructure everywhere; the benefits, impact, performance, and availability of NVIDIA’s products, services, and technologies; expectations with respect to NVIDIA’s third party arrangements, including with its collaborators and partners; expectations with respect to technology developments; and other statements that are not historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are subject to the “safe harbor” created by those sections based on management’s beliefs and assumptions and on information currently available to management and are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic and political conditions; NVIDIA’s reliance on third parties to manufacture, assemble, package and test NVIDIA’s products; the impact of technological development and competition; development of new products and technologies or enhancements to NVIDIA’s existing product and technologies; market acceptance of NVIDIA’s products or NVIDIA’s partners’ products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of NVIDIA’s products or technologies when integrated into systems; and changes in applicable laws and regulations, as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company’s website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.</span></p><p class=\"\"><span>© 2026 NVIDIA Corporation. All rights reserved. NVIDIA and the NVIDIA logo are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.</span></p><p class=\"\"><span>A photo accompanying this announcement is available at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/acfd4c33-2372-4abd-a20d-81205c419f1f\" rel=\"nofollow\" target=\"_blank\">https://www.globenewswire.com/NewsRoom/AttachmentNg/acfd4c33-2372-4abd-a20d-81205c419f1f</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:288fddc7a094b:0-nvidia-and-global-telecom-leaders-commit-to-build-6g-on-open-and-secure-ai-native-platforms/",
            "pub_date": "2026-03-01 15:00:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:f9525bc9e094b:0",
            "title": "Bitcoin recovers above $68,000 after death of Iranian leader Khamenei",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bitcoin and other cryptocurrencies rebounded sharply in early Asia trading on Sunday after Iran confirmed that the country’s supreme leader had been killed during a military campaign by the US and Israel.</span></p><p class=\"\"><span>The original cryptocurrency rose as much as 2.21% to $68,196 following the news. It was trading at around $67,700 at 11 a.m. in Singapore, after dropping as much as 3.8% the previous day. Ether, the second-largest token, gained as much as 4.58% to trade back above $2,000.</span></p><p class=\"\"><span>Crypto markets, which trade 24/7, were rattled in the hours after the bombing began. Iran launched counterstrikes on multiple locations — including Israel, Qatar, the United Arab Emirates and Bahrain — and threatened more against US linked bases in Iraq. Yet digital assets started to recover throughout the day, with Bitcoin moving sharply higher after initial reports that Iranian leader Ayatollah Ali Khamenei was dead.</span></p><p class=\"\"><span>“Traders generally don’t expect the Iran conflict to have major negative economic consequences, and demand for upside Bitcoin calls has clearly picked up in recent days,” said Markus Thielen, head of research at 10x Research, adding that traders were positioning themselves for the upcoming Federal Reserve meeting.</span></p><p class=\"\"><span>Cryptocurrencies had recovered roughly $32 billion in market value by Sunday morning, after shedding about $128 billion the previous day, according to data from CoinGecko.</span></p><p class=\"\"><span>“Bitcoin is the only large liquid asset trading 24/7, so it absorbed all the selling pressure that would normally spread across equities, bonds, and commodities,” said Hayden Hughes, managing partner at Tokenize Capital. “The real price discovery happens Monday when US equity markets and Bitcoin ETFs reopen. With missiles hitting Dubai, Iranian retaliation across the Gulf, and Strait of Hormuz closure risk, this is not a contained event.”</span></p><p class=\"\"><span>For Bitcoin, the weekend losses extend a months-long selloff in crypto markets, beginning with the liquidation of some $19 billion in leveraged positions in October. Bitcoin has fallen around 50% from its all-time peak of over $126,000 earlier that month, unable to latch on to rallies in gold and other safe-haven assets.</span></p><p class=\"\"><span>“As always, when critical events take place during the weekend, Bitcoin plays the role of pressure valve,” said Justin d’Anethan, head of research at Arctic Digital, noting that the initial impact on the token wasn’t as drastic as some might have expected.</span></p><p class=\"\"><span>“With a lot of the leverage already cleared out and exhausted sellers, there’s only so much impact macro events can have,” he added.</span></p><p class=\"\"><span>Meanwhile, with traditional venues closed, digital-asset investors turned to tokenized commodities on decentralized exchange Hyperliquid to position for geopolitical fallout. Prices for contracts tied to oil, gold and silver jumped on the platform.</span></p><p class=\"\"><span>The reaction also materialized through a sharp increase in selling pressure on Bitcoin derivatives, where within a single hour on Saturday morning, sell volume surged by approximately $1.8 billion, according to an analysis published by CryptoQuant.</span></p><p class=\"\"><span>“This type of imbalance reflects clear seller dominance and rising short-term risk aversion,” wrote crypto analyst Sylvain Olive. “Flows are driven more by emotion and risk management than by structural dynamic, requiring a cautious approach.”</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:f9525bc9e094b:0-bitcoin-recovers-above-68-000-after-death-of-iranian-leader-khamenei/",
            "pub_date": "2026-03-01 14:41:37",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03E:0",
            "title": "Arabian Drilling Announces Successful Start Of Operations Of Recalled Rigs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>ARABIAN DRILLING COMPANY </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANNOUNCES SUCCESSFUL START OF OPERATIONS OF RECALLED RIGS, WHICH WERE PREVIOUSLY RECALLED DURING FOURTH QUARTER OF 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ALL THREE REACTIVATED RIGS ARE NOW FULLY OPERATIONAL AND GENERATING REVENUE, WITH THE COMPLETE FINANCIAL IMPACT EXPECTED TO BE REALIZED BY Q2 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FIRST INTERNATIONAL CONTRACT COMMENCES OPERATIONS IN GCC</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OFFSHORE FLEET UTILIZATION AT 91%</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03E:0-arabian-drilling-announces-successful-start-of-operations-of-recalled-rigs/",
            "pub_date": "2026-03-01 14:43:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZO0XW:0",
            "title": "Kenyan MP among six people killed in helicopter crash",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>A helicopter crash in western Kenya on Saturday killed six people, including a member of parliament, police and government officials said.</span></p><p class=\"\"><span>The helicopter crashed in Nandi County, in the North Rift region. The cause was not immediately clear. County police commander Samuel Mukusi told Kenyan television station Citizen TV that the MP, the pilot, and four other people had died.</span></p><p class=\"\"><span>President William Ruto identified the lawmaker as Johana Ng'eno, of Emurua Dikirr constituency, in a post on X. </span></p><p class=\"\"><span>\"Our thoughts and prayers are with his family, his friends, the people of Emurua Dikirr, and all the victims and families affected by the helicopter crash in Mosop, Nandi County,\" Ruto wrote. </span></p><p class=\"\"><span>The other passengers were not identified. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZO0XW:0-kenyan-mp-among-six-people-killed-in-helicopter-crash/",
            "pub_date": "2026-03-01 14:46:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUA7SZ4ZZ:0",
            "title": "Xpeng Announces Vehicle Delivery Results For February 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Xpeng Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>XPENG ANNOUNCES VEHICLE DELIVERY RESULTS FOR FEBRUARY 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>XPENG - DELIVERED 15,256 VEHICLES IN FEBRUARY</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUA7SZ4ZZ:0-xpeng-announces-vehicle-delivery-results-for-february-2026/",
            "pub_date": "2026-03-01 14:48:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03D:0",
            "title": "Arabian Drilling Proposes Not To Distribute Dividends For 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>ARABIAN DRILLING COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARABIAN DRILLING - NOT TO DISTRIBUTE CASH DIVIDENDS TO SHAREHOLDERS FOR 2025</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03D:0-arabian-drilling-proposes-not-to-distribute-dividends-for-2025/",
            "pub_date": "2026-03-01 14:28:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO05Z:0",
            "title": "Canadian Medical Center Proposes H2 Dividend Per Share SAR 0.8",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>CANADIAN GENERAL MEDICAL CENTER COMPLEX COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CANADIAN MEDICAL CENTER H2 DIVIDEND PER SHARE SAR 0.8</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO05Z:0-canadian-medical-center-proposes-h2-dividend-per-share-sar-0-8/",
            "pub_date": "2026-03-01 14:39:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BV:0",
            "title": "Arabian Drilling Q4 Loss 149 Million Riyals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>ARABIAN DRILLING COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARABIAN DRILLING FY SALES 3.43 BILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARABIAN DRILLING FY NET LOS 75.3  MILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARABIAN DRILLING BACKLOG REACHES ALL-TIME HIGH OF SAR 12.4 BILLION, AS OF DEC END</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARABIAN DRILLING Q4 NET LOSS 149 MILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARABIAN DRILLING Q4 REVENUE 824 MILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARABIAN DRILLING -CAPEX FOR FULL YEAR 2026 IS PROJECTED TO BE IN THE RANGE OF SAR 750 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BV:0-arabian-drilling-q4-loss-149-million-riyals/",
            "pub_date": "2026-03-01 14:22:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00O:0",
            "title": "Canadian Medical Center FY Profit 10.5 Million Riyals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>CANADIAN GENERAL MEDICAL CENTER COMPLEX COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CANADIAN MEDICAL CENTER FY NET PROFIT 10.5 MILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CANADIAN MEDICAL CENTER FY SALES 148.2 MILLION RIYALS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00O:0-canadian-medical-center-fy-profit-10-5-million-riyals/",
            "pub_date": "2026-03-01 14:24:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00N:0",
            "title": "Perfect Presentation Secures Tender For Maintenance And Operation Of IT And Communications",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>PERFECT PRESENTATION FOR COMMERCIAL SERVICES COMPANY </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PERFECT PRESENTATION - MANAGED SERVICES TENDER FOR MAINTENANCE AND OPERATION OF INFORMATION TECHNOLOGY AND COMMUNICATIONS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PERFECT PRESENTATION - PROJECT VALUE SAR 185.3 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00N:0-perfect-presentation-secures-tender-for-maintenance-and-operation-of-it-and-communications/",
            "pub_date": "2026-03-01 14:18:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03B:0",
            "title": "ACWA Power Appoints Samir J. Serhan As CEO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>ACWA POWER COMPANY </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANNOUNCES APPOINTMENT OF NEW CEO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>APPOINTMENT OF SAMIR J. SERHAN AS CHIEF EXECUTIVE OFFICER</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ACWA POWER - NAME OF RESIGNED CEO  MARCO ARCELLI</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03B:0-acwa-power-appoints-samir-j-serhan-as-ceo/",
            "pub_date": "2026-03-01 14:19:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BU:0",
            "title": "Mouwasat Medical Services H2 Dividend SAR 1.125 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MOUWASAT MEDICAL SERVICES COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MOUWASAT MEDICAL SERVICES H2 DIVIDEND SAR 1.125 PER SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BU:0-mouwasat-medical-services-h2-dividend-sar-1-125-per-share/",
            "pub_date": "2026-03-01 14:20:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03C:0",
            "title": "Al Abraaj Restaurants Group FY Profit 777,462 Dinars",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>AL ABRAAJ RESTAURANTS GROUP BSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AL ABRAAJ RESTAURANTS GROUP FY NET PROFIT ATTRIBUTABLE 777,462 DINARS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AL ABRAAJ RESTAURANTS - PROPOSES NO FY DIVIDEND</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03C:0-al-abraaj-restaurants-group-fy-profit-777-462-dinars/",
            "pub_date": "2026-03-01 14:23:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_PLXA3D382:0",
            "title": "Saudi Ceramic FY Profit SAR 180.687 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SAUDI CERAMIC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAUDI CERAMIC FY NET PROFIT SAR 180.687 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAUDI CERAMIC FY SALES SAR 1,490.375 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_PLXA3D382:0-saudi-ceramic-fy-profit-sar-180-687-million/",
            "pub_date": "2026-03-01 14:15:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BR:0",
            "title": "Saudi Ceramic H2 Dividend Per Share SAR 0.5",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SAUDI CERAMIC COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAUDI CERAMIC H2 DIVIDEND PER SHARE SAR 0.5</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BR:0-saudi-ceramic-h2-dividend-per-share-sar-0-5/",
            "pub_date": "2026-03-01 14:15:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00M:0",
            "title": "United Gulf Investment Corporation FY Profit 532,588 Dinars",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>UNITED GULF INVESTMENT CORPORATION BSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>UNITED GULF INVESTMENT CORPORATION NO FY DIVIDEND</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>UNITED GULF INVESTMENT CORPORATION FY NET PROFIT ATTRIBUTABLE 532,588 DINARS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00M:0-united-gulf-investment-corporation-fy-profit-532-588-dinars/",
            "pub_date": "2026-03-01 14:16:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03A:0",
            "title": "Modern Mills H2 Dividend Per Share SAR 1",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MODERN MILLS COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MODERN MILLS H2 DIVIDEND PER SHARE SAR  1</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03A:0-modern-mills-h2-dividend-per-share-sar-1/",
            "pub_date": "2026-03-01 14:17:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BO:0",
            "title": "Al Maha Ceramics FY Dividend 4 Baisas Per Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>AL MAHA CERAMICS SAOG (AMCI.OM):</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AL MAHA CERAMICS - FY DIVIDEND 4 BAISA PER SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BO:0-al-maha-ceramics-fy-dividend-4-baisas-per-share/",
            "pub_date": "2026-03-01 14:06:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BN:0",
            "title": "Saudi Fisheries, Al-Haridah Aquaculture Agree To Extend Licensing Agreement For Two Months",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SAUDI FISHERIES COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SELLS 51% STAKE IN AL-HARIDAH AQUACULTURE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BOTH PARTIES AGREE TO EXTEND LEASE TRANSFER AND LICENSING AGREEMENT FOR AN ADDITIONAL TWO MONTHS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BN:0-saudi-fisheries-al-haridah-aquaculture-agree-to-extend-licensing-agreement-for-two-months/",
            "pub_date": "2026-03-01 14:11:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00J:0",
            "title": "Sabic Agri-Nutrients Approves Merger With National Chemical Fertilizer Co",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SABIC AGRI-NUTRIENTS COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SABIC AGRI-NUTRIENTS - APPROVES MERGER OF CO WITH NATIONAL CHEMICAL FERTILIZER CO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DISSOLUTION OF NATIONAL CHEMICAL FERTILIZER COMPANY (IBN AL-BAYTAR) AFTER COMPLETION OF THE MERGER PROCESS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00J:0-sabic-agri-nutrients-approves-merger-with-national-chemical-fertilizer-co/",
            "pub_date": "2026-03-01 14:01:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BQ:0",
            "title": "United Gulf Holding FY Loss $15.3 Mln",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>United Gulf Holding Company BSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>UNITED GULF HOLDING FY NET LOSS ATTRIBUTABLE $15.3 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>UNITED GULF HOLDING - PROPOSES NO FY DIVIDEND</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BQ:0-united-gulf-holding-fy-loss-15-3-mln/",
            "pub_date": "2026-03-01 14:02:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00K:0",
            "title": "Modern Mills FY Profit 223.8 Million Riyals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MODERN MILLS COMPANY </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MODERN MILLS FY NET PROFIT 223.8 MILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MODERN MILLS FY SALES 1.05 BILLION RIYALS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00K:0-modern-mills-fy-profit-223-8-million-riyals/",
            "pub_date": "2026-03-01 14:02:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BL:0",
            "title": "Bahrain's Inovest FY Loss $18.6 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>INOVEST BSC PUBLIC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BAHRAIN'S INOVEST FY NET LOSS ATTRIBUTABLE $18.6 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>INOVEST - PROPOSES NO FY DIVIDEND</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BL:0-bahrain-s-inovest-fy-loss-18-6-million/",
            "pub_date": "2026-03-01 14:03:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}