{
    "data": [
        {
            "id": "DJN_DN20250204003010:0",
            "title": "Kohl's Is Maintained at Hold by Jefferies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(10:43 GMT) </strong>Kohl's Price Target Cut to $12.00/Share From $15.00 by Jefferies</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003010:0/",
            "pub_date": "2025-02-04 18:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463423:0",
            "title": "Ajinomoto's Profit Gains More Than 6% in Fiscal Nine Months",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ajinomoto's  profit attributable to owners of the parent rose 6.2% to 82.4 billion yen for the nine months ended Dec. 31, 2024 (IFRS), from 77.60 billion yen a year ago mainly boosted by higher sales in the seasonings and foods segment. </p><p class=\"\">The company said basic earnings per share (EPS) increased to 163.08 yen from 148.61 yen a year ago, according to a Tokyo Stock Exchange filing on Monday. </p><p class=\"\">Sales grew 7.8% to 1.151 trillion yen from 1.067 trillion yen a year earlier. </p><p class=\"\">It forecasted attributable profit to increase 9.0% to 95 billion yen or 188.72 yen per share, with sales expected to rise 6.5% to 1.533 trillion yen for the fiscal year ending March 31. </p><p class=\"\">The company expects to pay a year-end dividend of 40.00 yen per share for the current fiscal year. </p><p class=\"\">Ajinomoto shares gained 4% at market close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463423:0/",
            "pub_date": "2025-02-04 18:43:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308432:0",
            "title": "Most US Treasury Yields Advance Early Tuesday With 10-Year Jumping 3.6 Basis Points to 4.58%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308432:0/",
            "pub_date": "2025-02-04 18:43:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463425:0",
            "title": "Singamas Container to See Higher Profit in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singamas Container  expects an attributable profit of at least $30 million for 2024, up from around $19.4 million a year prior, a Tuesday bourse filing said. </p><p class=\"\">The container manufacturer attributed the forecast mainly to a rise in the demand for dry freight containers, increased export volume, and a higher gross profit margin.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463425:0/",
            "pub_date": "2025-02-04 18:43:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003012:0",
            "title": "Indian Shares End Higher, Sentiment Boosted After Tariff Delays — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indian shares closed higher, tracking gains seen across most regional markets. Investor sentiment saw a boost after Trump paused the proposed tariffs on Mexico and Canada. China retaliated with new tariffs on the U.S., but analysts say Beijing's initial move was weaker than expected, signaling lower risks than anticipated. Lenders and tech companies led the gains. IndusInd Bank rose 3.5% and Axis Bank was 2.6% higher. HCL Technologies put up 2.5% and Infosys gained 1.9%. ITC Hotels was the biggest loser on the benchmark index, dropping 4.2%. The benchmark Sensex Index ended 1.8% higher at 78583.81. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003012:0/",
            "pub_date": "2025-02-04 18:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003016:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1044 GMT - The Canadian dollar remain vulnerable even after President Trump agreed to pause 25% tariffs on Canada, Monex Europe analysts say in a note. Any celebrations look somewhat premature, they say. \"The Canadian government will likely have to make much more onerous concessions to ensure that the tariff threat is lifted permanently, and this appears far from a done deal to us.\" This recent drama could resume in a few weeks with risks that next time won't result in another deal for U.S. tariffs to be suspended, they say. USD/CAD trades flat at 1.4434 after hitting a 22-year high of 1.4793 Monday, according to FactSet. (renae.dyer@wsj.com)</p><p class=\"\">1029 GMT - The Bank of England is widely expected to cut interest rates when it announces a decision Thursday, and it could hint at another interest-rate cut in March, Berenberg's senior economist Andrew Wishart says in a note. \"Until now, the BOE has cut at alternate meetings, but a stagnating economy and declining employment argue for more urgent action,\" he says. Markets price in a total of 30 basis points of interest-rate cuts in February and March, LSEG Refinitiv data show. \"It is sensible for the BOE to lower interest rates to prevent a larger drop in [U.K.] employment,\" Wishart says. (miriam.mukuru@wsj.com)</p><p class=\"\">1027 GMT - China's tariff retaliation is smaller than expected and largely symbolic, Morningstar analyst Kai Wang says in a note. Trump's latest 10% blanket tariff on Chinese goods has an immediate impact only on some industries, such as home appliances, lithium batteries and EVs, the analyst says. Wang notes that the products included in China's countermeasures, such as coal and liquefied natural gas, accounted for just 12% of the country's imports from the U.S., implying less risk than previously expected. However, the analyst still warns of the possibility of an escalating trade war given Trump's unpredictability.(sherry.qin@wsj.com)</p><p class=\"\">1008 GMT - Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p><p class=\"\">1005 GMT - The dollar could suffer a further pullback if the U.S. and China move towards a de-escalation in their trade dispute, ING analyst Francesco Pesole says in a note. A new 10% U.S. tariff on China took effect Tuesday and China has announced retaliatory tariffs. Markets seem to price in a good chance of the U.S. and China striking a deal and delaying tariffs after Trump agreed to pause planned 25% tariffs on Canada and Mexico. However, the case for significant dollar depreciation is weak as the tariff threat remains, Pesole says. Trump has \"more concretely introduced the tariff threat into daily market news.\" The DXY dollar index falls 0.5% to 108.484. (renae.dyer@wsj.com)</p><p class=\"\">0957 GMT - U.S. tariffs are likely to end up not as bad as markets had feared, says Jefferies' Mohit Kumar in a note. Jefferies is therefore positive on risky assets over a 3-month to 6-month horizon. The macroeconomic backdrop remains supportive and positioning is light, the global economist says. That said, the coming days are likely to be dominated by headlines around negotiations with China, while Europe is likely the next in the tariffs and negotiations story, he says. (emese.bartha@wsj.com)</p><p class=\"\">0948 GMT - Sterling falls on the day but remains comfortably above Monday's lows against the dollar when U.S. President Trump's tariffs on Canada and Mexico--which he later agreed to pause--unsettled markets. ING analyst Francesco Pesole says any sterling losses should be limited because tariffs shouldn't unduly harm the U.K. economy. Exports to the U.S. are less than 2% of gross domestic product, while Trump \"seems in no rush to hit the U.K. with tariffs,\" he says in a note. U.K. Prime Minister Keir Starmer's trip to Brussels to discuss security and defence is positive for sterling as it signals intent to repair EU relations, he says. Sterling falls 0.3% to $1.2409, still well above Monday's low of $1.2248. EUR/GBP rises 0.1% to 0.8322. (renae.dyer@wsj.com)</p><p class=\"\">0919 GMT - The U.K. March 2030 gilt, which is due to be auctioned on Tuesday, trades at a historically cheap level and this should attract some demand at Tuesday's auction from investors seeking relative value, RBC Capital Markets analysts say in a note. However, this bond is less appealing as the Debt Management Office is set to sell this bond once more this quarter on March 5. \"We're struggling to get particularly excited about the bond on relative value here given its heavy tapping schedule ahead,\" the analysts say. (miriam.mukuru@wsj.com)</p><p class=\"\">0908 GMT - The yields on U.K. government bonds, or gilts, rise, tracking moves in their U.S. and eurozone counterparts after U.S. President Trump paused tariffs on Canada and Mexico for a month, sparking a shift away from safe-haven bonds for now. Tariffs remain a risk and investors are concerned about the harm this could do to the U.K. economy, dampening growth while lifting inflation, Pantheon Macroeconomics economists say in a note. \"We think President Trump's tariffs, by fracturing supply chains, will be stagflationary for the U.K.\" Tariffs could potentially mean fewer interest-rate cuts by the Bank of England as inflation rebounds, the economists say. The 10-year gilt yield climbs 4 basis points to last trade at 4.520%, Tradeweb data show. (miriam.mukuru@wsj.com)</p><p class=\"\">0855 GMT - The dollar falls after President Trump delayed tariffs on Canada and Mexico for one month, but uncertainty remains and this could soon lift the safe-haven dollar once more, Commerzbank's Antje Praefcke says in a note. There is a risk of new tariff announcements coming at any time, she says. \"The next shock is bound to come, and this will probably be dollar-positive again.\" Key U.S. economic data this week--including ISM data on services Wednesday and monthly jobs data Friday--will also likely lift the dollar as long as they underpin the story of a resilient U.S. economy, she says. The DXY dollar index falls 0.4% to 108.589, having hit a three-week high of 109.881 Monday. (jessica.fleetham@wsj.com)</p><p class=\"\">0843 GMT - The euro remains under pressure as tariff risks remain heightened even after President Trump agreed to pause tariffs on Canada and Mexico, Danske Bank analyst Stefan Mellin says in a note. Tariff headlines will likely remain the primary driver of price action in the coming weeks, with a risk of Trump announcing measures against Europe, he says. Still, Trump looks to be using tariff announcements \"primarily as a negotiating tool\" and this could help the euro to recover back into a $1.04-$1.05 range. \"We believe Trump is ultimately likely to under-deliver on maintaining tariffs for an extended period,\" Mellin says. The euro falls 0.2% on the day to $1.0323. It hit a three-week low of $1.0213 Monday, according to FactSet. (renae.dyer@wsj.com)The dollar falls slightly after President Trump agreed to hold off imposing 25% tariffs on Canada and Mexico. \"Dollar Edges Lower After Trump Pauses Canada, Mexico Tariffs — Market Talk,\" at 0756 GMT, incorrectly said Trump agreed to hold off imposing 25% tariffs on China.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003016:0/",
            "pub_date": "2025-02-04 18:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003014:0",
            "title": "Canadian Dollar Remains Vulnerable to Tariff Threat — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Canadian dollar remain vulnerable even after President Trump agreed to pause 25% tariffs on Canada, Monex Europe analysts say in a note. Any celebrations look somewhat premature, they say. \"The Canadian government will likely have to make much more onerous concessions to ensure that the tariff threat is lifted permanently, and this appears far from a done deal to us.\" This recent drama could resume in a few weeks with risks that next time won't result in another deal for U.S. tariffs to be suspended, they say. USD/CAD trades flat at 1.4434 after hitting a 22-year high of 1.4793 Monday, according to FactSet. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003014:0/",
            "pub_date": "2025-02-04 18:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SEEktXPZa:0",
            "title": "Bosnia's indirect tax revenue up 1.3% y/y in Jan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SARAJEVO (Bosnia and Herzegovina), February 4 (SeeNews) - Bosnia and Herzegovina's indirect tax revenue increased by 1.25% on the year to 880 million marka ($465.4 million/449.9 million euro) in January, the country's indirect taxation authority said.</p><p class=\"\">After VAT refunds, net revenue from indirect taxes totalled 700 million marka in January, the same as in January last year, the indirect taxation authority said in a statement on Monday.</p><p class=\"\">The net revenue was distributed between the state-level government, the governments of Bosnia's two constituent entities - the Federation and the Serb Republic, and Brcko district.</p><p class=\"\">The bulk of the income was distributed to Bosnia’s entities and Brcko district. The Federation received 369 million marka, the Serb Republic 207 million marka and Brcko district 21 million marka.</p><p class=\"\">(1 euro = 1.956 marka)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SEEktXPZa:0-bosnia-s-indirect-tax-revenue-up-1-3-y-y-in-jan/",
            "pub_date": "2025-02-04 18:44:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003020:0",
            "title": "Vodafone's German Business Decline Offset Any Progress — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vodafone is struggling to remain relevant, AJ Bell's Russ Mould writes in a note. \"While there are some reasons for encouragement, the market has tuned these out and is focused on the growing problems in its German operation,\" Mould says. The London-listed telecom company's U.K. segment showed some growth, ahead of the now-approved merger with Three. However, the group needs to demonstrate it can achieve sustainable growth to reassure investors, Mould says. Shares fall 6.3% to 65.62 pence. (najat.kantouar@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003020:0/",
            "pub_date": "2025-02-04 18:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1z9VZx:0",
            "title": "CIB Marine Bancshares, Inc. Announces Common Stock Repurchase Plan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BROOKFIELD, Wis., Feb.  04, 2025  (GLOBE NEWSWIRE) — The Board of Directors of CIB Marine Bancshares, Inc. (the “Company” or “CIB Marine”) (OTCQX: CIBH), the parent company of CIBM Bank, has authorized a 2025 share repurchase program for up to $1 million worth of the Company’s outstanding common stock. This marks the Company’s first common stock repurchase program since completing the repurchase of all Company-issued preferred stock in 2024.</p><p class=\"\">Repurchases are expected to commence in the first quarter of 2025. Common stock may be repurchased in the open market or through privately negotiated transactions. Common share repurchases will be made at the Company’s discretion, with the timing and amount determined by a number of factors, including, the availability of common shares, general market conditions, trading prices, economic conditions, regulatory requirements, and the Company’s financial performance. All stock purchases will be made in accordance with applicable legal requirements. The repurchase program does not obligate the Company to purchase a specific amount of common stock within any particular time frame, and there is no guarantee that any shares will be repurchased upon criteria established by the Company. The Board of Directors will evaluate repurchase conditions at least quarterly to determine the terms and conditions for repurchase activity.</p><p class=\"\">“Having just completed our very successful preferred stock repurchase plan in October, this common stock repurchase program will build off of the momentum of 2024 as we continue to expand meaningful opportunities for shareholder value,” stated Brian Chaffin, President and CEO. “We recognize the important opportunity that current market conditions afford for stock repurchase activity, and the benefits it provides to our shareholders.”</p><p class=\"\">CIB Marine Bancshares, Inc. is the holding company for CIBM Bank, which operates nine banking offices and has mortgage loan officers and/or offices in nine states. More information on the Company is available at www.cibmarine.com, including recent shareholder letters, links to regulatory financial reports, and audited financial statements.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>FORWARD-LOOKING STATEMENTS</em></strong></p><p class=\"\">CIB Marine has made statements in this release that may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. CIB Marine intends these forward-looking statements to be subject to the safe harbor created thereby and is including this statement to avail itself of the safe harbor. Forward-looking statements are identified generally by statements containing words and phrases such as “may,” “project,” “are confident,” “should be,” “intend,” “predict,” “believe,” “plan,” “expect,” “estimate,” “anticipate” and similar expressions. These forward-looking statements reflect CIB Marine’s current views with respect to future events and financial performance that are subject to many uncertainties and factors relating to CIB Marine’s operations and the business environment, which could change at any time.</p><p class=\"\">There are inherent difficulties in predicting factors that may affect the accuracy of forward-looking statements. </p><p class=\"\">Stockholders should note that many factors, some of which are discussed elsewhere in this release and in the documents that are incorporated by reference, could affect the future financial results of CIB Marine and could cause those results to differ materially from those expressed in forward-looking statements contained or incorporated by reference in this document. These factors, many of which are beyond CIB Marine’s control, include but are not limited to:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">operating, legal, execution, credit, market, security (including cyber), and regulatory risks;</li><li class=\"listItem-bmN0_SHH\">economic, political, and competitive forces affecting CIB Marine’s banking business;</li><li class=\"listItem-bmN0_SHH\">the impact on net interest income and securities values from changes in monetary policy and general economic and political conditions; and</li><li class=\"listItem-bmN0_SHH\">the risk that CIB Marine’s analyses of these risks and forces could be incorrect and/or that the strategies developed to address them could be unsuccessful.</li></ul><p class=\"\">These factors should be considered in evaluating the forward-looking statements, and undue reliance should not be placed on such statements. Forward-looking statements speak only as of the date they are made. CIB Marine undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. Forward-looking statements are subject to significant risks and uncertainties and CIB Marine’s actual results may differ materially from the results discussed in forward-looking statements.</p><p class=\"\">FOR INFORMATION CONTACT:</p><p class=\"\">J. Brian Chaffin, President &amp; CEO</p><p class=\"\">(217) 355-0900</p><p class=\"\">brian.chaffin@cibmbank.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1z9VZx:0-cib-marine-bancshares-inc-announces-common-stock-repurchase-plan/",
            "pub_date": "2025-02-04 18:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SSNdRl8:0",
            "title": "The observation status for Simris Group AB is removed",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nasdaq Stockholm ABFirst North Growth Market - Equities</p><p class=\"\">The observation status for Simris Group AB is removed</p><p class=\"\">On October 24, 2024, the shares in Simris Group AB (the “Company”) were givenobservation status with reference to material adverse uncertainty in respect ofthe issuer's financial position.</p><p class=\"\">On December 23, 2024, the Company disclosed a press release with informationthat the Company's board of directors had resolved on a financing package tosecure the working capital in the Company.  As part of the finance package, theCompany's board of directors entered into loan agreements which were subject toapproval by the general meeting.</p><p class=\"\">On December 23, 2024, the Company disclosed a notice to an extraordinarygeneral meeting to approve the board of directors' proposal of theaforementioned loan agreements.</p><p class=\"\">On January 20, 2025, the Company disclosed the bulletin from the extraordinarygeneral meeting, which had resolved to approve the board of directors'proposal.</p><p class=\"\">With reference to the above, Nasdaq Stockholm AB decides that the observationstatus for the shares in Simris Group AB (SIMRIS B, ISIN code SE0008091664,order book ID 121365) shall be removed.</p><p class=\"\">For further information about this exchange notice please contact Enforcement &amp;Investigations, telephone +46 8 405 70 50.</p><p class=\"\">Nasdaq Stockholm ABhttps://view.news.eu.nasdaq.com/view?id=bf9a81d888289a877208d4f71da4e9ef9&amp;lang=en&amp;src=omxlink</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SSNdRl8:0-the-observation-status-for-simris-group-ab-is-removed/",
            "pub_date": "2025-02-04 18:45:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1DQ:0",
            "title": "Global Health Dec-Quarter Consol PAT 1.43 Bln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Global Health Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL PAT 1.43 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 9.43 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1DQ:0-global-health-dec-quarter-consol-pat-1-43-bln-rupees/",
            "pub_date": "2025-02-04 18:45:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308435:0",
            "title": "CBOE Volatility Index Steady, US Dollar Slips Early Tuesday After China Announces Retaliatory Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308435:0/",
            "pub_date": "2025-02-04 18:45:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446528:0",
            "title": "Copper Edges Higher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Copper futures rose to over $4.3 per pound in February, a two-week high, supported by traction in the world’s largest manufacturing sectors while markets assessed the impact of trade restrictions between China and the US. US factory activity underwent its first expansion in over two years during January, according to data compiled by the ISM, to support the outlook for base metal demand.</p><p class=\"\">In the meantime, a similar survey by Caixin pointed to an expansion in Chinese factory activity, easing earlier concerns from a contractionary NBS PMI, which faces noise due to volatile stocking/destocking as firms geared for trade barriers with the US and Chinese New Year festivities.</p><p class=\"\">Still, treatment charges in Chinese copper smelters continued to reflect uncertain purchasing levels in the near future.</p><p class=\"\">Beijing signaled a batch of fiscal stimulus to be passed this year, aligned with the traction in credit demand from monetary stimulus, which raised hopes of stronger demand for factory goods.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446528:0-copper-edges-higher/",
            "pub_date": "2025-02-04 18:35:47",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0RP:0",
            "title": "Palantir's shares surge on strong forecasts; MS upgrades to 'equal-weight'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">**Shares of Palantir Technologies  jump nearly 19% to $99.5 premarket</p><p class=\"\">**Palantir forecast Q1 and FY revenue above estimates on robust demand for its software and data analytics services</p><p class=\"\">** Morgan Stanley says Palantir is performing well in the early stages of the AI cycle given a strong tech platform and elite engineering talent</p><p class=\"\">** Raises rating to 'equal-weight' from 'underweight' </p><p class=\"\">** Three of 22 brokerages rate the stock \"buy\" or higher, 14 \"hold\" and five \"sell\" or lower; their median PT is $80- LSEG</p><p class=\"\">** PLTR's stock rose ~340.5% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0RP:0-palantir-s-shares-surge-on-strong-forecasts-ms-upgrades-to-equal-weight/",
            "pub_date": "2025-02-04 18:36:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002972:0",
            "title": "Palantir Technologies Is Maintained at Underperform by Jefferies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(10:37 GMT) </strong>Palantir Technologies Price Target Raised to $60.00/Share From $28.00 by Jefferies</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002972:0/",
            "pub_date": "2025-02-04 18:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC45WWMR:0",
            "title": "Andritz Acquires Ldx Solutions",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ANDRITZ AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">STRENGTHENS ENVIRONMENTAL OFFERING WITH ACQUISITION OF LDX SOLUTIONS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC45WWMR:0-andritz-acquires-ldx-solutions/",
            "pub_date": "2025-02-04 18:37:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463424:0",
            "title": "Indian Indices Gain on Tuesday as US Delays Tariffs on Canada, Mexico",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indian shares climbed on Tuesday, mirroring gains in Asian markets after US President Donald Trump postponed planned tariffs on Canada and Mexico, easing fears of a broader trade war. </p><p class=\"\">The temporary suspension lifted investor sentiment, though tariffs on China remain set to take effect soon. </p><p class=\"\">Meanwhile, focus is shifting to the Reserve Bank of India's Monetary Policy Committee meeting scheduled for Feb. 5 to Feb. 7, with expectations that the central bank could begin its rate-cutting cycle by lowering benchmark rates by 25 basis points. </p><p class=\"\">The BSE Sensex gained 1,397.07 points, or 1.8%, to close at 78,583.81, while the NSE Nifty 50 rose 378.20 points, or 1.6%, to close at 23,739.25. </p><p class=\"\">Larsen &amp; Toubro  led the top gainers with a 4.8% rise, followed by Adani Ports  and IndusInd Bank . </p><p class=\"\">Among laggards, Zomato , Nestle India , and Maruti Suzuki  stood at the top. </p><p class=\"\">In corporate news, Ujjivan Small Finance Bank  has submitted a formal application to the Reserve Bank of India for a universal banking license, according to a Tuesday filing. </p><p class=\"\">Meanwhile, HT Media  said its board has approved an investment of up to 110 million Indian rupees in its wholly owned subsidiary, Mosaic Media Ventures. The investment aims to support Mosaic Media's business of gathering and distributing news, analysis, and research.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463424:0/",
            "pub_date": "2025-02-04 18:37:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002980:0",
            "title": "Nvidia Stock Rises. What Tariff Threats Mean for the AI Chip Maker. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Clark</p><p class=\"\">Nvidia was gaining early on Tuesday. The chip maker looks set to gain from the wider market relief around last-minute deals that averted the U.S. putting tariffs on goods imported from Mexico and Canada.</p><p class=\"\">Nvidia shares were up 0.8% at $117.60 in premarket trading. The stock fell 2.8% on Monday.</p><p class=\"\">The U.S. gets less than 10% of its imported chips from Canada, Mexico or China, according to analysts at Bernstein Research. However, Taiwan's Foxconn — also known as Hon Hai Precision Industry — has previously said it is building the world's largest manufacturing site for servers to house Nvidia's GB200 Superchips in Mexico. The GB200 is one of Nvidia's Blackwell generation of processors.</p><p class=\"\">President Donald Trump has also threatened to place tariffs on semiconductors coming from Taiwan. The agreements reached with Mexico and Canada could lessen fears over the imposition of similar levies.</p><p class=\"\">Meanwhile, Wall Street will be looking for commitments to investment in AI infrastructure from Google-parent Alphabet when it reports quarterly results after the market closes. Its executives are likely to face questions over the ramifications of Chinese firm DeepSeek's low-cost AI models.</p><p class=\"\">Among other chip makers, Advanced Micro Devices was rising 1.1% and Broadcom was gaining 0.3% in premarket trading.</p><p class=\"\">Write to Adam Clark at adam.clark@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002980:0/",
            "pub_date": "2025-02-04 18:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0DL:0",
            "title": "Stocks, dollar stumble as China quickly hits back at US tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US tariffs on China take effect, Beijing quickly imposes own</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Mexico, Canada tariffs paused after border promises</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Markets on edge although Monday's big moves unwound</li></ul></span></div><span><p class=\"\">    U.S. stock futures and the dollar fell on Tuesday, while Hong Kong shares slipped from two-month highs, as the U.S. and China went tit-for-tat on tariffs and raised the spectre of a broader, damaging trade conflict.</p><p class=\"\">\"(The) trade war story remains alive and well and this has a lot further to play out,\" said Shane Oliver, chief economist at AMP in Sydney, as prices skidded around on news headlines.</p><p class=\"\">S&amp;P 500 futures , which had bounced in relief that Mexico and Canada cut last-minute deals to delay a U.S. tariff hit, swung to a 0.2% loss, while the dollar index erased earlier gains to trade 0.1% lower at 108.86 .</p><p class=\"\">    European stocks  slipped 0.1% in morning trading after falling 0.87% on Monday. Germany's DAX index  was flat and Britain's FTSE 100 <!-- -->CURRENCYCOM:UK100<!-- --> 0.3% lower.  </p><p class=\"\">Hong Kong's Hang Seng  scaled 2025 highs on hopes that China would also negotiate its way out of tariffs with U.S. President Donald Trump, but later pared its gains slightly to trade about 2.8% higher, buoyed by hopes that Beijing will ramp up stimulus spending to counter U.S. moves.</p><p class=\"\">An additional 10% U.S. tariff on Chinese exports took effect at 0501 GMT, and minutes later Beijing announced it was investigating Google and imposing tariffs on imports of U.S. oil, coal, gas, cars and farm equipment from Feb. 10.</p><p class=\"\">    \"I'd say there's disappointment that the U.S. tariffs will be implemented following the last-minute reprieve of both Mexico and Canada,\" said Ben Bennett, Asia-Pacific investment strategist at Legal &amp; General Investment Management in Hong Kong.  </p><p class=\"\">    \"At first look, the Chinese action doesn’t appear overly aggressive, and investors will remain hopeful that both sides will reach an agreement before long and remove the barriers.\"  </p><p class=\"\">The dollar surged against the offshore yuan  on Monday but was last down 0.16% on Tuesday. The more liquid Australian dollar , often seen as a proxy for the yuan, was last down 0.3% to $0.6209.</p><p class=\"\">Mainland Chinese markets remained shut for the Lunar New Year break, with investors focusing on where China fixes the currency trading band on Wednesday morning for clues as to whether it will seek to weaken the yuan to limit the impact of tariffs.</p><p class=\"\">Trump's press secretary said he will speak with Chinese President Xi Jinping in the next few days, but unlike the North Americans, it is less clear where they will find common ground.</p><p class=\"\">\"It's a totally different story because it (China) is an economic rival as well as political,\" said Naka Matsuzawa, chief macro strategist at Nomura in Tokyo.</p><p class=\"\">\"Unless China makes huge concession economically, I really don't think Trump will stop this tariff.\"</p><p class=\"\">UNCERTAINTY UNLEASHED</p><p class=\"\">Trump's shifting trade policies have made for a wild start to a week that is also dotted with major company earnings. </p><p class=\"\">The Canadian dollar swung in its biggest one-day range since the onset of the pandemic on Monday, while the S&amp;P 500  fell 1.9% before finishing the session 0.76% lower.</p><p class=\"\">Investor discomfort had safe-haven gold  trading just below Monday's record highs at $2,817 an ounce. Bonds fell slightly after ticking higher on Monday, with benchmark 10-year Treasury yields up 3 bps to 4.579% .</p><p class=\"\">    The euro  was steady at $1.0341 while the dollar rose 0.3% to 155.28 yen .  </p><p class=\"\">\"For the Federal Reserve, the weekend's developments will likely reinforce their inclination to sit on the sidelines and to remain below the radar as much as possible,\" noted J.P. Morgan's chief U.S. economist, Michael Feroli.</p><p class=\"\">UBS Group  trounced forecasts with fourth-quarter profits and announced a buyback. BNP Paribas (BNPP.SA) also beat earnings forecasts but lowered this year's profit target.</p><p class=\"\">Google  reports after U.S. markets close on Tuesday and scrutiny will be on its massive AI spending after the apparently much cheaper Chinese model DeepSeek shocked markets last week.</p><p class=\"\">Brent crude oil prices, which initially rose on Monday, were down around 1%  after touching their lowest in a month at $74.81 a barrel.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0DL:0-stocks-dollar-stumble-as-china-quickly-hits-back-at-us-tariffs/",
            "pub_date": "2025-02-04 18:38:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002982:0",
            "title": "Brilliant Earth Cut to Hold From Buy by Jefferies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(10:39 GMT) </strong>Brilliant Earth Price Target Cut to $1.60/Share From $4.00 by Jefferies</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002982:0/",
            "pub_date": "2025-02-04 18:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463418:0",
            "title": "Hyosung Heavy's Q4 Net Attributable Income Surges 260%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hyosung Heavy Industries'  net attributable income to the parent amounted to 91.06 billion won in the fourth quarter of 2024, up 260% from 25.3 billion won a year earlier. </p><p class=\"\">The company's sales rose 21.6% year over year to 1.571 trillion won from 1.292 trillion won, according to a Monday filing with the Korea Exchange. </p><p class=\"\">Shares of Hyosung Heavy Industries jumped over 14% at market close on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463418:0/",
            "pub_date": "2025-02-04 18:39:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463414:0",
            "title": "SulNOx Forays Into Cruise Market With Crystal Symphony Vessel Trial",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SulNOx Group (SNOX.AQ) on Tuesday reported its foray into the cruise market after it completed the evaluation of its SulNOxEco biodegradable fuel conditioner. </p><p class=\"\">The British fuel additives company said the Crystal Symphony vessel evaluated SulNOxEco from May 2024 to December 2024. The review logged average fuel savings of 3.4% and a material reduction in black smoke emissions. </p><p class=\"\">As such, the cruise operator said it is open to using SulNOxEco across its fleet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463414:0/",
            "pub_date": "2025-02-04 18:39:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463421:0",
            "title": "Posco Future M Widens Loss in Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Posco Future M  widened its fourth-quarter 2024 net attributable loss to shareholders of parent company to 266.2 billion won from 75.3 billion won a year earlier, according to a Monday filing with KIND. </p><p class=\"\">The company's sales declined 36.9% year over year to 723.2 billion won from 1.145 trillion won. </p><p class=\"\">Shares of Posco Future M fell over 3% at market close on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463421:0/",
            "pub_date": "2025-02-04 18:39:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463417:0",
            "title": "Reka Industrial Plans Nearly EUR1.4 Million Energy Efficiency Project at Finnish Factory",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reka Industrial  unit Reka Kumi signed an agreement with Elstor for a 1.4 million-euro energy efficiency project at a factory in Aura, Finland. </p><p class=\"\">The thermal energy technology company will install its power-to-heat thermal storage technology to convert the energy used in steam-powered production processes into clean energy, eliminating the use of oil and reducing carbon dioxide emissions, according to a Tuesday release. </p><p class=\"\">The Finnish technical rubber products company expects the project at its Aura plant to be commissioned in early 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463417:0/",
            "pub_date": "2025-02-04 18:31:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002949_20250204002949:0",
            "title": "India's Sensex Ends 1.8% Higher at 78583.81",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002949_20250204002949:0/",
            "pub_date": "2025-02-04 18:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002948:0",
            "title": "H.I.G. Capital Signs Agreement to Take a Strategic Stake in the HELLER Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">H.I.G. Capital Signs Agreement to Take a Strategic Stake in the HELLER <br/>Group <br/> <br/> <br/>   PR Newswire <br/> <br/> <br/>   HAMBURG, Germany, Feb. 4, 2025 <br/> <br/> <br/>   HAMBURG, Germany, Feb. 4, 2025 /PRNewswire/ -- H.I.G. Capital (\"H.I.G.\"), <br/>a leading global alternative investment firm with $67 billion of capital <br/>under management, is pleased to announce that an affiliate has signed a <br/>definitive agreement to invest in the HELLER Group (\"HELLER,\" the <br/>\"Group\" or the \"Company\"), a leading machine tool manufacturer in <br/>Germany. The transaction is subject to clearance by antitrust <br/>authorities. <br/> <br/> <br/> <br/>   Founded in 1894 and headquartered in NÃ¼rtingen, Germany, HELLER is <br/>a globally renowned provider of cutting-edge CNC machine tools and <br/>manufacturing systems, specializing in high-precision, high-productivity <br/>metal processing. The Group has over 2,600 employees and operates five <br/>state-of-the-art production facilities across Europe, Asia, North <br/>America, and South America, with 30 sales and service branches <br/>worldwide. HELLER's global presence has enabled it to serve a diverse <br/>range of customers and industries, including engineering, aerospace, <br/>energy, defense, and commercial vehicles. <br/> <br/> <br/>   H.I.G. and the fourth generation of the Heller family have entered into <br/>a partnership to facilitate the transformation program initiated two <br/>years ago by Dr. Thorsten Schmidt, CEO of the HELLER Group. H.I.G. will <br/>leverage its extensive manufacturing sector expertise, global network, <br/>and capital resources to assist the company to successfully execute on <br/>its growth plan. The Heller family will continue to retain a significant <br/>ownership interest, preserving the Company's identity as a long-standing <br/>family business. <br/> <br/> <br/>   Nicole Pfleiderer and Marc Heller, the fourth generation of the Heller <br/>family, commented: \"We are pleased to have found an ideal partner in <br/>H.I.G. to jointly secure a prosperous future for our Company. H.I.G.'s <br/>distinguished track record, expertise in the engineering sector, and <br/>expansive global network will provide significant strategic advantages <br/>to the Company. This partnership lays a strong foundation for <br/>sustainable investments in HELLER's future, and we are confident that <br/>HELLER will successfully execute on its strategic initiatives and emerge <br/>stronger than ever.\" <br/> <br/> <br/>   Dr. Thorsten Schmidt, Chief Executive Officer of HELLER, added: \"HELLER <br/>is positioned for a bright future, and unlocking the Company's full <br/>potential requires a strategic realignment. Our objective is to <br/>strengthen and expand our status as a market-leading innovator which <br/>will enable us to serve new industries and attract a broader customer <br/>base. In collaboration with H.I.G., the Heller family, and our talented <br/>workforce, we are committed to implementing our ambitious strategic plan <br/>and advancing the Company's longstanding history of success.\" <br/> <br/> <br/>   Christian Kraul-von Renner, Managing Director at H.I.G., remarked: <br/>\"HELLER is a global technological leader. We are impressed by its <br/>engineering excellence, the exceptional skills of its workforce, and the <br/>outstanding capabilities of its management team. With a legacy spanning <br/>130 years, the Company has a remarkable foundation, and we are confident <br/>in its bright future. We are eager to partner with the Heller family and <br/>to collaborate closely with Dr. Thorsten Schmidt and the entire <br/>management team to drive the next chapter of HELLER's success.\" <br/> <br/> <br/>   About HELLER <br/> <br/> <br/>   Founded in 1894 as a modest craftsman's workshop, HELLER has evolved <br/>into a globally recognized leader in CNC machine tools and manufacturing <br/>systems for machining operations. Today, the Group employs over 2,600 <br/>professionals. It operates five state-of-the-art production facilities <br/>across Europe, Asia, and North and South America, ensuring consistent <br/>and reliable service to a diverse range of industries. HELLER maintains <br/>a strong global presence, with dedicated sales and service subsidiaries <br/>and an extensive network of qualified service partners in all major <br/>markets. The Company's product portfolio includes advanced 4-axis and <br/>5-axis machining centers, milling-turning machining centers, and process <br/>machines. This offering is further enhanced by a modular range of <br/>services and cutting-edge solutions for the digitalization and <br/>automation of production processes. For more information, please visit <br/>the HELLER website at heller.biz. <br/> <br/> <br/>   About H.I.G. Capital <br/> <br/> <br/>   H.I.G. is a leading global alternative investment firm with $67 billion <br/>of capital under management.* Based in Miami, and with offices in <br/>Atlanta, Boston, Chicago, Los Angeles, New York, and San Francisco in <br/>the United States, as well as international affiliate offices in Hamburg, <br/>London, Luxembourg, Madrid, Milan, Paris, BogotÃ¡, Rio de Janeiro, <br/>SÃ£o Paulo, Dubai, and Hong Kong, H.I.G. specializes in providing <br/>both debt and equity capital to middle market companies, utilizing a <br/>flexible and operationally focused/value-added approach: <br/> <br/> <br/></pre><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">H.I.G.'s equity funds invest in management buyouts, recapitalizations,     and corporate carve-outs of both profitable as well as underperforming     manufacturing and service businesses.       </li><li class=\"listItem-bmN0_SHH\">H.I.G.'s debt funds invest in senior, unitranche, and junior debt     financing to companies across the size spectrum, both on a primary     (direct origination) basis, as well as in the secondary markets. H.I.G.     also manages a publicly traded BDC, WhiteHorse Finance.       </li><li class=\"listItem-bmN0_SHH\">H.I.G.'s real estate funds invest in value-added properties, which can     benefit from improved asset management practices.       </li><li class=\"listItem-bmN0_SHH\">H.I.G. Infrastructure focuses on making value-add and core plus     investments in the infrastructure sector.       Since its founding in 1993, H.I.G. has invested in and managed more than </li></ul><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">400 companies worldwide. The Firm's current portfolio includes more than <br/>100 companies with combined sales in excess of $53 billion. For more <br/>information, please refer to the H.I.G. website at hig.com. <br/> <br/> <br/>   *Based on total capital raised by H.I.G. Capital and its affiliates <br/> <br/> <br/>   Contact: <br/> <br/>   Christian Kraul-von Renner <br/> <br/>   Managing Director <br/> <br/> <br/>   ckraulvonrenner@hig.com <br/> <br/>   H.I.G. European Capital Partners GmbH <br/> <br/>   Warburgstrasse 50 <br/> <br/>   20354 Hamburg <br/> <br/>   Germany <br/> <br/>   P: +49 40 41 33 06 100 <br/> <br/> <br/>   hig.com <br/> <br/> <br/>    View original content to download <br/>multimedia:https://www.prnewswire.com/news-releases/hig-capital-signs-agreement-to-take-a-strategic-stake-in-the-heller-group-302366749.html <br/> <br/> <br/> <br/>   SOURCE H.I.G. Capital <br/> <br/> <br/> <br/> <br/> <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002948:0/",
            "pub_date": "2025-02-04 18:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002928:0",
            "title": "European Midday Briefing: Stocks Drop as China Retaliates Against Trump Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET WRAPS</p><p class=\"\">Stocks:</p><p class=\"\">European stocks fell on Tuesday after Trump agreed to postpone his threatened 25% tariffs on Canada and Mexico , however, a new 10% tariff on China took effect.</p><p class=\"\">China has retaliated with new tariffs on select U.S. imports  and said it was opening an antitrust probe into Google.</p><p class=\"\">\"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies said. \"Our view remains that eventually tariffs will end up not as bad as feared.\"</p><p class=\"\">Hargreaves Lansdown said U.K. investors were on edge as trade jitters continued.</p><p class=\"\">Trade tensions are dictating the market mood, especially in Europe where Trump keeps the continent guessing with lingering threats, it said.</p><p class=\"\">With volatility set to remain, there may be chances for investors to cash in on market overreactions, especially if Trump's tariff threats are a bluff, Hargreaves said.</p><p class=\"\">Stocks to Watch</p><p class=\"\">Novartis is set to overcome a wave of patent expirations during 2025, Deutsche Bank said.</p><p class=\"\">The Swiss pharma giant surprised with its margin performance in the last quarter and its 2025 outlook that came ahead of analysts expectations, Deutsche Bank said.</p><p class=\"\">While some of the 4Q revenue beat was attributed to rebates, Novartis appears well-positioned to continue exceeding market expectations, it said.</p><p class=\"\">Deutsche Bank lifted back the stock rating to buy from hold, which had been previously nudged down due to patent expiry worries.</p><p class=\"\">U.S. Markets:</p><p class=\"\">Stock futures fell after China struck back against the new U.S. tariffs. Its measures will go into effect on Feb. 10.</p><p class=\"\">Trump said the tariffs on China were just \"an opening salvo.\" He added: \"If we can't make a deal with China, then the tariffs would be very, very substantial.\"</p><p class=\"\">Forex:</p><p class=\"\">The euro remained under pressure as tariff risks remained heightened even after President Trump agreed to pause tariffs on Canada and Mexico, Danske Bank said.</p><p class=\"\">Tariff headlines will likely remain the primary driver of price action in the coming weeks, with a risk of Trump announcing measures against Europe, it said.</p><p class=\"\">Still, Trump looks to be using tariff announcements \"primarily as a negotiating tool\" and this could help the euro to recover back into a $1.04-$1.05 range.</p><p class=\"\">\"We believe Trump is ultimately likely to under-deliver on maintaining tariffs for an extended period,\" Danske Bank said.</p><p class=\"\">The dollar fell after Trump delayed tariffs on Canada and Mexico for one month, but uncertainty remains and this could soon lift the safe-haven dollar once more, Commerzbank said.</p><p class=\"\">There is a risk of new tariff announcements coming at any time, Commerzbank said.</p><p class=\"\">\"The next shock is bound to come, and this will probably be dollar-positive again.\"</p><p class=\"\">Key U.S. economic data this week--including ISM data on services Wednesday and monthly jobs data Friday--will also likely lift the dollar as long as they underpin the story of a resilient U.S. economy, it said.</p><p class=\"\">Bonds:</p><p class=\"\">Eurozone 10-year government bond yields edged higher, tracking Treasury yields after the latest twist in Trump's tariff policy.</p><p class=\"\">Eurozone rates are likely to continue to be sensitive to growth risks, ING said. \"Especially the front end may find itself even lower in the near term.\"</p><p class=\"\">Danske Bank said being long in French bonds still carries some risks.</p><p class=\"\">French Prime Minister Francois Bayrou pushed the 2025 budget bill without a vote by lawmakers, and faces a no-confidence vote. Using a constitutional tool to pass the bill \"was what led to fall of the previous French government,\" Danske said.</p><p class=\"\">\"Hence, there is still some considerable risks to being long France even at spread of some 75 basis points in the 10-year area to Germany.\"</p><p class=\"\">Energy:</p><p class=\"\">Oil prices fell more than 1% as immediate concerns over supply disruptions eased after Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude.</p><p class=\"\">Meanwhile, as a tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday.</p><p class=\"\">The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices.</p><p class=\"\">Metals:</p><p class=\"\">Gold futures slid, correcting after the Canada and Mexico made a deal that will postpone U.S. tariffs by at least a month, but ING said uncertainty over trade should keep the price relatively well supported.</p><p class=\"\">Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING said.</p><p class=\"\">Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING added.</p><p class=\"\">Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research said.</p><p class=\"\">Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800 level, leaving its bullish bias intact, RHB said.</p><p class=\"\">The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900 level, it said.</p><p class=\"\">The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, RHB added.</p><p class=\"\">EMEA HEADLINES</p><p class=\"\">UBS Aims to Boost Buybacks as Net Profit Beats Expectations</p><p class=\"\">UBS Group reported a fourth-quarter net profit that came in ahead of analysts' expectations, and said it aims to buy back shares valued at up to $3 billion this year.</p><p class=\"\">The Zurich-based bank said Tuesday that net profit for the quarter was $770 million compared with a loss of $279 million in the year-earlier period, when its results were hit by costs related to the integration of Credit Suisse.</p><p class=\"\">BNP Paribas Raises Shareholder Returns After Posting Higher Earnings</p><p class=\"\">BNP Paribas raised its dividend and intends to buy back more than 1 billion euros worth of shares from the second quarter, after posting an earnings rise.</p><p class=\"\">The French lender said it made 2.32 billion euros ($2.40 billion) in net profit for the fourth quarter, up from 1.07 billion euros a year prior, on revenue that grew 11% to 12.14 billion euros.</p><p class=\"\">Smirnoff Vodka Maker Diageo Scraps Midterm Guidance on Uncertainty in Key Markets</p><p class=\"\">U.K. spirits maker Diageo scrapped its midterm outlook, citing macroeconomic and geopolitical uncertainty in key markets affecting the pace of recovery.</p><p class=\"\">The owner of Johnnie Walker, Guinness and Smirnoff said Tuesday that it has withdrawn its target of organic net sales growth between 5% and 7%.</p><p class=\"\">Infineon Shares Surge After Guidance Raise, Better-Than-Expected Quarter</p><p class=\"\">Infineon Technologies shares jumped after the group raised its sales forecasts for the fiscal year as it expects to benefit from a stronger U.S. dollar, while sales in the December quarter fell less than feared amid solid demand for artificial-intelligence chips.</p><p class=\"\">The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros ($15.94 billion) it reported for fiscal 2024. Infineon had previously forecast a slight decline. Meanwhile, Infineon's segment result margin-a key profitability measure-is still expected in the mid-to-high-teens percentage range.</p><p class=\"\">GLOBAL NEWS</p><p class=\"\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</p><p class=\"\">BRUSSELS-European leaders, bracing for a fight with President Trump over the world's most valuable trading relationship, said they are ready to strike back but prefer cooperation.</p><p class=\"\">Trump over the weekend announced punishing tariffs on Canada and Mexico and made clear that U.S. allies across the Atlantic were high on his target list. He later agreed to pause tariffs on Canada and Mexico for one month.</p><p class=\"\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</p><p class=\"\">Bitcoin was struggling for direction Tuesday as investors weighed up how President Donald Trump's trade policies will affect cryptocurrency prices.</p><p class=\"\">The world's largest token climbed when Trump paused plans for 25% tariffs on goods from Mexico and Canada, then slid after China said it would hit back with levies of its own.</p><p class=\"\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</p><p class=\"\">The Treasury Department said it needs to borrow less money than originally expected in the current quarter because it kicked off the year with more cash on hand than planned.</p><p class=\"\">The department, which is responsible for the government's borrowing, said Monday afternoon that in the January to March quarter, it expects to borrow $815 billion. The previous estimate, shared in October, was for $823 billion.</p><p class=\"\">Netanyahu, Trump to Hold Talks on Gaza Cease-Fire and Wider Middle-East Strategy</p><p class=\"\">WASHINGTON-The future of the precarious Gaza cease-fire is expected to dominate much of the closed-door discussion when President Trump and Israeli Prime Minister Benjamin Netanyahu meet in the Oval Office Tuesday.</p><p class=\"\">A commitment from Netanyahu to negotiate an extension and potentially a long-term cessation of hostilities would give Trump a diplomatic win, and could secure the release of remaining hostages, including some Americans.</p><p class=\"\">El Salvador Offers to Take U.S. Deportees of Any Nationality Including Imprisoned Americans</p><p class=\"\">SAN SALVADOR, El Salvador-U.S. Secretary of State Marco Rubio said on Monday that El Salvador has offered to accept deportees of any nationality from the U.S., including incarcerated American citizens who would be held in the country's maximum-security prison.</p><p class=\"\">El Salvador President Nayib Bukele offered to \"house in his jails dangerous American criminals in custody in our country,\" Rubio said in San Salvador, the second stop on his first foreign trip, after meeting with Bukele. \"No country has ever made an offer of friendship such as this,\" he said, calling it the \"most unprecedented and extraordinary, extraordinary migratory agreement anywhere in the world.\"</p><p class=\"\">Trump Hints at Curbs on Musk's Powers After Billionaire Shakes Up Washington</p><p class=\"\">WASHINGTON-President Trump on Monday said there were curbs in place to prevent Elon Musk from doing anything in the government without the White House's blessing, responding to growing confusion about who was overseeing Musk's push to dismantle multiple agencies.</p><p class=\"\">Trump described Musk's role as advisory. \"Elon can't do-and won't do-anything without our approval and we'll give him the approval where appropriate. Where not appropriate, we won't,\" Trump said.</p><p class=\"\">Write to ina.kreutz@wsj.com</p><p class=\"\">Write to us at newsletters@dowjones.com</p><p class=\"\">We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002928:0-european-midday-briefing-stocks-drop-as-china-retaliates-against-trump-tariffs/",
            "pub_date": "2025-02-04 18:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0CK:0",
            "title": "Palm ends lower on weakness in Chicago soyoil",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Malaysian palm oil futures snapped a five-session winning streak to end lower on Tuesday as Chicago soyoil prices tumbled after the U.S. announced that it would delay implementing import tariffs on Mexico and Canada.</p><p class=\"\">The benchmark palm oil contract  for April delivery on the Bursa Malaysia Derivatives Exchange slid 63 ringgit, or 1.44%, to 4,304 ringgit ($969.37) a metric ton at the close.</p><p class=\"\">The crude palm oil futures were dragged down by weakness in the Chicago soyoil market, a Kuala Lumpur-based trader said.</p><p class=\"\">\"The news that the U.S. will postpone imposing import tariffs on Mexico and Canada caused a heavy sell-off in Chicago soybean oil this morning,\" the trader said.           </p><p class=\"\">Soyoil prices on the Chicago Board of Trade  were down 2.54%. The Dalian Commodity Exchange was closed for the Chinese Lunar New Year and will reopen on Wednesday.</p><p class=\"\">Palm oil tracks the price movements of rival edible oils, as it competes for a share of the global vegetable oils market.   </p><p class=\"\">India's palm oil imports in January plunged to their lowest level in nearly 14 years as refiners replaced the tropical oil with cheaper rival soyoil because of negative refining margins, five dealers said.</p><p class=\"\">U.S. crude prices fell by nearly 2% as U.S. tariffs on China took effect. Weaker crude oil futures make palm a less attractive option for biodiesel feedstock. O/R</p><p class=\"\">The ringgit , palm's currency of trade, strengthened 0.67% against the dollar, making the commodity more expensive for buyers holding foreign currencies.</p><p class=\"\">($1 = 4.4400 ringgit)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0CK:0-palm-ends-lower-on-weakness-in-chicago-soyoil/",
            "pub_date": "2025-02-04 18:32:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1A8:0",
            "title": "Eshraq Investments Board To Discuss Investment In Shuaa Capital’S Mandatory Convertible Bond",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ESHRAQ INVESTMENTS :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOARD TO DISCUSS POTENTIAL INVESTMENT IN SHUAA CAPITAL’S MANDATORY CONVERTIBLE BOND</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1A8:0-eshraq-investments-board-to-discuss-investment-in-shuaa-capital-s-mandatory-convertible-bond/",
            "pub_date": "2025-02-04 18:32:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}