{
    "data": [
        {
            "id": "tmx_newsfile:ef9a87ff4094b:0",
            "title": "Crossroads Gold Completes Acquisition of the Steiglitz Gold Project in Australia, Announces Anticipated Trading Date, and Provides Corporate and Leadership Update",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Crossroads Gold Corp. (formerly Northern Silicon International Inc.) (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\" or \"</span><strong class=\"root-Tkn6WL2y\"><span>Crossroads</span></strong><span>\") is pleased to announce, further to the Company's news releases dated October 29, 2025 and November 25, 2025, the Company has completed the acquisition (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Transaction</span></strong><span>\") of the Steiglitz gold project (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Steiglitz Project</span></strong><span>\") located approximately 80 kilometers west of Melbourne, Australia. </span></p><p class=\"\"><span>The Company has filed a listing application dated February 27, 2026 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Listing Application</span></strong><span>\") with the TSX Venture Exchange (the \"</span><strong class=\"root-Tkn6WL2y\"><span>TSXV</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Exchange</span></strong><span>\") for the common shares of the Company to begin trading on the Exchange under the symbol \"CRG\", with trading expected to commence on or about March 4, 2026. A copy of the Listing Application is available on the Company's SEDAR+ profile at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/XEzmESMaqD\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>.</span></p><p class=\"\"><span>Mr. Motton, Chief Executive Officer and Director of the Company, stated, </span><em><span>\"The closing of this Transaction marks a new beginning of a well-funded Australian-focused gold exploration company backed by the Fiore Group. We are excited about the year ahead for Crossroads as we embark on our aggressive exploration campaign at the Steiglitz Project, located in Victoria's renowned goldfields. Steiglitz exhibits the structural, geological and geochemical characteristics associated with significant orogenic gold systems. With a high-grade largely unexplored significant historical producer at Steiglitz, which occurs on the West Selwyn Block Trend that hosts the outstanding Fosterville gold mine, and an application for an exploration license at Pheasant Creek near Southern Cross' Sunday Creek project, we believe we have an exciting portfolio of assets. We are well positioned to execute our 2026 exploration program of extensive drilling of key targets at our Steiglitz Project. I look forward to leading Crossroads in executing a disciplined exploration program.\"</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Transaction, Financing and CUSIP/ISIN</span></strong></p><p class=\"\"><span>The Transaction was completed by statutory amalgamation under the provisions of the </span><em><span>Business Corporations Act</span></em><span> (British Columbia) among a wholly owned subsidiary of the Company and a private British Columbia company which owned the Steiglitz Project. On February 20, 2026, the TSXV conditionally approved the Transaction and the listing of the Company's common shares on the TSXV following the closing of the Transaction. The Company will be classified as a Tier 2 Mining Issuer pursuant to Exchange policies. </span></p><p class=\"\"><span>As previously disclosed on October 29, 2025 and November 25, 2025, the Company completed a brokered private placement of 26,215,000 subscription receipts issued at a price of C$0.20 per Subscription Receipt (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Subscription Receipts</span></strong><span>\") for gross proceeds of C$5,243,000 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Financing</span></strong><span>\"). The Financing was led by Red Cloud Securities Inc. as lead agent and sole bookrunner. The Subscription Receipts have converted into common shares of the Company concurrently with the closing of the Transaction.</span></p><p class=\"\"><span>The aggregate number of common shares of the Company (on an undiluted basis) issued and outstanding at closing of the Transaction (including the common shares issued pursuant to the Financing) is 63,509,094.</span></p><p class=\"\"><span>In connection with the change of the Company's name to \"Crossroads Gold Corp.\", the Company obtained the following new CUSIP number 227921103 and ISIN number CA2279211031.</span></p><p class=\"\"><span>For further information regarding the Transaction and other details, please see the documents listed under the Company's SEDAR+ profile at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/DOyPOSPXAr\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>, including the Listing Application dated February 27, 2026, as well as the news releases of the Company dated November 25, 2025 and October 29, 2025.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Board of Directors, Senior Management </span></strong></p><p class=\"\"><span>In connection with the Transaction, and following the Company's annual general meeting on December 19, 2025, certain officers and members of the Company's Board of Directors resigned. The Board of Directors and senior management team of Crossroads is now comprised of the following individuals: Mr. Neil (Rex) Motton (CEO and Director), Ms. Brenda Nowak (Chief Financial Officer and Corporate Secretary), Mr. Derrick Pattenden (Director), Mr. Paul McNeill (Director), Mr. Joaquin Emilio Marias Baldillou (Director), and Mr. Carson Sedun (Vice President, Corporate Development). </span></p><p class=\"\"><em><span>Mr. Neil (Rex) Motton, MAusMM(CP), FSEG - CEO and Director </span></em></p><p class=\"\"><span>Mr. Motton brings approximately 40 years of global industry and exploration experience in the mining industry, having been involved in the business as a professional exploration geologist since 1986. He has been a director of various mining and exploration companies since 1988. Mr. Motton has a proven track record of discovery and exploration across the globe, including having worked at exploration projects in Australia, South America, Central America, Jamaica and the Philippines. During his tenure at Fosterville South (now Great Pacific Gold </span><span> as Chief Operating Officer for over five years, he was responsible for exploration strategy, project and target generation, overseeing exploration program design and execution, as well as managing community engagement programs. Throughout his career, he has worked in a number Australian of states and territories with a primary focus on gold mineralization. He has also worked in base metals exploration, including porphyry copper deposits, VMS copper-lead-zinc, Mississippi Valley type lead-zinc and nickel laterite within Australia and overseas. Mr. Motton is a registered geologist in Australia and is a Chartered Professional of the AusIMM, as well as a Fellow of the Society of Economic Geology (FSEG). He has an Honours Degree of Applied Science (B.Ap.Sc.) majoring in Geology from the Federation University Australia.</span></p><p class=\"\"><em><span>Ms. Brenda Nowak - Chief Financial Officer, Corporate Secretary</span></em></p><p class=\"\"><span>Ms. Nowak has over 30 years of experience in the legal industry specializing in securities and corporate finance. As CFO and Corporate Secretary, she plays a pivotal role in supporting her board of directors and executive management teams. Her responsibilities encompass legal and regulatory compliance, corporate governance, oversight of board and committee affairs, management of continuous disclosure obligations and the facilitation of corporate and securities transactions. In addition to her role as Corporate Secretary and CFO with Crossroads, she is Vice President Corporate Finance for Fiore Management Advisory Corp. (FMAC) and also the Corporate Secretary for North Arrow Minerals. In the past, she has served as Corporate Secretary for Filo Mining, NGEx Minerals, Cornish Metals, International Northair Mines, New Dimension Resources, Troon Ventures, Stornoway Diamonds, Capstone Mining, Creston Moly, Kaminak Gold, Bluestone Resources, Kivalliq Energy and West Melville Metals.</span></p><p class=\"\"><em><span>Mr. Carson Sedun - Vice President, Corporate Development</span></em></p><p class=\"\"><span>Mr. Sedun is a Canadian mining &amp; resources executive with 13 years of experience in the public capital markets, investment banking, advisory, investor relations and corporate development. He has focused on the global resource and commodities industry throughout his career, advancing resource projects across Ecuador, Ontario, California, Nevada, New Mexico, Mexico and now Australia. He is the former Director of Corporate Development with Northstar Clean Technologies, a Canadian cleantech company. During his four-year tenure, Northstar secured C$67 million in funding and in 2024, Northstar was recognized in the TSX Venture Top 50 (top 50 of 1,600 issuers). He has been a Co-Founder, Director or executive of numerous resource companies, including Stronghold Silver (sold to Apollo Silver in 2021) and Core Gold (sold to ASX-listed Titan Minerals in 2020). He was formerly an Investment Banking Associate with Canaccord Genuity and Dundee Capital Markets in Vancouver, Toronto and London, UK, in which he successfully closed 35 transactions in his career. He holds an MBA degree (Dean's List, Honours with Distinction, mining specialization) from the Schulich School of Business at York University, a Bachelor of Commerce from McGill University and a Graduate Certificate from the Norman Keevil Institute of Mining Engineering at the University of British Columbia</span><em><span>. </span></em></p><p class=\"\"><em><span>Mr. Derrick Pattenden, CFA - Director </span></em></p><p class=\"\"><span>Mr. Pattenden is an accomplished investment banker with over 15 years of extensive experience in the mining industry specializing in finance, mergers and acquisitions. Throughout his career he has completed M&amp;A transactions with a combined equity value of over C$20 billion. Mr. Pattenden is currently President, Chief Executive Officer and Director of Nations Royalty Corp. </span><span>, market cap: C$180 million(1)). He has direct experience with transactions involving the creation of new mining royalties, and royalty companies, as well as the restructuring of existing metal streaming agreements. He has a Bachelor of Applied Science in Mining Engineering from the University of British Columbia and holds a Chartered Financial Analyst (CFA) designation. He is a band member of the Mohawks of the Bay of Quinte First Nation.</span></p><p class=\"\"><em><span>Mr. Joaquin Marias, P.Geo. - Director </span></em></p><p class=\"\"><span>Mr. Marias is a geologist and mining executive with over 16 years of international experience in mineral exploration, project development, and corporate leadership across the Solomon Islands, Argentina, Australia, Canada, and Alaska. He is President, CEO and Director of Argenta Silver Corp. </span><span>, which he co-founded alongside Frank Giustra and the Fiore Group. Under his leadership, Argenta raised C$60.5 million and, in its first year as a public company, was recognized among the TSX Venture 50™ 2026, ranking in the top 50 out of more than 2,000 TSXV-listed companies. He also serves as Director of Lunex Metals. Joaquin combines technical expertise with disciplined capital markets execution, building companies entirely focused on creating sustainable value for stakeholders.</span></p><p class=\"\"><em><span>Mr. Paul McNeill, P.Geo., ICD.D - Director</span></em></p><p class=\"\"><span>Mr. McNeill is currently VP Exploration for NexGold Mining Corp. </span><span>, market cap: C$515 million(1)). With 28 years of experience Mr. McNeill previously served as VP Exploration for Signal Gold expanding mineral resources and developing the Goldboro Project in Nova Scotia, Canada, VP of Anaconda Mining where he led the expansion of mineral resources and provision of mine feed for the Point Rousse Project, Newfoundland and Labrador Canada, and VP of Exploration of Aurora Energy Resources, developing uranium resources at the Michelin Project in Labrador, Canada which was acquired by Paladin Energy where he subsequently served as Principal Geologist. He has worked throughout Canada, the United States and Australia, and has developed strong technical expertise in orogenic gold deposits, grassroots exploration discovery &amp; development, including analogous deposits to the Pheasant Creek and Steiglitz Projects. He also has expertise in grassroots exploration, project development, operations, community and aboriginal engagement. Mr. McNeill is a Professional Geologist registered in the Provinces of Newfoundland and Labrador, Nova Scotia and Ontario. He holds an ICD.D designation from the Rotman School of Management at the University of Toronto, as well as degrees from Memorial University of Newfoundland and the University of New Brunswick.</span></p><p class=\"\"><em><span>Mr. Gordon Keep - Advisor</span></em></p><p class=\"\"><em><span>Mr. Rob McLeod - Advisor</span></em></p><p class=\"\"><em><span>Mr. Ryan Weymark, P.Eng. - Advisor</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Options Issuance</span></strong></p><p class=\"\"><span>The Company's Board of Directors has approved the issuance of an aggregate of 6,200,000 stock options (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Options</span></strong><span>\"), pursuant to the Company's Incentive Stock Option Plan to certain directors, officers, employees and consultants of the Company, each exercisable at C$0.20 per common share of the Company for a 10-year term. All Options will have a vesting schedule with 1/3 vesting on the date of grant, 1/3 vesting on the six-month anniversary of the date of grant, and the remaining 1/3 vesting on the 12-month anniversary of the date of grant. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Listing Application and Technical Report</span></strong></p><p class=\"\"><span>The Company has filed the Listing Application dated February 27, 2026 with the Exchange containing details of the Transaction and the Resulting Issuer, including financial information. The Listing Application is available under the Company's profile on SEDAR+ at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/rpXQpcwr4k\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>. </span></p><p class=\"\"><span>The Company has also filed a National Instrument 43-101 - </span><em><span>Standards of Disclosure for Mineral Projects</span></em><span> compliant technical report on the Steiglitz Project (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Steiglitz 43-101 Report</span></strong><span>\"). The Steiglitz 43-101 Report is also available under the Company's profile on SEDAR+ at www.sedarplus.ca.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About the Steiglitz Project</span></strong></p><p class=\"\"><span>The Steiglitz Project is located approximately halfway between Geelong and Ballarat, about 80 km west of Melbourne in Victoria State, within one of Australia's earliest quartz-vein (hard-rock) goldfields. Victoria is the largest gold producing state in Australia, has produced 33% of all gold mined in Australia in history, and currently has 13 goldfields that have each produced over 1 million ounces of gold.(2) </span></p><p class=\"\"><span>The Steiglitz Project covers Exploration Licence (\"EL\") 6164, encompassing 53 km² across 51 graticular sections. The Steiglitz Project lies in the Bendigo Zone of the Lachlan Fold Belt, host to world-class Fosterville gold deposits. Gold mineralization at Steiglitz occurs as earlier mesozonal quartz veins overprinted by later epizonal quartz veins in tightly folded Ordovician turbidites and is expressed in two principal styles: </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Numerous high-grade, gold-antimony-arsenic mineralized narrow quartz veins striking north-south parallel to regional folding; and </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Stockwork zones associated with the northeast striking Hanover Fault, a mineralized shear zone bearing gold-antimony-arsenic assemblages. </span></p></li></ul><p class=\"\"><span>Both styles of deposits have evidence of epizonal orogenic mineralization due to their gold and antimony association, quartz vein textures and also due to the regional structural geology setting being due south of Agnico-Eagle's epizonal orogenic high grade Fosterville gold mine hosting 1.7 million ounces gold (Proven &amp; Probable Reserves), 1.5 million ounces gold (Measured &amp; Indicated Resources), and 1.8 million ounces (Inferred Resources) in resources.(3)</span></p><p class=\"\"><span>Steiglitz was a top-ten producer in the historic Bendigo belt, yielding approximately 250,800 oz of gold at a recovered grade of 38 g/t Au between 1855 and 1911.(4) The Steiglitz Project area includes numerous past-producing mines - Alliance, Hanover, and North Birmingham, which operated to relatively shallow depths. The deepest mine was North Birmingham with a shaft to 233m depth, while other mines were generally less than 100m depth, which makes for a set of attractive exploration drilling targets.</span></p><p class=\"\"><span>Modern exploration has included soil and rock-chip geochemistry, IP geophysics, LiDAR, limited RC and diamond drilling (5 holes), and geological mapping. Work to date highlights multiple untested targets along both the Hanover Shear Zone and the north-south vein corridor, with strong gold-arsenic-antimony signatures typical of the region's premier gold systems.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About the Pheasant Creek Project</span></strong></p><p class=\"\"><span>In addition to the Steiglitz Project, as part of the Transaction, the Company has an application for an exploration license on the Pheasant Creek Project, which is not a material property for the Company. The Pheasant Creek Project is located approximately 75 km northeast of Melbourne in Victoria State, Australia. The large 232 km2 project is comprised of Exploration Licence 008776. The Pheasant Creek Project occurs within the Melbourne Zone of the Lachlan Fold Belt, which is composed of Siluro-Devonian sediments and Mid-Devonian granitic intrusions. The Pheasant Creek Project lies immediately south of, and in similar geology to, the Sunday Creek discovery of Southern Cross Gold (market capitalization: C$2.8 billion(1)), which is an outcropping orogenic or epizonal dyke-hosted deposit. Southern Cross has drilled 220 holes over 97,553m (as at August 31, 2025) and is allocating A$60 million over a 200,000m drill program to the Sunday Creek Project. At Sunday Creek, there are 75 intersections &gt;50-100 g/t AuEq x width in metres and 70 individual intersections exceeding 100 g/t AuEq x metres, which are globally leading hit rates (as at August 31, 2025).(5) </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:663.0857142857143px;aspect-ratio:1.1051428571428572\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" style=\"background-color:#faf0e2\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 1 - Crossroads Projects Map</span></strong></p><p class=\"\"><span>To view an enhanced version of this graphic, please visit:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:663.0857142857143px;aspect-ratio:1.1051428571428572\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" style=\"background-color:#faf0e2\"/></picture></div></button></figure><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:568.1118881118881px;max-width:1200px;aspect-ratio:2.112259970457903\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" style=\"background-color:#e4e5e0\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 2 - Regional Map of Victoria, Australia</span></strong></p><p class=\"\"><span>To view an enhanced version of this graphic, please visit:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:568.1118881118881px;max-width:1200px;aspect-ratio:2.112259970457903\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" style=\"background-color:#e4e5e0\"/></picture></div></button></figure><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:805.1703877790835px;aspect-ratio:1.3419506462984725\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" style=\"background-color:#ebe9e5\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 3 - Regional Map near Crossroads' Projects</span></strong></p><p class=\"\"><span>To view an enhanced version of this graphic, please visit:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:805.1703877790835px;aspect-ratio:1.3419506462984725\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" style=\"background-color:#ebe9e5\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About the Fiore Group</span></strong></p><p class=\"\"><span>The Fiore Group is a Vancouver-based private investment firm founded and led by Frank Giustra, focused on building and supporting high-potential companies in mining, resource development and strategic investments. The firm has played a key role in the growth of companies including, NexGold, Argenta Silver, Copper Giant, Aris Gold, Nations Royalty, Cambria Gold, Selkirk Copper and West Red Lake Gold Mines. Backed by deep capital markets expertise and a disciplined, Fiore partners with exceptional management teams to scale companies and create long-term value.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Crossroads</span></strong></p><p class=\"\"><span>Crossroads is a Canadian gold exploration company backed by the Fiore Group and focused on high-potential gold projects within two hours' drive from Melbourne in Victoria State, Australia-one of the world's premier gold-producing jurisdictions. The Company aims to deliver new gold discoveries in a Tier-1 jurisdiction while generating long-term value for shareholders. Crossroads' portfolio includes the historic Steiglitz Project, a historical high-grade producer within the renowned Bendigo Gold Belt.</span></p><p class=\"\"><span>The Steiglitz Project is largely underexplored with modern technology and situated in highly prospective geological belts with proven potential for epizonal and mesozonal orogenic gold systems. Crossroads is led by an experienced management and technical team with deep Australian and global discovery expertise. Crossroads is supported by excellent infrastructure, year-round access, and a stable regulatory framework to systematically advance its projects with modern exploration and drilling aimed at unlocking meaningful gold discoveries.</span></p><p class=\"\"><span>Crossroads is committed to responsible resource development, proactive and open communication, and transparent and inclusive dialogue with regional communities, indigenous organizations and all stakeholders. Crossroads is committed to proactive decision-making and creating economic opportunities for all stakeholders, including the communities it operates in. </span></p><p class=\"\"><span>(1) Source: TMX Group. Market capitalization in C$ as at February 24, 2026.</span></p><p class=\"\"><span>(2) Source: Resources Victoria (link here).</span></p><p class=\"\"><span>(3) Source: Agnico-Eagle website (accessed January 5, 2026), based on Mineral Reserves and Mineral Resource data (as at December 31, 2024).</span></p><p class=\"\"><span>(4) Source: Lisitsin, V., Olshina, A., Moore, D.H. &amp; Willman, C.E., 2007. Assessment of undiscovered mesozonal orogenic gold endowment under cover in the northern part of the Bendigo Zone. GeoScience Victoria Gold Undercover Report 2. Department of Primary Industries.</span></p><p class=\"\"><span>(5) Source: Southern Cross Gold public disclosure and website (accessed January 5, 2026): (link here).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Qualified Person</span></strong></p><p class=\"\"><span>The scientific and technical information contained in this news release was reviewed and approved by Mr. Andrew Hamilton, P.Geo. who is a \"Qualified Person\" (as defined in National Instrument 43-101 - </span><em><span>Standards of Disclosure for Mineral Projects</span></em><span>). Mr. Hamilton is independent of the Company in accordance with National Instrument 43-101 - </span><em><span>Standards of Disclosure for Mineral Projects </span></em><span>and has not visited the properties discussed in this disclosure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>On behalf of the Board of Directors of Crossroads,</span></strong></p><p class=\"\"><span>Mr. Neil (Rex) Motton</span></p><p class=\"\"><span>CEO &amp; Director</span></p><p class=\"\"><span>Crossroads Gold Corp.</span></p><p class=\"\"><span>Email: investors@crossroadsgold.com</span></p><p class=\"\"><em><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></em></p><p class=\"\"><em><span>Certain statements and information herein, including all statements that are not historical facts, contain forward looking statements and forward-looking information within the meaning of applicable securities laws. Such forward looking statements or information include but are not limited to statements or information with respect to: the business plans of the Company. With respect to forward-looking statements and information contained herein, the Company and Crossroads have made numerous assumptions including among other things, assumptions about general business and economic conditions. The foregoing list of assumptions is not exhaustive. Although management of the Company and Crossroads believe that the assumptions made and the expectations represented by such statements or information are reasonable, there can be no assurance that forward-looking statements or information herein will prove to be accurate. Forward-looking statements and information by their nature are based on assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. These factors include, but are not limited to: risks associated with the business of Crossroads given its limited operating history; business and economic conditions in the mineral industry generally; the supply and demand for labour and other project inputs; risks relating to unanticipated operational difficulties (including unanticipated events related to mineral exploration); changes in general economic conditions or conditions in the financial markets; changes in the price of gold and currency exchange; and other risk factors as detailed from time to time. The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws. </span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:ef9a87ff4094b:0-crossroads-gold-completes-acquisition-of-the-steiglitz-gold-project-in-australia-announces-anticipated-trading-date-and-provides-corporate-and-leadership-update/",
            "pub_date": "2026-02-28 08:41:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:b2de848cb094b:0",
            "title": "RETRANSMISSION: Early Warning News Release",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This press release is issued pursuant to Multilateral Instrument 62-104 - </span><em><span>Take-Over Bids and Issuer Bids</span></em><span> and National Instrument 62-103 - </span><em><span>The Early Warning System and Related Take-Over Bid and Insider Reporting Issues</span></em><span>.</span></p><p class=\"\"><span>Calgary, Alberta--(Newsfile Corp. - February 27, 2026) - Mr. Ryan Kalt (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Acquiror</span></strong><span>\") reports that he has divested certain securities of Red Lake Gold Inc. (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Issuer</span></strong><span>\"), on an indirect basis, as represented by the sale of 1,562,000 common shares (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Divested Securities</span></strong><span>\"), during the inclusive period of February 26, 2026 to February 27, 2026 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Sale Period</span></strong><span>\"). Within said Sale Period, a sub-total of 1,117,000 common shares were sold today, resulting in the herein referenced Form 62-103F1 and this related news release.</span></p><p class=\"\"><span>In the direct and indirect aggregate, the Acquiror now owns and controls 19,868,500 common shares of the Issuer, representing approximately 39.31% of the Issuer's outstanding common shares, alongside certain other convertible instruments (being common share warrants and common share stock options), all of the same being further described and hereby referenced through the Form 62-103F1 filed today (on SEDAR+) involving this disclosure.</span></p><p class=\"\"><span>The Divested Securities represented approximately 3.09% of the outstanding common shares of the Issuer (based on the Issuer having 50,539,169 common shares issued as at the date hereof).</span></p><p class=\"\"><span>The Divested Securities were sold in the Sale Period through open-market facilities of the Canadian Securities Exchange (the \"</span><strong class=\"root-Tkn6WL2y\"><span>CSE</span></strong><span>\"), or other broker-routed market, at an average sale price of $0.02 per common share.</span></p><p class=\"\"><span>The Acquiror may sell securities of the Issuer either on the open market or through private dispositions in the future or may acquire securities of the Issuer either on the open market or through private acquisitions in the future depending upon market conditions, the Acquiror's investment objectives and/or other relevant factors. Other than the foregoing and/or as publicly filed, the Acquiror does not have plans or any future intentions which relate to or would result in any of the other foregoing matters.</span></p><p class=\"\"><em><span>\"Ryan Kalt\"</span></em></p><p class=\"\"><span>Ryan Kalt</span></p><p class=\"\"><span>The Form 62-103F1 - </span><em><span>Required Disclosure</span></em><span> </span><em><span>under the Early Warning Requirements </span></em><span>associated with this news release can be obtained from SEDAR+ at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/3KkDoUe4pR\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>. In the alternative, to obtain a copy of the report, please contact Mr. Kalt at 1.403.454.2984.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The CSE has not reviewed, approved or disapproved the contents of this press release.</span></strong></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:b2de848cb094b:0-retransmission-early-warning-news-release/",
            "pub_date": "2026-02-28 08:44:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN28A:0",
            "title": "Arrest of Western Australia man over alleged terror plot 'deeply shocking', PM Albanese says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Australian Prime Minister Anthony Albanese said Friday's arrest of a Western Australian man over an alleged terror plot targeting mosques, police and a parliament building was \"deeply shocking\". </span></p><p class=\"\"><span>The 20-year-old from the town of Bindoon about 63 km (39 miles) north of state capital Perth was later charged by police with planning a terrorist act. Police said the man had written a manifesto with plans for a mass casualty event and that he wanted to attack mosques, Western Australia's police headquarters and Parliament House. </span></p><p class=\"\"><span>Albanese said on X late on Friday: \"The arrest of a WA man over an alleged racially-motivated terrorist plot is deeply shocking.\"</span></p><p class=\"\"><span>\"Allegations the man was planning to target the Muslim community through attacks on mosques - as well as attacks on the WA police and parliament - are particularly distressing. He should face the full force of the law,\" Albanese said. </span></p><p class=\"\"><span>The arrest is the latest in a series of incidents in Australia classified as terrorism, including an attempt on January 26 to bomb a rally in Perth that was protesting against the country's national day. </span></p><p class=\"\"><span>In December, two gunmen attacked a Hanukkah celebration at Sydney's Bondi Beach, killing 15 in Australia's deadliest massacre in nearly 30 years. Authorities believe the pair were inspired by Islamic State, the Sunni Muslim militant group.     </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN28A:0-arrest-of-western-australia-man-over-alleged-terror-plot-deeply-shocking-pm-albanese-says/",
            "pub_date": "2026-02-28 08:36:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0acdabe035fb3:0",
            "title": "Delta Air Lines CEO Sells 100,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Delta Air Lines Chief Executive Officer, Edward H Bastian, sold 100,000 shares of common stock on February 26, 2026, at a weighted average price of $70.257 per share, totaling $7,025,700. Following the transaction, Bastian directly owns 1,363,448 shares of the company.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Bastian Edward H</span></td></tr><tr><td><span>Relationship</span></td><td><span>Chief Executive Officer</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$7,025,700</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1289878/000168316826001373/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1289878/000168316826001373/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">DELTA AIR LINES, INC. [ DAL ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:0acdabe035fb3:0-delta-air-lines-ceo-sells-100-000-shares/",
            "pub_date": "2026-02-28 08:40:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSvB5P1a:0",
            "title": "Electronic Caregiver Advances the Rio Grande Health Technology Corridor, Positioning Las Cruces as a National AI Healthcare Infrastructure Hub",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>LAS CRUCES, NM / ACCESS Newswire / February 27, 2026 / Electronic Caregiver, Inc., a nationally deployed AI-driven healthcare infrastructure company headquartered in Las Cruces, announced continued expansion of its operations as part of its long-term vision to build the Rio Grande Health Technology Corridor.</span></p><p class=\"\"><span>While New Mexico has long been recognized for its national laboratories and aerospace programs, it has not historically produced a nationally scaled, consumer-integrated AI healthcare technology platform.</span></p><p class=\"\"><span>Electronic Caregiver is changing that.</span></p><p class=\"\"><span>The company's Addison Care platform delivers continuous AI-driven healthcare engagement into the home, integrating remote patient monitoring, TeleCare operations, longitudinal data management, payer reimbursement alignment, and family caregiver support across multiple states nationwide.</span></p><p class=\"\"><span>Unlike research institutions or niche aerospace ventures, Electronic Caregiver operates as a recurring-revenue commercial enterprise serving patients, clinics, home care networks, and payers across the United States.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Building the Rio Grande Health Technology Corridor</span></strong></p><p class=\"\"><span>Electronic Caregiver is actively expanding its footprint across Southern New Mexico, with strategic plans to grow patient monitoring, TeleCare, logistics, and technology operations from Las Cruces to Roswell over the next 12 to 18 months.</span></p><p class=\"\"><span>This initiative, referred to internally as the Rio Grande Health Technology Corridor, is designed to establish Southern New Mexico as a nationally recognized AI healthcare infrastructure hub.</span></p><p class=\"\"><span>The expansion includes high-skill, high-wage roles across a broad range of disciplines, including:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Advanced software engineering</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Artificial intelligence and machine learning</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Information technology and cloud architecture</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Computer vision and edge computing</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>IoT architectures and device orchestration</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mixed reality and user experience design</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Biomechanics and physiological biometric monitoring</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Health network integration and microservices infrastructure</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Full-stack TeleCare operations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nursing and clinical support</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Scientific and clinical research</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Payer and compliance infrastructure</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Hardware and device lifecycle management</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Complex logistics and national fulfillment</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Commercial, consumer, and medical sales</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Award-winning digital marketing and media production</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Sophisticated customer service operations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Diverse accounting and financial systems</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Intellectual property development</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Internal capital formation</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Human resources and workforce development</span></p></li></ul><p class=\"\"><span>The company operates across disciplines that include cloud computing, LLM integration, data architecture and management, health interoperability frameworks, and real-world longitudinal engagement analytics.</span></p><p class=\"\"><span>Silicon Valley-Level Opportunity in Southern New Mexico</span></p><p class=\"\"><span>Electronic Caregiver currently employs hundreds of staff members and continues to expand hiring across technical, clinical, operational, and commercial functions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Chief Executive Officer Anthony Dohrmann</span></strong><span> stated:</span></p><p class=\"\"><span>\"Our goal is to build the first nationally and globally recognized commercial and health technology brand organically founded and headquartered in Las Cruces, New Mexico. As New Mexico's second largest city, neighboring El Paso, Texas, we see a tremendous opportunity to expand operations throughout the border region. Over the coming 12 to 18 months, we are working to strengthen patient monitoring and TeleCare operations from Las Cruces to Roswell, reinforcing the entire southern portion of the state. We are bringing Silicon Valley-level employment opportunities to fertile labor markets built on hard work ethic, sound culture, and ambitious individuals who value their hometown roots.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A National AI Healthcare Infrastructure Platform</span></strong></p><p class=\"\"><span>Electronic Caregiver's platform integrates consumer-facing AI engagement with healthcare reimbursement models, enabling daily adherence support, early identification of health status changes, safety and security monitoring, and longitudinal care oversight.</span></p><p class=\"\"><span>The company has completed over 100 pilot deployments across multiple verticals, secured national payer taxonomy approvals, and continues to scale patient engagement nationwide.</span></p><p class=\"\"><span>Electronic Caregiver partners alongside major global technology leaders while maintaining platform independence and operational control, positioning itself as a durable infrastructure layer in the evolving AI-first healthcare ecosystem.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>From Research Economy to Scalable Infrastructure</span></strong></p><p class=\"\"><span>New Mexico has long exported scientific research and engineering talent. The Rio Grande Health Technology Corridor represents a shift toward retaining and scaling that talent within a nationally recognized commercial AI healthcare enterprise.</span></p><p class=\"\"><span>Electronic Caregiver's continued expansion signals a new chapter for the state: the emergence of a founder-led, nationally deployed AI healthcare infrastructure platform organically founded and headquartered in Southern New Mexico.</span></p><p class=\"\"><span>Scalable Research, Workforce Development, and Certification Pathways</span></p><p class=\"\"><span>The majority of Electronic Caregiver's workforce are graduates of New Mexico State University. Over the past 15 years, the company has maintained a sustained collaborative relationship with the university, contributing to both research development and the cultivation of a high-skill regional workforce.</span></p><p class=\"\"><span>In addition to published scientific research and applied health technology initiatives, Electronic Caregiver partnered with NMSU to develop an Advanced TeleCare Care Coach certification curriculum, now officially offered to students. The program prepares graduates for high-skill roles in virtual care operations, remote patient engagement, longitudinal care coordination, and AI-assisted clinical support.</span></p><p class=\"\"><span>This formalized pathway bridges academic training with real-world healthcare infrastructure deployment, creating a direct pipeline from university education into nationally scaled TeleCare operations.</span></p><p class=\"\"><span>By aligning advanced healthcare engineering, applied research, and structured workforce certification, Electronic Caregiver is demonstrating that nationally competitive AI and health technology infrastructure can be built, staffed, and scaled from Las Cruces.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Electronic Caregiver</span></strong></p><p class=\"\"><span>Electronic Caregiver, Inc. Founded in 2009, is a New Mexico-based healthcare technology company delivering AI-driven continuous care infrastructure through its Addison Care platform. The company integrates remote patient monitoring, TeleCare operations, longitudinal data management, reimbursement pathways, and consumer engagement to extend care into the home across the United States.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contact</span></strong></p><p class=\"\"><span>media@ecg-hq.com</span></p><p class=\"\"><span>(575) 649-7808</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Electronic Caregiver, Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSvB5P1a:0/",
            "pub_date": "2026-02-28 08:40:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_TnwsJkN5:0",
            "title": "Noble Announces Results of 2026 Shareholder Meeting",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>TORONTO, February 27, 2026 –TheNewswire - Noble Mineral Exploration Inc. (\"Noble\" or the \"Company\") </span><span> (OTCQB: NLPXF) is pleased to announce theresults of its Annual General and Special Meeting of shareholders heldon February 26, 2026. (the “AGM”). At the AGM, the shareholdersapproved: </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the re-election of management’s nominees to the Boardof Directors, namely: J. Birks Bovaird, Yvan Champagne, MichaelNewbury, Samuel Peralta, and H. Vance White (each director beingelected with over 99% of votes cast);  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the re-appointment of MNP LLP as the Company’sauditor for the upcoming year, and also authorized the directors tofix the renumeration of the auditors (approved by over 99% of votescast);   </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the re-approval of the Amended and Restated 2022 EquityIncentive Plan of the Company (approved by over 99% of votes cast);and </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the approval of the Shareholder Rights Plan of theCompany (approved by over 99% of votes cast).          </span></p></li></ul><p class=\"\"><span>Following the AGM, the Board of Directors re-appointedthe officers of the Company to the positions they previously held. In addition, the Board confirmed that the Audit Committee wouldcontinue to be comprised of Michael Newbury (Chair), J. Birks Bovairdand Yvan Champagne, and the ESG, Nominating and Compensation Committeewill be comprised of J. Birks Bovaird (Chair), Michael Newbury andSamuel Peralta.</span></p><p class=\"\"><span>About</span><br/><span>Noble Mineral Exploration Inc.:</span><br/></p><p class=\"\"><br/><span>Noble Mineral Exploration Inc. is a Canadian-based</span><br/><span>junior exploration company, which has holdings of securities in Canada</span><br/><span>Nickel Company Inc., Homeland Nickel Inc., East Timmins Nickel Inc.</span><br/><span>(20%), and its interest in the Holdsworth gold exploration property in</span><br/><span>the area of Wawa, Ontario.</span><br/></p><p class=\"\"><br/><span>Noble holds mineral and/or exploration rights in</span><br/><span>~70,000ha in Northern Ontario and ~24,000ha elsewhere in Quebec upon</span><br/><span>which it plans to generate option/joint venture exploration programs.</span><br/><span> Noble holds mineral rights and/or exploration rights in 18,000</span><br/><span>hectares in the Timmins-Cochrane areas of Northern Ontario known as</span><br/><span>Project 81, ~2,215 hectares in Thomas Twp/Timmins, as well as an</span><br/><span>additional 20% interest in ~38,700 hectares in the Timmins area held</span><br/><span>by East Timmins Nickel. Project 81 hosts diversified drill-ready gold,</span><br/><span>nickel-cobalt and base metal exploration targets at various stages of</span><br/><span>exploration. Noble also holds ~4,600 hectares in the Nagagami</span><br/><span>Carbonatite Complex and its ~3,200 hectares in the Boulder Project</span><br/><span>both near Hearst, Ontario. ~3,700 hectares in the Buckingham Graphite</span><br/><span>Property, ~10,152 hectares in the Havre St Pierre Nickel, Copper, PGM</span><br/><span>property, and ~1,573 hectares in the Cere-Villebon Nickel, Copper, PGM</span><br/><span>property, ~569 hectare Uranium/Rare Earth property (Chateau), ~461</span><br/><span>hectare Uranium/Molybdenum property (Taser North), ~4,465 hectares REE</span><br/><span>Mehmet Property, and the ~3300 hectare Gull Lake REE Property all of</span><br/><span>which are in the Province of Quebec and the ~ 647 hectare  Chapiteau</span><br/><span>REE property in Labrador.</span><br/></p><p class=\"\"><br/><span>https://www.noblemineralexploration.com</span></p><p class=\"\"><span>Noble’s common shares trade on theTSX Venture Exchange under the symbol “NOB”.</span></p><p class=\"\"><span>Cautionary Statement:</span></p><p class=\"\"><span>Neither TSX Venture Exchange nor itsRegulation Services Provider (as that term is defined in the policiesof the TSX Venture Exchange) accepts responsibility for the adequacyor accuracy of this release. No stock exchange,securities commission or other regulatory authority has approved ordisapproved the information contained herein.</span></p><p class=\"\"><span>Contacts:</span></p><p class=\"\"><span>H. Vance White, President</span></p><p class=\"\"><span>Phone:        416-214-2250</span></p><p class=\"\"><span>Fax:        416-367-1954</span></p><p class=\"\"><span>Email:        info@noblemineralexploration.com</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_TnwsJkN5:0-noble-announces-results-of-2026-shareholder-meeting/",
            "pub_date": "2026-02-28 08:40:02",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3YX006:0",
            "title": "Taiwan markets closed on Friday for a holiday",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Taiwan's financial markets are closed on Friday, February 27, for a holiday, and will resume trade on Monday, March 2.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3YX006:0-taiwan-markets-closed-on-friday-for-a-holiday/",
            "pub_date": "2026-02-28 08:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:24fcb9ad43eed:0",
            "title": "Ichor Holdings CEO Sells 21,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Philip Ryan Barros Sr., Chief Executive Officer and Director of Ichor Holdings, Ltd., sold 21,000 ordinary shares at a weighted average price of $46.63 per share, totaling $979,230. Following the transaction, Barros directly owns 153,936 ordinary shares of the company. The sale occurred on February 26, 2026.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Barros Philip Ryan Sr.</span></td></tr><tr><td><span>Relationship</span></td><td><span>Chief Executive Officer</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$979,230</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1691537/000169153726000014/xslF345X05/wk-form4_1772238534.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1691537/000169153726000014/xslF345X05/wk-form4_1772238534.xml\" rel=\"nofollow\" target=\"_blank\">ICHOR HOLDINGS, LTD. [ ICHR ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:24fcb9ad43eed:0-ichor-holdings-ceo-sells-21-000-shares/",
            "pub_date": "2026-02-28 08:30:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S0N3XL04M:0",
            "title": "HHS Secretary Kennedy Appoints Two Physicians To CDC's Advisory Committee On Immunization Practices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KENNEDY APPOINTS TWO PHYSICIANS TO CDC’S ADVISORY COMMITTEE ON IMMUNIZATION PRACTICES</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SEAN G. DOWNING AND ANGELINA FARELLA APPOINTED TO CDC’S ADVISORY COMMITTEE ON IMMUNIZATION PRACTICES- HHS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S0N3XL04M:0-hhs-secretary-kennedy-appoints-two-physicians-to-cdc-s-advisory-committee-on-immunization-practices/",
            "pub_date": "2026-02-28 08:12:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011954:0",
            "title": "Unbowling For Dollars — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Connor Smith</span></p><p class=\"\"><span>Sweetgreen is trying to put a wrap on its salads — or at the very least, put its salads in a wrap. The fast-casual chain known for its high-end greens is rolling out wraps at some locations.</span></p><p class=\"\"><span>Handhelds are having a moment as consumers tire of so-called slop bowls, a term jokingly used to describe customizable grain-and-salad meals that have become staples of the corporate office lunch.</span></p><p class=\"\"><span>Sweetgreen needs a jolt. Its shares have tumbled 90% from their Nov. 19, 2021, closing high, according to Dow Jones Market Data. That was the day after the company's initial public offering. This past week, it reported its fourth consecutive quarterly decline in same-store sales.</span></p><p class=\"\"><span>Three wraps are now available in select markets: Classic Chicken Caesar, Chicken Jalapeño Ranch, and Chicken Salad Bacon Club. Barron's taste-testers found the Caesar wrap a solid lunch option. The Chicken Salad Bacon Club wrap had the right ratio of lettuce to avocado to chicken salad — although it leaned a bit on the salty side, likely a consequence of the bacon bits sprinkled inside. None of the taste-testers ordered the Jalapeño Ranch — estimated at 1,185 calories, it was deemed too hefty for the office lunch hour.</span></p><p class=\"\"><span>\"Substantial but not overwhelming,\" one Barron's staff taste-tester remarked about the Caesar wrap. Another tester appreciated how easy it was to eat. While salad bowls often feel endless, the wrap \"had a clear end in sight.\"</span></p><p class=\"\"><span>Write to Connor Smith at connor.smith@barrons.com</span></p><p class=\"\"><span>Last Week</span></p><p class=\"\"><span>Markets</span></p><p class=\"\"><span>Responding to the Supreme Court's tariff decision, President Donald Trump imposed global 10% tariffs for 150 days, then raised it to 15%, only to find implementation at 10% had already begun. Gold surged, the dollar and Bitcoin fell. Stocks, hit by another bout of artificial-intelligence jitters, were down but rallied on Tuesday. Trump defended his \"golden age\" economic policies at the State of the Union speech and warned Iran. Nvidia beat on earnings, but the stock slipped. Safe-haven Treasuries had their best month in a year, and January inflation rose. On the week, the Dow industrials fell 1.3%, the S&amp;P 500 0.4%, and the Nasdaq Composite 1%.</span></p><p class=\"\"><span>Companies</span></p><p class=\"\"><span>A Novo Nordisk experimental anti-obesity drug failed to outperform Eli Lilly's Zepbound. Denmark's Maersk and Switzerland's MSC took over two Panama ports. JPMorgan Chase CEO Jamie Dimon warned that some lenders were doing \"dumb things.\" A KKR-managed credit fund reported weak results. Payments company Block said it would cut head count by nearly half. Trump banned Anthropic from government use after the AI company refused to give in to the Pentagon over AI safety issues.</span></p><p class=\"\"><span>Deals</span></p><p class=\"\"><span>After Paramount Skydance raised its bid for Warner Bros. Discovery, Netflix walked away with a $2.8 billion breakup fee paid by Paramount... Citigroup agreed to sell $2.5 billion in shares, or 24%, of Mexican bank Banamax to investors, including General Atlantic, Blackstone, and the Qatar Investment Authority.</span></p><p class=\"\"><span>Next Week</span></p><p class=\"\"><span>Monday 3/2</span></p><p class=\"\"><span>The Institute for Supply Management releases both its Manufacturing and Services Purchasing Managers' Indexes for February. Consensus estimate for the Manufacturing PMI, released on Monday, is a 51.8 reading, about one point less than in January. The Services PMI, released on Wednesday, is expected to be 53.8, even with January's reading.</span></p><p class=\"\"><span>Tuesday 3/3</span></p><p class=\"\"><span>CrowdStrike Holdings and Target announce quarterly results on Tuesday, followed by Broadcom on Wednesday and Costco Wholesale on Thursday.</span></p><p class=\"\"><span>Friday 3/6</span></p><p class=\"\"><span>The Bureau of Labor Statistics releases the jobs report for February. Economists forecast a 60,000 increase in nonfarm payrolls, after a 130,000 gain in January. The unemployment rate is expected to remain unchanged at 4.3%. January's jobs growth was the largest since December of 2024, allaying fears about a weakening labor market. Federal Reserve governor Christopher Waller, who dissented in favor of an interest-rate cut at the Federal Open Market Committee's most recent meeting, pointed to strength in the latest jobs report in saying that a rate cut was \"close to a coin flip\" at the next FOMC meeting in mid-March.</span></p><p class=\"\"><span>The Numbers</span></p><p class=\"\"><span>58</span></p><p class=\"\"><span>Number of gigawatt hours of new energy storage added to the U.S. electric grid in 2025, a record.</span></p><p class=\"\"><span>1.25 M</span></p><p class=\"\"><span>Russian casualty estimates in the now five-year war in Ukraine, more than the U.S. casualties in World War II.</span></p><p class=\"\"><span>90%</span></p><p class=\"\"><span>The estimated percentage of high-end semiconductor chips that are manufactured in Taiwan.</span></p><p class=\"\"><span>1,800</span></p><p class=\"\"><span>The rough number of companies seeking refunds for tariffs since the Supreme Court decision.</span></p><p class=\"\"><span>Write to Robert Teitelman at bob.teitelman@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011954:0/",
            "pub_date": "2026-02-28 08:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011956:0",
            "title": "Solar Stocks Crashed This Week. Why the Problems Could Last. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Avi Salzman</span></p><p class=\"\"><span>Three solar stocks plunged more than 30% after reporting earnings this week — and a fourth fell 14% — in a sign that the industry's growing headaches are starting to hit financial statements. Tariffs are pinching margins, federal energy policies are a drag, and demand looks weaker than expected. There are no easy or immediate answers for those problems.</span></p><p class=\"\"><span>On Friday, residential solar developer Sunrun  fell 35%. Its decline followed washouts in solar manufacturer First Solar, and equipment companies Array Technologies and Shoals Technologies, which dropped 14%, 34%, and 31%, respectively, after reporting earnings earlier in the week.</span></p><p class=\"\"><span>The Invesco Solar exchange-traded fund fell 8% this week, marking its worst five-day performance since June.</span></p><p class=\"\"><span>The bad news comes after a few months of relative calm, and even optimism. Solar stocks had a surprisingly good run in 2025, despite losing key tax credits in the large tax bill Republicans passed last year. President Donald Trump's policies have been negative for most renewable players, but not as negative as feared: the tax bill allowed projects that had already begun construction to receive access to the credits available under prior law, for instance. While homeowners can't get federal credits for putting panels on their roofs, those that lease the panels can still benefit from tax breaks.</span></p><p class=\"\"><span>But the solar industry now faces a reckoning from the loss of federal support, consumer reticence, and an increase in costs.</span></p><p class=\"\"><span>Residential solar has a particularly bad demand problem. Energy research firm Wood Mackenzie sees installations falling 18% this year across the U.S. The slowdown appears to have already started: Sunrun, which leases panels to homeowners, added 17% fewer subscribers in the fourth quarter of 2025 than it did in the fourth quarter of 2024. The company's leases pay off over time as its customers pay off their bills on a monthly basis. But it's costing Sunrun more to add each new customer — and the net value of each new customer was down 30% in the quarter.</span></p><p class=\"\"><span>The company's guidance for 2026 was also underwhelming. Sunrun's executives appear to be bracing for \"a more prolonged period of market contraction,\" wrote Jefferies analyst Julien Dumoulin-Smith, who downgraded his rating on the shares to Hold from Buy.</span></p><p class=\"\"><span>Trump's tariffs are also starting to catch up to the industry. First Solar, Array, and Shoals all said tariffs hurt their profit margins.</span></p><p class=\"\"><span>First Solar, an industry bellwether because of its size and status as the largest U.S. manufacturer, has been having demand problems, too. Its backlog was down to 50.1 gigawatts at the end of last year, after starting the year at 68.5 gigawatts. The company had more \"de-bookings\" — including terminated or canceled contracts — than new bookings.</span></p><p class=\"\"><span>First Solar's fourth quarter marked the seventh straight quarter where First Solar's backlog declined sequentially, according to Raymond James analyst Bobby Zolper. \"With respect to 2026 and 2027 guidance, shipment volumes, sales, and [earnings before interest, taxes, depreciation, and amortization], all missed prior views by about 15%, with the stock down by a similar amount,\" Zolper wrote, rating the stock at Market Perform. \"We would prefer to wait out the near-term negatives.\"</span></p><p class=\"\"><span>Write to Avi Salzman at avi.salzman@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011956:0/",
            "pub_date": "2026-02-28 08:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011837:0",
            "title": "Paramount Issuing $47 Billion of Equity at Big Premium to Stock Price for Warner Bros. Deal — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Andrew Bary</span></p><p class=\"\"><span>Paramount Skydance received a big vote of confidence from its controlling shareholders, including the Ellison family, when they agreed to fully back an equity offering to help fund the company's deal for Warner Bros. Discovery at a big premium above Paramount's stock price.</span></p><p class=\"\"><span>Late Friday, Paramount outlined some of the financial highlights of its $110 billion deal for Warner Bros at $31 a share in cash. The deal values Warner Bros. equity at $81 billion, plus about $29 billion in assumed net debt.</span></p><p class=\"\"><span>One unanswered question until now has been the terms of Paramount's equity raise to help fund the deal.</span></p><p class=\"\"><span>The company said that it would issue $47 billion of equity--above a prior estimate of about $41 billion--at an offering price of $16.02 a share. That's a 19% premium above Paramount's closing stock price of $13.51 on Friday. The company's shares surged 21% Friday as investors reacted favorably to Paramount's victory in the takeover battle on Thursday, when Netflix dropped out of the bidding.</span></p><p class=\"\"><span>Paramount said the $47 billion deal consisting of class B shares is being \"fully backed\" by the Ellison family and Redbird Capital Partners, the current controlling shareholders in Paramount who now own about 70% of the company's 1.1 billion outstanding shares. The Ellison family is led by Oracle chairman and billionaire Larry Ellison and his son David, the Paramount CEO.</span></p><p class=\"\"><span>There also is a $54 billion debt financing commitment from a group of lenders.</span></p><p class=\"\"><span>Paramount said the equity may include \"other strategic and financial partners.\" The breakdown of the equity buyers doesn't appear to have been set yet.</span></p><p class=\"\"><span>Investors reacted favorably, with Paramount stock up 3% in after-hours trading to nearly $14 a share.</span></p><p class=\"\"><span>Paramount is set to issue 2.9 billion shares in the equity raise, lifting its share count to about 4 billion, Barron's estimates.</span></p><p class=\"\"><span>Big equity offerings often are done at a discount to the market price. That's why the Paramount equity sale is so notable and bullish.</span></p><p class=\"\"><span>Paramount said that existing Paramount holders will be able to participate in a rights offering to buy up to $3.25 billion of new class B shares at $16.02 a share, the same price at which the equity offering is being priced.</span></p><p class=\"\"><span>There now isn't incentive for Paramount holders to participate in that rights deal — but if the stock rallies, it could become attractive.</span></p><p class=\"\"><span>Paramount now has a thin public float of about 300 million shares, with the Ellisons and RedBird controlling about 800 million shares.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011837:0/",
            "pub_date": "2026-02-28 08:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011514:0",
            "title": "Trump Bars Anthropic From Federal Agencies and Hegseth Labels It a Supply Chain Risk. Here's Why. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Evie Liu and Al Root</span></p><p class=\"\"><span>President Donald Trump said on Friday that he is directing all federal agencies to phase out the use of technology developed by the artificial-intelligence company Anthropic, including its Claude models.</span></p><p class=\"\"><span>The announcement came amid an escalating dispute between the company and the Department of Defense. Trump's directive was issued shortly before the Pentagon's deadline for Anthropic to agree to broader military access to its systems.</span></p><p class=\"\"><span>After that deadline passed, Defense Secretary Pete Hegseth said he was designating Anthropic a supply chain risk.</span></p><p class=\"\"><span>Anthropic CEO Dario Amodei has refused to accede to Pentagon demands that would allow its AI tools to be used without the company's restrictions, particularly in scenarios involving lethal force, surveillance, or other high-stakes applications.</span></p><p class=\"\"><span>Anthropic didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Trump said in a social media post that most federal agencies must immediately cease using Anthropic's technology, and they would have a six-month window to remove the systems where they are already embedded.</span></p><p class=\"\"><span>Anthropic has reportedly won a contract last summer that's worth up to $200 million from the Defense Department, The Wall Street Journal reported last month.</span></p><p class=\"\"><span>Anthropic is a private company, so there is no publicly confirmed revenue figure for the firm. But Bloomberg has estimated that Anthropic's revenue run rate exceeded $9 billion at the end of 2025, which makes the loss of a $200 million contract trivial.</span></p><p class=\"\"><span>But the impact of Friday's moves by the U.S. leaders goes well beyond government contracts.</span></p><p class=\"\"><span>A \"supply-chain risk to national security,\" which Hegseth designated Anthropic, is typically applied to foreign companies. Rarely does the U.S. government label a major domestic company this way.</span></p><p class=\"\"><span>In the past, the Federal Communications Commission has named China's Huawei Technologies and ZTE Corporation as a national security risk to U.S. communications networks and supply chains.</span></p><p class=\"\"><span>Being designated a supply chain risk not only means no government contracts for Anthropic, defense contractors such as Lockheed Martin and Northrop Grumman also can't use Anthropic technology.</span></p><p class=\"\"><span>Neither company immediately responded to a request for comment about their relationship with Anthropic.</span></p><p class=\"\"><span>\"Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic,\" wrote Hegseth in the X post.</span></p><p class=\"\"><span>Traditional defense stocks might not react to the conflict. Investors should keep an eye on Palantir. It is responsible for implementing a lot of AI technology at the Pentagon and has collaborated with Anthropic recently.</span></p><p class=\"\"><span>Palantir didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Palantir stock was unfazed on Friday, rising 0.9% to $137.20, while the S&amp;P 500 and Dow Jones Industrial Average fell 0.4% and 1.1%, respectively. Palantir shares were down 0.2% in after-hours trading.</span></p><p class=\"\"><span>The Anthropic conflict could open the door for other AI labs — notably OpenAI, Google's Gemini, and Elon Musk's xAI — to gain additional business with the defense industry.</span></p><p class=\"\"><span>Last year, OpenAI was awarded a contract worth up to $200 million to \"develop prototype frontier AI\" tools for military and national security applications. xAI was recently acquired by SpaceX, which already does a lot of business with the U.S. military and NASA.</span></p><p class=\"\"><span>But they will face the same discussions over terms for classified use of their models. While other AI labs' relationship with the government have not yet escalated to a public dispute, employees at OpenAI and Google have already protested or signed petitions opposing unrestricted military use of their companies' AI tools.</span></p><p class=\"\"><span>Write to Evie Liu at evie.liu@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011514:0/",
            "pub_date": "2026-02-28 08:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:e4fd58fc43986:0",
            "title": "Tesla Director Kathleen Wilson-Thompson Sells Over 25,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Tesla Director Kathleen Wilson-Thompson sold a total of 25,731 shares of common stock on February 25, 2026, under a Rule 10b5-1 trading plan. The transactions were executed at weighted average prices ranging from $412.46 to $418.888, resulting in a total sale amount of $10,692,813. Following these transactions, Wilson-Thompson directly owns 19,669 shares of Tesla. Each sale's price was a weighted average, indicating multiple transactions at varying prices within specified ranges.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Wilson-Thompson Kathleen</span></td></tr><tr><td><span>Relationship</span></td><td><span>Director</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$10,692,813</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1331680/000110465926021746/xslF345X05/tm267481-1_4seq1.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1331680/000110465926021746/xslF345X05/tm267481-1_4seq1.xml\" rel=\"nofollow\" target=\"_blank\">Tesla, Inc. [ TSLA ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:e4fd58fc43986:0-tesla-director-kathleen-wilson-thompson-sells-over-25-000-shares/",
            "pub_date": "2026-02-28 08:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:992297758ecea:0",
            "title": "Axsome Therapeutics Executives Sell Shares Worth Over $9.7 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Axsome Therapeutics has seen significant stock transactions by its executives, as reported in recent SEC Form 4 filings. Chief Operating Officer Mark L. Jacobson sold 35,378 shares of common stock on February 26, 2026, at a weighted average price of $161.88 per share, totaling $5,726,990. Following this transaction, Jacobson no longer directly owns any shares in the company. The sale was conducted under a pre-approved 10b5-1 plan following the exercise of stock options.</span></p><p class=\"\"><span>Director Mark Coleman also executed a sale of 25,000 shares of Common Stock on the same day, at a weighted average price of $161.11 per share, amounting to $4,027,750. After the sale, Coleman's direct ownership stands at 47,140 shares, with an additional 403,856 shares held indirectly through an entity with voting and dispositive power.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th><span>Reporter Name</span></th><th><span>Relationship</span></th><th><span>Type</span></th><th><span>Amount</span></th><th><span>SEC Filing</span></th></tr></thead><tbody><tr><td><span>Jacobson Mark L.</span></td><td><span>Chief Operating Officer</span></td><td><span>Sell</span></td><td><span>$5,726,990</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1805812/000119312526083586/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr><tr><td><span>Coleman Mark</span></td><td><span>Director</span></td><td><span>Sell</span></td><td><span>$4,027,750</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1658379/000119312526083587/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:992297758ecea:0-axsome-therapeutics-executives-sell-shares-worth-over-9-7-million/",
            "pub_date": "2026-02-28 08:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:f269a0e18094b:0",
            "title": "Crypto VC Paradigm expands into AI, robotics with $1.5B fund: WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Crypto investment firm Paradigm is seeking to raise $1.5 billion for a new fund that will invest in companies in AI, robotics and other frontier technologies, according to the Wall Street Journal. </span></p><p class=\"\"><span>Paradigm will continue to invest in crypto companies, according to sources familiar with the situation, but it will use its existing technical investment team to look at deals in frontier tech companies, they said. </span></p><p class=\"\"><span>San Francisco–based Paradigm has $12.7 billion in assets under management, according to the latest regulatory filings. </span></p><p class=\"\"><span>It launched its flagship $2.5 billion fund in November 2021, which was the largest crypto fund in history at the time. It publicly announced its third fund in 2024 — an $850 million venture fund focused on early-stage crypto projects. </span></p><p class=\"\"><span>According to the WSJ’s sources, the firm’s managers decided they didn’t want to be restricted in ways that could cause them to miss out on attractive deals. </span></p><p class=\"\"><span>There is also overlap between crypto and AI, such as agentic payments, or transactions made by autonomous AI agents, the person said. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Paradigm exploring AI as early as 2023</span></strong></p><p class=\"\"><span>Paradigm acknowledged it had been “tinkering” with AI and its convergence with crypto as early as three years ago. </span></p><p class=\"\"><span>In 2023, Paradigm was seen removing Web3 and crypto-specific language from its website, prompting some speculators to suggest it was already pivoting from crypto to AI. </span></p><p class=\"\"><span>Matt Huang, the co-founder and managing partner of Paradigm, denied at the time that the website changes reflected a shift away from crypto, but acknowledged that the team had been exploring AI.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1083.977900552486px;aspect-ratio:1.8066298342541436\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:f269a0e18094b-e73a5f89056a622fd1f4271a9a74d47e-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:f269a0e18094b-e73a5f89056a622fd1f4271a9a74d47e-resized.webp\" style=\"background-color:#f0f1f1\"/></picture></div></button></figure><p class=\"\"><span>In a lengthier tweet weeks later, Huang said that while “we’ve never been more excited about crypto and continue to invest across all stages,” the “developments in AI are too interesting to ignore.” </span></p><p class=\"\"><span>“It seems trendy to frame crypto vs AI as a zero-sum competition. But we don’t buy it. Both are interesting and will have plenty of overlap. We’re excited to continue exploring,” he said. </span></p><p class=\"\"><span>Earlier this month, Paradigm and OpenAI released EVMbench, a new benchmark evaluating how different AI models can detect and patch security vulnerabilities found in smart contracts. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI made up more than half of all VC funding in 2025</span></strong></p><p class=\"\"><span>In 2025, venture capital investments in AI firms amounted to $258.7 billion, accounting for 61% of all VC investment and doubling its share from 2022, according to OECD. </span></p><p class=\"\"><span>VC funding for generative AI firms made up 14% of all AI venture capital investments, with firms in the United States attracting the largest share of VC funding. </span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>AI Eye: </span></strong></em><span>IronClaw rivals OpenClaw, Olas launches bots for Polymarket </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:f269a0e18094b:0-crypto-vc-paradigm-expands-into-ai-robotics-with-1-5b-fund-wsj/",
            "pub_date": "2026-02-28 08:02:10",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:04039556cc05b:0",
            "title": "Key facts: Ethereum Aims Above $2,000; $8.72B Options Expire; Taker Ratio at 0.99",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>In late February 2026, Ethereum (ETH) aims to stay above $2,000. After dipping to $1,980, it rebounded, previously rising 11% to a ten-day high of $2,148.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:909aba73e094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Ethereum options worth over $8.72 billion are expiring, with 478,992 contracts valued at about $975 million, highlighting a major share of the crypto market's open interest.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/beincrypto:c702f1151094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Ethereum's Taker Buy Sell Ratio on Binance is now about 0.99, up from below 1. Daily spikes above 1.12 indicate rising buying activity, shifting market dynamics.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:3ef4aa9ac094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:04039556cc05b:0-key-facts-ethereum-aims-above-2-000-8-72b-options-expire-taker-ratio-at-0-99/",
            "pub_date": "2026-02-28 08:03:09",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:27406f7fcda3d:0",
            "title": "Key facts: XRP Leads Altcoin ETFs; XRP Ledger Flaw Fixed; Ripple Boosts XRPL Funding",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>XRP has attracted about 50% of new capital in altcoin ETFs, while Bitcoin and Ethereum have experienced notable outflows recently.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:be88048a2094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>The XRP Ledger Foundation fixed a serious flaw in the signature-validation logic of XRP Ledger, preventing potential unauthorized transactions from victim accounts. No funds were compromised.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/cointelegraph:b3620a283094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Ripple plans to boost XRP Ledger (XRPL) funding, focusing on DeFi, asset tokenization, payments, and infrastructure to drive real-world adoption and improve XRP's utility.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/invezz:cbe0047c9094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:27406f7fcda3d:0-key-facts-xrp-leads-altcoin-etfs-xrp-ledger-flaw-fixed-ripple-boosts-xrpl-funding/",
            "pub_date": "2026-02-28 08:03:34",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0705ed0add1aa:0",
            "title": "Key facts: Long-term Bitcoin holders sell off; $30,000 drop warned; ETFs gain $1B",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Long-term Bitcoin holders have sold more in the past three months than since January 2024, contributing to the recent price drop attributed to significant selling activity.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/cointelegraph:94e037652094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Analyst Willy Woo warned Bitcoin could drop to $30,000 amid worsening macro conditions, with $16,000 as key support. Current bearish sentiment may lead to sideways trading before a rebound.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:f8de2c6d7094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/u_today:c5f30e653094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li><li class=\"listItem-bmN0_SHH\"><span>U.S. spot Bitcoin ETFs gained over $1 billion in net inflows this week, peaking at $506.51 million. The iShares Bitcoin Trust ETF led with $276 million, while others saw outflows.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/cointelegraph:2ed6b21dd094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">4</span></a><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/dpa_afx:d697a67b78b34:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">5</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:0705ed0add1aa:0-key-facts-long-term-bitcoin-holders-sell-off-30-000-drop-warned-etfs-gain-1b/",
            "pub_date": "2026-02-28 08:03:34",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b33cd9b868e60:0",
            "title": "Key facts: Aave reaches $1 trillion in lending; Mantle deployment hits $800M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Aave has processed over $1 trillion in total lending, becoming the first DeFi protocol to achieve this. The platform currently secures over $27 billion in user funds.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:c5ff3c0f9094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Aave and Mantle's mainnet deployment surpassed $800 million on February 27, 2026, just two days after hitting $575 million, driven by increased supply and borrowing in the Mantle Ecosystem.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/chainwire:038e99079094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:b33cd9b868e60:0-key-facts-aave-reaches-1-trillion-in-lending-mantle-deployment-hits-800m/",
            "pub_date": "2026-02-28 08:03:34",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN1AY:0",
            "title": "Bolivian military plane crashes in El Alto near capital La Paz",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>A Bolivian Air Force Hercules aircraft crashed on Friday evening onto a busy avenue amid inclement weather in the city of El Alto, near Bolivia's capital La Paz, according to television media reports.</span></p><p class=\"\"><span>The aircraft was transporting new banknotes to the interior of the country, local media station Unitel said, citing the Bolivian Ministry of Defense. </span></p><p class=\"\"><span>Social media footage showed chaotic scenes of people flocking to the scene of the crash, appearing to pick up money that lay strewn on the ground following the accident. Local authorities on the scene were warding off people using water hoses. Reuters was unable to identify the images. </span></p><p class=\"\"><span>Authorities have not yet confirmed injuries or fatalities. Bolivia's central bank was set to address reporters later on Friday evening. </span></p><p class=\"\"><span>The El Alto International Airport was temporarily closed following the crash, national airline Boliviana de Aviacion said in a statement, which said the aircraft involved in the accident did not belong to its fleet. </span></p><p class=\"\"><span>Video broadcast on local media showed that the aircraft was severely damaged, as were a number of vehicles along the avenue where the crash took place. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN1AY:0-bolivian-military-plane-crashes-in-el-alto-near-capital-la-paz/",
            "pub_date": "2026-02-28 08:03:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:39fc81281094b:0",
            "title": "Polestar Investors Contemplate New And Upcoming Vehicle Lineup’s Strength To Spur A Turnaround",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The Polestar 5 is currently expected to start deliveries in the summer of 2026, followed by a new variant of the Polestar 4. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>In 2025, Polestar recorded retail sales of 60,119 cars, a growth of 34% compared to 2024, marking its best year ever.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Earlier this month, the company also announced a $400 million equity investment by Feathertop Funding Limited.</span></li></ul></span></div><span><p class=\"\"><span>Polestar Automotive (PSNY) garnered retail attention on Friday as traders contemplated whether the company is on the cusp of a turnaround with its new and upcoming lineup.</span></p><p class=\"\"><span>Shares of the company closed up 20% at market close on Friday.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>A Stocktwits user expressed optimism for the carmaker’s upcoming offerings, noting that the company’s Polestar 4 is “a beauty.”</span></p><p class=\"\"><span>https://www.stocktwits.com/derrdavid/message/646170795</span></p><p class=\"\"><span>Another user dismissed the “random hype and no actual numbers” and announced a new short position.</span></p><p class=\"\"><span>https://www.stocktwits.com/IrenGlazer69/message/646164349</span></p><p class=\"\"><span>Overall, retail sentiment around PSNY jumped from ‘bearish’ to ‘extremely bullish’ over the past 24 hours, while message volume increased from ‘low’ to ‘extremely high’ levels.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Polestar’s Plans Ahead</span></strong></p><p class=\"\"><span>The EV maker said earlier this month that it has four new cars planned in the next three years, including the Polestar 5 four-door, grand tourer, and the Polestar 7 compact, premium SUV. The company also plans to launch a new variant of its current best-seller, the Polestar 4, and a next generation of its Polestar 2 sedan.</span></p><p class=\"\"><span>The Polestar 5 will be the first of the four to be rolled out, with deliveries expected to start from summer 2026. Polestar 4 will follow with deliveries, now slated in the fourth quarter of 2026.</span></p><p class=\"\"><span>Polestar 2 and Polestar 7 are slated for launch in 2027 and 2028, respectively.</span></p><p class=\"\"><span>“We are targeting the heart of the EV market, where customer demand and profit pools are high. Combined with our continued retail sales network expansion and a growing customer base, we are setting the foundations for profitable growth and operational improvement,” CEO Michael Lohscheller said. The company also said that it now expects low double-digit volume growth in 2026.</span></p><p class=\"\"><span>In 2025, Polestar </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/polestar-shares-edge-up-after-hours/cmU2tLlR43G\" rel=\"nofollow\" target=\"_blank\">recorded</a><span> retail sales of 60,119 cars, a growth of 34% compared to 2024, marking its best year ever.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Equity Investment</span></strong></p><p class=\"\"><span>Earlier this month, the company announced a $400 million equity investment by Feathertop Funding Limited, a special purpose vehicle consolidated to Sumitomo Mitsui Banking Corporation, and Standard Chartered Bank (Hong Kong) Limited. Polestar is majority-owned by China’s Zhejiang Geely Holding Group and its CEO, and also leverages its manufacturing.</span></p><p class=\"\"><span>While its vehicles are currently manufactured in North America and Asia, Polestar is looking to expand its manufacturing footprint to Europe as well. The company intends to make its Polestar 7 compact SUV at a Volvo Cars factory in Kosice, Slovakia.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/PSNY\" rel=\"nofollow\" target=\"_blank\">PSNY stock</a><span> has dropped 30% over the past 12 months.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:39fc81281094b:0/",
            "pub_date": "2026-02-28 08:06:21",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011912:0",
            "title": "Canada Says OpenAI's Safety Pledges Lack Details — 2nd Update",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Paul Vieira</span></p><p class=\"\"><span>OTTAWA--OpenAI's pledges to strengthen security protocols are missing key details including how they will be implemented, Canada's minister in charge of artificial intelligence said.</span></p><p class=\"\"><span>Minister for Artificial Intelligence Evan Solomon is also demanding greater clarity on OpenAI's operations, including how troubling interactions with the ChatGPT chatbot are escalated, and how privacy considerations are balanced with public safety.</span></p><p class=\"\"><span>Solomon issued a statement Friday, roughly 24 hours after OpenAI wrote to the minister and pledged to bolster safety protocols. OpenAI said that with the changes, it would have referred the account belonging to Jesse Van Rootselaar to police if it was discovered today. Police have identified Van Rootselaar as the suspect in a deadly school shooting in Tumbler Ridge, British Columbia that left eight dead and dozens injured.</span></p><p class=\"\"><span>The Wall Street Journal has reported that OpenAI considered alerting Canadian law-enforcement authorities about interactions between Van Rootselaar and ChatGPT. OpenAI shut down Van Rootselaar's ChatGPT account after detecting a violation of its policy but didn't notify police.</span></p><p class=\"\"><span>Solomon said he's also scheduled to speak to OpenAI Chief Executive Sam Altman next week. A spokesman for Solomon said the timing and location have yet to be determined.</span></p><p class=\"\"><span>A meeting with Solomon marks the second senior Canadian politician Altman has agreed to speak with. British Columbia Premier David Eby said he's also set to speak to Altman, and Eby added he wants the CEO to be cognizant of the pain that families in Tumbler Ridge are feeling.</span></p><p class=\"\"><span>A spokesperson for OpenAI confirmed that Altman has scheduled meeting with both Messrs. Solomon and Eby.</span></p><p class=\"\"><span>Online platforms have long debated how to balance questions of privacy with public safety in their decisions to alert law enforcement about certain users. That debate has now pulled in the AI companies that power the chatbots to which people are confiding the most intimate details of their private thoughts and lives.</span></p><p class=\"\"><span>In its letter to Solomon, OpenAI divulged that Van Rootselaar had a second ChatGPT account. Among OpenAI's pledges is a commitment to strengthen detection systems to prevent efforts to evade safeguards.</span></p><p class=\"\"><span>Taylor Owen, a public-policy professor at Montreal's McGill University with a specialty in media and ethics, said OpenAI has now publicly acknowledged its previous safety protocols were inadequate, and that Van Rootselaar's ability to create a second account discloses a previously unknown system error.</span></p><p class=\"\"><span>\"It means the threshold that governed the original decision, the one that resulted in Canadian police not being contacted about violent content flagged by the company's own systems, was one the company itself now considers inadequate,\" Owen said. OpenAI's pledges, he added, follows a pattern among social-media platforms \"where product safety changes come only after an incident forces them.\"</span></p><p class=\"\"><span>Solomon said he will press Altman about ensuring the pledges are fully implemented and enforced.</span></p><p class=\"\"><span>\"We will be seeking further clarity on how human review is conducted and whether Canadian context and best practices are appropriately embedded in those decisions,\" the minister said.</span></p><p class=\"\"><span>Solomon added that intends to meet other major digital platforms in the coming weeks to advocate for a consistent approach on protecting youths and the public.</span></p><p class=\"\"><span>Write to Paul Vieira at paul.vieira@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011912:0-canada-says-openai-s-safety-pledges-lack-details-2nd-update/",
            "pub_date": "2026-02-28 07:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACS7kWFQa:0",
            "title": "First Commerce Bancorp, Inc. Announces Conclusion of Tender Offer for its Common Stock",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>LAKEWOOD, NJ / ACCESS Newswire / February 27, 2026 / First Commerce Bancorp, Inc., (OTCID:CMRB) (the \"Company\") today announced the conclusion of its previously initiated tender offer to repurchase up to 3,000,000 shares of the Company's common stock (\"Shares\") at a purchase price of $7.00 per Share (the \"Tender Offer\"). The conclusion of the Tender Offer has occurred with the close of business today, Friday, February 27, 2026, at 5:00 P.M. EST.</span></p><p class=\"\"><span>Performance Trust Capital Partners, LLC, served as Deal Manager for the Tender Offer. Computershare, Inc. served as the Depositary for the Tender Offer while Georgeson, LLC acted as the Company's Information Agent for the Tender Offer.</span></p><p class=\"\"><span>Based on a preliminary count by the Depository and Deal Manager for the Tender Offer, a total of 2,974,738 shares have been validly tendered and not properly withdrawn pursuant to the tender offer, representing approximately 14.9% of the outstanding Shares. All Shares validly tendered cannot be withdrawn and no additional tenders will be accepted.</span></p><p class=\"\"><span>This press release is for informational purposes only and is neither an offer to purchase nor a solicitation of an acceptance of securities. No offer, solicitation, purchase, or sale will be made in any jurisdiction in which such offer, solicitation, or sale would be unlawful. The Tender Offer is being made solely pursuant to the terms and conditions set forth in the Offer to Purchase dated January 28, 2026 (the \"Offer to Purchase\"), and accompanying materials. Shareholders should read such Offer to Purchase and related materials carefully and in their entirety because they contain important information, including the various terms and conditions of the tender offer.</span></p><p class=\"\"><span>This press release contains \"forward-looking statements\". Forward-looking statements contain words such as \"anticipate,\" \"believe,\" \"can,\" \"would,\" \"should,\" \"could,\" \"may,\" \"predict,\" \"seek,\" \"potential,\" \"will,\" \"estimate,\" \"target,\" \"plan,\" \"project,\" \"continuing,\" \"ongoing,\" \"expect,\" \"intend\" or similar expressions that relate to the Company's strategy, plans or intentions. Forward-looking statements involve certain important risks, uncertainties and other factors, any of which could cause actual results to differ materially from those in such statements. Such factors include, without limitation, the \"Risk Factors\" referenced in the Offer to Purchase and the following additional factors: ability to execute our business strategy; business and economic conditions; economic, market, operational, liquidity, credit and interest rate risks associated with the Company's business; effects of any changes in trade, monetary and fiscal policies and laws; effects of inflation as well as interest rate, securities market and monetary supply fluctuations; changes in consumer spending, borrowings and savings habits; the Company's ability to achieve organic loan and deposit growth and the composition of such growth; changes in sources and uses of funds; increased competition in the financial services industry; the effect of changes in accounting policies and practices; the share price of the Company's stock; ability to maintain or increase market share and control expenses; costs and effects of changes in laws and regulations and of other legal and regulatory developments; technological changes; the timely development and acceptance of new products and services; ability to implement or improve operational management and other internal risk controls and processes and reporting system and procedures; changes in estimates of future loan reserve requirements based upon the periodic review thereof under relevant regulatory and accounting requirements; widespread natural and other disasters, dislocations, political instability, acts of war or terrorist activities, cyberattacks or international hostilities; impact of reputational risk; and success at managing the risks involved in the foregoing items. The Company can give no assurance that any goal or plan or expectation set forth in forward-looking statements can be achieved and readers are cautioned not to place undue reliance on such statements. The forward-looking statements are made as of the date of this press release, and the Company does not intend, and assumes no obligation, to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events or circumstances, except as required by applicable law.</span></p><p class=\"\"><span>Press Contact:</span></p><p class=\"\"><span>Donald Mindiak</span></p><p class=\"\"><span>First Commerce Bancorp, Inc.</span></p><p class=\"\"><span>Lakewood, NJ 08701</span></p><p class=\"\"><span>(732) 364-0032</span></p><p class=\"\"><span>dmindiak@firstcommercebk.com</span></p><p class=\"\"><span>http://firstcommercebk.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> First Commerce Bancorp, Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACS7kWFQa:0/",
            "pub_date": "2026-02-28 08:00:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:209b0cb5b884b:0",
            "title": "Tango Therapeutics Officer Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Crystal Adam, President of R&amp;D at Tango Therapeutics, sold 54,345 shares of common stock on February 25, 2026, at a weighted average price of $12.7741 per share, totaling $694,208. Following the transaction, Adam directly owns 132,873 shares of the company. The sale was conducted under a Rule 10b5-1 trading plan adopted on October 27, 2025.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Crystal Adam</span></td></tr><tr><td><span>Relationship</span></td><td><span>President, R&amp;D</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$694,208</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1825445/000119312526083579/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1825445/000119312526083579/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Tango Therapeutics, Inc. [ TNGX ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:209b0cb5b884b:0-tango-therapeutics-officer-sells-shares/",
            "pub_date": "2026-02-28 08:00:02",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2CR:0",
            "title": "Who killed Swedish Prime Minister Olof Palme? Amateur sleuths ask AI for help",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Swedish Prime Minister Olof Palme was killed in 1986</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Identity of his murderer still a mystery</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>AI is now being used to look for evidence and clues</span></li></ul></span></div><span><p class=\"\"><span>By Simon Johnson</span></p><p class=\"\"><span>    Forty years after Prime Minister Olof Palme was shot dead on a Stockholm street, Swedes are still wondering whether the murder was the work of a lone gunman or a political assassination.</span></p><p class=\"\"><span>Decades later, the murder remains unsolved, and amateur detectives have turned to Artificial Intelligence in the hope of identifying new leads and persuading authorities to reopen an investigation that was shut down in 2020.</span></p><p class=\"\"><span>The team on a crime podcast called Spår (\"Track\") has started investigating leading theories about the murder with an AI engine developed for them by Swedish and Belgian software firms.</span></p><p class=\"\"><span>\"This is about the murder of our leader, a democratically elected prime minister. You can't just close the case,\" said Anton Berg, a co-presenter of the podcast, which intends to present the findings using AI gradually. </span></p><p class=\"\"><span>So far, Spår has announced no breakthrough in the case. But,  pointing to the ability of AI tools to learn and improve, Berg said: \"Our hope is that this tool will get so advanced that we can open up the investigation again.\"   </span></p><p class=\"\"><span>PARADIGM SHIFT</span></p><p class=\"\"><span>Palme was shot dead at close range on his way home from a visit to the cinema on February 28, 1986. </span></p><p class=\"\"><span>Over the years, the finger of blame has been pointed at South Africa's apartheid-era security services, Kurdish freedom fighters, right-wing extremists within the Swedish state and various lone gunmen. </span></p><p class=\"\"><span>One man was convicted, but later freed, and prosecutors closed the case in 2020. A review last year confirmed the case would remain shut despite the main suspect being absolved. </span></p><p class=\"\"><span>\"We don't know any more than we knew on the day of the murder, essentially,\" said Gunnar Wall, who has written several books on the Palme killing.</span></p><p class=\"\"><span>On Saturday, the 40th anniversary of Palme's death, protesters will hand in a petition to parliament urging authorities to reopen the case. Such calls could get a boost if amateur sleuths are right in believing AI can now do what decades of police work failed to achieve.</span></p><p class=\"\"><span>The AI engine developed for the Spår crime podcast mimics a team of human investigators to probe evidence, evaluate findings and identify gaps, but can do so much more rapidly. </span></p><p class=\"\"><span>It can analyse the case's around 30,000 publicly available digital documents in less than a second. Otherwise the entire case files - about 500,000 pages - would take a decade just to read, police say. </span></p><p class=\"\"><span>From fingerprinting to DNA profiling, forensic technology has reshaped criminal investigations. AI could be another game-changer, experts say.</span></p><p class=\"\"><span>In 2018, AI-assisted DNA analysis helped Los Angeles police  catch Joseph DeAngelo, known as the Golden State Killer, who had murdered 13 people and raped at least 50 people many years  earlier. </span></p><p class=\"\"><span>\"AI is a paradigm shift,\" said Lena Klasen, the former head of Sweden's National Forensic Centre and now Adjunct Professor in Digital Forensics at Linkoping University.</span></p><p class=\"\"><span>\"It is going to change how we work in the way that computers did. But this is bigger.\"</span></p><p class=\"\"><span>CAN AI PROVIDE ANSWERS?</span></p><p class=\"\"><span>Swedish police declined to say whether they had used AI in the Palme case, which will not be reopened unless there is good reason to believe that an investigation would lead to an arrest and conviction. </span></p><p class=\"\"><span>Even with its data-crunching power, AI may struggle to find Palme's killer. </span></p><p class=\"\"><span>Case files are often heavily redacted and vast quantities of material is still unpublished, said Simon Lundell, part of a separate group of amateur investigators using AI in the hope of catching Palme's killer.</span></p><p class=\"\"><span>Gaining access to police files takes time, with only around 1,000 pages per year released. At this rate, it would take hundreds of years to be able to review all the information.</span></p><p class=\"\"><span>Despite such problems, \"our goal is to solve the murder,\" Lundell said.  </span></p><p class=\"\"><span>There is also no guarantee that the evidence needed to solve the Palme case even exists. Three public commissions concluded that police bungled the early investigation. Documents were lost and leads were not followed up.</span></p><p class=\"\"><span>\"There is no technique that can help with information that isn't there, and that is a big part of the problem that there are gaps in the information,\" said Lennart Gune, Director of Prosecution at the Swedish Prosecution Authority.</span></p><p class=\"\"><span>The use of AI in investigations also comes with some concerns. The Golden State Killer case caused a fierce debate about privacy after millions of people had their DNA data scanned without their explicit consent.</span></p><p class=\"\"><span>In 2025, Sweden proposed a law that will allow police to use real-time, AI-powered face-recognition as a tool to fight gang crime, but its use will be limited over concerns about privacy and AI surveillance. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2CR:0-who-killed-swedish-prime-minister-olof-palme-amateur-sleuths-ask-ai-for-help/",
            "pub_date": "2026-02-28 08:00:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Tnw41Rnvf:0",
            "title": "Vault Strategic Announces Company Attendance At Prospector & Developers Association Conference (PDAC) And Appointment Of Quinn Field-Dyte To CEO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><p class=\"\"><span>Vancouver, British Columbia -February 27, 2026 – TheNewswire – VaultStrategic Mining Corp. </span><span> </span><span> (FSE:M85)</span><br/><span>(\"VAULT\" or the \"Company\") announces it has appointed Mr. Quinn Field-Dyte to the roleof Chief Executive Officer (\"CEO\") in addition to his ongoingresponsibility to the Board of Directors.</span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>“I am honored to step into therole of Chief Executive Officer of Vault Strategic Mining at a time ofunprecedented strength across global commodity markets and what Ibelieve is a pivotal moment in the Company’s evolution. The world israpidly repricing the strategic importance of critical minerals, andVault is uniquely positioned within that landscape. I look forward toembracing this new challenge as CEO while continuing to fulfill myresponsibilities to the Board of Directors. Said Mr. Field-Dyte, CEO &amp; Director ofVault Strategic Mining Corp. On behalf of the Company, I would also like to sincerely thank Mr.Horsley for his leadership and dedication. His contributions to VaultStrategic Mining have been invaluable, and we wish him continuedsuccess in his future endeavors. Together, we remain focused ondisciplined execution, strategic growth, and unlocking long-term valuefor our shareholders.”</span></p><p class=\"\"><span>Quinn Field-Dyte is a senior capital markets and miningexecutive with over two decades of experience in public companyoperations, mergers and acquisitions, corporate finance, and boardgovernance within the natural resources sector. His career has beencentered on supporting exploration and development stage miningcompanies through disciplined capital allocation, strategic growthinitiatives, and effective engagement with public markets.</span></p><p class=\"\"><span>Mr. Field-Dyte has extensive experience navigating thefull lifecycle of public mining companies, including corporatestructuring, financings, asset acquisitions and divestitures,regulatory compliance, and shareholder communications. He has played akey role in evaluating mineral assets, advancing explorationstrategies, and aligning corporate objectives with market conditionsand long-term value creation.</span></p><p class=\"\"><span>At Vault Strategic Mining Corp., Mr. Field-Dytecontributes his deep expertise in corporate strategy, financialoversight, and governance. He is actively involved in guiding theCompany’s focus on historically advanced mining assets across NorthAmerica, supporting disciplined exploration planning, capital marketsstrategy, and corporate development initiatives aligned with criticaland strategic mineral opportunities. Earlier in his career, Mr.Field-Dyte spent several years as an investment adviser, providing himwith a strong foundation in financial analysis, risk management, andinvestor relations. This background continues to inform his practical,market-aware approach to decision-making at the board level.</span></p><p class=\"\"><span>Mr. Field-Dyte studied at Capilano University andLangara College. He is recognized for his strong understanding ofpublic markets, his ability to execute complex transactions, and hiscommitment to building shareholder value through prudent managementand strategic focus within the mining sector.</span></p><p class=\"\"><span>The Company has accepted Mr. Robert “Nick” Horsleyresignation from the Board of Directors and CEO position effectiveimmediately. Vault wishes to thank him for his contributions to VaultStrategic Mining Corp. and wishes him all the best in his futureendeavors. </span></p><p class=\"\"><span>Furthermore, the Company announces that Vault’s Management will attend the upcomingProspectors and Developers Association of Canada (\"PDAC\")conference to be held March 1 – 4, 2026, at the Metro TorontoConvention Centre, Toronto, Canada.</span></p><p class=\"\"><span>Vault’s team members are happy to accept requests formeetings by current or potential investors. Please schedule a meetingby email (info@vaultstrategic.com) or phone (604.343.4338).</span></p><p class=\"\"><span>Restricted Stock Units(“RSUs”)</span></p><p class=\"\"><span>Furthermore, the Company announces that it has issued1,180,000 restricted RSUs to certain directors, officers andconsultants of the Company pursuant to its Omnibus Equity IncentivePlan. The RSUs will vest in twelve (12) months from the date ofissuance and will be settled in common shares of the Company. The RSUsare subject to the terms and conditions of the Omnibus EquityIncentive Plan.</span></p><p class=\"\"><span>About Vault Strategic MiningCorp.</span></p><p class=\"\"><span>Vault Strategic Mining Corp. is a North Americanresource company focused on the acquisition and advancement ofstrategic and critical mineral projects located in top-tier miningjurisdictions. The Company emphasizes historical and underexploredassets with potential for value creation through modern explorationand disciplined development.</span></p><p class=\"\"><span>Vault Strategic Mining Corp. trades on the TSX Venture</span><br/><span>Exchange </span><span>, OTC Markets </span><span>, and the Frankfurt</span><br/><span>Stock Exchange (FSE: M85).</span></p><p class=\"\"><span>On behalf of the Board:</span></p><p class=\"\"><span>Vault Strategic Mining Corp. </span></p><p class=\"\"><span>\"QuinnField-Dyte\"</span></p><p class=\"\"><span>Chief Executive Officer andDirector</span></p><p class=\"\"><span>Tel: 604.343.4338 | Email:info@vaultstrategic.com</span></p><p class=\"\"><span>ANY SECURITIES REFERRED TO HEREINWILL NOT BE REGISTERED UNDER THE U.S. SECURITIES ACT OF 1933 (THE\"1933 ACT\") AND MAY NOT BE OFFERED OR SOLD IN THE UNITEDSTATES OR TO A U.S. PERSON INTHE ABSENCE OF SUCH REGISTRATION OR AN EXEMPTION FROM THE REGISTRATIONREQUIREMENTS OF THE 1933 ACT.</span></p><p class=\"\"><span>NOT FOR DISTRIBUTION TO U.S. NEWSWIRESERVICES OR FOR DISSEMINATION IN THE UNITED STATES. ANY FAILURE TOCOMPLY WITH THIS RESTRICTION MAY CONSTITUTE A VIOLATION OF U.S.SECURITIES LAW.</span></p><p class=\"\"><span>Neither TSXVenture Exchange nor its Regulation Services Provider (as that term isdefined in policies of the TSX Venture Exchange) acceptsresponsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><span>Disclaimer forForward-Looking Information</span></p><p class=\"\"><span>This release includesforward-looking statements regarding DIA, and the Letain Project,which may include, but is not limited to, statements with respect tothe completion of the acquisition of the Letain Project, and theability to obtain regulatory approvals, and other factors. Often, butnot always, Forward-looking statements can be identified by the use ofwords such as \"plans\", \"is expected\",\"expects\", \"scheduled\", \"intends\",\"contemplates\", \"anticipates\",\"believes\", \"proposes\", \"estimates\" orvariations of such words and phrases, or state that certain actions,events or results \"may\", \"could\",\"would\", \"might\" or \"will\" be taken,occur or be achieved. Such statements are based on the currentexpectations of the management of each entity. The forward-lookingevents and circumstances discussed in this release, includingcompletion of the acquisition of the Letain Project, may not occur bycertain specified dates or at all and could differ materially as aresult of known and unknown risk factors and uncertainties affectingthe Company, including the risk that DIA may not obtain all requisiteapprovals for the acquisition, including the approval of the TSXV,risks of the resource industry, failure to obtain any other requiredregulatory approvals, economic factors, any estimated amounts, timingof the acquisition and requited payments, the equity markets generallyand risks associated with growth, exploration and development.Although DIA has attempted to identify important factors that couldcause actual actions, events or results to differ materially fromthose described in forward-looking statements, there may be otherfactors that cause actions, events or results to differ from thoseanticipated, estimated or intended. No forward-looking statement canbe guaranteed. Except as required by applicable securities laws,forward-looking statements speak only as of the date on which they aremade DIA undertaked no obligation to publicly update or revise anyforward-looking statement, whether as a result of new information,future events, or otherwise.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Tnw41Rnvf:0-vault-strategic-announces-company-attendance-at-prospector-developers-association-conference-pdac-and-appointment-of-quinn-field-dyte-to-ceo/",
            "pub_date": "2026-02-28 08:00:07",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:06436b138094b:0",
            "title": "Crypto Mixing Is Back — And Criminals Adapted Faster Than The Rules Did",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>When US crypto regulators cracked down on Tornado Cash in 2022, the assumption was simple: shut down the tool, shut down the problem. It didn’t work out that way.</span></p><p class=\"\"><span>New research from the Cambridge Centre for Alternative Finance (CCAF) shows that coin mixer usage has climbed back toward pre-ban levels — and that the people most effectively pushed out by the sanctions were not the criminals, but ordinary users seeking financial privacy.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Railgun Now Dominates A Recovering Market</span></strong></p><p class=\"\"><span>According to CCAF researchers Wenbin Wu and Keith Bear, total crypto mixer transactions reached approximately 32,000 in 2025 — a significant jump from roughly 21,000 in 2024 and 16,000 in 2023.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1101.9748653500899px;aspect-ratio:1.836624775583483\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-fffc00c4fc0d1462adb9886ab2c9288f-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-fffc00c4fc0d1462adb9886ab2c9288f-resized.webp\" style=\"background-color:#f6f5f7\"/></picture></div></button></figure><p class=\"\"><span>Usage has been climbing steadily since the US Treasury lifted its sanctions against Tornado Cash on March 21, 2025.</span></p><p class=\"\"><span>Railgun, a protocol that screens deposits against lists of flagged addresses, now handles 71% of all mixer transaction volume. Tornado Cash accounts for around 25% of 2025 transactions, while Privacy Pools holds the remaining 5%.</span></p><p class=\"\"><span>Both Railgun and Privacy Pools attempt to filter out known bad actors before crypto funds enter the system. But reports from CCAF note a meaningful gap — blacklists are updated only as new exploits are discovered, leaving a window where funds from freshly flagged addresses can still pass through.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1127.3394495412845px;aspect-ratio:1.8788990825688074\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-67fcdd7b83ee536156f8cc6a4a384752-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-67fcdd7b83ee536156f8cc6a4a384752-resized.webp\" style=\"background-color:#cad6d5\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sanctions Scared Off Legitimate Users More Than Criminals</span></strong></p><p class=\"\"><span>The 2022 crackdown caused immediate disruption. Tornado Cash’s daily transactions collapsed by 97% within days. Across the broader mixer market, volume fell 45%. But the disruption was uneven.</span></p><p class=\"\"><span>Wu told researchers that sanctions “primarily deterred compliant users while illicit actors adapted” — first by migrating to alternative platforms, then to cross-chain bridges and decentralized exchanges altogether.</span></p><p class=\"\"><span>Deposit patterns tell the same story. Before 2022, centralized exchanges — which require identity verification — contributed meaningfully to mixer funding. After the ban, those deposits essentially vanished. By 2025, 95% of all crypto mixer funding came from unlabeled wallet addresses with no recorded entity ties, up from 76% in 2020.Most Transactions Now Happen Within 24 Hours </span></p><p class=\"\"><span>Before the ban, most mixer activity occurred more than 24 hours after wallet creation. That pattern has flipped. Researchers say this faster behavior is “consistent with users seeking to avoid identification.”</span></p><p class=\"\"><span>Still, a 2023 Federal Reserve Bank of St. Louis paper found that only around 30% of Tornado Cash traffic could be linked to illegitimate sources — a reminder that privacy tools serve lawful purposes too. The demand, from both camps, never went away.</span></p><p class=\"\"><em><span>Featured image from Unsplash, chart from TradingView</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:06436b138094b:0-crypto-mixing-is-back-and-criminals-adapted-faster-than-the-rules-did/",
            "pub_date": "2026-02-28 08:00:08",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN10E:0",
            "title": "'Messy' singer Lola Young, Olivia Dean vie for prizes at BRIT Awards",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Marie-Louise Gumuchian</span></p><p class=\"\"><span>    Singers Lola Young and Olivia Dean top the table of contenders for Saturday's BRIT Awards, with five nominations apiece at Britain's pop music honours.</span></p><p class=\"\"><span>In the run-up to the event, another young star, 24-year-old PinkPantheress, was named as the first woman to get the producer of the year prize.</span></p><p class=\"\"><span>Young, 25, is listed for artist of the year, breakthrough artist, alt/rock act and pop act. Her chart-topping hit \"Messy\" is up for song of the year.</span></p><p class=\"\"><span>Dean, 26, is also a contender in that category with two tracks: \"Man I Need\" and \"Rein Me In\", a collaboration with rocker Sam Fender. She is also nominated for artist of the year, pop act and album of the year for \"The Art of Loving\".</span></p><p class=\"\"><span>PinkPantheress, who released her critically-acclaimed debut mixtape \"To Hell With It\" in 2021, is the youngest ever recipient of the producer prize. She is also nominated for artist of the year and best dance act.</span></p><p class=\"\"><span>“PinkPantheress is both an inventive and instinctive voice in British pop right now,\" Stacey Tang, chair of the 2026 BRIT Awards committee and co-president of RCA Records at Sony Music UK, said in a statement.</span></p><p class=\"\"><span>\"She’s quietly reshaping what modern pop can be, and in doing so, opening the door for a new wave of female producers to step forward.\"</span></p><p class=\"\"><span>Among other nominees are Fender, 31, who has three additional nods: artist of the year, alt/rock act and album of the year for \"People Watching\". Rappers Dave and Jim Legxacy, singer Lily Allen and producer Fred again have three nominations each.</span></p><p class=\"\"><span>Ozzy Osbourne, the late frontman of the heavy metal band Black Sabbath, will be honoured with a lifetime achievement award \"in recognition and celebration of his inimitable impact and influence on music worldwide\", organisers said.</span></p><p class=\"\"><span>Known to fans as \"The Prince of Darkness\", Osbourne died in July aged 76, around two weeks after Black Sabbath's emotional farewell gig.</span></p><p class=\"\"><span>Pulp, who found fame in the mid-1990s Britpop wave, are nominated for group of the year, their first nomination since 1996. The band topped the charts last year with \"More\", their first album since 2001.</span></p><p class=\"\"><span>Movies have also been recognised with actor Cynthia Erivo nominated for song of the year for her rendition of \"Wicked\" track \"Defying Gravity\", while \"Golden\", from Netflix phenomenon \"KPop Demon Hunters\", is up for international song of the year.</span></p><p class=\"\"><span>This year's BRIT Awards will be held in the northern English city of Manchester. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN10E:0-messy-singer-lola-young-olivia-dean-vie-for-prizes-at-brit-awards/",
            "pub_date": "2026-02-28 08:01:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011895:0",
            "title": "United and American Fight at Chicago's O'Hare Draws Federal Scrutiny — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Dean Seal</span></p><p class=\"\"><span>The Federal Aviation Administration is looking to cut flights this summer at Chicago's O'Hare International Airport, where United Airlines and American Airlines are currently duking it out for supremacy.</span></p><p class=\"\"><span>The agency said Friday it would hold a meeting next week to discuss flight restrictions that could ease potential overscheduling and flight delays at O'Hare, which ranks among the busiest airports in the U.S.</span></p><p class=\"\"><span>The prospect of cuts comes as United and American have been in a monthslong battle for gates and passengers.</span></p><p class=\"\"><span>United was allocated five additional gates at O'Hare last year and is planning to boost its daily departures there by more than 34% this summer. American added new destinations from O'Hare and is looking to increase its summer schedule by 10% from a year ago. The competition between carriers could result in lower fares for travelers, analysts have said.</span></p><p class=\"\"><span>But the FAA said the proposed flight plans during the coming summer season, which runs from March 29 to Oct. 25, could compromise the airport's operations.</span></p><p class=\"\"><span>O'Hare currently runs about 100 departures and 100 arrivals every hour, with about 2,800 total operations a day. The increases expected this summer would push that figure to nearly 3,100 on peak days, the agency said, citing data-provider Cirium.</span></p><p class=\"\"><span>\"The proposed increase is significant and would stress the runway, terminal and air traffic control systems at the airport,\" the FAA said in its federal register notice for the meeting.</span></p><p class=\"\"><span>American applauded the decision on Friday, saying in a statement that the FAA can now \"achieve an improved customer experience for passengers.\"</span></p><p class=\"\"><span>United said it appreciated the FAA and Transportation Department's leadership in convening the meeting and \"look[s] forward to a collaborative discussion.\"</span></p><p class=\"\"><span>The meeting is open to the Chicago Department of Aviation and all U.S. carriers, the FAA said.</span></p><p class=\"\"><span>Write to Dean Seal at dean.seal@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011895:0/",
            "pub_date": "2026-02-28 07:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}