{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV27O:0",
            "title": "Franklin Resources cuts 3% of workforce after Wamco outflows - Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/2mvfxupx</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV27O:0-franklin-resources-cuts-3-of-workforce-after-wamco-outflows-bloomberg-news/",
            "pub_date": "2025-02-05 05:52:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OU1AI:0",
            "title": "FICO quarterly profit rises on strong demand for its offerings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac Corporation , widely known as FICO, reports a 18.6% rise in first-quarter profit on Tuesday, helped by continued growth in its scores and software segments.</p><p class=\"\">Commercial and industrial lending is expected to pick up under President Donald Trump's tax cuts and deregulation agenda, boosting demand for FICO's offerings, which help lenders assess customer creditworthiness before approving loans. </p><p class=\"\">The company reported adjusted profit of $143.8 million, or $5.79 per share, in the three months ended Dec. 31. That compares with $121.2 million, or $4.81 per share, a year earlier.</p><p class=\"\">Scores revenue, the company's largest revenue segment, rose to $235.7 million in the quarter, compared with $192.1 million a year earlier. </p><p class=\"\">The software segment reported a 10% rise to $186 million from the same period last year. </p><p class=\"\">FICO's total revenue jumped 15.1% to about $440 million from a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OU1AI:0-fico-quarterly-profit-rises-on-strong-demand-for-its-offerings/",
            "pub_date": "2025-02-05 05:52:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:c4b74ec824206:0",
            "title": "Woodward, Inc. SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Woodward, Inc., a leading designer and manufacturer of control solutions for the aerospace and industrial markets, has released its Form 10-Q report for the first quarter of fiscal year 2024. The report provides a comprehensive overview of the company's financial performance and operational highlights, reflecting the challenges and opportunities faced during the period.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Woodward, Inc. reported the following key financial metrics for the first quarter of fiscal year 2024:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Sales</strong>: $772.7 million, a decrease of 1.8% compared to the same period of fiscal year 2024.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Margin</strong>: 24.5%, down from 26.0% in the first quarter of fiscal year 2024, primarily due to lower sales volume.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Earnings Before Income Taxes</strong>: $101.9 million, representing 13.2% of net sales, compared to 13.9% in the prior year period.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Earnings</strong>: $87.1 million, representing 11.3% of net sales, compared to 11.4% in the prior year period.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Diluted Earnings Per Share</strong>: $1.42, compared to $1.46 in the first quarter of fiscal year 2024.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Aerospace Segment Performance</strong></p> <p class=\"\">The Aerospace segment saw a 7.2% increase in net sales, driven by price realization, despite challenges from inflation, unfavorable mix, and lower volumes. Commercial OEM sales were impacted by the Boeing work stoppage, while commercial aftermarket sales benefited from high aircraft utilization rates. Defense OEM and aftermarket sales increased due to higher demand for smart defense and fixed-wing aircraft.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Industrial Segment Performance</strong></p> <p class=\"\">The Industrial segment experienced a 14.5% decrease in net sales, primarily due to lower volumes and unfavorable mix, partially offset by price realization and favorable foreign currency exchange rates. The on-highway natural gas truck business in China saw a substantial decline due to the deteriorating local economy.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Geographical Performance</strong></p> <p class=\"\">The report highlights a significant sales decline in the on-highway natural gas truck business in China, attributed to the local economic downturn. This indicates regional challenges impacting the Industrial segment's performance.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook - Aerospace</strong></p> <p class=\"\">The Aerospace segment is expected to continue benefiting from price realization, although challenges such as inflation and mix issues may persist. The segment anticipates ongoing demand in defense markets.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook - Industrial</strong></p> <p class=\"\">The Industrial segment faces uncertainty in the Chinese market, particularly in the on-highway natural gas truck business. The company expects to manage these challenges through price realization and operational improvements.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Operational Efficiency</strong></p> <p class=\"\">The company is focusing on operational improvements, including increased output and efficiency gains, particularly in the Industrial segment, to mitigate the impact of sales declines in specific markets.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Product Rationalization</strong></p> <p class=\"\">The company engaged in product rationalization activities, resulting in a one-time gain recognized in the current quarter, which contributed to the increase in other income.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/108312/000095017025013640/wwd-20241231.htm\" rel=\"nofollow\" target=\"_blank\">Woodward, Inc. [ WWD ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:c4b74ec824206:0-woodward-inc-sec-10-q-report/",
            "pub_date": "2025-02-05 05:53:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446624:0",
            "title": "New Zealand Jobless Rate Rises to 2020's High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand's unemployment rate rose to 5.1% in the December quarter of 2024, up from 4.8% in the previous period, matching market expectations and marking the highest level since September 2020.</p><p class=\"\">The seasonally adjusted number of unemployed individuals increased by 7,000 to 156,000.</p><p class=\"\">Additionally, the seasonally adjusted underutilisation rate for the December 2024 quarter rose to 12.1%, up from 11.6% in the previous quarter.</p><p class=\"\">The seasonally adjusted labour force participation rate edged down slightly to 71.0% from 71.1% in the prior quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446624:0-new-zealand-jobless-rate-rises-to-2020-s-high/",
            "pub_date": "2025-02-05 05:53:23",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463540:0",
            "title": "New Zealand's Unemployment Rate Grows to 5.1% in December 2024 Quarter From 4.8% in September 2024 Quarter",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463540:0/",
            "pub_date": "2025-02-05 05:53:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012644_20250204012644:0",
            "title": "Pinnacle Investment Management Price Target Raised 2.5% to A$27.37/Share by Macquarie",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012644_20250204012644:0/",
            "pub_date": "2025-02-05 05:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001767:0",
            "title": "AMD Stock Falls on Disappointing Revenue for Data Center Chips — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tae Kim</p><p class=\"\">AMD reported better-than-expected earnings results Tuesday afternoon. Its shares wavered in after-hours trading.</p><p class=\"\">The semiconductor company reported fourth-quarter adjusted earnings per share of $1.09, compared to Wall Street's consensus estimate of $1.08, according to FactSet. Revenue came in at $7.7 billion, which was above analysts' expectations of $7.5 billion.</p><p class=\"\">AMD forecast sales in the current quarter to a range with $7.1 billion at the midpoint versus the $7 billion analysts' estimate.</p><p class=\"\">AMD shares initially rose as much as 3% in after-hours trading following the re lease but then traded down as much as 3%.</p><p class=\"\">This is breaking news. Read a preview of AMD earnings below and check back for more analysis soon.</p><p class=\"\">The outlook for revenue will be investors' focus when Advanced Micro Devices reports its fourth-quarter earnings after the close Tuesday.</p><p class=\"\">The consensus forecast among analysts is that AMD will report December quarter revenue of $7.5 billion with adjusted earnings per share of $1.08. For the current quarter, the consensus call is that revenue will be $7.0 billion and earnings per share will come in at 95 cents, according to FactSet.</p><p class=\"\">On Friday, Keybanc analyst John Vinh reaffirmed an Overweight rating and $150 price target for AMD. The analyst warned, however, the company's near-term outlook may not impress shareholders.</p><p class=\"\">\"We expect AMD to post in line to higher results and lower guidance,\" he wrote. \"We see NT [near term] risk to forward guidance.\"</p><p class=\"\">The analyst cited softer laptop shipments and the potential for weaker demand for server processors for the potentially weak guidance.</p><p class=\"\">Last week, Intel, AMD's main chip rival, gave a softer-than-expected outlook for its March quarter, citing a weakening global economy. It said some buying that might have happened in the current quarter moved forward to the December quarter as investors sought to prepare for potential tariffs under the Trump administration.</p><p class=\"\">AMD shares are down 36% over the past 12 months, compared to the 8% gain for the iShares Semiconductor ETF.</p><p class=\"\">Write to Tae Kim at tae.kim@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001767:0/",
            "pub_date": "2025-02-05 05:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309409:0",
            "title": "Unum Group Q4 Adjusted Operating Income, Revenue Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Unum Group  reported Q4 adjusted operating income late Tuesday of $2.03 per diluted share, up from $1.79 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $2.14. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $3.24 billion, up from $3.15 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $3.29 billion. </p><p class=\"\">The company said it expects an increase in after-tax adjusted operating income per share of 8% to 12% for the full year 2025. Analysts expect $9.09. </p><p class=\"\">Shares of the Unum were down 5.2% in after-hours activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309409:0/",
            "pub_date": "2025-02-05 05:54:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012649:0",
            "title": "Willdan Expands Florida Presence with Acquisition of Alpha Inspections",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(21:55 GMT) </strong>*Willdan Expands Florida Presence With Acquisition Of Alpha Inspections &gt;WLDN<br/><strong class=\"root-Tkn6WL2y\">(21:55 GMT) </strong>Press Release: Willdan Expands Florida Presence with Acquisition of Alpha Inspections</p><p class=\"\">Willdan Expands Florida Presence with Acquisition of Alpha Inspections</p><p class=\"\">ANAHEIM, Calif.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Willdan Group, Inc.  announced today that it has acquired Alpha Inspections Inc. (Alpha), a building and safety firm, in a stock purchase that closed on January 31. Alpha specializes in building administration, inspection, plan review, and building official services to jurisdictions in Florida. Alpha delivered approximately $5 million in revenue in 2024. The terms of the transaction were not disclosed.</p><p class=\"\">\"We're excited to expand our presence throughout the state of Florida with Alpha's experienced team,\" said Mike Bieber, Willdan's CEO. \"Alpha displays the same, high-quality standards for professional service that our clients recognize in Willdan, making this a natural expansion for both teams.\"</p><p class=\"\">\"Joining Willdan marks an exciting new chapter for Alpha, allowing us to enhance our services and broaden the impact we have on clients and communities,\" said Jennifer Murphy, Alpha's President. \"What makes this transition truly special is that we've found a partner who shares our core values of prioritizing people, delivering exceptional solutions, and always putting our clients and their customers at the center of everything we do. We're grateful for this opportunity and look forward to growing together.\"</p><p class=\"\">About Alpha Inspections</p><p class=\"\">Founded in 2002, Alpha Inspections is a trusted leader in providing comprehensive building department solutions to municipalities across Central Florida. With a team of highly skilled permit technicians, inspectors, plan reviewers, and building officials, Alpha Inspections brings a tremendous depth of expertise to every project. Collectively, its professionals possess an average of nearly 30 years of experience in construction and code compliance, ensuring municipalities receive the highest level of service, efficiency, and regulatory expertise.</p><p class=\"\">About Willdan</p><p class=\"\">Willdan is a nationwide provider of professional technical and consulting services to utilities, government agencies, and private industry. Willdan's service offerings span a broad set of complementary disciplines that include electric grid solutions, energy efficiency and sustainability, engineering and planning, and municipal financial consulting. For additional information, visit Willdan's website at www.willdan.com.</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">Statements in this press release that are not purely historical are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. It is important to note that Willdan's actual results could differ materially from those in any such forward-looking statements. Factors that could cause actual results to differ materially include, but are not limited to, the risk factors listed from time to time in Willdan's reports filed with the Securities and Exchange Commission, including, but not limited to, the Annual Report on Form 10-K filed for the year ended December 29, 2023. Willdan cautions investors not to place undue reliance on the forward-looking statements contained in this press release. Willdan disclaims any obligation to, and does not undertake to, update or revise any forward-looking statements in this press release.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204600784/en/</p><p class=\"\">CONTACT:    Al Kaschalk</p><p class=\"\">Vice President</p><p class=\"\">310-922-5643</p><p class=\"\">akaschalk@willdan.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012649:0/",
            "pub_date": "2025-02-05 05:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012649_20250204012649:0",
            "title": "Willdan Expands Florida Presence With Acquisition Of Alpha Inspections >WLDN",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012649_20250204012649:0/",
            "pub_date": "2025-02-05 05:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204011847:0",
            "title": "Google's Revenue Growth Slows, Sending Shares Down — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Miles Kruppa</p><p class=\"\">Google recorded a slowdown in revenue growth in its most recent quarter, sending its shares tumbling in after-hours trading.</p><p class=\"\">Parent company Alphabet reported $96.5 billion of revenue for the three months ending December, an increase of 12% from the same period a year earlier. Alphabet hasn't reported a growth rate that low since 2023.</p><p class=\"\">Alphabet reported $26.6 billion of net income for the quarter, an increase of 28.3% from a year earlier.</p><p class=\"\">Shares in Alphabet were down 6% in after-hours trading, paring much of this year's gains of about 8%.</p><p class=\"\">Google's cloud-computing division underperformed Wall Street analysts' expectations, reporting $12 billion in fourth-quarter sales. That represented a growth rate of 30.1% from the same period a year earlier, a notable slowdown from the prior quarter.</p><p class=\"\">Executives have been hoping the cloud division's strength can help make up for slowing growth in Google's core advertising business. Competitors including Amazon and TikTok have been eating into Google's dominance in search advertising.</p><p class=\"\">Google was hit this week with an antitrust investigation in China in retaliation for new tariffs President Trump imposed on goods from that country. China's antitrust regulator didn't provide any details about the probe, and Google declined to comment.</p><p class=\"\">In the U.S., Google is preparing to defend against a breakup the federal government is seeking of the company after a judge found it has a monopoly in online search. Separately, a judge is expected to rule soon in another antitrust lawsuit targeting Google's role facilitating ads on third-party websites.</p><p class=\"\">Large tech companies are facing questions about their outsize spending on AI after Chinese startup DeepSeek stunned Silicon Valley with powerful models built more cheaply than their American equivalents . DeepSeek's chatbot app rocketed to the top of app store rankings, ahead of ChatGPT and Google's Gemini.</p><p class=\"\">Google Chief Executive Sundar Pichai has set a goal of reaching 500 million users for its Gemini chatbot by the end of the year. The company has been playing catch up to OpenAI since the startup released ChatGPT in late 2022.</p><p class=\"\">OpenAI has recently taken aim at Google's namesake search engine, giving ChatGPT the ability to search the web to answer questions. It released a feature called Deep Research this week that compiles in-depth reports using information from the web, mimicking a feature with the same name already available in Gemini .</p><p class=\"\">Google has been looking for ways to cut costs. It began offering voluntary buyouts last month to employees working on its Pixel devices and Android mobile software following a merger of the two groups under one leader last year.</p><p class=\"\">\"There's tremendous momentum on this team and with so much important work ahead, we want everyone to be deeply committed to our mission and focused on building great products, with speed and efficiency,\" a Google spokeswoman said.</p><p class=\"\">Write to Miles Kruppa at miles.kruppa@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204011847:0/",
            "pub_date": "2025-02-05 05:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6d9bf052871da:0",
            "title": "ChampionX Reports Fourth Quarter and Full Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ChampionX Corporation, a global leader in chemistry solutions, artificial lift systems, and highly engineered equipment and technologies, has released its financial results for the fourth quarter and full year 2024. The company demonstrated strong financial performance, driven by its high-margin operating model and capital-light portfolio.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, ChampionX reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $912.0 million, a slight increase from the previous quarter.</li><li class=\"listItem-bmN0_SHH\">Net income attributable to ChampionX of $82.8 million.</li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA of $212.3 million, representing a 23.3% margin.</li><li class=\"listItem-bmN0_SHH\">Cash from operating activities of $207.3 million and free cash flow of $170.1 million.</li></ul><p class=\"\">For the full year 2024, the company reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $3.6 billion.</li><li class=\"listItem-bmN0_SHH\">Net income attributable to ChampionX of $320.3 million.</li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA of $784.7 million, representing a 21.6% margin.</li><li class=\"listItem-bmN0_SHH\">Cash from operating activities of $589.7 million and free cash flow of $460.5 million.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">ChampionX's Production Chemical Technologies segment saw a 2% sequential increase in revenue to $569.7 million, driven by seasonally higher volumes in certain international markets and North America. The Production &amp; Automation Technologies segment experienced a 2% sequential decline in revenue to $269.6 million due to seasonality in North American businesses.</p><p class=\"\">Other notable operational highlights include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Growth with a national oil company in Central Asia through technology alignment and implementation of a paraffin treatment program.</li><li class=\"listItem-bmN0_SHH\">Securing a new contract for chemical injection skids for Drag Reducing Agents in Eastern Africa.</li><li class=\"listItem-bmN0_SHH\">Successful field trials and qualifications of new technologies in Egypt, Qatar, and the Middle East.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">In April 2024, ChampionX announced a definitive agreement for SLB to acquire the company in an all-stock transaction. The transaction was approved by ChampionX's board of directors and stockholders, with completion subject to regulatory approvals and customary closing conditions. Given the pending acquisition, ChampionX has discontinued providing quarterly guidance and will not host a conference call to discuss its results.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">ChampionX's President and CEO, Sivasankaran \"Soma\" Somasundaram, highlighted the company's strong cash flow resiliency and high-margin operating model. He attributed the robust performance to the dedication of ChampionX employees and their commitment to continuous improvement.</p><p class=\"\">Somasundaram also noted the company's strong cash flow profile, with cash flow from operating activities representing 250% of net income for the fourth quarter and 184% for the full year. The company ended the year with approximately $1.2 billion of liquidity.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, ChampionX expects global oil production to grow and anticipates another year of positive performance relative to general oil and gas market activity, driven by its differentiated and resilient production-oriented portfolio.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1723089/000172308925000006/championx-20250204.htm\" rel=\"nofollow\" target=\"_blank\">ChampionX Corp [ CHX ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6d9bf052871da:0-championx-reports-fourth-quarter-and-full-year-2024-results/",
            "pub_date": "2025-02-05 05:55:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012651:0",
            "title": "Blackstone Mortgage Trust Announces Tax Treatment of 2024 Dividends",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Blackstone Mortgage Trust Announces Tax Treatment of 2024 Dividends</p><p class=\"\">NEW YORK--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Blackstone Mortgage Trust, Inc.  today announced the tax treatment of its 2024 class A common stock dividends. The following table summarizes BXMT's class A common stock dividend payments for the tax year ended December 31, 2024:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                                           Box 1a       Box 1b          Box 2a         Box 3          Box 5 <br/>                                                          ---------    ---------       ---------    ------------    --------- <br/>                                       Distribution                                      Capital            Non-      Section <br/> Record      Payment             Cash     Allocable        Ordinary    Qualified            Gain        Dividend         199A <br/> Date        Date        Distribution       to 2024       Dividends    Dividends  (1)  Dividends    Distribution    Dividends  (2) <br/>-----------  ----------  ------------  ------------  ---  ---------    ---------  ---  ---------    ------------    ---------  --- <br/> 12/29/2023  1/16/2024            $--         $0.39  (3)        $--          $--             $--           $0.39          $-- <br/>-----------  ----------  ------------  ------------  ---  ---------    ---------  ---  ---------    ------------    ---------  --- <br/> 3/28/2024   4/15/2024           0.62          0.62              --           --              --            0.62           -- <br/>-----------  ----------  ------------  ------------  ---  ---------    ---------  ---  ---------    ------------    ---------  --- <br/> 6/28/2024   7/15/2024           0.62          0.62              --           --              --            0.62           -- <br/>-----------  ----------  ------------  ------------  ---  ---------    ---------  ---  ---------    ------------    ---------  --- <br/> 9/30/2024   10/15/2024          0.47          0.47              --           --              --            0.47           -- <br/>-----------  ----------  ------------  ------------  ---  ---------    ---------  ---  ---------    ------------    ---------  --- <br/> 12/31/2024  1/15/2025           0.47            --  (4)         --           --              --              --           -- <br/>-----------  ----------  ------------  ------------  ---  ---------    ---------  ---  ---------    ------------    ---------  --- <br/>                                $2.18         $2.10             $--          $--             $--           $2.10          $-- <br/>-----------  ----------  ------------  ------------  ---  ---------    ---------  ---  ---------    ------------    ---------  --- <br/> </pre><p class=\"\">(1) Qualified Dividends shows the portion of the amount of Box 1a Ordinary Dividends that may be eligible for capital gains tax rates pursuant to IRC Section 857(c).</p><p class=\"\">(2) Section 199A Dividends shows the portion of the amount of Box 1a Ordinary Dividends that may be eligible for the 20% deduction applicable to \"qualified REIT dividends\" under IRC Section 199A(b)(1)(B). Please consult your tax advisor.</p><p class=\"\">(3) The cash dividend of $0.62 per share of common stock (with a record date of December 29, 2023, that was paid on January 16, 2024) is a split-year dividend, of which $0.23 was allocable to 2023 for federal income tax purposes and the remaining $0.39 is allocable to 2024 for federal income tax purposes.</p><p class=\"\">(4) The cash dividend of $0.47 per share of common stock (with a record date of December 31, 2024, that was paid on January 15, 2025) is entirely allocable to 2025 for federal income tax purposes. If you were a stockholder of record as of December 31, 2024, $0.47 will be reported on your 2025 Form 1099.</p><p class=\"\">About Blackstone Mortgage Trust</p><p class=\"\">Blackstone Mortgage Trust, Inc.  is a real estate finance company that originates senior loans collateralized by commercial real estate in North America, Europe, and Australia. Our investment objective is to preserve and protect shareholder capital while producing attractive risk-adjusted returns primarily through dividends generated from current income from our loan portfolio. Our portfolio is composed primarily of loans secured by high-quality, institutional assets in major markets, sponsored by experienced, well-capitalized real estate investment owners and operators. These senior loans are capitalized by accessing a variety of financing options, depending on our view of the most prudent strategy available for each of our investments. We are externally managed by BXMT Advisors L.L.C., a subsidiary of Blackstone. Further information is available at www.bxmt.com.</p><p class=\"\">About Blackstone</p><p class=\"\">Blackstone is the world's largest alternative asset manager. We seek to deliver compelling returns for institutional and individual investors by strengthening the companies in which we invest. Our more than $1.1 trillion in assets under management include global investment strategies focused on real estate, private equity, infrastructure, life sciences, growth equity, credit, real assets, secondaries and hedge funds. Further information is available at www.blackstone.com. Follow @blackstone on LinkedIn, X (Twitter), and Instagram.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204228907/en/</p><p class=\"\">CONTACT:</p><p class=\"\">Investor and Media Relations Contact</p><p class=\"\">Investor Relations</p><p class=\"\">Blackstone</p><p class=\"\">+1 (888) 756-8443</p><p class=\"\">BlackstoneShareholderRelations@Blackstone.com</p><p class=\"\">Public Affairs</p><p class=\"\">Blackstone</p><p class=\"\">+1 (212) 583-5263</p><p class=\"\">PressInquiries@Blackstone.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012651:0/",
            "pub_date": "2025-02-05 05:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012487_20250204012580:0",
            "title": "Match Group: Strengthening U.S. Dollar Continues to Put Pressure on as Reported Results >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012487_20250204012580:0/",
            "pub_date": "2025-02-05 05:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012586:0",
            "title": "ChampionX Files 8K - Operations And Financial Condition >CHX",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ChampionX Corp. (CHX) filed a Form 8K - Operations and Financial Condition - with the U.S Securities and Exchange Commission on February 04, 2025.</p><p class=\"\">On February 4, 2025, ChampionX Corporation (the \"Company\") issued a news release announcing its financial results for the quarter and year ended December 31, 2024. A copy of the news release is furnished as Exhibit 99.1 hereto and incorporated herein by reference.</p><p class=\"\">The information furnished pursuant to this Item 2.02 (including Exhibit 99.1) shall not be deemed to be \"filed\" for the purposes of Section 18 of the Securities and Exchange Act of 1934, as amended, (\"Exchange Act\") or otherwise subject to the liabilities of that section, and shall not be deemed to be incorporated by reference into any filing made by ChampionX Corporation under the Exchange Act or the Securities Act of 1933, as amended, regardless of any general incorporation language in any such filing, except as shall be expressly set forth by specific reference in such filing.</p><p class=\"\">The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1723089/000172308925000006/championx-20250204.htm</p><p class=\"\">Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1723089/000172308925000006/0001723089-25-000006-index.htm</p><p class=\"\">Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012586:0/",
            "pub_date": "2025-02-05 05:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463539:0",
            "title": "New Investment in Predictive Discovery Shows Africa Project Has Potential for Further Gold Discoveries, Euroz Hartleys Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Predictive Discovery's  over AU$69 million investment from the Lundin Family and Zijin Mining Group shows that the company's Bankan project in Guinea has potential for additional large-scale gold discoveries, according to a Tuesday note by Euroz Hartleys. </p><p class=\"\">On Monday, the company said it received binding commitments from the Lundin Family and Zijin Mining Group to raise roughly AU$69.2 million through a strategic private placement of 261.2 million shares at a price of AU$0.265 apiece to be invested in the Bankan project. </p><p class=\"\">The Lundin Family will subscribe for 170.1 million shares for an investment of AU$45.1 million to obtain a 6.5% shareholding in the company, while Zijin Mining Group will subscribe for 91.1 million shares for an investment of AU$24.1 million to obtain a 3.5% shareholding, the company said. </p><p class=\"\">Euroz Hartleys sees potential for high-grade additions from open, ongoing exploration at the Bankan project, calling it one of the best undeveloped gold projects in Africa. </p><p class=\"\">Euroz Hartleys reaffirmed a speculative buy rating and price target of AU$0.50 on Predictive Discovery.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463539:0/",
            "pub_date": "2025-02-05 05:49:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2qtKFf:0",
            "title": "Microchip Technology Appoints Victor Peng to Its Board of Directors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CHANDLER, Ariz., Feb.  04, 2025  (GLOBE NEWSWIRE) — Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today announced that Victor Peng, former President of Advanced Micro Devices, Inc. (AMD), will join the Board of Directors of Microchip effective February10, 2024.</p><p class=\"\">Regarding Mr. Peng’s appointment to the board, Microchip’s President and CEO, Steve Sanghi, said, “Victor most recently served as the President of AMD, a publicly held company that designs and manufactures hardware for high-performance computing. Prior to that, he served Xilinx for 14 years, most recently holding roles of president, CEO, board member. With over 40 years of industry experience, Victor has held leadership roles of increasing responsibility at Xilinx where he worked from 2008 until 2022, and at AMD from 2022 until his retirement in 2024. He brings years of industry experience in technology, strategy, and operations to Microchip. This knowledge of technology and of the semiconductor industry will be invaluable to our Board. Victor has also served on the board of KLA Corporation (a provider of process control and yield management systems for semiconductor manufacturing) since February 2019. We welcome Victor to our board and look forward to benefitting from his experience.”</p><p class=\"\">Mr. Peng commented, “I am honored to be appointed to the Microchip board. I believe that my industry experience and leadership skills can have a positive impact on the company’s strategic direction and plans. I look forward to working with the Microchip board to achieve the company’s goals”.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Microchip:</strong></p><p class=\"\">Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market. The company's solutions serve approximately 112,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.</p><p class=\"\">The Microchip logo and name are registered trademarks of Microchip Technology Incorporated.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">INVESTOR RELATIONS CONTACT:Sajid Daudi – Head of investor Relations</li><li class=\"listItem-bmN0_SHH\">(480) 792-7385</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2qtKFf:0-microchip-technology-appoints-victor-peng-to-its-board-of-directors/",
            "pub_date": "2025-02-05 05:49:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012595:0",
            "title": "Tech, Media & Telecom Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Technology, Media and Telecom. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0545 ET - Vodafone is struggling to remain relevant, AJ Bell's Russ Mould writes in a note. \"While there are some reasons for encouragement, the market has tuned these out and is focused on the growing problems in its German operation,\" Mould says. The London-listed telecom company's U.K. segment showed some growth, ahead of the now-approved merger with Three. However, the group needs to demonstrate it can achieve sustainable growth to reassure investors, Mould says. Shares fall 6.3% to 65.62 pence. (najat.kantouar@wsj.com)</p><p class=\"\">0359 ET - Dassault Systemes' new guidance for the current quarter and 2025 as a whole is slightly below market expectations, Bryan Garnier's Aurelien Deside writes in a note to investors. The French software maker is forecasting non-IFRS total revenue between nearly 1.54 billion euros and 1.60 billion euros for the first quarter and between 6.55 billion euros and 6.65 billion euros for the full year. Deside notes that projections for both periods are about 2% below consensus. Dassault Systemes shares trade 0.2% lower at 37.29 euros. (mauro.orru@wsj.com)</p><p class=\"\">0259 ET - Infineon Technologies' sales guidance is slightly ahead of market expectations, Citi analysts write in a note to clients. The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros it reported for fiscal 2024, better than a previous forecast of a slight decline. The new projection equates to roughly 15 billion euros against Vara Research consensus of 14.59 billion euros, Citi analysts note. Infineon's guidance lift is mostly driven by expectations of a stronger dollar based on an assumed exchange rate of $1.05 to the euro compared with $1.10 previously. (mauro.orru@wsj.com)</p><p class=\"\">2315 ET - There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p><p class=\"\">2212 ET - The rise of Chinese AI is denting investor risk sentiment, particularly in the tech sector, Nomura analyst Naka Matsuzawa says in a research note. This has triggered a flight to quality, driving flows into government bonds, though investor jitters have yet to cause a financial shock or credit contraction, the analyst notes. Meanwhile, U.S. tech earnings have been well-received by the market, helping to ease concerns. Even though this AI-driven shock could erode U.S. economic and market strength over time, the impact of Trump's tariffs is likely offsetting what would have otherwise been a weaker USD, the analyst adds. (tracy.qu@wsj.com)</p><p class=\"\">1849 ET - Shares of Super Micro Computer, which had delayed its earnings while it was looking into accounting issues, are up 9% to $29.27 after-hours as the company schedules a business update for Feb. 11 at 5:00 p.m. ET. A press release refers to a \"second quarter fiscal 2025 business update,\" while the company's website calls it \"Fiscal 2Q 2025 results.\" The Wall Street Journal reported in September that the Justice Department was investigating the server company. Shares surged in early December when Super Micro said a final review showed no evidence of fraud or misconduct by its management or board relating to accounting issues. On Dec. 6, it said it expected to file its delayed financial statements by Feb. 25. (josh.beckerman@wsj.com)</p><p class=\"\">1732 ET - For the past two years, Palantir Technologies has argued that open- and closed-source artificial-intelligence models are becoming more similar, and that performance would eventually converge, Chief Technology Officer Shyam Sankar says on a call with analysts. \"That's because the market's been focused on AI supply,\" he says. \"With the release of Deep Seek R1, that has gone from a contrarian position to consensus.\" Shares jump 22% after the company says demand for its AI products continues to expand. (connor.hart@wsj.com)</p><p class=\"\">1727 ET - Palantir Technologies closed what it called a record number of deals during 4Q, including 32 deals worth $10 million or more. Chief Revenue and Legal Officer Ryan Taylor says on a call with analysts that the company's U.S. business is at the forefront of the artificial-intelligence revolution, with nearly five-times the number of commercial customers from three years earlier and continuing to add more. \"Organizations who have crossed the chasm with Palantir are driving real impact quickly,\" he says. \"In this AI revolution the biggest risk is not moving fast enough, and organizations are looking to us.\" Shares jump 22% in after-hours trading. (connor.hart@wsj.com)</p><p class=\"\">1706 ET - Palantir Technologies blew past analysts' expectations for 4Q and guided for another beat in the current quarter. CEO Alex Karp said in a letter to shareholders that the company's recent results are indicative of a new phase of its business. \"The business we have built has now developed its own internal momentum and strength, its own interior life and forms of untamed organic growth, with the output that we are seeing far surpassing what we are investing.\" He dubs the company a software juggernaut as its stock price jumps 21%, to $101.86, in after-hours trading. (connor.hart@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012595:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012585_20250204012590:0",
            "title": "Microchip Technology Appoints Victor Peng to Board",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012585_20250204012590:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012487_20250204012600:0",
            "title": "Match Group: Tinder 4Q Rev $488M >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012487_20250204012600:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012487_20250204012588:0",
            "title": "Match Group: Tinder 4Q Direct Rev of $476M >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012487_20250204012588:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012598:0",
            "title": "Financial Services Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Financial Services. Exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1232 ET - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p><p class=\"\">1216 ET - PayPal is renegotiating deals with large merchants of its Braintree subsidiary and expects to see a resulting 5 percentage point headwind to revenue growth in 2025, CFO Jamie Miller says on a call with analysts. The company is shifting away from some of the volume from the unbranded payment processing unit, which should prove to be accretive to transaction margin dollars, a measure of profitability, according to Miller. \"Over the next few quarters, we will continue to work through renegotiations, at which point we should reach a new baseline to drive faster volume and revenue growth,\" the CFO says. (dean.seal@wsj.com)</p><p class=\"\">1130 ET - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1119 ET - Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p><p class=\"\">1108 ET - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p><p class=\"\">1038 ET - Intesa Sanpaolo's operating profit exceeded consensus and JPMorgan's estimates driven by higher revenue and lower provisions, JPM analysts say in a note. The Italian lender issued a higher-than-expected buyback of 2 billion euros and raised its 2025 net income target to well above 9 billion euros on the back of expected revenue growth and declining costs, the analysts say. \"Overall, fee trends are encouraging and the slight step-up in buyback amounts welcome,\" they say. Shares are up 1.6% at 4.24 euros.(helena.smolak@wsj.com)</p><p class=\"\">1001 ET - The average buyer's agent commission held steady at 2.37% in 4Q, down slightly from 2.45% a year prior, according to Redfin. Despite new commission rules by the National Association of Realtors implemented in August 2024, commissions saw only minor fluctuations, starting at 2.38% in July, dipping to 2.35% in August, and returning to 2.38% by December. A Redfin survey of 500 U.S. agents revealed that 48% said the average agent commission in their area remained about the same since the NAR settlement took effect, while 43% noted a decline. Moreover, 54% of agents reported increased negotiation efforts over commissions by clients, with only 6% seeing less negotiation. (chris.wack@wsj.com)</p><p class=\"\">0645 ET - UBS Group's guidance suggests more top-line pressure to come for its global-wealth-management and personal-and-corporate banking units this quarter, Deutsche Bank's Benjamin Goy and Sharath Kumar say in a research note. The bank guided for a decline in net interest income in global wealth management in the low to mid-single percentage digits this quarter and a 10% decline in the personal and corporate banking unit. While the Swiss bank's fourth-quarter results looked solid, the business mix behind them wasn't ideal, Deutsche Bank says. The group's key global wealth management business was only in line with expectations and its personal and corporate banking unit missed estimates, the analysts say. UBS shares fall 6.1%. (adria.calatayud@wsj.com)</p><p class=\"\">0615 ET - Scor provided a positive update on its January reinsurance-treaty renewals, but this was largely as expected and might not be enough to move the needle, RBC Capital Markets' Derald Goh and Sarah Chong say in a research note. The update points to healthy volumes and flat profit margins, which are consistent with comments the French reinsurer made at its December capital-markets day, the analysts say. \"While it's a positive development we think it's largely as expected and hence we do not see anything incremental to sway the story on the back of this,\" RBC says. Shares rise 3.2%. (adria.calatayud@wsj.com)</p><p class=\"\">0445 ET - Raiffeisen Bank posted a fourth-quarter profit of 128 million euros when excluding its Russia and Belarus operations, Citi analyst Simon Nellis says in a research note. That result brings its year-end result excluding Russia and Belarus to 975 million euros, an 8% miss compared with consensus. Year-end profit for the Vienna-based bank including Russia and Belarus came to 1.16 billion euros, better than Citi had anticipated, the analyst says. Citi says that the bank's result excluding Russia and Belarus, given the number of one-offs the bank faced including a provision and the effect of deconsolidating its Belarus business, is largely in line with expectations. Shares trade 1.6% higher at 20.36 euros. (pierre.bertrand@wsj.com)</p><p class=\"\">0414 ET - BNP Paribas reported strong underlying trends for the fourth quarter and consensus expectations could rise, RBC Capital Markets analyst Anke Reingen says in a research note. The French bank's quarterly result as well as it CET1 ratio exceeded expectations, the analyst says. The bank's new 2024-2026 net income growth rate target suggests at least a 4% consensus upgrade, Reingen says. The slight fall in the bank's 2025 return on tangible equity to 11.5% from a range of 11.5% to 12% previously, given consensus expectations at 10.4%, should offer relief to investors fearing a steeper downgrade. BNP Paribas' targeted revenue growth of at least 5% per year for 2025-2026 is also higher than investors had expected. BNP shares trade 2.5% higher to 65.94 euros. (pierre.bertrand@wsj.com)</p><p class=\"\">0410 ET - BNP Paribas's fourth-quarter profit exceeded market views thanks in part to its corporate and institutional banking business, Barclays analyst Flora Bocahut says in a research note. The company's commercial, personal banking and services division also drove the 4% consensus beat, the analyst says. BNP Paribas's investment and protection services unit disappointed but the business should benefit later this year from external growth, the analyst says. Meanwhile, the bank's targets for 2026 are slightly ahead of consensus, the analyst says. BNP Paribas shares trade 2.7% higher at 66.09 euros. (pierre.bertrand@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012598:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012591:0",
            "title": "Energy & Utilities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy and Utilities. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1517 ET - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">0936 ET - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">0910 ET - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0321 ET - OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p><p class=\"\">1852 ET - The more than 8% drop in Origin Energy's share price that followed a downgrade to annual production guidance for the Australia Pacific LNG project was overdone, contends UBS. The stock reaction ignores several tailwinds that could trigger upgrades to consensus earnings expectations for FY 2026, analyst Tom Allen says. They include a 15%-20% decline in current coal prices, UBS says, noting 45% of Origin's coal costs are unhedged. Origin also wants to expand a battery at the Eraring power station in Australia to become one of the largest battery storage systems in the world. \"We do not believe these incremental earnings (A$100 million per annum from 2H FY 2026) are factored into consensus estimates,\" UBS says. It keeps a buy call on Origin's stock. (david.winning@wsj.com; @dwinningWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012591:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012594:0",
            "title": "Basic Materials Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Basic Materials. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1424 ET - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p><p class=\"\">0745 ET - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p><p class=\"\">0359 ET - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">2244 ET - LG Chem is set to post weaker-than-expected 2025 earnings partly due to sales declines at its electric-vehicle battery and advanced-material businesses, Nomura analyst Cindy Park writes in a note. Park cuts her operating-profit forecast for the South Korean company by 37% for 2025, lowering the valuations of its battery and advanced-material units. Still, she says the stock could gain on a possible earnings improvement for chemicals and a potential cathode restocking at its EV battery affiliate later in the year. Nomura cuts its target price for the stock by 33% to KRW280,000 but keeps a buy rating. Shares are 3.2% lower at KRW215,000. (kwanwoo.jun@wsj.com)</p><p class=\"\">2213 ET - Palm oil prices fall in early Asian trading, tracking weakness in soybean oil on the Chicago Board of Trade, says David Ng, a trader at Kuala Lumpur-based Iceberg X. However, the price weakness won't persist, he adds, citing expectations for weak palm oil output. CPO production for Jan. 1-31 is estimated to have fallen 15% on month, according to Malaysia's Southern Peninsular Palm Oil Millers Association. Ng pegs CPO support at 4,250 ringgit/ton and resistance at 4,400 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 43 ringgit lower at 4,324 ringgit/ton. (yingxian.wong@wsj.com)</p><p class=\"\">1923 ET - Drivers of Westgold's downgrade to FY 2025 production guidance are likely to spill into the following year as well, reckons Macquarie. Westgold expects to produce 330,000-350,000 oz of gold in FY 2025, down from a prior projection of 400,000-420,000 oz. It expects to dig up gold at a higher cost, forecasting all-in sustaining costs, or AISC, of A$2,400-A$2,600/oz. \"We also assume the slower ramp-up of Bluebird and Beta Hunt, and softer grades at Big Bell, carry over into FY 2026 and cut production 10% while AISC lifts 4%,\" says Macquarie, referring to Westgold's mines. Still, Macquarie's revised outlook equates to a 32% year-over-year increase in production in FY 2026. It retains an outperform call on Westgold's stock. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1858 ET - The proposed 25% tariff on Canadian shipments to the U.S. could cost Rayonier Advanced Materials up to $3.5 million per month while in place, the company said. \"Even with these potential tariffs at currently announced levels, the company expects to cover all fixed charges, including maintenance capital and interest expenses,\" it said. Last year, about 11% of the company's total revenues were generated from Canadian Paperboard exports to the U.S., it added. The company also said it sees 2025 Cellulose Specialties average sales prices increasing mid-single-digit percentage from 2024 levels. (stephen.nakrosis@wsj.com)</p><p class=\"\">1701 ET - Aeris Resources held less cash at the end of 2Q than expected by Ord Minnett, which retains a hold call on the stock as it balances long-term value with a stretched balance sheet. Aeris reported A$26 million in cash at end-December, some A$4 million less than projected by Ord Minnett and despite a lower capital spend. Aeris experienced operational challenges at its Tritton copper mine, with output some 27% below Ord Minnett's forecast and costs around 27% higher. \"The Tritton issues appear to have been somewhat rectified as FY 2025 guidance is unchanged with improved grades/tons set to come from Bugderygar, Avoca Tank and Murrawombie,\" says Ord Minnett, referring to other Aeris-owned pits. (david.winning@wsj.com; @dwinningWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012594:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012596:0",
            "title": "Auto & Transport Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Auto and Transport sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1333 ET - Autonomous-vehicle company Cruise confirms it will lay off about half of its workforce. \"We are grateful for their passion and contributions to help us reach this stage, and our focus is on supporting them into their next chapter with severance packages and career support,\" a company spokesperson says in an emailed statement. \"While not an easy decision, we are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles.\" The layoffs come as GM announces the completion of its acquisition of Cruise, stating the company moving forward will work collaboratively on autonomous-vehicle technology and advanced driver assistance systems for personal vehicles. GM shares rise 1.4%. (connor.hart@wsj.com)</p><p class=\"\">1216 ET - The automotive industry should pursue partnerships over traditional mergers and acquisitions, Bain &amp; Company says in a report. Companies have largely held off on M&amp;A in 2024 amid uncertainty and mounting cost pressures, with deal volumes falling about 60% during the first three quarters of the year, the management-consultancy firm says. But alliances could offer a solution, it notes. \"Activity is likely to pick up as companies acknowledge that they can't go it alone much longer,\" Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1037 ET - Canada's two railroads, Canadian Pacific Kansas City and Canadian National Railway, would be exposed in the event of a 25% tariff situation with the U.S., but RBC analysts think CPKC would be the most affected. CPKC has 41% of its revenue tied to cross-border trade, according to RBC. Sustained tariffs, the analysts say, over a longer period of time could derail its growth plans. \"Moreover, we see many of the company's Investor Day growth targets as dependent on cross-border trade and therefore flag risk to long-term consensus EPS growth estimates should tariffs at current levels be sustained,\" the analysts say. (adriano.marchese@wsj.com)</p><p class=\"\">0940 ET - With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0508 ET - Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p><p class=\"\">0501 ET - TomTom's 2025 guidance is disappointing, ING analyst Marc Hesselink writes in a note. The location technology specialist's outlook remains very uncertain, with no free cash flow expected in the near term, he adds. However, \"the guidance provides significant room for error to reflect the uncertain automotive market,\" he adds. In the fourth quarter, the main negative was its free cash flow--5 million euros outflow--due to unfavorable working capital timing, Hesselink says. Shares are down 14% at 4.28 euros. (najat.kantouar@wsj.com)</p><p class=\"\">0500 ET - A potential merger between Grab and GoTo would improve margins, Citi Research analyst Alicia Yap writes in a note. Bloomberg reported Tuesday that talks between the ride-hailing companies over a possible combination have recently intensified. They would likely save costs on competing user subsidies, as well as see faster new user acquisition with broader product offerings and better reach to lower-tier cities, Yap says. There could also be better user targeting, cross-selling of financial services and increased advertising revenue on both platforms, Yap adds. Both brands would likely continue running independently, but there could be back-end integration of systems and more collaboration regarding merchant management and sharing their rider and vehicle pool, Yap adds. Citi retains a buy rating on Grab with a target of $5.90. Shares last closed at $4.54. (kimberley.kao@wsj.com)</p><p class=\"\">2133 ET - Yangzijiang Shipbuilding's record-high order backlog boosts earnings visibility through 2027, DBS Group Research's Pei Hwa Ho says in a research report. The shipbuilder's yards are full through 2027 with an order book of roughly US$24 billion, which is expected to lead to earnings CAGR of around 14% over the next two years, the analyst says. Revenue growth and margin expansion are drivers, as about 65% of the company's order book consists of containership orders that command higher value and margins, the analyst adds. DBS raises its 2024-2026 earnings forecasts for Yangzijiang Shipbuilding by 5%-11%. It raises the target price to S$3.80 from S$2.88 with an unchanged buy rating. Shares are 1% lower at S$3.00. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012596:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309404:0",
            "title": "Earnings Flash (ATO) Atmos Energy Fiscal Q1 EPS $2.23, vs. FactSet Est of $2.24",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309404:0/",
            "pub_date": "2025-02-05 05:50:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309396:0",
            "title": "Varonis Systems Q4 Non-GAAP Net Income Falls, Revenue Rises; Q1, 2025 Guidance Set",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Varonis Systems  reported Q4 non-GAAP net income late Tuesday of $0.18 per diluted share, down from $0.27 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.14. </p><p class=\"\">Revenue in the three months ended Dec. 31 rose to $158.5 million from $154.1 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $165.6 million. </p><p class=\"\">In Q1, the company expects a non-GAAP net loss of $0.04 to $0.06 per diluted share on revenue of $130 million to $135 million. Analysts expect a non-GAAP loss of $0.02 on revenue of $129.9 million. </p><p class=\"\">In 2025, Varonis expects non-GAAP net income of $0.13 to $0.17 per diluted share on revenue of $610 million to $625 million. Analysts expect non-GAAP EPS of $0.32 on revenue of $626.7 million. </p><p class=\"\">Shares of Varonis Systems fell 6.1% in after-hours activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309396:0/",
            "pub_date": "2025-02-05 05:44:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446623:0",
            "title": "US Crude Oil Inventories Exceed Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US crude oil inventories jumped by 5.025 million barrels for the week ending January 31st, 2025, following a 2.86 million barrel build in the previous week, according to the American Petroleum Institute's Weekly Statistical Bulletin.</p><p class=\"\">This marked the third consecutive week of inventory gains, after five weeks of declines, surpassing expectations of a 3.17 million barrel build.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446623:0-us-crude-oil-inventories-exceed-forecasts/",
            "pub_date": "2025-02-05 05:44:18",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309390:0",
            "title": "Lumen Q4 Exceeds Expectations; Shares Jump After-Hours",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lumen Technologies  reported late Tuesday Q4 adjusted earnings of $0.09 per share, up from $0.08 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected a loss of $0.05. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $3.33 billion, down from $3.52 billion a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $3.20 billion. </p><p class=\"\">For 2025, the company expects Adjusted EBITDA of $3.2 billion to $3.4 billion. </p><p class=\"\">Shares of the company were up about 10% in after-hours trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309390:0/",
            "pub_date": "2025-02-05 05:44:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV2AP:0",
            "title": "Tariffs, earnings eyed as China reopens",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    A look at the day ahead in Asian markets. </p><p class=\"\">First Mexico reached agreement with the United States to put U.S. tariffs on ice, then Canada did likewise, leaving the world's attention on <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/trump-china-us-tariffs-live-updates-2025-02-04/\" rel=\"nofollow\" target=\"_blank\">China</a>. Can a similar rapprochement between Beijing and Washington be achieved?</p><p class=\"\">After China retaliated on Tuesday to sweeping U.S. tariffs with targeted tariffs of its own, and put several U.S. companies, including Google, on notice for possible sanctions, a sudden detente seems unlikely. </p><p class=\"\">This will keep trade tensions bubbling away in Asia, even though markets globally have welcomed Washington's temporary reprieves with Mexico and Canada. A proposed telephone call on Tuesday between U.S. President Donald Trump and Chinese President Xi Jinping didn't take place, suggesting relations remain cool at best. </p><p class=\"\">China's levies don't come into effect until Feb. 10, however, leaving time for Trump and Xi to hammer out a 'deal'.  </p><p class=\"\">Chinese onshore markets reopen on Wednesday after the Lunar New Year holiday. All asset classes will be under intense scrutiny, none more so than the currency and the central bank's daily fixing of the dollar/yuan exchange rate. </p><p class=\"\">It was last fixed at 7.1698 on Jan. 27, and the pressure for a higher fix - i.e, a weaker yuan - could be strong after the offshore dollar/yuan rate hit an all-time high of 7.3765 on Monday. It has since eased back to around 7.28, but that's still comfortably higher than the central bank's last official fix over a week ago.</p><p class=\"\">Chinese stocks listed in Hong Kong have shrugged off the U.S.-Sino trade war with surprising ease, as investors have loaded up on artificial intelligence and electric vehicle shares. The China-focused index rose 3.5% on Tuesday to a three-month high, and Hong Kong tech shares leaped 5%. Will that optimism spill over to the onshore market? </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:550px;aspect-ratio:0.9166666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-a07d774660d5652f1ffb5e51b7709949-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to March 1, 2018) and the exchange rate of USD/CNY during the trade war between March 2018 and June 2019.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-a07d774660d5652f1ffb5e51b7709949-resized.jpeg\" style=\"background-color:#f4f6f8\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets during 2018 trade war</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:542.4657534246576px;aspect-ratio:0.904109589041096\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-f54affadaa82f22afcf04110560c7e6d-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to Sept. 15, 2024) and the exchange rate of USD/CNY during the trade war between Sept. 15, 2024 and Feb. 4, 2025.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-f54affadaa82f22afcf04110560c7e6d-resized.jpeg\" style=\"background-color:#f8f7f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets as trade frictions rise in 2025</span></figcaption></figure></span></p><p class=\"\">Most Asian equity benchmarks rose solidly on Tuesday, and the tech-heavy Nasdaq's strong advance lifted Wall Street too. Surprisingly soft U.S. jobs opening figures on Tuesday pushed the dollar and Treasury yields lower, which could also support risk appetite in Asia on Wednesday.</p><p class=\"\">But while U.S. money markets are still pricing in two quarter-point rate cuts from the Fed this year, the inflationary cloud from U.S. tariffs is darkening. Economists at Morgan Stanley on Tuesday changed their Fed call to only one rate cut this year, in June, from two, warning: \"The path for monetary policy in 2025 remains highly uncertain.\"</p><p class=\"\">Among the U.S. companies that reported earnings after the market close on Tuesday was 'Magnificent 7' constituent Alphabet. Google's parent company missed revenue estimates, sending its shares down more than 1% in after-hours trading. If that is sustained, it could weigh on sentiment in Asia on Wednesday. </p><p class=\"\">Here are key developments that could provide more direction to Asian markets on Wednesday:</p><p class=\"\">- China \"unofficial\" services PMI (January) </p><p class=\"\">- China reserve requirements ratio</p><p class=\"\">- Japan corporate earnings, including Toyota</p><p class=\"\">- Indonesia GDP (Q4)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV2AP:0-tariffs-earnings-eyed-as-china-reopens/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}