{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSWWDlfa:0",
            "title": "PU Prime Wins Best Multi-Asset Broker - MEA 2025 at iFX EXPO Dubai",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">DUBAI, AE / ACCESS Newswire / February 5, 2025 /</strong> PU Prime has been awarded Best Multi-Asset Broker - MEA 2025 at a distinguished ceremony held at the Dubai World Trade Centre. The award was presented at the close of the first day of iFX EXPO Dubai 2025, one of the leading events in the financial services industry. Organized by Ultimate Fintech, the awards recognize companies for excellence across the global financial sector.</p><p class=\"\">This accolade highlights PU Prime's outstanding performance in offering a wide range of financial products, including forex (FX),commodities, shares, ETFs, bonds, and more. The company's innovative approach and unwavering commitment to client satisfaction have established it as a leader in the Middle East and Africa (MEA) region.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Celebrating Innovation and Excellence</strong></p><p class=\"\">The Best Multi-Asset Broker - MEA 2025 award further reinforces PU Prime's reputation as a technology-driven brokerage, providing traders with access to global markets through advanced tools and competitive pricing. With a focus on delivering a seamless, user-friendly trading experience, PU Prime continues to support both retail and professional traders in navigating complex financial markets.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Highlight at iFX EXPO Dubai</strong></p><p class=\"\">The award ceremony was a key moment at iFX EXPO Dubai 2025, bringing together top financial industry leaders for networking and collaboration. The expo serves as an important platform for financial service providers to showcase their offerings and technological advancements to a global audience.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Looking Ahead</strong></p><p class=\"\">This latest recognition positions PU Prime for continued growth in the global financial services market. The company remains committed to innovation, platform enhancements, and expanding its product offerings to meet the evolving needs of traders worldwide.</p><p class=\"\">For more information, visit www.puprime.com.</p><p class=\"\">For media inquiries, please contact the PR team via media@puprime.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About PU Prime</strong></p><p class=\"\">Founded in 2015, PU Prime is a leading global fintech company offering innovative online trading solutions. The company provides a broad range of financial products, including forex, commodities, indices, and cryptocurrencies. With a commitment to advanced technology and education, PU Prime supports traders of all levels and serves a global audience, with over 40 million app downloads. The platform is dedicated to empowering traders and fostering financial success worldwide.</p><p class=\"\">Organization: PU Prime</p><p class=\"\">Contact Person Name: Qianyi Hong</p><p class=\"\">Website: https://www.puprime.com/</p><p class=\"\">Email: media@puprime.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> PU Prime</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSWWDlfa:0/",
            "pub_date": "2025-02-06 00:36:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:7a9d13ad4094b:0",
            "title": "Uber Stock Tanks 7.4%--But Is This a Golden Buying Opportunity?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uber Technologies  just took a hit, with shares sliding over 7.4% as of 11.31am today, after its latest earnings report failed to impress Wall Street. The ride-hailing giant posted solid revenue of $11.96 billion, beating expectations, but adjusted earnings of $0.23 per share fell well short of analysts' $0.50 forecast. Investors weren't thrilled with Uber's Q1 outlook eithergross bookings are expected to rise 17% to 21%, but that wasn't enough to satisfy a market that wanted stronger momentum. Add in rising costs and currency headwinds, and suddenly, a 40% jump in adjusted EBITDA wasn't enough to keep the stock afloat.</p><p class=\"\">Uber's leadership isn't sweating it. The company is doubling down on its belief that the stock is undervalued, backing it up with a $1.5 billion accelerated buyback. Free cash flow more than doubled in Q4 to $1.7 billion, giving Uber plenty of firepower to return value to shareholders. Meanwhile, the company is making big moves in self-driving techpartnering with Alphabet's Waymo to roll out autonomous taxis in Austin. But competition isn't backing down. Lyft  is coming in hot with aggressive pricing strategies, looking to chip away at Uber's dominance.</p><p class=\"\">Despite the market's reaction, Uber's fundamentals remain strong. The company is pushing ahead with automation, expanding its business-focused services, and stacking up free cash flow. Short-term volatility is part of the game, but with its market dominance and strategic bets, Uber could be setting itself up for a big comeback.</p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:7a9d13ad4094b:0-uber-stock-tanks-7-4-but-is-this-a-golden-buying-opportunity/",
            "pub_date": "2025-02-06 00:36:38",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0VZ:0",
            "title": "Euro zone yields drop to multi-week lows, await ECB neutral rate estimate",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Euro area government bond yields dropped to multi-week lows on Wednesday as investors focused on the possible disinflationary impact of U.S. tariffs, which could prompt the European Central Bank to accelerate interest rate cuts.</p><p class=\"\">Investors are also awaiting updated estimates of the so-called neutral rate (R*) that ECB staff will publish on Friday.</p><p class=\"\">R* is the interest rate level that keeps the economy in balance, with full employment and stable inflation, and is usually the rate target for central banks.</p><p class=\"\">\"Friday's revision could conclude a tighter range with a higher minimum,\" Citi said, recalling that in Davos, ECB President Christine Lagarde had indicated 2.25% and 1.75%.</p><p class=\"\">Money markets priced in an ECB deposit facility rate of 1.85% in December (EURESTECBM7X8=ICAP), compared to 1.95% late on Friday before the tariff announcements by U.S. President Donald Trump.</p><p class=\"\">Some analysts argue that the demand shock facing euro zone exporters in the event of higher U.S. import duties is likely to be more significant than any inflationary effect caused by potential retaliatory tariffs from the European Union.</p><p class=\"\">Germany's 10-year bond yield (DE10YT=RR), the benchmark for the euro zone bloc, fell 4 basis points (bps) to 2.354%, after touching its lowest level since Jan. 2 at 2.345%.</p><p class=\"\">German two-year yields (DE2YT=RR), more sensitive to ECB rate expectations, were down one bp at 2.047%. It hit 2.01% on Monday, its lowest since Dec. 20. </p><p class=\"\">The ECB is confident that inflation will slow to near 2% this year, but there are still uncertainties, particularly surrounding the geopolitical situation, the bank's vice president, Luis de Guindos, said in an interview.</p><p class=\"\">Economists said investors were not taking Trump's comments about the U.S. taking over Gaza seriously, but flagged that any move of that kind would heighten tensions in the Middle East, boosting oil prices.</p><p class=\"\">The yield spread between French OATs and German Bunds (DE10FR10=RR) - a market gauge of the risk premium investors demand to hold French debt - held steady at 71.6 bps. </p><p class=\"\">The spread had widened to around 90 bps, its highest since 2012, in mid-January amid fears that France would be unable to cut its growing budget deficit.</p><p class=\"\">French far-right leader Jordan Bardella suggested on Tuesday his party would probably not back no-confidence motions against Francois Bayrou's minority government, which rammed the 2025 budget bill through parliament on Monday. </p><p class=\"\">\"An ongoing OAT recovery should be used to add to structural shorts in the semi-core complex against Iberia and European Union (bonds),\" said Michael Leister, analyst at Commerzbank.</p><p class=\"\">Semi-core euro area bonds include those from France, Belgium and the Netherlands.</p><p class=\"\">Italy's 10-year yield  dropped 5 bps to 3.446%. Earlier in the day it touched 3.43%, its lowest since Dec. 18.</p><p class=\"\">The gap between Italian and German yields (DE10IT10=RR) stood at 108.2 bps.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0VZ:0-euro-zone-yields-drop-to-multi-week-lows-await-ecb-neutral-rate-estimate/",
            "pub_date": "2025-02-06 00:36:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008158:0",
            "title": "CyberArk Software Is Maintained at Outperform by Oppenheimer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:38 GMT) </strong>CyberArk Software Price Target Raised to $420.00/Share From $360.00 by Oppenheimer</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008158:0/",
            "pub_date": "2025-02-06 00:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008161:0",
            "title": "Connecticut Housing Finance Authority to Issue $121M of Sustainability Bonds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Zaeem Shoaib</p><p class=\"\">The Connecticut Housing Finance Authority is issuing nearly $121 million of sustainability bonds to finance housing programs.</p><p class=\"\">The Housing Mortgage Finance Program Bonds, 2025 Series B, consist of $33.6 million in  Subseries B-1 and $13.6 million in  Subseries B-2 bonds that are tax-exempt, according to documents posted Tuesday on MuniOS. The securities also include $42.1 million in Subseries B-3 and $31.8 million in Subseries B-4 bonds that are federally taxable. Interest on the bonds is payable on each May 15 and Nov. 15. The bonds mature between 2025 and 2060.</p><p class=\"\">Pricing is preliminarily scheduled for Feb. 10 and delivery on Feb. 25.</p><p class=\"\">Proceeds will be used to finance new multifamily mortgage loans and cover certain issuance costs.</p><p class=\"\">The bond are secured by revenue earned by the authority from the operations of its Housing Mortgage Finance Program.</p><p class=\"\">Moody's has rated the debt Aaa and S&amp;P assigned the bonds a rating of AAA. The Subseries B-2 bonds also have a short term rating of A-1+ from S&amp;P.</p><p class=\"\">Morgan Stanley is lead manager for the issuance.</p><p class=\"\">Write to Zaeem Shoaib at zaeem.shoaib@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008161:0/",
            "pub_date": "2025-02-06 00:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310266:0",
            "title": "Canada's Trade Balance Swings to Surplus as Exporters Rush to Beat U.S. Tariffs, Says National Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canada's merchandise trade balance Wednesday returned to surplus for the first time in 10 months in December, with exports growing at a much faster pace than imports, noted National Bank of Canada. </p><p class=\"\">The rise in international shipments was mainly due to two factors, said the bank. The first was a marked increase in the price of energy products (+6.0%), particularly crude oil (+9.0%), which enabled exports in this segment to reach their highest level in two years at C$16.0 billion. </p><p class=\"\">As the United States is the main destination for Canada's energy exports, it was no surprise to see the trade surplus with the U.S. reach a 30-month high of C$11.3 billion, pointed out National Bank. Whether this is good news from the point of view of Canada's negotiations with the new U.S. administration is another matter. </p><p class=\"\">The second factor behind the sharp rise in exports in December was the desire of many Canadian businesses to move their shipments ahead of the possible imposition of tariffs by the U.S., stated the bank. This same desire was probably also behind the rise in imports, as some of Canada's U.S. trading partners probably feared the imposition of retaliatory measures by Ottawa. </p><p class=\"\">The study of trade volumes on a quarterly basis suggests that international trade will make a positive contribution to gross domestic product growth in Q4 2024, with exports (+10.6% annualized) growing at a higher rate than imports (+9.2%), added National Bank. The decline in import volumes in the machinery equipment category (-5.9% annualized), meanwhile, suggests business equipment spending declined further in the quarter. </p><p class=\"\">For 2024 as a whole, the Canadian goods trade balance showed a C$7.2 billion deficit, the largest shortfall in four years but still smaller than what National Bank had been accustomed to in the years preceding the COVID-19 pandemic. Crucially, the goods trade balance with the U.S. narrowed a bit, moving from C$108.3 billion to a three-year low of C$102.3 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310266:0/",
            "pub_date": "2025-02-06 00:38:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008162:0",
            "title": "Griffon CEO: Will Mitigate Tariffs Through Pricing, Negotiations — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Griffon CEO Ronald Kramer says on a call with analysts that he's comfortable backing the company's 2025 outlook, calling the tariff situation extremely fluid. \"Similar to tariffs in 2018, we expect to mitigate the effects of changing tariff policy through a combination of price, supply renegotiations and further diversifying our global supply chain,\" he says. The company has \"significant amounts\" of product coming from China in its lawn and garden and Hunter Fan businesses, but those are the only area where tariffs could have an effect, Kramer adds. Shares rise 10% after reporting better-than-expected earnings in its fiscal 1Q. (connor.hart@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008162:0/",
            "pub_date": "2025-02-06 00:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446796:0",
            "title": "Gasoline Futures Fall after EIA Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US gasoline futures fell below $2.05 per gallon after EIA data showed a larger-than-expected build in US crude and gasoline stocks.</p><p class=\"\">Crude inventories increased by 8.664 million barrels for the week ending Jan. 31, the biggest rise in almost a year, surpassing expectations of a 2.6 million barrel build.</p><p class=\"\">Gasoline stocks also grew by 2.233 million barrels, well above the forecasted 1.2 million increase.</p><p class=\"\">Also, market sentiment remained cautious due to trade tensions, with China retaliating against US tariffs by imposing levies on American coal, LNG, and crude oil, raising concerns about lower global demand.</p><p class=\"\">However, the market was supported by supply risks linked to President Trump’s \"maximum pressure\" campaign against Iran, which aims to reduce its oil exports to zero, potentially removing 1.5 million barrels per day from global supply.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446796:0-gasoline-futures-fall-after-eia-report/",
            "pub_date": "2025-02-06 00:39:20",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310268:0",
            "title": "B. Riley Adjusts Fiserv's Price Target to $249 From $218, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fiserv  has an average rating of buy and mean price target of $238.93, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310268:0/",
            "pub_date": "2025-02-06 00:39:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310271:0",
            "title": "Keefe Bruyette & Woods Adjusts Fiserv's Price Target to $260 From $238, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fiserv  has an average rating of buy and mean price target of $238.93, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310271:0/",
            "pub_date": "2025-02-06 00:39:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008170:0",
            "title": "Walmart Is Maintained at Outperform by Oppenheimer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:40 GMT) </strong>Walmart Price Target Raised to $110.00/Share From $100.00 by Oppenheimer</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008170:0/",
            "pub_date": "2025-02-06 00:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX2RghFv:0",
            "title": "PawnTrust celebrates the start of Black History Month and launches its weekly \"CEO Corner\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ATLANTA, GA, Feb.  05, 2025  (GLOBE NEWSWIRE) — Dinewise, Inc (OTC PINK-DWIS) (referred to as \"Dinewise\", \"we\", \"us\", \"our\" or the \"Company\") a fintech company operating as PawnTrust Inc., providing solutions to the pawn shop industry celebrates the start of Black History Month and launches its weekly \"CEO Corner\" on its You Tube Channel.</p><p class=\"\">As America commemorates Black History Month, PawnTrust honors the invaluable contributions of African American pioneers who have shaped this nation and upon whose shoulders we stand today. The company recognizes the sacrifices and resilience of its forebears and remains committed to preserving their legacy. \"When I was young, I was fortunate to accompany my father to meetings with African American disruptors of change. At the time, I didn’t understand the significance of those gatherings, but now realize I am a direct beneficiary of their efforts,\" Michael Farr, CEO.</p><p class=\"\">As previously announced in shareholder updates, Dinewise, Inc. will officially change its name to PawnTrust, Inc. in Q1 2025. Along with this rebranding, the company will undergo a ticker symbol change and file a new registration statement. Additionally, the final agreement for the acquisition of TitlePal, a fintech title loan company, is progressing ahead of schedule. The transaction is expected to close within the same timeframe as the registration statement, further strengthening PawnTrust’s strategic growth initiatives. Furthermore, PawnTrust is in talks regarding a major acquisition and expects to announce it in early Q2 2025.</p><p class=\"\">PawnTrust's commitment to perseverance and integrity is ingrained in its corporate culture. The company stands on three fundamental pillars<strong class=\"root-Tkn6WL2y\">: transparency, timeliness, and trust.</strong> The upcoming name change to PawnTrust amplifies the critical pillar of trust. To reinforce these values and foster direct engagement with shareholders and the investment community, CEO Michael Farr will host a weekly \"CEO Corner\" on YouTube. This series will provide an in-depth look into the business, its strategies, and its leadership vision. <strong class=\"root-Tkn6WL2y\">The first episode of \"CEO Corner\" will premiere on</strong> <!-- -->Friday, February 7, 2025, at 2 PM Eastern Time. Tune in on <strong class=\"root-Tkn6WL2y\">http://www.youtube.com/@pawntrust</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About PawnTrust</strong></p><p class=\"\">PawnTrust is an exclusively tailored marketplace for the estimated 11,000 pawn shops nationwide. The online marketplace (www.pawntrust.com) digitizes the inventory using advanced image recognition algorithms to automate item descriptions of the participating pawn shops and markets them on a national scale. The marketplace contains cutting-edge technology that streamlines the borrowing, buying, and bartering transactions typically found at a pawn shop. The platform plans to leverage Artificial Intelligence (AI) to optimize pricing, reduce fraud, and create personalized search recommendations to enhance the customer's experience. These enhancements let consumers experience a frictionless shopping experience on their mobile app that gives them instant access to this nationwide inventory of pawn shops. Not only does this provide a more efficient way for consumers to shop, eliminating the need to visit multiple stores, but it also amplifies the reach of individual pawn shop owners. By joining the PawnTrust- 'Pawn Partners' network, shop owners gain access to a broader audience, enhancing their visibility and sales opportunities. This innovative approach aligns customer convenience with business growth, reshaping how people interact with the pawn industry. Consumers that purchase items outside of their local area will have their items conveniently shipped to them. As the intermediary in each transaction, PawnTrust earns a fee on every item sold in the marketplace. Many of these local pawn shops lack an online presence or the capital to market their inventory on a national scale. By bridging this gap, PawnTrust opens up opportunities for incremental sales from a wider buying base, effectively transforming the pawn shop and micro-lending industries. This model not only supports local businesses but also extends their reach, driving growth and innovation within the market.\" </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Information</strong></p><p class=\"\">This release includes statements that may constitute ''forward-looking'' statements, usually containing the words ''believe,'' ''estimate,'' ''project,'' ''expect'' or similar expressions. These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. While the Company believes the expectations reflected in forward-looking statements are reasonable, there can be no assurances such expectations will prove to be accurate. Security holders are cautioned such forward-looking statements involve risks and uncertainties. Certain factors may cause results to differ materially from those anticipated by the forward-looking statements made in this release. Factors that would cause or contribute to such differences include, but are not limited to, acceptance of the Company's current and future products and services in the marketplace, the ability of the Company to develop effective new products and receive regulatory approvals of such products, competitive factors, dependence upon third-party vendors, risks and uncertainties related to the current unknown duration and severity of the COVID-19 pandemic and other risks detailed in the Company's periodic report filings with the Securities and Exchange Commission. By making these forward-looking statements, the Company undertakes no obligation to update these statements for revisions or changes after the date of this release.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations:</strong></p><p class=\"\">Resources Unlimited</p><p class=\"\">718-269-3366</p><p class=\"\">mike@resourcesunlimitedllc.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX2RghFv:0-pawntrust-celebrates-the-start-of-black-history-month-and-launches-its-weekly-ceo-corner/",
            "pub_date": "2025-02-06 00:40:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310272:0",
            "title": "Oppenheimer Adjusts Fiserv's Price Target to $252 From $239, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fiserv  has an average rating of buy and mean price target of $238.93, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310272:0/",
            "pub_date": "2025-02-06 00:40:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008134:0",
            "title": "Ingredion Is Maintained at Outperform by Oppenheimer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:32 GMT) </strong>Ingredion Price Target Cut to $167.00/Share From $178.00 by Oppenheimer</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008134:0/",
            "pub_date": "2025-02-06 00:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEExfDlWa:0",
            "title": "Romanian stock indices rebound, Electrica leads gainers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BUCHAREST (Romania), February 5 (SeeNews) - Romania's stock indices closed mixed on Wednesday, as power supplier and distributor Electrica [BSE:EL] led blue-chip gainers, data from the Bucharest Stock Exchange, BVB, indicated.</p><p class=\"\">The total equity turnover of the BVB amounted to some 38.29 million lei ($8 million/7.7 million euro) on Wednesday, down from 59.77 million lei recorded on Tuesday, BVB's website showed.</p><p class=\"\">Electrica led blue-chip gainers on Wednesday as its share price rose by 2.69% to 14.5 lei.</p><p class=\"\">Blue-chip oil and gas group OMV Petrom [BSE:SNP] saw its shares gain 1.65%, closing at 0.74 lei and generating the day's largest trading turnover, of 9.54 million lei.</p><p class=\"\">Shares of blue-chip lender Banca Transilvania [BSE:TLV] closed 0.18% lower at 27.3 lei in the day's second largest trading turnover, of 9.09 million lei.</p><p class=\"\">Hydropower producer and supplier [BSE:H2O] saw its shares inch up by 0.08% to 122.8 lei in the day's third largest trading turnover, of 5.05 million lei.</p><p class=\"\">Details follow:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tr><td>BUT</td><td>17,080.62</td><td>0.68%</td></tr><tr><td>BET-TR</td><td>37,665.61</td><td>0.68%</td></tr><tr><td>BET-BK</td><td>3,200.19</td><td>0.65%</td></tr><tr><td>BETPlus</td><td>2,521.71</td><td>0.61%</td></tr><tr><td>BET-FI</td><td>62,669.46</td><td>0.57%</td></tr><tr><td>BET-NG</td><td>1,240.25</td><td>0.97%</td></tr><tr><td>BET-XT</td><td>1,471.41</td><td>0.65%</td></tr><tr><td>BET-XT-TR</td><td>3,189.67</td><td>0.65%</td></tr><tr><td>BET-TRN</td><td>36,610.88</td><td>0.68%</td></tr><tr><td>BET-XT-TRN</td><td>3,106.95</td><td>0.65%</td></tr><tr><td>BETAeRO</td><td>880.56</td><td>-0.30%</td></tr><tr><td>BET-EF</td><td>929.36</td><td>0.74%</td></tr><tr><td>ROTX</td><td>38,075.90</td><td>0.66%</td></tr></table></div><p class=\"\">BET is the first index developed by BVB and represents the reference index for the local capital market. BET reflects the performance of the most traded companies on BVB’s regulated market, excluding financial investment companies (SIFs). It now includes 20 companies.</p><p class=\"\">BET-TR is the first total return index launched by BVB. It is based on the structure of market reference index BET. BET-TR tracks the price changes of its component shares and is adjusted to also reflect the dividends paid by constituent companies.</p><p class=\"\">BET-FI is the first sector index launched by BVB and reflects the price changes of SIFs and of other assimilated entities.</p><p class=\"\">BET-BK was designed to be used as a benchmark by asset managers and other institutional investors.</p><p class=\"\">BET-NG is a sector index which reflects the evolution of all the companies listed on BVB’s regulated market included in the energy and related utilities sector. The maximum index weight a company can hold is 30%.</p><p class=\"\">BET-XT tracks the price changes of the 25 most traded companies listed on BVB’s Regulated Market, including SIFs.</p><p class=\"\">BET-XT-TR is the total return version of BET-XT index, which includes the 25 most traded Romanian companies listed at BVB.</p><p class=\"\">ROTX is an index developed by BVB together with Vienna Stock Exchange. It tracks, in real-time, the price changes of the blue-chip shares traded on the Bucharest Stock Exchange.</p><p class=\"\">BET AeRO is the first index for the AeRO market developed by BVB which reflects the price performance of the representative companies listed on the AeRO market that meet the liquidity and free-float market capitalization criteria. It is a free-float market capitalisation-weighted index, with the maximum weight of 15% for an index constituent.</p><p class=\"\">(1 euro=4.9766 lei)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEExfDlWa:0-romanian-stock-indices-rebound-electrica-leads-gainers/",
            "pub_date": "2025-02-06 00:32:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1TC:0",
            "title": "Alphabet shares set for worst day in over a year after results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Alphabet  slump 8.3% to $189.31 - set for worst day since Oct. 2023 after cloud growth concerns, heavy capital expenditure plans unnerve investors</p><p class=\"\">** Google-parent reports lower-than-expected Q4 cloud revenue, and plans to spend $75 billion on its AI build-out</p><p class=\"\">** Analysts had forecast capex spending of about $58 billion, as per estimates compiled by LSEG</p><p class=\"\">** Shares fall to lowest intraday level in nearly one month </p><p class=\"\">     ** At least 10 brokerages cut PT on stock, while at least 2 hike it; median PT is now $217.06 - LSEG</p><p class=\"\">** Google also announces updates to Gemini large language AI models, including new line with cheaper pricing</p><p class=\"\">** If day's losses hold, GOOGL shares will erase nearly all its gains for this year</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1TC:0-alphabet-shares-set-for-worst-day-in-over-a-year-after-results/",
            "pub_date": "2025-02-06 00:32:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310247:0",
            "title": "GeneDx Shares Fall After Short-Seller Grizzly Research Alleges 'Illegal Billing Practices'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GeneDx Holdings  shares were down over 5% in recent Wednesday trading following a Grizzly Research report alleging that the company is inflating its revenue through illegal billing practices. </p><p class=\"\">The report claims GeneDx has been using a method called \"code stacking\" that involves billing insurers with multiple procedure codes for the same test to secure reimbursements above standard rates. </p><p class=\"\">Insiders said that CEO Katherine Stueland and CFO Kevin Feeley have consistently sold shares immediately upon vesting, suggesting they might be aware of an \"imminent risk,\" the report said. Additional allegations from the short-seller include that the company operated \"independent\" counselor entities to steer patients exclusively toward its testing services. </p><p class=\"\">The Department of Justice is stepping up its scrutiny of billing practices in Medicare and Medicaid, with penalties already exceeding $800 million for similar fraud cases and they expect GeneDx to be next if further evidence of wrongdoing emerges, Grizzly Research said, citing industry sources. </p><p class=\"\">GeneDx did not immediately respond to a request for comment from MT Newswires.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310247:0/",
            "pub_date": "2025-02-06 00:32:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1U6:0",
            "title": "Bearings maker Timken rises on Q4 profit beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Bearings and industrial motion products maker Timken's  shares rise 2.26% to $80.69, highest since Nov. 4</p><p class=\"\">** Co reports Q4 adj profit of $1.16 per share, above analysts' average estimate of $0.99 per share - data compiled by LSEG</p><p class=\"\">** Also reports Q4 net sales of $1.07 bln</p><p class=\"\">** Expects outlook FY25 adj profit between $5.30 per share and $5.80 per share</p><p class=\"\">** Says cost cutting can save ~$75 million in 2025</p><p class=\"\">** Shares fell ~10.95% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1U6:0-bearings-maker-timken-rises-on-q4-profit-beat/",
            "pub_date": "2025-02-06 00:33:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446794:0",
            "title": "Oil Extends Losses after EIA Data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WTI crude oil futures dropped to $71.20 per barrel on Wednesday following an EIA report that showed a larger-than-expected rise in US crude inventories.</p><p class=\"\">Stocks increased by 8.664 million barrels last week, the largest build in nearly a year, surpassing the market forecast of a 2.6 million barrel rise and the 5.025 million barrel increase reported by the API. Gasoline inventories also grew, while distillates declined.</p><p class=\"\">Trade tensions between the US and China added pressure, as China retaliated with tariffs on American coal, LNG, and crude oil, raising concerns about reduced global demand.</p><p class=\"\">On the upside, supply risks related to US sanctions on Iran supported prices.</p><p class=\"\">President Trump's renewed \"maximum pressure\" campaign aims to cut Iran's oil exports to zero, potentially removing 1.5 million barrels per day from the market.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446794:0-oil-extends-losses-after-eia-data/",
            "pub_date": "2025-02-06 00:33:32",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464076:0",
            "title": "Lleida.net Plans Restructuring of Some Subsidiaries, Continued Focus on Europe, Latin America",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lleida.net  said Wednesday it will launch a review to restructure subsidiaries with an unclear medium-term outlook. </p><p class=\"\">Chief Executive Sisco Sapena told investors that the Spanish electronic signatures and digital certificates company will also keep its focus on expanding in Europe and Latin America, as these regions provide organic and significant growth potential.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464076:0/",
            "pub_date": "2025-02-06 00:33:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008146:0",
            "title": "Enphase Energy Is Maintained at Outperform by Oppenheimer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008146:0/",
            "pub_date": "2025-02-06 00:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446795:0",
            "title": "Brent Crude Oil Falls Below $75",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brent crude oil futures dropped below $75 per barrel on Wednesday following an EIA report that showed a larger-than-expected rise in US crude inventories.</p><p class=\"\">Stocks increased by 8.664 million barrels last week, the largest build in nearly a year, surpassing the market forecast of a 2.6 million barrel rise and the 5.025 million barrel increase reported by the API. Gasoline inventories also grew, while distillates declined.</p><p class=\"\">Trade tensions between the US and China added pressure, as China retaliated with tariffs on American coal, LNG, and crude oil, raising concerns about reduced global demand.</p><p class=\"\">On the upside, supply risks related to US sanctions on Iran supported prices.</p><p class=\"\">President Trump's renewed \"maximum pressure\" campaign aims to cut Iran's oil exports to zero, potentially removing 1.5 million barrels per day from the market.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446795:0-brent-crude-oil-falls-below-75/",
            "pub_date": "2025-02-06 00:34:09",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW27N:0",
            "title": "Portugal's central bank chief positive on Novo Banco IPO, urges caution on M&A",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Novo Banco's planned initial public offering would be beneficial for the Portuguese banking sector, Bank of Portugal Governor Mario Centeno said on Wednesday, but he urged a cautious approach to any further acquisitions or consolidation.</p><p class=\"\">Novo Banco was created in 2014 as a result of a government bailout of collapsed Banco Espirito Santo. U.S. fund Lone Star owns a 75% stake, with Portugal's resolution fund and the state holding the rest.</p><p class=\"\">Sources with knowledge of the matter have told Reuters that Lone Star was considering an IPO as well as a full sale of Novo Banco, worth about 5 billion euros ($5.21 billion), which could lead to a merger with another bank operating in Portugal.   </p><p class=\"\">\"I will see that (IPO) as a good outcome for the functioning and competitiveness of the (Portuguese) banking sector,\" Centeno told Reuters in an interview. He said it would be very good to see Portugal's fourth-largest bank going public because only one lender in the country, Millennium BCP , is listed.    </p><p class=\"\">Portugal's top five banks already control more than 80% of the country's banking assets, but analysts see room for further consolidation.</p><p class=\"\">Centeno said: \"The consolidation is one theme that the market again has to dictate\". But he urged players to be \"cautious and careful\" so as not to jeopardise the good results that Portugal's financial system has achieved in recent years in terms of capital, liquidity and cost-to-income.</p><p class=\"\">\"We need to understand what each part can achieve and what is the goal because the stability of the sector requires the units that operate in it also need to be stable,\" he said. He noted that in the past, several M&amp;A moves in the sector had ultimately failed, an experience not worth repeating. He did not give more details.</p><p class=\"\">In June, CEO of state-owned Caixa Geral de Depositos, Paulo Macedo, said his bank, Portugal's largest, was considering \"all the hypotheses\" to buy another lender to preserve its market leadership in the face of expansion by foreign banks, particularly Spanish banks.</p><p class=\"\">Centeno was more cautious: \"Caixa is a very important bank, but that also brings responsibilities. It is a business decision with systemic consequences that must be analysed.\" </p><p class=\"\">The other major banks in the country include the Portuguese unit of Spain's Santander  and Banco BPI, owned by Spain's CaixaBank .</p><p class=\"\">($1 = 0.9599 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW27N:0-portugal-s-central-bank-chief-positive-on-novo-banco-ipo-urges-caution-on-m-a/",
            "pub_date": "2025-02-06 00:34:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310234:0",
            "title": "loanDepot, Onx Homes Launch New Joint Venture",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">loanDepot  and Onx Homes said Wednesday they have formed a new joint venture, Onx X+ Mortgage, to provide financing option for new homebuyers in Florida and Texas. </p><p class=\"\">The venture is headquartered in Georgetown, Texas, they said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310234:0/",
            "pub_date": "2025-02-06 00:34:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008154:0",
            "title": "Copenhagen Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  OMX CPH 20 Index            2,085.53     +58.63      +2.89 <br/>  Index Components <br/>  Danske Bank                   212.80      +0.70      +0.33 <br/>  A.P. Moeller-Maersk A      10,510.00     -90.00      -0.85 <br/>  A.P. Moeller-Maersk B      10,870.00     -35.00      -0.32 <br/>  Carlsberg Series B            733.20     -14.40      -1.93 <br/>  GN Store Nord                 150.60      -3.35      -2.18 <br/>  NKT                           459.40     -11.40      -2.42 <br/>  Novo Nordisk Series B         619.50     +26.90      +4.54 <br/>  DSV                         1,418.00      -6.00      -0.42 <br/>  Jyske Bank                    515.00      -1.50      -0.29 <br/>  Coloplast Series B            800.20      +1.40      +0.18 <br/>  Rockwool Series B           2,496.00       unch       unch <br/>  Demant                        263.40     -18.80      -6.66 <br/>  Vestas Wind Systems           109.50      +8.45      +8.36 <br/>  Genmab                      1,402.50     +14.50      +1.04 <br/>  Novonesis Series B            409.50      +4.10      +1.01 <br/>  Tryg                          145.60      +0.70      +0.48 <br/>  Pandora                     1,341.50     -32.50      -2.37 <br/>  Zealand Pharma                736.50     +48.50      +7.05 <br/>  ISS A/S                       137.40      +0.20      +0.15 <br/>  Oersted                       281.20      +9.10      +3.34 <br/>Prices in Kroner <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008154:0/",
            "pub_date": "2025-02-06 00:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXbHxcv:0",
            "title": "40 Weeks to a CCIE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cary, NC, Feb.  05, 2025  (GLOBE NEWSWIRE) — The Cisco Certified Internetwork Expert (CCIE) certification is widely viewed as one of the most prestigious network security certifications in the Information Technology industry. Those who achieve their CCIE certification are considered some of the most knowledgeable experts in the industry. That said, untangling how to study for CCIE exams can be an intimidating and complex challenge INE, a global provider of Network training and certification preparation, is releasing a pace-setting guide to achieving the CCIE certification in 40 weeks created by Brian McGahan, INE’s Director of Networking Content and once of the youngest people to ever achieve his CCIE at age 20. </p><p class=\"\">McGahan, CCIE #8593,  has achieved his CCIE certification in Security, Routing &amp; Switching, Service Provider, and Data Center, and has led thousands of students through the rigorous training required to achieve the CCIE certification. “With this pace, you'll need roughly 40 weeks to watch all the videos, get hands-on with the labs, and review everything with quizzes.,” McGahan says. “ It’s a steady and realistic plan, and INE’s CCIE Enterprise Infrastructure Learning Path is designed to help you stay on track and make it happen.”</p><p class=\"\">McGahan recommends splitting INE’s CCIE Enterprise Infrastructure Learning Path over 40 weeks, broken down first based on the technology sections of the CCIE Enterprise Infrastructure Exam topics, followed by deep dives on core topics, then final preparation before sitting the CCIE Lab Exam. McGahan’s recommended approach includes:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Networking Infrastructure (Weeks 1-11):</strong> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Topics include LAN Switching, Routing Concepts, EIGPR, OSPF, BGP, IPv6 Routing, and Multicast  </li></ul> </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Software Defined Infrastructure (Weeks 12-16):</strong> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Focuses on implementing Cisco SD-Access with DNA Center and Cisco SD-WAN  </li></ul> </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Transport Technologies &amp; Solutions (Weeks 17-19):</strong> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Covers MPLS and IPsec with DMVPN  </li></ul> </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Infrastructure Security &amp; Services (Weeks 20-22):</strong> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Network Security, QoS, and Network Services  </li></ul> </li><li class=\"listItem-bmN0_SHH\">Infrastructure Automation &amp; Programmability (Weeks 23-30):   <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Automation using NETCON/RESTCONF, Python, API calls for SD-WAN &amp; SD-Access, and Telemetry  </li></ul> </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Deep Dives (Weeks 31-35):</strong> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Delves Deep into core topics of EIGRP, OSPF, BGP, MPLS, and DMVPN  </li></ul> </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Final Preparation (Weeks 36-40):</strong> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Focuses on lab exam review and final lab practice   </li></ul> </li></ul><p class=\"\">“Passing the CCIE Enterprise Infrastructure v1.1 Lab Exam is no small feat,” McGahan says, “but with a clear plan and the right resources, it’s entirely achievable. By committing to a consistent study routine, even with just 8 hours a week, you can master the technologies, refine your skills in the labs, and build the confidence you need to tackle the exam.”</p><p class=\"\">INE’s CCIE Enterprise Infrastructure Learning Path provides a structured, comprehensive roadmap that aligns perfectly with this timeline. Success in the CCIE journey is not about giant leaps - it is about steady progress, one step at a time. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About INE Security:</strong></p><p class=\"\">INE is the premier provider of online networking and networking training and certification. Harnessing a powerful hands-on lab platform, cutting-edge technology, a global video distribution network, and world-class instructors, INE is the top training choice for Fortune 500 companies worldwide for IT/IS training in business and for IT/IS professionals looking to advance their careers. INE’s suite of learning paths offers an incomparable depth of expertise across networking and is committed to delivering advanced technical training while also lowering the barriers worldwide for those looking to enter and excel in an IT/IS career.</p><p class=\"\">Kathryn Brown</p><p class=\"\">INE</p><p class=\"\">917-715-0911</p><p class=\"\">kbrown@ine.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXbHxcv:0-40-weeks-to-a-ccie/",
            "pub_date": "2025-02-06 00:35:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310246:0",
            "title": "Southwest Airlines Keeps Quarterly Dividend at $0.18 a Share, Payable April 2 to Holders of Record on March 12",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310246:0/",
            "pub_date": "2025-02-06 00:27:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008102:0",
            "title": "Zillow Group Is Maintained at Buy by Benchmark",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:28 GMT) </strong>Zillow Group Price Target Raised to $100.00/Share From $80.00 by Benchmark</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008102:0/",
            "pub_date": "2025-02-06 00:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310249:0",
            "title": "Baird Adjusts AMETEK Price Target to $197 From $200",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AMETEK  has an average rating of overweight and mean price target of $203.50, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310249:0/",
            "pub_date": "2025-02-06 00:28:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310225:0",
            "title": "Advanced Micro Devices' Lack of Datacenter Revenue Growth, AI Visibility Remains Concerning, Morgan Stanley Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Advanced Micro Devices'  overall Q4 results were about in line, however, the main issue remains the lack of growth in datacenter revenue, Morgan Stanley said in a note Wednesday. </p><p class=\"\">The analysts said that in the Q3 earnings call, the company suggested datacenter would be the largest contributor to quarter-over-quarter growth in Q4, but the client segment ended up being the bigger contributor. Even if all the growth versus the midpoint of guidance came from the client segment, both areas still contributed similarly to the quarter-over-quarter growth in December. They added that it is especially disappointing considering that datacenter revenue in H1 is expected to be similar to H2 2024, contrary to their more optimistic view that server business was improving toward the end of 2024. </p><p class=\"\">\"Our biggest concern has been expectations in artificial intelligence, which clearly have come down closer to our level; consensus numbers for calendar year 2025 are likely to come down to our level, and we are relatively optimistic around traditional servers as well as embedded, but AI visibility likely needs to improve for the stock to find its footing,\" the analysts said. </p><p class=\"\">They added that while there may be a slowdown in the client segment at some point due to the strong 2024, it is clear that Advanced Micro Devices can continue to capture modest market share there. That being said, AI expectations still drive the stock's value, and they believe it's important to remain \"conservative\" for the 2025 calendar year, as the transition from the MI325 to MI350 models is not moving as quickly as Nvidia's shift from the H200 to Blackwell models. </p><p class=\"\">Morgan Stanley adjusted its price target on Advanced Micro Devices to $137 from $147 while keeping its equalweight rating. </p><p class=\"\">Shares fell by nearly 9% in recent trading activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310225:0/",
            "pub_date": "2025-02-06 00:28:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}