{
    "data": [
        {
            "id": "urn:summary_document_transcript:quartr.com:2947306:0",
            "title": "BIM: 2025 sales up 6.2% organically, EBIT up 16%, with 2026 guidance for 5–7% sales growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Sales grew 6.2% organically to €4 billion in 2025, with EBIT up 16% and strong cash flow. 2026 guidance targets 5–7% sales growth and at least 10% EBIT growth, despite headwinds from China and currency. Price erosion remains limited and new launches are expected to drive future growth.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947306:0-bim-2025-sales-up-6-2-organically-ebit-up-16-with-2026-guidance-for-5-7-sales-growth/",
            "pub_date": "2026-02-28 00:06:49",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007374:0",
            "title": "Rocket Cos. Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007374:0/",
            "pub_date": "2026-02-28 00:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006837:0",
            "title": "Government Agencies Raise Alarm About Use of Elon Musk's Grok Chatbot — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Shalini Ramachandran, Heather Somerville and Amrith Ramkumar</span></p><p class=\"\"><span>Officials at multiple federal agencies have raised concerns about the safety and reliability of Elon Musk's xAI artificial-intelligence tools in recent months, highlighting continuing disagreements within the U.S. government about which AI models to deploy, according to people familiar with the matter.</span></p><p class=\"\"><span>The warnings preceded the Pentagon's decision this week to put xAI at the center of some of the nation's most sensitive and secretive operations by agreeing to allow its chatbot Grok to be used in classified settings.</span></p><p class=\"\"><span>The Pentagon has given one of xAI's rivals, Anthropic, a Friday deadline to agree to looser rules on its use by the U.S. military. Anthropic was the only developer approved for classified use before the deal between xAI and the military.</span></p><p class=\"\"><span>Throughout the government, agencies are racing to deploy AI for a host of purposes but the debate over which models to use has become increasingly political. Senior U.S. officials including at the White House view Anthropic's outspoken stances on safety and ties to big Democratic donors as potentially making the company too \"woke\" to be a reliable provider, people familiar with the matter said. The looser controls on Grok, and Musk's absolutist stance on free speech, have made it a more attractive choice to the Pentagon.</span></p><p class=\"\"><span>Other officials have questioned whether Grok's looser controls present risks.</span></p><p class=\"\"><span>Ed Forst, the top official at the General Services Administration, a procurement arm of the federal government, in recent months sounded an alarm with White House officials about potential safety issues with Grok, people familiar with the matter said. Other GSA officials under him had also raised safety concerns about Grok, which they viewed as sycophantic and too susceptible to manipulation or corruption by faulty or biased data — creating a potential system risk.</span></p><p class=\"\"><span>At the time, in late December and early January, Grok was under fire for allowing sexualized editing of photos, including of children. Government officials saw the issue as representative of how Grok could be exploited by bad actors.</span></p><p class=\"\"><span>The matter reached Susie Wiles, the White House chief of staff, who called a senior xAI executive about the concerns, the people said. The executive told her that xAI was working on addressing the safety issues that made Grok over-compliant. Josh Gruenbaum, a senior GSA acquisitions official recruited through Musk's Department of Government Efficiency, assured government officials that the government platform of Grok was separate from the public one. Wiles was satisfied, the people said.</span></p><p class=\"\"><span>Musk, who has said he is committed to preventing child exploitation, announced in January that the company would limit the image-generation and editing tools to paying customers. He and xAI didn't respond to requests for comment.</span></p><p class=\"\"><span>In recent weeks, GSA officials were told to put xAI's logo on a tool called USAi, which is essentially a sandbox for federal employees to experiment with different AI models. Grok hadn't been made accessible through USAi largely due to safety concerns, and it remains off the platform, people familiar with the matter said.</span></p><p class=\"\"><span>The website shows xAI's logo but only offers models from Anthropic, Google and Meta .</span></p><p class=\"\"><span>A team at the GSA studying AI has circulated a report to top agency officials that flags Grok's safety problems, the people said. Grok has been suspended for use by GSA staffers for months. Demand from other agencies to use Grok has been anemic, people familiar with the matter said, except in a few cases where people wanted to use it to mimic a bad actor for defensive testing.</span></p><p class=\"\"><span>In a statement, Gruenbaum said the agency takes AI safety seriously. \"We rigorously evaluate frontier AI models, including xAI, through a comprehensive internal review process. In this instance, we followed established procedures and maintain our determination to keep it on schedule,\" he said.</span></p><p class=\"\"><span>Two weeks ago, Matthew Johnson, the Pentagon's chief of responsible AI, stepped down in part over his concerns that safety and governance had become an afterthought amid the Defense Department's intense push to expand AI capabilities, people familiar with the matter said.</span></p><p class=\"\"><span>Previously, Johnson's team had circulated memos that had highlighted Grok's safety issues and questioned whether it was aligned with government ethics and standards. Those notes had been sent up their chain of command at the Pentagon.</span></p><p class=\"\"><span>Reached for comment, Johnson pointed to a LinkedIn post announcing his departure where he said he was proud of his team of \"true, quiet professionals, who had outsized impact and undersized recognition\" in the DOD's Responsible AI Division: \"We were continually faced with impossible situations, but somehow always delivered through a combination of grit &amp; repeated all-nighters.\"</span></p><p class=\"\"><span>\"The department will continue to ensure the safety and security of all models utilized regardless of classification level,\" a Pentagon official said.</span></p><p class=\"\"><span>The National Security Agency, which oversees much of the country's intelligence gathering and processing, conducted a classified review in November 2024 of large language models, including Grok. It determined Grok had particular security concerns that other models, including Anthropic's Claude, didn't, people familiar with the review said. Its conclusion served as a red flag that deterred some parts of the Pentagon from using Grok, the people said.</span></p><p class=\"\"><span>The use of Anthropic's Claude in the U.S. military's operation to capture former Venezuelan President Nicolás Maduro last month intensified its tense dispute with the Pentagon.</span></p><p class=\"\"><span>Anthropic's usage guidelines prohibit Claude from being used to facilitate violence, develop weapons or conduct surveillance, and the company has refused to let the military use its models in all lawful scenarios. xAI has agreed to that language.</span></p><p class=\"\"><span>Defense Secretary Pete Hegseth has given Anthropic until Friday to agree to the military's request for more flexibility or he may bar the company from government work or take legal action to compel it to meet the demands.</span></p><p class=\"\"><span>Many parts of the military have preferred Anthropic's Claude for even unclassified work, people familiar with the work said.</span></p><p class=\"\"><span>xAI got a foothold in the Pentagon through a July contract from the AI office worth up to $200 million, which was also awarded to Google, OpenAI and Anthropic. Google and OpenAI have approval for use in unclassified settings but not classified activities.</span></p><p class=\"\"><span>Until recently, the military has leaned on Claude over Grok because it is seen by many in the industry as a more reliable model, AI and security analysts said.</span></p><p class=\"\"><span>\"I do not believe they are peers in performance right now across all of the capabilities that matter to a customer like the Department of War,\" said Gregory Allen, a senior adviser focused on AI at the Center for Strategic and International Studies think tank. He previously worked on the Defense Department's AI strategy.</span></p><p class=\"\"><span>During the Biden administration, the Chief Digital and AI Office, which is part of the Pentagon, declined to pursue any use of Grok, people familiar with the matter said. The concerns included that Grok made it difficult to track the data sources used to train the model, didn't follow federal government standards for responsible AI, and had weak guardrails for safety. xAI didn't sufficiently try to hack its own technology to identify and fix vulnerabilities, a process known in technology as red teaming, the people said.</span></p><p class=\"\"><span>People who have reviewed Grok in the government setting said that recent testing shows the chatbot is more susceptible than other models to \"data poisoning,\" in which manipulated, biased or inaccurate data corrupts the underlying data sets.</span></p><p class=\"\"><span>On the plus side, U.S. officials have determined Grok to be effective at imitating an adversarial actor, which is useful for example in war gaming, people familiar with the discussions said.</span></p><p class=\"\"><span>Last year, the Pentagon moved the Chief Digital and AI Office under the Research and Engineering Office, a move that was designed to accelerate AI adoption. Critics said the move stripped the office of much of its authority, particularly to enforce responsible AI standards, in favor of expediency.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006837:0/",
            "pub_date": "2026-02-28 00:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2F8:0",
            "title": "Global Yatirim Says 25-Year Concession For Operation Of Sevilla Cruise Port Granted To Its Unit GPH And OPM Sevilla",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Global Yatirim Holding </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GLOBAL YATIRIM - 25-YEAR CONCESSION FOR OPERATION OF SEVILLA CRUISE PORT GRANTED TO UNIT GPH AND OPM SEVILLA</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GLOBAL YATIRIM - PORT OPERATIONS TAKEN OVER BY GPH AND OPM SEVILLA</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2F8:0-global-yatirim-says-25-year-concession-for-operation-of-sevilla-cruise-port-granted-to-its-unit-gph-and-opm-sevilla/",
            "pub_date": "2026-02-28 00:07:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007379:0",
            "title": "Carlyle Secured Lending Is Maintained at Overweight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007379:0/",
            "pub_date": "2026-02-28 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007381:0",
            "title": "Baldwin Insurance Group Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007381:0/",
            "pub_date": "2026-02-28 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_EduqRV0ra:0",
            "title": "REG - Euronext Dublin - GEM Cancellation Notice (EURONEXT DUBLIN) [89317]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89317</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_EduqRV0ra:0-reg-euronext-dublin-gem-cancellation-notice-euronext-dublin-89317/",
            "pub_date": "2026-02-28 00:08:33",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947308:0",
            "title": "DiamondRock Hospitality Company: 2025 revenue reached $1.12B with strong net income and a focus on portfolio quality and balance sheet strength",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Reported $1.12 billion in 2025 revenue with net income of $91.6 million, driven by portfolio optimization and cost controls. Maintained a conservative capital structure, completed major renovations, and redeemed all preferred stock. Positioned for resilient performance in 2026 amid moderate economic growth and ongoing industry challenges.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947308-8ba735287d45b85c14385024fefc5a0a\" target=\"_blank\">DiamondRock Hospitality Company SEC 10-K Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947308:0-diamondrock-hospitality-company-2025-revenue-reached-1-12b-with-strong-net-income-and-a-focus-on-portfolio-quality-and-balance-sheet-strength/",
            "pub_date": "2026-02-28 00:08:56",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007387:0",
            "title": "Crescent Capital BDC Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(16:09 GMT) </span></strong><span>Crescent Capital BDC Price Target Cut to $13.00/Share From $14.00 by Wells Fargo</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007387:0/",
            "pub_date": "2026-02-28 00:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2IA:0",
            "title": "Bua Cement Reports FY PBT Of 465.28 Billion Naira",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BUA Cement PLC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BUA CEMENT PLC: FY REVENUE FROM CONTRACTS WITH CUSTOMERS 1.18 TRILLION NAIRA,PBT 465.28 BILLION NAIRA</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2IA:0-bua-cement-reports-fy-pbt-of-465-28-billion-naira/",
            "pub_date": "2026-02-28 00:09:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7827Ua:0",
            "title": "REG - Tekmar Group PLC - Property Disposal",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7827U  Tekmar Group PLC  27 February 2026   </span><p class=\"\"><span>This announcement contains inside information for the purposes of Article 7 of the Market Abuse Regulation (EU) 596/2014 as it forms part of UK domestic law by virtue of the European Union (Withdrawal) Act 2018 (\"MAR\"), and is disclosed in accordance with the Company's obligations under Article 17 of MAR. Upon the publication of this announcement via a Regulatory Information Service, this inside information is considered to be in the public domain.</span></p><p class=\"\"><span>Tekmar Group plc</span></p><p class=\"\"><span>(\"Tekmar\", the \"Company\" or the \"Group\")</span></p><p class=\"\"><span>Property Disposal  </span></p><p class=\"\"><span>Tekmar Group plc (AIM: TGP), a leading provider of asset protection technology and offshore energy services, is pleased to announce it has today completed the sale of Innovation House and adjacent land (the \"Property\"), the former Subsea Innovation Limited (\"SIL\") freehold premises (the \"Disposal\").  </span></p><p class=\"\"><span>The consideration payable in cash (net of fees) at completion is £2.84m, in-line with the net book value of £2.84m as at 30 September 2025, the latest valuation date prior to the Disposal. The cash proceeds will be used to support the Group's growth and general working capital requirements. Given the consideration is in-line with the net book value of the Property, there is no profit or loss on disposal for the Group.</span></p><p class=\"\"><span>Tekmar vacated the premises in 2024 following the disposal of SIL with the Property subsequently recorded in the accounts as an asset held for sale. In the year ended 30 September 2024, the Property did not generate any income for the Group. The property is being acquired by Trackwork Group Limited.</span></p><p class=\"\"><span>Richard Turner, CEO of Tekmar, commented: \"We are pleased to have completed the disposal of this surplus property. This transaction is an important milestone for Tekmar, significantly bolstering our improving balance sheet, streamlining our asset base and providing additional headroom to support our disciplined investment and growth under Project Aurora.\"</span></p><p class=\"\"><span>Enquiries:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Tekmar Group plc</span></p><p class=\"\"><span> Richard Turner, CEO</span></p><p class=\"\"><span>Phil Lanigan, CFO</span></p></td><td><p class=\"\"><span>c/o +44 (0)20 4582 3500</span></p></td></tr><tr><td><p class=\"\"><span>Cavendish Capital Markets Limited (Nomad and Broker)</span></p><p class=\"\"><span> Peter Lynch</span></p><p class=\"\"><span>Neil McDonald</span></p><p class=\"\"><span>Pearl Kellie</span></p></td><td><p class=\"\"><span>+44 (0)131 220 9772</span></p><p class=\"\"><span>+44 (0)131 220 9771</span></p><p class=\"\"><span>+44 (0)131 220 9775</span></p></td></tr><tr><td><p class=\"\"><span>Gracechurch Group (Financial Media &amp; Investor Relations)</span></p><p class=\"\"><span>Murdo Montgomery</span></p><p class=\"\"><span>Alexis Gore</span></p></td><td><p class=\"\"><span>+44 (0)20 4582 3500</span></p></td></tr></tbody></table></div><p class=\"\"><span>About Tekmar Group plc</span></p><p class=\"\"><span>Tekmar Group plc collaborates with its partners to deliver robust and sustainable engineering led solutions that enable the world's energy transition.</span></p><p class=\"\"><span>Through our Offshore Energy and Marine Civils Divisions we provide a range of engineering services and technologies to support and protect offshore wind farms and other offshore energy assets and marine infrastructure. With near 40 years of experience, we optimise and de-risk projects, solve customer's engineering challenges, improve safety and lower project costs. Our capabilities include geotechnical design and analysis, simulation and engineering analysis, bespoke equipment design and build, subsea protection technology and subsea stability technology. </span></p><p class=\"\"><span>We have a clear strategy focused on strengthening Tekmar's value proposition as an engineering solutions-led business which offers integrated and differentiated technology, services and products to our global customer base.</span></p><p class=\"\"><span>Headquartered in Newton Aycliffe, UK, Tekmar Group has an extensive global reach with offices, manufacturing facilities, strategic supply partnerships and representation in 18 locations across Europe, Africa, the Middle East, Asia Pacific and North America.</span></p><p class=\"\"><span>For more information visit: www.tekmargroup.com</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  DISFLFIRFVIDFIR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7827Ua:0-reg-tekmar-group-plc-property-disposal/",
            "pub_date": "2026-02-28 00:09:30",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0UM:0",
            "title": "Electronic components supplier Surge's fiscal 2025 sales rise",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Capacitor supplier's fiscal 2025 net sales rose 16.4% to $36.3 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net income for fiscal 2025 increased to $1.1 mln, EPS rose to $0.20</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Surge Components expects strong growth in European sales operations in fiscal 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DISTRIBUTION CHANNELS - Surge Components strengthened its distribution sales channels, contributing to increased sales</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EUROPEAN EXPANSION - Surge advanced its sales operations in Europe, positioning for future growth</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AI ECOSYSTEM - Co initiated efforts to explore sales opportunities in the AI ecosystem</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>FY EPS</span></p></td><td></td><td><p class=\"\"><span>$0.20</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Gross Margin</span></p></td><td></td><td><p class=\"\"><span>28.8%</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Gross Profit</span></p></td><td></td><td><p class=\"\"><span>$10.5 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0UM:0-electronic-components-supplier-surge-s-fiscal-2025-sales-rise/",
            "pub_date": "2026-02-28 00:09:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2F9:0",
            "title": "Bioton Q4 Net Profit At 1.8 Mln Zlotys",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bioton SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 NET PROFIT AT 1.8 MILLION ZLOTYS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 REVENUE AT 64.4 MILLION ZLOTYS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 OPERATING PROFIT AT 3.9 MILLION ZLOTYS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2F9:0-bioton-q4-net-profit-at-1-8-mln-zlotys/",
            "pub_date": "2026-02-28 00:10:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007322_20260227007342:0",
            "title": "Schaeffler: This Is to Cut Size of Board of Managing Directors, Achieve Efficiencies",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007322_20260227007342:0/",
            "pub_date": "2026-02-28 00:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007322_20260227007333:0",
            "title": "Schaeffler: Supervisory Board Decided to Look at Combining CTO Role With COO Function",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007322_20260227007333:0/",
            "pub_date": "2026-02-28 00:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:d1fe790c3216f:0",
            "title": "K33 enters into addendum to share purchase agreement regarding Sixty Six Capital Inc. (CSE: SIX)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>On 15 February 2026, K33 AB (publ) (“K33” or the “Company”) announced that it had entered into a share purchase agreement (the “Agreement”) to acquire an approximately 46 percent stake in Sixty Six Capital Inc. (“Sixty Six”), a Canada-based Bitcoin treasury company listed on the Canadian Securities Exchange under the ticker SIX, for a purchase price of approximately CAD 4.7 million, corresponding to 95 percent of the net asset value (“NAV”) attributable to the shares acquired. K33 has today entered into an addendum to the Agreement (the “Addendum”). The Addendum adjusts the purchase price to reflect a correction to the NAV calculation and amends the settlement mechanics of the cash consideration. For more information about Sixty Six and the strategic rationale, please refer to the press release published by the Company on 15 February 2026.</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Terms of the Addendum</span></strong></p><p class=\"\"><span>The adjusted purchase price amounts to CAD 4,678,961, compared to the originally stated purchase price of CAD 4,738,296. The purchase price continues to correspond to 95 percent of the NAV attributable to the shares acquired. As stated in the Agreement, an amount equal to 26.32 percent of the purchase price shall be set off against newly issued shares in K33, at a subscription price of SEK 0.02136. Accordingly, the adjusted purchase price will result in a reduced number of newly issued shares in K33. The share component of the purchase price will now represent a dilution of approximately 2.53 percent of the total number of shares in K33, compared to the originally stated dilution of approximately 2.56 percent.</span></p><p class=\"\"><span>Further, the Addendum sets forth that the cash consideration shall be settled in USD Coin issued as an ERC-20 token on the Ethereum blockchain, rather than by wire transfer in CAD to the sellers.</span></p><p class=\"\"><span>In all essential respects, the other terms of the Agreement are unaltered, including the provisions of the Agreement relating to a potential earn-out payment, which remains payable in cash. Completion of the transaction remains conditional upon the conditions set out in the Agreement, as announced on 15 February 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Advisors</span></strong></p><p class=\"\"><span>K33 has been advised by Wikborg Rein, as lead legal counsel, and by Bennett Jones, with respect to Canadian law, and by TM &amp; Partners, with respect to Swedish law.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For further information, please contact:</span></strong></p><p class=\"\"><span>Torbjørn Bull Jenssen, CEO, K33 AB (publ)</span></p><p class=\"\"><span>E-mail: ir@k33.com</span></p><p class=\"\"><span>Web: k33.com/ir</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About K33</span></strong></p><p class=\"\"><span>K33 AB (publ), listed on Nasdaq First North Growth Market, is the new gold standard for investments in digital assets.K33offers market-leading execution, actionable insights, and superior support to private and institutional partners across EMEA. Mangold Fondkommission serves as the Certified Adviser for K33 AB (publ).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/9a12fe4c-1067-4e79-9520-deb64f2537b6/k33-enters-into-addendum-to-share-purchase-agreement-regarding-sixty-six-capital-inc-cse-six.pdf\" rel=\"nofollow\" target=\"_blank\">K33 enters into addendum to share purchase agreement regarding Sixty Six Capital Inc. (CSE: SIX)</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:d1fe790c3216f:0-k33-enters-into-addendum-to-share-purchase-agreement-regarding-sixty-six-capital-inc-cse-six/",
            "pub_date": "2026-02-28 00:02:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007334:0",
            "title": "Duolingo's Product Track Record Builds Confidence — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Duolingo's track record of prioritizing product quality and testing gives D.A. Davidson analysts confidence, they write in a note, even as the company prioritizes user growth at the expense of short-term monetization. \"We expect that Duolingo will spend the course of 2026 working to find a middle-ground/new monetization tactic that isn't reliant on driving users to subscribe, which we think should eventually pay dividends on daily active user growth over the medium term,\" they write. \"Based on DUOL's prior successes with A/B tests and its product-first approach, we believe these experiments could be successful,\" the analysts add, maintaining a neutral rating. Shares are down 16%. (elias.schisgall@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007334:0/",
            "pub_date": "2026-02-28 00:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0TZ:0",
            "title": "Mexico's Pemex reports Q4 net loss of $8.62 million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Mexican state energy company Pemex booked a net loss of 155.23 million pesos ($8.62 million) and revenues of 362.45 billion pesos for the fourth quarter of last year, a filing with the Mexican stock exchange on Friday showed. </span></p><p class=\"\"><span>Pemex and its partners pumped an average of 1.65 million barrels per day (bpd) of crude oil and condensates during months from October to December and refined 1.14 million bpd.</span></p><p class=\"\"><span> With many fields, especially in the Gulf of Mexico, being depleted and new discoveries not living up to expectations, the company has struggled to meet the government's ambitious production goal of 1.8 million bpd.</span></p><p class=\"\"><span> Pemex reported a financial debt of $85.2 billion at the end of the quarter, and that it had received 395.3 billion pesos in support from the government last year.</span></p><p class=\"\"><span>($1 = 18.0080 Mexican pesos at end-December)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0TZ:0-mexico-s-pemex-reports-q4-net-loss-of-8-62-million/",
            "pub_date": "2026-02-28 00:02:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007322_20260227007346:0",
            "title": "Schaeffler: Remy Triouleyre to Take Over From Schroeder as Regional CEO Europe",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007322_20260227007346:0/",
            "pub_date": "2026-02-28 00:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007345:0",
            "title": "'Rage and the Republic' Review: A Young Nation on the Boil",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Adam J. White</span></p><p class=\"\"><span>Making a government — a good, republican government, at least — requires nothing short of a miracle. Americans know this firsthand, from the creation of our own Constitution. Near the end of his life, James Madison observed that \"there never was an assembly of men, charged with a great and arduous trust, who were more pure in their motives, or more exclusively or anxiously devoted to the object committed to them, than were the members of the Federal Convention of 1787.\"</span></p><p class=\"\"><span>And that was only the first step. Nearly a year after Madison and his compatriots sent their proposed constitution out to the people for ratification, Alexander Hamilton observed that \"the establishment of a Constitution, in time of profound peace, by the voluntary consent of a whole people, is a prodigy.\" A miracle indeed.</span></p><p class=\"\"><span>But unmaking a government requires something different. The Declaration of Independence was preceded by a decadeslong swell of resentment, incitement and violence. In 1768 King George III filled Boston with armed troops, creating a powder keg; in two years the spark of a single rifle shot would explode the Boston Massacre. It took violence, punitive taxes, the Intolerable Acts and more to spur Americans to take the extraordinary step of breaking with Britain. Making the constitution took \"reflection and choice,\" as Hamilton put it; breaking the old order took not only reflection but rage.</span></p><p class=\"\"><span>Those dueling impulses, rage and reason, are the focus of \"Rage and the Republic: The Unfinished Story of the American Revolution\" by Jonathan Turley, a law professor at George Washington University. The question of democratic rage is timeless, and Mr. Turley's historical narrative is sweeping — from the trial of Socrates to the rhetoric of Huey Long. But, as a study of American history at the Declaration's 250th anniversary, he focuses mainly on three things: the American Revolution; the French Revolution that soon followed; and today. Mr. Turley emphasizes the revolutions' ominous echoes, especially with an eye to recent social, economic and political trends.</span></p><p class=\"\"><span>For Americans, King George's abuses of power in the 1760s and '70s stirred discontent and outrage, but even then, the choice to break with Britain was not self-evident. It took the speeches and writings of prominent Americans, especially Thomas Paine, to convince Americans to revolt.</span></p><p class=\"\"><span>Paine's rhetoric involved more than mere ideas. \"While intellectuals like James Iredell had written on the right of the colonies to maintain their own laws and government,\" Mr. Turley writes, \"it was Paine who seemed to speak for the nation in expressing a growing detachment and anger toward England.\"</span></p><p class=\"\"><span>When this anger boiled over, it threatened to scald more than the British. Mr. Turley describes the Philadelphia mob's 1779 assault on the home of James Wilson — what would come to be known as the Fort Wilson riot. Wilson survived the attack and went on to be a major part of the Constitutional Convention and one of America's first great constitutional jurists. Astonishingly, his firsthand experience with mob violence did not prevent him from being one of the convention's most significant populists.</span></p><p class=\"\"><span>Still, Mr. Turley observes, the newly independent Americans' rage \"would prove transformative for many framers in appraising the promise and the perils of democratic systems.\" By 1787 Madison and the other Founders knew that the great challenge for a new constitution was to channel democratic energy into republican institutions.</span></p><p class=\"\"><span>Their wisdom was confirmed by what followed soon after in France, where calls for democracy, seemingly similar to America's own rhetoric, quickly descended into something profoundly different. Here, too, Mr. Turley emphasizes Paine, who arrived in France enthusiastic for revolution and \"saw the fall of the Bastille as the rise of a new humanity in the Age of Enlightenment.\" By the end Paine would be lucky to escape France alive.</span></p><p class=\"\"><span>Coming so soon after 1776, France's revolution has always served as the brutal counterpoint to America's. To highlight the contrast, Mr. Turley recounts France's descent into madness, from Jean-Jacques Rousseau's theory of democratic government carrying out the people's \"general will, \" to the Terror of Robespierre and Saint-Just, until the revolution eventually devoured its own children.</span></p><p class=\"\"><span>Fifty years ago, at America's bicentennial, Martin Diamond, a political scientist, celebrated our founding as \"the revolution of sober expectations.\" Mr. Turley's account of the American and French revolutions reminds us that ours was also a revolution of sober institutions. Even in declaring independence, the American Revolution channeled revolutionary energy through state governments, the Continental Congress and Washington's army. The French Revolution, by contrast, concentrated its energy into the Committee of Public Safety and cults of personality.</span></p><p class=\"\"><span>Such institutional questions are the center of Mr. Turley's closing section. Calls for anti-institutional revolt \"are again being heard in the United States, 250 years later,\" from an increasingly \"disassociated elite of politicians, professors, and pundits,\" he writes. \"Once again, the public is being told that the problem lies in a constitutional system that is too limiting on democratic change.\"</span></p><p class=\"\"><span>There is, indeed, a disconcerting trend of anticonstitutional rhetoric in America, from partisans impatient with the slow pace of our institutions. Mr. Turley spotlights many of them, such as Sen. Elizabeth Warren, who recently played down the murder of a health-insurance executive. \"Violence is never the answer,\" she said, \"but you can only push people so far, and then they start to take matters into their own hands.\"</span></p><p class=\"\"><span>Mr. Turley focuses on anticonstitutional rhetoric on the political left, but political rage is a bipartisan sport. Ascribing it mainly to one faction risks exacerbating the problem.</span></p><p class=\"\"><span>Moreover, Mr. Turley's criticism sometimes misfires. He castigates Mary Ann Glendon, a professor of law at Harvard, for favoring \"collective interests and responsibilities\" over individual rights. But Ms. Glendon does not denigrate rights; far from it. In \"Rights Talk\" (1991), she emphasizes her \"patriotic conviction that, where freedom is concerned, the United States was there first with the best and the most.\" She believes in constitutional rights but warns that framing political issues mainly in terms of competing claims of absolute rights makes our political debates more pointed and less productive. Such arguments echo Edmund Burke, one of the heroes of Mr. Turley's book.</span></p><p class=\"\"><span>Mr. Turley is right to warn against modern anticonstitutional sentiments. He also observes keenly that the problem is exacerbated by concentrating power in the hands of the executive. Americans have now seen this across multiple presidential administrations, where political debates have become mostly debates about presidents.</span></p><p class=\"\"><span>Looking back to the French Revolution, when, in 1791, Louis XVI was struggling to keep his throne, Mr. Turley quotes Paine: \"You see the absurdity of monarchical governments . . . a whole nation disturbed by the folly of one man.\" Plus ça change.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Mr. White is a senior fellow at the American Enterprise and directs the Antonin Scalia Law School's Gray Center for the Study of the Administrative State.</span></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007345:0/",
            "pub_date": "2026-02-28 00:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2F6:0",
            "title": "Autostrade Meridionali FY Net Loss EUR 0.5 Mln",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Autostrade Meridionali SpA in liquidazione </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY REVENUE EUR 0.944 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY NET LOSS EUR 0.459 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2F6:0-autostrade-meridionali-fy-net-loss-eur-0-5-mln/",
            "pub_date": "2026-02-28 00:03:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007364:0",
            "title": "Sweetgreen Is Maintained at Outperform by Oppenheimer",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(16:04 GMT) </span></strong><span>Sweetgreen Price Target Cut to $9.00/Share From $10.00 by Oppenheimer</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007364:0/",
            "pub_date": "2026-02-28 00:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007322_20260227007352:0",
            "title": "Schaeffler: Xiangbin Chen to Take Over From Yilin Zhang as Regional CEO Greater China",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007322_20260227007352:0/",
            "pub_date": "2026-02-28 00:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007322_20260227007355:0",
            "title": "Schaeffler: This Is Effective Jan 1, 2027",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007322_20260227007355:0/",
            "pub_date": "2026-02-28 00:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN24B:0",
            "title": "Carter's Inc reports results for the quarter ended September 30 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Carter's Inc </span><span> reported quarterly adjusted earnings of 74 cents​​ per share for the quarter ended September 30, lower than the same quarter last year, when the company reported EPS of $2.59.  The mean expectation of six analysts for the quarter was for earnings of 74 cents per share. Wall Street expected results to range from $1.32  to $2.04 per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 11.9% to $925.45 million from a year ago; analysts expected $769.76 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Carter's Inc's reported EPS for the quarter was 32 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of $64.22 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Carter's Inc shares had risen by 29.7% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 26.1% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, one analyst negatively revised an earnings estimate</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy,\" 2 \"hold\" and 3 \"sell\" or \"strong sell.\" The average consensus recommendation for the apparel &amp; accessories retailers peer group is  \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Carter's Inc is $30.00, about 40.2% below its last closing price of $42.07</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 04:04 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>1.74</span></p></td><td><p class=\"\"><span>0.74</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.39</span></p></td><td><p class=\"\"><span>0.17</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.39</span></p></td><td><p class=\"\"><span>0.66</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2024 </span></p></td><td><p class=\"\"><span>1.92</span></p></td><td><p class=\"\"><span>0.66</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN24B:0-carter-s-inc-reports-results-for-the-quarter-ended-september-30-earnings-summary/",
            "pub_date": "2026-02-28 00:04:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN24G:0",
            "title": "NIQ Global Intelligence PLC reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NIQ Global Intelligence PLC </span><span> reported quarterly adjusted earnings of 20 cents​​ per share for the quarter ended December 31.  The mean expectation of thirteen analysts for the quarter was for earnings of 29 cents per share. Wall Street expected results to range from 23 cents to 35 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue was $1.14 billion​; analysts expected $1.12 billion. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NIQ Global Intelligence PLC's reported EPS for the quarter was a loss of 11 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $32.2 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NIQ Global Intelligence PLC shares had fallen by 24.6% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 0.4% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 12 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the advertising &amp; marketing peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for NIQ Global Intelligence PLC is $21.00, about 40.8% above its last closing price of $12.43</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 04:04 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>0.29</span></p></td><td><p class=\"\"><span>0.20</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>0.01</span></p></td><td><p class=\"\"><span>0.03</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN24G:0-niq-global-intelligence-plc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-28 00:04:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ObikR8xRa:0",
            "title": "Information to Bondholders - Øyfjellet Wind Investment AS Annual Financial Statements and Audit Report for 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Please find attached an information for the bondholders of the Green Bond(ISIN:NO 0011082117). Øyfjellet Wind Investment AS publishes its Annual FinancialStatements and Audit Report for 2025.</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667166</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ObikR8xRa:0-information-to-bondholders-yfjellet-wind-investment-as-annual-financial-statements-and-audit-report-for-2025/",
            "pub_date": "2026-02-27 23:59:19",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7819Ua:0",
            "title": "REG - CQS Natural Res - Net Asset Value(s)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7819U  CQS Natural Resources Grwth&amp;Inc PLC  27 February 2026   </span><p class=\"\"><span>CQS Natural Resources Growth and Income PLC</span></p><p class=\"\"><span>(the \"Company\")</span></p><p class=\"\"><span>LEI:                549300ES8CNIK2CQR054</span></p><p class=\"\"><span>Date:              27 February 2026</span></p><p class=\"\"><span>Net Asset Value</span></p><p class=\"\"><span>The Company's unaudited net asset value (\"NAV\") per share, calculated in accordance with stated policies and applicable accounting standards and AIC recommendations, as at the close of business on 26 February 2026 was 436.42 pence, including unaudited current period revenue (Ex-dividend).</span></p><p class=\"\"><span>The NAV has been calculated based on 36,963,779 ordinary shares in issue (excluding shares held in treasury) as at the above date.</span></p><p class=\"\"><span>ENQUIRIES</span></p><p class=\"\"><span>For the Investment Manager</span></p><p class=\"\"><span>CQS (UK) LLP</span></p><p class=\"\"><span>Craig Cleland</span></p><p class=\"\"><span>0207 201 5368</span></p><p class=\"\"><span>For the Company Secretary and Administrator</span></p><p class=\"\"><span>Frostrow Capital LLP</span></p><p class=\"\"><span>020 3008 4910 </span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  NAVSEMFIWEMSEIE</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7819Ua:0-reg-cqs-natural-res-net-asset-value-s/",
            "pub_date": "2026-02-27 23:59:31",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3YH110:0",
            "title": "Target's management under fire as investors agitate for change",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>One investor group pushing for answers on reputational harm</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Another investor group pushing for independent board chair</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Target has faced backlash over DEI initiatives and political controversies</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Full-year results expected on March 3</span></li></ul></span></div><span><p class=\"\"><span>By Siddharth Cavale</span></p><p class=\"\"><span>    Over the last three years, retailer Target </span><span> has weathered intense criticism from consumers who have questioned its merchandise choices and policy decisions.</span></p><p class=\"\"><span>Now it has another unhappy group to deal with: shareholders who are questioning management's decisions on everything from executive leadership to its plans to rebuild its reputation with the broader public.</span></p><p class=\"\"><span>While big-box retailers like Walmart </span><span> and Costco </span><span> have taken advantage of Americans' cost-conscious shopping, Target has struggled. Profit has dropped 14% over the last five years. Its shift away from diversity, equity and inclusion initiatives in the wake of Donald Trump's return to the White House angered part of its consumer base and many long-time merchants.</span></p><p class=\"\"><span>The DEI rollback prompted a boycott that hurt sales, then CEO Brian Cornell admitted.</span></p><p class=\"\"><span>The company's market value is now $52 billion, about half of what it was in 2021, while Costco's value has risen to more than $430 billion, and Walmart's market cap has surpassed $1 trillion.</span></p><p class=\"\"><span>Against that backdrop, several groups of Target investors are agitating for change. Major New York and California pension funds are supporting a proposal that would ensure independent board chairs after Cornell was elevated to board chair. Another investor group is pushing for answers to what it sees as missteps that have harmed its reputation with customers and cut into sales.</span></p><p class=\"\"><span>\"We are concerned that a series of recent public-facing decisions and communications by the company may have introduced reputational, operational, and financial risks at a moment when Target is already navigating a challenging competitive and macroeconomic environment,\" a group of 27 investors wrote in a Friday letter to the company's board and executive leadership, seen exclusively by Reuters. The investors did not propose specific fixes.</span></p><p class=\"\"><span>It adds up to a challenging road for CEO Michael Fiddelke, who officially took the helm on February 1. He is expected to discuss his priorities for the year when the company reports results on March 3, which he has stated include the need to improve merchandise quality, value and style; ensure a consistent shopper experience; and expand technology use across operations.</span></p><p class=\"\"><span>    Target did not immediately respond to a request for comment. The company is expected to report a 2.65% decline in same-store sales for 2025, according to LSEG data. </span></p><p class=\"\"><span>Since Fiddelke was named the next CEO in August 2025, he has cut 1,800 corporate roles and announced $1 billion in store investments. He later elevated two veteran merchandising executives to chief operating officer and chief merchandising officer and named two new board directors.  </span></p><p class=\"\"><span>\"We believe the refresh of C‑suite roles meaningfully improves execution potential and injects renewed strategic momentum into the organization,\" said Corey Tarlowe, Jefferies analyst, saying it \"reinforces our view that TGT is taking deliberate steps to position the company for its next chapter of growth.\"  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1025.540275049116px;aspect-ratio:1.7092337917485265\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3YH110-2393d12f445ddf77606dadd992f6ad6d-resized.webp\" type=\"image/webp\"/><img alt=\"Line chart showing the stock performance of Target vs Amazon, Walmart and Costco\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3YH110-2393d12f445ddf77606dadd992f6ad6d-resized.webp\" style=\"background-color:#f7f4f4\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Target's stock has sharply underperformed peers over the past decade</span></figcaption></figure><p class=\"\"><span>           HEIGHTENED COMPETITION</span></p><p class=\"\"><span>Target’s merchandise was once a competitive advantage, earning it the playful name \"Tar-zhay\" for its cheap-chic apparel, but it has lost ground as competition from Walmart, Amazon </span><span> and Costco intensifies. Shoppers have complained about out‑of‑stock issues and long checkout lines.</span></p><p class=\"\"><span>\"The strategy needs correction and execution needs improvement,\" Gerald Storch, Target's vice chairman between 1993 and 2005, told Reuters. \"You see long lines, hyper‑promotional deals, and a loss of focus on value,\" Storch said, pointing to the mix of buy‑one‑get‑one offers and perks that contrast with everyday low prices at Walmart and Costco.</span></p><p class=\"\"><span>The 27 investors asked how the retailer is evaluating reputational risks, including customer boycotts, and its plan to avoid letting external pressures undermine efforts to rebuild trust, increase traffic and stabilize earnings. Those investors collectively manage $150.5 billion in assets, and are led by Trillium Asset Management and Mercy Investment Services.</span></p><p class=\"\"><span>Their letter added that \"backlash from recent strategic adjustments\" had affected \"customer loyalty and foot traffic.\" According to a source familiar with the letter, this was a reference to Target's decision to back away from DEI, and its silence before speaking out about raids conducted by U.S. Immigration and Customs Enforcement officers at stores in the Minneapolis area, where the company is based. </span></p><p class=\"\"><span>QUESTIONS ABOUT STRUCTURE</span></p><p class=\"\"><span>Other shareholders are upset with Target's decision to elevate longtime CEO Cornell to executive chairman, a position that continues to have operational oversight over Fiddelke. At least six investors that collectively own $500 million in Target shares, including the New York State Comptroller’s Office, the California State Teachers' Retirement System (CalSTRS) and the California Public Employees' Retirement System (CalPERS), are in support of a push from shareholder advocacy group The Accountability Board that would make future board chairs independent.</span></p><p class=\"\"><span>The proposal will be put to a non-binding vote at Target's annual meeting in June.</span></p><p class=\"\"><span>Target's independent board members did not respond to multiple calls and emails seeking comment on the investors' corporate governance concerns.</span></p><p class=\"\"><span>Officials at the New York State Comptroller's Office, which holds roughly $50 million in shares, told Reuters that they want Cornell to relinquish his board seat, citing disappointment with Target's retreat from diversity initiatives and the level of oversight surrounding these changes. </span></p><p class=\"\"><span>Six similar proposals since 2014 at Target have failed, with support peaking in 2014 at 45.8%. Matt Prescott, president of The Accountability Board, believes the campaign has more momentum this year with the arrival of an activist investor.</span></p><p class=\"\"><span>    Activist investor Toms Capital Investment Management took a 0.6% stake as of December 31, seeking to turn around Target's grocery business among other priorities, according to a source familiar with its thinking.</span></p><p class=\"\"><span>TCIM declined comment; co‑founder Ben Pass did not respond to multiple requests for comment. </span></p><p class=\"\"><span>After Reuters asked Target about investor concerns related to its governance structure, the company added a statement to its website emphasizing that all board members except Cornell and Fiddelke are independent under New York Stock Exchange standards, and that no other directors are current or former employees. The website now includes a table listing directors’ affiliations with other corporate boards. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3YH110:0-target-s-management-under-fire-as-investors-agitate-for-change/",
            "pub_date": "2026-02-28 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7808Ua:0",
            "title": "REG - SAGA Plc - Directorate change",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7808U  SAGA PLC  27 February 2026   </span><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Saga plc</span></p><p class=\"\"><span>Directorate Change</span></p><p class=\"\"><span>The Board of Saga announces that Julie Hopes, Non-Executive Director since 1 October 2018, is stepping down from the Board with effect from today, to focus on other opportunities.</span></p><p class=\"\"><span>Sir Roger De Haan, Non-Executive Chairman of Saga, said:</span></p><p class=\"\"><span>\"I would like to thank Julie for the considerable contribution she has made during her time on the Board. Her expertise in insurance and her wise counsel have been invaluable to Saga over the past seven years.\"</span></p><p class=\"\"><span>The Board will review the composition of its committees and will announce any changes in due course.  </span></p><p class=\"\"><span>For further information, please contact: </span></p><p class=\"\"><span>Saga plc</span></p><p class=\"\"><span>3 Pancras Square</span></p><p class=\"\"><span>London</span></p><p class=\"\"><span>N1C 4AG</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Vicki Haynes, Company Secretary                                    </span></p></td><td><p class=\"\"><span>Tel: 07803 602 139</span></p><p class=\"\"><span>Email: company.secretary@saga.co.uk</span></p></td></tr><tr><td><p class=\"\"><span>Sharnj Sandhu, Interim Director of Investor Relations and Treasury</span></p></td><td><p class=\"\"><span>Tel: 07522 985 207</span></p><p class=\"\"><span>Email: sharnj.sandhu@saga.co.uk</span></p></td></tr><tr><td><p class=\"\"><span>Headland Consultancy</span></p><p class=\"\"><span>Susanna Voyle                            </span></p><p class=\"\"><span>Will Smith</span></p></td><td><p class=\"\"><span>Tel: 020 3805 4822</span></p><p class=\"\"><span>Tel: 07980 894 557</span></p><p class=\"\"><span>Tel: 07872 350 425</span></p><p class=\"\"><span>Email: saga@headlandconsultancy.com</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  BOABUGDDIXDDGLR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7808Ua:0-reg-saga-plc-directorate-change/",
            "pub_date": "2026-02-28 00:00:00",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        }
    ]
}