{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW06N:0",
            "title": "Ohio police at an active shooter situation at KDC/One warehouse",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Albany police are currently responding to an active shooter situation at KDC/One warehouse, City of New Albany said in a statement on Tuesday.</p><p class=\"\">The suspect or suspects are unknown at this time, it said.</p><p class=\"\">NBC4 earlier reported that several people were injured in the active scene near a warehouse.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW06N:0-ohio-police-at-an-active-shooter-situation-at-kdc-one-warehouse/",
            "pub_date": "2025-02-05 13:21:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463732:0",
            "title": "Arab National Bank Logs Higher FY24 Net Profit, Total Operations Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab National Bank (SASE:1080) said Wednesday that its net profit and total operations profit for full-year 2024 climbed year over year. </p><p class=\"\">Net profit for the 12 months ended Dec. 31, 2024, was 4.97 billion Saudi riyals, compared with 4.07 billion riyals a year ago. EPS moved to 2.48 riyals from 2.04 riyals. </p><p class=\"\">The Saudi Arabia-listed bank's total operations profit was 9.50 billion riyals, compared with 8.57 billion riyals previously.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463732:0/",
            "pub_date": "2025-02-05 13:22:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463721:0",
            "title": "Market Chatter: SoftBank, Samsung, OpenAI Chiefs Discuss AI Collaboration in Seoul",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SoftBank Group's  Masayoshi Son, Samsung's  Lee Jae-yong, and OpenAI's Sam Altman met in Seoul to discuss AI collaboration, Yonhap News reported Tuesday. </p><p class=\"\">The talks, held at a Samsung office, focused on mobile and AI strategies. </p><p class=\"\">Son called the discussions \"very good\" but gave no confirmation on Samsung joining OpenAI's 500 billion-dollar Stargate project, which aims to build AI infrastructure in the US with SoftBank and Oracle. </p><p class=\"\">Altman, on an Asia tour, earlier said South Korean firms would play a key role in Stargate. The meeting marked Jae-yong's first public appearance since his acquittal on accounting fraud charges. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463721:0/",
            "pub_date": "2025-02-05 13:23:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0F7:0",
            "title": "India's finance ministry asks employees to avoid AI tools like ChatGPT, DeepSeek",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's finance ministry has asked its employees to avoid using AI tools including ChatGPT and DeepSeek for official purposes, citing risks posed to confidentiality of government documents and data, an internal department advisory showed. </p><p class=\"\">Countries like Australia and Italy have placed similar restrictions on the use of DeepSeek, citing data security risks. Reports of the advisory surfaced on social media on Tuesday, ahead of a scheduled visit to India by OpenAI chief Sam Altman on Wednesday, when he is also due to meet the IT minister.</p><p class=\"\">\"It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek etc.) in the office computers and devices pose risks for confidentiality of (government) data and documents,\" said the advisory by the Indian finance ministry dated Jan. 29.</p><p class=\"\">Representatives for India's finance ministry, ChatGPT-parent OpenAI and DeepSeek did not immediately respond to requests for comment. </p><p class=\"\">Three finance ministry officials said the note was genuine and the note was issued internally this week. </p><p class=\"\">Reuters could not immediately confirm whether similar directives have been issued for other Indian ministries. </p><p class=\"\">OpenAI is facing heat in India due to a high-profile copyright infringement battle with the country's top media houses, and has said in court filings that it does not have its servers in the country and Indian courts should not hear the matter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0F7:0-india-s-finance-ministry-asks-employees-to-avoid-ai-tools-like-chatgpt-deepseek/",
            "pub_date": "2025-02-05 13:23:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000059_20250205000137:0",
            "title": "Toyota Shares Extend Gains, Now Up 5.0%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000059_20250205000137:0/",
            "pub_date": "2025-02-05 13:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0D0:0",
            "title": "Australian mining stocks jump on strong metals prices, weaker dollar",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Australian mining sub-index  rose more than 2%, clocking its biggest daily pct gain since Dec. 10</p><p class=\"\">** Sector heavyweights Rio Tinto  and BHP  rise 2.3% and 1.5%, respectively, to hit 2-week highs; Fortescue  about 2% higher</p><p class=\"\">** The positive overnight leads from the U.S. and new all-time highs in precious metals are contributing to the strong performance of miners, according to Junvum Kim, Asia Pacific senior sales trader with Saxo Markets</p><p class=\"\">** Materials and miners sector also supported by strength in metals such as copper, which is up for third straight day </p><p class=\"\">** Softer U.S. dollar is additionally helping commodity players, as a weaker dollar typically supports commodity prices, Kim added </p><p class=\"\">** An additional 10% tariff on Chinese imports came into effect on Tuesday, and was met with a package of retaliatory measures from China, which included stricter export regulations for tungsten and four other critical metals</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0D0:0-australian-mining-stocks-jump-on-strong-metals-prices-weaker-dollar/",
            "pub_date": "2025-02-05 13:25:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000128:0",
            "title": "Toyota Raises Earnings Guidance After Profit Jumps",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">Toyota Motor raised its annual earnings guidance after reporting a jump in third-quarter net profit on higher revenue.</p><p class=\"\">The Japanese carmaker said Wednesday that net profit climbed 62% from a year earlier to 2.193 trillion yen, equivalent to $14.21 billion, for the three months ended Dec. 31. That beat the estimate of Y1.175 trillion in a poll of analysts by data provider Quick.</p><p class=\"\">Third-quarter revenue rose 2.9% to Y12.391 trillion.</p><p class=\"\">For the fiscal year ending March, Toyota now expects net profit to decline 8.6% to Y4.520 trillion and revenue to increase 4.2% to Y47.000 trillion. It previously expected Y3.570 trillion in net profit and Y46.000 trillion in revenue. The company left its fiscal-year group vehicle-sales forecast unchanged at 10.85 million vehicles.</p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\">The company has benefited from a shift among consumers in the U.S. and some other markets to hybrid cars from fully electric vehicles, though it struggled in China, the world's largest auto market, like many other foreign carmakers.</p><p class=\"\">To sell cars in the U.S., Japanese automakers like Toyota not only produce them at U.S. plants or import from Japan, but they also make them in Mexico and import to the U.S.</p><p class=\"\">The U.S. announced new tariffs against Mexico and Canada on Saturday before striking last-minute deals to delay them on Monday.</p><p class=\"\">Japanese auto stocks fell after the announcement of U.S. tariffs raised concerns about their U.S. sales of cars made in the North American trading partners and a further escalation in trade conflicts.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000128:0-toyota-raises-earnings-guidance-after-profit-jumps/",
            "pub_date": "2025-02-05 13:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0I8:0",
            "title": "India's ONCG adds to gains as Macquarie upgrades to 'outperform'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** ONGC shares  rise 1.8% to 258.5 rupees, rebounding for second day in a row after post-earnings slide</p><p class=\"\">** Macquarie upgrades to \"outperform\" from \"neutral\"; raises PT to 310 rupees from 250 rupees</p><p class=\"\">** Macquarie echoes other brokerages' bullish view on output growth due to new sites, higher output from older fields</p><p class=\"\">** Expects cumulative oil production growth of 10% over FY24-2027 and gas output growth of about 13%</p><p class=\"\">** Avg rating of 26 analysts remains \"buy\", but PT cuts since result slower median PT by ~2% 307.5 rupees -LSEG data</p><p class=\"\"> ($1 = 87.1220 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0I8:0-india-s-oncg-adds-to-gains-as-macquarie-upgrades-to-outperform/",
            "pub_date": "2025-02-05 13:17:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463714:0",
            "title": "Husqvarna to Sell US Manufacturing Site to Flex Under New Partnership",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Husqvarna (HUSQ-A.ST, HUSQ-B.ST) entered into an agreement to sell its manufacturing operations in South Carolina, US, to Flex. </p><p class=\"\">As part of the partnership, Flex will take over the operations at the Orangeburg site and continue producing Husqvarna's wheeled products and assembling handheld products for the North American market, according to a Tuesday release. The workforce at the site will be given an employment option with Flex. </p><p class=\"\">The Swedish manufacturer of forest and gardening power tools expects 350 million kronor in cost savings through the partnership in five years. The one-time costs are expected to be 250 million kronor, booked in the fourth quarter of 2024, and a limited cost booked for the first quarter of 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463714:0/",
            "pub_date": "2025-02-05 13:17:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000130:0",
            "title": "Hong Kong's Retail Sales May Rise 5% Increase This Year, CGS International Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000130:0/",
            "pub_date": "2025-02-05 13:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463719:0",
            "title": "Metropolis Healthcare's Consolidated Net Profit Rises in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Metropolis Healthcare  recorded an increase in its attributable consolidated net profit to 313.6 million Indian rupees in the fiscal third quarter from 271.6 million rupees a year ago, according to a Tuesday filing with the Indian exchanges by the healthcare services provider. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 6.09 rupees from 5.28 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 also increased to 3.23 billion rupees from 2.91 billion rupees a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463719:0/",
            "pub_date": "2025-02-05 13:19:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463722:0",
            "title": "Market Chatter: Honda's Push for Full Nissan Takeover Puts $58 Billion Merger at Risk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Honda Motor's  proposal to make Nissan  a wholly owned subsidiary has put their planned $58 billion merger at risk, Financial Times reported Wednesday, citing sources familiar with the matter. </p><p class=\"\">The original plan involved a jointly-owned holding company to maintain Nissan's brand and autonomy, but Honda's unexpected \"take it or leave it\" offer has strained negotiations, the report said. </p><p class=\"\">Tensions have emerged over equity ratios and asset valuations, with Nissan's partner Renault, which holds a 36% stake, urging Nissan to seek a higher premium reflecting Honda's control. </p><p class=\"\">The two automakers have delayed their initial plan to finalize the merger direction by January, now targeting mid-February, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463722:0/",
            "pub_date": "2025-02-05 13:19:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463720:0",
            "title": "Market Chatter: China Tariffs on US Energy to Have Limited Impact, Goldman Sachs Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Goldman Sachs has downplayed the potential impact of China's new tariffs on US energy products, Reuters reported Tuesday. </p><p class=\"\">China recently imposed tariffs of up to 15% on US coal and LNG in response to the 10% tariffs levied by the Trump administration on Chinese imports. </p><p class=\"\">Goldman Sachs suggests that the impact on energy prices will be limited due to the likely redirection of LNG and coal exports. The bank anticipates that these exports will find alternative markets, such as Japan and South Korea, while China seeks new suppliers, according to the report. </p><p class=\"\">Goldman Sachs also indicated that existing Pacific basin supplies could be diverted to China, the report said. </p><p class=\"\">Additionally, Goldman Sachs believes the tariffs will have minimal effect on commodity freight rates, citing the distance between the US and China as trading partners. </p><p class=\"\">The most significant potential consequence of the tariffs, according to the report, is a possible freeze on new long-term LNG contract agreements between US export facilities and Chinese buyers. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463720:0/",
            "pub_date": "2025-02-05 13:20:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463712:0",
            "title": "Champion Technology Raises HK$39 Million via Share Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Champion Technology Holdings  raised HK$38.5 million in net proceeds by placing 164.1 million shares to at least six investors at HK$0.245 apiece. </p><p class=\"\">The company plans to use the proceeds mainly as working capital for its green energy business, according to a Tuesday disclosure.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463712:0/",
            "pub_date": "2025-02-05 13:20:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0H1:0",
            "title": "India's benchmark indexes muted as energy stocks offset drop in consumer shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's equity benchmarks were little changed on Wednesday as gains in energy shares, driven by ONGC and oil marketing companies on an improved earnings outlook, offset a drop in consumer stocks.</p><p class=\"\">The Nifty 50  was up 0.15% at 23,774 points, as of 10:47 a.m. IST, while the BSE Sensex  traded 0.06% lower at 78,539.29.</p><p class=\"\">Both the Nifty and Sensex advanced 1.6% and 1.8%, respectively, on Tuesday, logging their best session in a month to turn positive so far in 2025.</p><p class=\"\">While the benchmarks were muted on the day, the broader markets extended gains from the prior session. The smallcaps  and midcaps  jumped 1.9% and 1.2%, respectively. </p><p class=\"\">Energy  and state-owned firms &lt;.NIFTYPSE&gt; gained about 1.5% each, with ONGC  leading the charge following an improved production outlook for fiscal year 2025-28. This resulted in Macquarie upgrading the stock to \"outperform\" from \"neutral\".</p><p class=\"\">Oil marketing companies BPCL  and HPCL  rose 3.4% each after Goldman Sachs upgraded them to \"buy\" from \"neutral\", citing improved earnings outlook for the companies.</p><p class=\"\">\"Markets are anticipating an interest rate cut from the Reserve Bank of India, which will lower capital costs and fuel economic expansion. This expectation is keeping sentiment positive despite global trade uncertainty,\" said A Balasubramanian, managing director and CEO of Aditya Birla Sun Life AMC.</p><p class=\"\">The RBI is expected to deliver a 25 basis-point rate cut on Friday, supporting a growth revival following the announcement of personal tax cuts.              </p><p class=\"\">Consumer stocks  shed 1% on Wednesday, taking their three-session losses to about 3% and erasing the gains made on Feb. 1, when the annual budget was unveiled.           </p><p class=\"\">Among individual stocks, Asian Paints  lost 4% after the paint maker missed third-quarter profit view.</p><p class=\"\">Tata Power (TTP.NS) gained 3.5% after posting a higher December-quarter profit.    </p><p class=\"\">($1 = 87.1530 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0H1:0-india-s-benchmark-indexes-muted-as-energy-stocks-offset-drop-in-consumer-shares/",
            "pub_date": "2025-02-05 13:20:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463726:0",
            "title": "Singapore Retail Sales Drop 2.9% in December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's retail sales declined 2.9% in December 2024, following a 0.5% drop in November, data from the Department of Statistics showed on Wednesday. </p><p class=\"\">Excluding motor vehicles, sales fell 4%. </p><p class=\"\">The retail sales value totaled SG$4.6 billion, with online sales making up 13.4%, down from 14.7% in November. Sales in most segments, including electronics and apparel, declined, while food and beverage sales rose 1%. </p><p class=\"\">Food service sales saw a 16.7% jump for food caterers, but fast food and restaurants saw slower growth.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463726:0/",
            "pub_date": "2025-02-05 13:20:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0J9:0",
            "title": "Qatar Insurance FY Profit Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">QATAR INSURANCE  :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY NET PROFIT 725.3 MILLION RIYALS VERSUS 601.2 MILLION RIYALS YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY DIVIDEND QAR 0.1 PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0J9:0-qatar-insurance-fy-profit-rises/",
            "pub_date": "2025-02-05 13:20:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000114:0",
            "title": "USPS's Suspension of Chinese Packages Highlights Challenges Implementing New Tariff Policy — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.S. Postal Services will likely need time to sort out how to implement new the tariff policy before resuming acceptance of Chinese packages, according to Chelsey Tam, senior equity analyst at Morningstar in an email. The process poses a significant challenge, given that in 2024, an estimated 4 million daily packages arrived in the U.S. under the de minimis rule, which allows low-value shipments to bypass duties and custom scrutiny, Tam says. The Trump administration revoked this exemption for China as part of broader tariff measures. Among Chinese e-commerce players, PDD Holdings will be hurt as its overseas e-commerce platform Temu has a significant exposure in the U.S., the analyst notes. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000114:0/",
            "pub_date": "2025-02-05 13:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW04N:0",
            "title": "China Lunar New Year holiday box office takings hit record high of $1.3 bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's film market achieved a record high of 9.5 billion yuan  ($1.3 billion) in takings over the Lunar New Year period, 18.8% higher than the same period last year, as movie-goers flocked to cinemas to watch movies such as \"Nezha 2\". </p><p class=\"\">The box office figure, calculated by Reuters based on data from ticketing platform Maoyan , surpassed last year's record of 8.0 billion yuan for the same eight day period.</p><p class=\"\">A big draw has been \"Nezha 2\", a sequel to the 2019 animated hit that follows the adventures of the iconic Chinese mythological character Nezha. Box office tracker Beacon data showed that by 1.00 a.m. Wednesday (1500 GMT Tuesday), \"Nezha 2\" alone had grossed over 5 billion yuan. </p><p class=\"\">Some movie goers told Reuters that the show was so popular that they needed to buy tickets one or two days in advance. </p><p class=\"\">On Jan. 29, the first day of the Lunar New Year, the box office exceeded 1.8 billion yuan, with over 35 million cinema visits, setting a new single-day record. </p><p class=\"\">Trailing behind \"Nezha 2\" were all domestic films, including the comedy mystery \"Detective Chinatown 1900\", the epic fantasy \"Creation of the God II: Demon Force\", and the martial arts film \"Legends of the Condor Heroes: The Gallants\".</p><p class=\"\">($1 = 7.2832 Chinese yuan renminbi)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW04N:0-china-lunar-new-year-holiday-box-office-takings-hit-record-high-of-1-3-bln/",
            "pub_date": "2025-02-05 13:11:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446670:0",
            "title": "Singapore Retail Sales Fall at Faster Pace",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Retail sales in Singapore dropped by 2.9% year-on-year in December 2024, slipping further from a downwardly revised 0.5% fall in the previous month.</p><p class=\"\">This marked the second consecutive month of falling retail trade, as sales continued to decline for department stores (-4.5% vs -3.7% in November), mini-marts and convenience store (-9.3% vs -8.8%), wearing apparel and footwear (-6.7% vs -3.1%), and computer and telecommunications equipment (-13.1% vs -11%).</p><p class=\"\">Additionally, sales tumbled for furniture and household equipment (-4.8% vs 1.9%) and watches and jewelry (-6.2% vs 2.2%).</p><p class=\"\">Meanwhile, sales accelerated for food and alcohol (9.4% vs 4.6%) and motor vehicles (6% vs 5.2%).</p><p class=\"\">On a seasonally adjusted monthly basis, retail sales decreased 1.5% in December 2024, slowing from a 2.8% fall in the previous month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446670:0-singapore-retail-sales-fall-at-faster-pace/",
            "pub_date": "2025-02-05 13:11:41",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0IA:0",
            "title": "India's Asian Paints slides on flagging muted demand outlook in short-term",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Asian Paints  falls ~4% to 2,262 rupees; top loser on benchmark Nifty 50 , which is up 0.13%</p><p class=\"\">** Management flags muted urban demand in short-term; says will likely recover post Q1 FY26</p><p class=\"\">** At least 16 brokerages cut PT post results, nine slash ratings - LSEG</p><p class=\"\">** Investec says it continues to fear that new entrants can impair earnings for players like ASPN, with the impact likely exacerbating if demand remains challenged</p><p class=\"\">** CLSA retains \"cautious stance\", citing heightened competition that will keep growth and margins under pressure</p><p class=\"\">** Stock set to log biggest intraday pct decline since Nov. 11, 2024, post Q2 results on Nov. 9</p><p class=\"\">** ASPN last down ~1%, swings to YTD loss</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0IA:0-india-s-asian-paints-slides-on-flagging-muted-demand-outlook-in-short-term/",
            "pub_date": "2025-02-05 13:14:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000123:0",
            "title": "News Highlights: Top Financial Services News of the Day - Wednesday at 12 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Its Direct Stakes in Three Companies</strong></p><p class=\"\">The firm said it would increase its investment in the companies by $1.1 billion in total as part of its unusual strategy of taking long-term stakes in businesses it likes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apollo Eyes 'Industrial Renaissance' After Investing Record $222 Billion Last Year</strong></p><p class=\"\">Apollo Global Management invested a firm record of $222 billion last year as the credit specialist sees increased opportunities to finance infrastructure developers in what it calls a \"global industrial renaissance.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Department Says DOGE's Access to Payment Data Is 'Read Only'</strong></p><p class=\"\">The letter comes after people tied to billionaire Elon Musk gained unusual access to the system.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Brookfield Enters Race for Australia's $1.9 Billion Insignia Financial</strong></p><p class=\"\">Brookfield made a non-binding proposal of $2.88 a share, the same value as the proposal made last month by CC Capital Partners, and later matched by Bain Capital.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Vanguard Launches New Fee Wars. What It Means for BlackRock, Schwab, Fidelity.</strong></p><p class=\"\">The drop in fees could save Vanguard investors $350 million in 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Robinhood Hits the Brakes on Sports Event Contracts Following CFTC Request</strong></p><p class=\"\">Robinhood reversed course just a day after introducing events contracts that would have allowed investors to trade based on the outcome of the Super Bowl.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS Shares Slump on Stock Buyback Uncertainty</strong></p><p class=\"\">The company details plans to improve the profitability of its wealth management unit, with a focus on the U.S. market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CFTC Reorganizes Enforcement Division Into Two Task Forces</strong></p><p class=\"\">The derivatives market regulator is reorganizing its enforcement division in a move it said will end the practice of regulation by enforcement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Robinhood Yanks Super Bowl Betting Contracts After Regulator's Pushback</strong></p><p class=\"\">The CFTC asked the brokerage to stop offering customer access to contracts, warning that they might be illegal blurring of financial markets and gambling.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000123:0-news-highlights-top-financial-services-news-of-the-day-wednesday-at-12-am-et/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000122:0",
            "title": "News Highlights: Top Energy News of the Day - Wednesday at 12 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. benchmark oil prices end lower as China trade dispute fuels demand concerns</strong></p><p class=\"\">U.S. oil prices on Tuesday gave back most of their gains from a day earlier after the U.S. implemented an additional 10% tariff on Chinese imports and Beijing retaliated with measures of its own, raising concerns over the prospects for demand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV's Net Profit Rises Despite Weak Refining Margins</strong></p><p class=\"\">The oil-and-gas company's refining margin fell to $5.9 a barrel, compared with $9.9 a barrel a year ago.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Find insight on natural gas and oil prices, OMV and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Won't Sink Canadian Oil Companies</strong></p><p class=\"\">The U.S. has become reliant on their crude, and Canada has ways to limit any financial hit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000122:0-news-highlights-top-energy-news-of-the-day-wednesday-at-12-am-et/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000127:0",
            "title": "Global Commodities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Commodities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0313 GMT - Sime Darby's turnaround in its China motors operations and potential divestment of noncore assets could accelerate its goal of achieving an 11% ROE over the next five years, CIMB Securities says in a note. That is higher than its ROE of 7.2% in FY 2024. Analyst Mohd Shanaz Noor Azam says the Malaysian conglomerate could optimize working capital, streamline its portfolio and improve cost efficiencies to help it reach the target. Its industrial division is well-positioned to benefit from the global energy transition and steady demand for rental and after-sales services, contributing to long-term growth, he adds. The stock remains attractive, with projected dividend yields of 6.9% in 2025 and 7.3% in 2026. CIMB maintains a buy rating and a target price of MYR3.00 on Sime Darby. Shares are 1.8% higher at MYR2.22. (yingxian.wong@wsj.com)</p><p class=\"\">0259 GMT - Iron ore falls in the morning Asian session, dragged by concerns over the tariffs China announced Tuesday. China imposed a 15% tariff on imports of U.S. coking coal, ANZ Research analysts say in a research report. Chinese iron-ore markets will probably come under pressure amid worries about weaker export-driven demand, the analysts add. Coking coal along with iron ore are raw materials used in steel production. All of the iron-ore contracts on the Dalian Commodity Exchange are lower, with the May 2025 contract last quoted 1.2% down at CNY799.5 a ton. (ronnie.harui@wsj.com)</p><p class=\"\">0245 GMT - Palm oil prices rise in early Asian trading, supported by a bullish technical outlook, AmInvestment Bank says in a note. The bank suggests traders to consider long positions if prices adjust. Meanwhile, Malaysia's palm oil production is expected to remain weak due to heavy rainfall. January output is estimated to have declined 10% from the previous month to 1.34 million tons, marking a fifth consecutive decline, according to a Bloomberg survey. Inventories may have dropped 2.9% to 1.66 million tons, while exports likely slumped 14.2% to 1.15 million tons, the survey shows. The Malaysian Palm Oil Board will release official data on Monday. AmInvestment Bank pegs CPO support at 4,251 ringgit/ton and resistance at 4,453 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 23 ringgit higher at 4,331 ringgit/ton. (yingxian.wong@wsj.com)</p><p class=\"\">0202 GMT - The Malaysian government's proposal for lower pension fund contributions for foreign workers appears positive for the plantation sector, RHB IB analyst Hoe Lee Leng and team say in a note. The government recently proposed a fixed 2% mandatory employees provident fund contribution, down from the initial 12% proposed last year, though the implementation date has yet to be set, they note. This should be a relief for planters, especially following the higher minimum wage policy introduced in February, they say. While these moves may have a slight negative impact on earnings amid higher costs, it is expected to be minimal, they add. RHB maintains an overweight rating on the Southeast Asian plantation sector, pegging Johor Plantations, Sarawak Oil Palms, Bumitama Agri, London Sumatra Indonesia and SD Guthrie as top picks. (yingxian.wong@wsj.com)</p><p class=\"\">0123 GMT - Base metals are broadly higher in early Asian trade. The three-month LME copper contract is up 0.5% at $9,193.00/ton, nickel is up 0.7% and zinc is 0.3% higher. China on Tuesday announced export restrictions on metals for various industries in retaliation to U.S. tariffs, but the list didn't include base metals, which supports the positive sentiment, Daria Efanova, head of research at Sucden Financial writes in a note. Given the moderate tariff increases from China and the U.S., markets are weighing the potential impact on both economies, which may be minimal provided that the situation doesn't escalate further, Efanova adds. (kimberley.kao@wsj.com)</p><p class=\"\">0047 GMT - Gold edges higher in early Asian trade. Demand for haven assets like gold, which is testing record highs, is being boosted by uncertainty in a challenging global economic environment dominated by trade and tariff tensions between the U.S. and multiple nations, Quasar Elizundia, research strategist at Pepperstone, says in a note. U.S. job openings at the end of 2024 unexpectedly resumed their downward trend, which raises questions about the labor market's strength and its ability to withstand global economic risks, raising uncertainty for investors, Elizundia adds. Spot gold is 0.2% higher at $2,846.13/oz, and has gained 8.5% so far this year. (kimberley.kao@wsj.com)</p><p class=\"\">0012 GMT - Mondelez's CEO said the broader snacking category is not diminishing due to consumers' focus on health and wellness. There hasn't been any noticeable decrease in snacking consumption due to GLP-1 medications, either, Dirk Van de Put said. \"Since COVID, the indulgence part of snacking is growing just as fast as the healthy part,\" he said. The snack giant reported a profit of $1.75 billion for the fourth quarter, compared with $950 million a year earlier. (roshan.fernandez@wsj.com)</p><p class=\"\">2328 GMT - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">2111 GMT - Mexican chain Chipotle Mexican Grill is known for its guacamole, and is working to source its avocados and other supplies beyond Mexico to keep providing it. The company said in a 4Q earnings call that it now sources goods from Colombia, Peru and the Dominican Republic, with half of its avocados coming from Mexico. Tariffs on supplies from Mexico are a looming threat for U.S. companies. Chipotle said it would have a financial hit if the tariffs come to pass. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">2056 GMT - Mondelez International said it expects adjusted earnings per share to decline about 10% in 2025 due to cocoa cost inflation. The Chicago-based food and snack company produces Oreo, Toblerone and Cadbury chocolate, among other cocoa-based products. High cocoa prices have forced the snack giant to raise some prices in recent quarters. \"Our teams are well-equipped to stay agile and take the necessary actions to navigate this challenging operating environment,\" CEO Dirk Van de Put said. Shares fall 4.5% after hours. (roshan.fernandez@wsj.com)</p><p class=\"\">2003 GMT - The retreat of live cattle futures from an all-time high close of $2.07 a pound continues, with cattle futures dropping under the $2 a pound mark for the first time in two weeks. The most-active contract closes down 0.7% to $1.99 a pound, making it roughly 4% cattle has lost since Jan. 28. Hog futures, meanwhile, attempted to make up for yesterday's limit-down close with a 3.9% uptick in the most-active contract, up to 89.975 cents a pound. \"Lean hog futures have been in turmoil over the last few days due to the potential for tariffs on hogs and pork moving across borders,\" says Steiner Consulting Group in a note. (kirk.maltais@wsj.com)</p><p class=\"\">1917 GMT - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000127:0/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000124:0",
            "title": "EMEA Morning Briefing: Earnings in Focus as Tariff Concerns Linger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET WRAPS</p><p class=\"\">Watch For:</p><p class=\"\">EU PPI; Services PMI data from EU, U.K., France, Germany, Italy; France Industrial production index; trading updates from Credit Agricole, GSK, Banco Santander, Novo Nordisk, TotalEnergies, Pandora, Assa Abloy, Equinor, DCC</p><p class=\"\">Opening Call:</p><p class=\"\">European and U.S. stock futures were tracking lower on cautious sentiment; Asian equities trimmed their gains after mainland Chinese shares resumed trading after the Lunar New Year holiday; The dollar fell; Treasury yields were mixed; while oil fell and gold futures gained.</p><p class=\"\">Equities:</p><p class=\"\">Stock futures were lower early Wednesday as tariff jitters linger and corporate earnings roll on.</p><p class=\"\">U.S. stocks rebounded on Tuesday despite the escalating new trade war between the U.S. and China. A U.S. official said that Trump and Xi could speak on Wednesday.</p><p class=\"\">Trump has called the China tariffs \"an opening salvo\" and indicated that the U.S. will levy substantial tariffs against China if the countries can't come to an agreement.</p><p class=\"\">Earlier Wednesday, the U.S. Postal Service said it would stop accepting parcels from China and Hong Kong, cutting off a service that is popular with online vendors in China.</p><p class=\"\">Goldman Sachs analysts said that China's retaliatory tariffs appear much less than proportional compared with the U.S.'s 10% across-the-board additional tariff on $525 billion worth of Chinese goods. In the coming days, the U.S.'s reactions to China's retaliation will be among the key events to watch.</p><p class=\"\">Forex:</p><p class=\"\">The euro has limited scope to recover even as hopes rise that the EU can avert threatened U.S. trade tariffs after President Trump postponed a levy on Canadian and Mexican imports, ING's Francesco Pesole said.</p><p class=\"\">Trump's decision to delay tariffs on his U.S. neighbors could reflect domestic backlash over potential economic pain for U.S. consumers but the same isn't necessarily true for the EU, he said.</p><p class=\"\">Trump can afford to keep EU tariffs in place for a prolonged period, making the bloc feel some pain before striking a deal. \"With all this in mind, we are somewhat skeptical that the euro is bound for a major rally.\"</p><p class=\"\">Bonds:</p><p class=\"\">Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux said.</p><p class=\"\">ING expects the supply of euro-denominated covered bonds to drop by 7 billion euros, equivalent to $7.24 billion, this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she said.</p><p class=\"\">Energy:</p><p class=\"\">Oil prices were lower after the U.S. implemented an additional 10% tariff on Chinese imports and Beijing retaliated with measures of its own, raising concerns over the prospects for demand.</p><p class=\"\">Near-term prices for global crude oil could remain capped due to supply risks and potential trade challenges, said Hassan Fawaz, GivTrade's chairman and founder.</p><p class=\"\">Trade tensions between the U.S. and China may also affect demand levels, he said, adding that caution could dominate, leading to pressure on oil prices.</p><p class=\"\">Oil traders have also been concerned about plans by OPEC+, to boost production after the first quarter.</p><p class=\"\">Metals:</p><p class=\"\">Gold edged higher early Wednesday. Demand for haven assets like gold, which is testing record highs, was being boosted by uncertainty in a challenging global economic environment dominated by trade and tariff tensions between the U.S. and multiple nations, Pepperstone said.</p><p class=\"\">U.S. job openings at the end of 2024 unexpectedly resumed their downward trend, which raises questions about the labor market's strength and its ability to withstand global economic risks, raising uncertainty for investors, it added.</p><p class=\"\">--</p><p class=\"\">Base metals were broadly higher in Asia. China on Tuesday announced export restrictions on metals for various industries in retaliation to U.S. tariffs, but the list didn't include base metals, which supports the positive sentiment, Sucden Financial said.</p><p class=\"\">Given the moderate tariff increases from China and the U.S., markets are weighing the potential impact on both economies, which may be minimal provided that the situation doesn't escalate further, it added.</p><p class=\"\">--</p><p class=\"\">Iron ore declined, dragged by concerns over the tariffs China announced Tuesday. China imposed a 15% tariff on imports of U.S. coking coal, ANZ Research analysts said.</p><p class=\"\">Chinese iron-ore markets will probably come under pressure amid worries about weaker export-driven demand, the analysts added.</p><p class=\"\">TODAY'S TOP HEADLINES</p><p class=\"\">Fed's Daly Is in No Rush to Cut Interest Rates</p><p class=\"\">The Federal Reserve's Mary Daly is in no rush to lower interest rates until inflation is closing in on the central bank's 2% target.</p><p class=\"\">A solid economic backdrop gives the Fed the luxury of time to hold policy where it is until disinflation progress resumes, the San Francisco Fed President said on Tuesday. \"[The economy] came into 2025 in a very good place,\" Daly said at an event hosted by the Commonwealth Club World Affairs of California.</p><p class=\"\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</p><p class=\"\">A solid economy and still-too-high inflation argue for holding interest rates steady until more progress is made in slowing price growth, Federal Reserve Vice Chair Philip Jefferson said on Tuesday evening, echoing recent remarks from several of his colleagues on the Federal Open Market Committee.</p><p class=\"\">\"As long as the economy and labor market remain strong, I see it as appropriate for the Committee to be cautious in making further adjustments,\" Jefferson said in prepared remarks for an address at Lafayette College in Easton, Pa., on Tuesday evening. \"Over the medium term, I continue to see a gradual reduction in the level of monetary policy restraint placed on the economy as we move toward a more neutral stance as the most likely outcome.\"</p><p class=\"\">Novo Nordisk Earnings Must Show GLP-1 Market Still Set for Big Growth</p><p class=\"\">When Danish drugmaker Novo Nordisk reports its quarterly financial results on Wednesday, investors will be looking for reassurance the GLP-1 market is still on track for the enormous growth Wall Street expects.</p><p class=\"\">Novo shares have taken a beating in recent months, with the stock's American depositary receipts falling nearly 40% in the last six months of 2024. Shares first slid on growing worries that sales of its weight loss drug Wegovy and its Type 2 diabetes drug Ozempic wouldn't live up to the hype, and then on very disappointing trial data.</p><p class=\"\">Trump Says U.S. Will Take Over Gaza</p><p class=\"\">WASHINGTON-President Trump called for the U.S. to take long-term control of Gaza and for nearly two million Palestinian residents to permanently leave for neighboring countries, a break with decades of U.S. policy that left the idea of a Palestinian state in tatters.</p><p class=\"\">\"The U.S. will take over the Gaza Strip,\" Trump said during a press conference alongside Israeli Prime Minister Benjamin Netanyahu at the White House. \"I do see a long-term ownership position, and I see it bringing great stability to that part of the Middle East, and maybe the entire Middle East.\"</p><p class=\"\">Ukraine Open to Trump's Idea to Exchange Aid for Rare Earths-But There's a Catch</p><p class=\"\">President Trump has indicated he is open to supplying Ukraine with more weapons in exchange for access to the country's mineral resources. Ukraine is on board, but putting the plan into practice might not be so easy: Many of the minerals of greatest interest to the U.S. are in areas under Russian occupation or threatened by Moscow's advance.</p><p class=\"\">As a result, access to valuable Ukrainian natural resources will depend, at least in part, on the battle for eastern Ukraine, where Russian forces are currently advancing slowly but steadily.</p><p class=\"\">Nissan to Reject Honda's Merger Terms, Putting Deal in Peril</p><p class=\"\">Nissan's board is planning to reject Honda's terms for a combination of the two automakers, putting in danger a merger plan announced less than two months ago, people familiar with the matter said Wednesday.</p><p class=\"\">Nissan's board was scheduled to meet later Wednesday, and the people cautioned that no final decision to kill the deal has been made.</p><p class=\"\">Write to singaporeeditors@dowjones.com</p><p class=\"\">Expected Major Events for Wednesday</p><p class=\"\">07:00/DEN: 4Q Consumer credit</p><p class=\"\">07:45/FRA: Dec Industrial production index</p><p class=\"\">08:00/CZE: Dec Retail trade</p><p class=\"\">08:15/SPN: Jan Spain Services PMI</p><p class=\"\">08:30/EU: Jan EuroCOIN indicator of euro area economic activity</p><p class=\"\">08:45/ITA: Jan Italy Services PMI</p><p class=\"\">08:50/FRA: Jan France Services PMI</p><p class=\"\">08:55/GER: Jan Germany Services PMI</p><p class=\"\">09:00/EU: Jan Eurozone Services PMI</p><p class=\"\">09:00/UK: Jan UK monthly car registrations figures</p><p class=\"\">09:00/ITA: Dec Retail Sales</p><p class=\"\">09:30/UK: Jan S&amp;P Global UK Services PMI</p><p class=\"\">09:30/UK: Jan UK Official Reserves</p><p class=\"\">09:30/UK: Jan Narrow money (Notes &amp; Coin) and reserve balances</p><p class=\"\">10:00/EU: Dec PPI</p><p class=\"\">10:00/CYP: Jan Registered Unemployed</p><p class=\"\">10:00/LUX: Jan CPI</p><p class=\"\">11:00/FRA: Dec OECD CPI</p><p class=\"\">11:00/POR: 4Q Employment statistics</p><p class=\"\">16:59/POL: Polish interest rate decision</p><p class=\"\">All times in GMT. Powered by Onclusive and Dow Jones.</p><p class=\"\">Write to us at newsletters@dowjones.com</p><p class=\"\">We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000124:0-emea-morning-briefing-earnings-in-focus-as-tariff-concerns-linger/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0AF:0",
            "title": "First Guaranty Bancshares Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Guaranty Bancshares Inc  reported quarterly adjusted earnings of 3 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 6 cents.  The lone analyst forecast for the quarter was for a loss of 80 cents per share. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 7.3% to $22.58 million from a year ago; analysts expected $23.01 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Guaranty Bancshares Inc's reported EPS for the quarter was 3 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $428 thousand.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Guaranty Bancshares Inc shares had fallen by 8.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 600% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the banks peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for First Guaranty Bancshares Inc is $12.75 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 05:05 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">-0.80</p></td><td><p class=\"\">0.03</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.01</p></td><td><p class=\"\">0.11</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.20</p></td><td><p class=\"\">0.53</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.10</p></td><td><p class=\"\">0.14</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0AF:0-first-guaranty-bancshares-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 13:06:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463713:0",
            "title": "UAE's Response Plus Unit Opens Norway Office",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Prometheus Medical International, a company of Response Plus (ADX:RPM) subsidiary Response Plus Medical Services, opened an office at Skullerud Park in Oslo, Norway. </p><p class=\"\">The company will offer emergency medical training and risk reduction consultancy for the defense, healthcare, energy, and engineering sectors at the new location to support its Nordic expansion plans, according to a Tuesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463713:0/",
            "pub_date": "2025-02-05 13:06:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463718:0",
            "title": "Yuyue Medical Equipment Unit Registers Glucose Monitoring System in China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jiangsu Yuyue Medical Equipment &amp; Supply  subsidiary Jiangsu Yuyue Kailit Biotechnology obtained medical device registration for its continuous glucose monitoring system. </p><p class=\"\">The registration was issued by China's food and drug administrator and is valid until Jan. 23, 2030, according to a Wednesday filing with the Shenzhen bourse.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463718:0/",
            "pub_date": "2025-02-05 13:06:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446668:0",
            "title": "India Composite PMI Revised Slightly Lower",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HSBC India Composite PMI stood at 57.7 in January 2025, below the flash reading of 57.9 and December's figure of 59.2.</p><p class=\"\">It was the lowest print in 14 months despite marking the 42nd month of increase in private sector activity and staying above its long-run average of 54.7.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446668:0-india-composite-pmi-revised-slightly-lower/",
            "pub_date": "2025-02-05 13:07:24",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463711:0",
            "title": "Solstice Minerals Acquires Western Australia Copper-Gold Project From Cyprium Metals",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Solstice Minerals  will acquire 100% of the Nanadie copper-gold project in Western Australia from Cyprium Metals , according to a Wednesday Australian bourse filing. </p><p class=\"\">Under a sale and purchase agreement signed between the two firms, Solstice will pay Cyprium AU$1 million in immediately available funds as well as 3 million fully-paid shares in the firm on the completion of the acquisition. </p><p class=\"\">It will also pay 3 million more shares if it announces within four years after the completion of the deal that the project contains more than 250,000 tonnes of contained copper applying a cut-off grade of not less than 0.2% grade of copper. </p><p class=\"\">The deal is subject to customary conditions precedent, including required regulatory approvals and delivery of unencumbered title. </p><p class=\"\">The project is underpinned by an inferred mineral resource estimate of 40.4 million tonnes at 0.4% grade of copper and 0.1 grams-per-tonne grade of gold for 162,000 tonnes of contained copper and 130,000 ounces of gold, the filing said. </p><p class=\"\">Solstice Minerals' shares rose over 3% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463711:0/",
            "pub_date": "2025-02-05 13:07:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}