{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309396:0",
            "title": "Varonis Systems Q4 Non-GAAP Net Income Falls, Revenue Rises; Q1, 2025 Guidance Set",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Varonis Systems  reported Q4 non-GAAP net income late Tuesday of $0.18 per diluted share, down from $0.27 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.14. </p><p class=\"\">Revenue in the three months ended Dec. 31 rose to $158.5 million from $154.1 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $165.6 million. </p><p class=\"\">In Q1, the company expects a non-GAAP net loss of $0.04 to $0.06 per diluted share on revenue of $130 million to $135 million. Analysts expect a non-GAAP loss of $0.02 on revenue of $129.9 million. </p><p class=\"\">In 2025, Varonis expects non-GAAP net income of $0.13 to $0.17 per diluted share on revenue of $610 million to $625 million. Analysts expect non-GAAP EPS of $0.32 on revenue of $626.7 million. </p><p class=\"\">Shares of Varonis Systems fell 6.1% in after-hours activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309396:0/",
            "pub_date": "2025-02-05 05:44:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446623:0",
            "title": "US Crude Oil Inventories Exceed Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US crude oil inventories jumped by 5.025 million barrels for the week ending January 31st, 2025, following a 2.86 million barrel build in the previous week, according to the American Petroleum Institute's Weekly Statistical Bulletin.</p><p class=\"\">This marked the third consecutive week of inventory gains, after five weeks of declines, surpassing expectations of a 3.17 million barrel build.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446623:0-us-crude-oil-inventories-exceed-forecasts/",
            "pub_date": "2025-02-05 05:44:18",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309390:0",
            "title": "Lumen Q4 Exceeds Expectations; Shares Jump After-Hours",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lumen Technologies  reported late Tuesday Q4 adjusted earnings of $0.09 per share, up from $0.08 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected a loss of $0.05. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $3.33 billion, down from $3.52 billion a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $3.20 billion. </p><p class=\"\">For 2025, the company expects Adjusted EBITDA of $3.2 billion to $3.4 billion. </p><p class=\"\">Shares of the company were up about 10% in after-hours trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309390:0/",
            "pub_date": "2025-02-05 05:44:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV2AP:0",
            "title": "Tariffs, earnings eyed as China reopens",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    A look at the day ahead in Asian markets. </p><p class=\"\">First Mexico reached agreement with the United States to put U.S. tariffs on ice, then Canada did likewise, leaving the world's attention on <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/trump-china-us-tariffs-live-updates-2025-02-04/\" rel=\"nofollow\" target=\"_blank\">China</a>. Can a similar rapprochement between Beijing and Washington be achieved?</p><p class=\"\">After China retaliated on Tuesday to sweeping U.S. tariffs with targeted tariffs of its own, and put several U.S. companies, including Google, on notice for possible sanctions, a sudden detente seems unlikely. </p><p class=\"\">This will keep trade tensions bubbling away in Asia, even though markets globally have welcomed Washington's temporary reprieves with Mexico and Canada. A proposed telephone call on Tuesday between U.S. President Donald Trump and Chinese President Xi Jinping didn't take place, suggesting relations remain cool at best. </p><p class=\"\">China's levies don't come into effect until Feb. 10, however, leaving time for Trump and Xi to hammer out a 'deal'.  </p><p class=\"\">Chinese onshore markets reopen on Wednesday after the Lunar New Year holiday. All asset classes will be under intense scrutiny, none more so than the currency and the central bank's daily fixing of the dollar/yuan exchange rate. </p><p class=\"\">It was last fixed at 7.1698 on Jan. 27, and the pressure for a higher fix - i.e, a weaker yuan - could be strong after the offshore dollar/yuan rate hit an all-time high of 7.3765 on Monday. It has since eased back to around 7.28, but that's still comfortably higher than the central bank's last official fix over a week ago.</p><p class=\"\">Chinese stocks listed in Hong Kong have shrugged off the U.S.-Sino trade war with surprising ease, as investors have loaded up on artificial intelligence and electric vehicle shares. The China-focused index rose 3.5% on Tuesday to a three-month high, and Hong Kong tech shares leaped 5%. Will that optimism spill over to the onshore market? </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:550px;aspect-ratio:0.9166666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-a07d774660d5652f1ffb5e51b7709949-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to March 1, 2018) and the exchange rate of USD/CNY during the trade war between March 2018 and June 2019.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-a07d774660d5652f1ffb5e51b7709949-resized.jpeg\" style=\"background-color:#f4f6f8\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets during 2018 trade war</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:542.4657534246576px;aspect-ratio:0.904109589041096\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-f54affadaa82f22afcf04110560c7e6d-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to Sept. 15, 2024) and the exchange rate of USD/CNY during the trade war between Sept. 15, 2024 and Feb. 4, 2025.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-f54affadaa82f22afcf04110560c7e6d-resized.jpeg\" style=\"background-color:#f8f7f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets as trade frictions rise in 2025</span></figcaption></figure></span></p><p class=\"\">Most Asian equity benchmarks rose solidly on Tuesday, and the tech-heavy Nasdaq's strong advance lifted Wall Street too. Surprisingly soft U.S. jobs opening figures on Tuesday pushed the dollar and Treasury yields lower, which could also support risk appetite in Asia on Wednesday.</p><p class=\"\">But while U.S. money markets are still pricing in two quarter-point rate cuts from the Fed this year, the inflationary cloud from U.S. tariffs is darkening. Economists at Morgan Stanley on Tuesday changed their Fed call to only one rate cut this year, in June, from two, warning: \"The path for monetary policy in 2025 remains highly uncertain.\"</p><p class=\"\">Among the U.S. companies that reported earnings after the market close on Tuesday was 'Magnificent 7' constituent Alphabet. Google's parent company missed revenue estimates, sending its shares down more than 1% in after-hours trading. If that is sustained, it could weigh on sentiment in Asia on Wednesday. </p><p class=\"\">Here are key developments that could provide more direction to Asian markets on Wednesday:</p><p class=\"\">- China \"unofficial\" services PMI (January) </p><p class=\"\">- China reserve requirements ratio</p><p class=\"\">- Japan corporate earnings, including Toyota</p><p class=\"\">- Indonesia GDP (Q4)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV2AP:0-tariffs-earnings-eyed-as-china-reopens/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012456_20250204012456:0",
            "title": "Spencer Rascoff Appointed Match Group Chief Executive Officer >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012456_20250204012456:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012456:0",
            "title": "Spencer Rascoff Appointed Match Group Chief Executive Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(21:45 GMT) </strong>*Spencer Rascoff Appointed Match Group Chief Executive Officer &gt;MTCH<br/><strong class=\"root-Tkn6WL2y\">(21:45 GMT) </strong>Press Release: Spencer Rascoff Appointed Match Group Chief Executive Officer</p><p class=\"\">Spencer Rascoff Appointed Match Group Chief Executive Officer</p><p class=\"\">PR Newswire</p><p class=\"\">DALLAS, Feb. 4, 2025</p><p class=\"\">DALLAS, Feb. 4, 2025 /PRNewswire/ — Match Group's Board of Directors  today announced that Spencer Rascoff has been named Chief Executive Officer, effective immediately. Match Group's portfolio of over 20 brands includes category-leading global dating apps Tinder, Hinge, OkCupid, and Pairs. Rascoff, who has served as a member of Match Group's Board since March 2024, succeeds Bernard Kim, who is stepping down as CEO and as a member of the Board.</p><p class=\"\">Rascoff is a seasoned technology entrepreneur with a strong track record of building and scaling consumer tech businesses. As co-founder and CEO of Zillow Group for more than a decade, he transformed it into a category-defining platform, expanding its offerings and significantly growing its market value. He also co-founded Hotwire, a breakthrough online travel marketplace, and Pacaso, a proptech company reshaping second-home ownership. In addition to his operational experience, Rascoff has been an active investor and advisor to numerous high-growth technology companies across marketplaces, media, and AI.</p><p class=\"\">\"Spencer is an exceptional leader with deep experience in growing consumer technology businesses,\" said Tom McInerney, Chairman of Match Group. \"During his time on the Board, Spencer has demonstrated a strong strategic perspective and deep understanding of Match Group's brands and opportunities. We are confident in his ability to drive the company's next phase of innovation and growth. The Board also wants to thank BK for his leadership and contributions to Match Group, including advancing the company's approach to innovation. We appreciate all he has done for the company during his tenure.\"</p><p class=\"\">\"I am honored to step into the CEO role at such a pivotal and dynamic time for Match Group,\" said Spencer Rascoff. \"This is a company built on innovation, and its portfolio of iconic brands continues to redefine how people connect. As the industry leader, Match Group has set the standard for innovation in dating and relationships, and I'm excited to build on that momentum to bring new experiences to tens of millions of users worldwide. I look forward to working with our teams to foster a culture that embraces creativity and continuous innovation, ensuring we continue to shape the future of dating and relationships.\"</p><p class=\"\">\"Leading Match Group has been an incredible experience, and I'm deeply grateful to our teams for their passion, innovation, and dedication to helping people connect,\" said Bernard Kim. \"I've known Spencer for a long time and have no doubt that he'll bring great energy and vision to Match Group. I'm excited to see all that Spencer and the team will accomplish in the years ahead.\"</p><p class=\"\">At Investor Day in December, Match Group outlined its vision for the next phase of growth, emphasizing advancements in AI-powered features and new product innovations to enhance user experiences. Under Rascoff's leadership, the Company will continue executing on these initiatives, ensuring its brands remain at the forefront of digital connections while driving long-term value for users and shareholders.</p><p class=\"\">Rascoff will join Match Group's fourth quarter 2024 earnings conference call on Wednesday, February 5, 2025, at 8:30 a.m. Eastern Time (ET). Investors and analysts can access the webcast at https://ir.mtch.com.</p><p class=\"\">About Spencer Rascoff</p><p class=\"\">Spencer Rascoff was appointed Match Group CEO in February 2025 after having served on the company's board since 2024.</p><p class=\"\">A seasoned entrepreneur and technology leader, Spencer co-founded Zillow, where he served as CEO for a decade, scaling the company to over 4,500 employees, $3 billion in revenue, and a $10 billion market capitalization while earning dozens of 'best places to work' awards. He also co-founded Hotwire, a breakthrough online travel marketplace; and Pacaso, a proptech company reshaping second-home ownership.</p><p class=\"\">In addition to his operational experience, Spencer has been an active investor and advisor to numerous high-growth technology companies across marketplaces, media, and AI. He has also served on multiple public and private boards, including Palantir, TripAdvisor, and Zulily.</p><p class=\"\">Spencer began his career in investment banking at Goldman Sachs and private equity at TPG Capital. He graduated cum laude from Harvard University and serves on the Board of Trustees of Harvard-Westlake School.</p><p class=\"\">About Match Group</p><p class=\"\">Match Group , through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder(R), Hinge(R), Match(R), Meetic(R), OkCupid(R), Pairs(TM), PlentyOfFish(R), Azar(R), BLK(R), and more, each built to increase our users' likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over 40 languages to our users all over the world.</p><p class=\"\">Safe Harbor Statement Under the Private Securities Litigation Reform Act of 1995</p><p class=\"\">This press release may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. All statements that are not historical facts are \"forward looking statements.\" The use of words such as \"anticipates,\" \"estimates,\" \"expects,\" \"plans\" and \"believes,\" among others, generally identify forward-looking statements. These forward-looking statements include, among others, statements relating to: Match Group's future financial performance, Match Group's business prospects and strategy, anticipated trends, and other similar matters. These forward-looking statements are based on management's current expectations and assumptions about future events, which are inherently subject to uncertainties, risks and changes in circumstances that are difficult to predict. Actual results could differ materially from those contained in these forward-looking statements for a variety of reasons, including, among others: our ability to maintain or grow the size of our user base and convert users to paying users, competition, the limited operating history of some of our brands, our ability to attract users to our services through cost-effective marketing and related efforts, our ability to distribute our services through third parties and offset related fees, risks relating to our use of artificial intelligence, foreign currency exchange rate fluctuations, the integrity and scalability of our systems and infrastructure (and those of third parties) and our ability to adapt ours to changes in a timely and cost-effective manner, our ability to protect our systems from cyberattacks and to protect personal and confidential user information, impacts to our offices and employees from more frequent extreme weather events, risks relating to certain of our international operations and acquisitions, damage to our brands' reputations as a result of inappropriate actions by users of our services, and macroeconomic conditions. Certain of these and other risks and uncertainties are discussed in Match Group's filings with the Securities and Exchange Commission. Other unknown or unpredictable factors that could also adversely affect Match Group's business, financial condition and results of operations may arise from time to time. In light of these risks and uncertainties, these forward-looking statements may not prove to be accurate. Accordingly, you should not place undue reliance on these forward-looking statements, which only reflect the views of Match Group management as of the date of this press release. Match Group does not undertake to update these forward-looking statements.</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/spencer-rascoff-appointed-match-group-chief-executive-officer-302368108.html</p><p class=\"\">SOURCE Match Group</p><p class=\"\">/CONTACT: MatchGroupPR@match.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012456:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012448_20250204012448:0",
            "title": "Match Group: Bernard Kim Steps Down as CEO, From Board",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012448_20250204012448:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012448_20250204012449:0",
            "title": "Match Group Names Zillow Group Co-Founder Spencer Rascoff as CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012448_20250204012449:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE1YS9qq:0",
            "title": "Kansas City Royals To Simulcast 10 Regular Season Games On Gray Media’s KCTV5/KSMO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Games also to air on Gray Media stations throughout Midwest</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ATLANTA, Feb.  04, 2025  (GLOBE NEWSWIRE) — </strong>The Kansas City Royals today announced a partnership with Gray Media to provide new, expanded, and free access for fans by simulcasting 10 regular season broadcasts with FanDuel Sports Network, the Royals rightsholder partner.   The games will be shown on KCTV5 (CBS), KSMO (MyNetwork) or both on Sundays throughout the season, with selected games to be announced at a later date.</p><p class=\"\">This new partnership will greatly increase reach and access to the selected games, providing a new way for nearly 7 million households to watch the Royals.   All 10 games will be broadcast on KSMO, with at least 6 also airing on KCTV5. Gray stations cover much of the Royals home television territory, including markets in Missouri, Kansas, Nebraska, Iowa, and Arkansas.</p><p class=\"\">“Sharing our games, highlighting our world-class athletes, and telling our story to as many people as possible is a top priority for us,” Royals President of Business Operations Brooks Sherman said.   “This agreement gives our fans the power to watch however they want, whether that’s on cable, streaming, or local TV.   We are thrilled to partner with Gray Media, and know their experience and expertise will be beneficial for both the Royals and our fans.”</p><p class=\"\">“KCTV5, KSMO, and Gray Media are thrilled to bring the Royals back to free, over-the-air television,” said Curtis Miles, Vice President and General Manager of KCTV5 and KSMO.   “Gray Media has made significant investments in live sports, and we’re proud to bring viewers what they want.”</p><p class=\"\">In addition to the regular season broadcasts, the Royals and Gray will work together to create ancillary programming that will connect fans to their favorite team like never before.   Royals players, coaches, leadership, and alumni could be featured in content bringing fans closer than ever and add ways for everyone to follow the team beyond games.</p><p class=\"\">More information on the selected games and additional programming will be released prior to Opening Day, which will be March 27 against the Guardians.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Gray Media</strong></p><p class=\"\">Gray Media, Inc. , is a multimedia company headquartered in Atlanta, Georgia. The company is the nation’s largest owner of top-rated local television stations and digital assets serving 113 television markets that collectively reach approximately 36 percent of US television households. The portfolio includes 77 markets with the top-rated television station and 100 markets with the first and/or second highest rated television station, as well as the largest Telemundo Affiliate group with 43 markets totaling nearly 1.5 million Hispanic TV Households. The company also owns Gray Digital Media, a full-service digital agency offering national and local clients digital marketing strategies with the most advanced digital products and services. Gray’s additional media properties include video production companies Raycom Sports, Tupelo Media Group, and PowerNation Studios, and studio production facilities Assembly Atlanta and Third Rail Studios. Gray owns a majority interest in Swirl Films. For more information, please visit www.graymedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gray Contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Curtis Miles</strong>, KCTV/KSMO Vice President &amp; General Manager, curtis.miles@graymedia.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE1YS9qq:0-kansas-city-royals-to-simulcast-10-regular-season-games-on-gray-media-s-kctv5-ksmo/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012470_20250204012470:0",
            "title": "Fortescue Offer for Red Hawk Increases to A$1.20/Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012470_20250204012470:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012440:0",
            "title": "Chipotle Earnings Beat. Why The Stock Is Falling. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Evie Liu</p><p class=\"\">Chipotle stock plunged in aftermarket trading after the fast-casual restaurant chain posted solid earnings but its quarterly revenues were lower than what analysts had expected.</p><p class=\"\">For the three months ended in December, the burrito chain posted 25 cents in adjusted earnings per share, beating the consensus estimates of 24 cents from analysts polled by FactSet. Sales came at $2.8 billion, below the expected $2.85 billion.</p><p class=\"\">This is the first quarterly earnings report since Scott Boatwright was named the new CEO of Chipotle in November. He was previously the interim CEO after former head Brian Niccol left the company in August to lead Starbucks's turnaround.</p><p class=\"\">Chipotle has been on a strong growth trajectory for many quarters, even when many restaurant peers struggle with declining traffic and weaker sales amid inflation pressures. Before the earnings report as of Tuesday's close, the stock had gained 19% over the past 12 months.</p><p class=\"\">In the fourth quarter, Chipotle opened 119 company-owned restaurants. Same-store sales also continued to improve, up by 5.4% from a year ago.</p><p class=\"\">Strong unit growth and comparable sales has lifted total revenue by 13% year over year. Earnings also came in 19% higher compared with the year-ago period, as operating margins improved to 14.6%.</p><p class=\"\">\"Chipotle had another outstanding year, delivering strong transaction driven comps each quarter, expanding margins, adding over 300 new restaurants, gaining momentum in key industry leading brand metrics, making progress on many restaurant operating initiatives and building our footprint internationally,\" said Boatwright in a statement.</p><p class=\"\">Still, the stock tumbled more than 3% in Tuesday aftermarket trading following the revenue miss.</p><p class=\"\">For 2025, Chipotle management plans to open 315 to 345 new company-owned restaurants, and expects comparable restaurant sales to grow in the low- to mid-single digit range.</p><p class=\"\">\"I want to make sure that as we continue to scale Chipotle, everything we do is in service of our guests or those who serve our guests which will enable us to achieve our long-term ambitious goals of reaching 7,000 restaurants in North America, growing our AUVs beyond $4 million, expanding margins and making progress toward becoming a global iconic brand,\" said Boatwright.</p><p class=\"\">On Chipotle's earnings call, investors will watch for commentary on inflationary costs and impact of potential tariffs on imported goods from Mexico and Canada. The tariffs have been put on a 30-day pause as of Tuesday as the three countries continue to negotiate.</p><p class=\"\">But if the levies were to kick in, costs of avocados — the main ingredient of Chipotle's popular guacamole — would likely see prices hike soon. Avocados represent 7% to 11% of Chipotle Mexican Grill's costs of goods sold, according to TD Cowen analyst Andrew Charles.</p><p class=\"\">Mexican avocados make up 80% of America's total avocado consumption, which means there are no easy alternatives from other countries.</p><p class=\"\">Last summer, when the Mexican avocado market saw some price volatilities, Chipotle said it was less impacted because it has been diversifying its supply chain, noting that the majority of its avocados came from Peru.</p><p class=\"\">Still, the company reported higher food, beverage and packaging costs in the third quarter, citing rising avocado and dairy costs as the main reason.</p><p class=\"\">\"Chipotle has historically cited other countries where the brand can import avocados, though we view it as prudent to expect it will be difficult to fully offset the impact,\" wrote Charles in a Monday note.</p><p class=\"\">Charles anticipates that the potential tariffs, if kicking in, could lift Chipotle's costs of goods sold by half a percentage point.</p><p class=\"\">Write to Evie Liu at evie.liu@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012440:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0PP:0",
            "title": "SunCar Technology tumbles on stock offering plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">**  Shares of SunCar Technology Group  down 19.5% at $8.29 in extended trading as China-based auto services and insurance provider looks to raise equity</p><p class=\"\">** Co announces up to $50 mln stock offering for working capital, general corp purposes</p><p class=\"\">** BTIG lead bookrunner, joined by Macquarie and Oppenheimer</p><p class=\"\">** Co has ~98.5 mln total shares outstanding (Class A and B) as of Feb 4 for about $1 bln market cap, per the SEC prospectus filing</p><p class=\"\">** Its public float is ~33.2 mln shares, per LSEG</p><p class=\"\">** SDA closed up 1.4% at $10.30 on Tues. Shares up ~7% YTD and were trading around $7.50 a year ago</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0PP:0-suncar-technology-tumbles-on-stock-offering-plans/",
            "pub_date": "2025-02-05 05:45:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV188:0",
            "title": "US Democrats fight back against Musk access to sensitive records",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        Democratic U.S. congressional leaders will push legislation this week to \"prevent unlawful meddling\" by the newly created Department of Government Efficiency in the Treasury Department payment system, Senate Democratic leader Chuck Schumer said on Tuesday.</p><p class=\"\">Billionaire <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/elon-musk/\" rel=\"nofollow\" target=\"_blank\">Elon Musk</a> chairs the informal DOGE group, which was tasked by President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> to identify fraud and waste in the government. Last week, the team gained access to the most sensitive payment systems at Treasury and, as Reuters reported, locked some employees out of their agency's computers.</p><p class=\"\">\"Whatever DOGE is doing, it is certainly not what democracy looks like, or has ever looked like in the grand history of this country, because democracy does not work in the shadows, democracy does not skirt the rule of law,\" Schumer said in a speech on the Senate floor. </p><p class=\"\">Musk, who has moved swiftly to shrink the size of the U.S. government at Trump's behest, is now considered a \"special government employee,\" the White House said on Monday.</p><p class=\"\">    Schumer said he and House Democratic leader Hakeem Jeffries intended for the legislation \"to prevent unlawful meddling in the Treasury department’s payment systems, to prevent everyone's records from being made available to a small group of people who can look at them at will.\"  </p><p class=\"\">Schumer said the legislation would deny special government employees access to sensitive government records.</p><p class=\"\">    Restrictions would also extend to those without proper clearances and add personal tax information to privacy-protected data.   </p><p class=\"\">    Musk, the founder of the Tesla electric car company and SpaceX has contracts with the U.S. government as well as operations in China.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV188:0-us-democrats-fight-back-against-musk-access-to-sensitive-records/",
            "pub_date": "2025-02-05 05:45:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6bf9083b0b83d:0",
            "title": "HEALTHPEAK PROPERTIES, INC. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Healthpeak Properties, Inc., a leading real estate investment trust (REIT) specializing in healthcare properties, has released its 2024 Form 10-K report. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in the current market environment.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Total Revenue</strong>: $1,197 million, reflecting a $58.8 million increase from the previous year due to new leasing activity and development projects.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income (loss) applicable to common shares</strong>: $242.4 million, a decrease primarily due to increased depreciation and merger-related costs.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Nareit FFO</strong>: $1,092.7 million, an increase driven by higher Adjusted NOI from acquisitions and development projects.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">FFO as Adjusted</strong>: $1,231.9 million, reflecting a significant increase due to higher cash collections and new leasing activity.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">AFFO</strong>: $1,140.7 million, an increase attributed to higher cash collections of non-refundable entrance fees and increased Adjusted NOI.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Corporate Reorganization</strong>: In 2023, Healthpeak Properties, Inc. completed its corporate reorganization into an umbrella partnership REIT (UPREIT), enhancing its operational structure and strategic flexibility.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Merger with Physicians Realty Trust</strong>: On March 1, 2024, Healthpeak completed a merger with Physicians Realty Trust, acquiring 299 outpatient medical buildings, significantly expanding its outpatient medical segment.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Portfolio Composition</strong>: As of December 31, 2024, Healthpeak's portfolio consisted of 697 properties, including 524 outpatient medical properties, 139 lab properties, and 15 continuing care retirement communities (CCRCs).</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Outpatient Medical Segment</strong>: The outpatient medical segment includes multi-tenant properties primarily leased to healthcare providers, with 78% located on or adjacent to hospital campuses and 96% affiliated with hospital systems.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Lab Segment</strong>: Lab properties are primarily leased to biotechnology, medical device, and pharmaceutical companies, with significant presence in San Francisco, San Diego, and Boston, reflecting strong geographical market positioning.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">CCRC Segment</strong>: Continuing care retirement communities offer a continuum of care, with operations managed through RIDEA structures, allowing for a comprehensive range of senior living services.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Internal Growth Strategies</strong>: Healthpeak focuses on building long-term leasing relationships, replacing tenants at favorable terms, and extending lease terms to maximize property performance and tenant retention.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Investment Strategies</strong>: The company targets healthcare real estate investments driven by favorable demographics and market consolidation, with a focus on outpatient medical and lab properties.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sustainability Initiatives</strong>: Healthpeak is committed to sustainability, achieving reductions in greenhouse gas emissions and receiving multiple certifications and recognitions for its environmental efforts.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Human Capital Management</strong>: The company emphasizes diversity, inclusion, and employee engagement, with a workforce comprising 59% female employees and 35% racially or ethnically diverse employees.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: Healthpeak anticipates continued growth through strategic acquisitions, development projects, and leveraging its expanded portfolio post-merger with Physicians Realty Trust.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The company completed a merger with Physicians Realty Trust, acquiring 299 outpatient medical buildings, and executed a $750 million five-year unsecured term loan to support this strategic expansion.</li><li class=\"listItem-bmN0_SHH\">Additionally, the company sold a 65% interest in two lab buildings in San Diego for $128 million and exercised options to buy out four redeemable noncontrolling interests for $53 million, enhancing its asset portfolio and ownership structure.</li><li class=\"listItem-bmN0_SHH\">The company repurchased 10.5 million shares of its common stock for $188 million under the 2022 Share Repurchase Program and declared an increase in the quarterly common stock cash dividend from $0.30 to $0.305 per share.</li><li class=\"listItem-bmN0_SHH\">The company also refinanced existing loans, extended maturity dates, and entered into interest rate swap instruments to manage interest rate exposure.</li><li class=\"listItem-bmN0_SHH\">Furthermore, the company maintained a strong equity position with 699 million shares outstanding and a market value of $14.5 billion.</li><li class=\"listItem-bmN0_SHH\">The company anticipates using cash flows from operations, property sales, and potential debt and equity issuances to fund future acquisitions, capital expenditures, and development projects.</li><li class=\"listItem-bmN0_SHH\">It plans to continue its share repurchase program with $500 million available under the 2024 Share Repurchase Program and aims to maintain its REIT status by distributing a significant portion of its cash flow as dividends.</li><li class=\"listItem-bmN0_SHH\">The company is also focused on managing its debt profile and interest rate exposure to support long-term growth and financial stability.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges and Risks</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Macroeconomic Risks</strong>: The company is vulnerable to macroeconomic trends such as inflation, interest rate fluctuations, and supply chain disruptions. These factors have increased construction, labor, and operating costs, potentially affecting profitability and the ability to execute acquisitions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Interest Rate Risks</strong>: Rising interest rates have led to higher borrowing costs, which could limit the company's ability to refinance existing debt and finance new acquisitions. This may also impact consumer spending and demand for the company's properties.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Life Science Industry Risks</strong>: Changes in the life science industry, including regulatory challenges and funding difficulties, could reduce demand for lab properties. Industry consolidation and migration could further impact revenues.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Risks</strong>: The company faces challenges related to labor shortages and rising labor costs, which may require enhanced pay and benefits to attract personnel. Additionally, the integration of new technologies and changing consumer preferences could affect property demand.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Regulatory Risks</strong>: Compliance with extensive healthcare regulations is critical. Non-compliance could result in fines, loss of accreditation, or exclusion from government programs, impacting the company's financial performance.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Environmental and Climate Risks</strong>: Properties are exposed to natural disasters and climate change impacts, which could lead to uninsured losses and increased insurance costs. The company may also face regulatory pressures to meet sustainability commitments.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cybersecurity Risks</strong>: The reliance on information technology exposes the company to cybersecurity threats, which could disrupt operations and lead to data breaches, impacting reputation and financial results.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Joint Venture Risks</strong>: Participation in joint ventures introduces risks such as conflicts of interest, limited control over decisions, and potential financial instability of partners.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Market Risks</strong>: The company faces competition in acquiring and developing healthcare properties, which could impact its ability to grow its investment portfolio and retain tenants.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Financial Market Risks</strong>: Volatility in financial markets may impair the company's ability to raise capital and fund operations, potentially affecting liquidity and financial performance.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/765880/000162828025003748/peak-20241231.htm\" rel=\"nofollow\" target=\"_blank\">HEALTHPEAK PROPERTIES, INC. [ DOC ] - 10-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6bf9083b0b83d:0-healthpeak-properties-inc-sec-10-k-report/",
            "pub_date": "2025-02-05 05:38:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309383:0",
            "title": "Earnings Flash (PRU) Prudential Financial Q4 Adjusted EPS $2.96, vs. $3.24 Year Ago",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309383:0/",
            "pub_date": "2025-02-05 05:38:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463536:0",
            "title": "Pinnacle Investment Posts Higher Fiscal H1 Earnings as Revenue Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pinnacle Investment Management Group  reported Tuesday fiscal half-year earnings of AU$0.367 per diluted share, up from AU$0.153 per diluted share a year earlier. </p><p class=\"\">Analysts polled by Visible Alpha expected AU$0.3081 per diluted share. </p><p class=\"\">Revenue from continuing operations for the six months ended Dec. 31, 2024, was AU$27.6 million, compared with AU$23.7 million a year earlier. </p><p class=\"\">Analysts surveyed by Visible Alpha expected AU$28.6 million. </p><p class=\"\">The board declared a dividend of AU$0.33 per share payable on March 21 to shareholders of record on March 7. This is higher than the previously reported period's dividend of AU$0.156.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463536:0/",
            "pub_date": "2025-02-05 05:38:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309389:0",
            "title": "Klaviyo Insider Sold Shares Worth $687,818, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Amanda Whalen, Chief Financial Officer, on February 03, 2025, sold 15,000 shares in Klaviyo  for $687,818. Following the Form 4 filing with the SEC, Whalen has control over a total of 376,820 Series A common shares of the company, with 376,820 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1835830/000183583025000007/xslF345X05/wk-form4_1738704413.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1835830/000183583025000007/xslF345X05/wk-form4_1738704413.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309389:0/",
            "pub_date": "2025-02-05 05:38:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012039_20250204012382:0",
            "title": "IDEX Sees FY25 Organic Sales Up 1% to 3% From Prior Year >IEX",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012039_20250204012382:0/",
            "pub_date": "2025-02-05 05:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012039_20250204012388:0",
            "title": "IDEX Sees 1Q Organic Sales Down 3% to 4% From Prior Year >IEX",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012039_20250204012388:0/",
            "pub_date": "2025-02-05 05:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309326:0",
            "title": "Collective Mining Up 4.8% After Hours From a 52-Week Highs As Drilling Expands the High-Grade Ramp Zone",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Collective Mining  was last seen up 4.8% in after-hours New York trade on Tuesday after closing at a 52-week high, as it released assay results for two follow-up drill holes into the recently discovered Ramp Zone in the Apollo system at its multi-target Guayabales Project in Colombia. </p><p class=\"\">The company said Drill Hole APC103-D2 assayed at 51.95 meters grading 8.38 grams per tonne gold equivalent and is the deepest hole ever drilled at the Apollo system, bottoming in mineralization at approximately 1,200 meters below surface. Both holes announced have expanded the recently discovered high-grade Ramp Zone by approximately 50 meters along strike and 150 meters vertically, it added. </p><p class=\"\">It added drilling continues to test the Ramp Zone with two holes currently coring into the Ramp Zone and a third drill pad now under construction. The Ramp Zone remains completely open in all directions for expansion. </p><p class=\"\">\"Drilling into the Ramp Zone appears to be confirming that not only have we discovered a new high-grade gold system at the deepest drilled depths of the Apollo system, but that we have potentially only drilled the top of it. Without question, the fluids depositing gold at the Ramp Zone are more reduced than the top 1,000 metres of the Apollo system with a very strong correlation between gold and bismuth grades,\" Executive chair Ari Sussman said in a statement.\"</p><p class=\"\">The company said it currently has five drill rigs operating as part of its fully funded 60,000-metre drill program for 2025. It added two additional rigs have been contracted with drilling anticipated to ensue in February, and the Ramp Zone is a priority in the 2025 drilling program with up to three rigs targeting the zone simultaneously. </p><p class=\"\">The company's shares were up US$0.26 to $5.70 after hours. They closed up $0.14 to $7.76 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309326:0/",
            "pub_date": "2025-02-05 05:39:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV1AI:0",
            "title": "Wall Street rises on US-China trade optimism, energy boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">PepsiCo, Estee lauder fall after weak earnings forecasts</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Alphabet misses quarterly revenue estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Indexes up: Dow 0.3%, S&amp;P 0.72%, Nasdaq 1.35%</li></ul></span></div><span><p class=\"\">    The three major stock indexes closed higher on Tuesday, aided by energy stocks, while investors saw reason for optimism for a trade breakthrough between the U.S. and China after President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> delayed tariffs for Canada and Mexico. </p><p class=\"\">New 10% U.S. tariffs on Chinese imports took effect on Tuesday, which China countered with levies on U.S. goods. It was unclear when the country's leaders would talk and Trump said he was in no hurry.</p><p class=\"\">Energy stocks  led the S&amp;P gains, rising 2.18%, while utilities  and consumer staples  lost ground. </p><p class=\"\">Trump had said over the weekend he would impose a 25% tariff on goods from Mexico and Canada, but agreed to a 30-day pause on Monday in return for border and crime concessions from both countries.</p><p class=\"\">\"The president was so quick to offer a 30-day stay of execution to Mexico and Canada, so you get the idea that maybe what he's really trying to do is embrace a quick declaration of victory which doesn’t change much from a trade perspective,\" said Sam Stovall, chief investment strategist at CFRA Research.</p><p class=\"\">\"Investors have been breathing a sigh of relief today and we’ll see if a month from now they can continue to breathe that sigh of relief.\"  </p><p class=\"\">Strong corporate earnings have also buoyed investor optimism. Of the 211 companies in the S&amp;P 500 that have reported earnings for the fourth quarter, 76.8% reported above analyst expectations, according to an S&amp;P earnings scorecard.</p><p class=\"\">Palantir  shares jumped 24% after the data analytics company forecast first-quarter and annual revenue above Wall Street estimates.</p><p class=\"\">Meanwhile, Alphabet  rose 2.6% ahead of its quarterly results, but posted revenue that missed expectations after the close, partly due to a slowdown in its cloud computing business. The stock was down more than 7% in after-market trading.</p><p class=\"\">The Dow Jones Industrial Average  rose 134.13 points, or 0.30%, to 44,556.04, the S&amp;P 500  gained 43.31 points, or 0.72%, to 6,037.88 and the Nasdaq Composite  gained 262.06 points, or 1.35%, to 19,654.02. </p><p class=\"\">Biotechnology firm Illumina  dropped 5.3%, while PVH Corp , the holding company for brands including Calvin Klein, slipped nearly 1% after China placed the companies on its \"unreliable entity list\". </p><p class=\"\">Three Federal Reserve officials warned on Monday that trade tariffs carried inflation risks, with one arguing that uncertainty over the outlook for prices called for slower interest-rate cuts than otherwise.</p><p class=\"\">A Labor Department report showed U.S. job openings stood at 7.6 million in December, compared to an estimated 8 million, according to economists polled by Reuters.</p><p class=\"\">In earnings-driven moves, PepsiCo  fell 4.5% after it forecast annual profit below expectations and missed quarterly revenue estimates. </p><p class=\"\">Estee Lauder  plummeted 16.1% after the cosmetics company posted another weak quarter amid demand weakness and announced job cuts. </p><p class=\"\">Merck  dropped 9.1% after the drugmaker said it would pause shipments of Gardasil to China through at least mid-year, as continued weak demand for the HPV vaccine there is expected to hurt the company's 2025 revenues.</p><p class=\"\">PayPal  fell 13.2% after the digital payments giant's operating margin shrank in the fourth quarter.</p><p class=\"\">Advancing issues outnumbered decliners by a 2.81-to-1 ratio on the New York Stock Exchange. There were 121 new highs and 61 new lows on the NYSE.</p><p class=\"\">On the Nasdaq, 3,035 stocks rose and 1,323 fell as advancing issues outnumbered decliners by a 2.29-to-1 ratio. </p><p class=\"\">Volume on U.S. exchanges was 13.39 billion shares, compared with the 15.53-billion average for the full session over the last 20 trading days.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV1AI:0-wall-street-rises-on-us-china-trade-optimism-energy-boost/",
            "pub_date": "2025-02-05 05:39:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309395:0",
            "title": "GUIDANCE: (HRB) H&R Block Reaffirms Fiscal 2025 Adjusted EPS of $5.15 to $5.35, vs. FactSet Est of $5.29",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309395:0/",
            "pub_date": "2025-02-05 05:39:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV1D0:0",
            "title": "China retaliatory measures to have limited impact on energy prices, Goldman says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Goldman Sachs on Tuesday said it expects Beijing's retaliatory tariffs in response to new U.S. restrictions against Chinese goods to have only limited impact on energy prices.</p><p class=\"\">Minutes after U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/topic/person/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a> 10% tariff on Chinese goods kicked in at 12:01 a.m. ET (0501 GMT), China's finance ministry said it would impose levies of 15% for U.S. coal and LNG and 10% for crude oil, farm equipment and some autos.</p><p class=\"\">    \"We believe near term implications to commodity markets will be limited given that neither global supply nor demand of these commodities are changed by China's tariffs,\" Goldman Sachs said in a note.  </p><p class=\"\">    Impacted U.S. volumes are likely to easily find alternative buying markets, while China replaces impacted import volumes with alternative suppliers, Goldman said.  </p><p class=\"\">    U.S. liquefied natural gas (LNG) exports are likely to increase, while incremental supply from other Atlantic basin suppliers might head to Asia, Goldman said.  </p><p class=\"\">    \"In coal, we expect U.S. volumes to be redirected to Japan and Korea, which will likely release local Pacific basin supplies to go to China instead,\" analysts at Goldman Sachs said, adding China crude oil imports from the U.S. are small enough that can be easily reallocated.   </p><p class=\"\">    Impact to commodity freight rates will also likely be limited given the United States is one of China's farthest away trading partners, it said.  </p><p class=\"\">    However, Goldman said the most significant impact from China's retaliatory measures to commodity markets is potential pause in new long-term LNG contract negotiations between China buyers and U.S. LNG export facilities.  </p><p class=\"\">    Oil prices diverged at settlement on Tuesday amid tariff drama between Washington and Beijing.    </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV1D0:0-china-retaliatory-measures-to-have-limited-impact-on-energy-prices-goldman-says/",
            "pub_date": "2025-02-05 05:39:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012039_20250204012393:0",
            "title": "IDEX Sees 1Q EPS $1.18-EPS $1.24 >IEX",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012039_20250204012393:0/",
            "pub_date": "2025-02-05 05:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012039_20250204012396:0",
            "title": "IDEX Sees 1Q Adj EPS $1.60-Adj EPS $1.65 >IEX",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012039_20250204012396:0/",
            "pub_date": "2025-02-05 05:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463537:0",
            "title": "SKY Network CFO Steps Down; Interim Successor Named",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SKY Network Television  Chief Financial Officer Ciara McGuigan has resigned, effective immediately, according to a Wednesday filing with the Australian and New Zealand bourses. </p><p class=\"\">McGuigan will be succeeded by Andrew Hirst in an interim capacity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463537:0/",
            "pub_date": "2025-02-05 05:40:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309382:0",
            "title": "Earnings Flash (IEX) IDEX CORPORATION Reports Q4 Adjusted EPS $2.04, vs. FactSet Est of $2.02",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309382:0/",
            "pub_date": "2025-02-05 05:33:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:449d4602bdcf8:0",
            "title": "Aramark SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aramark, a global leader in food, facilities, and uniform services, has released its latest Form 10-Q report, showcasing robust financial and operational performance for the recent quarter. The report highlights significant growth in revenue, operating income, and net income, driven by base business growth and effective cost management strategies.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Total Revenue</strong>: $4,552.1 million, increased by 3.3% compared to the prior year period, primarily due to base business growth, including volume growth and contract price increases.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operating Income</strong>: $217.3 million, increased by 30.1% compared to the prior year period, driven by base business volume growth, cost management, and improved supply chain economics.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income</strong>: $105.7 million, increased significantly from $28.5 million in the prior year period, reflecting higher operating income and lower interest expenses.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income Attributable to Aramark Stockholders</strong>: $105.619 million, reflecting the company's improved financial performance.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Basic Earnings Per Share</strong>: $0.40, compared to $0.11 in the prior year period, indicating a substantial increase in profitability per share.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Diluted Earnings Per Share</strong>: $0.39, compared to $0.11 in the prior year period, showing a significant improvement in earnings per share.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong>: The FSS United States segment saw a 2.7% increase in revenue, driven by growth in Business &amp; Industry (12.8%), Education (2.6%), Healthcare (1.4%), and Sports, Leisure &amp; Corrections (5.2%). However, the Facilities &amp; Other sector experienced a 10.1% decrease due to the exit of lower margin accounts.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance</strong>: The FSS International segment reported a 4.7% increase in revenue, attributed to base business growth and new business, despite a 5.1% negative impact from foreign currency translation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Efficiency</strong>: Operating income increased by $50.3 million, reflecting base business volume growth, cost management, and improved supply chain economics. This was partially offset by higher contingent consideration expenses.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: The company anticipates continued improvement in macroeconomic trends, with moderated global inflationary costs and elevated market interest rates. Management plans to mitigate risks through supply chain initiatives and interest rate swaps.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Seasonality Impact</strong>: The company expects seasonal variations in revenue and operating results, with lower activity in sports and leisure during the first half of the fiscal year, offset by higher educational operations. Conversely, the second half sees increased sports and leisure activity, offset by summer recess in education.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1584509/000158450925000053/cik0-20241227.htm\" rel=\"nofollow\" target=\"_blank\">Aramark [ ARMK ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:449d4602bdcf8:0-aramark-sec-10-q-report/",
            "pub_date": "2025-02-05 05:33:38",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002817:0",
            "title": "These Stocks Moved the Most Today: Palantir, Alphabet, Tesla, Merck, PayPal, Super Micro, Spotify, Estée Lauder, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Joe Woelfel and Mackenzie Tatananni</p><p class=\"\">Stocks were rising Tuesday even as China retaliated against new U.S. tariffs by unveiling levies on certain American goods and opening an investigation into Alphabet's Google for possible antitrust violations.</p><p class=\"\">These stocks were moving Tuesday:</p><p class=\"\">Palantir Technologies soared 23% after the software company reported fourth-quarter adjusted earnings that topped analysts' estimates and revenue jumped 36% to $828 million, beating expectations of $776 million. The company's U.S. business jumped 52% from a year earlier. \"Our business results continue to astound, demonstrating our deepening position at the center of the (artificial intelligence) revolution. Our early insights surrounding the commoditization of large-language models have evolved from theory to fact,\" said CEO Alex Karp. For the first quarter, Palantir said it expects revenue of $858 million to $862 million, up 36% from 2024 at the midpoint, and better than Wall Street estimates of $799 million.</p><p class=\"\">Tesla  was up 0.9% after shares of the electric-vehicle maker slumped 5.2% on Monday. The stock closed lower after it was announced that tariffs levied on Mexico by the U.S. would be delayed by a month but before President Donald Trump struck a similar deal with Canada. Tesla makes all its EVs for the U.S. market in the U.S., but about 15% of the parts in a Model Y sold in the U.S. come from Mexico.</p><p class=\"\">Shares of Nvidia, the leading maker of artificial-intelligence chips, were up 2.2%.  Nvidia declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies, and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Super Micro Computer rose 9.7%. The maker of AI servers said it would be providing a fiscal second-quarter \" business update\" on Feb. 11. The Nasdaq Stock Market told the company in November that it wasn't in compliance with a listing rule requiring timely filing of reports with the Securities and Exchange Commission. In early December, the company said it expected to file its delayed financial statements by Feb. 25.</p><p class=\"\">PepsiCo posted fourth-quarter adjusted earnings per share of $1.96, beating analysts' estimates for $1.94, but the stock fell 1.8% after revenue declined 0.2% from a year earlier to $27.78 billion, and missed expectations of $27.89 billion. Shares fell 4.6%.</p><p class=\"\">Shares of Spotify Technology jumped 12% after the audio-streaming company added more premium subscribers in the fourth quarter than Wall Street expected, helping revenue top estimates.</p><p class=\"\">Merck fell 10% after the drug maker reported fourth-quarter adjusted earnings that beat analysts' estimates but provided guidance that missed expectations. Merck said it expects 2025 adjusted earnings per share of $8.88 to $9.03, below consensus for $9.21.</p><p class=\"\">Pfizer was down 1.6%. The pharmaceutical company reported fourth-quarter adjusted earnings per share of 63 cents, beating analysts' forecasts of 46 cents, and reaffirmed guidance for 2025. Shares fell Tuesday after a Senate panel voted to advance the nomination of Robert F. Kennedy Jr. to serve as secretary of the Department of Health and Human Services.</p><p class=\"\">PayPal Holdings declined 12%. The fintech beat fourth-quarter earnings and sales estimates, and said total payment volume rose 7% in the quarter, while payment transactions decreased 3%.</p><p class=\"\">Estée Lauder slumped 16% after the luxury beauty brand issued weak earnings guidance, announced it would eliminate thousands of positions as part of a two-year restructuring plan, and record more than $1 billion in pretax charges on employee-related costs.</p><p class=\"\">Ferrari was up 6.6% after the Italian supercar maker reported better-than-expected fourth-quarter earnings and revenue.</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%, down from a prior outlook for sales to be flat to down 2%. Shares of the cleaning-products maker were down 7%.</p><p class=\"\">Earnings reports are expected after the closing bell Tuesday from Alphabet, Advanced Micro Devices, Chipotle Mexican Grill, and Amgen.</p><p class=\"\">Alphabet stock rose 2% ahead of fourth-quarter earnings from the parent company of Google. Wall Street expects Alphabet to report earnings of $2.13 a share on revenue of $96.7 billion, up from per-share profit of $1.64 on revenue of $86.3 billion a year earlier. Cloud growth at the company and updates on its AI investments will be closely watched by investors.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com and Mackenzie Tatananni at mackenzie.tatananni@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002817:0/",
            "pub_date": "2025-02-05 05:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204011376_20250204012244:0",
            "title": "Evans Bancorp, NBT Merger Is Expected to Close in 2Q >EVBN",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204011376_20250204012244:0/",
            "pub_date": "2025-02-05 05:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}