{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM158:0",
            "title": "Federal agents detain Columbia University student in campus housing",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>University leader says agents 'made misrepresentations' to gain entry without a warrant</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>DHS says the student from Azerbaijan was in the US illegally</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Instagram account says: 'DHS illegally arrested me. Please help'</span></li></ul></span></div><span><p class=\"\"><span>By Maria Tsvetkova</span></p><p class=\"\"><span>    Agents from the U.S. Department of Homeland Security said they were searching for a missing person when they entered a Columbia University residential building on Thursday and detained a student, Columbia acting President Claire Shipman said.</span></p><p class=\"\"><span>DHS identified the student as Elmina Aghayeva from Azerbaijan and said she was in the U.S. illegally. She was detained at about 6:30 a.m., Shipman said.</span></p><p class=\"\"><span>\"Our understanding at this time is that the federal agents made misrepresentations to gain entry to the building to search for a 'missing person,'\" Shipman said, adding that law enforcement agents need a judicial warrant or subpoena to enter non-public university areas, including housing and classrooms.</span></p><p class=\"\"><span>DHS said the building manager and Aghayeva's roommate let its agents in. The department did not respond to a question about whether agents had misrepresented their intentions.</span></p><p class=\"\"><span>“ICE arrested Elmina Aghayeva, an illegal alien from Azerbaijan, whose student visa was terminated in 2016 under the Obama administration for failing to attend classes,\" DHS said in an emailed statement.</span></p><p class=\"\"><span>Attempts by Reuters to reach Aghayeva were not immediately successful.</span></p><p class=\"\"><span>New York Governor Kathy Hochul, in a social media post, accused immigration agents of lying.</span></p><p class=\"\"><span>\"Let’s be clear about what happened: ICE agents didn't have the proper warrant, so they lied to gain access to a student’s private residence,\" Hochul said on X.</span></p><p class=\"\"><span>Shipman said that when law enforcement seeks entry to such areas, they should be asked to wait for campus security to coordinate the university's response.</span></p><p class=\"\"><span>Even during President </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a><span> ongoing immigration crackdown, arrests of students on campuses or in campus housing remain rare. </span></p><p class=\"\"><span>The last arrests on the Columbia University campus occurred about a year ago, after pro-Palestinian protests, and included Mahmoud Khalil, a prominent activist who was released from a jail for immigrants three months later and continues to challenge in court efforts to revoke his U.S. lawful permanent residency green card and deport him.</span></p><p class=\"\"><span>A post at about 8 a.m. on Thursday on the Instagram account ellharve, identified in the profile as a scientist at Columbia, showed a photograph of the knees in jeans of someone sitting in a car and said: \"DHS illegally arrested me. Please help.\"</span></p><p class=\"\"><span>The university newspaper, the Columbia Spectator, identified the account holder as Ellie Aghayeva, a Columbia neuroscience researcher. The Instagram account has over 100,000 followers and posts about such products as AI study tools and glasses with a real-time translation feature.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM158:0-federal-agents-detain-columbia-university-student-in-campus-housing/",
            "pub_date": "2026-02-27 03:16:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM181:0",
            "title": "Codelco, Rio Tinto sign early agreement to weigh investments",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Chile's Codelco, the world's largest copper producer, and miner Rio Tinto </span><span> signed a memorandum of understanding on Thursday to explore development and investment opportunities.</span></p><p class=\"\"><span>• The companies agreed to form a joint steering committee of senior executives to identify pilot projects and oversee initiatives.</span></p><p class=\"\"><span>• The agreement focuses on project management, operational standards and supply chain coordination.</span></p><p class=\"\"><span>• Rio Tinto already partners with the Chilean state-owned company in the Nuevo Cobre copper project and lithium development at the Maricunga salt flat.</span></p><p class=\"\"><span>• Codelco has been pursuing partnerships with international mining companies to help fund its capital-intensive expansion projects.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM181:0-codelco-rio-tinto-sign-early-agreement-to-weigh-investments/",
            "pub_date": "2026-02-27 03:16:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013283:0",
            "title": "Salesforce Stock Rises After Earnings. Has Software Hit Bottom? — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Angela Palumbo</span></p><p class=\"\"><span>Software stocks were rising Thursday after Salesforce's earnings gave investors a much-needed confidence boost, leading some experts to believe the sector may have hit a bottom.</span></p><p class=\"\"><span>Salesforce's earnings might have helped to quell some fears that artificial intelligence could replace software. The stock was rising 3.5% to $198.39 on Thursday. The iShares Expanded Tech-Software Sector ETF was up 2.2%.</span></p><p class=\"\"><span>\"On Wednesday, markets were beginning to show some glimmers of stabilization around software stocks,\" Ameriprise Chief Market Strategist Anthony Saglimbene wrote.</span></p><p class=\"\"><span>Salesforce reported better-than-expected fourth-quarter earnings and revenue. However, the company also gave fiscal 2027 revenue guidance that was just in line with analyst estimates, leading the stock to drop in after-hours trading Wednesday night.</span></p><p class=\"\"><span>Shares bounced back in regular trading on Thursday, though. Investors seemed pleased with the company's AI results. Agentforce's annual recurring revenue reached $800 million in the fourth quarter, up 169% year-over-year.</span></p><p class=\"\"><span>Salesforce's Agentforce platform has been a closely watched part of the company's strategy. It gives the company a path to cash in on rising enterprise demand to introduce AI that can boost productivity and lower costs.</span></p><p class=\"\"><span>\"We're seeing incredible demand for Agentforce. In its first 15 months, we closed 29,000 deals, up 50% quarter-over-quarter,\" Salesforce CEO Mark Benioff said on the earnings call Wednesday.</span></p><p class=\"\"><span>Worries about AI replacing the need for software have fueled a selloff in the sector. The iShares Expanded Tech-Software Sector ETF has tumbled 30% from its 52 week closing high of $117.79 on Sep. 22, 2025. One thing software companies can do to help quell some of the concerns plaguing investors' minds is show that they are making money off their own AI products. Salesforce shareholders seem to think the company was able to do that in its last quarter.</span></p><p class=\"\"><span>Whether or not software stocks have hit a bottom remains a question. The rise in the sector this week is a good sign, though. The iShares Expanded Tech-Software Sector ETF has gained 7.4% over the past three days, its best three-day stretch since the three days ending April 25, 2025, according to Dow Jones Market Data.</span></p><p class=\"\"><span>\"Is [the] 'SaaS-Pocalypse' over? It's too soon to tell from our vantage point, though opportunities across well-established software companies are likely emerging for those who can stomach the volatility,\" Saglimbene wrote. \"That said, the panic phase of this recent volatility may be winding down as cooler heads have begun to prevail and cheaper valuations emerge.\"</span></p><p class=\"\"><span>Other experts feel similarly that established software companies could start to see a rebound after such a strong selloff.</span></p><p class=\"\"><span>James Demmert, chief investment officer at Main Street Research, told Barron's that in the short term, \"the best of breed software stocks are very oversold and have likely bottomed. This would include Palantir, Microsoft and Salesforce.\"</span></p><p class=\"\"><span>Risks still loom, though. Companies like Anthropic and OpenAI keep rolling out updated models. Investor skepticism may persist if these models continue to impress.</span></p><p class=\"\"><span>Nancy Tengler, CEO and CIO of Laffer Tengler Investments, wrote on Wednesday that she's focusing on investing in software companies that prove they have a strong growth trajectory amid the AI noise.</span></p><p class=\"\"><span>\"I think that's what investors have to digest — who are going to be the winners. Salesforce will be in business, but they may not put up the kind of growth numbers they've put in the past,\" Tengler said.</span></p><p class=\"\"><span>Write to Angela Palumbo at angela.palumbo@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013283:0/",
            "pub_date": "2026-02-27 03:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:b1df9a85e094b:0",
            "title": "Why Michael Burry Thinks Alibaba, JD.Com, Baidu Needs Re-Evaluation?",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Burry thinks that Hong Kong stocks are in the “dumps” and have been struggling for some time. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>According to Burry, in the last 10 years, Broadcom and Netflix have been leading performers, but Tencent’s stock has almost exactly a 0% return over the last five years.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Burry has been skeptical on these stocks since last year as his Scion Asset Management liquidated most equity holdings and increased its bearish bets on China in the first quarter of 2025.</span></li></ul></span></div><span><p class=\"\"><span>Famed investor Michael Burry on Thursday said that several Hong Kong stocks listed in the U.S. like Alibaba, JD.Com, Baidu among others need re-evaluation. </span></p><p class=\"\"><span>“These companies deserve a re-evaluation, a deep look into vulnerabilities, virtues and value,” he said in a post on X. </span></p><p class=\"\"><span>“First we must take a considerable detour and fully examine a vulnerability that applies to almost all these stocks,” he added. </span></p><p class=\"\"><span>Shares of BABA, JD.Com and Baidu were down 3.6%, 2.4% and 6.7%, respectively, at the time of writing. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>More From Burry</span></strong></p><p class=\"\"><span>Burry thinks that Hong Kong stocks are in the “dumps” and have been struggling for some time. </span></p><p class=\"\"><span>According to Burry, in the last 10 years, Netflix, Broadcom, and Tencent all increased revenue between 4.5-5 times. Broadcom and Netflix have been leading performers, but Tencent’s stock has almost exactly a 0% return over the last five years.</span></p><p class=\"\"><span>“This is the problem. All of Hong Kong’s massive tech stocks became massive since 2007, and the Hang Seng is today ~27,000, 15% lower than 2007,” he said. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Skeptical On Hong Kong Stocks</span></strong></p><p class=\"\"><span>Burry has been skeptical on these stocks since last year as his Scion Asset Management liquidated most equity holdings and increased its bearish bets on China in the first quarter of 2025.</span></p><p class=\"\"><span>Scion sold some shares of Alibaba (BABA), Baidu (BIDU), JD.com (JD), and PDD Holdings (PDD) in the first quarter of 2025, </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/michael-bury-makes-bearish-bets-on-nvidia-chinese-stocks/chivs5RRbne\" rel=\"nofollow\" target=\"_blank\">according</a><span> to regulatory filings. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>Retail sentiment around </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/BABA\" rel=\"nofollow\" target=\"_blank\">BABA</a><span> trended in ‘bearish’ territory and for </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/JD\" rel=\"nofollow\" target=\"_blank\">JD.Com</a><span> and Baidu it trended in ‘bullish’ territory amid ‘high’ message volume. </span></p><p class=\"\"><span>BABA shares have risen nearly 6% over the past year while BIDU shares rose 36.2%. Shares of JD.com fell 37% in the meantime. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:b1df9a85e094b:0/",
            "pub_date": "2026-02-27 03:17:45",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013286:0",
            "title": "CSX Boosts Quarterly Dividend By 8%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Amira McKee</span></p><p class=\"\"><span>CSX raised its quarterly dividend by 8% to 14 cents a share, up from 13 cents.</span></p><p class=\"\"><span>The new payout, equal to 56 cents a year, represents an annual yield of about 1.3% based on the latest closing price of $42.22.</span></p><p class=\"\"><span>The dividend is payable March 13 to shareholders of record at the close of business on Feb. 27, the transportation company said Thursday.</span></p><p class=\"\"><span>Write to Amira McKee at amira.mckee@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013286:0/",
            "pub_date": "2026-02-27 03:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZL1CT:0",
            "title": "US aims to bring in 4,500 white South Africans per month as refugees, document says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>White House aims to process 4,500 white South Africans monthly, exceeding stated refugee goals</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US plans modular village for refugee processing on embassy property in South Africa</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US refugee admissions paused through March 9 due to administrative backlogs, source says</span></li></ul></span></div><span><p class=\"\"><span>By Ted Hesson and Nellie Peyton</span></p><p class=\"\"><span>    The U.S. aims to process 4,500 refugee applications from white South Africans per month, far above President Donald Trump's stated refugee program cap, and is installing trailers on embassy property in Pretoria to support the effort, a U.S. contracting document said.</span></p><p class=\"\"><span>The new target, contained in a previously unreported document from the U.S. State Department dated January 27, signals a push to ramp up admissions from South Africa, while refugee applications from other areas have been severely curtailed.</span></p><p class=\"\"><span>Trump has said the U.S. would only admit 7,500 total refugees from around the world in fiscal year 2026, while a much higher cap of 40,000 to 60,000 was discussed internally last year. Only 2,000 white South Africans had entered the U.S. as refugees as of January 31 under a program launched in May 2025, although the pace has picked up in recent months.</span></p><p class=\"\"><span>The ambitious target could also face administrative delays in Washington, which in recent weeks have halted all refugee travel to the U.S., including white South Africans, according to a U.S. official familiar with the matter.</span></p><p class=\"\"><span>The U.S. State Department and Department of Homeland Security did not respond to requests for comment. The White House referred questions to the State Department.</span></p><p class=\"\"><span>The South African Chamber of Commerce in the U.S. said last year that more than 67,000 people had expressed interest in relocating.</span></p><p class=\"\"><span>Trump ordered a halt to refugee admissions into the U.S. after taking office in 2025 as part of his crackdown on legal and illegal immigration. But weeks later, he launched an effort to bring in white South Africans of Afrikaner ethnicity as refugees, saying they had been violently persecuted in the majority-Black country. South Africa's government has rejected that claim, while some refugee advocates have criticized the Trump policy.</span></p><p class=\"\"><span>     U.S. SEES URGENT NEED FOR REFUGEE PROCESSING SITE</span></p><p class=\"\"><span>The contracting document, posted to a U.S. government database on Wednesday, explains the rationale for awarding the contract for the trailers without a competitive bidding process, stressing an urgent need for a secure site.</span></p><p class=\"\"><span>An immigration raid by South African authorities on a previous U.S. refugee processing site on a commercial property in Johannesburg had forced the government to consider a more secure location, it said, after \"operations were compromised.\"</span></p><p class=\"\"><span>\"The inability to safely process about 4,500 applicants per month, an objective communicated to (the U.S. State Department's refugee division) from the White House, would result in failure to meet a Presidential priority,\" the document said.</span></p><p class=\"\"><span>South African Foreign Ministry spokesperson Chrispin Phiri said his government would not interfere with the U.S. program if it remained within legal boundaries, while reiterating Pretoria's rejection of Trump's claims about white South Africans.</span></p><p class=\"\"><span>\"The assertion that Afrikaners face systemic persecution is fundamentally unsubstantiated,\" he said.</span></p><p class=\"\"><span>Whether the U.S. could reach the ambitious 4,500 per month target remains unclear. The State Department last week canceled all refugee travel - including for South Africans - from February 23 to March 9 due to operational factors, an email sent to applicants said.</span></p><p class=\"\"><span>Because of Trump's sweeping refugee ban issued in January 2025, South Africans must be admitted as exceptions on a case-by-case basis by Secretary of State Marco Rubio and Homeland Security Secretary Kristi Noem.</span></p><p class=\"\"><span>The U.S. official, who requested anonymity to discuss internal operations, said DHS had delayed the approvals, creating an administrative backlog.</span></p><p class=\"\"><span>Prior to the pause on admissions, South African entries had been ramping up, with about 1,500 admitted in December and January, compared with about 500 in the previous six and a half months, according to U.S. State Department figures.</span></p><p class=\"\"><span>AFTER PUBLIC U.S.-SOUTH AFRICA TENSIONS, A PRIVATE AGREEMENT</span></p><p class=\"\"><span>Tensions between the U.S. and South Africa over the refugee effort boiled over in mid-December when South African authorities raided the commercial building in Johannesburg where U.S. staff and contractors were working on refugee cases.</span></p><p class=\"\"><span>Seven Kenyans working as contractors for a U.S.-based refugee group were arrested for alleged violations of their visa terms, while two U.S. refugee officers were briefly detained.</span></p><p class=\"\"><span>U.S. and South African officials reached an agreement during a closed-door meeting in late December to allow processing to continue, Reuters reported last month.</span></p><p class=\"\"><span>The contracting document said a South African company had received a no-bid $772,000 contract to supply and install 14 prefabricated modular buildings as part of a \"temporary modular village\" on an embassy property in Pretoria.</span></p><p class=\"\"><span>In a WhatsApp group for South Africans to share information about the program, one applicant said they had an interview this week in a trailer-like structure at an embassy property and that more trailers were being prepared, suggesting the site was now operational.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZL1CT:0-us-aims-to-bring-in-4-500-white-south-africans-per-month-as-refugees-document-says/",
            "pub_date": "2026-02-27 03:18:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZM253:0",
            "title": "Smartphone market set for biggest-ever decline in 2026 on memory price surge, IDC says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The global smartphone market is poised to suffer its biggest decline ever in 2026, sinking to a more than decade low in shipments, as surging memory chip prices drive up device costs, the International Data Corporation said on Thursday. </span></p><p class=\"\"><span>Smartphone shipments are expected to drop 12.9% to 1.12 billion units, the research firm said in a report.  </span></p><p class=\"\"><span>The decline will hit low-end Android manufacturers the hardest, while Apple </span><span> and Samsung </span><span> are positioned to gain market share as smaller rivals struggle or exit the market entirely, the report said.</span></p><p class=\"\"><span>\"What we are witnessing is not a temporary squeeze, but a tsunami-like shock originating in the memory supply chain,\" said Francisco Jeronimo, vice president for Worldwide Client Devices at IDC.</span></p><p class=\"\"><span>A rapid build-out of AI infrastructure by tech firms such as Meta, Google and Microsoft has captured much of the memory chips supply, lifting prices as manufacturers prioritize components for higher-margin data centers over consumer devices. </span></p><p class=\"\"><span>Memory chips, or DRAM, are crucial to smartphones as they allow power-hungry applications to run smoothly.</span></p><p class=\"\"><span>Analysts have said rising component costs will force budget-device focused companies to pass the expenses on to consumers, just as demand at higher price points is weakening. </span></p><p class=\"\"><span>Apple and Samsung, with stronger balance sheets and premium positioning, are better positioned, IDC said.</span></p><p class=\"\"><span>It expects the average selling price of smartphones to surge 14% to a record $523 this year, as manufacturers shift toward higher-margin models to offset ballooning costs.</span></p><p class=\"\"><span>IDC expects a modest 2% recovery in 2027 as the crisis eases, followed by a 5.2% rebound in 2028, though it said that the market was unlikely to return to previous norms.</span></p><p class=\"\"><span>\"The memory crisis will cause more than a temporary decline; it marks a structural reset of the entire market,\" said Nabila Popal, senior research director at IDC's Mobile Phone Tracker. </span></p><p class=\"\"><span>She warned that the sub-$100 smartphone segment, representing 171 million devices, will become \"permanently uneconomical\" even after memory prices stabilize by mid-2027.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZM253:0-smartphone-market-set-for-biggest-ever-decline-in-2026-on-memory-price-surge-idc-says/",
            "pub_date": "2026-02-27 03:19:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSDcVj9a:0",
            "title": "Madison Ai Search Partners with Gotavi, Deploying Gotavi Pulse as AI Reshapes How Consumers Discover Businesses",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Partnership enables Madison Ai Search clients to improve visibility across AI platforms and answer engines as consumer search behavior rapidly evolves</span></p><p class=\"\"><span>NEW YORK CITY, NY / ACCESS Newswire / February 26, 2026 / Madison Ai Search, a division of Madison Media - a full-service media and marketing company helping businesses build a strong online presence and grow revenues - today announced a partnership with Gotavi, selecting Gotavi Pulse as the foundational technology powering its Answer Engine Optimization services. Through this partnership, Madison Ai Search will offer Gotavi Pulse directly to its clients, enabling them to understand how their businesses are interpreted by AI platforms and take action to improve their discoverability across AI assistants, answer engines, and large language models.</span></p><p class=\"\"><span>\"The way consumers find businesses is fundamentally shifting,\" said Samuel \"Baruki\" Cohen, Founder and CEO of Madison Ai Search. \"Search is no longer just Google, it's ChatGPT, it's Perplexity, it's AI assistants that answer questions directly. Partnering with Gotavi and integrating Pulse into our offering gives us the most powerful tool available to help our clients make that transition.\"</span></p><p class=\"\"><span>\"Baruki and the Madison team have spent years helping businesses build their online presence, and they understand better than most how dramatically the discovery landscape is changing,\" said Shai Stern, Co-Founder of Gotavi. \"This partnership is a natural fit. Gotavi Pulse gives their clients a clear picture of where they stand in AI environments today, and a concrete roadmap to improve. We're excited to grow together.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Madison Media</span></strong></p><p class=\"\"><span>Madison Media is a full-service media and marketing company headquartered in New York City. Founded by seasoned entrepreneur Samuel \"Baruki\" Cohen, Madison Media helps companies across a broad range of industries increase their customer base and revenues by building a strong online presence. Services include AI receptionist solutions, social media distribution, AI sales dialer technology, and AI search optimization. For more information, visit www.madisonmedia.ai.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Gotavi</span></strong></p><p class=\"\"><span>Gotavi is a business orchestration platform built for how companies actually start, operate, and evolve over time. It acts as the infrastructure layer for a business - coordinating formation, compliance, business insurance, customer-facing AI automation, and Answer Engine Optimization through one guided experience. Instead of stitching together vendors and workflows, founders, operators, and advisors use Gotavi to keep work moving while they focus on building. With an expanding roadmap that includes business licensing, payments, background checks, and payroll, Gotavi is building infrastructure that adapts as businesses grow - and as AI reshapes how customers discover them.</span></p><p class=\"\"><span>For more information, visit https://gotavi.co.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information</span></strong></p><p class=\"\"><span>Michelle Miklosey</span></p><p class=\"\"><span>mmiklosey@gotavi.co</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Gotavi</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSDcVj9a:0/",
            "pub_date": "2026-02-27 03:20:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013293:0",
            "title": "Dine Brands Global Is Maintained at Neutral by UBS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:20 GMT) </span></strong><span>Dine Brands Global Price Target Cut to $33.00/Share From $35.00 by UBS</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013293:0/",
            "pub_date": "2026-02-27 03:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013297:0",
            "title": "Canada to Seek Bilateral Talks With Washington on Sectoral Tariffs Alongside Trade-Pact Review",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Paul Vieira</span></p><p class=\"\"><span>OTTAWA--The U.S.-led review of the current trilateral North American trade pact will likely incorporate talks on a bilateral deal to ease U.S. tariffs on key industrial sectors, says the Canadian minister in charge of the country's trading relationship with Washington.</span></p><p class=\"\"><span>Dominic LeBlanc told a Toronto audience Thursday he expects bilateral talks to unfold alongside a review of the U.S.-Mexico-Canada trade agreement, known as USMCA. LeBlanc cited, for instance, talks last fall between Ottawa and Washington to ease tariffs on key sectors like steel, aluminum and automobiles, which President Trump later terminated due to anger over a Canadian ad that questioned the use of tariffs.</span></p><p class=\"\"><span>LeBlanc said Canada wants the U.S. to recommit to a trilateral trade pact. Furthermore, he added, \"there have always been bilateral arrangements as between the three countries. That's not new… [And] we need to get a bilateral deal with the United States to take pressure off the sectoral tariffs.\"</span></p><p class=\"\"><span>The sectoral tariffs, of up to 50%, have squeezed Canada's manufacturing sector. Nonfarm payrolls data issued Thursday indicated that factories shed workers in December, for a year-over-year decline of 2.6%.</span></p><p class=\"\"><span>LeBlanc said he expects to meet U.S. Trade Representative Jamieson Greer in the coming days. Greer told the Canadian Broadcasting Corp. on Tuesday that Canada will have to live with U.S. tariffs as part of a revised USMCA.</span></p><p class=\"\"><span>\"If Canada wants to agree that we can have some level of higher tariff on them while they open up their markets to us on things like dairy and other things, then that's a helpful conversation,\" Greer said.</span></p><p class=\"\"><span>Earlier this week, LeBlanc told Canadian senators he remained optimistic about USMCA's future, noting that the White House provided an exemption to a new U.S. tariff, of up to 15%, so long as the goods entering the U.S. comply with the trilateral pact. The Bank of Canada has labeled the pending review of USMCA as a key risk to the economic outlook.</span></p><p class=\"\"><span>Write to Paul Vieira at paul.vieira@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013297:0/",
            "pub_date": "2026-02-27 03:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938908:0",
            "title": "ENGN: Detalimogene offers strong efficacy, safety, and convenience for NMIBC, targeting a 2027 launch",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Detalimogene voraplasmid, a non-viral gene therapy for NMIBC, shows promising efficacy and best-in-class tolerability, with a 62% six-month CR rate and strong fit for community practices. Key data updates and regulatory filings are planned for late 2024, with a potential launch in 2027.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938908:0-engn-detalimogene-offers-strong-efficacy-safety-and-convenience-for-nmibc-targeting-a-2027-launch/",
            "pub_date": "2026-02-27 03:20:04",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260226015477:0",
            "title": "Musk, Altman and China are fighting to control a potential $320 billion market for brain implants",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By William Gavin</span></p><p class=\"\"><span>It's still very early days for brain chips that let people control devices with their thoughts - but the market opportunity has become increasingly intriguing to tech CEOs and politicians</span></p><p class=\"\"><span>Elon Musk's Neuralink is among the most visible brain-computer interface companies around. But OpenAI's Sam Altman and a growing number of Chinese startups are aiming to challenge its lead.</span></p><p class=\"\"><span>Elon Musk, Sam Altman and a growing number of rivals are all fighting to become the leading player in the nescient but potentially lucrative market for brain implants.</span></p><p class=\"\"><span>Morgan Stanley analysts estimate that the global market for brain-computer interface, or BCI, technology could be worth $80 billion by 2035. A decade after that, the market for BCIs in the U.S. alone could be valued at $320 billion, the bank said in a Wednesday note to investors.</span></p><p class=\"\"><span>Brain-computer interface systems aren't new. The first major testing of such technology came in the 1970s in California, although roots can be found decades earlier. In the late 1990s, neurologist Philip Kennedy developed the first BCI to allow a severely paralyzed patient to move a computer cursor using their brain.</span></p><p class=\"\"><span>As BCI research has developed, so has the opportunity to make money off of the technology, though companies often emphasize the humanitarian benefits they can provide. According to data from Tracxn Technologies (IN:543638), which tracks private markets, there are 278 BCI companies around the world. Collectively, they've raised more than $4 billion.</span></p><p class=\"\"><span>The most visible is Neuralink, the BCI startup founded by Tesla (TSLA) CEO Elon Musk in 2016 that's reportedly worth $9 billion. Since January 2024, the startup has given its \"Telepathy\" implant to 21 patients with paralysis, allowing them to use phones, computers or robotic limbs with their thoughts.</span></p><p class=\"\"><span>Neuralink is also running a clinical trial for an implant designed to restore speech. Musk has said that, pending regulatory approval, Neuralink is ready for a trial of Blindsight, which could help restore patients' vision.</span></p><p class=\"\"><span>By the end of the decade, Neuralink wants to implant its tech in a \"otherwise healthy\" person because the benefit outweighs the risk, President DJ Seo said last September. That could mean people would be able to pay for the ability to use their phones without physically doing anything.</span></p><p class=\"\"><span>In October, Neuralink submitted a scientific paper to the New England Journal of Medicine that described the first three patients implanted with one of its devices. It would be its first peer-reviewed publication with human data.</span></p><p class=\"\"><span>The startup's approach includes placing electrodes near certain neurons after a protective layer around the brain and a piece of the patient's skull are removed. Then, Neuralink uses a robot to insert microscopic threads into the brain. After that, the implant is placed in the skull and skin is closed over it, according to the company.</span></p><p class=\"\"><span>Competing with Neuralink is Synchron, a BCI company that has implanted 10 patients with devices designed to avoid open-brain surgery and recently raised $200 million. The firm has been backed by Amazon (AMZN) founder Jeff Bezos and was the first BCI company with connectivity to Apple (AAPL) devices.</span></p><p class=\"\"><span>Pandromics, another competitor, implanted its BCI in a human for the first time last June. Its Connexus BCI is designed to restore communication for people with severe motor impairment as a result of spinal-cord injuries or ALS.</span></p><p class=\"\"><span>There's also the new kid on the block.</span></p><p class=\"\"><span>Merge Labs exited stealth mode in mid-January with $252 million in funding from investors, including OpenAI. Altman, OpenAI's CEO, helped found Merge Labs, which aims to create widely accessible BCIs that are \"equal parts biology, device and AI.\"</span></p><p class=\"\"><span>Altman's role with Merge Labs set the stage for another rivalry in his long-standing feud with Musk, who helped found OpenAI but has soured on the company. Altman has also reportedly explored buying a rocket maker to compete with Musk's SpaceX. Musk, meanwhile, founded rival artificial-intelligence startup xAI and has taken OpenAI to court.</span></p><p class=\"\"><span>Those U.S. tech big shots face increasing competition from overseas, particularly in China. According to Morgan Stanley, the Chinese government is expected to feature BCI technology prominently in its next five-year plan, set to be unveiled in March.</span></p><p class=\"\"><span>\"Inclusion in the plan would likely signal increased policy support, funding and commercialization pathways for BCI research and development over the next five years,\" analyst Adam Jonas said Wednesday.</span></p><p class=\"\"><span>Some of that support is already here. In December, China unveiled a 11.6 billion yuan ($1.7 billion) fund to support BCI companies. In August 2025, Chinese agencies revealed a plan to reach breakthroughs in \"core BCI technologies\" and build at least two globally competitive BCI firms over the next few years.</span></p><p class=\"\"><span>Jonas noted that researchers at a Chinese university recently completed the first in-orbit test of a wireless BCI, collecting stable data under extreme conditions. China also has at least 20 BCI startups, 14 of which are funded, according to Tracxn.</span></p><p class=\"\"><span>-William Gavin</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260226015477:0/",
            "pub_date": "2026-02-27 03:21:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM17R:0",
            "title": "Bank of Mexico edges up 2026 economic growth forecast but flags risks ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The Bank of Mexico on Thursday edged up its growth forecast for Mexico's economy this year, but flagged continued risks from global trade tensions ahead of this year's revision of Mexico's trade deal with the U.S. and Canada.</span></p><p class=\"\"><span>In the central bank's report for the fourth quarter of 2025, published Thursday, the bank slightly raised its forecast for this year's gross domestic product growth to 1.6%, from a previous estimate of 1.1% in its report published in November. </span></p><p class=\"\"><span>While Mexico's economy is expected to see moderate improvement in 2026 after a weak 2025, Banxico said, the country continues to face a \"complex global environment,\" with global trade tensions and geopolitical conflicts posing risks.</span></p><p class=\"\"><span>Banxico, as the central bank is known, flagged the joint review of the United States-Mexico-Canada trade deal, scheduled for July, as a risk to growth. </span></p><p class=\"\"><span>\"Private consumption is estimated to trend upwards, while investment is anticipated to remain weak at least until the second half of 2026, given the uncertainty regarding the trade relationship with the United States and the upcoming review of the USMCA,\" Banxico said.</span></p><p class=\"\"><span>Despite the related uncertainty, the central bank said \"a deeper economic integration in the North American region continues to offer potential shared gains for its member countries.\"</span></p><p class=\"\"><span>The bank also raised its projections for average annual inflation for the fourth quarter of 2026 to 3.5%, up from the forecast of 3.0% made in the bank's previous November report.</span></p><p class=\"\"><span>The bank also lifted its forecast for average annual core inflation for that period to 3.4%, up from the 3.0% estimated in November.</span></p><p class=\"\"><span>The revised forecasts were previously announced in Banxico's latest monetary policy decision on February 5. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM17R:0-bank-of-mexico-edges-up-2026-economic-growth-forecast-but-flags-risks/",
            "pub_date": "2026-02-27 03:21:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:2b62bc640f03a:0",
            "title": "DXP Enterprises, Inc. Reports Fourth Quarter and Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>DXP Enterprises, Inc., a leading products and service distributor, has released its financial results for the fourth quarter and fiscal year ending December 31, 2025. The company reported significant growth in sales and earnings, reflecting strong operational performance and strategic initiatives.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><span>For fiscal 2025, DXP Enterprises reported sales of $2.0 billion, marking an 11.9% increase from fiscal 2024. The company's net income rose to $88.7 million, a 25.8% increase from the previous year. The full-year GAAP diluted earnings per share (EPS) was $5.37, up from $4.22 in fiscal 2024. Adjusted EBITDA for the year was $225.3 million, representing 17.8% growth from the prior year.</span></p><p class=\"\"><span>In the fourth quarter of 2025, sales increased by 12.0% to $527.4 million compared to the same period in 2024. Net income for the quarter was $22.8 million, a 6.9% increase from the fourth quarter of 2024. The diluted EPS for the quarter was $1.39, up from $1.29 in the same period last year. Adjusted EBITDA for the quarter was $59.0 million, up from $50.3 million in the fourth quarter of 2024.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business and Operational Highlights</span></strong></p><span> </span><p class=\"\"><span>DXP Enterprises' business segments showed varied performance. The Service Centers segment reported revenue of $1.4 billion for the fiscal year, an 11.0% increase year-over-year, with a 14.4% operating income margin. The Innovative Pumping Solutions segment saw a 26.4% increase in revenue to $390.3 million, with an 18.0% operating income margin. However, the Supply Chain Services segment experienced a slight decline in revenue by 1.4% to $252.9 million, with an 8.7% operating margin.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives and Corporate Developments</span></strong></p><span> </span><p class=\"\"><span>During fiscal 2025, DXP Enterprises completed six acquisitions, contributing to its growth strategy. The company also refinanced its Senior Secured Term Loan B, raising an incremental $205 million and reducing borrowing costs by 50 basis points. Additionally, DXP repurchased 0.2 million shares for $17.0 million and ended the year with $303.8 million in cash and restricted cash.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Management's Perspective</span></strong></p><span> </span><p class=\"\"><span>David R. Little, Chairman and CEO, expressed satisfaction with the company's performance, highlighting the efforts of the DXP team in driving growth and managing operational efficiencies. He noted the strong performance across business segments and the positive momentum heading into 2026. CFO Kent Yee emphasized the company's successful execution of its market diversification strategy and operational improvements, which contributed to the robust financial results.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong></p><span> </span><p class=\"\"><span>Looking ahead, DXP Enterprises is optimistic about its growth prospects in 2026. The company expects continued momentum in key markets such as water and wastewater, with positive dynamics anticipated in traditional markets like energy in the second half of the year. The company aims to drive both organic and acquisition-driven growth while maintaining a focus on improving margins and operational discipline.</span></p><p class=\"\"><span>Original SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1020710/000162828026012138/dxpe-20260226.htm\" rel=\"nofollow\" target=\"_blank\">DXP ENTERPRISES INC [ DXPE ] - 8-K - Feb. 26, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:2b62bc640f03a:0-dxp-enterprises-inc-reports-fourth-quarter-and-fiscal-2025-results/",
            "pub_date": "2026-02-27 03:13:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013266:0",
            "title": "D-Wave Quantum Is Maintained at Buy by Needham",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013266:0/",
            "pub_date": "2026-02-27 03:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938898:0",
            "title": "ZTS: 2026 guidance targets steady growth, innovation, and margin discipline amid evolving competition",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Solid 2025 results with 6% revenue growth and double-digit EPS were achieved despite macro and competitive headwinds. 2026 guidance reflects prudent expectations, with synchronized calendar reporting and continued focus on innovation, margin discipline, and omni-channel distribution. Key franchises remain well-positioned, and capital allocation strategies support long-term growth.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938898:0-zts-2026-guidance-targets-steady-growth-innovation-and-margin-discipline-amid-evolving-competition/",
            "pub_date": "2026-02-27 03:13:39",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938899:0",
            "title": "TEP: 2025 delivered resilient growth, strong cash flow, and major leadership changes amid transformation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Solid 2025 results with €10.2B revenue and strong free cash flow, despite FX and market headwinds. Core Services grew 2.7% like-for-like, while Specialized Services declined but maintained profitability. Major governance changes, AI-driven transformation, and a strategic portfolio review set the stage for 2026.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938899:0-tep-2025-delivered-resilient-growth-strong-cash-flow-and-major-leadership-changes-amid-transformation/",
            "pub_date": "2026-02-27 03:13:41",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938900:0",
            "title": "JBIO: JADE101 targets best-in-class status for IgA nephropathy, with pivotal data expected this year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The presentation highlighted a robust pipeline targeting autoimmune diseases, with JADE101 poised for key data readouts and market leadership in IgA nephropathy. Strong financials support rapid advancement of three clinical programs, with major milestones expected through 2027.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938900:0-jbio-jade101-targets-best-in-class-status-for-iga-nephropathy-with-pivotal-data-expected-this-year/",
            "pub_date": "2026-02-27 03:13:49",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938901:0",
            "title": "VIRI: Strong 2025 results with higher profits, lower debt, and $100M net cash flow targeted for 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>2025 saw strong revenue and profit growth, driven by an asset-light strategy, robust Geoscience and Earth Data performance, and significant debt reduction. Guidance for 2026 targets $100 million net cash flow, with a backloaded activity profile and continued focus on technology and deleveraging.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938901:0-viri-strong-2025-results-with-higher-profits-lower-debt-and-100m-net-cash-flow-targeted-for-2026/",
            "pub_date": "2026-02-27 03:13:50",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:beb150f4d75b6:0",
            "title": "Compagnie De Saint-Gobain Full Year Profit Climbs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>COURBEVOIE (dpa-AFX) - Compagnie de Saint-Gobain (COD.L) released earnings for its full year that Increases, from the same period last year</span></p><p class=\"\"><span>The company's bottom line totaled EUR2.883 billion, or EUR5.83 per share.  This compares with EUR2.844 billion, or EUR5.69 per share, last year.</span></p><p class=\"\"><span>Excluding items, Compagnie de Saint-Gobain reported adjusted earnings of EUR3.309 billion or EUR6.70 per share for the period.</span></p><p class=\"\"><span>The company's revenue for the period fell 0.2% to EUR46.483 billion from EUR46.571 billion last year.</span></p><p class=\"\"><span>Compagnie de Saint-Gobain earnings at a glance (GAAP) :</span></p><p class=\"\"><span>-Earnings: EUR2.883 Bln. vs. EUR2.844 Bln. last year.</span></p><p class=\"\"><span>-EPS: EUR5.83 vs. EUR5.69 last year.</span></p><p class=\"\"><span>-Revenue: EUR46.483 Bln vs. EUR46.571 Bln last year.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:beb150f4d75b6:0-compagnie-de-saint-gobain-full-year-profit-climbs/",
            "pub_date": "2026-02-27 03:14:27",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:60c6c1d33c268:0",
            "title": "Prysmian S.p.A. Profit Climbs In Full Year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>ROME (dpa-AFX) - Prysmian S.p.A. (PRY.MI) revealed earnings for its full year that Increased, from the same period last year</span></p><p class=\"\"><span>The company's bottom line totaled EUR1.270 billion, or EUR4.30 per share.  This compares with EUR729 million, or EUR2.52 per share, last year.</span></p><p class=\"\"><span>The company's revenue for the period rose 15.4% to EUR19.650 billion from EUR17.026 billion last year.</span></p><p class=\"\"><span>Prysmian S.p.A. earnings at a glance (GAAP) :</span></p><p class=\"\"><span>-Earnings: EUR1.270 Bln. vs. EUR729 Mln. last year.</span></p><p class=\"\"><span>-EPS: EUR4.30 vs. EUR2.52 last year.</span></p><p class=\"\"><span>-Revenue: EUR19.650 Bln vs. EUR17.026 Bln last year.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:60c6c1d33c268:0-prysmian-s-p-a-profit-climbs-in-full-year/",
            "pub_date": "2026-02-27 03:14:50",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013271:0",
            "title": "Tigo Energy Files 8K - Other Events >TYGO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Tigo Energy Inc. (TYGO) filed a Form 8K - Other Events - with the U.S Securities and Exchange Commission on February 26, 2026.</span></p><p class=\"\"><span>On February 24, 2026, the Company issued a press release announcing the pricing of the Offering. A copy of such press release is attached to this Current Report as Exhibit 99.1 and incorporated herein by reference.</span></p><p class=\"\"><span>Forward-Looking Statements</span></p><p class=\"\"><span>This Current Report contains certain \"forward-looking statements\" relating to the business of the Company and its subsidiaries, including statements regarding the timing and completion of the Offering. All statements, other than statements of historical fact, included herein are \"forward-looking statements.\" These forward-looking statements are often identified by the use of forward-looking terminology such as \"believes,\" \"intends,\" \"expects,\" or similar expressions, involving known and unknown risks and uncertainties. Although the Company believes that the expectations reflected in these forward-looking statements are reasonable, they do involve assumptions, risks and uncertainties, and these expectations may prove to be incorrect. Investing in our securities involves a high degree of risk. Before making an investment decision, you should carefully consider the risks, uncertainties and forward-looking statements described under \"Risk Factors\" in Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2024 (Annual Report) and any subsequently filed quarterly reports on Form 10-Q and any Current Reports on Form 8-K. Investors should not place undue reliance on these forward-looking statements, which speak only as of the date of this press release.</span></p><p class=\"\"><span>The Company's actual results could differ materially from those anticipated in these forward-looking statements as a result of a variety of factors, including those discussed in the Company's periodic reports that are filed with the Securities and Exchange Commission and available on its website at http://www.sec.gov. If any material risk was to occur, our business, financial condition or results of operations would likely suffer. In that event, the value of our securities could decline and you could lose part or all of your investment. Additional risks not presently known to us or that we currently deem immaterial may also impair our business operations. In addition, our past financial performance may not be a reliable indicator of future performance, and historical trends should not be used to anticipate results in the future. All forward-looking statements attributable to the Company or persons acting on its behalf are expressly qualified in their entirety by these factors. Other than as required under the securities laws, the Company does not assume a duty to update these forward-looking statements.</span></p><p class=\"\"><span>The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1855447/000121390026020685/ea0278337-8k_tigo.htm</span></p><p class=\"\"><span>Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1855447/000121390026020685/0001213900-26-020685-index.htm</span></p><p class=\"\"><span>Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013271:0/",
            "pub_date": "2026-02-27 03:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013270:0",
            "title": "Tigo Energy Files 8K - Entry Into Definitive Agreement >TYGO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Tigo Energy Inc. (TYGO) filed a Form 8K - Entry Into a Definitive Agreement - with the U.S Securities and Exchange Commission on February 26, 2026.</span></p><p class=\"\"><span>On February 24, 2026, Tigo Energy, Inc. (the \"Company\") entered into a Securities Purchase Agreement (the \"Purchase Agreement\") with certain institutional investors (the \"Investors\"), pursuant to which the Company agreed to issue and sell, in a registered direct offering (the \"Offering\"), an aggregate of 5,000,000 shares of the Company's common stock, par value $0.0001 per share (\"Common Stock\"), at a purchase price of $3.00 per share (the \"Shares\"), for gross proceeds from the Offering of $15 million, before deducting placement agent fee and estimated offering expenses.</span></p><p class=\"\"><span>The Shares are offered by the Company pursuant to an effective shelf registration statement on Form S-3 (File No. 333-282013) that was filed with the Securities and Exchange Commission (the \"SEC\") on September 9, 2024 and declared effective on September 17, 2024. A prospectus supplement and accompanying base prospectus describing the terms of the Offering has been filed with the SEC.</span></p><p class=\"\"><span>The closing of the Offering is expected to take place on February 26, 2026, subject to customary closing conditions. The Company intends to use the net proceeds from the Offering for general corporate and working capital purposes.</span></p><p class=\"\"><span>Pursuant to the terms of the Purchase Agreement, the Company has agreed to certain restrictions on the issuance and sale of its Common Stock during the 30-day period following the closing of the Offering. In addition, the Company has agreed not to effect or enter into an agreement to effect any issuance of Common Stock or Common Stock Equivalents (as defined in the Purchase Agreement) involving a Variable Rate Transaction (as defined in the Purchase Agreement) for six months after the closing date of the Offering. Each of the Company's directors and officers agreed to enter into a lock-up agreement pursuant to which each have agreed, subject to certain exceptions set forth therein, not to dispose of or hedge any shares of common stock of the Company or securities convertible into or exchangeable for shares of common stock during the period from the date of such lock-up agreement until 30 days after the Closing Date (as defined in the Purchase Agreement).</span></p><p class=\"\"><span>The Purchase Agreement contains customary representations and warranties and agreements of the Company and the Investors and customary indemnification rights and obligations of the parties.</span></p><p class=\"\"><span>Craig-Hallum Capital Group LLC (\"Craig-Hallum\") served as placement agent for the offering. As compensation for such placement agent services, the Company has agreed to pay Craig-Hallum an aggregate cash fee equal to 4.5% of the gross proceeds received by the Company from the Offering and the reimbursement of up to $75,000 of legal and other expenses as actually incurred.</span></p><p class=\"\"><span>The foregoing summary of the form of Purchase Agreement does not purport to be complete and are subject to, and qualified in its entirety by, the full text of the Purchase Agreement attached as Exhibit 10.1 to this Current Report on Form 8-K (this \"Current Report\") and is incorporated herein by reference.</span></p><p class=\"\"><span>This Current Report does not constitute an offer to sell any securities or a solicitation of an offer to buy any securities, nor shall there be any sale of any securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</span></p><p class=\"\"><span>A copy of the legal opinion and consent of White &amp; Case LLP relating to the validity of the issuance and sale of the Shares is attached as Exhibit 5.1 hereto.</span></p><p class=\"\"><span>The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1855447/000121390026020685/ea0278337-8k_tigo.htm</span></p><p class=\"\"><span>Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1855447/000121390026020685/0001213900-26-020685-index.htm</span></p><p class=\"\"><span>Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013270:0/",
            "pub_date": "2026-02-27 03:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013274:0",
            "title": "NCR Voyix Is Maintained at Buy by Needham",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013274:0/",
            "pub_date": "2026-02-27 03:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013272:0",
            "title": "C3.ai Is Maintained at Neutral by UBS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:15 GMT) </span></strong><span>C3.ai Price Target Cut to $9.00/Share From $14.50 by UBS</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013272:0/",
            "pub_date": "2026-02-27 03:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSLw96ga:0",
            "title": "Black Wealth Events Expands National Strategy Through New Partnerships",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Collaboration with DRIVE at University of Memphis, Central Brooklyn Economic Development Corp., Circular Economy Alliance to reframe Opportunity Zones and circular economics</span></p><p class=\"\"><span>MEMPHIS, TENNESSEE / ACCESS Newswire / February 26, 2026 / Black Wealth Events (BWE) today announced a landmark strategic partnership with DRIVE at University of Memphis, the Central Brooklyn Economic Development Corp (CBEDC), and the Circular Economy Alliance (CEA), alongside Heart &amp; Soul Magazine.</span></p><p class=\"\"><span>This multi-sector collaboration is architecting a national infrastructure for institutional stewardship, reframing Opportunity Zones and circular economics as primary engines for Black economic agency.</span></p><p class=\"\"><span>The partnership is anchored by the March 17 convening, \"Leading with Legacy: Innovation, Wealth &amp; Social Change,\" at the University of Memphis. The event positions BWFF and its partners as the premier conveners for investors, university leadership, and policymakers to transition Opportunity Zones from passive tax incentives into de-risked corridors for strategic capital and community-anchored growth.</span></p><p class=\"\"><span>\"At Black Wealth Family Foundation, our mission is to move beyond episodic charity toward measurable value created through superior governance and community-led ownership,\" said LaMar Wright, CEO of the Black Wealth Family Foundation (BWFF) and architect of BWE. \"By aligning anchor institutions, technical experts like CEA, and community visionaries like CBEDC, we are stopping the 'wealth leak' and ensuring that capital stays within the communities that generate it.\"</span></p><p class=\"\"><span>DRIVE at The University of Memphis is a program that serves as a critical catalyst. Through this partnership, DRIVE and BWFF will operationalize \"Circular Opportunity Zone Development (COZD),\" a proprietary model supported by CEA's global innovation frameworks and CBEDC's proven track record in urban revitalization.</span></p><p class=\"\"><span>The March 17 program highlights include:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Opportunity Zones 2.0 Keynote: A strategic session on moving from policy to performance, emphasizing capital accountability and institutional-grade outcomes.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Circular Opportunity Zone Roundtable: A high-level dialogue featuring DRIVE and CBEDC leadership, exploring how municipalities and investors can serve as long-term stewards rather than one-time project sponsors.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The DRIVE Lab &amp; Hub: An immersive experience featuring four distinct zones:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZONE A: COZD</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZONE B: DRIVE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZONE C: CBEDC</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZONE D: Partnership &amp; Investment Desk</span></p></li></ul></li></ul><p class=\"\"><span>Heart &amp; Soul Magazine, a national leader in health, wealth, and well-being for women of color, joins as the official storytelling collaborator.</span></p><p class=\"\"><span>\"March 17 is more than a single event - it is a demonstration of the power of partnership,\" said Adrienne T. Cooper, Ph.D., program director of DRIVE University of Memphis. \"Together with the Black Wealth Family Foundation, DRIVE is expanding the resources, opportunities, and innovation pathways available to our communities. This activation shows what's possible when we align our strengths to build circular wealth, strengthen local ecosystems, and open doors that have historically been closed.\"</span></p><p class=\"\"><span>As the convener, DRIVE at the University of Memphis serves as a primary intake point for the BWFF Emerging Leaders Cohort, a signature initiative identifying the top 1% of talent to prepare them for careers in institutional investment.</span></p><p class=\"\"><span>To learn more about the event, visit BlackWealthFamilyFoundation.com and click here to register.</span></p><p class=\"\"><span>Media Contact:</span></p><p class=\"\"><span>Neil Foote, Ascendant Group Branding,</span></p><p class=\"\"><span>neilfoote@ascendantgroupbranding.com | 214-448-3765</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Black Wealth Events</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSLw96ga:0/",
            "pub_date": "2026-02-27 03:15:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S0N3YN04M:0",
            "title": "Ecuador's national assembly approves mining sector reform",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Ecuador's National Assembly on Thursday approved reforms proposed by President Daniel Noboa aimed at boosting the nation's mining sector.</span></p><p class=\"\"><span>        The changes include modifications to environmental permitting processes, part of an effort to attract investment to an industry that has struggled to gain traction.</span></p><p class=\"\"><span>        The reforms passed with 77 votes in favor, 70 against, and four abstentions. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S0N3YN04M:0-ecuador-s-national-assembly-approves-mining-sector-reform/",
            "pub_date": "2026-02-27 03:07:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2XY:0",
            "title": "Trip.com Group Ltd reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Trip.com Group Ltd </span><span> reported quarterly adjusted earnings of CNY27.56​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of CNY4.35.  The mean expectation of fifteen analysts for the quarter was for earnings of CNY8.22 per share. Wall Street expected results to range from CNY3.99  to CNY5.58 per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 15.5% to CNY18.34 billion from a year ago; analysts expected CNY18.16 billion. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Trip.com Group Ltd's reported EPS for the quarter was CNY28.61​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of CNY19.89 billion.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Trip.com Group Ltd shares had fallen by 25.4% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had fallen by about 43.4% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 29 \"strong buy\" or \"buy,\" 3 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the leisure &amp; recreation peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Trip.com Group Ltd is $80.50, about 33.3% above its last closing price of $53.66</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 07:06 p.m. UTC. ​All figures in Chinese yuan renminbi unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>8.22</span></p></td><td><p class=\"\"><span>4.97</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>6.17</span></p></td><td><p class=\"\"><span>7.20</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>5.62</span></p></td><td><p class=\"\"><span>5.96</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2024 </span></p></td><td><p class=\"\"><span>3.84</span></p></td><td><p class=\"\"><span>5.96</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2XY:0-trip-com-group-ltd-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 03:07:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM18P:0",
            "title": "Aramco cancels Juaymah LPG deliveries through March for repairs, traders say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Shariq Khan and Dmitry Zhdannikov</span></p><p class=\"\"><span>    Saudi Aramco's </span><span> Juaymah liquefied petroleum gas export terminal is expected to be offline for repairs for at least a month after an outage this week forced the cancellation of cargoes through March, traders said on Thursday.</span></p><p class=\"\"><span>The lengthy outage at Juaymah, one of the world's largest LPG export terminals, is expected to tighten propane and butane availability in Asia and has driven up prices at a time of high demand for the heating, cooking and petrochemical feedstock fuels.</span></p><p class=\"\"><span>Aramco on Wednesday said it had halted LPG deliveries from Juaymah after structural damage to a portion of the delivery segment carrying propane and butane on February 23.</span></p><p class=\"\"><span>Deliveries scheduled over the next few weeks from the Juaymah Natural Gas Liquids facility have been cancelled, the company said. Aramco also said the scope and duration of the impact remain under evaluation.</span></p><p class=\"\"><span>The Juaymah outage is currently expected to last for at least a month as the company undertakes repairs of the delivery system, two industry sources told Reuters. It was not immediately clear what caused the damage, they said.</span></p><p class=\"\"><span>When asked for comment on Thursday, Aramco reiterated its statement from Wednesday.    </span></p><p class=\"\"><span>Juaymah is currently the world's seventh-largest LPG export terminal and shipped more than 450,000 tons in average monthly LPG exports in each of the past two years, based on Kpler shiptracking data.</span></p><p class=\"\"><span>At least 60% of last year's LPG exports from Juaymah went to India, which is expected to be hardest hit by the terminal's outage. Up to 10 LPG cargoes scheduled to load from Juaymah in March for delivery to India have been cut, a refining source told Reuters earlier on Thursday.</span></p><p class=\"\"><span>The Juaymah outage will certainly bring some business to the </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/\" rel=\"nofollow\" target=\"_blank\">U.S.</a><span> at some point as buyers seek alternatives to the cancelled cargos, said Greg Bower, an LPG broker at New Stone Americas.</span></p><p class=\"\"><span>     The U.S. has plenty of propane and butane with ending inventories for the winter demand season projected to be the highest on record, Bower added. That will likely limit any upside to prices in the U.S. despite the pull from Asia, he said.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM18P:0-aramco-cancels-juaymah-lpg-deliveries-through-march-for-repairs-traders-say/",
            "pub_date": "2026-02-27 03:07:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013236:0",
            "title": "Tronox Holdings Is Maintained at Neutral by UBS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:09 GMT) </span></strong><span>Tronox Holdings Price Target Raised to $7.50/Share From $5.25 by UBS</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013236:0/",
            "pub_date": "2026-02-27 03:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}