{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObihSvPva:0",
            "title": "Limited negative effects for Kongsberg Automotive related to imposed and potential new tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kongsberg, February 5, 2025: Kongsberg Automotive (KA) sees limited negativeeffects from imposed tariffs on imports from China. KA will seek fullcompensation for increased customs tariffs from its customers to recover anyadditional costs imposed by these tariffs, similar to what others in theindustry will do. The impact of new tariffs will be limited also with lessthanfull customer compensation.President of the United States (US) Donald Trump signed executive orders onFeb1, 2025, to implement 25% tariffs on Mexican and Canadian goods, whileimposinga 10% duty on Chinese goods. On February 3, 2025, President Trump agreed toholdoff imposing tariffs on Mexico and Canada for 30 days, while the plan to levytariffs on China came into effect on February 4, 2025.</p><p class=\"\">\"It is important to note that it is not a challenge that KA is facing alone,itis a global vehicle and automotive industry challenge. KA has the ambition tofully recover any additional cost related to the imposed tariffs-passing thecost on to our customers ultimately means that the vehicles will be moreexpensive. We see a risk that higher vehicle prices will lower the overallmarket demand, which then would impact negatively on KA's orderbooks,\" saysKA'sinterim President &amp; CEO and CFO Christian Johansson.KA has two manufacturing plants in Mexico: In Ramos Arizpe for the FlowControlSystems product range and in Nuevo Laredo, for the Drive Control Systems andDriveline product range. KA's customers are primarily commercial vehicle andpassenger car manufacturers, or Tier 1 suppliers to the automotive industry.Products are shipped to customer production sites in the US and in Mexico. KAhas three manufacturing sites in the US, selling primarily to US-basedcustomers. In Canada, KA has a smaller manufacturing plant supplying toprimarily a local Canadian customer.Based on the information available to date, all material and componentssourcedby KA from China to KA's US plants are subject to increased tariffs. Inaddition, materials delivered to KA plants in the US by US suppliers havingsub-supplies from China are on that portion subject to increased customs tariffs.The customs tariffs increase is estimated to be approximately MEUR 2 for thefull year 2025, based on present purchasing volumes.Potential tariffs for exports from Mexico to the US will have to be assessedwhen the regulations for how this will be implemented will be fully known andifthese tariffs will be imposed. Based on present information, the company'sassessment is that the negative effect would be fairly limited since thematerial and components under temporary import to Mexico from the US areexempted.KA is continuously preparing to be able to act quickly if increased tariffs onMexican and Canadian goods take effect after the 30-day postponement.</p><p class=\"\">KA believes in the importance of local presence in North America and continuesto have ambitions to increase sourcing locally in the region. As a company, KAis continuously considering its supplier base footprint based on total landedcost. Tariffs are one important existing parameter in the sourcing processtoday. With the new tariffs in place and preliminary future changes, thesupplier sourcing strategy will be adapted where necessary going forward.</p><p class=\"\">Media and Communications contact:Therese Sjöborg Skurdal - Director Group Marketing and Communicationstherese.skurdal@ka-group.com+47 982 14 059</p><p class=\"\">Investor Relations contact:investor.relations@ka-group.com</p><p class=\"\">About Kongsberg Automotive ASAKongsberg Automotive provides cutting-edge technology to the global vehicleindustry. We drive the global transition to sustainable mobility by puttingengineering, sustainability, and innovation into practice. Our productportfolioincludes driver and motion control systems, fluid assemblies, and industrialdriver interface products. Find more information at:https://www.kongsbergautomotive.com</p><p class=\"\">https://newsweb.oslobors.no/message/637743</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObihSvPva:0-limited-negative-effects-for-kongsberg-automotive-related-to-imposed-and-potential-new-tariffs/",
            "pub_date": "2025-02-05 14:47:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L5N3OJ1B3:0",
            "title": "Wind turbine maker Vestas Q4 profit beats expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Denmark's Vestas , the world's biggest wind turbine maker, reported on Wednesday a higher-than-expected adjusted operating profit for the fourth quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L5N3OJ1B3:0-wind-turbine-maker-vestas-q4-profit-beats-expectations/",
            "pub_date": "2025-02-05 14:48:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC6PCGFF:0",
            "title": "Alfa Laval To Acquire Nrg Marine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alfa Laval AB :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">TO ACQUIRE NRG MARINE TO ADVANCE INNOVATIVE ANTI-FOULING TECHNOLOGY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACQUISITION EXPECTED TO CLOSE IN Q2 2025</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC6PCGFF:0-alfa-laval-to-acquire-nrg-marine/",
            "pub_date": "2025-02-05 14:48:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463772:0",
            "title": "Tokyo Seimitsu's Shares Soar 21% as Nine-Month Profit Balloons 71%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tokyo Seimitsu  recorded a 71% rise in attributable profit for the nine months ended Dec. 31, 2024, to 18.1 billion yen from 10.6 billion yen in the year-ago period, a Tuesday bourse filing said. </p><p class=\"\">Earnings per share were 444.19 yen in the nine months, up from 260.54 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The semiconductor manufacturing equipment maker saw a 16% rise in net sales to 103.1 billion yen in the period from 88.9 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 23.3 billion yen, a basic EPS of 575.95 yen, net sales of 146 billion yen, and a total dividend of 228 yen per share for the fiscal year ending March 31. </p><p class=\"\">Shares of the company were up nearly 21% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463772:0/",
            "pub_date": "2025-02-05 14:48:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001068_20250205001229:0",
            "title": "Vestas Wind Systems 2024 Net Pft EUR499M",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001068_20250205001229:0/",
            "pub_date": "2025-02-05 14:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001245:0",
            "title": "South Korea's Kospi Rises 1.1% as Fears Over U.S. Tariffs Ease — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">0649 GMT - South Korea's benchmark Kospi rose 1.1% to close at 2509.27 amid easing fears over U.S. tariffs. Foreign and institutional investors were net buyers. LG Energy Solution and Samsung SDI gained 3.6% and 3.4%, respectively, after the government prepared a new aid plan for the EV battery industry. Memory-chip maker SK Hynix added 4.0%. Mobile internet giant Kakao climbed 5.6% after agreeing to develop AI Products with OpenAI. Meanwhile, LG CNS, an IT service affiliate of LG Group, fell 9.9% on its stock exchange debut. USD/KRW settled 1.3% lower at 1,444.30 in Seoul onshore trading. South Korea's 10-year government bond yield was down 2.3 bps at 2.821%. (kwanwoo.jun@wsj.com)</p><p class=\"\">0518 GMT - Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0439 GMT - Japan's cash earnings jumped in December, while Moody's Analytics' Stefan Angrick sees little evidence of sustained real wage growth. At first glance, the data suggests things are turning around as monthly cash earnings rose solidly, the economist says, adding that the devil is in the details. Though nominal pay growth is picking up, the gains are uneven, and real cash earnings climbed only 0.6% on year, he says, describing it \"a far more modest gain than the glossy nominal figure.\" The pay bump was also driven significantly by temporary factors, such as bonuses. Wage growth is likely to improve despite strong headwinds expected in 2025, including, but not limited to, a potential inflation spike, he adds. Much depends on the spring wage negotiations. If pay gains come in below 5%, that could delay the rate hikes, he adds. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0422 GMT - Hong Kong PMI data show continued concern among private sector firms about the year ahead as global uncertainty rises. The headline S&amp;P Global PMI for January signaled only a modest improvement in business conditions and slipped to its lowest since September 2024. Weak external demand was the main growth constraint, says Tim Moore, economics director at S&amp;P Global Market Intelligence. \"Survey respondents noted subdued willingness to spend among clients amid concerns about the near-term global economic outlook, in particular the impact of potential U.S. tariffs.\" Export sales fell at the fastest pace since September 2024, while new business from Mainland China decreased to the greatest extent since April 2022. Despite an upturn in total new work, Hong Kong firms remain pessimistic about the year ahead, Moore says. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0402 GMT - Singapore dollar is steady against its U.S. counterpart in the Asian session amid caution over the latest tariffs from the U.S. and China. \"We are only at the beginning of the tariff saga,\" Maybank analysts say in an FX Research &amp; Treasury report. \"It would be wise to be slightly more cautious as there is a likely limit to how much the USD can weaken,\" the analysts say. USD/SGD is little changed at 1.3524. (ronnie.harui@wsj.com)</p><p class=\"\">0339 GMT - The Bank of Korea may cut its policy rate later this month despite January's pickup in domestic inflation, Barclays economist Bum Ki Son writes in a note. Headline inflation accelerated to 2.2% from 1.9% in December, but the BOK may focus on soft core inflation and weak domestic demand, Son says. Core inflation, which strips out volatile food and energy prices, ticked up to 1.9% from 1.8% in December. BOK policymakers see forex-related pressures as limited and oil prices as a one-off shock, he notes. \"As such, we believe inflation is unlikely to stop the BOK from cutting rates 25bp at its February meeting,\" he says. (kwanwoo.jun@wsj.com)</p><p class=\"\">0338 GMT - The Philippines' higher-than-expected January inflation print has cleared the way for a rate cut from the BSP next week, Barclays economist Shreya Sodhani says in a note. Although headline CPI rose 2.9% on year, it remained at the midpoint of BSP's 2.5%-3.3% forecast range, she writes. Inflation was driven by food prices, which usually rise in January, she says. The latest inflation print and slower-than-expected 4Q GDP growth suggest that a rate cut is the most likely outcome, she adds. However, there are risks that the BSP could delay rate cuts, as officials have suggested that the central bank may ease only once in 1H and another time in 2H, she says. Barclays continues to expect three rate cuts this year. (amanda.lee@wsj.com)</p><p class=\"\">0323 GMT - China's target measures unveiled on Tuesday leave room for potential talks with the U.S., say two economists at BofA Global Research in a research report. \"These announcements mark a measured and comprehensive retaliation that seeks to target U.S. business interests, while minimizing the impact on China's economy,\" the economists say. China seems to be carefully targeting energy products which the country has the potential to purchase more of, they say. \"In potential negotiations in the future, reaching a deal where China pledges to buy more oil and gas from the U.S. may be more desirable than China reducing such imports on higher tariffs,\" the economists add. (ronnie.harui@wsj.com)</p><p class=\"\">0314 GMT - The U.S. Treasury 10-year yield still faces downside risk, based on daily charts, says Quek Ser Leang of UOB's Global Economics &amp; Markets Research in a research report. There's a possibility the 10-year yield will fall into the daily Ichimoku cloud, which is currently between 4.318% and 4.447%, the markets strategist says. Going forward, a break of the 10-year yield below the bottom of the daily Ichimoku cloud might potentially trigger sharp declines, the strategist says. On the other hand, if the 10-year yield rises above 4.690%, this would suggest that the 10-year yield is likely to trade in a range, the strategist adds. Treasury 10-year yield is steady at 4.5167%. (ronnie.harui@wsj.com)</p><p class=\"\">0257 GMT - Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0254 GMT - The future path of the U.S.-China trade conflict remains highly uncertain, say Goldman Sachs analysts in a note. China's retaliatory tariffs appear much less than proportional compared to the U.S.'s 10% across-the-board additional tariff on $525 billion worth of Chinese goods, they write. However, the combination of retaliatory tariffs with export bans, entity list additions, and antitrust probe into Google, suggests a \"more coordinated and comprehensive approach by [Chinese] policymakers\" than during the 2018-2019 U.S.-China trade war, they say. In the coming days, the U.S.'s reactions to China's retaliation will be among key events to watch, they add. (amanda.lee@wsj.com)</p><p class=\"\">0230 GMT - Unemployment in New Zealand is still rising despite rapid interest-rate cuts since mid-2024, leaving consumers and business owners still searching to see the light of an economic recovery. Mark Smith, senior economist at ASB Bank expects demand for labor will continue to weaken until a modest economic recovery finally shows up in the second half of 2025. Firms will have to carefully manage employee headcount in that time, he adds. With inflation close to the target midpoint and monetary settings still slowing the economy, further swift monetary easing looks appropriate to limit economic and labor market scarring, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001245:0/",
            "pub_date": "2025-02-05 14:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463789:0",
            "title": "Japanese Stocks Gain as Yen Climbs, BOJ Tightening Looms",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japanese shares gained Wednesday as the yen strengthened and bond yields climbed on robust wage data, fueling expectations of further Bank of Japan tightening. </p><p class=\"\">The Nikkei 225 rose 0.09%, or 33.11 points, to 38,831.48. The yen hit a seven-week high, while the 10-year government bond yield reached its highest since 2011. </p><p class=\"\">BOJ official Kazuhiro Masaki said rates would rise if inflation trends toward 2% as projected, though policy remains loose to support growth. </p><p class=\"\">Core inflation hit 3% in December, but the central bank prioritizes sustained price trends over short-term moves. </p><p class=\"\">Japan's services sector expanded at its fastest pace in four months in January, with the au Jibun Bank index at 53, driven by stronger demand and hiring. </p><p class=\"\">Export orders rose, though input costs climbed. The composite PMI reached 51.1, the strongest private-sector growth since September, offset by weak manufacturing. </p><p class=\"\">In corporate news, Gunma Bank  posted a 29% jump in nine-month attributable profit to 31.9 billion yen on a 6.6% rise in ordinary income. EPS climbed to 82.40 yen. </p><p class=\"\">Honda's  push to take full control of Nissan  has complicated their planned $58 billion merger, Financial Times reported. Renault, a key Nissan shareholder, is pushing for a higher premium. A decision is now expected in mid-February. </p><p class=\"\">Japan Hotel REIT  denied reports it is acquiring the Hyatt Regency Tokyo from KKR &amp; Co. and Gaw Capital Partners for over 100 billion yen. Bloomberg earlier reported the potential deal, citing record tourism and a weak yen boosting hotel demand.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463789:0-japanese-stocks-gain-as-yen-climbs-boj-tightening-looms/",
            "pub_date": "2025-02-05 14:49:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001246:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0649 GMT - South Korea's benchmark Kospi rose 1.1% to close at 2509.27 amid easing fears over U.S. tariffs. Foreign and institutional investors were net buyers. LG Energy Solution and Samsung SDI gained 3.6% and 3.4%, respectively, after the government prepared a new aid plan for the EV battery industry. Memory-chip maker SK Hynix added 4.0%. Mobile internet giant Kakao climbed 5.6% after agreeing to develop AI Products with OpenAI. Meanwhile, LG CNS, an IT service affiliate of LG Group, fell 9.9% on its stock exchange debut. USD/KRW settled 1.3% lower at 1,444.30 in Seoul onshore trading. South Korea's 10-year government bond yield was down 2.3 bps at 2.821%. (kwanwoo.jun@wsj.com)</p><p class=\"\">0518 GMT - Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001246:0/",
            "pub_date": "2025-02-05 14:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000391:0",
            "title": "Credit Agricole Raises Dividend After Higher Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(06:02 GMT) </strong>*Credit Agricole S.A. 4Q Rev EUR7.09B<br/><strong class=\"root-Tkn6WL2y\">(06:02 GMT) </strong>*Credti Agricole S.A. 4Q Expenses EUR3.92B<br/><strong class=\"root-Tkn6WL2y\">(06:03 GMT) </strong>*Credit Agricole S.A. 4Q Net Pft EUR1.69B<br/><strong class=\"root-Tkn6WL2y\">(06:03 GMT) </strong>*Credit Agricole S.A. 4Q Gross Operating Income EUR3.175B<br/><strong class=\"root-Tkn6WL2y\">(06:04 GMT) </strong>*Credti Agricole S.A. 4Q Underlying Net Income EUR1.73B<br/><strong class=\"root-Tkn6WL2y\">(06:05 GMT) </strong>*Credit Agricole S.A. CET1 Ratio 11.7% as of December 31<br/><strong class=\"root-Tkn6WL2y\">(06:06 GMT) </strong>*Credit Agricole S.A. Raises Dividend to EUR1.10<br/><strong class=\"root-Tkn6WL2y\">(06:49 GMT) </strong>Credit Agricole Raises Dividend After Higher Earnings</p><p class=\"\">By Pierre Bertrand</p><p class=\"\">Credit Agricole raised its dividend as it reported better-than-expected earnings on higher revenue in the final quarter of 2024.</p><p class=\"\">The French lender said Wednesday that fourth-quarter net profit was 1.69 billion euros, equivalent to $1.75 billion, compared with 1.33 billion euros a year prior.</p><p class=\"\">Revenue grew 17% to 7.09 billion euros. The bank said that all of its financial targets set out for 2025 were exceeded last year.</p><p class=\"\">The bank said it will propose a dividend of 1.10 euros a share, a 5% increase from 2023.</p><p class=\"\">Credit Agricole said its results reflected the performance of its retail-banking and consumer-finance activities. Home-loan activity in France rose 18%, while its corporate and investment banking business achieved a record level of assets under management and its insurance business posted record premiums, it said.</p><p class=\"\">The results compared with analysts' expectations of 1.36 billion euros in net profit on 6.58 billion euros of revenue, according to Visible Alpha consensus.</p><p class=\"\">Its common Tier 1 equity ratio--a measure of balance-sheet strength--stood at 11.7%.</p><p class=\"\">Write to Pierre Bertrand at pierre.bertrand@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000391:0/",
            "pub_date": "2025-02-05 14:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463780:0",
            "title": "Darbond Technology Finalizes Acquisition of Over 89% Stake in Suzhou Taijinuo New Materials Technology",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Darbond Technology  completed the first payment of its 257.8-million-yuan acquisition of an 89.4% stake in Suzhou Taijinuo New Materials Technology. </p><p class=\"\">Following the move, Suzhou Taijinuo New Materials Technology has updated its business registration and is now a holding subsidiary of the adhesive and sealant manufacturer, according to a Wednesday filing with the Shanghai bourse. </p><p class=\"\">Darbond Technology shares rose more than 2% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463780:0/",
            "pub_date": "2025-02-05 14:49:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0MW:0",
            "title": "Tesla's Megapack factory in Shanghai to hold opening ceremony on Feb. 11 - Shanghai Securities News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://www.cnstock.com/commonDetail/356100</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0MW:0-tesla-s-megapack-factory-in-shanghai-to-hold-opening-ceremony-on-feb-11-shanghai-securities-news/",
            "pub_date": "2025-02-05 14:49:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001249:0",
            "title": "Thai Credit Bank Seems Confident in Lowering Credit Costs in 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thai Credit Bank appears confident in lowering credit costs in 2025, CGS International's Weerapat Wonk-Urai says, citing management commentary at an analysts' briefing. Management highlighted the bank's improving debt collection capabilities, supported by its front office staff helping with loan collections as soon as the loans become overdue, the analyst says in a research report. Also, the bank sold non-performing loans worth THB1.9 billion last year and plans to sell THB1.4 billion worth of NPLs this year, the analyst adds. The brokerage raises the stock's target price to THB26.12 from THB26.00 with an unchanged add rating. Shares are 1.0% lower at THB19.00. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001249:0/",
            "pub_date": "2025-02-05 14:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463775:0",
            "title": "Market Chatter: AblePrint Technology Projects Up to 30% Annual Revenue Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AblePrint Technology  expects an annual revenue growth of between 20% to 30%, driven by strong AI-driven demand for advanced chip packaging, Taipei Times reported Wednesday. </p><p class=\"\">APT's revenue surged 51% to NT$1.8 billion in 2024, thanks to TSMC's  expanded CoWoS capacity and growing AI chip demand, reportedly. </p><p class=\"\">The company sees new opportunities in China, where AI firms are working around US chip restrictions, and is set to list on the Taipei Exchange on Feb. 26 at NT$1,250 per share, the publication said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463775:0/",
            "pub_date": "2025-02-05 14:50:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0N0:0",
            "title": "Norway's DNB tops quarterly profit view as economy gains steam",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Norway's largest bank DNB  reported a bigger-than-expected jump in fourth-quarter earnings on Wednesday, and said the Norwegian economy is gaining momentum, driven by increased housing market activity and rising demand for financing.</p><p class=\"\">DNB's net profit rose 34.8% to 12.68 billion crowns ($1.13 billion) during October-December, from 9.40 billion a year earlier. Analysts, on average, had expected 9.99 billion crowns, according to a company-compiled poll.</p><p class=\"\">High interest rates have bolstered Nordic banks' profit over the past two years. While other central banks in the region have started to ease their monetary policy, Norway has kept its policy rate steady to cool the economy, curb inflation and address rising business costs.</p><p class=\"\">     ($1 = 11.2314 Norwegian crowns)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0N0:0-norway-s-dnb-tops-quarterly-profit-view-as-economy-gains-steam/",
            "pub_date": "2025-02-05 14:44:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0HO:0",
            "title": "Mining and energy stocks lift Australian shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">ASX 200 gains after losing for two days</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold stocks hit record high</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Miners log best day in a month</li></ul></span></div><span><p class=\"\">    Australian shares regained some lost ground on Wednesday, helped by gains in mining and energy-focused stocks, a day after the country's top trading partner China took retaliatory measures responding to U.S. tariffs. </p><p class=\"\">The S&amp;P/ASX 200 index  closed 0.5% higher at 8416.9.</p><p class=\"\">U.S. President Donald Trump on Tuesday suspended tariffs on Mexico and Canada for a month, but imposed a 10% tariff on Chinese imports, prompting China to retaliate with levies on U.S. imports.</p><p class=\"\">Miners , which have a roughly 25% weightage on the benchmark and are heavily exposed to China, closed 1.7% higher, after clocking their biggest intra-day jump since Dec. 10.</p><p class=\"\">World's largest listed miner BHP Group  and sector heavyweights Fortescue  and Rio Tinto  all rose over 1.5%.</p><p class=\"\">\"The mining sub-index is having a snap back rally after the poor start to the year,\" said Damian Rooney, director of equity sales at Argonaut. The sub-index fell more than 18% in 2024.</p><p class=\"\">\"Iron ores led the way...on hopes that a U.S. and China trade war can be averted despite the first tariffs levied.\"</p><p class=\"\">Energy stocks  rose 1.5%, led by Karoon Energy  and Boss Energy , each up over 3%. </p><p class=\"\">Oil prices remain volatile amid trade war tensions, falling 3% on China's tariffs on Tuesday, although prices partially rebounded on Wednesday. </p><p class=\"\">Gold miners  rose as much as 1.9% to hit a record high earlier in the day, tracking strength in bullion prices. </p><p class=\"\">Northern Star  and Evolution Mining  advanced 1.7% and 2.1%, respectively.</p><p class=\"\">Meanwhile, shares in fund-manager Insignia Financial  surged to their highest in over three years after Brookfield Capital  matched rivals Bain Capital's and CC Capital's bid for the company.</p><p class=\"\">In New Zealand, the benchmark S&amp;P/NZX 50 index  fell 0.5% to end at 12,844.6.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0HO:0-mining-and-energy-stocks-lift-australian-shares/",
            "pub_date": "2025-02-05 14:44:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001068_20250205001149:0",
            "title": "Vestas Wind Systems 2024 Order Intake 17GW, EUR19B in value",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001068_20250205001149:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0M5:0",
            "title": "State Bank of India aims to raise 50 bln rupees via perpetual bonds, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The State Bank of India  is looking to raise around 50 billion rupees ($573.38 million) via Basel III-compliant additional Tier-I perpetual bonds before the end of February, three sources aware of the matter said on Wednesday.</p><p class=\"\">The country's largest lender could have a call option at the end of either five years or 10 years on the issue, the sources added.</p><p class=\"\">\"The lender has already started talking about the issue and based on investor feedback, they will take a final decision on the call option as well as the timing to launch this issue. Insurance companies are expected to be among the bidders,\" one of the sources said.</p><p class=\"\">SBI did not immediately reply to a Reuters email seeking comment. The sources declined to be named as they are not authorised to speak to the media.</p><p class=\"\">This would be the first such issuance from any lender in over three months.</p><p class=\"\">Incidentally, SBI was the last issuer that had tapped this route, when it raised 50 billion rupees at a coupon of 7.98% in October. This issue had a call option at the end of 10 years.</p><p class=\"\">Bankers also expect some mutual funds to participate in the latest issue since, earlier this year, the market regulator allowed mutual funds to value perpetual bonds based on their call option, a move that has improved appetite for such debt.</p><p class=\"\"> ($1 = 87.2025 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0M5:0-state-bank-of-india-aims-to-raise-50-bln-rupees-via-perpetual-bonds-sources-say/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000877_20250205001154:0",
            "title": "Novo Nordisk Plans to Initiate New CagriSema Phase 3 Trial in 2025 to Further Explore Weight Loss Potential",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000877_20250205001154:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001133_20250205001133:0",
            "title": "KDDI Corp Sees FY Net Y690.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001133_20250205001133:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001131_20250205001131:0",
            "title": "KDDI Corp 9-Mos Rev Y4.36T Vs Y4.27T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001131_20250205001131:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001132_20250205001132:0",
            "title": "KDDI Corp 9-Mos Oper Pft Y864.57B Vs Pft Y847.70B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001132_20250205001132:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001130_20250205001130:0",
            "title": "KDDI Corp 9-Mos Net Y536.53B Vs Net Y545.53B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001130_20250205001130:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN19bw2l:0",
            "title": "Bergman & Beving's Interim Report 1 April–31 December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Third quarter (1 October–31 December 2024)</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue rose by 6 percent to MSEK 1,264 (1,187).</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 10 percent to MSEK 121 (110) and the EBITA margin improved to 9.6 percent (9.3).</li><li class=\"listItem-bmN0_SHH\">Net profit amounted to MSEK 54 (55) and earnings per share after dilution totalled SEK 1.95 (1.95).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities totalled MSEK 214 (207).</li><li class=\"listItem-bmN0_SHH\">Four acquisitions have been completed, with annual revenue of approximately MSEK 310.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nine months (1 April-31 December 2024)</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue rose by 4 percent to MSEK 3,661 (3,509).</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 12 percent to MSEK 360 (322) and the EBITA margin improved to 9.8 percent (9.2).</li><li class=\"listItem-bmN0_SHH\">Net profit rose by 10 percent to MSEK 167 (152).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities totalled MSEK 502 (562).</li><li class=\"listItem-bmN0_SHH\">Earnings per share for the most recent 12-month period amounted to SEK 7.55 after dilution, compared with SEK 7.15 for the 2023/2024 financial year.</li><li class=\"listItem-bmN0_SHH\">Six acquisitions have been completed, with total annual revenue of approximately MSEK 390.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">CEO’s comments</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Another quarter in the right direction</strong></p><p class=\"\">We have now put yet another quarter behind us with increased profit, strengthened margins, improved profitability (P/WC) and a strong cash flow. EBITA increased by 10 percent to MSEK 121 (110), while the EBITA margin rose to 9.6 percent (9.3). Our efforts to improve profitability continued to have an effect. P/WC increased by 6 percentage points to 30 percent (24) and cash flow from operating activities increased to MSEK 214 (207) during the quarter.</p><p class=\"\">The Group’s positive performance is the result of the focus, commitment and hard work of our organisation in challenging business conditions. It is encouraging to see that Division Core Solutions and Division Industrial Equipment are continuing to increase their earnings and profit margins. Division Safety Technology delivered at roughly the same level as in the preceding year, but I expect that the division – as a first step – will return to its previous profit and margin levels.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenging market – stronger results</strong></p><p class=\"\">Although the economic climate remains weak for the majority of our companies, we increased the Group’s revenue by 6 percent during the quarter due to our acquisitions. Organic revenue decreased 5 percent, which reflects the developments in the construction and manufacturing sectors in the Nordic countries, with the number of employees decreasing during the autumn. Despite these challenges, our decentralised governance model and clear capital allocation demonstrate just how adaptable our companies are. For example, ESSVE increased its revenue due to three new major customer contracts in Sweden, and Cresto Group secured its first large order for rescue equipment from yet another global wind power manufacturer. Our efforts to optimise our product range and inventory resulted in an organic decrease of MSEK 172 in working capital during 2024, of which inventory accounted for MSEK 93. Moreover, Fastit divested its operations in Asia during the quarter, and I cannot rule out that further structural measures in the Group may be necessary.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Four new companies strengthen the Group</strong></p><p class=\"\">During the quarter, we welcomed four new companies to the Group: three Finnish and one Swedish, which together generate revenue of MSEK 310 with good profitability. In Finland, we acquired Levypinta, Ovesta and Labsense. Levypinta manufactures bespoke high-pressure laminate boards, primarily for manufacturers of special furniture used in schools and public properties in Finland and Sweden. Ovesta sells primarily customised fireproof and soundproof doors to construction and real estate companies for installation in public properties. Labsense is a distributor to several leading global suppliers of technical laboratory equipment sold to the public and private sectors in Finland. In Sweden, we acquired Collinder Märksystem, a leading company in safety and industrial signage. The company strengthens our position in the growing segment of safety and industrial signage, a niche where we are already present with companies in Sweden, Norway and Denmark.</p><p class=\"\">Our strong financial position has made it possible for us to achieve our acquisition goals, which has enabled us to maintain profit growth despite challenging market conditions. The new acquisitions supplement our existing portfolio, and we look forward to seeing the companies contribute the Group’s continued progress. I would also like to take this opportunity to warmly welcome all our new employees to the B&amp;B Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">We are building for the future</strong></p><p class=\"\">In my previous CEO comments, I mentioned that diamonds form under pressure. It does not appear that this pressure will ease in the near future, but these challenging times are driving our companies to continue to increase their efficiency, develop their customer and product mix, and improve their capital efficiency – thereby allowing the companies to grow stronger and position themselves for a stronger market. I am confident that our existing companies, in combination with acquisitions, will ensure that we continue to deliver positive earnings and improvements to profitability going forward. Our trend of increased profit over 20 consecutive quarters is proof that we are on the right path.</p><p class=\"\">Stockholm, February 2025</p><p class=\"\">Magnus Söderlind</p><p class=\"\">President &amp; CEO</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN19bw2l:0-bergman-beving-s-interim-report-1-april-31-december-2024/",
            "pub_date": "2025-02-05 14:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW07M:0",
            "title": "Yuan slips on trade-war anxiety; yen jumps",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Onshore yuan falls following return from extended break</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Yen rises on upbeat Japanese wage gain, rising bets of BOJ hike</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar on the back foot, giving respite to peers</li></ul></span></div><span><p class=\"\">    The yuan sank on Wednesday as a new Sino-U.S. trade war shook Chinese markets returning from an extended Lunar New Year break, while the yen jumped on rising bets of more Bank of Japan (BOJ) rate hikes this year.</p><p class=\"\">The dollar rose more than 0.5% against the yuan  to a high of 7.2863 in onshore trade, though its gains were capped by the People's Bank of China (PBOC) setting a stronger-than-expected yuan midpoint rate, around which the currency is allowed to trade in a 2% band.</p><p class=\"\">The fixing had been closely watched by investors for clues on whether Beijing would allow the currency to weaken to blunt the impact of sweeping new tariffs imposed by U.S. President Donald Trump.</p><p class=\"\">China on Tuesday slapped tariffs on U.S. imports in a swift response to the U.S. duties on Chinese goods, and Trump said the same day he is in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the world's two largest economies.</p><p class=\"\">\"Our base case is that China will increase its tolerance for currency weakness in response to the U.S. tariffs,\" said Carol Kong, a currency strategist at Commonwealth Bank of Australia (CBA).</p><p class=\"\">\"I think ultimately, allowing the yuan to weaken will be one of the responses China takes, and I would expect further retaliation from China if the U.S. retaliates with even more tariffs.\"</p><p class=\"\">The offshore yuan  was marginally stronger at 7.2835 per dollar on Wednesday, recovering from its fall to a record low of 7.3765 per dollar at the start of the week.</p><p class=\"\">During Trump's first term as president, the yuan was allowed to weaken more than 12% against the dollar during a series of tit-for-tat U.S-Sino tariff announcements between March 2018 and May 2020.</p><p class=\"\">The Australian dollar , often used as a more liquid proxy for the yuan, was a touch weaker at $0.62565, struggling to extend its 0.47% overnight gain. Its New Zealand counterpart  last fetched $0.5661.</p><p class=\"\">In the broader market, volatility in currencies eased a little after a turbulent start to the week following Trump's imposition of steep tariffs on top U.S. trading partners, with those on Mexico and Canada having since been delayed following negotiations.</p><p class=\"\">The dollar was on the back foot, giving some respite to heavily battered currencies like the euro , which bounced back above the $1.02 level and last bought $1.0385.</p><p class=\"\">The yen  was a notable mover in the Asian session as it rose roughly 0.8% to its highest in over a month at 153.09 per dollar.</p><p class=\"\">The impetus came from data that showed Japan's December inflation-adjusted real wages rose 0.6% year-on-year thanks to a wintertime bonus bump, with government officials expressing optimism that wage hike momentum is growing.</p><p class=\"\">That left traders ramping up bets of more BOJ rate hikes this year, with just over 30 basis points priced in by the year-end.</p><p class=\"\">\"The upcoming spring wage (negotiating) rounds will be closely watched, as expectations grow of more BOJ tightening,\" said Alvin Tan, head of Asia FX strategy at RBC Capital Markets.</p><p class=\"\">\"As we have seen for more than a year, BOJ tightening by itself is not adequate to drive the yen into an appreciation trend, but that along with the yen's under-valuation might be enough to cap yen weakness particularly in a more uncertain global macro environment.\"</p><p class=\"\">Elsewhere, the Canadian dollar  rebounded from Monday's 22-year low and last stood at C$1.4328.</p><p class=\"\">The Mexican peso  was steady at 20.4896 per dollar, moving away from a trough of 21.2882 hit on Monday, its weakest level in nearly three years.</p><p class=\"\">Sterling  ticked up 0.05% to $1.2487, while the dollar index  fell 0.22% to 107.81.</p><p class=\"\">\"I am actually quite surprised at the resilience of markets. Risk sentiment ... has been quite positive despite all the tariff headlines and the resumption of the U.S.-China trade war,\" said CBA's Kong.</p><p class=\"\">\"I think part of the optimism stems from the fact that the U.S. was willing to delay tariffs as long as the other countries gave Trump what he wanted.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW07M:0-yuan-slips-on-trade-war-anxiety-yen-jumps/",
            "pub_date": "2025-02-05 14:45:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr6whgGJ:0",
            "title": "Year-end report: \"Third consecutive quarter of organic growth, continued strong sales growth from the Consumer division\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>CTEK AB<p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>October - December 2024</em></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales amounted to SEK 279 million (240). Organically, net sales increased by 16%. Adjusted for the one-time buy from General Motors the organic growth was 5%.</li><li class=\"listItem-bmN0_SHH\">The gross margin was 49.8% (53.6). Adjusted for the one-time buy from General Motors the gross margin was 54.6%.</li><li class=\"listItem-bmN0_SHH\">Adjusted EBITA amounted to SEK 25 million (31), a margin of 9.1% (12.8). Adjusted for the one-time buy from General Motors the margin was 10,2%.</li><li class=\"listItem-bmN0_SHH\">The cash flow from operating activities amounted to SEK 59 million (75).</li></ul><p class=\"\">\" The fourth quarter of the year saw continued organic growth with a stable cash flow and a reduced net debt ratio. The Consumer division, which once again had a strong quarter, made a major contribution to this.\", says Henrik Fagrenius, President and CEO of CTEK.</p><p class=\"\">During the quarter, CTEK continued to follow its strategic plan towards profitable growth.</p><p class=\"\">\"With this year's improved margins, continued stable cash flow and the reduced net debt ratio, we are well on our way in our strategic plan towards the target of profitable growth. We will provide a more detailed presentation of what the final phase of the strategic plan means for the company during a capital market day, scheduled for May 22 in Stockholm.\", says Henrik Fagrenius, President and CEO of CTEK.</p><p class=\"\">Today, 5 February at 09:00 CET, CTEK will hold an audiocast in English. CTEK is represented by CEO Henrik Fagrenius and CFO Thom Mathisen, who present the year-end report and answer questions. For further information:  https://ctek.events.inderes.com/q4-report-2024</p><p class=\"\">Before its publication, this information was inside information and is such that CTEK AB is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out below, on 5 February 2025 at 07:45 CET.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information please contact:</strong></p><p class=\"\">Marcus Korsgren, SVP Strategy &amp; Communication</p><p class=\"\">+46 72 050 42 46, marcus.korsgren@ctek.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>About CTEK</em></strong></p><p class=\"\">Established in Dalarna Sweden, CTEK is the leading global brand in battery charging solutions, most specifically vehicle charging.</p><p class=\"\">CTEK offers products ranging from 12V &amp; 24V battery chargers to charging solutions for electrical vehicles.</p><p class=\"\">Products are sold via a carefully selected network of global distributors and retailers, as original equipment, supplied to more than 50 of the world's leading vehicle manufacturers and through charge point operators, property owners as well as other organizations and individuals providing EV charging infrastructure.</p><p class=\"\">CTEK takes pride in its unique culture based on a passion for innovation and a deep commitment to supporting the transition to a greener mobility, by adhering to industry-leading ESG standards.</p><p class=\"\">CTEK's share is listed on Nasdaq Stockholm Small Cap and is traded with the ticker CTEK.</p><p class=\"\">For more information, also visit www.ctekgroup.com</p><p class=\"\">https://news.cision.com/ctek-ab/r/year-end-report---third-consecutive-quarter-of-organic-growth--continued-strong-sales-growth-from-th%2Cc4100600</p><p class=\"\">CTEK AB Q4_2024_Eng</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr6whgGJ:0-year-end-report-third-consecutive-quarter-of-organic-growth-continued-strong-sales-growth-from-the-consumer-division/",
            "pub_date": "2025-02-05 14:45:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr2JXL4l:0",
            "title": "Year-end Report 1 January - 31 December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>AddLife<p class=\"\">AddLife finishes the year with high growth, improved margins, and strong cash flow</p><p class=\"\">\"AddLife finishes 2024 with a very strong fourth quarter. Organic growth was 9%, EBITA increased by 24%, and cash flow improved by 49%. The companies within AddLife performed very well, driven by positive demand development and dedicated, long-term efficiency efforts.\"</p><p class=\"\">Fredrik Dalborg, President and CEO</p><p class=\"\">AddLife´s year-end report for Q4 2024 is now available online at the company website. The year-end report can be downloaded in pdf version. Visit reports-en.add.life/year-end-report-q4-2024</p><p class=\"\">1 OCTOBER– 31 DECEMBER 2024 (3 MONTHS)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales increased by 11% to SEK 2,818m (2,544). The organic growth, excluding exchange rate changes, was 9% and the acquired growth was 1%.</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 24% to SEK 346m (278), corresponding to an EBITA-margin of 12.3% (10.9). The EBITA margin for the previous year was 10.2%, adjusted for reversed contingent considerations and one-off costs.</li><li class=\"listItem-bmN0_SHH\">Profit after tax amounted to SEK 94m (-41).</li><li class=\"listItem-bmN0_SHH\">Earnings per share amounted to SEK 0.76 (-0.34).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities amounted to SEK 666m (448).</li></ul><p class=\"\">1 JANUARY – 31 DECEMBER 2024 (12 MONTHS)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales increased by 6% to SEK 10,286m (9,685). The organic growth, excluding exchange rate changes, was 5%.</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 2% to SEK 1,159m (1,135), corresponding to an EBITA-margin of 11.3% (11.7). Adjusted for revalued contingent considerations and restructuring costs, EBITA amounted to SEK 1,165m (1,015). Excluding these, EBITA increased by 14% and the EBITA-margin amounted to 11.3% (10.5).</li><li class=\"listItem-bmN0_SHH\">Profit after tax amounted to SEK 254m (192).</li><li class=\"listItem-bmN0_SHH\">Earnings per share amounted to SEK 2.06 (1.56).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities amounted to SEK 1,095m (773).</li><li class=\"listItem-bmN0_SHH\">The equity ratio was 41% (39).</li><li class=\"listItem-bmN0_SHH\">Return on working capital (P/WC) amounted to 51% (50).</li><li class=\"listItem-bmN0_SHH\">During the financial year an acquisition, BonsaiLab SLU, was completed. The acquisition is estimated to contribute with an annual net sale of approximately SEK 90m.</li><li class=\"listItem-bmN0_SHH\">The board proposes a dividend of SEK 0.75 per share.</li></ul><p class=\"\">Stockholm, February 5, 2025</p><p class=\"\">AddLife AB (publ)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, contact;</strong></p><p class=\"\">Fredrik Dalborg, CEO, fredrik.dalborg@add.life, +46 70 516 09 01</p><p class=\"\">Christina Rubenhag, CFO, christina.rubenhag@add.life, +46 70 546 72 22</p><p class=\"\">www.add.life</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Video conference</strong></p><p class=\"\">Investors, analysts and the media are invited to a video conference at which CEO Fredrik Dalborg and CFO Christina Rubenhag will present the year-end report . The presentation will be given in English and take about 20 minutes. after which there will be an opportunity to ask questions. The meeting will be recorded and made available online.</p><p class=\"\">The video conference will be at 9 a.m. CET on February 5, 2025.</p><p class=\"\">If you wish to participate via video conference, please follow this link&gt;&gt;</p><p class=\"\">The presentation is also available on AddLife YouTube &gt;&gt;</p><p class=\"\">AddLife is an independent player in the Life Science industry that offers high-quality products, services and advice to both the private and public sectors, mainly in the Nordic region and rest of Europe. AddLife has about 2,300 employees in some 85 operating subsidiaries. The Group currently has net sales of more than SEK 10 billion. AddLife shares are listed on Nasdaq Stockholm.</p><p class=\"\">This information is information that AddLife AB (publ) is obliged to make public pursuant to the EU Market Abuse Regulation and the Securities Markets Act. The information was submitted for publication, through the agency of the contact person set out above, at February 5, 2025 at 07:45 a.m. CET.</p><p class=\"\">https://news.cision.com/addlife/r/year-end-report-1-january---31-december-2024%2Cc4100095</p><p class=\"\">Year-end Report Q4 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr2JXL4l:0-year-end-report-1-january-31-december-2024/",
            "pub_date": "2025-02-05 14:45:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463765:0",
            "title": "Dhanlaxmi Bank's Fiscal Q3 Net Profit Rises Surges Nearly 10-Fold",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dhanlaxmi Bank  witnessed a sharp gain in its net profit to 198.5 million Indian rupees in the fiscal third quarter from 30.5 million rupees a year ago. </p><p class=\"\">Diluted earnings per share during the quarter that ended Dec. 31, 2024, climbed to 0.78 rupees from 0.12 rupees a year earlier, according to a Tuesday filing with the Indian exchanges. </p><p class=\"\">Interest earned by the lender in fiscal Q3 increased year on year to 3.35 billion rupees from 3.08 billion rupees a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463765:0/",
            "pub_date": "2025-02-05 14:38:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463788:0",
            "title": "Valiant Posts Higher FY24 Consolidated Profit; Net Result Dips",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Valiant  said Wednesday that consolidated profit for full-year 2024 increased, while net result dropped year over year. </p><p class=\"\">Consolidated profit for the 12 months ended Dec. 31, 2024, was 150.4 million francs, compared with 144.3 million francs a year ago. </p><p class=\"\">The Swiss lender's net result from interest operations was 395.9 million francs, compared with 407.5 million francs a year ago. </p><p class=\"\">Meanwhile, the board proposed a dividend of 5.80 francs per share. It paid 5.50 francs a year ago. </p><p class=\"\">For 2025, the company is expecting consolidated profit to be slightly higher.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463788:0/",
            "pub_date": "2025-02-05 14:38:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000989:0",
            "title": "Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adria Calatayud</p><p class=\"\">Banco Santander plans to buy back 10 billion euros ($10.38 billion) of its own stock and reported fourth-quarter results that exceeded expectations both at the top and bottom lines.</p><p class=\"\">The Spanish bank said Wednesday that it expects to return 10 billion euros to shareholders through stock repurchases from its earnings this year and next on top of its dividend. It also raised a key 2025 profitability target but projected broadly stable revenue for the year.</p><p class=\"\">Net profit for the fourth quarter was 3.265 billion euros, up 11% on year, Santander said.</p><p class=\"\">Total income for the quarter rose 10% to 16.03 billion euros, mainly driven by higher net fee income. Net interest income--the difference between what a bank earns on loans and what it pays clients for deposits--came to 11.99 billion euros, up 6.8% on the prior quarter.</p><p class=\"\">Analysts had expected Santander to post a net profit of 2.95 billion euros on revenue of 15.39 billion euros, according to consensus estimates provided by Visible Alpha.</p><p class=\"\">For 2025, Santander expects revenue of about 62 billion euros, mid-high single digit growth in net fee income, lower costs and a return on tangible equity--a key profitability metric for banks--of more than 17%. It had previously targeted a 2025 return on tangible equity of 15% to 17%.</p><p class=\"\">Write to Adria Calatayud at adria.calatayud@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000989:0-santander-plans-10-4-billion-in-buybacks-after-results-beat-expectations/",
            "pub_date": "2025-02-05 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000884_20250205000991:0",
            "title": "Pandora to Launch New Share Buy-Back Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000884_20250205000991:0/",
            "pub_date": "2025-02-05 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}