{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSLLLMqa:0",
            "title": "Volcon, Inc. Announces Launch of Proposed Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">AUSTIN, TX / ACCESS Newswire / February 4, 2025 /</strong> Volcon, Inc.  (the \"Company\"), the first all-electric, off-road powersports company, today announced that it has commenced a public offering to offer and sell securities, including shares of common stock of the Company (\"Common Stock\") (or pre-funded warrants in lieu thereof) and warrants to purchase shares of Common Stock.</p><p class=\"\">All of the shares of Common Stock, pre-funded warrants and accompanying warrants are being offered by the Company (the \"Offering\").</p><p class=\"\">The Company intends to use the net proceeds from the Offering for general corporate and working capital needs. The Company's Common Stock is trading on the Nasdaq Capital Market under the symbol \"VLCN\". The Offering is subject to market conditions, and there can be no assurance as to whether or when the Offering may be completed, or as to the actual size or terms of the Offering.</p><p class=\"\">Aegis Capital Corp. is acting as the sole book-running manager for the offering on a firm commitment basis.</p><p class=\"\">The securities are being offered pursuant to an effective shelf registration statement on Form S-3 (No. 333-269644) previously filed with the U.S. Securities and Exchange Commission (SEC) and declared effective by the SEC on March 21, 2023. The offering will be made only by means of a prospectus, consisting of a prospectus supplement and an accompanying prospectus. A preliminary prospectus supplement and accompanying prospectus describing the terms of the proposed offering will be filed with the SEC and will be available on the SEC's website located at www.sec.gov. Electronic copies of the preliminary prospectus supplement and the accompanying prospectus may be obtained, when available, by contacting Aegis Capital Corp., Attention: Syndicate Department, 1345 Avenue of the Americas, 27th floor, New York, NY 10105, by email at syndicate@aegiscap.com, or by telephone at +1 (212) 813-1010.</p><p class=\"\">This press release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Volcon, Inc.</strong></p><p class=\"\">Based in the Austin, Texas area, Volcon was founded as the first all-electric power sports company producing high-quality and sustainable electric vehicles for the outdoor community. Volcon electric vehicles are the future of off-roading, not only because of their environmental benefits but also because of their near-silent operation, which allows for a more immersive outdoor experience.</p><p class=\"\">Volcon's vehicle roadmap includes both motorcycles and UTVs. Its first product, the innovative Grunt, began shipping to customers in late 2021 and combines a fat-tired physique with high-torque electric power and a near-silent drive train. The Volcon Grunt EVO, an evolution of the original Grunt with a belt drive, an improved suspension, and seat, began shipping to customers in October 2023. The Brat is Volcon's first foray into the wildly popular eBike market for both on-road and off-road riding and is currently being delivered to dealers across North America. In 2024, Volcon entered the rapidly expanding LUV and UTV market and shipped its first production MN1 unit in October 2024. The new MN1 and HF1 products empower the driver to explore the outdoors in a new and unique way that gas-powered units cannot. They offer the same thrilling performance of a standard LUV / UTV without the noise (or pollution), allowing the driver to explore the outdoors with all their senses.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">Some of the statements in this release are forward-looking statements, which involve risks and uncertainties. Forward-looking statements in this press release include, without limitation, the whether the Company will be successful in completing the proposed offering. Although the Company believes that the expectations reflected in such forward-looking statements are reasonable as of the date made, expectations may prove to have been materially different from the results expressed or implied by such forward-looking statements. The Company has attempted to identify forward-looking statements by terminology including ''believes,'' ''estimates,'' ''anticipates,'' ''expects,'' ''plans,'' ''projects,'' ''intends,'' ''potential,'' ''may,'' ''could,'' ''might,'' ''will,'' ''should,'' ''approximately'' or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. These statements are only predictions and involve known and unknown risks, uncertainties, and other factors. Any forward-looking statements contained in this release speak only as of its date. The Company undertakes no obligation to update any forward-looking statements contained in this release to reflect events or circumstances occurring after its date or to reflect the occurrence of unanticipated events. More detailed information about the risks and uncertainties affecting the Company is contained under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K and subsequently filed Quarterly Reports on Form 10-Q and Current Reports on Form 8-K filed with the SEC, which are available on the SEC's website, www.sec.gov.</p><p class=\"\">.</p><p class=\"\">Volcon Contacts</p><p class=\"\">For Media: media@volcon.com</p><p class=\"\">For Dealers: dealers@volcon.com</p><p class=\"\">For Investors: investors@volcon.com</p><p class=\"\">For Marketing: marketing@volcon.com</p><p class=\"\">For more information on Volcon or to learn more about its complete motorcycle and side-by-side line-up, visit: www.volcon.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Volcon ePowersports, Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSLLLMqa:0/",
            "pub_date": "2025-02-05 09:05:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309520:0",
            "title": "McEwen Mining Brief: Says Corrections Related Specifically to the percentage differences between 2021 and December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309520:0/",
            "pub_date": "2025-02-05 09:06:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309521:0",
            "title": "McEwen Mining Brief: In addition, the price of gold used in 2021 was US$1,725, not $1,750 (in the third paragraph)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309521:0/",
            "pub_date": "2025-02-05 09:06:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014078:0",
            "title": "Malaysian Shares Edge Higher; May Remain Rangebound — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Malaysia's benchmark Kuala Lumpur Composite Index is 0.1% higher at 1565.68. The local bourse may trade rangebound this week amid a lack of fresh catalysts and continued foreign fund outflows, Apex Securities says in a note. While global sentiment improved after the U.S. tariff pause for Mexico and Canada, volatility may remain high, keeping investors cautious, the brokerage reckons. Bargain hunting may support the construction sector, while hospital operators and REITs could attract defensive interest amid market uncertainty, it adds. Among gainers, YTL Corp. adds 1.1% and Tenaga Nasional is up 0.9%. Meanwhile, Telekom Malaysia and Sunway Bhd. are each 0.9% lower. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014078:0/",
            "pub_date": "2025-02-05 09:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014079:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">2007 ET - Malaysia's benchmark Kuala Lumpur Composite Index is 0.1% higher at 1565.68. The local bourse may trade rangebound this week amid a lack of fresh catalysts and continued foreign fund outflows, Apex Securities says in a note. While global sentiment improved after the U.S. tariff pause for Mexico and Canada, volatility may remain high, keeping investors cautious, the brokerage reckons. Bargain hunting may support the construction sector, while hospital operators and REITs could attract defensive interest amid market uncertainty, it adds. Among gainers, YTL Corp. adds 1.1% and Tenaga Nasional is up 0.9%. Meanwhile, Telekom Malaysia and Sunway Bhd. are each 0.9% lower. (yingxian.wong@wsj.com)</p><p class=\"\">1959 ET - Malaysian planters may post strong 4Q 2024 results, driven by higher upstream earnings from improved palm product prices, though downstream performance may remain weak, especially in refining, Hong Leong IB analyst Chye Wen Fei says in a note. Planters with greater upstream exposure in Indonesia should fare better due to better production, she reckons. Chye maintains her 2025-2026 CPO price assumptions at MYR4,000/ton and MYR3,800/ton, respectively, expecting elevated prices through 1Q amid weak output. Hong Leong maintains a neutral rating on Malaysian plantation sector as high CPO prices may not hold beyond 1Q. It has Johor Plantations, Hap Seng Plantations and IOI Corp. as its top picks. (yingxian.wong@wsj.com)</p><p class=\"\">1913 ET - Japanese stocks are higher in early trade as fears about U.S. tariffs subside for now. Electronics stocks are leading the gains. Renesas Electronics is up 3.4% and Hitachi Ltd. is 2.9% higher. USD/JPY is at 154.31, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are closely watching U.S. trade talks as well as domestic earnings. Toyota Motor is scheduled to report its quarterly results later in the day. The Nikkei Stock Average is up 0.7% at 39070.87. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1912 ET - Mondelez's CEO said the broader snacking category is not diminishing due to consumers' focus on health and wellness. There hasn't been any noticeable decrease in snacking consumption due to GLP-1 medications, either, Dirk Van de Put said. \"Since COVID, the indulgence part of snacking is growing just as fast as the healthy part,\" he said. The snack giant reported a profit of $1.75 billion for the fourth quarter, compared with $950 million a year earlier. (roshan.fernandez@wsj.com)</p><p class=\"\">1850 ET - Japanese stocks may rise as fears about U.S. tariffs subside for now. Nikkei futures are up 0.4% at 38975 on the SGX. USD/JPY is at 154.17, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are focusing on U.S. trade talks as well as domestic earnings. Toyota Motor is set to announce its quarterly results later in the day. The Nikkei Stock Average rose 0.7% to 38798.37 on Tuesday. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1845 ET - Mattel CEO Ynon Kreiz says on a call with analysts that the company expects Barbie's performance to improve in 2025. The famous doll posted declining gross billings--which measures sales to retailers before adjustments--throughout 2024. This was largely due to a comparison to 2023 figures, which were highly inflated due to the blockbuster \"Barbie\" movie, Kreiz says. This year, though, the doll will face easier year-over-year comparisons, he says. And the company plans to optimize demand creation, release new products and lean further into momentum with adult fans. Mattel shares rise 10% after the company guides for higher profit and revenue in 2025. (connor.hart@wsj.com)</p><p class=\"\">1832 ET - As reporting season gets underway, Citi identifies Australian real-estate investment trusts that could positively surprise with their results. It thinks Ingenia Communities's earnings guidance could beat consensus hopes on stronger sales. Analyst Howard Penny tips Goodman to update its data center pipeline, driving growth expectations. \"Stronger than consensus expected sales growth, and positive spreads could support growth\" for mall owner Scentre, Citi says. And turning to GPT, Citi expects its annual result to start \"setting a foundation for medium-term growth off a reasonable value.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1831 ET - Crop chemicals producer Nufarm's earnings likely aren't immune from tit-for-tat trade measures taken by the U.S. and China, contends Macquarie. The U.S. has imposed an additional 10% tariff on Chinese imports, prompting Beijing to respond. Macquarie highlights that 28% of Nufarm's earnings are from North America, and the company relies heavily on sourcing agricultural chemicals from China to sell into markets including the U.S. Nufarm's costs are likely to rise as the trade war unfolds. Still, Nufarm has some production in the U.S. and recently upgraded its manufacturing capacity in Australia so has \"some ability to self-source,\" says Macquarie. It retains a neutral call on Nufarm. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1828 ET - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1818 ET - Risks to Macquarie's balance sheet from its investments in renewable energy look manageable to Morgan Stanley. Analyst Andrei Stadnik estimates some A$2 billion of Macquarie's principal investments, or 18%, are in green energy. Still, only 10% of investments by Corio--Macquarie's unit focused on offshore wind-energy developments--are in the U.S. and exposed to policy shifts by the Trump administration. \"Elsewhere, we estimate Macquarie booked a A$50 million gain on sale of Formosa 2 offshore wind in Asia, so offshore wind transactions are continuing,\" Morgan Stanley says. \"Nonetheless, we have baked in a A$150 million 2H impairment charge for principal investments in renewables.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1814 ET - California increased its minimum wages for fast-food workers last year, prompting restaurants to increase prices and hurt their sales in the process. Chipotle Mexican Grill said sales in its restaurants and across the industry remain depressed in the state as a result. Chipotle said it's holding off additional price increases for now beyond a nationwide 2% increase taken in December. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">1724 ET - Brambles may disappoint some investors by deciding against upgrading its annual guidance at its first-half result announcement, according to its bull at UBS. Analyst Andre Fromyhr writes in a note that the stronger U.S. dollar makes Brambles' free cashflow guidance more challenging than when it was announced. Even so, he expects the global pallet giant to maintain guidance. Fromyhr reckons that Brambles needs to consistently deliver US$800 million annual free cashflow without strong price growth or dropping capex before the stock rerates further. UBS lifts its target price 18% to A$22.50 and keeps a buy rating on the stock, which is at A$19.26 ahead of the open. (stuart.condie@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014079:0/",
            "pub_date": "2025-02-05 09:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309522:0",
            "title": "McEwen Mining Brief: Adds recovery rate for 2021 was 85%, not 90%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309522:0/",
            "pub_date": "2025-02-05 09:07:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014081:0",
            "title": "Singapore Shares Edge Higher, Tracking Wall Street Gains — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's FTSE Straits Times Index edges 0.2% higher to 3829.30, tracking Wall Street gains. The main theme overnight was relief in the markets after Trump's decision to pause tariffs on Canada and Mexico for 30 days, and China's cautious response to the tariffs, the Commerzbank research team writes in a note. This helped support sentiment and eased market concerns about an all-out tit-for-tat trade war, Commerzbank adds. Wilmar International rises 1.9%, Singapore Exchange adds 1.3% and Hongkong Land gains 1.3%. Meanwhile, Genting Singapore falls 1.3%, Venture Corp. sheds 0.8% and Seatrium loses 0.5%. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014081:0/",
            "pub_date": "2025-02-05 09:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW01P:0",
            "title": "Japan wages up, PMI services up more, BOJ outlook correct",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Japan economic data this morning good, economy improving as per BOJ outlook</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Services especially strong, Jan PMI services 53.0, better than 52.7 flash</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Asia export demand strong, inbound tourism too, to remain on the up-and-up</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Composite PMI to 51.1 as result, best since September last year</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">December wage data good too, up as eyed by BOJ, more rises into April?</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Dec total cash earnings +4.8% y/y, real wages smaller +0.6%, overtime +1.3%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Jump in winter bonuses help, special payments +6.8% y/y</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Data suggests March BOJ Policy Board meeting could be \"live\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">See , , for more click on </p></li></ul><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:785.9778597785978px;aspect-ratio:1.3099630996309963\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01P-ea2c71447bcca0a0fe5732847301c44e-resized.webp\" type=\"images/webp\"/><img alt=\"The chart depicts the policy rate and core inflation numbers for Japan.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01P-ea2c71447bcca0a0fe5732847301c44e-resized.jpeg\" style=\"background-color:#faf7f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">BOJ hikes rates to 0.5%, highest since 2008</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:775.9562841530055px;aspect-ratio:1.2932604735883424\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01P-cc3e2c31e2318cc3d332899345992c84-resized.webp\" type=\"images/webp\"/><img alt=\"This chart depicts the core and core-core inflation levels in Tokyo across the time.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01P-cc3e2c31e2318cc3d332899345992c84-resized.jpeg\" style=\"background-color:#f8f8f7\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Core inflation in Japan's capital hits 1-year high</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:868.314606741573px;aspect-ratio:1.447191011235955\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01P-41595084924252fef97f4749544de3f3-resized.webp\" type=\"images/webp\"/><img alt=\"Japan's labour-intensive retail sector is among those suffering the worst labour shortages\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01P-41595084924252fef97f4749544de3f3-resized.jpeg\" style=\"background-color:#f5f2f2\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Japan's employment conditions</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW01P:0-japan-wages-up-pmi-services-up-more-boj-outlook-correct/",
            "pub_date": "2025-02-05 09:08:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW027:0",
            "title": "Gold hits record high as China-US tariff war drives safe-haven demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Gold prices touched an all time-high on Wednesday, underpinned by safe-haven demand after China responded to U.S. tariffs, which were initially imposed by President Donald Trump on the world's largest consumer of gold.     </p><p class=\"\">FUNDAMENTALS</p><p class=\"\">* Spot gold  was up 0.2% at $2,847.33 per ounce, as of 0044 GMT, after hitting a record high of $2,848.94 earlier in the session. U.S. gold futures  steadied at $2,876.10.</p><p class=\"\">* China swiftly hit back with tariffs on U.S. imports, intensifying the trade war between the world's two largest economies, even as Trump granted temporary reprieves to Mexico and Canada.</p><p class=\"\">* Trump said on Tuesday he sees no urgency in speaking with Chinese President Xi Jinping to ease a growing trade war, sparked by his sweeping 10% tariffs on all Chinese imports.</p><p class=\"\">* The market views the tariffs as inflationary, potentially boosting safe-haven demand for bullion, which is traditionally seen as a hedge against both rising prices and geopolitical turmoil.</p><p class=\"\">* Data showed U.S. job openings in December fell to 7.6 million, falling short of the consensus estimate of 8 million, indicating potential economic slowdown.</p><p class=\"\">* Key economic data on investors' radar this week includes the U.S. employment report on Friday and the ADP employment report, due later in the day, both of which are expected to offer crucial insights into the economy's overall strength.</p><p class=\"\">* San Francisco Fed President Mary Daly said that the Federal Reserve plans to take its time in evaluating its next interest rate move, carefully assessing incoming economic data and the effects of tariff, immigration, and other policy shifts under the Trump administration.</p><p class=\"\">* Spot silver  added 0.2% to $32.15 per ounce, platinum  edged 0.3% higher to $966.50, and palladium  was flat at $990.75. </p><p class=\"\">DATA/EVENTS (GMT)</p><p class=\"\">0030   Japan   JibunBK Comp Op Final SA, JibunBK SVC PMI Final SA   Jan</p><p class=\"\">0145   China   Caixin Services PMI   Jan</p><p class=\"\">0850   France   HCOB - Services PMI, HCOB Composite PMI   Jan</p><p class=\"\">0855   Germany   HCOB Services PMI, HCOB Composite Final PMI   Jan</p><p class=\"\">0900   EU   HCOB Services Final PMI, HCOB - Composite Final PMI   Jan</p><p class=\"\">0930   UK   S&amp;P GLOBAL PMI: COMPOSITE - OUTPUT   Jan</p><p class=\"\">1330   US   International Trade $   Dec</p><p class=\"\">1445   US   S&amp;P Global Comp Final PMI, S&amp;P Global Svcs PMI Final   Jan</p><p class=\"\">1500   US   ISM N-Mfg PMI   Jan</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW027:0-gold-hits-record-high-as-china-us-tariff-war-drives-safe-haven-demand/",
            "pub_date": "2025-02-05 09:09:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:ff1860752db47:0",
            "title": "Guidewire Software Executives Sell Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th>Reporter Name</th><th>Relationship</th><th>Type</th><th>Amount</th><th>SEC Filing</th></tr></thead><tbody><tr><td>Rosenbaum Michael George</td><td>Chief Executive Officer</td><td>Sell</td><td>$291,788</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1784996/000152839625000030/xslF345X05/wk-form4_1738717616.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr><tr><td>Mullen John P</td><td>President</td><td>Sell</td><td>$626,366</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1917389/000152839625000032/xslF345X05/wk-form4_1738717675.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Michael George Rosenbaum, CEO and Director of Guidewire Software, sold 1,400 shares of Common Stock on February 3, 2025, at a price of $208.42 per share, totaling $291,788. Following the transaction, Rosenbaum directly owns 276,130 shares of the company.</p><p class=\"\">John P Mullen, President of Guidewire Software, sold 3,000 shares of Common Stock on February 3, 2025, under a 10b5-1 Trading Plan. The sales were conducted at prices ranging from $208.42 to $210.00 per share, with a total amount of $626,366. Following these transactions, Mullen directly owns 174,746 shares of Guidewire Software.</p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:ff1860752db47:0-guidewire-software-executives-sell-shares/",
            "pub_date": "2025-02-05 09:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014066_20250204014066:0",
            "title": "FTSE Bursa Malaysia KLCI Index Opens 0.1% Higher at 1565.63",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014066_20250204014066:0/",
            "pub_date": "2025-02-05 09:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014067_20250204014067:0",
            "title": "FTSE Straits Times Index Opens 0.3% Higher at 3833.70",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014067_20250204014067:0/",
            "pub_date": "2025-02-05 09:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW040:0",
            "title": "Ichor Holdings Ltd reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ichor Holdings Ltd  reported quarterly adjusted earnings of 8 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of -6 cents.  The mean expectation of seven analysts for the quarter was for earnings of 9 cents per share. Wall Street expected results to range from 7 cents to 10 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 14.7% to $233.29 million from a year ago; analysts expected $232.75 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ichor Holdings Ltd's reported EPS for the quarter was a loss of 12 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported a quarterly loss of $3.94 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ichor Holdings Ltd shares had fallen by 16.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 67.8% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, seven analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the semiconductors peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Ichor Holdings Ltd is $40.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:00 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.09</p></td><td><p class=\"\">0.08</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.11</p></td><td><p class=\"\">0.12</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.03</p></td><td><p class=\"\">0.05</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.00</p></td><td><p class=\"\">-0.09</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW040:0-ichor-holdings-ltd-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:01:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW041:0",
            "title": "8x8 Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">8x8 Inc  reported quarterly adjusted earnings of 11 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 12 cents.  The mean expectation of ten analysts for the quarter was for earnings of 9 cents per share. Wall Street expected results to range from 8 cents to 10 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 1.2% to $178.88 million from a year ago; analysts expected $179.26 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">8x8 Inc's reported EPS for the quarter was 2 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $3.02 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">8x8 Inc shares had risen by 1.9% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 0.3% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 3 \"hold\" and 3 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the integrated telecommunications services peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for 8x8 Inc is $3.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:00 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.09</p></td><td><p class=\"\">0.11</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.08</p></td><td><p class=\"\">0.09</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.09</p></td><td><p class=\"\">0.08</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.06</p></td><td><p class=\"\">0.08</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW041:0-8x8-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:01:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW043:0",
            "title": "Juniper Networks Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Juniper Networks Inc  reported quarterly adjusted earnings of 64 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 61 cents.  The mean expectation of thirteen analysts for the quarter was for earnings of 58 cents per share. Wall Street expected results to range from 51 cents to 70 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 2.9% to $1.40 billion from a year ago; analysts expected $1.39 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Juniper Networks Inc's reported EPS for the quarter was 48 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $162 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Juniper Networks Inc shares had fallen by 7.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 3.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 11 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the communications &amp; networking peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Juniper Networks Inc is $40.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:00 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.58</p></td><td><p class=\"\">0.64</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.44</p></td><td><p class=\"\">0.48</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.44</p></td><td><p class=\"\">0.31</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.40</p></td><td><p class=\"\">0.29</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW043:0-juniper-networks-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:01:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OU17A:0",
            "title": "Young techies underpin Musk's drive to slash size of US government",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Elon Musk is relying on a coterie of young engineers with little government experience in his takeover of the U.S. Federal government infrastructure. Here are some details about three of them. A spokeswoman for the U.S. Office of Personnel Management (OPM) declined to comment. </p><p class=\"\">GAVIN KLIGER</p><p class=\"\">Gavin Kliger, who lists his job on Linkedin as “Special Advisor to the Director @ OPM”  since January, graduated from the University of California at Berkeley in 2020 with a degree in Electrical Engineering and Computer Science and boasting a 3.95 grade point average, according to the platform. </p><p class=\"\">Kliger, pictured donning a \"Make America Great Again\" hat on his profile page on social media platform X, was most recently a senior Software Engineer at San Francisco, California-based AI Startup Databrinks and served in a similar role at Twitter in 2019, his Linkedin Profile shows.</p><p class=\"\">His Substack features essays entitled “the Curious Case of Matt Gaetz: How the Deep State Destroys its Enemies” in which he describes Gaetz as “a congressman who was never charged with a crime... forced from office through the coordinated efforts of the intelligence community, the DOJ, establishment Republicans, and a media complex more interested in headlines than truth,\" a scenario that echoes Trump's own trevails, he claims.  </p><p class=\"\">Another essay, called “Pete Hegseth as Secretary of Defense: The Warrior Washington Fears,” argues the controversial appointee represents “a direct challenge to the entrenched power brokers who have spent decades turning the Pentagon into a revolving door for defense contractors and corporate lobbyists.”</p><p class=\"\">A third essay, titled \"Why DOGE\" with the subtitle \"Why I gave up a seven-figure salary to save America\" is available only to paid subscribers. </p><p class=\"\">Kliger did not respond to a request for comment, but reposted an Elon Musk post on X on Feb 3, saying \"Time to confess: Media reports saying that @DOGE has some of world’s best software engineers are in fact true.\"</p><p class=\"\">U.S. President Donald Trump appointed Musk head of the Department of Government Efficiency (DOGE) project.</p><p class=\"\">LUKE FARRITOR</p><p class=\"\">Luke Farritor is a former intern at SpaceX, Musk’s space company, where he worked 10 hour days writing software for the pumps, valves and other components that help fuel rockets, according to an article posted on the website of the University of Nebraska-Lincoln, where Farritor studied computer science. </p><p class=\"\">Farritor was part of an award-winning team that deciphered portions of an ancient Greek scroll, a Linkedin Post shows. He is also a Thiel Fellow, last year winning $100,000 and access to a network of tech founders, investors, scientists, and former fellows to focus on his Greek scroll project. </p><p class=\"\">According to the New York Times, Farritor, was among the workers given access to USAID systems. He is also listed as an “executive engineer” in the office of the secretary of health and human services, and had an email account at the General Services Administration (GSA), the paper reported. The GSA is a federal government agency that manages federal property and provides contracting services.</p><p class=\"\">Musk’s aides, including Farritor, have requested access to Centers for Medicare and Medicaid Services systems that control contracts and the more than $1 trillion in payments that go out annually, according to the Times.</p><p class=\"\">Farritor did not immediately respond to a request for comment.</p><p class=\"\">EDWARD CORISTINE</p><p class=\"\">According to Wired magazine, Edward Coristine appears to have recently graduated from high school and to have been enrolled at Northeastern University. He also spent three months at Neuralink, Musk’s brain-computer interface company, last summer, the magazine added. </p><p class=\"\">Coristine is listed in internal OPM records as an \"expert\" at OPM, Wired reported. </p><p class=\"\">A Connecticut registry of businesses shows that an Edward Coristine created three tech or computer-related firms that list as a principle place of business a New Canaan, Connecticut home, valued by Zillow at over $2.4 million. One of them, Tesla.Sexy LLC, dedicated to \"Professional, Scientific and Technological services,\" appears to still be in operation. </p><p class=\"\">Web-based platform Github, which allows developers to store, share and collaborate on code, shows an Eduard C as the only \"member\" of Diamond CDN — one of the now dissolved Connecticut-based companies founded by Coristine. The same Eduard C, who describes himself as a technologist who is \"passionate about improving humanity!\" has contributed to Neuralink's code base, according to the platform.</p><p class=\"\">Coristine did not immediately respond to requests for comment.     </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OU17A:0-young-techies-underpin-musk-s-drive-to-slash-size-of-us-government/",
            "pub_date": "2025-02-05 09:01:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463602:0",
            "title": "Aurumin Reports 33% Increase in Resource at Western Australia Gold Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aurumin  said its Plum Pudding deposit gold resource increased 33%, bringing the total to 18,700 ounces, after the firm completed drilling in December 2024, according to a Wednesday Australian bourse filing. </p><p class=\"\">The resource is part of its Sandstone Operations gold project in Western Australia. </p><p class=\"\">The company also conducted drilling at the Shillington deposit, focusing on resource extension and infill drilling within the current open pit. The results are being integrated into an updated mineral resource model, which is expected to be completed in the March quarter, per the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463602:0/",
            "pub_date": "2025-02-05 09:03:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446644:0",
            "title": "Japanese Yen Hits 7-week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">USDJPY decreased to a 7-week low of 153.71.</p><p class=\"\">Over the past 4 weeks, US Dollar Japanese Yen lost 2.43%, and in the last 12 months, it increased 3.96%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446644:0-japanese-yen-hits-7-week-high/",
            "pub_date": "2025-02-05 09:03:50",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309518:0",
            "title": "McEwen Mining Brief: Issuing Correction To \"Grey Fox Gold Resources Hit a Significant Milestone\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309518:0/",
            "pub_date": "2025-02-05 09:04:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204013364:0",
            "title": "Chipotle's sales have been 'volatile.' Can new menu items, kitchen upgrades and AI smooth things out?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Bill Peters</p><p class=\"\">Some analysts say tougher comparisons, harsher weather and holiday timing may have put pressure on the fast-casual chain's recent sales</p><p class=\"\">Shares of Chipotle Mexican Grill Inc. slid after hours on Tuesday, after the Mexican fast-casual restaurant chain forecast full-year same-store sales growth that disappointed Wall Street, following \"volatile\" sales trends so far this year.</p><p class=\"\">Chipotle (CMG) said it expects same-store sales for the year to increase in \"the low- to mid-single-digit range.\" Analysts polled by FactSet expected 5.4%.</p><p class=\"\">\"Comps have been volatile so far in 2025, with weather having a larger impact on our sales than what we experienced last year,\" Chief Financial Officer Adam Rymer said on Chipotle's earnings call, referring to comparable or same-store sales, which the company defines as restaurants that have been running for at least 13 months.</p><p class=\"\">\"While we believe underlying transaction trends are healthy and we have a strong plan for the year, we do compare against progressively tougher comps in the first half of the year and therefore are guiding to a low- to mid-single-digit comp for the full year,\" he said.</p><p class=\"\">Shares fell 5.4% after hours on Tuesday. The stock is up 18.6% over the past 12 months.</p><p class=\"\">Ahead of the results, analysts were focused on whether the chain could keep up same-store sales growth this year, following solid trends last year, as shoppers grappling with higher costs of living remain picky about dining out.</p><p class=\"\">Some analysts said tougher comparisons, harsher weather and holiday timing may have put pressure on Chipotle's recent sales. But while fast-food chains, after raising prices, have tried to win back consumers with value deals, some analysts say customers believe they can get a better meal at fast-casual chains for a price that's not much higher.</p><p class=\"\">Chipotle's management, during the call, said they were focused on opening more restaurants internationally, while outfitting its new restaurants with upgraded equipment - like rice cookers, faster-cooking grills and fryers that can fry more chips - that can help with faster, more consistent service. The company has a goal to open 7,000 restaurants in North America.</p><p class=\"\">Executives said they planned to launch a new limited-time menu offering around mid- to late March, and expressed excitement about menu items to come later in the year. And as businesses race to find more ways to use artificial intelligence, Chipotle said it was developing ways to deploy the technology to keep customers from drifting toward other options.</p><p class=\"\">\"When the model detects that a customer's behavior is changing in a particular way that would signal the propensity for churn, we will take them on a new journey with personalized extras and offers to encourage them to re-engage,\" Scott Boatwright, Chipotle's new chief executive, said on the call.</p><p class=\"\">\"I think those things are going to drive meaningful difference within the digital channel,\" he said.</p><p class=\"\">For the fourth quarter, Chipotle reported revenue of $2.845 billion, up 13.1% year over year, with same-store sales up 5.4%. The company reported adjusted earnings per share of 25 cents.</p><p class=\"\">Analysts polled by FactSet expected Chipotle to report adjusted earnings per share of 24 cents, on sales of $2.85 billion and a same-store sales gain of 5.7%.</p><p class=\"\">Chipotle executives, during the call on Tuesday, said items like its limited-time brisket offer were popular with diners, even though it was a difficult  item to procure. But they said that a multi-year absence from Chipotle's menu helped build up anticipation.</p><p class=\"\">\"I know I probably ate it once a week throughout the entire season,\" Boatwright said.</p><p class=\"\">-Bill Peters</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204013364:0/",
            "pub_date": "2025-02-05 09:05:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309519:0",
            "title": "McEwen Mining Brief: Cites Minor Corrections to Yesterday's press release; Notes resource statements remain unchanged",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309519:0/",
            "pub_date": "2025-02-05 09:05:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014051_20250204014051:0",
            "title": "Ibiden Shares Fall 15% After 9-Month Net Profit Dropped 9.5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014051_20250204014051:0/",
            "pub_date": "2025-02-05 08:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW03I:0",
            "title": "Zurn Elkay Water Solutions Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Zurn Elkay Water Solutions Corp  reported quarterly adjusted earnings of 32 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 26 cents.  The mean expectation of seven analysts for the quarter was for earnings of 28 cents per share. Wall Street expected results to range from 27 cents to 29 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 3.9% to $370.70 million from a year ago; analysts expected $366.40 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Zurn Elkay Water Solutions Corp's reported EPS for the quarter was 21 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $36.4 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Zurn Elkay Water Solutions Corp shares had risen by 4.9% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" 5 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the construction supplies &amp; fixtures peer group is  \"hold.\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Zurn Elkay Water Solutions Corp is $39.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 12:55 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.28</p></td><td><p class=\"\">0.32</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.32</p></td><td><p class=\"\">0.34</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.31</p></td><td><p class=\"\">0.33</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.26</p></td><td><p class=\"\">0.29</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW03I:0-zurn-elkay-water-solutions-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 08:56:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX8DRg7J:0",
            "title": "Fraser Valley’s decade-high inventory could open doors for buyers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SURREY, British Columbia, Feb.  04, 2025  (GLOBE NEWSWIRE) — Growing inventory and stable prices could lead to opportunities for buyers in the Fraser Valley market this winter despite uncertain economic conditions.</p><p class=\"\">Newly listed homes jumped 167 per cent from December to January, with 3,432 listed on the Fraser Valley Real Estate Board’s Multiple Listing Service® (MLS®). At 7,251 active listings, inventory is at a 10-year seasonal high, 54 per cent above the 10-year average.</p><p class=\"\">While sales remained slow in January, with 818 properties sold (down 18% from December), the combination of stable prices and abundant selection presents potential opportunities for buyers to get back into the market.</p><p class=\"\">The sales-to-active listings ratio appears to bear this out. At 11 per cent, the overall ratio is signaling a buyer’s market, with detached homes firmly in buyer’s market territory. The market is considered to be balanced when the ratio is between 12 per cent and 20 per cent.</p><p class=\"\">It took longer to sell homes in January compared to December. Across the Fraser Valley, the average number of days to sell a single-family detached home was 52, while for a condo it was 42. Townhomes took, on average, 38 days to sell.</p><p class=\"\">“The market appears to be in a holding pattern at the moment,” said Baldev Gill, CEO of the Fraser Valley Real Estate Board. “There is no doubt that economic uncertainty is playing a role, especially the spectre of a trade war, which could lead to even more rate cuts by the Bank of Canada. The confluence of these conditions could provide unique buying opportunities, but we urge buyers and sellers to work with a REALTOR® to ensure they align with financial objectives.”</p><p class=\"\">Benchmark prices in the Fraser Valley held relatively steady in January, with the composite Benchmark price down 0.03 per cent to $964,800.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">MLS® HPI Benchmark Price Activity</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Single Family Detached:</strong> At $1,482,400, the Benchmark price for an FVREB <em>single-family detached</em> home increased 0.1 per cent compared to December 2024 and increased 0.6 per cent compared to January 2024.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Townhomes:</strong> At $826,000, the Benchmark price for an FVREB <em>townhome</em> decreased 0.2 per cent compared to December 2024 and decreased 0.2 per cent compared to January 2024.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Apartments:</strong> At $534,600, the Benchmark price for an FVREB <em>apartment/condo </em>increased 0.1 per cent compared to December 2024 and decreased 1.2 per cent compared to January 2024.</li></ul><p class=\"\">*The Fraser Valley Real Estate Board is an association of 5,214 real estate professionals who live and work in the BC communities of Abbotsford, Langley, Mission, North Delta, Surrey, and White Rock. </p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/08443b4b-be0c-421b-9fb2-ceba689baaee                                                          </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Contact</td><td> </td></tr><tr><td>Nikki Hewitt, Senior Communications Specialist </td><td>nikki.hewitt@fvreb.bc.ca</td></tr><tr><td>Fraser Valley Real Estate Board</td><td>Telephone: 604.930.7654</td></tr><tr><td> </td><td>www.fvreb.bc.ca</td></tr><tr><td> </td><td>FVREB Stats</td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fraser Valley’s decade-high inventory could open doors for buyers</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Growing inventory and stable prices could lead to opportunities for buyers in the Fraser Valley market this winter despite uncertain economic conditions.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX8DRg7J:0-fraser-valley-s-decade-high-inventory-could-open-doors-for-buyers/",
            "pub_date": "2025-02-05 08:56:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW03O:0",
            "title": "Australia's Tlou Energy gains on agreement with data center developer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Tlou Energy  rise 7.7% to A$0.014</p><p class=\"\">** Stock set for its best session since late Dec. 2024, if gains hold</p><p class=\"\">** The developer of energy solutions signs non-binding heads of agreement with a data center developer for developing high-density computational facility at its Lesedi Gas-to-Power project site in Botswana</p><p class=\"\">** Lesedi is co's most advanced project</p><p class=\"\">** About 1.5 mln shares change hands, 3 times the 30-day average of shares</p><p class=\"\">** Stock down 18.8% this year as of last close</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW03O:0-australia-s-tlou-energy-gains-on-agreement-with-data-center-developer/",
            "pub_date": "2025-02-05 08:56:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014054:0",
            "title": "Asean Likely at Lower US Tariff Risk Than Mexico, China — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">U.S.-China trade tensions have some investors concerned about potentially higher tariffs on Asean. While that can't be ruled out, Citi Research analysts led by Eric Lau think tariffs are unlikely to be on par with those levied at Mexico or China as Asean is an attractive region to help dilute CPI inflation for U.S. imported goods. Many major China exporters have diversified production into Asean to avoid tariffs but focus on labor-intensive, non-tech industries such as apparel and footwear that aren't targeted for reshoring into the U.S., they say. Mexico meanwhile has attracted automotive supply-chain industries as the U.S. government seems inclined to emphasize auto manufacturing reshoring, they add. \"The tariff hike scenario in Mexico may not necessarily apply to Asean, in our view.\"(fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014054:0/",
            "pub_date": "2025-02-05 08:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014059:0",
            "title": "Tariffs Could Spur Industrial Consolidation in China — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Trump's 10% tariff hike on China will likely cause faster industry consolidation among its industrial companies, Citi Research analysts led by Eric Lau say. While major exporters like Techtronic and Shenzhou have diversified production into Asean to avoid tariffs, smaller Chinese companies are unable to do so given difficulty in obtaining bank loans and lack of management resources, they say in a note. The tariff hike could cause them significant distress and spike the unemployment rate in China as these firms constitute about 79% of the total workforce, they add. That could lead China to roll out more stimulus to counter the economic impact. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014059:0/",
            "pub_date": "2025-02-05 08:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014056:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1957 ET - U.S.-China trade tensions have some investors concerned about potentially higher tariffs on Asean. While that can't be ruled out, Citi Research analysts led by Eric Lau think tariffs are unlikely to be on par with those levied at Mexico or China as Asean is an attractive region to help dilute CPI inflation for U.S. imported goods. Many major China exporters have diversified production into Asean to avoid tariffs but focus on labor-intensive, non-tech industries such as apparel and footwear that aren't targeted for reshoring into the U.S., they say. Mexico meanwhile has attracted automotive supply-chain industries as the U.S. government seems inclined to emphasize auto manufacturing reshoring, they add. \"The tariff hike scenario in Mexico may not necessarily apply to Asean, in our view.\"(fabiana.negrinochoa@wsj.com)</p><p class=\"\">1937 ET - South Korea's benchmark Kospi rises 0.9% to 2503.94 in early trade, as battery, semiconductor and auto stocks advance. Foreign and retail investors are net buyers amid easing fears over U.S. tariffs. Battery makers LG Energy Solution and Samsung SDI rise 2.0% and 2.9%, respectively, recovering from recent losses. Memory-chip maker SK Hynix gains 2.6%. Carmaker Kia is up 1.1%. Meanwhile, LG CNS, an IT service affiliate of LG Group, is down 2.9% on its stock exchange debut. USD/KRW is 0.5% lower at 1,454.90, compared with the prior session's Seoul onshore trading close. South Korea's 10-year government bond yield is up 0.9 bp at 2.844%. (kwanwoo.jun@wsj.com)</p><p class=\"\">1930 ET - The economy remains on solid footing but its health is uneven across sectors, Fed Vice Chair Philip Jefferson said Tuesday. In a lecture at Pennsylvania's Lafayette College, Jefferson notes strength in household spending, retail sales and activity in the services sector. \"The consumer spending data we have received recently have surprised me to the upside,\" Jefferson said, per his published remarks. On the other hand, some sectors have been notably weak. Residential investment has been flattish over the past three quarters, he notes, and production from the domestic manufacturing sector was about flat last year too. \"Much of the equipment investment that did take place came from imports,\" Jefferson says. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1913 ET - Japanese stocks are higher in early trade as fears about U.S. tariffs subside for now. Electronics stocks are leading the gains. Renesas Electronics is up 3.4% and Hitachi Ltd. is 2.9% higher. USD/JPY is at 154.31, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are closely watching U.S. trade talks as well as domestic earnings. Toyota Motor is scheduled to report its quarterly results later in the day. The Nikkei Stock Average is up 0.7% at 39070.87. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1850 ET - Japanese stocks may rise as fears about U.S. tariffs subside for now. Nikkei futures are up 0.4% at 38975 on the SGX. USD/JPY is at 154.17, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are focusing on U.S. trade talks as well as domestic earnings. Toyota Motor is set to announce its quarterly results later in the day. The Nikkei Stock Average rose 0.7% to 38798.37 on Tuesday. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1825 ET - BlackRock, the world's largest asset manager, last year announced a series of acquisitions of private market-focused firms that \"lay a foundation for an increased integration of public and private\" assets, Apollo's CEO Marc Rowan says during an earnings call. \"I continue to believe this convergence of public and private will be a very important source of demand for private assets,\" Rowan says. BlackRock last year acquired infrastructure-focused Global Infrastructure Partners and agreed to buy credit specialist HPS Investment Partners as well as Preqin, a provider of private-market research. \"We envision that traditional asset managers will evolve their businesses to include products that are public and private,\" Rowan adds. \"Our industry and our firm will be a supplier of products to [them].\" (luis.garcia@wsj.com; @lhvgarcia)</p><p class=\"\">1551 ET - Treasury yields lose steam as the trade war cools down a little and both factory orders and job openings in the U.S. fall. Economists surveyed by The Wall Street Journal expect the ADP private-sector jobs report tomorrow to show an increase to 150,000 from December's 122,000, while December trade deficit is forecast to widen to $96.8 billion from $78.19 billion. Jobless claims on Thursday are expected to accelerate and Friday's payrolls increases are expected to slow. Analysts show increasing concerns over stickier inflation and weaker growth potentially resulting from trade wars. The 10-year yield loses 0.031 percentage point to 4.511% and the two-year falls 0.051 p.p. to 4.213%. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1443 ET - The news in the Job Openings and Labor Turnover Survey wasn't stellar, but it probably won't be enough to get the Fed leaning toward an interest-rate cut in March, economists at Barclays writes in a note. Hiring and job-quit rates both fell throughout 2024, but leveled off somewhat in the final few months of the year. For now, there is \"little in today's data to alter the course of Fed policy,\" the Barclays team says. But they add that with a lower ratio of job openings to unemployed workers, it's becoming more likely that any further decline in labor demand would push up the unemployment rate in the months ahead. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1439 ET - Worker remittances to Mexico rose 2.3% in 2024 to a record $64.75 billion, while showing signs of a slowdown, according to data released by the Bank of Mexico. Remittances in December fell 4.9% from the year-earlier month to $5.23 billion. The outlook is patchy for 2025, even without considering possible impact of an anti-immigrant policy under the Trump administration, BBVA's Juan José Li Ng says in a note. BBVA's base case is that remittances will grow 3% this year, \"but with a downward bias given signs of less absorption of Mexican labor in the U.S. over the past year,\" he says. (anthony.harrup@wsj.com)</p><p class=\"\">1434 ET - New research by economists at the St. Louis Fed suggest that wages become more flexible during times of elevated inflation. Studying data over the pandemic and postpandemic period, Maximiliano Dvorkin and Cassie Marks find that during the stretch of high inflation and low unemployment during 2022, wage increases became more likely and larger in scale. Then, they cooled again as the labor market started to normalize in 2023. In 2022, for example, they find that workers had a 55% probability of a positive wage increase, up from 43% in the years before the pandemic. Wage increases fell in likelihood to 53% in 2023, they find. Economists closely study the interconnection between inflation and wages in part to better understand how likely inflation is to become self perpetuating. (matt.grossman@wsj.com, @mattgrossman)</p><p class=\"\">1352 ET - Economists polled in January by the Bank of Mexico lowered their economic growth estimate for this year to 1% from 1.1% in December, while inflation expectations were virtually unchanged at 3.83% and 3.74% for core CPI. GDP slowed to 1.5% in 2024 from 3.3% the previous year, according to statistics institute Inegi. While public security remained the top perceived obstacle to growth, the percentage of analysts citing foreign trade policy rose to 13% from 7% in the previous survey. On Monday, Mexico reached agreement with President Trump to hold off imposing 25% tariffs on Mexican goods for a month while Mexico takes action to curb migration and fentanyl trafficking. (anthony.harrup@wsj.com)</p><p class=\"\">1313 ET - A few days after its quarterly launch, the Atlanta Fed's real-time estimate of 1Q GDP shows the U.S. economy growing at a 3.9% annualized pace over the three months through March. That would be a sharp step up from the 2.3% annualized rate recorded in 4Q 2024 and is well above most Wall Street analysts' forecasts. The model hasn't ingested much 1Q data yet, but recent construction-spending data and ISM manufacturing indexes have pushed the forecast in a positive direction. The first official estimates of 1Q GDP from the Commerce Department are expected to land in late April. (matt.grossman@wsj.com, @mattgrossman)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014056:0/",
            "pub_date": "2025-02-05 08:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014063:0",
            "title": "Malaysian Planters Likely to Post Strong 4Q Earnings — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Malaysian planters may post strong 4Q 2024 results, driven by higher upstream earnings from improved palm product prices, though downstream performance may remain weak, especially in refining, Hong Leong IB analyst Chye Wen Fei says in a note. Planters with greater upstream exposure in Indonesia should fare better due to better production, she reckons. Chye maintains her 2025-2026 CPO price assumptions at MYR4,000/ton and MYR3,800/ton, respectively, expecting elevated prices through 1Q amid weak output. Hong Leong maintains a neutral rating on Malaysian plantation sector as high CPO prices may not hold beyond 1Q. It has Johor Plantations, Hap Seng Plantations and IOI Corp. as its top picks. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014063:0/",
            "pub_date": "2025-02-05 08:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW03V:0",
            "title": "Modine Manufacturing Co reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Modine Manufacturing Co  reported quarterly adjusted earnings of 92 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 74 cents.  The mean expectation of six analysts for the quarter was for earnings of 79 cents per share. Wall Street expected results to range from 74 cents to 84 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 9.9% to $616.80 million from a year ago; analysts expected $615.02 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Modine Manufacturing Co's reported EPS for the quarter was 76 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $41 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Modine Manufacturing Co shares had fallen by 16.8% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 6 \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the auto, truck &amp; motorcycle parts peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Modine Manufacturing Co is $147.50 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 12:58 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.79</p></td><td><p class=\"\">0.92</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.92</p></td><td><p class=\"\">0.97</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.87</p></td><td><p class=\"\">1.04</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.76</p></td><td><p class=\"\">0.77</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW03V:0-modine-manufacturing-co-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 08:59:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}