{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM14K:0",
            "title": "US bonds advance on safe-haven buying fueled by Iran, AI fears",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US-Iran talks in focus as war fears rise</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US initial jobless claims rise but better than expected</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US seven-year note sale roughly in line with market forecasts</span></li></ul></span></div><span><p class=\"\"><span>By Gertrude Chavez-Dreyfuss</span></p><p class=\"\"><span>    U.S. Treasury prices climbed on Thursday as investors rushed for safety, rattled by mounting tensions between the U.S. and Iran and, more broadly, by the potential economic fallout from the rise of artificial intelligence.</span></p><p class=\"\"><span>Software stocks have been hammered in recent weeks on fears that AI could blow up established business models. Investors also worry that AI could wipe out millions of computer‑based jobs, squeeze consumer spending, and even tip the global economy into a deflationary slide.</span></p><p class=\"\"><span>The benchmark 10-year yield, which moves inversely to prices, fell to a three-month low, while 30-year yields slid to a more than one-week trough.</span></p><p class=\"\"><span>\"We're hearing more about the potential negative impact from AI on certain industries and what that could be going forward,\" said Kevin Flanagan, head of fixed income strategy at WisdomTree.</span></p><p class=\"\"><span>        \"The conversations I've had with clients involve people asking if there is a way we can mitigate risks to some of the industries that could have unintended consequences from AI. That seems to be a narrative in the market right now.\"</span></p><p class=\"\"><span>        In the very near term, Iran is also a nagging concern for bond investors.</span></p><p class=\"\"><span>        Iran and the United States held indirect talks in Geneva on Thursday to avert a conflict over their long-running nuclear dispute. Oman, which acted as mediator during the meeting, said  both parties made significant progress, after U.S. President Donald Trump had recently ordered a huge military build-up in the region.</span></p><p class=\"\"><span>Iran, which has said its nuclear program is peaceful, agreed in principle to accept curbs to its nuclear activities in return for the lifting of sanctions but rejects tying the talks to other issues.</span></p><p class=\"\"><span>\"There's some fear of what's going on with Iran,\" said Stan Shipley, fixed income strategist at Evercore ISI in New York. \"The question is: Are we going to war with Iran? So there's some flight to safety here.\"</span></p><p class=\"\"><span>In afternoon trading, the benchmark 10-year yield fell 3.2 basis points (bps) to 4.016% </span><span>, after hitting its lowest since late November at 4.014%.</span></p><p class=\"\"><span>         \"The macro environment is not supportive of a 10-year yield at 4% or below,\" said WisdomTree's Flanagan. \"Some of the macro data have been good and the Fed minutes a week ago showed a Fed that is either at or near the end of this rate cycle.\"</span></p><p class=\"\"><span>U.S. 30-year yields also slid, touching a more than one-week low, and were last down 2.8 bps at 4.666% (US30YT=RR).</span></p><p class=\"\"><span>On the front end of the curve, the two-year yield, which reflects rate expectations, declined 2.7 bps to 3.444% (US2YT=RR).</span></p><p class=\"\"><span>        AUCTION ROUGHLY IN LINE WITH FORECAST    </span></p><p class=\"\"><span>The U.S. Treasury on Thursday sold $44 billion in seven-year notes and the result was roughly in line with expectations. The auction cleared at 3.790%, more or less matching the expected rate at the bid deadline.</span></p><p class=\"\"><span>The bid-to-cover ratio, a demand metric, was 2.50X, marginally higher than the six-auction average of 2.46X.</span></p><p class=\"\"><span>Post-auction, U.S. seven-year yields sank 4 bps to 3.772% (US7YT=RR). Since the January auction, seven-year yields have declined by roughly more than 20 bps and are now trading near six-month lows. </span></p><p class=\"\"><span>        In other parts of the bond market, the yield curve was slightly flatter on the day, with the gap between two-year and 10-year yields slipping to 56 bps (US2US10=TWEB) from 57.9 bps late on Wednesday. It was last at 57 bps.</span></p><p class=\"\"><span>The curve has flattened in 11 of the last 12 sessions as short‑term yields climbed relative to long-term Treasuries. The 2/10 gap had narrowed for 10 consecutive sessions at one stage, marking its longest tightening run since November 2015.</span></p><p class=\"\"><span>Analysts attributed the flattening to expectations of fewer rate cuts following a January nonfarm payrolls report that showed an unexpected increase in new jobs.</span></p><p class=\"\"><span>Bond investors continued to factor in a more gradual pace of easing from the Federal Reserve in 2026, given a recent batch of data showing a steadier economy that will likely avoid recession this year and next.</span></p><p class=\"\"><span>Thursday's economic data supported that view. Initial claims for state unemployment benefits rose 4,000 to a seasonally adjusted 212,000 for the week ended February 21, data showed. Economists polled by Reuters had forecast 215,000 claims.</span></p><p class=\"\"><span>U.S. fed funds futures on Thursday priced in about 55 bps of easing this year, equivalent to about two rate cuts of 25 bps each, a scenario that has been in place since the start of the year. The first rate cut is not expected until July or September.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM14K:0-us-bonds-advance-on-safe-haven-buying-fueled-by-iran-ai-fears/",
            "pub_date": "2026-02-27 05:34:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939574:0",
            "title": "TTEC: 2025 saw a $2.14B revenue, $192.5M net loss, and a $205.4M goodwill impairment in TTEC Digital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue declined 3.4% to $2.14 billion in 2025, with a net loss of $192.5 million, mainly due to a $205.4 million goodwill impairment in TTEC Digital. Free cash flow rebounded to $83 million, and the company remains focused on debt reduction and adapting to rapid AI adoption.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939574-df95c88f01a9930d9ae48dbe1b82f2b5\" target=\"_blank\">TTEC Holdings, Inc. [TTEC] SEC 10-K Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939574:0-ttec-2025-saw-a-2-14b-revenue-192-5m-net-loss-and-a-205-4m-goodwill-impairment-in-ttec-digital/",
            "pub_date": "2026-02-27 05:34:15",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2939575:0",
            "title": "ANA: FY 2025 delivered record profit growth, strong asset rotation, and robust 2026 outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record FY 2025 results with EBITDA up 31% and net profit up 90% YoY, driven by strong Energy, Infrastructure, and Nordex performance. Asset rotation exceeded targets, leverage improved, and 2026 guidance points to continued growth and disciplined capital allocation.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2939575-2b974e47aa0b349a4c971c131edeef4d\" target=\"_blank\">Acciona SA [ANA] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2939575:0-ana-fy-2025-delivered-record-profit-growth-strong-asset-rotation-and-robust-2026-outlook/",
            "pub_date": "2026-02-27 05:34:57",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226017239:0",
            "title": "Weyerhaeuser Files 8K - Regulation FD >WY",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Weyerhaeuser Co. (WY) filed a Form 8K - Regulation FD Disclosure - with the U.S Securities and Exchange Commission on February 26, 2026.</span></p><p class=\"\"><span>On February 26, 2026, Weyerhaeuser Company is posting presentation materials to the Investors section of its website that it expects to use in discussions with the investment community. A copy of the presentation materials is furnished as Exhibit 99.1 to this report.</span></p><p class=\"\"><span>In accordance with General Instruction B.2 of Form 8-K, the information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed to be \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liability of that section, and shall not be incorporated by reference into any registration statement or other document filed under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.</span></p><p class=\"\"><span>The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/106535/000119312526076924/wy-20260226.htm</span></p><p class=\"\"><span>Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/106535/000119312526076924/0001193125-26-076924-index.htm</span></p><p class=\"\"><span>Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226017239:0/",
            "pub_date": "2026-02-27 05:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226017273:0",
            "title": "Top News Today/Canada: TD Bank Rises, RBC Falls After Earnings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>HEADLINES</span></p><p class=\"\"><span>Royal Bank of Canada Earnings Lifted by Personal Banking, Markets Growth</span></p><p class=\"\"><span>Royal Bank of Canada's earnings rose in the first quarter as the lender saw growth in its retail banking business and capital markets operations.</span></p><p class=\"\"><span>The bank, the country's biggest by market value and one of the largest in North America by assets, joined its peers in Canada in turning in a stronger-than-expected profit with gains across most business segments. This came despite elevated loan-loss provisions and continued economic uncertainty with trade tensions still high globally.</span></p><p class=\"\"><span>Royal Bank of Canada's net income rose to C$5.79 billion, or C$4.03 a share, for the three months to Jan. 31, from C$5.13 billion, or C$3.54, a year earlier. Excluding certain items, adjusted per-share earnings rose to C$4.08 in the first quarter, topping the C$3.85 expected by analysts polled by FactSet.</span></p><p class=\"\"><span>Shares in Toronto ended Thursday's session down 2.1% at C$232.14.</span></p><p class=\"\"><span>TD Bank Quarterly Earnings Lifted by Growth Across Operations</span></p><p class=\"\"><span>Toronto-Dominion Bank's earnings jumped in the first three months of its fiscal year as the big Canadian lender saw revenue growth across its operations, including record revenue in Canada on the back of a rise in loan and deposit volumes and strength in its wealth-management and markets-facing segments.</span></p><p class=\"\"><span>Net income climbed to C$4.04 billion, or C$2.34 a share, from C$2.79 billion, or C$1.55, a year earlier.</span></p><p class=\"\"><span>Stripping out items that the bank doesn't believe reflect the underlying performance of its business, such as restructuring costs, first-quarter per-share earnings came in at C$2.44, well above the C$2.26 mean estimate of analysts polled by FactSet.</span></p><p class=\"\"><span>TD Bank's Toronto-listed shares rose 1.6% to C$135.14.</span></p><p class=\"\"><span>CIBC Quarterly Profit Boosted by Revenue Growth Across Business Segments</span></p><p class=\"\"><span>Canadian Imperial Bank of Commerce notched a jump in first-quarter earnings on the back of record revenue across each of its business units and a strengthened return on equity.</span></p><p class=\"\"><span>CIBC, one of the country's largest lenders, recorded net income of C$3.10 billion, or C$3.21 a share, for the three months ended Jan. 31, against C$2.17 billion, or C$2.19, a year earlier. On an adjusted basis, per-share earnings came in at C$2.76, above the C$2.40 mean estimate of analysts polled by FactSet.</span></p><p class=\"\"><span>Total revenue climbed 15% to C$8.4 billion, beating the C$7.7 billion analysts anticipated.</span></p><p class=\"\"><span>CIBC shares in Toronto rose 2.9% to C$141.84.</span></p><p class=\"\"><span>Gildan Activewear Sees Stronger Savings from HanesBrands Integration</span></p><p class=\"\"><span>Gildan Activewear expects to unlock more cost savings tied to its recent acquisition of HanesBrands and also plans to sell its Hanes Australia business, steps that come just a few months after completing the combination of the two apparel companies.</span></p><p class=\"\"><span>The Canadian apparel manufacturer now expects to save up to $250 million through 2028, up from its previous target of $200 million, citing scale benefits, manufacturing efficiencies and reduced complexity. Chief Executive Glenn Chamandy said there could still be more savings to be found.</span></p><p class=\"\"><span>\"After one year of acquiring the company, doubling the scale and being in such a good financial position with all these synergies, it's all going in the right direction,\" Chamandy said.</span></p><p class=\"\"><span>Gildan Activewear CEO Says Tariff Rollback Gives Company Another Competitive Edge</span></p><p class=\"\"><span>Restaurant Brands International Backs 2028 Outlook, Sets Shareholder Return Targets</span></p><p class=\"\"><span>Restaurant Brands International backed its growth targets for the next two years, saying it remains on track to expand its global restaurant network and will return $1.6 billion to shareholders in 2026.</span></p><p class=\"\"><span>The Canadian-American owner of Tim Hortons and Burger King at its investor day reaffirmed its organic adjusted operating income growth target of 8% or more through 2028, noting it already exceeded the mark in 2024 and 2025.</span></p><p class=\"\"><span>Part of the company's plan is also to grow its restaurant network by 5% each year, which would equate to about 1,800 net new restaurants a year by 2028.</span></p><p class=\"\"><span>Shares in Toronto rose 3.4% to C$95.62.</span></p><p class=\"\"><span>Firehouse Subs to Drive Restaurant Brands' Growth</span></p><p class=\"\"><span>Restaurant Brands Focuses on Operations, Not Acquisitions</span></p><p class=\"\"><span>Quebecor Logs Higher Profit, Revenue on Strong Mobile Growth</span></p><p class=\"\"><span>Quebecor's fourth quarter profit rose after adding more mobile users to its network, supporting higher revenue growth.</span></p><p class=\"\"><span>The Canadian telecom company posted a rise in net income to C$211.5 million, or C$0.93 a share, up from C$177.7 million, or C$0.76 a share, in the comparable quarter a year ago.</span></p><p class=\"\"><span>Revenue for the quarter rose to C$1.55 billion from C$1.5 billion. Analysts were expected a more modest step up in revenue to C$1.53 billion.</span></p><p class=\"\"><span>Quebecor shares ended the session down 2.4% at C$53.80.</span></p><p class=\"\"><span>Stella-Jones Fourth-Quarter Profit, Revenue Fall</span></p><p class=\"\"><span>Stella-Jones' fourth-quarter results weakened as softer residential lumber demand and a drop in railway-tie volumes pushed profit and revenue lower.</span></p><p class=\"\"><span>The Canadian industrial wood products company posted a decline in net income to C$50 million, or C$0.91 a share, down from C$52 million, or C$0.93 a share, in the comparable quarter a year ago.</span></p><p class=\"\"><span>Sales fell slightly to C$727 million from C$730 million, missing analyst forecasts of a rise to C$831 million.</span></p><p class=\"\"><span>Shares of Stella-Jones dropped 3% to C$92.72.</span></p><p class=\"\"><span>Canada to Seek Bilateral Talks With Washington on Sectoral Tariffs Alongside Trade-Pact Review</span></p><p class=\"\"><span>The U.S.-led review of the current trilateral North American trade pact will likely incorporate talks on a bilateral deal to ease U.S. tariffs on key industrial sectors, says the Canadian minister in charge of the country's trading relationship with Washington.</span></p><p class=\"\"><span>Dominic LeBlanc told a Toronto audience Thursday he expects bilateral talks to unfold alongside a review of the U.S.-Mexico-Canada trade agreement, known as USMCA. LeBlanc cited, for instance, talks last fall between Ottawa and Washington to ease tariffs on key sectors like steel, aluminum and automobiles, which President Trump later terminated due to anger over a Canadian ad that questioned the use of tariffs.</span></p><p class=\"\"><span>LeBlanc said Canada wants the U.S. to recommit to a trilateral trade pact. Furthermore, he added, \"there have always been bilateral arrangements as between the three countries. That's not new... [And] we need to get a bilateral deal with the United States to take pressure off the sectoral tariffs.\"</span></p><p class=\"\"><span>Canada Steadfast in Avoiding Travel to U.S., Buying More Domestic Goods</span></p><p class=\"\"><span>Anger over President Trump's trade policy has fueled a notable increase in Canadian spending on domestic products and local tourism, according to research from the Bank of Canada.</span></p><p class=\"\"><span>The central bank's analysis also suggests that momentum behind buying Canadian remains solid with no sign of ebbing.</span></p><p class=\"\"><span>\"Should Canadian consumers continue to prefer domestic products over U.S. goods and services, this spending shift could not only affect the composition of Canada's gross domestic product but also have an impact on inflationary pressures,\" the report said. The research was conducted by the central bank's analysts and produced independently from the Bank of Canada's governing council, which decides on rate policy.</span></p><p class=\"\"><span>TALKING POINT</span></p><p class=\"\"><span>Spurned by Trump, Canada's Carney Is Seeking New Friends Everywhere</span></p><p class=\"\"><span>By Paul Vieira and Shan Li</span></p><p class=\"\"><span>For years, Canada and India have had bitter relations, expelling diplomats and stalling trade talks. Now, Prime Minister Mark Carney wants New Delhi as his newest friend as he travels the world building alliances with so-called middle powers.</span></p><p class=\"\"><span>Carney departed on Thursday for India in a bid to make up with India after years of disputes with his predecessor Justin Trudeau and deepen commercial ties that could reduce Canada's heavy economic reliance on the U.S. To do so, he'll have to iron out disagreements over Canada's Sikh population, which India accuses of stoking separatist sentiment on its soil.</span></p><p class=\"\"><span>But underlying the trip is Carney's call for closer partnerships among countries that have struggled to stand up on their own to China and the U.S. under President Trump. In a speech that drew a standing ovation at the World Economic Forum in Davos, Switzerland, last month, Carney said middle powers such as Canada had to work together to counter the rise of hard power.</span></p><p class=\"\"><span>This year, Carney has also traveled to China, where he negotiated a trade detente with America's biggest rival. Canada agreed to reduce tariffs on Chinese-made electric vehicles, and China eased duties on Canadian food products. This marked a turnaround after years of tension fueled by Canada's arrest in 2018, at the U.S.'s behest, of a senior Huawei Technologies executive.</span></p><p class=\"\"><span>After India, Carney is traveling to other middle powers, Australia and then Japan. But the stakes are highest with India-the world's largest country by population-which could offer Canada's farmers, oil producers and miners a vast new market. For India, Canada offers a stable trading partner after it got hit hard by Trump's tariffs.</span></p><p class=\"\"><span>\"This is a moment where two middle powers have to come together-and are coming together-with a very similar strategic and economic agenda,\" said Harsh Pant, head of strategic studies at the Observer Research Foundation, a New Delhi-based think tank.</span></p><p class=\"\"><span>The Davos crowd may have applauded Carney for a focus on free trade and alliances at a time of rising protectionism and nationalism led by Trump, but the approach has risks. Trump has criticized the China trade deal and called out Carney at Davos, saying: \"Canada lives because of the United States. Remember that, Mark, the next time you make your statements.\"</span></p><p class=\"\"><span>Trump has imposed stiff tariffs of up to 50% on specific Canadian sectors-steel, aluminum, automobiles and forest products-which are throttling business investment and hiring in Canada. Most goods still arrive duty-free under a trade agreement, but the U.S. intends to review the pact. Its uncertain future remains a risk to Canada's economic outlook, officials say.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226017273:0/",
            "pub_date": "2026-02-27 05:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226014645_20260226017284:0",
            "title": "TeraWulf 2025 Rev $168.5M >WULF",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226014645_20260226017284:0/",
            "pub_date": "2026-02-27 05:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226017279:0",
            "title": "PARAMOUNT COMMENTS ON WARNER BROS. DISCOVERY BOARD'S DETERMINATION OF PARAMOUNT'S PROPOSAL AS SUPERIOR",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>LOS ANGELES and NEW YORK, Feb. 26, 2026 /PRNewswire/ — Paramount Skydance Corporation </span><span> (\"Paramount\") confirms that it has been notified by Warner Bros. Discovery, Inc. </span><span> (\"WBD\") that WBD's Board of Directors has determined that Paramount's $31 per share, all-cash proposal to acquire WBD is a \"Company Superior Proposal\" under the terms of WBD's merger agreement with Netflix, Inc. </span><span>.</span></p><p class=\"\"><span>David Ellison, Chairman and CEO of Paramount, said: \"We are pleased WBD's Board has unanimously affirmed the superior value of our offer, which delivers to WBD shareholders superior value, certainty and speed to closing.\"</span></p><p class=\"\"><span>Under the terms of Paramount's proposed merger agreement:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Paramount will acquire WBD for $31.00 per WBD share in cash for 100% of   the company;   </span></li><li class=\"listItem-bmN0_SHH\"><span>A daily \"ticking fee\" of $0.25 per quarter will accrue after September   30, 2026, until the consummation of the Paramount transaction;   </span></li><li class=\"listItem-bmN0_SHH\"><span>A regulatory termination fee of $7 billion would be payable in the event   the transaction does not close due to regulatory matters;   </span></li><li class=\"listItem-bmN0_SHH\"><span>Paramount will pay the $2.8 billion termination fee which WBD is required   to pay to Netflix to terminate its existing Netflix merger agreement;   </span></li><li class=\"listItem-bmN0_SHH\"><span>Paramount will eliminate WBD's potential $1.5 billion financing cost   associated with its debt exchange offer;   </span></li><li class=\"listItem-bmN0_SHH\"><span>The \"Company Material Adverse Effect\" definition excludes the performance   of WBD's Global Linear Networks business;   </span></li><li class=\"listItem-bmN0_SHH\"><span>The Ellison Trust is providing a $45.7 billion equity commitment, and   Larry Ellison is guaranteeing such commitment, including an obligation to   contribute additional equity funding to Paramount to the extent needed to   support the solvency certificate required by Paramount's lending banks,   and   </span></li><li class=\"listItem-bmN0_SHH\"><span>Bank of America Merrill Lynch, Citi and Apollo are providing a $57.5   billion debt commitment. </span></li></ul><p class=\"\"><span>The entry into Paramount's proposed transaction requires the expiration of a four business day match period, termination of the Netflix merger agreement and execution of a definitive merger agreement between Paramount and WBD.</span></p><p class=\"\"><span>As previously announced, the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act applicable to Paramount's acquisition of WBD expired at 11:59 pm on February 19, 2026.</span></p><p class=\"\"><span>Centerview Partners LLC and RedBird Advisors are acting as lead financial advisors to Paramount, and Bank of America Securities, Citi, M. Klein &amp; Company and LionTree are also acting as financial advisors. Cravath, Swaine &amp; Moore LLP and Latham &amp; Watkins LLP are acting as legal counsel to Paramount.</span></p><p class=\"\"><span>About Paramount, a Skydance Corporation</span></p><p class=\"\"><span>Paramount, a Skydance Corporation </span><span> is a leading, next generation global media and entertainment company, comprised of three business segments: Studios, Direct-to-Consumer, and TV Media. The Company's portfolio unites legendary brands, including Paramount Pictures, Paramount Television, CBS — America's most-watched broadcast network, CBS News, CBS Sports, Nickelodeon, MTV, BET, Comedy Central, Showtime, Paramount+, Pluto TV, and Skydance's Animation, Film, Television, Interactive/Games, and Sports divisions. For more information please visit www.paramount.com.</span></p><p class=\"\"><span>Cautionary Note Regarding Forward-Looking Statements</span></p><p class=\"\"><span>This communication contains both historical and forward-looking statements, including statements related to Paramount Skydance Corporation's (\"Paramount\") future financial results and performance, potential achievements, anticipated reporting segments and industry changes and developments. All statements that are not statements of historical fact are, or may be deemed to be, \"forward-looking statements\". Similarly, statements that describe Paramount's objectives, plans or goals are or may be forward-looking statements. These forward-looking statements reflect Paramount's current expectations concerning future results and events; generally can be identified by the use of statements that include phrases such as \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"foresee,\" \"likely,\" \"will,\" \"may,\" \"could,\" \"estimate\" or other similar words or phrases; and involve known and unknown risks, uncertainties and other factors that are difficult to predict and which may cause Paramount's actual results, performance or achievements to be different from any future results, performance or achievements expressed or implied by these statements. These risks, uncertainties and other factors include, among others:  the outcome of the tender offer by Paramount and Prince Sub Inc. (the \"Tender Offer\") to purchase for cash all of the outstanding Series A common stock of Warner Bros. Discovery, Inc. (\"WBD\") or any discussions between Paramount and WBD with respect to a possible transaction (including, without limitation, by means of the Tender Offer, the \"Potential Transaction\"), including the possibility that the Tender Offer will not be successful, that the parties will not agree to pursue a business combination transaction or that the terms of any such transaction will be materially different from those described herein; the conditions to the completion of the Potential Transaction or the previously announced transaction between WBD and Netflix, Inc. (\"Netflix\") pursuant to the Agreement and Plan of Merger, dated December 4, 2025, among Netflix, Nightingale Sub, Inc., WBD and New Topco 25, Inc. (the \"Proposed Netflix Transaction\"), including the receipt of any required stockholder and regulatory approvals for either transaction, the proposed financing for the Potential Transaction, the indebtedness Paramount expects to incur in connection with the Potential Transaction and the total indebtedness of the combined company; the possibility that Paramount may be unable to achieve expected synergies and operating efficiencies within the expected timeframes or at all and to successfully integrate the operations of WBD with those of Paramount, and the possibility that such integration may be more difficult, time-consuming or costly than expected or that operating costs and business disruption (including, without limitation, disruptions in relationships with employees, customers or suppliers) may be greater than expected in connection with the Potential Transaction; risks related to Paramount's streaming business; the adverse impact on Paramount's advertising revenues as a result of changes in consumer behavior, advertising market conditions and deficiencies in audience measurement; risks related to operating in highly competitive and dynamic industries, including cost increases; the unpredictable nature of consumer behavior, as well as evolving technologies and distribution models; risks related to Paramount's decisions to make investments in new businesses, products, services and technologies, and the evolution of Paramount's business strategy; the potential for loss of carriage or other reduction in or the impact of negotiations for the distribution of Paramount's content; damage to Paramount's reputation or brands; losses due to asset impairment charges for goodwill, intangible assets, FCC licenses and content; liabilities related to discontinued operations and former businesses; increasing scrutiny of, and evolving expectations for, sustainability initiatives; evolving business continuity, cybersecurity, privacy and data protection and similar risks; content infringement; domestic and global political, economic and regulatory factors affecting Paramount's businesses generally, including tariffs and other changes in trade policies; the inability to hire or retain key employees or secure creative talent; disruptions to Paramount's operations as a result of labor disputes; the risks and costs associated with the integration of, and Paramount's ability to integrate, the businesses of Paramount Global and Skydance Media, LLC successfully and to achieve anticipated synergies; volatility in the prices of Paramount's Class B Common Stock; potential conflicts of interest arising from Paramount's ownership structure with a controlling stockholder; and other factors described in Paramount's news releases and filings with the Securities and Exchange Commission (the \"SEC\"), including but not limited to Paramount Global's most recent Annual Report on Form 10-K and Paramount's reports on Form 10-Q and Form 8-K. There may be additional risks, uncertainties and factors that Paramount does not currently view as material or that are not necessarily known. The forward-looking statements included in this communication are made only as of the date of this report, and Paramount does not undertake any obligation to publicly update any forward-looking statements to reflect subsequent events or circumstances.</span></p><p class=\"\"><span>Additional Information</span></p><p class=\"\"><span>This communication does not constitute an offer to buy or a solicitation of an offer to sell securities. This communication relates to a proposal that Paramount has made for an acquisition of WBD, the Tender Offer that Paramount, through Prince Sub Inc., its wholly owned subsidiary, has made to WBD stockholders, and Paramount's intention to solicit proxies against the Proposed Netflix Transaction and other proposals to be voted on by WBD stockholders at the special meeting of WBD stockholders to be held to approve the Proposed Netflix Transaction (the \"Netflix Merger Solicitation\") and/or for use at the WBD annual meeting of stockholders. The Tender Offer is being made pursuant to a tender offer statement on Schedule TO (including the offer to purchase, the letter of transmittal and other related offer documents), filed with the SEC on December 8, 2025. These materials, as may be amended from time to time, contain important information, including the terms and conditions of the offer. Subject to future developments, Paramount (and, if a negotiated transaction is agreed, WBD) may file additional documents with the SEC. This communication is not a substitute for any proxy statement, tender offer statement, or other document Paramount and/or WBD may file with the SEC in</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226017279:0/",
            "pub_date": "2026-02-27 05:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226017250:0",
            "title": "Block to Cut Nearly Half of Workforce as Technology Replaces Jobs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Katherine Hamilton</span></p><p class=\"\"><span>Block said it is cutting nearly half its employees, with the company citing new technology providing the ability to supercharge development with fewer workers.</span></p><p class=\"\"><span>The financial services company said Thursday it was cutting its workforce to less than 6,000 people from more than 10,000.</span></p><p class=\"\"><span>Chief Executive Jack Dorsey said he was cutting the jobs because intelligence tools have made it so the same jobs can be done with fewer people.</span></p><p class=\"\"><span>\"A significantly smaller team, using the tools we're building, can do more and do it better,\" Dorsey wrote in a shareholder letter. \"And intelligence tool capabilities are compounding faster every week.\"</span></p><p class=\"\"><span>Write to Katherine Hamilton at katherine.hamilton@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226017250:0/",
            "pub_date": "2026-02-27 05:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226014645_20260226017288:0",
            "title": "TeraWulf 2025 Loss/Shr $1.66 >WULF",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226014645_20260226017288:0/",
            "pub_date": "2026-02-27 05:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226014693_20260226017297:0",
            "title": "Emergent Biosolutions Sees FY26 Rev $720M-$760M >EBS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226014693_20260226017297:0/",
            "pub_date": "2026-02-27 05:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939570:0",
            "title": "FIGS: 2025 net revenues rose 13.6% to $631.1M, with net income up to $34.3M and margin pressures from tariffs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net revenues grew 13.6% to $631.1 million in 2025, with net income rising to $34.3 million and adjusted EBITDA margin improving to 11.8%. Gross margin declined due to tariffs, and macroeconomic and trade policy uncertainties are expected to impact 2026 results.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939570-b634793e440367f6566376d1a404369e\" target=\"_blank\">FIGS, Inc. [FIGS] SEC 10-K Annual Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939570:0-figs-2025-net-revenues-rose-13-6-to-631-1m-with-net-income-up-to-34-3m-and-margin-pressures-from-tariffs/",
            "pub_date": "2026-02-27 05:36:05",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1KO:0",
            "title": "Ginkgo Bioworks posts fall in Q4 revenue; co to divest biosecurity business",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Biotech toolmaker's Q4 revenue fell 24% yr/yr, with adjusted EBITDA improving</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company to divest biosecurity business, focusing on autonomous labs</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company plans to invest in autonomous labs, expanding Boston facility</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ginkgo expects total cash burn of $(150)-$(125) million in 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company focuses on autonomous labs as core platform for biotechnology research</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ginkgo plans to complete biosecurity business divestiture in first half of 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CELL ENGINEERING DECLINE - Q4 Cell Engineering revenue decreased 26% due to ongoing program rationalization as part of restructuring activities</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Q4 Net Income</span></p></td></tr><tr><td><p class=\"\"><span>Beat/Miss</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>-$81 mln</span></p></td></tr><tr><td><p class=\"\"><span>Consensus Estimate</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"sell\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy\", no \"hold\" and 3 \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the biotechnology &amp; medical research peer group is \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Ginkgo Bioworks Holdings Inc is $9.00, about 4.1% below its February 25 closing price of $9.38</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1KO:0-ginkgo-bioworks-posts-fall-in-q4-revenue-co-to-divest-biosecurity-business/",
            "pub_date": "2026-02-27 05:36:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1G7:0",
            "title": "MidCap Financial Q4 NAV falls 3.3% qtr/qtr, announces new buyback",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Investment firm's Q4 net investment income per share rose marginally qtr/qtr to $0.39</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company's NAV per share fell 3.3% qtr/qtr due to earlier investments</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company authorized a new $100 mln stock repurchase plan</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company sees stock repurchases as more accretive than new investments</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company did not provide specific financial guidance for future quarters or year</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>INVESTMENT PERFORMANCE - NAV per share declined 3.3% due to underperforming investments from 2022 and earlier</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>STOCK REPURCHASE - Repurchased 1,091,753 shares at a discount, generating $0.03 per share of NAV accretion</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Q4 Dividend</span></p></td></tr><tr><td><p class=\"\"><span>Beat/Miss</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>$0.31</span></p></td></tr><tr><td><p class=\"\"><span>Consensus Estimate</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy\", 5 \"hold\" and 1 \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the investment management &amp; fund operators peer group is \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for MidCap Financial Investment Corp is $12.63, about 15.5% above its February 25 closing price of $10.93</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 8 times the next 12-month earnings vs. a P/E of 8 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1G7:0-midcap-financial-q4-nav-falls-3-3-qtr-qtr-announces-new-buyback/",
            "pub_date": "2026-02-27 05:36:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226016965_20260226016965:0",
            "title": "RLJ Lodging Trust 4Q Loss/Shr 4c >RLJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226016965_20260226016965:0/",
            "pub_date": "2026-02-27 05:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226016976:0",
            "title": "BOARDWALKTECH REPORTS THIRD QUARTER FISCAL 2026 FINANCIAL RESULTS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>CUPERTINO, Calif., Feb. 26, 2026 /CNW/ - </span><span> </span><span> — Boardwalktech Software Corp. (\"Boardwalktech\" or the \"Company\"), a leading digital ledger platform and enterprise software solutions company, is pleased to report its financial results for the three-month period ended December 31, 2025 (\"Q3-FY26\"). All figures are reported in U.S. dollars, unless otherwise indicated. Boardwalktech's financial statements are prepared in accordance with International Financial Reporting Standards (\"IFRS\"). Please refer to the Unaudited Condensed Consolidated Financial Statements and Management's Discussion and Analysis (\"MD&amp;A\") for the three-month period ended December 31, 2025, filed on SEDAR+ at www.sedarplus.ca for more information.</span></p><p class=\"\"><span>Financial Highlights:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Revenues for Q3-FY26 totaled $1 million, unchanged from $1 million of   revenue reported in Q2-FY26. Revenues for Q3-FY26 decreased 25% from $1.3   million of revenue in Q3-FY25, primarily due to a decline in software and   subscription services revenue from two previously disclosed non-renewals   in Fiscal 2025.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Annual Recurring Revenue (\"ARR\"), a non-IFRS measure, at December 31,   2025 was $3.8 million. The Company defines ARR, as the annual recurring   revenue expected based on trailing quarterly revenue from license   subscriptions and certain recurring services.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Gross margin for Q3-FY26 was 86.9%, versus 86.7% in Q2-FY26 and 88.4% in   Q3-FY25. The improvement over Q2-FY26 is due to a decrease in cost of   sales, primarily hosting costs that are anticipated to continue at a   lower rate. The decrease from Q3-FY25 is due to lower revenue levels.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Adjusted EBITDA for Q3-FY26 was a loss of $(0.2) million, which was a 35%   improvement versus $(0.4) million of adjusted EBITDA in Q2-FY26 and a 19%   improvement over $(0.4) million in Q3-FY25.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net loss for Q3-FY26 was $(0.4) million ($(0.01) per basic and diluted   share), versus a $(0.5) million loss in Q2-FY26 ($(0.01) per basic and   diluted share), and a $(0.6) million loss in Q3-FY25 ($(0.01) per basic   and diluted share). This represented an 18% sequential improvement over   Q2-FY26 due to an increase in revenues and a decrease in costs. Total   selling, general and administration (\"SG&amp;A\") expenses in Q3-FY26 totaled   $1.1 million, a $0.1 million decrease from $1.2 million reported in   Q2-FY26 and a $0.3 million decrease from the $1.4 million reported in   Q3-FY25, as the Company continues to recognize savings from previously   announced cost alignment efforts.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Non-IFRS net loss for Q3 Fiscal 2026 (as defined in the Non-IFRS   Financial Measures section) totaled $(0.3) million ($(0.00) per basic and   diluted share), versus $(0.4) million in Q2 Fiscal 2026 ($(0.01) per   basic and diluted share) and $(0.4) million in Q3 Fiscal 2025 ($(0.01)   per basic and diluted share).   </span></li><li class=\"listItem-bmN0_SHH\"><span>Cash ending Q3-FY26 was $0.1 million, plus $0.4 million of accounts   receivables, while cash burn from Operations decreased by $0.9 million in   Q3-FY26 versus Q3-FY25, to a burn rate of $33,000 per month.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Outstanding debt as at December 31, 2025 was $2.5 million which was drawn   against the previously announced $4 million line of credit from Celtic   Bank. Due to requirements under IFRS, this debt was reclassified under   current liabilities even though the final debt maturity remains unchanged   at March of 2027. </span></li></ul><p class=\"\"><span>Q3-FY26 Operational Highlights</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>On November 4, 2025, the Company announced several contract renewals and   expansions increasing recurring revenue across multiple major enterprise   customers. The world's largest social media company renewed its services   agreement for another year, extending the partnership and expanding the   scope of work. A large global multinational IT services firm, both a   customer and partner, also expanded its engagement. A leading global   chemical manufacturer continues to expand its use of Unity Central to   improve supply chain visibility and enhance AI-driven information   management. </span></li></ul><p class=\"\"><span>Subsequent to Q3-FY26 Operational Highlights:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>On January 6, 2026, the Company announces the expansion and extension of   its contract with a leading global IT services firm to support a   top--five U.S. financial institution. Boardwalktech and the global IT   services firm have been jointly servicing this marquee U.S. bank since   2024, transforming manual workflows and processes into automated and   compliant solutions running on the Boardwalktech Velocity platform   </span></li><li class=\"listItem-bmN0_SHH\"><span>On January 20, 2026, the Company announced the launch of Boardwalk   Verity(TM), its next--generation Intelligent Controls Platform.   Purpose--built for highly regulated organizations, including banks,   insurers, and global financial institutions, Verity leverages Generative   AI and Agentic AI for controls automation, execution, validation, testing,   and continuous monitoring across thousands of business controls. </span></li></ul><p class=\"\"><span>Management Commentary</span></p><p class=\"\"><span>\"We continue to see existing customers expand deployments across Velocity and our Digital Ledger platform,\" said Andrew T. Duncan, CEO of Boardwalktech. \"Recent upgrade initiatives and new opportunities are expected to drive incremental professional services revenue and increase high-margin ARR. During the quarter, we enhanced Velocity with AI capabilities and subsequent to quarter-end we formally launched Verity, our first purpose-built AI product focused on automating internal controls testing and monitoring for financial institutions. Early traction with large banks and global partners reinforces our confidence in Verity as a meaningful growth driver. Unity Central also continues to gain momentum with AI enhancements improving enterprise data management and one supply chain customer already live and expanding usage based on measurable ROI. With previous cost reductions now taking effect and improved operating efficiency, we remain focused on accelerating revenue growth and moving toward Adjusted EBITDA breakeven in the near term. We believe the combination of Verity's launch, Velocity expansion, partner leverage, and continued cost discipline sets the stage for improved year-over-year performance and organic growth into Fiscal 2027 and beyond.\"</span></p><p class=\"\"><span>About Boardwalktech Software Corp.</span></p><p class=\"\"><span>Boardwalktech has developed a patented Digital Ledger Technology Platform currently used by Fortune 500 companies running mission-critical applications worldwide. Boardwalktech's digital ledger technology and its unique method of managing vast amounts of structured and unstructured data is the only platform on the market today where multiple parties can effectively work on the same data simultaneously while preserving the fidelity and provenance of the data. Boardwalktech can deliver collaborative, purpose-built enterprise information management applications on any device or user interface with full integration with enterprise systems of record in a fraction of the time it takes other non-digital ledger technology-based platforms. Boardwalktech is headquartered in Cupertino, California with offices in India and operations in North America. For more information on Boardwalktech, visit our website at www.boardwalktech.com.</span></p><p class=\"\"><span>Forward-Looking Information and Statements</span></p><p class=\"\"><span>This press release contains certain \"forward-looking information\" within the meaning of applicable Canadian securities legislation and may also contain statements that may constitute \"forward-looking statements\" within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Such forward-looking information and statements are not representative of historical facts or information or current condition, but instead represent only the Company's beliefs regarding future events, plans or objectives, many of which, by their nature, are inherently uncertain and outside of the Company's control. Generally, such forward-looking information or statements can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or may contain statements that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"will continue\", \"will occur\" or \"will be achieved\".</span></p><p class=\"\"><span>By identifying such information and statements in this manner, the Company is alerting the reader that such information and statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such information and statements.</span></p><p class=\"\"><span>An investment in securities of the Company is speculative and subject to several risks including, without limitation, the risks discussed under the heading \"Risk Factors\" in the Company's filing statement dated February 26, 2026. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in the forward-looking information and forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended.</span></p><p class=\"\"><span>In connection with the forward-looking information and forward-looking statements contained in this press release, the Company has made certain assumptions. Although the Company believes that the assumptions and factors used in preparing, and the expectations contained in, the forward-looking information and statements are reasonable, undue reliance should not be placed on such information and statements, and no assurance or guarantee can be given that such forward-looking information and statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information and statements. The forward-looking information and forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake to update any forward-looking information and/or forward-looking statements that are contained or referenced herein, except in accordance with applicable securities laws. All subsequent written and oral forward-looking information and statements attributable to the Company or persons acting on its behalf is expressly qualified in its entirety by this notice.</span></p><p class=\"\"><span>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><span>View original content to download multimedia:https://www.prnewswire.com/news-releases/boardwalktech-reports-third-quarter-fiscal-2026-financial-results-302698933.html</span></p><p class=\"\"><span>SOURCE Boardwalktech Software Corp.</span></p><p class=\"\"><span>/CONTACT:</span></p><p class=\"\"><span>Copyright CNW Group 2026</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226016976:0/",
            "pub_date": "2026-02-27 05:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1IU:0",
            "title": "Braemar Hotels Q4 comparable ADR rises 5.4%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>U.S. luxury hotel REIT's Q4 RevPAR flat, comparable ADR up 5.4%, occupancy down 5.2%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net loss for Q4 was $46 mln, with AFFO at $(0.02) per share</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company completed sale of The Clancy hotel for $115 mln</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>RENOVATIONS IMPACT - Renovations at certain properties affected overall portfolio results, but properties not under renovation saw improved performance</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>RESORT PERFORMANCE - Resort portfolio delivered solid Q4 with 4.1% RevPAR growth and 6.0% EBITDA growth over prior year</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>LXR BRAND CONVERSION - Completed conversion of Cameo Beverly Hills to Hilton's luxury LXR brand, aligning with luxury traveler expectations</span></p></li></ul><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>-$46 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted Hotel EBITDA</span></p></td><td></td><td><p class=\"\"><span>$38 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Capex</span></p></td><td></td><td><p class=\"\"><span>$23.40 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy\", 2 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the specialized reits peer group is \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Braemar Hotels &amp; Resorts Inc is $4.00, about 29% above its February 25 closing price of $3.10</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1IU:0-braemar-hotels-q4-comparable-adr-rises-5-4/",
            "pub_date": "2026-02-27 05:30:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939539:0",
            "title": "GRND: 28% revenue growth, $95M net income, and expanded $400M buyback program for 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Delivered 28% revenue growth and $95M net income in 2025, with Adjusted EBITDA of $196M. 2026 guidance targets revenue above $528M and Adjusted EBITDA above $217M, alongside a $400M increase in the share repurchase program.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939539-bdb2adac11be397a9fbf91ee337299a9\" target=\"_blank\">Grindr Inc. [GRND] SEC 8-K Current Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939539:0-grnd-28-revenue-growth-95m-net-income-and-expanded-400m-buyback-program-for-2025/",
            "pub_date": "2026-02-27 05:30:08",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1JE:0",
            "title": "Barings Corporate Investors' preliminary Q4 net assets rise",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Investment trust's preliminary Q4 net assets rose, driven by net investment income and gains</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company's NAV per share decreased due to dividend payments</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Trust made $20.3 mln in new private investments during Q4</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Barings Corporate Investors did not provide specific future guidance in the press release</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DIVIDEND IMPACT - NAV per share decreased due to $0.40 per share dividend payments</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NEW INVESTMENTS - Trust made $20.3 mln in new private investments and $3.6 mln in new public investments during Q4 2025</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Q4 Dividend</span></p></td></tr><tr><td><p class=\"\"><span>Beat/Miss</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>$0.40</span></p></td></tr><tr><td><p class=\"\"><span>Consensus Estimate</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1JE:0-barings-corporate-investors-preliminary-q4-net-assets-rise/",
            "pub_date": "2026-02-27 05:30:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939516:0",
            "title": "AIRG: Sales fell 14.6% in 2025, but gross margin rose to 43.5% and net loss narrowed to $6.4 million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>2025 sales declined 14.6% year-over-year due to softness in enterprise and automotive markets, but gross margin improved to 43.5% and net loss narrowed to $6.4 million. Consumer segment grew 20.2% on Wi-Fi 7 demand, while strategic focus remains on ramping new platforms and recurring revenue.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939516-dcb02beb54ac373cd048bec8a75bddcb\" target=\"_blank\">Airgain, Inc. [AIRG] SEC 10-K Annual Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939516:0-airg-sales-fell-14-6-in-2025-but-gross-margin-rose-to-43-5-and-net-loss-narrowed-to-6-4-million/",
            "pub_date": "2026-02-27 05:30:18",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939511:0",
            "title": "NCMI: 2025 revenue rose 1% to $243.2M, net loss halved, and liquidity strengthened post-bankruptcy",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew 1% to $243.2M in 2025, with national ad sales up but local/regional down. The company emerged from bankruptcy, acquired Spotlight, restructured exhibitor agreements, and launched a $100M share repurchase program, while maintaining strong liquidity and reducing net loss by over 50%.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939511-abe9bbe1c4bbee9d52fd69ad29f6615a\" target=\"_blank\">National CineMedia, Inc. [NCMI] SEC 10-K Annual Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939511:0-ncmi-2025-revenue-rose-1-to-243-2m-net-loss-halved-and-liquidity-strengthened-post-bankruptcy/",
            "pub_date": "2026-02-27 05:30:26",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1G3:0",
            "title": "Sunrun beats Q4 revenue estimates ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Home battery storage provider's Q4 revenue rose, beating analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company paid down $81 mln of recourse debt in Q4</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Storage attachment rate reached record 71% in Q4</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Sunrun expects full-year 2026 cash generation between $250 mln and $450 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Aggregate subscriber value expected between $4.8 bln and $5.2 bln for 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Contracted net value creation forecasted between $650 mln and $1,050 mln for 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>STORAGE-FIRST STRATEGY - Sunrun's storage attachment rate reached a record 71% in Q4, up from 62% in the prior year, contributing to its financial performance</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CAPITAL MARKETS EXECUTION - Sunrun closed a joint venture with Hannon Armstrong to finance 300 megawatts of capacity, supporting growth initiatives</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DEBT REDUCTION - Sunrun paid down $81 mln of recourse debt in Q4, strengthening its financial position</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$1.16 bln</span></p></td><td><p class=\"\"><span>$614.41 mln (20 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>$103.60 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating Expenses</span></p></td><td></td><td><p class=\"\"><span>$1.06 bln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 15 \"strong buy\" or \"buy\", 11 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the renewable energy equipment &amp; services peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Sunrun Inc is $22.85, about 16.9% above its February 25 closing price of $19.55</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 46 times the next 12-month earnings vs. a P/E of 53 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1G3:0-sunrun-beats-q4-revenue-estimates/",
            "pub_date": "2026-02-27 05:30:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939547:0",
            "title": "CPNG: Q4 2025 revenue grew 11% YoY to $8.8B, but profitability declined due to a data breach",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw 11% YoY revenue growth to $8.8B, but profitability was impacted by a data breach and non-recurring items. Full-year 2025 revenue rose 14% to $34.5B, with Product Commerce and Developing Offerings segments both expanding. </span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939547-9870c3ee63f5c273ba49341e546b2873\" target=\"_blank\">Coupang, Inc. [CPNG] SEC 8-K Current Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939547:0-cpng-q4-2025-revenue-grew-11-yoy-to-8-8b-but-profitability-declined-due-to-a-data-breach/",
            "pub_date": "2026-02-27 05:30:33",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939546:0",
            "title": "REAL: Achieved record GMV, revenue, and positive Adjusted EBITDA in every quarter, with strong 2026 outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>GMV and revenue grew 16% and 15% year-over-year, with positive Adjusted EBITDA in every quarter and improved net loss. Guidance for 2026 projects continued growth and margin expansion, supported by strong active buyer and AOV increases.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939546-8a2e5b85c8d9ee0db76e3aefdb3c70f8\" target=\"_blank\">The RealReal, Inc. [REAL] SEC 8-K Current Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939546:0-real-achieved-record-gmv-revenue-and-positive-adjusted-ebitda-in-every-quarter-with-strong-2026-outlook/",
            "pub_date": "2026-02-27 05:30:43",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_PLXE16FD4:0",
            "title": "BRIEF-RLJ Lodging Trust Q4 Adjusted Revpar USD 136.79",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Feb 26 (Reuters) - RLJ Lodging Trust Q4 revenue USD 328.6 million vs. IBES estimate USD 319.6 million.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Q4 net income USD 500 thousand</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 adjusted FFO USD 48.7 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 adjusted hotel EBITDA USD 87.8 million</span></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_PLXE16FD4:0-brief-rlj-lodging-trust-q4-adjusted-revpar-usd-136-79/",
            "pub_date": "2026-02-27 05:30:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_PLX9C4CC3:0",
            "title": "BRIEF-Intchains Group Limited Q4 Net Income RMB -130.7 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Feb 26 (Reuters) - Intchains Group Limited Q4 revenue RMB 36.1 million.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_PLX9C4CC3:0-brief-intchains-group-limited-q4-net-income-rmb-130-7-million/",
            "pub_date": "2026-02-27 05:30:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939504:0",
            "title": "PCT: 2025 revenue grew to $8.4M amid expansion, but losses and execution risks remain significant",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue reached $8.4 million in 2025 as operations ramped up, but losses widened due to higher production and SG&amp;A costs. Major capital raises and facility expansion plans support long-term growth, while risks remain around profitability, project execution, and market acceptance.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939504-09d1c7b0dffa6c0e52cac1babd3b9a3b\" target=\"_blank\">PureCycle Technologies, Inc. [PCT] SEC 10-K Annual Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939504:0-pct-2025-revenue-grew-to-8-4m-amid-expansion-but-losses-and-execution-risks-remain-significant/",
            "pub_date": "2026-02-27 05:30:55",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2939476:0",
            "title": "CRWV: Q4'25 revenue up 110% YoY, $66.8B backlog, and strong margins amid rapid AI cloud growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4'25 revenue grew 110% YoY to $1.6B, with FY'25 revenue at $5.1B, up 168% YoY. Revenue backlog soared 342% YoY to $66.8B, while adjusted EBITDA margin remained strong at 57%. Major infrastructure investments and strategic partnerships supported rapid growth.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2939476-1f60c8b47cf6c9d18242118670ca9757\" target=\"_blank\">CoreWeave, Inc. [CRWV] Slides Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2939476:0-crwv-q4-25-revenue-up-110-yoy-66-8b-backlog-and-strong-margins-amid-rapid-ai-cloud-growth/",
            "pub_date": "2026-02-27 05:24:36",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2939471:0",
            "title": "CTRA: Exceeded 4Q25 production guidance and announced a transformative merger with Devon Energy",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Announced a major merger with Devon Energy, exceeding 4Q25 production and free cash flow guidance. Maintained strong capital discipline, retiring debt and returning $820 million to shareholders in 2025, with 2026 guidance projecting higher free cash flow and modest oil growth.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2939471-938a03128ec654d017570803d2f459f3\" target=\"_blank\">Coterra Energy Inc. [CTRA] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2939471:0-ctra-exceeded-4q25-production-guidance-and-announced-a-transformative-merger-with-devon-energy/",
            "pub_date": "2026-02-27 05:24:38",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2939460:0",
            "title": "SOM: Record revenue and EBITDA growth, positive cash flow, and reaffirmed FY26 guidance",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record half-year revenue and EBITDA growth driven by strong demand in Europe and North America, with positive operating cash flow and increased investment in manufacturing and innovation. FY26 guidance reaffirmed, highlighting continued focus on growth and new product launches.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2939460-324d897a4e08aaf1c9eb5c3224c33d69\" target=\"_blank\">Somnomed Limited [SOM] Slides Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2939460:0-som-record-revenue-and-ebitda-growth-positive-cash-flow-and-reaffirmed-fy26-guidance/",
            "pub_date": "2026-02-27 05:24:44",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2939475:0",
            "title": "DV: 2025 revenue rose 14% to $748M, with 33% EBITDA margin and $300M share buyback authorized",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew 14% year-over-year to $748.3M in 2025, with strong gains across all segments and a 33% adjusted EBITDA margin. 2026 guidance projects 8–10% revenue growth and a 34% margin, supported by product innovation, robust cash flow, and a $300M share repurchase authorization.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2939475-baa83cb5777651cff4b1573f5ad531e0\" target=\"_blank\">DoubleVerify Holdings, Inc. [DV] SEC 8-K Current Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2939475:0-dv-2025-revenue-rose-14-to-748m-with-33-ebitda-margin-and-300m-share-buyback-authorized/",
            "pub_date": "2026-02-27 05:24:52",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        }
    ]
}