{
    "data": [
        {
            "id": "tradingview:2410aba32cf15:0",
            "title": "HANMI FINANCIAL CORP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Hanmi Financial Corp, a prominent financial institution serving multi-ethnic communities with a focus on the Korean-American community, has released its 2025 Form 10-K report. The report highlights significant financial growth, strategic initiatives aimed at expanding its loan portfolio, and the challenges and risks the company faces in the competitive banking industry.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> Hanmi Financial Corp reported a net income of $76.1 million for 2025, reflecting a 22.3% increase from the previous year. This growth was driven by a $33.4 million increase in net interest income and a $2.4 million increase in noninterest income.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Earnings Per Diluted Share:</span></strong><span> The company's earnings per diluted share rose to $2.51, compared to $2.05 in the previous year, indicating improved profitability.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Interest Income:</span></strong><span> Net interest income for the year was $236.2 million, a 16.5% increase from the previous year, driven by lower rates paid on deposits and a higher average balance of loans.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Credit Loss Expense:</span></strong><span> The company recorded a credit loss expense of $14.4 million, up from $4.4 million in the previous year, primarily due to an $8.6 million charge-off during 2025.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Noninterest Income:</span></strong><span> Noninterest income increased by 7.6% to $34.0 million, mainly due to higher gains on the sale of SBA loans and increased bank-owned life insurance income.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments:</span></strong><span> Hanmi Bank's revenues are primarily derived from interest and fees on loans, interest and dividends on securities, service charges, fees on deposit accounts, and sales of SBA and mortgage loans. The bank's client base reflects the multi-ethnic composition of the communities it serves, focusing on the Korean-American community and other multi-ethnic communities across several states.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> The bank operates in California, Colorado, Georgia, Illinois, New Jersey, New York, Texas, Virginia, and Washington, with a significant focus on markets where businesses are owned by immigrants and minority groups. California remains the largest market, particularly for residential property loans.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sales Units:</span></strong><span> The bank's loan portfolio includes real estate loans, commercial and industrial loans, equipment financing agreements, and SBA loans. As of December 31, 2025, the total loan balance was $6.56 billion, reflecting a 5.0% increase from the previous year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The bank anticipates potential changes in economic conditions, such as a mild recession starting in the first quarter of 2026, which could impact credit losses. Management is focused on maintaining adequate allowance for credit losses and adjusting strategies based on economic forecasts.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Loan Portfolio Growth:</span></strong><span> The company focused on strategic loan portfolio growth, increasing total loans by $312.0 million, or 5.0%, to $6.56 billion as of December 31, 2025. This growth was driven by strategic initiatives to expand the commercial and industrial and residential real estate portfolios while reducing commercial real estate exposure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The company repurchased 393,298 shares of its common stock at an average price of $23.91, totaling $9.4 million, under its share repurchase program. The Board of Directors authorized an expansion of the share repurchase program, adding 1.5 million shares to the existing capacity, bringing the total repurchase capacity to approximately 2.3 million shares. The company paid $32.6 million in dividends, or $1.08 per share, in 2025. Stockholders' equity increased by $64.2 million to $796.4 million, driven by net income and a decrease in unrealized after-tax losses on securities.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company plans to continue its share repurchase program with an expanded capacity of 2.3 million shares. It aims to maintain a strong capital position, with the Bank's total risk-based capital ratio at 14.25% and the Company's at 15.06%, both exceeding regulatory requirements. The company will focus on managing interest rate risk and liquidity, with increased borrowing capacity through the Federal Reserve Discount Window and other credit lines. The strategic focus will remain on expanding loan portfolios in targeted areas while managing credit risk and maintaining capital adequacy.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Competitive Landscape:</span></strong><span> Hanmi Financial Corporation faces significant competition in the banking and financial services industry, particularly from larger institutions with greater resources and broader service offerings. The company’s focus on the Korean-American and multi-ethnic communities presents both opportunities and challenges in maintaining its market position.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Lending Risks:</span></strong><span> Concentrations in certain industries, such as non-residential buildings, hospitality, and retail, pose credit quality risks. Emphasis on commercial lending increases exposure to non-payment and loss risks.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Scrutiny:</span></strong><span> High levels of commercial real estate loans may subject the bank to additional regulatory scrutiny, potentially leading to increased costs or restrictions on lending activities.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Economic Conditions:</span></strong><span> Adverse economic conditions in key markets like California, Illinois, Texas, Georgia, and New York could impair borrowers’ ability to repay loans and decrease deposit levels.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Inflation and Interest Rates:</span></strong><span> Rising inflation and interest rates could negatively impact the value of investment securities and increase operational costs.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Environmental Liabilities:</span></strong><span> Foreclosure on properties could expose the company to environmental liabilities, leading to substantial costs.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Cybersecurity Risks:</span></strong><span> The company is susceptible to cyber-attacks and data breaches, which could disrupt operations and damage its reputation.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Changes:</span></strong><span> Changes in laws and regulations, including those related to Dodd-Frank, could increase compliance costs and limit business opportunities.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI and ML Risks:</span></strong><span> The integration of AI and ML technologies exposes the company to operational, data, regulatory, and reputational risks.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Risk Management:</span></strong><span> Management highlights the importance of maintaining a strong risk management framework to address the identified risks. The company is focused on enhancing its cybersecurity measures and ensuring compliance with evolving regulatory requirements. Additionally, management is monitoring economic conditions closely to mitigate potential impacts on its loan portfolio and overall financial performance.</span></p><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1109242/000119312526082425/hafc-20251231.htm\" rel=\"nofollow\" target=\"_blank\">HANMI FINANCIAL CORP [ HAFC ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:2410aba32cf15:0-hanmi-financial-corp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:5ed2aa5ef7028:0",
            "title": "COVENANT LOGISTICS GROUP, INC. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Covenant Logistics Group, Inc., a leading provider of transportation and logistics services, has released its 2025 10-K report, detailing the company's financial performance, business operations, strategic initiatives, and the challenges it faces in the current market environment. The report provides a comprehensive overview of the company's activities and future outlook, reflecting its commitment to operational efficiency and strategic growth.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Revenue</span></strong><span>: $1,164.5 million, reflecting an increase from $1,131.5 million in 2024, driven by growth in Managed Freight and Dedicated segments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operating Income</span></strong><span>: $2.9 million, a significant decrease from $44.8 million in 2024, impacted by increased costs and challenging market conditions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income</span></strong><span>: $7.2 million, or $0.27 per diluted share, compared with $35.9 million, or $1.30 per diluted share, for 2024, indicating a decline due to higher expenses and lower operating income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income from Continuing Operations</span></strong><span>: $4.4 million, or $0.16 per diluted share, compared to $35.3 million, or $1.28 per diluted share in 2024, reflecting reduced profitability.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income from Discontinued Operations</span></strong><span>: $2.8 million, or $0.11 per diluted share, compared to $0.6 million, or $0.02 per diluted share in 2024, showing an increase in income from discontinued operations.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments</span></strong><span>: The company operates four reportable segments: Expedited, Dedicated, Managed Freight, and Warehousing. The Expedited segment focuses on high-service freight with tight delivery windows, while the Dedicated segment provides committed truckload capacity over contracted periods. Managed Freight includes brokerage and transportation management services, and Warehousing offers day-to-day warehouse management services.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Trends</span></strong><span>: The company has experienced significant changes in the truckload industry, including fluid supply chain patterns, rising cost structures, and increased use of technology by customers to optimize supply chains. These trends have necessitated the expansion of the company's technological capabilities to optimize asset allocation and drive operational efficiency.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Driver Focus</span></strong><span>: The company emphasizes the importance of drivers, employing a range of methods to improve driver careers, including safety, lifestyle, compensation, and technology enhancements. The company also faces challenges in driver recruitment and retention due to industry-wide shortages.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Fleet and Equipment</span></strong><span>: The company operates a modern fleet with an average tractor age of approximately 2.0 years, utilizing advanced technologies such as freight optimization software, routing software, and safety technologies to enhance operational efficiencies and driver safety.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Safety and Compliance</span></strong><span>: The company maintains a focus on safety, with satisfactory safety ratings from the FMCSA and ongoing implementation of safety technologies. The company also complies with various transportation and environmental regulations, which impact operations and costs.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: The company plans to continue reallocating capital to better-performing operations and expects improvements in freight fundamentals later in the year. The focus will be on high-value and high-service requirement freight, with an emphasis on operational efficiency and capturing operating leverage.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Environment</span></strong><span>: The company is subject to various regulations, including those related to driver hours-of-service, emissions standards, and food safety. Changes in these regulations could impact operations and profitability.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Seasonality and Weather Impact</span></strong><span>: The company's operations are affected by seasonality, with decreased productivity in winter due to weather conditions and increased demand in the fourth quarter from retail customers. Weather-related disruptions can also impact operations and financial results.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong><span>: The company is reallocating capital towards better returning operations, focusing on growing its Dedicated, Managed Freight, and Warehousing segments to become a key partner for critical transportation and logistics needs. It plans to exit unprofitable business relationships and moderately reduce its total truckload fleet while growing the most profitable components.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management</span></strong><span>: The company repurchased approximately 1.6 million shares of its Class A common stock for $36.2 million under a stock repurchase program authorized for up to $50 million. It also distributed $7.2 million in dividends to stockholders during 2025. The company had $338.7 million in debt and lease obligations as of December 31, 2025, with a significant portion allocated to revenue equipment installment notes.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: For 2026, the company plans to improve free cash flow and deleverage its balance sheet, with a focus on high-value and high-service requirement freight. It expects to reduce net capital expenditures significantly compared to 2025, with a baseline expectation of $40 million to $50 million. The company remains optimistic about improving freight fundamentals and aims to enhance operational efficiency and financial results later in the year.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Integration Risks</span></strong><span>: The company has expanded its services through acquisitions, such as Landair, AAT, LTST, Sims, and Star, which introduces integration risks and the challenge of managing diverse operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Industry Challenges</span></strong><span>: The evolving supply chain patterns and rising costs in the truckload industry, including equipment, driver wages, and insurance premiums, pose significant challenges. The company is focused on strategic initiatives to improve operational efficiency and manage these risks.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Risks</span></strong><span>: The company faces strategic risks from economic, credit, business, and regulatory factors affecting the truckload industry, which are largely beyond its control. Key risks include recessionary cycles, changes in customer practices, driver shortages, regulatory compliance, and public health crises.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Competitive Pressures</span></strong><span>: The company is also exposed to competitive pressures, with numerous competitors potentially impacting profitability and growth opportunities. The reliance on major customers, particularly in the retail sector, poses a risk if there is a significant reduction in business.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Compliance Risks</span></strong><span>: Compliance risks include potential litigation, self-insurance exposure, and regulatory changes that could impact operations and profitability.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks</span></strong><span>: The company also faces operational risks such as driver compensation increases, fuel price fluctuations, and dependency on third-party providers.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Technological Risks</span></strong><span>: Technological risks include cybersecurity threats and the need for effective information system management.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies</span></strong><span>: Management is focused on improving profitability through strategic initiatives, including capital allocation, risk management, and customer experience enhancement. The company is addressing challenges such as driver retention, fuel cost management, and technological advancements to remain competitive. The impact of global conflicts and regulatory changes on supply chains and costs is being closely monitored.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks</span></strong><span>: The company is exposed to market risks such as fluctuations in fuel prices, interest rates, and the availability of credit. These factors could materially affect financial results, and the company is implementing strategies to mitigate these risks, including fuel surcharge programs and hedging activities.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/928658/000143774926006086/cvti20251231_10k.htm\" rel=\"nofollow\" target=\"_blank\">COVENANT LOGISTICS GROUP, INC. [ CVLG ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:5ed2aa5ef7028:0-covenant-logistics-group-inc-sec-10-k-report/",
            "pub_date": "2026-02-28 04:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:303858f02bf66:0",
            "title": "CENTRAL PACIFIC FINANCIAL CORP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Central Pacific Financial Corp, the parent company of Central Pacific Bank, has released its 2025 10-K report, showcasing a year of robust financial performance and strategic growth. The company, which operates primarily in Hawaii, has demonstrated significant improvements in key financial metrics, expanded its business operations, and outlined strategic initiatives aimed at sustaining long-term growth. However, it also faces several challenges and risks inherent to its market and industry.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> $77.5 million, reflecting a significant increase from $53.4 million in 2024, driven by higher net interest income and other operating income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Diluted EPS:</span></strong><span> $2.86, up from $1.97 in 2024, indicating improved profitability per share.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Return on Average Assets (ROA):</span></strong><span> 1.06%, compared to 0.72% in 2024, demonstrating enhanced asset utilization.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Return on Average Shareholders' Equity (ROE):</span></strong><span> 13.62%, up from 10.25% in 2024, highlighting improved return on equity.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Interest Income:</span></strong><span> $240.9 million, an increase of $29.2 million from 2024, primarily due to higher average yields on loans and investment securities.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Other Operating Income:</span></strong><span> $51.8 million, increased by $13.1 million from 2024, largely due to a reduction in losses from investment securities sales.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Other Operating Expense:</span></strong><span> $178.7 million, up by $6.1 million from 2024, mainly due to higher salaries and employee benefits.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Efficiency Ratio:</span></strong><span> 61.05%, improved from 68.91% in 2024, indicating better cost management relative to revenue generation.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Branch Network:</span></strong><span> Central Pacific Bank operates 27 branches and 55 ATMs across Hawaii, with a significant presence on Oahu, Maui, Hawaii Island, and Kauai, providing full-service commercial banking.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Products and Services:</span></strong><span> The bank offers a comprehensive range of deposit and lending products, including commercial and industrial loans, residential mortgages, and consumer loans, alongside cash management and digital banking services.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Lending Activities:</span></strong><span> The bank focuses on five principal lending areas: residential mortgage, commercial and industrial, commercial mortgage, construction, and consumer lending, with a strong emphasis on real estate-related loans.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Heritage and Community Focus:</span></strong><span> Founded by World War II veterans, Central Pacific Bank remains committed to serving individuals and small businesses in Hawaii, emphasizing exceptional customer service and community engagement.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Focus:</span></strong><span> The bank aims to be a top-performing institution by focusing on small businesses and homeowners in Hawaii, strategic partnerships in Japan and Korea, and integrating wealth management services.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Employee Development:</span></strong><span> The company prioritizes employee growth through internal promotions, continuous learning, and career development programs, maintaining a strong focus on employee well-being and retention.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Area and Competition:</span></strong><span> Operating primarily in Hawaii, the bank is the fourth-largest depository institution in the state, competing with a wide range of financial service providers, including fintech companies.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> The bank's operations are significantly influenced by Hawaii's economic conditions, particularly the real estate market and tourism industry, with a strong focus on local market trends.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Tourism Trends:</span></strong><span> Hawaii's tourism industry saw a slight decline in visitor arrivals in 2025, but visitor spending reached a record high, driven by higher per-visitor expenditures, indicating a shift towards a value-focused tourism model.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Interest Rates and Monetary Policy:</span></strong><span> The Federal Reserve's interest rate adjustments have influenced the bank's interest income and expense, with recent rate cuts aimed at balancing employment and inflation goals.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The bank anticipates continued focus on strategic partnerships, diversification of its loan portfolio, and maintaining strong capital and liquidity positions to navigate economic uncertainties.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Investment Portfolio Repositioning:</span></strong><span> The company executed an investment portfolio repositioning in the fourth quarter of 2024, selling lower-yielding securities and purchasing higher-yielding ones to enhance returns.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> In 2025, the company repurchased 788,261 shares of common stock at an aggregate cost of $23.3 million under its share repurchase program. It also paid cash dividends of $1.09 per share, supported by its strong capital position and consistent profitability. The company maintained a robust liquidity position with $378.7 million in cash and $2.52 billion in additional liquidity sources, representing 116% of uninsured and uncollateralized deposits.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company plans to continue its strategic focus on maintaining a strong capital position and liquidity, while exploring opportunities for growth in its core markets. It aims to balance its capital management strategies with sustainable growth initiatives, particularly in the Hawaii market, and to manage risks associated with economic and market conditions.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Economic Risks:</span></strong><span> The geographic concentration in Hawaii exposes the company to risks from local economic downturns, particularly affecting tourism and real estate markets. Negative developments in the global and U.S. economies, such as inflation and interest rate fluctuations, could adversely impact the company's financial condition.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Credit Risks:</span></strong><span> A large portion of the company's loans are collateralized by real estate, making it vulnerable to declines in property values. The allowance for credit losses may not be sufficient to cover actual losses, and commercial real estate loans carry higher risks due to their size and complexity.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Interest Rate and Liquidity Risks:</span></strong><span> The high interest rate environment has decreased the market value of fixed-rate investment securities and loan portfolios. The company relies on the mortgage secondary market for revenue and liquidity, which could be affected by changes in government-sponsored entities' programs.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> The company is exposed to reputational risks, competition from fintech companies, and operational risks associated with third-party vendors. Technological changes, including developments in artificial intelligence, present both opportunities and challenges.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Compliance with extensive federal and state regulations is costly, and changes in these regulations could adversely affect the company's operations. The company is also subject to anti-money laundering statutes and environmental laws, which could increase operational costs.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Climate and Environmental Risks:</span></strong><span> Climate change poses risks to the company's operations and its customers, particularly in Hawaii, where natural disasters could impact the real estate market and the company's financial condition.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies:</span></strong><span> Management emphasizes the importance of maintaining a diversified funding base and managing interest rate risk. The company is focused on expanding its market position through strategic partnerships and enhancing its digital banking capabilities to remain competitive.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/701347/000070134726000021/cpf-20251231.htm\" rel=\"nofollow\" target=\"_blank\">CENTRAL PACIFIC FINANCIAL CORP [ CPF ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:303858f02bf66:0-central-pacific-financial-corp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009909:0",
            "title": "Bank Stocks Suffer Another Plunge on Credit and AI Fears — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Ben Glickman</span></p><p class=\"\"><span>A chorus of concerns about AI and risky lending has bank investors spooked.</span></p><p class=\"\"><span>Shares in big lenders and investment banks sold off sharply Friday after new credit issues emerged and fears of broader economic implications from artificial intelligence weighed on investors.</span></p><p class=\"\"><span>Bank of America, Citigroup and Wells Fargo were all down more than 4%, while Goldman Sachs and Morgan Stanley were down over 6%. JPMorgan Chase, the biggest U.S. bank, fell about 3%.</span></p><p class=\"\"><span>The KBW Nasdaq Bank Index fell more than 5%, on pace for its largest one-day drop since April tariff turmoil. The country's largest lenders tend to be a proxy for investors' beliefs about the economy.</span></p><p class=\"\"><span>The selloff appeared to be a continuation of AI-related concerns that have roiled markets in recent weeks.</span></p><p class=\"\"><span>Payments company Block's decision to lay off 40% of its staff thanks to AI gains further fueled the belief that technological advancements could lead to broad job losses. That came on the heels of a report earlier this week that had investors worried about dramatic economic and job market implications of AI.</span></p><p class=\"\"><span>Consumer lenders, more vulnerable during economic recessions, were among the worst performers Friday including American Express, Capital One and Synchrony Financial.</span></p><p class=\"\"><span>Wobbling confidence in private-credit lenders has further jolted the financial sector. Several high-profile loan losses last year spurred a recent rise in redemption requests from individual investors in private-lending vehicles. On Friday, two publicly traded funds from private lenders said they were cutting their dividends, further adding to concerns.</span></p><p class=\"\"><span>Investors have reacted sharply to other signs more losses could be coming. They found a new example this week in the collapsed U.K. financing company Market Financial Solutions.</span></p><p class=\"\"><span>Market Financial Solutions offered developers and wealthy investors bridge loans on properties in London and elsewhere in the U.K., a specialty market that lets property purchasers act fast before arranging longer-term funding. Investment vehicles set up to make the loans were funded by at least half a dozen global banks and asset managers.</span></p><p class=\"\"><span>But in recent months, the payments stopped going into the designated accounts of the investment vehicles, according to documents in London business court. Two of the investment vehicles entered insolvency proceedings earlier this month.</span></p><p class=\"\"><span>Jefferies slid 10% and Barclays fell 5% on worries about the collateral on loans they made to the company.</span></p><p class=\"\"><span>Weakness in tech stocks and more conservative lending could also dampen what was expected to be a banner year for mergers and acquisitions and initial public offerings, said Ebrahim Poonawala, an analyst at Bank of America Merrill Lynch.</span></p><p class=\"\"><span>\"You came in with a relatively optimistic outlook for the year, and now investors are running into risk factors that weren't necessarily at the top of their lists,\" he said. \"Fear begets fear.\"</span></p><p class=\"\"><span>Write to Ben Glickman at ben.glickman@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009909:0/",
            "pub_date": "2026-02-28 04:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009927:0",
            "title": "The Dow Is on Fire This Year. What Ignited the Gains. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Al Root</span></p><p class=\"\"><span>There is a great rotation going on in the stock market, from potentially AI-disrupted names to companies that make real things, and you can see it in the Dow Jones Industrial Average.</span></p><p class=\"\"><span>So far in 2026, the Dow is leading the way, briefly cracking the 50,000 level. Through midday trading on Friday, the blue-chip index was up about 3% year to date, ahead of the Nasdaq Composite by almost 6 percentage points.</span></p><p class=\"\"><span>That difference shows investor fears and trading trends. The two best stocks in the Dow this year have been Caterpillar and Honeywell, makers of heavy machinery and aerospace parts, among other things. The two worst stocks are Salesforce and IBM, which are suffering as investors fret that Anthropic's AI tools will render software and services worth much less than they were in a pre-AI world.</span></p><p class=\"\"><span>But the Dow's old-economy tilt isn't driving the index's gains — it still has plenty of technology, including Amazon.com, Apple, Microsoft, and Nvidia.</span></p><p class=\"\"><span>The secret of the Dow's success lies in its index construction. It is a price-weighted index, not a market-cap-weighted index like the S&amp;P 500 and Nasdaq. Higher-priced shares count for more in the Dow. More valuable companies count for more in the other two.</span></p><p class=\"\"><span>The market value of the Dow companies is down more than $760 billion so far in 2026. If the index were cap-weighted, it would be down almost 4% year to date.</span></p><p class=\"\"><span>The reality is that tech is much bigger than the 'real' sectors of the economy. When market participants take money out of Microsoft and put it into Caterpillar, Cat stock can't help but soar. Microsoft has lost more than $600 billion in market value. Cat has gained $75 billion.</span></p><p class=\"\"><span>There is too much money chasing real stocks these days. That is great for holders of Cat, Honeywell, and other manufacturers — along with consumer staples stocks — all of which have soared in 2026.</span></p><p class=\"\"><span>The extra money flowing into real things has other impacts. Over the past year, Caterpillar's price-to-earnings ratio has soared from about 16 times earnings estimated over the next 12 months, a discount to the market, to 31 times, a big premium to the S&amp;P 500's 22 times multiple.</span></p><p class=\"\"><span>It is important for investors to be clear-eyed about what is going on. Cat is a high-quality industrial stock. Investors have been encouraged by growth in its power generation business and by the potential for a recovery in some construction markets. There are fundamental reasons for gains. Still, some of the increases come down to too much tech money chasing too few real stocks.</span></p><p class=\"\"><span>The dynamic will continue until it stops. So, industrial investors should pay attention to things such as the State Street SPDR S&amp;P Software &amp; Services ETF to see if the rotation is running out of steam or reversing.</span></p><p class=\"\"><span>Coming into Friday trading, that ETF was down about 18% year to date. Machinery and software stocks aren't always inversely correlated with one another, but they are for now.</span></p><p class=\"\"><span>Write to Al Root at allen.root@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009927:0/",
            "pub_date": "2026-02-28 04:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009954:0",
            "title": "PrimeEnergy Resources Files 8K - Entry Into Definitive Agreement >PNRG",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>PrimeEnergy Resources Corp. (PNRG) filed a Form 8K - Entry Into a Definitive Agreement - with the U.S Securities and Exchange Commission on February 27, 2026.</span></p><p class=\"\"><span>On February 24, 2026, PrimeEnergy Resources Corporation (the \"Company\"), as borrower, entered into a Fifth Amendment (the \"Amendment\") to its Fourth Amended and Restated Credit Agreement, dated as of July 5, 2022 (as previously amended, the \"Credit Agreement\"), with Citibank, N.A., as administrative agent, and the lenders party thereto.</span></p><p class=\"\"><span>The Amendment modifies certain terms of the Company's senior secured revolving credit facility and constitutes the scheduled borrowing base redetermination under the Credit Agreement. Effective as of February 24, 2026, the borrowing base was reaffirmed at $115.0 million.</span></p><p class=\"\"><span>Among other things, the Amendment:</span></p><p class=\"\"><span>● Reduces the applicable margin by 50 basis points at each utilization level. The SOFR loan margin now ranges from 2.75% to 3.75% (previously 3.25% to 4.25%), and the alternate base rate loan margin now ranges from 1.75% to 2.75% (previously 2.25% to 3.25%), in each case, based on borrowing base utilization.</span></p><p class=\"\"><span>● Updates the commodity hedging covenant by increasing the borrowing base utilization threshold in certain provisions from 25% to 30%.</span></p><p class=\"\"><span>● Amends certain lender schedules and makes technical, definitional and conforming changes.</span></p><p class=\"\"><span>● Includes customary post-closing obligations requiring delivery of additional mortgages and title information covering specified percentages of the borrowing base properties.</span></p><p class=\"\"><span>The Amendment also includes customary representations and warranties, reaffirmations of the loan parties' obligations under the loan documents, and releases in favor of the administrative agent and lenders.</span></p><p class=\"\"><span>Except as expressly amended by the Amendment, the terms of the Credit Agreement remain unchanged, including the revolving commitments, collateral package, financial covenants and maturity.</span></p><p class=\"\"><span>As of December 31, 2025 and February 27, 2026, there were no borrowings outstanding under the Credit Agreement, and the full $115.0 million borrowing base was available.</span></p><p class=\"\"><span>The foregoing description of the Amendment does not purport to be complete and is qualified in its entirety by reference to the full text of the Amendment, which is filed herewith as Exhibit 10.1 and incorporated herein by reference.</span></p><p class=\"\"><span>The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/56868/000143774926006089/pnrg20260227_8k.htm</span></p><p class=\"\"><span>Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/56868/000143774926006089/0001437749-26-006089-index.htm</span></p><p class=\"\"><span>Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009954:0/",
            "pub_date": "2026-02-28 05:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009953_20260227009953:0",
            "title": "Nike: 3Q Results to Be Released March 31 to Accommodate for Several Holidays >NKE",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009953_20260227009953:0/",
            "pub_date": "2026-02-28 05:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009934_20260227009934:0",
            "title": "Marine Harvest: Mowi ASA (OSE:MOWI): Board changes",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009934_20260227009934:0/",
            "pub_date": "2026-02-28 05:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSm9wGma:0",
            "title": "MWC 2026: Amdocs Collaborates with Google Cloud to Accelerate AI Adoption and Power the Agentic Telco Contact Center",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The solution combines Google Cloud's Gemini Enterprise for Customer Experience and Amdocs' Cognitive Core with telco-specific intelligence to deliver an end-to-end, generative Agentic Telco Contact Center</span></p><p class=\"\"><span>JERSEY CITY, NJ / ACCESS Newswire / February 27, 2026 / Amdocs </span><span>, a leading provider of software and services to communications and media companies, today announced a collaboration with Google Cloud to help service providers accelerate adoption of AI and transform the telco contact center with an agentic, AI-first approach.</span></p><p class=\"\"><span>The solution combines the conversational intelligence of Google Cloud's Gemini Enterprise for Customer Experience (CX) with the domain precision of Amdocs' Cognitive Core - the generative AI technology foundation of Amdocs' agentic operating system for telco, aOS - creating an end-to-end, telco-specific, generative agentic contact center.</span></p><p class=\"\"><span>This collaboration fuses Google Cloud's AI and cloud leadership, including Google's Gemini models, with Amdocs' telecom DNA and mastery of operational BSS/OSS systems of record. This solution delivers a ready-made, telco-grade AI experience fabric that bridges care, commerce, and operations through a unified, intelligent platform.</span></p><p class=\"\"><span>The solution is built on Amdocs' Cognitive Core, with built-in telco-specific agents and sub-agents, working seamlessly with Gemini Enterprise for CX. It is designed as a turn-key, production-ready solution that enables operators to accelerate time-to-market with a pre-built, certified, domain-specific AI platform deployable on top of any BSS and OSS environment.</span></p><p class=\"\"><span>By combining Google Cloud's AI capabilities with Amdocs' deep telco domain leadership, service providers gain out-of-the-box support for complex, end-to-end telco business processes, with full configurability to align with each operator's commercial policies, care journeys, and operating models. This includes AI-driven automation across billing inquiries, payment issues, disputes and adjustments, roaming issues, plan changes, renewals, and personalized upsell and cross-sell opportunities, all governed through business configuration and tightly embedded with systems of record for true end-to-end execution.</span></p><p class=\"\"><span>Built for telco-grade scale and trust, the solution incorporates strong governance, policy control, and end-to-end traceability, enabling service providers to confidently deploy generative and agentic AI across the telco contact center while maintaining compliance, auditability, and operational integrity.</span></p><p class=\"\"><span>As a result, service providers can lower operational costs, reduce call volumes, and accelerate AI innovation, while delivering faster, more personalized, and more consistent customer experiences that drive higher Net Promoter Scores (NPS) and measurable improvements in customer satisfaction.</span></p><p class=\"\"><span>\"Collaborating with Amdocs enables us to bring Google Cloud's Gemini-powered conversational AI to telcos in a way that's deeply integrated with complex, real-world industry processes,\" said Angelo Libertucci, global head of industry, Telecom, Google Cloud. \"By combining our leadership in AI-driven customer experience with Amdocs' deep domain expertise and systems of record, we're helping empower operators to deploy sophisticated AI agents that not only enhance the customer experience but also drive operational efficiency and measurable business value.\"</span></p><p class=\"\"><span>\"Our expanded integration with Google Cloud brings together our deep, verticalized expertise and telco ontology with the most advanced conversational AI technology in the market,\" said Anthony Goonetilleke, Group President of Technology and Head of Strategy at Amdocs. \"Together, we're helping operators move from reactive, high-cost contact centers to proactive, AI-first engagement models that accelerate business value, reduce operating complexity, and streamline customer journeys.\"</span></p><p class=\"\"><span>Amdocs and Google will be showcasing their joint solutions at Mobile World Congress Barcelona, March 2-5.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Supporting Resources</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Keep up with Amdocs news by visiting the company's website</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Follow us on X, Facebook, LinkedIn, and YouTube</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Amdocs</span></strong></p><p class=\"\"><span>Amdocs helps the world's leading communications and media companies deliver exceptional customer experiences through reliable, efficient, and secure operations at scale. We provide software products and services that embed intelligence into how work runs across business, IT, and network domains - delivering measurable outcomes in customer experience, network performance, cloud modernization, and revenue growth. With our talented people, and more than 40 years of experience running mission-critical systems around the globe, Amdocs runs billions of transactions daily. Our technology is relied on every day, connecting people worldwide and advancing a more inclusive, connected world. Together, we help those who shape the future to make it amazing. Amdocs is listed on the NASDAQ Global Select Market </span><span> and reported revenue of $4.53 billion in fiscal 2025. For more information, visit www.amdocs.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Amdocs' Forward-Looking Statement</span></strong></p><p class=\"\"><span>This press release includes information that constitutes forward-looking statements made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995, including statements about Amdocs' growth and business results in future quarters and years. Although we believe the expectations reflected in such forward-looking statements are based upon reasonable assumptions, we can give no assurance that our expectations will be obtained or that any deviations will not be material. Such statements involve risks and uncertainties that may cause future results to differ from those anticipated. These risks include, but are not limited to, the effects of general macroeconomic conditions, prevailing level of macroeconomic, business and operational uncertainty, including as a result of geopolitical events or other regional events or pandemics, changes to trade policies including tariffs and trade restrictions, as well as the current inflationary environment, and the effects of these conditions on the Company's customers' businesses and levels of business activity, including the effect of the current economic uncertainty and industry pressure on the spending decisions of the Company's customers. Amdocs' ability to grow in the business markets that it serves, Amdocs' ability to successfully integrate acquired businesses, adverse effects of market competition, rapid technological shifts that may render the Company's products and services obsolete, security incidents, including breaches and cyberattacks to our systems and networks and those of our partners or customers, potential loss of a major customer, our ability to develop long-term relationships with our customers, our ability to successfully and effectively implement artificial intelligence and Generative AI in the Company's offerings and operations, and risks associated with operating businesses in the international market. Amdocs may elect to update these forward-looking statements at some point in the future; however, Amdocs specifically disclaims any obligation to do so. These and other risks are discussed at greater length in Amdocs' filings with the Securities and Exchange Commission, including in our Annual Report on Form 20-F for the fiscal year ended September 30, 2025, filed on December 15, 2025, and for the first quarter of fiscal 2026 on February 3, 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contacts</span></strong></p><p class=\"\"><span>Mario Hajiloizi</span></p><p class=\"\"><span>Amdocs Public Relations</span></p><p class=\"\"><span>E-mail: mario.hajiloizi@amdocs.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Amdocs Management Limited</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSm9wGma:0/",
            "pub_date": "2026-02-28 05:00:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009941:0",
            "title": "Eaton Vance Closed-End Funds Release Estimated Sources of Distributions",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BOSTON--(BUSINESS WIRE)--February 27, 2026--</span></p><p class=\"\"><span>The Eaton Vance closed-end funds listed below released today the estimated sources of their February distributions (each a \"Fund\"). This press release is issued as required by the Funds' managed distribution plan (Plan) and an exemptive order received from the U.S. Securities and Exchange Commission. The Board of Trustees has approved the implementation of the Plan to make monthly, as noted below, cash distributions to common shareholders, stated in terms of a fixed amount per common share. This information is sent to you for informational purposes only and is an estimate of the sources of the February distribution. It is not determinative of the tax character of a Fund's distributions for the 2026 calendar year. Shareholders should note that each Fund's total regular distribution amount is subject to change as a result of market conditions or other factors.</span></p><p class=\"\"><span>IMPORTANT DISCLOSURE: You should not draw any conclusions about each Fund's investment performance from the amount of this distribution or from the terms of each Fund's Plan. Each Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur for example, when some or all of the money that you invested in each Fund is paid back to you. A return of capital distribution does not necessarily reflect each Fund's investment performance and should not be confused with \"yield\" or \"income.\" The amounts and sources of distributions reported in this notice are only estimates and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and/or tax reporting purposes will depend upon each Fund's investment experience during the remainder of its fiscal year and February be subject to changes based on tax regulations. Each Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes.</span></p><p class=\"\"><span>The following tables set forth estimates of the sources of each Fund's February distribution and its cumulative distributions paid for its fiscal year through February 28, 2026, and information relating to each Fund's performance based on its net asset value (NAV) for certain periods.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>Eaton Vance Enhanced Equity Income Fund (NYSE: EOI) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.1338 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             September </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.1338          100.0%         $0.6690         100.0% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.1338          100.0%         $0.6690         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         13.28% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 7.63% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   2.56% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            2.54% </span><br/><span> </span><br/><span>Eaton Vance Enhanced Equity Income Fund II (NYSE: EOS) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.1523 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             December </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0108           7.1%          $0.0108          3.5% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.1415          92.9%          $0.2938          96.5% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.1523          100.0%         $0.3046         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         11.34% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 7.54% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   -0.14% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            0.63% </span><br/><span> </span><br/><span>Eaton Vance Risk-Managed Diversified Equity Income Fund (NYSE: ETJ) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.0651 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             December </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.0651          100.0%         $0.1302         100.0% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.0651          100.0%         $0.1302         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         8.68% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 8.07% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   0.63% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            0.67% </span><br/><span> </span><br/><span>Eaton Vance Tax-Advantaged Dividend Income Fund (NYSE: EVT) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.1646 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             October </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0263          16.0%          $0.1067          16.2% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0000           0.0%          $0.0812          12.3% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.1383          84.0%          $0.4705          71.5% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.1646          100.0%         $0.6584         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         11.43% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 7.00% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   7.24% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            1.75% </span><br/><span> </span><br/><span>Eaton Vance Tax-Advantaged Global Dividend Opportunities Fund (NYSE: ETO) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.1733 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             October </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0344          19.8%          $0.1081          15.6% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.1389          80.2%          $0.5851          84.4% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.1733          100.0%         $0.6932         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         12.64% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 6.32% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   7.89% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            1.58% </span><br/><span> </span><br/><span>Eaton Vance Tax-Managed Buy-Write Income Fund (NYSE: ETB) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.1058 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             December </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0011           1.1%          $0.0021          1.0% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0525          49.6%          $0.0721          34.1% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.0552          49.3%          $0.1374          64.9% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.1058          100.0%         $0.2116         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         11.99% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 7.69% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   1.67% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            0.64% </span><br/><span> </span><br/><span>Eaton Vance Tax-Managed Buy-Write Opportunities Fund (NYSE: ETV) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.0993 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             December </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0101          10.1%          $0.0152          7.7% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.0892          89.9%          $0.1834          92.3% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.0993          100.0%         $0.1986         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         11.44% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 7.54% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   1.64% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            0.63% </span><br/><span> </span><br/><span>Eaton Vance Tax-Managed Diversified Equity Income Fund (NYSE: ETY) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.0992 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             October </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.0992          100.0%         $0.3968         100.0% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.0992          100.0%         $0.3968         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         13.35% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 7.60% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   2.01% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            1.90% </span><br/><span> </span><br/><span>Eaton Vance Tax-Managed Global Buy-Write Opportunities Fund (NYSE: ETW) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.0664 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             December </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0052           7.9%          $0.0084          6.3% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.0612          92.1%          $0.0713          53.7% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0531          40.0% </span><br/><span>Total per </span><br/><span> common share       $0.0664          100.0%         $0.1328         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         9.96% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 7.63% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   2.87% </span><br/><span>Cumulative fiscal year to date distribution </span><br/><span> rate as a percentage of NAV as of January 31, </span><br/><span> 2026 (4)                                            0.64% </span><br/><span> </span><br/><span>Eaton Vance Tax-Advantaged Global Dividend Income (NYSE: ETG) </span><br/><span>------------------------------------------------------------------------------ </span><br/><span>Distribution </span><br/><span>Period:          February- 2026 </span><br/><span>Distribution </span><br/><span> Amount per </span><br/><span> Common Share:   $0.1293 </span><br/><span>Distribution </span><br/><span>Frequency:       Monthly </span><br/><span>Fiscal Year </span><br/><span>End:             October </span><br/><span>                                                                   % of the </span><br/><span>                                                                  Cumulative </span><br/><span>                                                   Cumulative    Distributions </span><br/><span>                                                 Distributions      for the </span><br/><span>                    Current       % of Current   for the Fiscal     Fiscal </span><br/><span>Source            Distribution    Distribution    Year-to-Date   Year-to-Date </span><br/><span>Net Investment </span><br/><span> Income             $0.0165          12.8%          $0.0328          6.4% </span><br/><span>Net Realized </span><br/><span> Short-Term </span><br/><span> Capital Gains      $0.0004           0.3%          $0.0031          0.6% </span><br/><span>Net Realized </span><br/><span> Long-Term </span><br/><span> Capital Gains      $0.1124          86.9%          $0.4813          93.0% </span><br/><span>Return of </span><br/><span> Capital or </span><br/><span> Other Capital </span><br/><span> Source(s)          $0.0000           0.0%          $0.0000          0.0% </span><br/><span>Total per </span><br/><span> common share       $0.1293          100.0%         $0.5172         100.0% </span><br/><span> </span><br/><span>Average annual total return at NAV for the </span><br/><span> 5-year period ended on January 31, 2026 (1)         13.40% </span><br/><span>Annualized current distribution rate expressed </span><br/><span> as a percentage of NAV as of January 31, 2026 </span><br/><span> (2)                                                 6.29% </span><br/><span>Cumulative total return at NAV for the fiscal </span><br/><span> year through January 31, 2026 (3)                   8.05% </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009941:0/",
            "pub_date": "2026-02-28 05:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN16E:0",
            "title": "Wall St notches monthly declines on combined AI, tariff, geopolitical uncertainty",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Financials fall on worries over lending standards</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Fintech company Block surges on plan to cut 4,000 jobs on AI bet</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Netflix climbs after ending Warner Bros Discovery pursuit</span></li></ul></span></div><span><p class=\"\"><span>By Stephen Culp and Ragini Mathur</span></p><p class=\"\"><span>    Financial and tech stocks were hit hard by a handful of persistent investor worries on Friday, putting U.S. stocks on track for their largest monthly percentage decline in a year.</span></p><p class=\"\"><span>All three major indexes ended decisively lower and posted steep weekly declines, with the blue-chip Dow logging its biggest weekly drop since November. The selloff was driven by uncertainty over costs and disruption related to artificial intelligence, revived tariff uncertainties and simmering geopolitical tensions.</span></p><p class=\"\"><span>\"To wrap up the month of February, we were reminded there are still some cracks out there,\" said Ryan Detrick, chief market strategist at Carson Group in Omaha, Nebraska. \"Adding to the day's weakness was the hotter inflation data, potentially pushing back on the idea of a dovish Fed later this year.\"</span></p><p class=\"\"><span>\"It's been a rough go in February, but corporate America is looking at over a 14% gain in earnings in the fourth quarter,\" Detrick added. \"The reality is that earnings drive long-term stock gains and this was a very impressive earnings season.\"</span></p><p class=\"\"><span>Financial stocks </span><span> slid after worries of contagion in the sector after reports that Barclays, Jefferies </span><span>, Wells Fargo </span><span> and other banks face potential losses related to the collapse of UK mortgage provider Market Financial Solutions Ltd, amid broader concerns about lending standards. Wells Fargo, Jefferies and U.S.-listed shares of Barclays </span><span> ended sharply lower.</span></p><p class=\"\"><span>Tech shares </span><span> also continued to weigh on the indexes as lingering fears related to AI dragged chips </span><span> and software lower on the day.</span></p><p class=\"\"><span>Defensive sectors such as consumer staples </span><span>, healthcare </span><span> and utilities </span><span> were the session's clear outperformers.</span></p><p class=\"\"><span>\"This is a classic risk-off environment where the pure defensive areas are finding some strength while the market is turning its head on some of the more cyclical growth areas that are clearly lagging,\" Detrick said.  </span></p><p class=\"\"><span>On the economics front, a hotter-than-expected Producer Price Index reading fortified expectations that the U.S. Federal Reserve is unlikely to cut its key interest rate in the near term.</span></p><p class=\"\"><span>According to preliminary data, the S&amp;P 500 </span><span> lost 30.49 points, or 0.44%, to end at 6,878.91 points, while the Nasdaq Composite </span><span> lost 204.74 points, or 0.92%, to 22,673.65. The Dow Jones Industrial Average </span><span> fell 521.69 points, or 1.05%, to 48,977.51.</span></p><p class=\"\"><span>Nvidia </span><span> extended the previous session's drop despite solid earnings, a sign of persistent unease over emergent AI technology.</span></p><p class=\"\"><span>Zscaler </span><span> plunged after the cloud security firm reported a wider net loss in the second quarter. </span></p><p class=\"\"><span>Netflix </span><span> jumped as investors cheered its decision to exit the fight for Warner Bros Discovery </span><span>, which dropped on the news. Paramount Skydance </span><span>, WBD's likely buyer, closed sharply higher.</span></p><p class=\"\"><span>Block </span><span> surged after the payments firm said it would axe nearly half its workforce, as part of its effort to embed AI across operations.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN16E:0-wall-st-notches-monthly-declines-on-combined-ai-tariff-geopolitical-uncertainty/",
            "pub_date": "2026-02-28 05:00:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_AQN2LO5LL:0",
            "title": "BRIEF-Toronto Stock Exchange unofficially closes down",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>TORONTO, Feb 27 (Reuters) - Toronto Stock Exchange S&amp;P/TSX composite index </span><span>:</span></p><p class=\"\"><span>* Unofficially closes down 161.97 points, or 0.47 percent, at 34,339.99.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_AQN2LO5LL:0-brief-toronto-stock-exchange-unofficially-closes-down/",
            "pub_date": "2026-02-28 05:00:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2947777:0",
            "title": "GLP: FY 2025 delivered steady margins and growth, driven by GDSO and strategic acquisitions",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 and FY 2025 saw stable product margins and gross profit, with GDSO as the main contributor. Recent acquisitions expanded terminal capacity, while leverage remained moderate and distribution growth continued. Market conditions and site count shifts influenced segment results.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2947777-48efa55000738dd511b5b877e2d5c783\" target=\"_blank\">Global Partners LP [GLP] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2947777:0-glp-fy-2025-delivered-steady-margins-and-growth-driven-by-gdso-and-strategic-acquisitions/",
            "pub_date": "2026-02-28 04:52:58",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2IN:0",
            "title": "Goldman Sachs raises copper price forecast to $12,200 by end-2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Goldman Sachs on Friday raised its copper price forecasts, projecting prices to reach $12,200 per metric ton by the end of 2026, up from a previous estimate of $11,000.</span></p><p class=\"\"><span>The bank also lifted its outlook for the second half of 2027, now expecting prices to reach $12,000, compared with an earlier forecast of  $11,000.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2IN:0-goldman-sachs-raises-copper-price-forecast-to-12-200-by-end-2026/",
            "pub_date": "2026-02-28 04:53:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN16U:0",
            "title": "Trump says he is directing federal agencies to cease use of Anthropic technology",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>U.S. President Donald Trump on Friday said he was directing every federal agency to immediately cease all use of Anthropic's technology, adding there would be a six-month phase out for agencies such as the Defense Department who use the company's products.</span></p><p class=\"\"><span>\"I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology. We don’t need it, we don’t want it, and will not do business with them again!\" Trump said in a post on Truth Social.</span></p><p class=\"\"><span>Trump's directive comes amid a feud between the Pentagon and top artificial intelligence lab Anthropic over concerns about how the military could use AI at war.</span></p><p class=\"\"><span>Spokespeople for Anthropic did not immediately respond to a request for comment.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN16U:0-trump-says-he-is-directing-federal-agencies-to-cease-use-of-anthropic-technology/",
            "pub_date": "2026-02-28 04:56:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009774:0",
            "title": "Jobs Data, Earnings From Broadcom and Target: What to Watch Next Week — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Xavier Martinez</span></p><p class=\"\"><span>A heavy slate of economic data will headline the first week of March, with fresh updates on manufacturing and labor. Investors will also weigh tech and retail earnings from the likes of Broadcom and Target. The week culminates in Friday's highly anticipated February jobs report.</span></p><p class=\"\"><span>Monday, March 2</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Earnings: Norwegian Cruise Line</span></li><li class=\"listItem-bmN0_SHH\"><span>Economic data: The Institute for Supply Management will release February's manufacturing purchasing managers index.</span></li><li class=\"listItem-bmN0_SHH\"><span>Events: Apple's three-day event begins. The technology company is expected to unveil several new products throughout the week.</span></li><li class=\"listItem-bmN0_SHH\"><span>China: The People's Bank of China is reducing the risk reserve that banks are required to set aside on certain foreign-exchange contracts. The move, announced Friday, is set to take effect Monday and is viewed as a way for the central bank to combat a recent rally in the yuan.</span></li><li class=\"listItem-bmN0_SHH\"><span>Courts: The Justice Department's antitrust trial against Live Nation kicks off. The DOJ is seeking a full breakup of the Live Nation-Ticketmaster merger, alleging an illegal monopoly over the live-music industry.</span></li></ul><p class=\"\"><span>Tuesday, March 3</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Earnings: Target, Progressive, Crowdstrike, AutoZone, Best Buy</span></li></ul><p class=\"\"><span>Wednesday, March 4</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Earnings: Broadcom, Abercrombie &amp; Fitch, Bath &amp; Body Works, Okta</span></li><li class=\"listItem-bmN0_SHH\"><span>Economic data: ADP will release its national employment report for February. The Institute for Supply Management will release February's business-services report. The Fed's beige book, which gives a snapshot of regional economies, is also due.</span></li><li class=\"listItem-bmN0_SHH\"><span>Events: Major tech companies are expected to meet with President Trump at the White House to discuss data-center power costs.</span></li></ul><p class=\"\"><span>Thursday, March 5</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Earnings: Kroger, Costco Wholesale, Marvell Technology, Gap</span></li><li class=\"listItem-bmN0_SHH\"><span>Economic data: The Bureau of Labor Statistics is set to release preliminary productivity and costs data for the fourth quarter of 2025. Weekly initial jobless claims are also due.</span></li></ul><p class=\"\"><span>Friday, March 6</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Economic data: The BLS will release the U.S. employment report for February at 8:30 a.m. ET. The Census Bureau is due to release December's manufacturing and trade inventories and sales estimates, along with its advance monthly retail trade report for January.</span></li></ul><p class=\"\"><span>This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009774:0/",
            "pub_date": "2026-02-28 04:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:965459bb48ab2:0",
            "title": "United States Oil Fund, LP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The United States Oil Fund, LP (USO), a Delaware limited partnership operating as a commodity pool, has released its annual Form 10-K report. The report provides a comprehensive overview of USO's financial performance, business operations, strategic initiatives, and the challenges and risks faced during the fiscal year. USO's primary objective is to reflect the daily changes in the spot price of light, sweet crude oil, plus interest earned on collateral holdings, less expenses.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Asset Value Per Share:</span></strong><span> $69.10, decreased from $75.45 at the end of the previous year, reflecting a decrease of approximately 8.42% over the year.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Average Daily Total Net Assets:</span></strong><span> $979.96 million, decreased from $1,317.32 million in the previous year, indicating a reduction in asset base.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Dividend and Interest Income Earned on Treasuries, Cash and/or Cash Equivalents:</span></strong><span> $38.44 million, down from $62.87 million in the previous year, reflecting lower average interest rates.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Fee:</span></strong><span> $4.41 million, decreased from $5.92 million in the previous year, due to a reduction in total net assets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Fees and Other Expenses Excluding Management Fees:</span></strong><span> $4.05 million, down from $4.88 million in the previous year, primarily due to a decrease in tax reporting and professional fees.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Commissions Accrued to Brokers:</span></strong><span> $1.49 million, slightly decreased from $1.53 million in the previous year, reflecting fewer Oil Futures Contracts being held and traded.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Business Overview:</span></strong><span> USO operates as a commodity pool, issuing limited partnership interests traded on the NYSE Arca. Its investment objective is to reflect the daily changes in the spot price of light, sweet crude oil, plus interest earned on collateral holdings, less expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Investment Strategy:</span></strong><span> USO employs a 'neutral' investment strategy to track changes in the price of the Benchmark Oil Futures Contract, allowing investors to gain exposure to the crude oil market in a cost-effective manner. The strategy involves investing in futures contracts and other oil-related investments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Structure:</span></strong><span> USO is managed by United States Commodity Funds LLC (USCF), which oversees the purchase and sale of USO's shares, evaluates credit risk, and manages investments. USCF is a wholly-owned subsidiary of USCF Investments, Inc., which is part of The Marygold Companies, Inc.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Portfolio Management:</span></strong><span> USO primarily invests in futures contracts for light, sweet crude oil and other petroleum-based fuels. It supports these investments by holding short-term U.S. obligations, cash, and cash equivalents.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Conditions and Adjustments:</span></strong><span> Following market volatility in 2020, USO adjusted its investment parameters and transitioned back to primarily investing in the Benchmark Oil Futures Contract starting September 2023. USO maintains flexibility to invest in other oil futures and related investments based on market conditions and regulatory requirements.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Roll Strategy:</span></strong><span> USO rolls its positions in oil futures contracts over a five-day period each month to avoid contract expiration and delivery of the underlying commodity. This strategy was adjusted from a ten-day roll period to a five-day roll period starting January 2026.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Service Providers:</span></strong><span> USO employs several service providers, including The Bank of New York Mellon for custodial and administrative services, ALPS Distributors as the marketing agent, and multiple futures commission merchants (FCMs) for executing and clearing trades.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Compliance:</span></strong><span> USO is subject to accountability levels and position limits set by exchanges like NYMEX and ICE Futures. It adheres to these regulations to manage its investment positions effectively.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> USO plans to continue its investment strategy of tracking the Benchmark Oil Futures Contract while adapting to market conditions, regulatory changes, and risk mitigation measures to achieve its investment objectives.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives:</span></strong><span> USO transitioned its investment portfolio to primarily invest in the Benchmark Oil Futures Contract, consistent with its strategy prior to the Spring of 2020. This transition was completed between September 2023 and January 2024. USO maintains the ability to invest in Oil Futures Contracts beyond the Benchmark Oil Futures Contract and Other Oil-Related Investments to meet its investment objectives, considering market conditions, regulatory requirements, and risk mitigation measures.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> USO has not leveraged its assets through borrowings and does not intend to do so. It meets its liquidity needs from the proceeds of the sale of its investments and from Treasuries, cash, and cash equivalents. USO's primary contractual obligations include management fees to USCF, brokerage fees, and other operational expenses. USO has an unlimited number of shares that can be issued in the form of Creation Baskets, and it has been responsible for its expenses since March 23, 2007.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> USO plans to continue managing its portfolio to closely track the daily changes in the price of the Benchmark Oil Futures Contract. It will maintain adequate liquidity to meet margin and collateral requirements and avoid becoming leveraged. USO may invest in additional Other Oil-Related Investments if market conditions, regulatory requirements, or risk mitigation measures necessitate such actions to meet its investment objectives.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> Price volatility in oil futures contracts can lead to substantial losses. Factors such as geopolitical conflicts, natural disasters, and pandemics can cause significant fluctuations in crude oil prices.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> USO's investment strategy is not actively managed, which means it may not close out positions even if they are declining in value. This could lead to losses if market conditions change rapidly.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> USO is subject to extensive regulation under federal commodities and securities laws. Changes in these regulations could adversely affect USO's ability to meet its investment objectives.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Emerging Risks:</span></strong><span> The impact of climate change and greenhouse gas restrictions could negatively affect USO's investment returns. Additionally, cyber-attacks pose operational and information security risks.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Tax Risks:</span></strong><span> Investors may face tax liabilities that exceed distributions, and changes in tax laws could have adverse effects.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>OTC Contract Risks:</span></strong><span> USO is exposed to credit risk with counterparties to OTC contracts, which may result in significant losses if a counterparty defaults.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies:</span></strong><span> USO has implemented risk mitigation measures, such as diversifying its investments beyond the Benchmark Oil Futures Contract when necessary. The company also monitors its exposure to accountability levels and position limits to manage tracking errors.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risk Disclosures:</span></strong><span> USO is exposed to market risks related to interest rate fluctuations, which can affect the value of its investments in Treasuries and cash equivalents. The company also faces risks from non-concurrent trading hours between the NYSE Arca and futures exchanges, which can lead to discrepancies between the market price and NAV of USO shares.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1327068/000110465926021501/uso-20251231x10k.htm\" rel=\"nofollow\" target=\"_blank\">United States Oil Fund, LP [ USO ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:965459bb48ab2:0-united-states-oil-fund-lp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:45:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:99176b32c277c:0",
            "title": "United States Natural Gas Fund, LP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The United States Natural Gas Fund, LP (UNG), a Delaware limited partnership operating as a commodity pool, has released its annual Form 10-K report. The report provides a comprehensive overview of the fund's financial performance, business operations, strategic initiatives, and the challenges it faces in the natural gas market. UNG's primary objective is to track the daily changes in the price of natural gas futures contracts, specifically those delivered at the Henry Hub, Louisiana. The fund's shares are traded on the NYSE Arca, offering investors a cost-effective way to gain exposure to the natural gas market.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> $34.23 million, reflecting a decrease from the previous year due to lower average daily total net assets and reduced interest income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income per limited partner share:</span></strong><span> $1.00, indicating a positive return despite a challenging market environment.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Income (Loss):</span></strong><span> $40.33 million, driven by realized gains on closed commodity futures contracts and dividend income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Expenses:</span></strong><span> $6.10 million, primarily composed of management fees, professional fees, and brokerage commissions.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Business Overview:</span></strong><span> The United States Natural Gas Fund, LP (UNG) operates as a commodity pool, issuing limited partnership interests traded on the NYSE Arca. Its investment objective is to track the daily changes in the price of natural gas futures contracts, specifically those delivered at the Henry Hub, Louisiana.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Investment Strategy:</span></strong><span> UNG employs a 'neutral' investment strategy to track changes in the price of the Benchmark Futures Contract, regardless of market direction. This strategy allows investors to gain exposure to the natural gas market in a cost-effective manner.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Structure:</span></strong><span> UNG's operations are managed by its general partner, United States Commodity Funds LLC (USCF), which oversees the purchase and sale of UNG’s shares, manages investments, and evaluates credit risk.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Natural Gas Market Dynamics:</span></strong><span> The price of natural gas is influenced by supply and demand conditions in North America, particularly at the U.S. Gulf Coast. Factors such as economic activity and weather significantly impact demand.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Futures Contracts:</span></strong><span> UNG primarily invests in futures contracts for natural gas traded on the NYMEX and ICE Futures. These contracts are agreements to buy or sell a commodity at a future date at a predetermined price.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Position Management:</span></strong><span> UNG manages its positions in futures contracts by rolling its positions over a four-day period each month, transitioning from the near month contract to the next month contract.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Service Providers:</span></strong><span> Key service providers include RBC Capital Markets LLC, Marex Capital Markets, Inc., Macquarie Futures USA LLC, and ADM Investor Services, Inc., which act as futures commission merchants for UNG.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Compliance:</span></strong><span> UNG is subject to accountability levels and position limits set by exchanges like NYMEX and ICE Futures, which monitor and may require adjustments to UNG's positions if limits are exceeded.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> USCF anticipates that market conditions will continue to allow UNG to track the price of natural gas effectively, with potential adjustments in investment strategies to maintain liquidity and favorable pricing.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Liquidity Management:</span></strong><span> UNG has focused on maintaining liquidity by ensuring that a significant portion of its net assets is held in cash and cash equivalents. This strategy supports its trading activities in Natural Gas Interests without leveraging its assets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Share Issuance:</span></strong><span> UNG has registered an unlimited number of shares to facilitate the issuance of Creation Baskets, which supports its liquidity and capital management strategy.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> UNG has not utilized borrowings or other lines of credit, instead relying on the proceeds from the sale of its investments and the Treasuries, cash, and cash equivalents it holds. The fund has also implemented a 1-for-4 reverse share split to adjust its share structure, which took effect on January 23, 2024. This reverse split was aimed at increasing the per-share NAV and potentially enhancing the marketability of its shares.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Expense Management:</span></strong><span> UNG has been actively managing its expenses, which include management fees, brokerage fees, and other operational costs, to ensure they do not exceed the income generated from its investments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> UNG plans to continue its strategy of not leveraging its assets and maintaining adequate liquidity to meet its margin and collateral requirements. The fund anticipates that interest rates may continue to stagnate, which could impact its income from cash and cash equivalents. UNG also intends to explore opportunities to invest in Natural Gas Interests while managing regulatory requirements and market conditions. The fund's future capital management activities will focus on maintaining its investment objective and ensuring that its expenses remain lower than the income earned from its investments.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The price of natural gas is influenced by a variety of factors, including economic conditions, geopolitical events, and natural disasters. These factors can lead to significant price volatility, potentially resulting in substantial losses for investors.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> UNG's investment strategy is not actively managed, which means it may not respond to declining market conditions except in specific circumstances. This could lead to tracking errors and potential losses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> UNG is subject to extensive regulation under U.S. federal commodities and securities laws. Changes in these regulations, such as the implementation of new position limits or margin requirements, could adversely affect UNG's ability to meet its investment objectives.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Tax Risks:</span></strong><span> Investors may face tax liabilities that exceed the amount of distributions received, and changes in tax laws could have negative consequences for UNG and its investors.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>OTC Contract Risks:</span></strong><span> UNG is exposed to credit risk with respect to counterparties to OTC contracts, which may not be as secure as exchange-traded contracts.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Emerging Risks:</span></strong><span> Cybersecurity threats pose a risk to UNG's operations, potentially leading to financial losses and operational disruptions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies:</span></strong><span> To address these risks, UNG may invest in other natural gas-related investments to maintain liquidity and meet its investment objectives. The company also emphasizes the importance of maintaining adequate internal controls and compliance with regulatory requirements to mitigate potential risks.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1376227/000110465926021507/ung-20251231x10k.htm\" rel=\"nofollow\" target=\"_blank\">United States Natural Gas Fund, LP [ UNG ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:99176b32c277c:0-united-states-natural-gas-fund-lp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:45:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:508516048e8fc:0",
            "title": "United States 12 Month Oil Fund, LP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The United States 12 Month Oil Fund, LP (USL), a commodity pool investing in oil futures and related investments, has released its annual Form 10-K report. The report provides a comprehensive overview of the fund's financial performance, business operations, strategic initiatives, and the challenges it faces in the volatile oil market. Managed by United States Commodity Funds LLC (USCF), USL aims to reflect the daily percentage changes in the spot price of light, sweet crude oil by investing in a series of futures contracts.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> $(5.76) million, reflecting a significant decrease compared to the previous year, primarily due to losses on trading of commodity futures contracts.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income Per Share:</span></strong><span> $(4.70), indicating a substantial decline from the prior year's performance, driven by realized and unrealized losses on commodity futures contracts.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Investment Objective:</span></strong><span> USL aims to reflect the daily percentage changes in the spot price of light, sweet crude oil by investing in a series of futures contracts. The fund's strategy is designed to track the average daily percentage change in the price of the Benchmark Oil Futures Contracts over a 30-day period within a plus/minus ten percent range.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Strategy:</span></strong><span> USL employs a neutral investment strategy, focusing on futures contracts for light, sweet crude oil and other petroleum-based fuels. The fund does not take physical delivery of oil but instead rolls its positions monthly to maintain exposure to the oil market.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Tracking:</span></strong><span> USL's shares are designed to closely track the daily changes in the spot price of light, sweet crude oil, with the expectation that market arbitrage opportunities will align the share price with the net asset value (NAV).</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Commodity Pool Structure:</span></strong><span> USL operates as a commodity pool, issuing limited partnership interests traded on the NYSE Arca. The fund is managed by United States Commodity Funds LLC (USCF), which has full management control.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Compliance:</span></strong><span> USL invests in Oil Futures Contracts and Other Oil-Related Investments to comply with regulatory requirements, risk mitigation measures, and liquidity needs. The fund is subject to accountability levels and position limits set by exchanges like NYMEX and ICE Futures.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Service Providers:</span></strong><span> USL utilizes several service providers, including BNY Mellon for custodial and administrative services, ALPS Distributors as the marketing agent, and multiple futures commission merchants (FCMs) for executing and clearing trades.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Risk Management:</span></strong><span> The fund's strategy includes managing credit risk with counterparties and ensuring liquidity to meet margin and collateral requirements. USL does not leverage its assets through borrowings.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> USL plans to continue its investment strategy of tracking the Benchmark Oil Futures Contracts and maintaining its position in the oil market. The fund anticipates that market conditions and regulatory changes will continue to influence its investment decisions.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives:</span></strong><span> USL's strategic initiatives focus on maintaining liquidity through the sale of investments and holding Treasuries, cash, and cash equivalents. The fund aims to manage its portfolio to closely track the daily changes in the average prices of Benchmark Oil Futures Contracts, ensuring that the average daily change in USL’s per share NAV is within a range of 90% to 110% of the average daily change in the prices of the Benchmark Oil Futures Contracts over any rolling period of 30 valuation days.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> USL does not anticipate using borrowings or other lines of credit to meet its obligations. Instead, it relies on the proceeds from the sale of its investments and the Treasuries, cash, and cash equivalents it holds. The fund has not leveraged its assets and does not intend to do so, maintaining adequate liquidity to meet margin and collateral requirements. USL's capital management activities include the issuance and redemption of shares, with 100,000 shares added and 300,000 shares redeemed during the year ended December 31, 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> USL plans to continue its strategy of investing in Oil Futures Contracts and Other Oil-Related Investments to meet its investment objective without leveraging its assets. The fund anticipates that interest rates may continue to stagnate, potentially allowing it to outperform its benchmark as long as interest earned exceeds fees and expenses. USL will also continue to manage its portfolio to ensure that it can meet its liquidity needs and maintain its investment strategy.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The NAV of USL's shares is directly linked to the volatile prices of oil futures, which can be affected by global economic conditions, geopolitical events, and natural disasters. Price volatility may lead to substantial losses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Correlation Risk:</span></strong><span> There is a risk that USL's performance may not closely track the spot price of crude oil, affecting its effectiveness as a hedge.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> USL is subject to position limits and accountability levels set by exchanges, which could impact its ability to meet investment objectives. Changes in U.S. federal income tax laws could also adversely affect USL.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> USL's reliance on FCMs and the potential for their failure could result in significant losses. Cybersecurity threats pose additional operational risks.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>OTC Contract Risks:</span></strong><span> USL is exposed to credit risk with counterparties in OTC contracts, which are less regulated than exchange-traded contracts.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Tax Risks:</span></strong><span> Investors may face tax liabilities exceeding distributions, and USL could be treated as a corporation for tax purposes, reducing share value.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Liquidity Risks:</span></strong><span> Illiquid markets could hinder USL's ability to liquidate positions at favorable prices, leading to potential losses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management's Discussion and Analysis:</span></strong><span> Management acknowledges the challenges posed by market volatility and regulatory constraints. Strategies include diversifying investments within permitted assets and maintaining liquidity to meet margin requirements. USL does not actively manage its investments but follows a neutral strategy to track the Benchmark Oil Futures Contracts.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Quantitative and Qualitative Disclosures About Market Risk:</span></strong><span> USL is exposed to interest rate risk, which may affect the value of its Treasury investments. Inflation could erode the value of cash and bonds, impacting returns. The company also faces risks from trading in international markets, including currency exchange fluctuations and political instability.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1405528/000110465926021509/usl-20251231x10k.htm\" rel=\"nofollow\" target=\"_blank\">United States 12 Month Oil Fund, LP [ USL ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:508516048e8fc:0-united-states-12-month-oil-fund-lp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:45:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:49b3034cf5a9e:0",
            "title": "COASTAL FINANCIAL CORP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Coastal Financial Corporation, a registered bank holding company with subsidiaries Coastal Community Bank and Arlington Olympic LLC, has released its 2025 Form 10-K report. The company, which operates primarily in the Puget Sound region of Washington State, focuses on community banking, banking as a service (BaaS) through its CCBX segment, and treasury &amp; administration. The report highlights significant financial growth, strategic initiatives, and the challenges faced by the company in the past year.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Revenue:</span></strong><span> $429.6 million, driven by growth in CCBX loans and increased partner activity.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> $47.0 million, an increase from the previous year primarily due to higher net interest income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Diluted EPS:</span></strong><span> $3.06, a decrease from the prior year due to a capital raise that increased the number of shares outstanding.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Interest Income:</span></strong><span> $310.1 million, up 13.6% from the previous year, largely due to growth in CCBX loans and a decrease in interest expense.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Provision for Credit Losses:</span></strong><span> $189.4 million, a decrease from the previous year due to improved performance of the CCBX portfolio and focus on higher quality loans.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Noninterest Income:</span></strong><span> $231.6 million, a decrease of 24.9% from the previous year, primarily due to lower BaaS indemnification income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Noninterest Expense:</span></strong><span> $287.8 million, an increase of 16.8% from the previous year, driven by higher salaries, data processing, and software licenses related to growth and technology investments.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Company Overview:</span></strong><span> Coastal Financial Corporation operates primarily in the Puget Sound region, focusing on community banking, BaaS through its CCBX segment, and treasury &amp; administration.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Segments:</span></strong><span> The company operates through three reportable segments: the community bank, CCBX, and treasury &amp; administration. The community bank provides a wide range of banking products and services to consumers and small to medium-sized businesses, while the CCBX segment offers BaaS, enabling digital financial service partners to provide banking services to their customers.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> Coastal Financial Corporation's primary market is the Puget Sound region, where it is the largest community bank by deposit market share in Snohomish County.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>CCBX Segment Growth:</span></strong><span> As of December 31, 2025, the CCBX segment had 28 partnerships, expanding the company's addressable market across the United States through digital financial services partners.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Lending Activities:</span></strong><span> The company focuses on commercial lending in its community bank and consumer and business lending in CCBX. Key loan categories include commercial and industrial loans, commercial real estate loans, construction and development loans, residential real estate loans, and consumer loans.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Commercial Real Estate Loans:</span></strong><span> As of December 31, 2025, the company had $1.29 billion in commercial real estate loans, representing 34.2% of total loans.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Consumer Loans:</span></strong><span> The company had $1.33 billion in consumer loans, representing 35.4% of total loans, primarily originated through CCBX partners.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Deposit Products:</span></strong><span> Coastal Financial Corporation offers a full range of deposit products, emphasizing relationship banking with a high percentage of loan customers having deposit relationships.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Community Engagement:</span></strong><span> In 2025, Coastal Community Bank supported 157 non-profit organizations and awarded $100,000 in community impact grants.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Human Capital:</span></strong><span> As of December 31, 2025, the company had 483 full-time equivalent employees, focusing on attracting, retaining, and developing talent through a strong, positive culture and a commitment to pay equity and employee well-being.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company plans to continue refining its CCBX partnerships by focusing on larger, established partners while considering promising smaller partners. It aims to maintain a disciplined approach to growth within its core markets.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>CCBX Portfolio Optimization:</span></strong><span> The company has focused on optimizing its CCBX portfolio by managing growth, credit quality, and partner limits. This includes selling $6.64 billion in CCBX loans to originating partners, generating off-balance sheet fee income and reducing balance sheet risk.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Technology and Risk Management Investments:</span></strong><span> The company is investing in technology and risk management to support growth in its CCBX segment and community bank operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The company increased its total assets by $620.2 million, primarily through a $263.0 million increase in loans receivable and a $286.7 million increase in interest-earning deposits with other banks. The company maintains a strong capital position with total shareholders' equity of $491.0 million as of December 31, 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company plans to continue its strategy of originating higher quality CCBX loans, improving the performance of the CCBX portfolio, and reducing the allowance for credit losses. The company also aims to enhance its revenue stream by retaining a portion of transaction processing fees on sold credit card receivables, providing ongoing income without additional balance sheet risk. Furthermore, the company is committed to investing in technology to automate processes and support scalable growth.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Economic Conditions:</span></strong><span> The company faces significant risks related to economic conditions in its market areas, which could impact earnings and increase credit risk.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Interest Rate Fluctuations:</span></strong><span> Interest rate fluctuations pose a risk to earnings, particularly with the company's reliance on net interest income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Credit Losses:</span></strong><span> The allowance for credit losses may be insufficient, especially with the increased lending through CCBX partners, exposing the company to compliance and credit risks.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Competitive Landscape:</span></strong><span> The competitive landscape for BaaS is intensifying, with potential partners seeking to reduce reliance on third-party banks, which could affect the company's growth and revenue.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> The company's dependency on information technology and third-party service providers heightens operational risks, with potential system failures or cybersecurity threats posing significant threats.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Regulatory risks are substantial, with intense scrutiny on compliance with anti-money laundering statutes and the Bank Secrecy Act. Changes in U.S. trade policies and tax laws could also adversely impact the company's operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Expansion Strategy:</span></strong><span> The company's expansion strategy, particularly in the BaaS segment, may face regulatory challenges, and any failure to comply with regulatory requirements could result in enforcement actions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies:</span></strong><span> Management is focusing on effective liquidity management and maintaining a robust allowance for credit losses to mitigate these risks. Strategic initiatives include enhancing risk management practices and exploring growth opportunities in the BaaS segment while ensuring compliance with evolving regulatory standards.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The company is exposed to market risks, particularly interest rate risk, which could compress net interest margins if funding costs increase more rapidly than yields on interest-earning assets. The uncertainty in future interest rate changes, influenced by factors such as inflation and economic growth, remains a significant concern.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1437958/000143795826000013/ck1437958-20251231.htm\" rel=\"nofollow\" target=\"_blank\">COASTAL FINANCIAL CORP [ CCB ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:49b3034cf5a9e:0-coastal-financial-corp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:45:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN135:0",
            "title": "LatAm FX mixed, stocks down as risk appetite wanes; assets set for monthly gains",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Latam FX set for longest win streak since 2009</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Argentina stocks set for biggest monthly drop since 2024</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Brazil's inflation overshoots forecasts in mid-February</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Colombia to propose 50% reciprocal tariff on some Ecuadorean goods</span></li></ul></span></div><span><p class=\"\"><span>By Pranav Kashyap and Purvi Agarwal</span></p><p class=\"\"><span>    Latin American currencies were mixed on Friday while stocks moved broadly lower as risk appetite waned globally, though MSCI's indexes tracking both assets were poised for monthly gains.</span></p><p class=\"\"><span>The currencies index for the region (.MILA00000CUS) was little changed, set for its seventh month of gains, its longest monthly winning streak since 2009.</span></p><p class=\"\"><span>The stocks gauge (.MILA00000PUS) was on track to end its second straight month in the green.</span></p><p class=\"\"><span>However, the equity gauge was up only about 4% this month, after surging 15% in January, while the currencies index gained roughly 2%, compared with the previous month's 5% advance.</span></p><p class=\"\"><span>Brazil's real </span><span> reversed declines to inch 0.1% higher. Data showed annual inflation cooled to 4.1%, from 4.5% in January, but was above the 3.8% expected by analysts.</span></p><p class=\"\"><span>However, the print is not expected to prevent the country's central bank from kicking off a monetary policy easing cycle in March, as indicated by policymakers recently. </span></p><p class=\"\"><span>This would be the central bank's first interest rate cut since 2024 if the expectations come true, bringing the Selic rate down from a near two-decade high of 15%.</span></p><p class=\"\"><span>\"Although this reading doesn't show a worsening in inflation year-on-year, it certainly shows that stickiness may be higher in services and core measures, in line with our scenario,\" said Citigroup analysts led by Ernesto Revilla.</span></p><p class=\"\"><span>\"This data strengthens our more hawkish monetary policy call of a 25-basis-point cut in the March meeting.\"</span></p><p class=\"\"><span>EQUITIES DIP SLIGHTLY</span></p><p class=\"\"><span>Most equities in the region were lower on the day as global risk appetite faltered.</span></p><p class=\"\"><span>Sao Paulo stocks </span><span> fell 1.2%, with some financial firms including Itau Unibanco </span><span> falling 2%, tracking declines in global financial stocks.</span></p><p class=\"\"><span>Mexican stocks </span><span> were the only outliers, up 0.4%.</span></p><p class=\"\"><span>AI chipmaker Nvidia's results on Wednesday failed to provide the boost some investors had bet on, with doubts on the AI-fueled rally and stretched tech valuations taking center stage.</span></p><p class=\"\"><span>Colombian equities </span><span> sank 0.8%, setting them up for their worst week since March 2023. The index has shed nearly 7% over the last three sessions as trade tensions with Ecuador intensify. </span></p><p class=\"\"><span>Elsewhere, Chilean stocks </span><span> slipped 1.6% and were set to break a half-year monthly winning streak, while the peso </span><span> fell 0.7%. The local unemployment rate rose to 8.3% in the quarter through January. </span></p><p class=\"\"><span>February has been a data-heavy month across the region. Data showed convincing signs that Brazil's economy is cooling, while Mexico, Colombia and Argentina are gaining momentum. That divergence is starting to show up in policy paths, offering different carry-trade benefits.</span></p><p class=\"\"><span>Meanwhile, Argentina's stock index </span><span> slumped 4%, set for its biggest monthly fall in two years. It was largely weighed down by oil firm YPF </span><span>, which fell 4.6% despite projecting a higher EBITDA in 2026.</span></p><p class=\"\"><span>Key Latin American stock indexes and currencies:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Latin American market prices from Reuters</span></p></td><td></td><td></td></tr><tr><td><p class=\"\"><span>                          Equities                      </span></p></td><td><p class=\"\"><span>                          Latest                      </span></p></td><td><p class=\"\"><span>                          Daily % change                      </span></p></td></tr><tr><td><p class=\"\"><span>MSCI Emerging Markets </span><span>CBOE:EFS</span></p></td><td><p class=\"\"><span>1608.41</span></p></td><td><p class=\"\"><span>-0.67</span></p></td></tr><tr><td><p class=\"\"><span>MSCI LatAm (.MILA00000PUS)</span></p></td><td><p class=\"\"><span>3238.26</span></p></td><td><p class=\"\"><span>-0.56</span></p></td></tr><tr><td><p class=\"\"><span>Brazil Bovespa </span></p></td><td><p class=\"\"><span>188694.25</span></p></td><td><p class=\"\"><span>-1.21</span></p></td></tr><tr><td><p class=\"\"><span>Mexico IPC </span></p></td><td><p class=\"\"><span>71681.47</span></p></td><td><p class=\"\"><span>0.41</span></p></td></tr><tr><td><p class=\"\"><span>Chile IPSA </span></p></td><td><p class=\"\"><span>10877.74</span></p></td><td><p class=\"\"><span>-1.56</span></p></td></tr><tr><td><p class=\"\"><span>Argentina Merval </span></p></td><td><p class=\"\"><span>2645710.32</span></p></td><td><p class=\"\"><span>-3.95</span></p></td></tr><tr><td><p class=\"\"><span>Colombia COLCAP </span></p></td><td><p class=\"\"><span>2266.87</span></p></td><td><p class=\"\"><span>-0.75</span></p></td></tr><tr><td><p class=\"\"><span>                          Currencies                      </span></p></td><td><p class=\"\"><span>                          Latest                      </span></p></td><td><p class=\"\"><span>                          Daily % change                      </span></p></td></tr><tr><td><p class=\"\"><span>Brazil real </span></p></td><td><p class=\"\"><span>5.1328</span></p></td><td><p class=\"\"><span>0.08</span></p></td></tr><tr><td><p class=\"\"><span>Mexico peso </span></p></td><td><p class=\"\"><span>17.223</span></p></td><td><p class=\"\"><span>-0.19</span></p></td></tr><tr><td><p class=\"\"><span>Chile peso </span></p></td><td><p class=\"\"><span>871.2</span></p></td><td><p class=\"\"><span>-0.73</span></p></td></tr><tr><td><p class=\"\"><span>Colombia peso </span></p></td><td><p class=\"\"><span>3765.5</span></p></td><td><p class=\"\"><span>-0.31</span></p></td></tr><tr><td><p class=\"\"><span>Peru sol </span></p></td><td><p class=\"\"><span>3.3549</span></p></td><td><p class=\"\"><span>-0.01</span></p></td></tr><tr><td><p class=\"\"><span>Argentina peso (interbank) </span></p></td><td><p class=\"\"><span>1396</span></p></td><td><p class=\"\"><span>0.85</span></p></td></tr><tr><td><p class=\"\"><span>Argentina peso (parallel) (ARSB=)</span></p></td><td><p class=\"\"><span>1405</span></p></td><td><p class=\"\"><span>            0          </span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN135:0-latam-fx-mixed-stocks-down-as-risk-appetite-wanes-assets-set-for-monthly-gains/",
            "pub_date": "2026-02-28 04:45:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2947773:0",
            "title": "Marcopolo: International growth and record dividends offset domestic softness, supporting strong 2025 results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net revenue grew 5.4% to R$9.06 billion in 2025, driven by strong international operations and exports, while domestic revenue declined. Record dividends were distributed, and the company maintained high margins and low debt, with positive outlook for 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2947773-e294b4d24c1979f78d63b949ce924b56\" target=\"_blank\">Marcopolo SA [POMO3] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2947773:0-marcopolo-international-growth-and-record-dividends-offset-domestic-softness-supporting-strong-2025-results/",
            "pub_date": "2026-02-28 04:45:55",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009786:0",
            "title": "Treasury Yields Fall Ahead of Jobs Week, Fed Month — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Treasury yields slip at the end of a declining month, as markets juggle geopolitical concerns and the outlook for U.S. interest rates. January PPI surprises on the upside, supporting bets on a hawkish fed. The Fed is expected to hold rates in March. The U.S.-Iran standoff fuels a risk-off mood that boosts demand for Treasurys, weakening long-dated yields. Next week brings labor data, including February payrolls, likely to swing markets. The 10-year falls 0.279 percentage point in February to 3.961%, the lowest since October and largest monthly decline in a year. The two-year drops 0.150 p.p. this month, to 3.377%, largest one-month decline since August. (paulo.trevisani@wsj.com; @ptrevisani)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009786:0/",
            "pub_date": "2026-02-28 04:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN143:0",
            "title": "Law firms drop lawsuit challenging California fee-sharing ban",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Mike Scarcella</span></p><p class=\"\"><span>    Two law firms have withdrawn a federal lawsuit that challenged a new California law restricting attorneys from sharing fees with out‑of‑state firms in which non‑lawyers hold ownership or have decision‑making authority.</span></p><p class=\"\"><span>Wisner Baum and Eleos Law on Thursday voluntarily dismissed their lawsuit in federal court in Los Angeles without explanation.</span></p><p class=\"\"><span>The two firms and the California attorney general’s office did not immediately respond to requests for comment. California’s state bar declined to comment.</span></p><p class=\"\"><span>The new state law, which took effect in January, generally bars California lawyers from sharing fees directly or indirectly with out-of-state alternative business structures.</span></p><p class=\"\"><span>    It was enacted following moves in Arizona and other states to loosen regulations prohibiting non-lawyer ownership of law firms. Arizona has gone the furthest, approving     more than 100 alternative business structures including personal injury firms and legal technology companies. Last year, KPMG opened a law firm subsidiary in the state.</span></p><p class=\"\"><span>Pending legislation in Illinois would limit attorneys in that state from sharing fees with out-of-state alternative business structures unless the Illinois attorney is licensed where the ABS is approved, and the fees are for work performed in that state.</span></p><p class=\"\"><span>In the California litigation, Wisner Baum and Eleos Law called the California law an “unconstitutional restriction on the ability of California lawyers and out-of-state law firms to practice law and represent injured people.” Eleos is an Arizona-based ABS.</span></p><p class=\"\"><span>Chief U.S. District Judge Dolly Gee in Los Angeles in December rejected a bid from Wisner Baum and Eleos Law for an order temporarily barring the new law from taking effect. </span></p><p class=\"\"><span>“Plaintiffs do not challenge the legitimacy of California’s interest in prohibiting non-lawyer ownership in California law firms,” Gee wrote. “AB 931’s prohibition on fee sharing with out-of-state ABS firms closes a loophole to protect that very interest.”</span></p><p class=\"\"><span>The lawyers in the case last month told Gee they were discussing the next steps after her ruling and asked for more time to allow those discussions to continue.</span></p><p class=\"\"><span>Read more:</span></p><p class=\"\"><span>    US appeals court says law firm's size doesn't limit legal fees  </span></p><p class=\"\"><span>    Illinois lawmakers move to limit investor influence as law firms, private equity edge closer  </span></p><p class=\"\"><span>    California law sets up new contingency fee-sharing roadblock  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN143:0-law-firms-drop-lawsuit-challenging-california-fee-sharing-ban/",
            "pub_date": "2026-02-28 04:47:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN15G:0",
            "title": "Pentagon chief Hegseth says officers will stop attending Ivy League programs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>        The U.S. Defense Department will stop sending officers on professional courses and graduate programs at Ivy League colleges, Pentagon chief Pete Hegseth said on Friday, declaring the schools had become \"anti-American\".  </span></p><p class=\"\"><span>    The ban will come into effect from the academic year 2026-27, he said in a video posted to X.  </span></p><p class=\"\"><span>    The Trump administration is cracking down on universities over a range of issues, including diversity programs, transgender policies and pro-Palestinian protests against U.S. ally Israel's assault on Gaza.  </span></p><p class=\"\"><span>    \"For decades, the Ivy League and similar institutions have gorged themselves on a trust fund of American taxpayer dollars, only to become factories of anti-American resentment and military disdain,\" Hegseth said in a video posted on X.  </span></p><p class=\"\"><span>    \"I'm ordering the complete and immediate cancellation of all Department of War attendance at institutions like Princeton, Columbia, MIT, Brown, Yale and many others starting next academic year,\" he added.  </span></p><p class=\"\"><span>    Earlier this month Hegseth said he would     cancel     professional military education, fellowships, and certificate programs with Harvard University.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN15G:0-pentagon-chief-hegseth-says-officers-will-stop-attending-ivy-league-programs/",
            "pub_date": "2026-02-28 04:48:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN17U:0",
            "title": "CBOT soybeans reach 20-month high on demand optimism, rising soyoil",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Chicago Board of Trade soybean futures scaled to a 20-month high on Friday on expectations for improving demand from biofuel makers and hopes for import purchases by </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/china/\" rel=\"nofollow\" target=\"_blank\">China</a><span>, analysts said.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Soybean drew support from rising soyoil prices. Soyoil futures posted life-of-contract highs in all contracts on Friday as higher crude oil markets supported prices for the biofuel feedstock.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The U.S. Environmental Protection Agency said this week that it will send its proposal for new biofuel blending volume mandates to the White House. Reuters also reported on Thursday that the government plans to reallocate at least 50% of exempted biofuel blending obligations to big refiners, which could boost demand for biofuels and feedstocks like soyoil.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Traders are watching to see if China extends purchases of U.S. soybeans after a </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/legal/supreme-court-of-the-united-states/\" rel=\"nofollow\" target=\"_blank\">Supreme Court</a><span> ruling against some U.S. </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/tariffs/\" rel=\"nofollow\" target=\"_blank\">tariffs</a><span> prompted President </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a><span> to introduce other levies.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CBOT May soybeans (SK26) settled 7-1/4 cents higher at $11.70-3/4 per bushel after hitting the highest level for a most-active contract </span><span> since mid-2024. The contract was up 1.5% in the week, the fourth straight weekly gain.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CBOT May soyoil (BOK26) hit a contract high of 62.43 cents per pound and ended 0.09 cent higher at 61.85 cents per pound.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CBOT May soymeal (SMK26) ended 40 cents lower at $320.50 per short ton.</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN17U:0-cbot-soybeans-reach-20-month-high-on-demand-optimism-rising-soyoil/",
            "pub_date": "2026-02-28 04:48:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2947774:0",
            "title": "SNG: Record annual net profit and strong margins, with major investments in Neptun Deep and decarbonization",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record net profit and robust margins in FY 2025, driven by strong gas production and storage. Major investments in Neptun Deep and decarbonization strategy position the group for future growth and energy transition.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2947774-f84b40419e6f28baa3ed16b6a03f17df\" target=\"_blank\">Societatea Nationala de Gaze Naturale Romgaz S.A. [SNG] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2947774:0-sng-record-annual-net-profit-and-strong-margins-with-major-investments-in-neptun-deep-and-decarbonization/",
            "pub_date": "2026-02-28 04:48:35",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN161:0",
            "title": "Argentina approves $1.14 billion in mining projects under RIGI scheme",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Argentina approved two major mining investments totaling $1.14 billion, the country's economy minister Luis Caputo said on Friday, marking the latest addition to the country's Large Investment Incentive Regime (RIGI).</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The first project involves a $380 million expansion of the Veladero gold mine, Caputo said on a post on social media.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The second is the Diablillos project, a new gold and silver mine requiring an investment of USD 760 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Both projects are expected to generate $750 million in annual exports for the San Juan, Salta, and Catamarca regions.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In August last year, Veladero said it aimed to boost the mine's output by 1.6 million ounces over its useful life.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Last week, Argentina's government extended the deadline to adhere to its RIGI scheme by one year. </span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN161:0-argentina-approves-1-14-billion-in-mining-projects-under-rigi-scheme/",
            "pub_date": "2026-02-28 04:48:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009710:0",
            "title": "CFTC Disaggregated Commitments: Nymex Natural Gas Futures",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>Disaggregated Commitments of Traders-All Futures </span><br/><span>Combined Positions as of February 24, 2026 </span><br/><span>               Reportable Positions </span><br/><span>================================================== </span><br/><span> Producer/Merchant :                             : </span><br/><span>  Processor/User   :        Swap Dealers         : </span><br/><span>   Long  :  Short  :   Long  :  Short  :Spreading: </span><br/><span>================================================== </span><br/><span>NAT GAS NYME - NEW YORK MERCANTILE EXCHANGE   (Contracts of 10,000 MMBTU'S) </span><br/><span>Open Interest is    1,619,531 </span><br/><span>Positions </span><br/><span> 276,131   245,759   201,989    49,180   127,215 </span><br/><span> </span><br/><span>Changes from:     February 17, 2026 </span><br/><span> -12,822    -7,500    14,347       642   -12,100 </span><br/><span> </span><br/><span>Percent of Open Interest Represented by Each Category of Trader </span><br/><span>    17.1      15.2      12.5       3.0       7.9 </span><br/><span> </span><br/><span>Number of Traders in Each Category </span><br/><span>      46        40        21        14        28 </span><br/><span> </span><br/><span>Disaggregated Commitments of Traders-All Futures </span><br/><span>Combined Positions as of February 24, 2026 </span><br/><span>               Reportable Positions </span><br/><span>=========================================================== </span><br/><span>                             : </span><br/><span>        Managed Money        :      Other Reportables </span><br/><span>   Long  :  Short  :Spreading:   Long  :  Short  :Spreading </span><br/><span>=========================================================== </span><br/><span>NAT GAS NYME - NEW YORK MERCANTILE EXCHANGE   (Contracts of 10,000 MMBTU'S) </span><br/><span>Positions </span><br/><span>  154,403   230,278   573,204    47,070   169,714   159,002 </span><br/><span> </span><br/><span>Changes from:     February 17, 2026 </span><br/><span>   -8,712    40,398    -3,002     4,332   -32,071    -3,308 </span><br/><span> </span><br/><span>Percent of Open Interest Represented by Each Category of Trader </span><br/><span>      9.5      14.2      35.4       2.9      10.5       9.8 </span><br/><span> </span><br/><span>Number of Traders in Each Category      Total Traders:   307 </span><br/><span>       58        60        84        50        44        70 </span><br/><span> </span><br/><span>     Write to Rodney Christian at csstat@dowjones.com </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009710:0/",
            "pub_date": "2026-02-28 04:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009709:0",
            "title": "CFTC Disaggregated Commitments: Nymex Harbor ULSD Futures",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>Disaggregated Commitments of Traders-All Futures </span><br/><span>Combined Positions as of February 24, 2026 </span><br/><span>               Reportable Positions </span><br/><span>================================================== </span><br/><span> Producer/Merchant :                             : </span><br/><span>  Processor/User   :        Swap Dealers         : </span><br/><span>   Long  :  Short  :   Long  :  Short  :Spreading: </span><br/><span>================================================== </span><br/><span>NY HARBOR ULSD - NEW YORK MERCANTILE EXCHANGE   (CONTRACTS OF 42,000 U.S. GALLONS) </span><br/><span>Open Interest is      365,555 </span><br/><span>Positions </span><br/><span>  81,846   181,971    70,256     9,914    11,723 </span><br/><span> </span><br/><span>Changes from:     February 17, 2026 </span><br/><span> -19,979   -16,829       854     1,872      -393 </span><br/><span> </span><br/><span>Percent of Open Interest Represented by Each Category of Trader </span><br/><span>    22.4      49.8      19.2       2.7       3.2 </span><br/><span> </span><br/><span>Number of Traders in Each Category </span><br/><span>      64        77        19         6        17 </span><br/><span> </span><br/><span>Disaggregated Commitments of Traders-All Futures </span><br/><span>Combined Positions as of February 24, 2026 </span><br/><span>               Reportable Positions </span><br/><span>=========================================================== </span><br/><span>                             : </span><br/><span>        Managed Money        :      Other Reportables </span><br/><span>   Long  :  Short  :Spreading:   Long  :  Short  :Spreading </span><br/><span>=========================================================== </span><br/><span>NY HARBOR ULSD - NEW YORK MERCANTILE EXCHANGE   (CONTRACTS OF 42,000 U.S. GALLONS) </span><br/><span>Positions </span><br/><span>   52,940    30,064    35,909    12,446    18,491    42,709 </span><br/><span> </span><br/><span>Changes from:     February 17, 2026 </span><br/><span>    7,477    -2,519       928    -5,143     3,424    -4,895 </span><br/><span> </span><br/><span>Percent of Open Interest Represented by Each Category of Trader </span><br/><span>     14.5       8.2       9.8       3.4       5.1      11.7 </span><br/><span> </span><br/><span>Number of Traders in Each Category      Total Traders:   200 </span><br/><span>       38        18        35        14        19        24 </span><br/><span> </span><br/><span>     Write to Rodney Christian at csstat@dowjones.com </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009709:0/",
            "pub_date": "2026-02-28 04:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}