{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463776:0",
            "title": "Jefferies Adjusts Gateway Distriparks' Price Target to INR100 From INR110, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gateway Distriparks  has an average rating of buy and price targets ranging from 83 Indian rupees to 147 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463776:0/",
            "pub_date": "2025-02-05 16:07:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463779:0",
            "title": "Jefferies Adjusts Godrej Properties' Price Target to INR3,525 From INR3,750, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Godrej Properties  has an average rating of outperform and price targets ranging from 2,113 Indian rupees to 4,200 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463779:0/",
            "pub_date": "2025-02-05 16:07:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0SM:0",
            "title": "GSK rises after 2031 sales target hike, Q4 results beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of GSK  up 4.5% at 1,442p - top pct gainer on the FTSE 100 index <!-- -->CURRENCYCOM:UK100<!-- --> </p><p class=\"\">** The British drugmaker lifts 2031 sales target to more than 40 bln pounds from the 38 bln pounds previously expected</p><p class=\"\">** Co beats Q4 earnings with core EPS of 23.2p vs IBES ests of 19.01p, on strength in its HIV and oncology portfolio</p><p class=\"\">** Reports Q4 sales of 8.12 bln pounds ($10.15 bln), above IBES ests of 7.75 bln pounds</p><p class=\"\">** Launches share buyback of 2 bln pounds</p><p class=\"\">** Sets 2025 sales growth target of 3%-5% against analysts' expectations for growth of about 3.5%, according to a company-compiled consensus</p><p class=\"\">** GSK fell about 12% in the last 12 months</p><p class=\"\">($1 = 0.8002 pounds)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0SM:0-gsk-rises-after-2031-sales-target-hike-q4-results-beat/",
            "pub_date": "2025-02-05 16:07:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002258:0",
            "title": "Toyota Boosts Earnings Guidance, to Set Up China EV Unit — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">Toyota Motor raised its annual earnings guidance after posting higher third-quarter net profit and said it will establish an electric-vehicle unit in China, seeking to shore up its operations in the world's largest auto market.</p><p class=\"\">The Japanese carmaker said Wednesday that net profit climbed from a year earlier for the three months ended December, beating analysts' estimates, as revenue grew.</p><p class=\"\">Toyota said the new Shanghai-based subsidiary will develop and produce Lexus-branded battery EVs. The unit will also make batteries for the group's businesses.</p><p class=\"\">The wholly owned unit is expected to make 100,000 vehicles annually, with production scheduled to begin in 2027 or later, the company said.</p><p class=\"\">Toyota Motor remained the world's biggest carmaker in 2024, with sales of 10.8 million vehicles globally, as it benefited from a shift among consumers in the U.S. and some other markets to hybrid cars from fully electric vehicles.</p><p class=\"\">But like many other global carmakers, it struggled in China as a cutthroat price war and consumers' shift away from conventional gas-powered vehicles disrupted the world's largest auto market.</p><p class=\"\">Toyota shares rose Wednesday after it boosted its outlook and reported better-than-expected quarterly results. The stock ended 3.1% higher, virtually recouping losses made earlier this week following the U.S. tariff announcement.</p><p class=\"\">The U.S. announced new tariffs against Mexico and Canada on Saturday before striking last-minute deals to delay them.</p><p class=\"\">To sell cars in the U.S., Japanese automakers like Toyota not only produce them at U.S. plants or import from Japan, but they also make them in Mexico and import to the U.S.</p><p class=\"\">Toyota said Wednesday that third-quarter net profit climbed 62% from a year earlier to 2.193 trillion yen, equivalent to $14.21 billion. That exceeded the estimate of Y1.175 trillion in a poll of analysts by data provider Quick. Revenue rose 2.9% to Y12.391 trillion despite lower vehicle sales.</p><p class=\"\">The bottom line was also helped by one-off gains related to a change in the way it holds foreign-currency-denominated assets, the company said.</p><p class=\"\">For the fiscal year ending March, Toyota expects net profit to decline 8.6% to Y4.520 trillion and revenue to increase 4.2% to Y47.000 trillion. It previously forecast Y3.570 trillion in net profit on Y46.000 trillion in revenue.</p><p class=\"\">The company left its fiscal-year group sales forecast unchanged at 10.85 million vehicles.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002258:0/",
            "pub_date": "2025-02-05 16:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002256:0",
            "title": "GSK Issues $2.5 Billion Buyback, Raises Midterm Outlook After Beating Market Views — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Helena Smolak</p><p class=\"\">GSK plans to buy back $2.50 billion in shares and raised its midterm sales target, citing promising pipeline developments.</p><p class=\"\">The British pharmaceutical giant said Wednesday that the 2.0 billion-pound share buyback will be implemented over the next 18 months.</p><p class=\"\">The company said it now expects sales of more than 40 billion pounds by 2031, compared with previous guidance of more than 38 billion pounds, on the back of expected new medicines between 2025 and 2031, including oncology treatments.</p><p class=\"\">GSK expects sales to grow 3% to 5% this year and core operating profit and core earnings per share to grow between 6% and 8% at constant exchange rates. This compares with 2024 sales growth of 7%, core operating profit growth of 11% and core earnings per share growth of 10%.</p><p class=\"\">Its cancer treatments lifted sales and profit ahead of analysts' expectations, offsetting lower vaccines sales on weak demand in the U.S.</p><p class=\"\">In the fourth quarter of 2024, sales rose 4% at constant currencies to 8.12 billion pounds, above the 7.83 billion pounds that analysts had expected, according to a consensus poll by Visible Alpha.</p><p class=\"\">Core operating profit, closely watched by analysts and investors, fell 10% at constant currencies to 1.43 billion pounds on lower-than-anticipated vaccine sales, but beat analysts' expectations of  1.385 billion pounds.</p><p class=\"\">Core earnings per share fell 10% at constant currencies to 23.2 pence, above analysts' expectations of 20.6 pence.</p><p class=\"\">The company expects to pay a full-year dividend of 61 pence, up from 60 pence in 2023.</p><p class=\"\">Write to Helena Smolak at helena.smolak@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002256:0/",
            "pub_date": "2025-02-05 16:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463863:0",
            "title": "Arab National Bank Declares Lower H2 2024 Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab National Bank's (SASE:1080) board declared a cash dividend of 0.0065 Saudi riyal per share for the second half of 2024. </p><p class=\"\">The Saudi-based lender will distribute the dividend on Feb. 19 to shareholders on record Feb. 9, according to a Wednesday release. It paid 0.007 riyal per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463863:0/",
            "pub_date": "2025-02-05 16:09:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463785:0",
            "title": "Jefferies Adjusts Asian Paints' Price Target to INR2,000 From INR2,080, Keeps at Underperform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Asian Paints  has an average rating of hold and price targets ranging from 2,000 Indian rupees to 3,650 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463785:0/",
            "pub_date": "2025-02-05 16:09:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0L4:0",
            "title": "Credit Agricole tops estimates in Q4, aided by Amundi and trading",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Q4 net income up 27%, revenue up 17% y/y</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">CEO says increased Banco BPM to defend group's interests</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Controlling entity buys 500 mln euros worth of additional shares</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Proposes dividend of 1.1 euro per share, no buyback announced</li></ul></span></div><span><p class=\"\">    Credit Agricole SA , France's second-biggest listed bank, exceeded quarterly earnings forecasts on Wednesday with a 27% jump in profit, driven by insurance and asset management even as gains in its investment banking business lagged rivals. </p><p class=\"\">The lender is the latest to benefit from soaring demand from clients wanting to trade in global markets, particularly in the final three months of 2024, with rival BNP Paribas  beating expectations on Tuesday.</p><p class=\"\">Credit Agricole said net income for the three months ending in December rose 27% from a year earlier to 1.69 billion euros ($1.8 billion), beating the 1.32 billion-euro analyst average estimate it had compiled. </p><p class=\"\">Revenue came in at 7.1 billion euros, up 17%, also above an average forecast of 6.53 billion euros.</p><p class=\"\">The strong fourth quarter enabled Credit Agricole to report record full-year sales and net income, the latter totalling more than 7.1 billion euros.</p><p class=\"\">Analysts at Royal Bank of Canada saluted a \"strong set of results\" in a note to clients.</p><p class=\"\">Credit Agricole's shares were up 1.2% in early Paris trading, outperforming France's benchmark blue-chip index CAC 40  </p><p class=\"\">The group's asset management arm, Amundi , Europe's largest fund manager, saw sales grow by 14.5% year-on-year.</p><p class=\"\">Sales at Credit Agricole's investment banking unit increased 7.7% to a record 1.57 billion euros, a smaller rise than elsewhere.</p><p class=\"\">Sales from trading in fixed income, currencies and commodities, while rising 17%, underperformed BNP and below the average 26% year-on-year increase recorded by Wall Street companies, according to Jefferies.    </p><p class=\"\">The listed entity of the larger Credit Agricole Group, composed of 39 regional banks, said its insurance business saw sales surge by 37%, notably thanks to growth in assets under management.</p><p class=\"\">The lender said it would propose a dividend of 1.10 euro per share, up 5% from a year earlier.</p><p class=\"\">GOALS MET EARLY</p><p class=\"\">Credit Agricole said it had reached as expected its 2025 targets a year in advance, including a return on tangible equity of more than 12%. </p><p class=\"\">The bank did not provide a new set of targets for 2025. </p><p class=\"\">Bumper profits have left European banks flush with cash and encouraged some CEOs to bid for rivals, including in Italy, where ongoing takeover battles have drawn in Credit Agricole. Italy is its biggest market outside France. </p><p class=\"\">Outgoing Chief Executive Philippe Brassac said the French lender had no plans to buy Italy's third-largest lender Banco BPM , the subject of an unsolicited bid from UniCredit  after Credit Agricole raised its stake in BPM in December to 15.1%.</p><p class=\"\">\"Our only motivation is to defend our own interests, we are not biased,\" Brassac said.</p><p class=\"\">\"Key questions from here for Credit Agricole remain Italian development plans as well as new MTP (medium term plan) targets and ambitions from the new CEO (Olivier Gavalda),\" Barclays said in a note.</p><p class=\"\">Credit Agricole became BPM's main investor in 2022, shortly after an earlier aborted takeover attempt of BPM by UniCredit. </p><p class=\"\">The French lender partners with BPM in consumer credit and insurance while Amundi has a distribution contract with UniCredit that runs out in 2027.</p><p class=\"\">SAS Rue La Boetie, the controlling entity of Credit Agricole, said in a separate statement that it intended to buy up to 500 million euros worth of Credit Agricole's shares by the end of the third quarter. </p><p class=\"\">It currently owns 62.76% of Credit Agricole. </p><p class=\"\">($1 = 0.9633 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0L4:0-credit-agricole-tops-estimates-in-q4-aided-by-amundi-and-trading/",
            "pub_date": "2025-02-05 16:09:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002266_20250205002266:0",
            "title": "Hang Seng Index Closes 0.9% Lower at 20597.09",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002266_20250205002266:0/",
            "pub_date": "2025-02-05 16:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463793:0",
            "title": "Jefferies Adjusts Military Commercial Joint Stock Bank's Price Target to 29,277 Dong From 31,430 Dong, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Military Commercial Joint Stock Bank (HOSE:MBB) has an average rating of buy and price targets ranging from 23,652.17 dong to 29,391.30 dong, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463793:0/",
            "pub_date": "2025-02-05 16:10:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463796:0",
            "title": "Jefferies Adjusts Adani Enterprises' Price Target to INR3,000 From INR3,800, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463796:0/",
            "pub_date": "2025-02-05 16:10:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEE3npka:0",
            "title": "Montenegro turns to 231 mln euro budget deficit in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PODGORICA (Montenegro), February 5 (SeeNews) - Montenegro's budget turned to a 231 million euro ($239 million) deficit in 2024, from an 11 million euro surplus in 2023, the finance ministry said.</p><p class=\"\">Last year's deficit was equivalent to 3.2% of the projected gross domestic product (GDP), the finance ministry said in a statement last week.</p><p class=\"\">Under the 2024 budget plan, last year's deficit was projected at 235.5 million euro.</p><p class=\"\">In December alone, the budget gap widened to 231 million euro from 146 million euro in the same month of 2023.</p><p class=\"\">Budget revenue in 2024 was 7.3% higher on the year but 0.6% below plan, reaching 2.755 billion euro, or 37.8% of GDP. Tax revenue in the period amounted to 1.969 billion euro, compared to 1.666 billion euro in the like period of 2023.</p><p class=\"\">Budget expenditures amounted to 2.986 billion euro last year, equivalent to 41% of GDP, and were 16.8% higher compared to 2023, but 0.7% below plan.</p><p class=\"\">Last year's capital budget totalled 251.17 million euro, up 33% compared to 2023.</p><p class=\"\">In August, the government revised the 2024 budget plan, targeting a fiscal deficit of 237 million euro, equivalent to 3.26% of GDP. The revised deficit figure was 1.36 million euro higher than originally planned, but lower as a percentage of GDP due to an updated GDP projection.</p><p class=\"\">In November, the government adopted the 2025 budget draft envisaging a deficit equivalent to 3.5% of the planned gross domestic product (GDP), or 278 million euro. However, the parliament has failed so far to endorse the budget as the opposition has blocked its work.</p><p class=\"\">($ = 0.968 euro)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEE3npka:0-montenegro-turns-to-231-mln-euro-budget-deficit-in-2024/",
            "pub_date": "2025-02-05 16:10:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW08X:0",
            "title": "Tokyo tech IPO soars but Seoul deal tanks 10% in volatile Asian markets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">LG CNS shares dive 10%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Tokyo's Next Generation Technology shares jump 58%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Markets roiled by trade war tensions</li></ul></span></div><span><p class=\"\">    Shares of a small Japanese technology firm shot up nearly 60% on its first day of trade on Wednesday, while Seoul's largest initial public offering (IPO) in three years tanked almost 10% as volatility driven by geopolitics again gripped Asia's equity markets.</p><p class=\"\">South Korea's LG CNS  shares dropped from opening bell and traded in negative territory for the session, failing to arrest the recent trend of weak debuts for the Seoul market. </p><p class=\"\">The IT, cloud and AI services provider's shares closed at 55,800 won, down from their issue price of 61,900 won.</p><p class=\"\">Shares of Next Generation Technology - the first IPO debut of 2025 in Tokyo - traded 58% higher before paring some gains across the day. It raised 1.3 billion yen in the IPO ($8.49 million), according to its regulatory filings.</p><p class=\"\">The strong first day performance came as Tokyo's Nikkei  nudged up 0.1% on Wednesday, In Seoul, the Kospi  gained 1.1%.</p><p class=\"\">MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) was 0.44% higher later Wednesday as China's main equities indices traded lower.</p><p class=\"\">The prospect of a <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/trump-china-us-tariffs-live-updates-2025-02-04/\" rel=\"nofollow\" target=\"_blank\">trade war</a> between the U.S and China as tit-for-tat tariffs between the world's top two economies has raised investor concerns about financial market volatility over the near term.</p><p class=\"\">Asian deal makers were hopeful the region's equity capital markets would perform better in 2025 as global interest rates began to fall and more Chinese IPOs were given regulatory sign off. </p><p class=\"\">LNG CNS last month priced its IPO at the top of its targeted valuation range, raising 1.2 trillion won ($827.1 million). </p><p class=\"\">At closing, the firm's market valuation was about 5.4 trillion won.</p><p class=\"\">The IPO is the largest since LG Energy Solution  raised $10.74 billion in 2022. </p><p class=\"\">Last year, South Korea raised $2.85 billion worth of IPOs, according to LSEG data, up slightly from $2.79 billion in 2023.</p><p class=\"\">LG CNS' offering was one of the few by South Korean firms to draw strong demand in recent months against the backdrop of an IPO market slump since the second half of last year, analysts said. </p><p class=\"\">The retail portion of the initial public offering was oversubscribed nearly 123 times, while more than 2,000 institutional investors made bids worth 76 trillion won during the bookbuilding last month, according to the company. </p><p class=\"\">However, LG CNS's weak market debut has continued a trend of similarly disappointing listings since last year, which analysts said could further discourage investors and other companies from coming to market. </p><p class=\"\">($1 = 1,450.8900 won</p><p class=\"\">($1 = 153.1300 yen)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW08X:0-tokyo-tech-ipo-soars-but-seoul-deal-tanks-10-in-volatile-asian-markets/",
            "pub_date": "2025-02-05 16:10:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463855:0",
            "title": "French Monthly Industrial Production Edges Down 0.4% in December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">France's industrial production fell 0.4% month over month in December 2024, following a revised 0.1% rise in November 2024, the country's National Institute of Statistics and Economic Studies said Wednesday. </p><p class=\"\">Analysts expected a 0.1% decline for the month. </p><p class=\"\">On a yearly basis, the index decreased 1.2% in December 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463855:0/",
            "pub_date": "2025-02-05 16:02:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002217_20250205002217:0",
            "title": "Novo Nordisk Shares Rise 6% After 4Q Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002217_20250205002217:0/",
            "pub_date": "2025-02-05 16:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002214:0",
            "title": "Narrowing French-Spanish Bond Yield Spread Signals Improving Sentiment on France — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The 10-year French-Spanish government bond yield spread is gradually nearing the 5 basis point threshold, signalling improving sentiment over France, Natixis analysts say in a note. The spread hasn't reached this level since last November, they say, describing it \"a sign that investor perception of France is less pessimistic than before.\" The 10-year French-Spanish yield differential is 5.6 basis points, according to LSEG data. French Prime Minister Francois Bayrou used special executive powers on Monday to push the 2025 budget through parliament without a vote, while facing a no-confidence motion on Wednesday. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002214:0/",
            "pub_date": "2025-02-05 16:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002211:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0802 GMT - The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p><p class=\"\">0756 GMT - There are some green shoots in China's consumption spending, but caution persists, HSBC Global Research analysts write in a note. Preliminary data show the country's box office sales exceeded 9 billion yuan during the Lunar New Year holiday, while domestic travel reached a new record of over 2.33 billion cross-regional trips within China, they say. These are positive signs for consumer sentiment, but HSBC remains cautious over whether the holiday spirit can translate into more sustainable momentum without further stimulus. Another fiscal policy push is still needed to drive a sustained increase in activities in the coming months, especially given geopolitical uncertainty, HSBC adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0754 GMT - Citi expects Malaysia's minimum wage hike to boost consumer spending, with median wages projected to grow by a high single digit in 2025, analyst Huan Wen Gan writes in a note. The minimum wage was raised to MYR1,700/month from MYR1,500/month on Feb. 1. Retail trade, particularly at convenience stores and mini-markets, is likely see further support, he adds. The agriculture sector has lower median wages, but oil palm harvesters already earn above the new threshold, minimizing the impact on palm oil players, he reckons. Mr. D.I.Y. Group (M) may face higher labor costs, with an 8% wage hike factored into 2025 earnings estimates, he says. For every 1% increase in wages could result in a 0.8% cut in its 2025 net profit forecast, he adds. Given stronger consumption trends and stable earnings potential, Citi remains positive on Malaysia's consumer sector. (yingxian.wong@wsj.com)</p><p class=\"\">0732 GMT - German Bunds are running into resistance ahead of the yield lows of the year, but shaky risk sentiment and a sanguine European Central Bank wage tracker should keep the momentum going, says Commerzbank Research's Michael Leister. \"With the ongoing focus on trade wars and fragile risk sentiment we expect Bunds to stay bid,\" the head of interest rates strategy says in a note. That said, the air is getting thinner for Bunds as yields are approaching the lows recorded in the initial sessions of the year, Leister says. In addition, risk-off once again turns out to not be self-reinforcing, with equities stuck at the highs, he says. The 10-year German Bund yield falls 2.5 basis points to 2.374%, tracking U.S. Treasury yields lower, according to Tradeweb. (emese.bartha@wsj.com)</p><p class=\"\">0730 GMT - Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0717 GMT - The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p><p class=\"\">0714 GMT - The impact of Trump's 10% tariff on Chinese exports on China's GDP growth this year looks manageable, Bank of Singapore chief economist Mansoor Mohi-uddin writes in a note. If the 10% levy is maintained for the rest of 2025, that would shave around 0.5% off China's GDP growth, he says. But if tariffs are raised to 20% to 30%, that would likely drag China's economic growth this year to 4.0% from 5.0% last year, he adds. That said, Beijing's retaliation, with targeted tariffs aimed at U.S. exports amounting to only $14 billion, leaves the door open for a potential deal with Washington to avert a broader trade war, he adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0704 GMT - The 'tariff can' has just been kicked down the road, with the idea of imposing levies on U.S. imports from its two closest neighbours still not off the table entirely, says Pepperstone's Michael Brown. \"In fact, this whole saga could well rumble on until the start of April, when the review ordered by President Trump into U.S. trade policy is due to report back,\" the senior research strategist says in a note. Trump agreed to postpone the tariffs on Mexico and Canada for a month after talks with the leaders of both countries. \"Perhaps, it is at that point, that we will see tariffs shift from being used as a bargaining chip to further certain political aims, to actually being used as a measure to address trade imbalances,\" Brown says. (emese.bartha@wsj.com)</p><p class=\"\">0659 GMT - Japan, South Korea and Taiwan have dodged tariff bullets for now, but they shouldn't get too comfortable, Moody's Analytics economists say. The three appear obvious targets given their hefty trade surpluses with the U.S. One possible reason is security ties with the U.S. Another is the fact that Japan is among the U.S.'s biggest foreign investors. Korean and Taiwanese firms have been ramping up investment too. That's come at China's expense, aligning with the U.S. bid to curb its influence in supply chains, they add. But the mood could shift and tariffs could come. The economies also face collateral damage. Carmakers like Toyota and Kia have plants in Mexico, and Taiwanese and Korean chip and electronics producers in the U.S. face disruptions via trade barriers or surging production costs. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0649 GMT - South Korea's benchmark Kospi rose 1.1% to close at 2509.27 amid easing fears over U.S. tariffs. Foreign and institutional investors were net buyers. LG Energy Solution and Samsung SDI gained 3.6% and 3.4%, respectively, after the government prepared a new aid plan for the EV battery industry. Memory-chip maker SK Hynix added 4.0%. Mobile internet giant Kakao climbed 5.6% after agreeing to develop AI Products with OpenAI. Meanwhile, LG CNS, an IT service affiliate of LG Group, fell 9.9% on its stock exchange debut. USD/KRW settled 1.3% lower at 1,444.30 in Seoul onshore trading. South Korea's 10-year government bond yield was down 2.3 bps at 2.821%. (kwanwoo.jun@wsj.com)</p><p class=\"\">0518 GMT - Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002211:0/",
            "pub_date": "2025-02-05 16:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002208:0",
            "title": "Dollar Falls After Weaker U.S. Job Openings Data — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002208:0/",
            "pub_date": "2025-02-05 16:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0RD:0",
            "title": "India's Adani Wilmar bets on urban revival, quick grocery delivery to boost growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Adani Wilmar  expects its sales volumes to grow by around 10% next fiscal year, CEO Angshu Mallick told Reuters on Wednesday, counting on demand from 10-minute grocery delivery apps and a tax cut-led revival in urban consumer spending.</p><p class=\"\">Top executives in sectors such as consumer goods and automobiles expect India's plans to cut personal income tax rates to put more disposable income in the hands of the people and eventually boost consumption.</p><p class=\"\">\"Whenever consumers have excess money, we have found they first go and buy good food,\" Mallick said, adding the company's food business is expected to grow by more than 20% for the fiscal year that ends in March 2026.</p><p class=\"\">For the third quarter, Adani Wilmar's sales volume grew by only 5%, with its edible oil business posting a 4% growth.</p><p class=\"\">The edible oil business, which makes 'Fortune' cooking oil, will grow by at least 6% next year, helping the broader group return to overall growth in the region of 10%, Mallick said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0RD:0-india-s-adani-wilmar-bets-on-urban-revival-quick-grocery-delivery-to-boost-growth/",
            "pub_date": "2025-02-05 16:03:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446692:0",
            "title": "France Industrial Output Drops More Than Expected",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Industrial production fell 0.4% month-on-month in December 2024, following a downwardly revised 0.1% increase in November and exceeding the expected 0.1% decline.</p><p class=\"\">The drop was driven by a 0.7% contraction in manufacturing output (vs. +0.2% in November), largely due to a renewed decrease in transport equipment production (-5.4% vs. +4.0%), including motor vehicles, trailers, and semi-trailers (-11.0% vs. +6.4%) and, to a lesser extent, other transport equipment (-2.0% vs. +2.6%).</p><p class=\"\">In contrast, activity growth accelerated in mining and quarrying, energy, water supply, and waste management (+1.2% vs. +0.1%) and construction (+1.3% vs. +0.3%).</p><p class=\"\">Annually, industrial output declined 1.2% in December.</p><p class=\"\">On a quarterly basis, industrial production was 0.6% lower than in the previous three-month period.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446692:0-france-industrial-output-drops-more-than-expected/",
            "pub_date": "2025-02-05 16:03:53",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002225:0",
            "title": "Novo Nordisk Expects Slowing Sales Growth This Year — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dominic Chopping</p><p class=\"\">Novo Nordisk expects sales growth to slow this year as capacity constraints, intensifying competition and pricing pressure drag on sales of its blockbuster weight-loss and diabetes drugs.</p><p class=\"\">The Danish pharmaceutical giant expects overall sales growth of between 16% and 24% in constant exchange rates this year, shy of the 26% it achieved in 2024.</p><p class=\"\">\"In 2025, we will continue our focus on commercial execution, on the progression of our early and late-stage R&amp;D pipeline and on the expansion of our production capacity,\" Chief Executive Lars Fruergaard Jorgensen said.</p><p class=\"\">Sales of the company's blockbuster Wegovy weight-loss drug just missed sales expectations in the fourth quarter despite more than doubling on the year.</p><p class=\"\">Sales of Wegovy surged to 19.87 billion Danish kroner ($2.76 billion), against a Visible Alpha consensus estimate of 20.04 billion kroner, while sales of diabetes drug Ozempic rose 12% on year to 33.85 billion kroner, compared with a Visible Alpha consensus estimate of 33.34 billion kroner.</p><p class=\"\">The sales performance comes after Eli Lilly, the company's biggest competitor in the booming weight-loss market, presented a disappointing fourth-quarter sales forecast for its Zepbound and Mounjaro medications. The U.S. company said it had expected faster market growth of the drugs, but wholesalers hadn't boosted their stockpiles at the end of the year as it had expected them to.</p><p class=\"\">The soaring popularity of Wegovy and Ozempic has seen demand far outstrip supply and left the company racing to increase production capacity. It said Wednesday that continued capacity limitations at some of its manufacturing sites are expected to continue with periodic supply constraints and related drug-shortage notifications across a number of products and geographies.</p><p class=\"\">Semaglutide, the drug sold as Wegovy for weight-loss and Ozempic for diabetes, is still currently in shortage in the U.S. according to the Food and Drug Administration.</p><p class=\"\">Novo Nordisk has committed billions of dollars to new manufacturing capacity on top of an $11 billion deal to buy three manufacturing sites previously owned by Somerset, N.J.-based Catalent to boost its production capability. The Catalent deal completed just before Christmas.</p><p class=\"\">As the company approaches the patent expiry of Semaglutide in the early 2030s, it has been working to develop the next generation of obesity drugs that it hopes will accelerate weight-loss and boost other areas of patient health. Data from a keenly-anticipated trial of its CagriSema drug recently disappointed investors as patients lost an average of 22.7% of their weight, missing the 25% Novo had targeted.</p><p class=\"\">The results wiped nearly $100 billion off the company's market value, but shares regained some ground last month after another experimental drug called Amycretin showed encouraging results in an early-stage trial. Still, shares have fallen by around 42% since their peak last summer on the CagriSema disappointment, competitive concerns and pricing pressure.</p><p class=\"\">It said Wednesday it plans to further explore the weight-loss potential of CagriSema with a new phase 3 trial in 2025, but in order to secure supply chain readiness, it now expects to file for the first regulatory approval of CagriSema during the first quarter of 2026. That is a delay to initial plans for a filing toward the end of 2025.</p><p class=\"\">A read-out on CagriSema's effectiveness in obese patients with diabetes is expected during the first quarter of 2025.</p><p class=\"\">Novo Nordisk said it expects continued momentum in both Wegovy and Ozempic this year as well as intensifying competition and continued pricing pressure within its overall portfolio of diabetes and obesity medications.</p><p class=\"\">It guided for operating profit growth this year of 19% to 27% in constant exchange rates.</p><p class=\"\">Novo Nordisk's net profit in the fourth quarter rose 29% to 28.23 billion kroner, ahead of the 26.06 billion kroner forecast by analysts in a FactSet poll.</p><p class=\"\">Sales rose 30% to 85.68 billion kroner, versus the 80.14 billion-kroner FactSet estimate.</p><p class=\"\">Write to Dominic Chopping at dominic.chopping@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002225:0/",
            "pub_date": "2025-02-05 16:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463854:0",
            "title": "Zhonghua Geotechnical Engineering Unit Selected for 12 Million Yuan Engineering Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China Zhonghua Geotechnical Engineering Group's  unit, Beijing Changdao Municipal Engineering Group, has secured a 12.4 million yuan contract for roadwork in China, according to a Shenzhen Stock Exchange filing on January 27. </p><p class=\"\">The project is the expansion and the upgrading of the Third Ring Road in China, which includes working on the earthwork and foundation pit of the road's level 1 service station, the Chinese engineering services provider said. </p><p class=\"\">The company's shares closed more than 2% higher.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463854:0/",
            "pub_date": "2025-02-05 16:04:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463845:0",
            "title": "TotalEnergies Logs Lower FY24 Net Income, Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TotalEnergies  said Wednesday its net income and sales for 2024 fell year over year. </p><p class=\"\">Consolidated net income for the 12 months ended Dec. 31, 2024, was $16.03 billion, compared with $21.51 billion earlier. EPS moved to $6.69 from $8.67. </p><p class=\"\">The oil and gas giant's sales were $214.55 billion, compared with $237.13 billion a year ago. </p><p class=\"\">Meanwhile, the board proposed a final dividend of 0.85 euro per share, payable July 1. It paid 0.79 euro per share a year ago. This takes the full-year dividend to 3.22 euros per share, up from 3.01 euros in the previous year.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463845:0/",
            "pub_date": "2025-02-05 16:04:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN7NHYZ3:0",
            "title": "Oxe Marine AB changes Certified Adviser to Redeye AB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025</strong></p><p class=\"\">Stockholm on date 2025-02-05 – OXE Marine AB, announces today that the company has entered into an agreement with Redeye AB regarding the service as Certified Adviser. Redeye AB starts as Certified Adviser on April 28, 2025.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN7NHYZ3:0-oxe-marine-ab-changes-certified-adviser-to-redeye-ab/",
            "pub_date": "2025-02-05 16:05:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN3vhx7c:0",
            "title": "Carnegie Access: Raketech: Early spring cleaning, but signs of recovery in profitability",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new flash comment on Raketech following recent news flow.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/raketech</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN3vhx7c:0-carnegie-access-raketech-early-spring-cleaning-but-signs-of-recovery-in-profitability/",
            "pub_date": "2025-02-05 16:05:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463859:0",
            "title": "Sohgo Security Services Books 5% Lower Attributable Net Income for Nine Months to December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sohgo Security Services  recorded a net income attributable to owners of the parent of 17.5 billion yen for the nine months ended Dec. 31, 2024, 5% lower than 18.4 billion yen logged for the same period a year ago. </p><p class=\"\">The company's net income per share for the reporting period decreased to 35.71 yen from 36.62 yen per share a year ago, according to a Tuesday filing with the Tokyo Exchange. </p><p class=\"\">The net sales of the security systems services company came in at 400.5 billion yen, which is 5.7% higher than 379.0 billion yen a year earlier. </p><p class=\"\">It forecasted an attributable profit of 27.6 billion yen, net income per share of 55.13 yen, net sales of 550 billion yen, and a final dividend of 12.40 yen per share for the fiscal year ending March. 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463859:0/",
            "pub_date": "2025-02-05 16:05:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002164:0",
            "title": "Taipei Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in NT$ <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Acer                           38.20      38.00      +0.20      +0.53 <br/>  ASE Technology Holding        161.50     157.50      +4.00      +2.54 <br/>  Asia Cement                    41.00      40.75      +0.25      +0.61 <br/>  ASUSTeK Computer              657.00     647.00     +10.00      +1.55 <br/>  Cathay Financial Hldg          66.50      65.20      +1.30      +1.99 <br/>  Cathay Rl Est Dev              23.95      23.50      +0.45      +1.91 <br/>  China Airlines                 25.05      24.70      +0.35      +1.42 <br/>  China Steel                    19.60      19.60       unch       unch <br/>  D-Link                         23.75      23.95      -0.20      -0.84 <br/>  Evergreen Marine Taiwan       205.00     195.50      +9.50      +4.86 <br/>  Far Eastern New Century        31.25      30.85      +0.40      +1.30 <br/>  Formosa Plastics               33.95      34.00      -0.05      -0.15 <br/>  Hua Nan Fin Hldgs              27.85      27.80      +0.05      +0.18 <br/>  Nan Ya Plastics                30.45      30.50      -0.05      -0.16 <br/>  Quanta Computer               240.00     235.00      +5.00      +2.13 <br/>  Taiwan Semicon Mfg          1,110.00   1,095.00     +15.00      +1.37 <br/>  Tatung Co                      41.35      41.45      -0.10      -0.24 <br/>  TCC Group Holdings             31.10      31.25      -0.15      -0.48 <br/>  TECO Electric &amp; Machinery      54.50      55.10      -0.60      -1.09 <br/>  Uni-President Ents             79.20      78.40      +0.80      +1.02 <br/>  United Microelectronics        40.10      40.10       unch       unch <br/>  Walsin Lihwa                   23.55      23.40      +0.15      +0.64 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002164:0/",
            "pub_date": "2025-02-05 16:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002158:0",
            "title": "Shenzhen Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                 Close      Prior     Change   % Change <br/>  Angang Steel                    2.31       2.28      +0.03      +1.32 <br/>  BOE Technology Group A          4.51       4.46      +0.05      +1.12 <br/>  China Intl Marine Contain       8.09       8.17      -0.08      -0.98 <br/>  China Railway Materials A       2.53       2.53       unch       unch <br/>  China Vanke A                   6.97       7.27      -0.30      -4.13 <br/>  Chongqing Changan Auto         12.69      12.55      +0.14      +1.12 <br/>  FAW Jiefang Group A             7.90       7.86      +0.04      +0.51 <br/>  Ping An Bank                   11.37      11.47      -0.10      -0.87 <br/>  TCL Technology Group            5.06       5.01      +0.05      +1.00 <br/>  ZTE                            42.56      39.98      +2.58      +6.45 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002158:0/",
            "pub_date": "2025-02-05 16:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002163:0",
            "title": "Shanghai Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                 Close      Prior     Change   % Change <br/>  Air China Ltd A                 7.11       7.48      -0.37      -4.95 <br/>  Anhui Conch Cement A           23.73      24.90      -1.17      -4.70 <br/>  Bank of China                   5.32       5.45      -0.13      -2.39 <br/>  Baoshan Iron &amp; Steel A          6.72       7.01      -0.29      -4.14 <br/>  Bright Dairy &amp; Food A           8.06       8.15      -0.09      -1.10 <br/>  China Eastern Airlines A        3.78       3.88      -0.10      -2.58 <br/>  China Merchants Bank           40.00      40.65      -0.65      -1.60 <br/>  China Minsheng Banking A        4.09       4.15      -0.06      -1.45 <br/>  Chn Petro &amp; Chem Sinopec        6.02       6.08      -0.06      -0.99 <br/>  China Southern Airlines         5.85       6.19      -0.34      -5.49 <br/>  China United Ntwk Comms         4.99       4.89      +0.10      +2.04 <br/>  China Yangtze Power A          28.35      28.90      -0.55      -1.90 <br/>  Chongqing Brewery A            54.47      55.24      -0.77      -1.39 <br/>  CITIC Securities A             26.95      26.93      +0.02      +0.07 <br/>  COSCO SHIPPING Engy A          12.82      12.25      +0.57      +4.65 <br/>  COSCO SHIPPING Special A        6.57       6.84      -0.27      -3.95 <br/>  Daqin Railway                   6.49       6.65      -0.16      -2.41 <br/>  Dongfeng Automobile A           6.76       6.65      +0.11      +1.65 <br/>  Fujian Yanjing Huiquan         10.37      10.63      -0.26      -2.45 <br/>  Haier Smart Home A             26.61      27.77      -1.16      -4.18 <br/>  Hainan Airlines Hldg A          1.56       1.63      -0.07      -4.29 <br/>  Hisense Visual Tech A          23.46      23.60      -0.14      -0.59 <br/>  Hua Xia Bank A                  7.41       7.60      -0.19      -2.50 <br/>  Huadian Power Intl              5.09       5.17      -0.08      -1.55 <br/>  Huaneng Pwr Intl                6.54       6.44      +0.10      +1.55 <br/>  INESA Intelligent Tech A       14.96      13.60      +1.36     +10.00 <br/>  Jiangsu Expressway A           14.27      14.69      -0.42      -2.86 <br/>  Jiangxi Copper A               21.01      21.10      -0.09      -0.43 <br/>  Lucky Film A                    6.41       6.29      +0.12      +1.91 <br/>  Maanshan Iron &amp; Steel A         3.26       3.29      -0.03      -0.91 <br/>  Nanjing Iron &amp; Steel A          4.49       4.64      -0.15      -3.23 <br/>  SAIC Motor A                   17.05      17.16      -0.11      -0.64 <br/>  Shandong Gold-Mining A         25.93      24.33      +1.60      +6.58 <br/>  Shanghai Bailian Group A        9.46       9.73      -0.27      -2.77 <br/>  Shanghai Pudong Dev Bank       10.41      10.65      -0.24      -2.25 <br/>  Shanghai Xinhua Media A         6.15       5.91      +0.24      +4.06 <br/>  Shenyang Jinbei Auto A          6.76       6.62      +0.14      +2.11 <br/>  Sichuan Changhong Elec A        9.04       8.60      +0.44      +5.12 <br/>  SINOPEC Oilfield Svc A          1.94       1.96      -0.02      -1.02 <br/>  SINOPEC Shanghai PetroChm       2.92       2.86      +0.06      +2.10 <br/>  Tsingtao Brewery A             67.50      69.52      -2.02      -2.91 <br/>  Yankuang Energy Group A        13.31      13.47      -0.16      -1.19 <br/>  Zhongjin Gold A                13.80      13.13      +0.67      +5.10 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002163:0/",
            "pub_date": "2025-02-05 16:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX299Wwj:0",
            "title": "Nokia and Orange France extend long-term partnership with new 5G deal ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Press Release</p><p class=\"\">Nokia and Orange France extend long-term partnership with new 5G deal </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">New 5G contract extends companies’ long-standing partnership with upgraded network boosting performance and customer experience. </li><li class=\"listItem-bmN0_SHH\">Nokia’s energy-efficiency AirScale equipment portfolio to support Orange France’s sustainability ambitions.</li><li class=\"listItem-bmN0_SHH\">Orange France to trial Nokia’s Cloud RAN solutions. </li></ul><p class=\"\">5 February 2025</p><p class=\"\">Espoo, Finland – Nokia today announced that it signed a four-year contract extension with Orange France to upgrade its 5G radio infrastructure with Nokia’s energy-efficient AirScale portfolio. The new deal will deliver an enhanced customer experience with best-in-class speeds, capacity, and performance across Orange’s footprint in Southeastern and Western France. Orange will also trial Nokia’s 5G Cloud RAN solutions to assess the transition of its network towards Cloud RAN technology</p><p class=\"\">Under the deal, Nokia will supply equipment from its industry-leading O-RAN-compliant 5G AirScale portfolio. This includes Nokia's next-generation industry-leading, high-capacity AirScale baseband solutions, lightweight, and high-output Massive MIMO Habrok radios, and Nokia’s Pandion portfolio of FDD multiband remote radio heads to cover all use cases and deployment scenarios. These are all powered by its energy-efficient ReefShark System-on-Chip technology and combine to provide superior coverage and capacity. Nokia will also supply its AI-powered radio network management solution, MantaRay NM, which supports all radio and mobile core technologies. </p><p class=\"\">Orange will also trial Nokia’s 5G Cloud RAN solutions. Nokia is helping its global customers to seamlessly transition to Cloud RAN technology with future-proof solutions that drive innovation for CSPs and enterprises. Nokia's comprehensive anyRAN approach provides the best choice of strategic options for their RAN evolution with purpose-built, hybrid, or Cloud RAN solutions, enabling customers to evolve their networks and continue to deliver maximum field performance.</p><p class=\"\">Emmanuel Lugagne Delpon, CTO at Orange France, commented: “This new contract extension with Nokia and their industry-leading equipment portfolio will support our pioneering efforts to drive superior customer experience further, reduce our environmental footprint, and make our network as energy efficient as possible.” </p><p class=\"\">Tommi Uitto, President of Mobile Networks at Nokia, said: “We are excited to continue our long-standing partnership with Orange France and contribute positively towards their network performance, sustainability goals, and commitment to net carbon neutrality. Our industry-leading, energy-efficient AirScale portfolio and AI-powered MantaRay network management solution will enhance Orange’s network performance and deliver premium connectivity experiences to Orange customers.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Resources </strong></p><p class=\"\">Webpage: Nokia Cloud RAN</p><p class=\"\">Product page: Nokia anyRAN</p><p class=\"\">Product page: Nokia AirScale Baseband </p><p class=\"\">Product page: MantaRay NM</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Nokia</strong></p><p class=\"\">At Nokia, we create technology that helps the world act together. </p><p class=\"\">As a B2B technology innovation leader, we are pioneering networks that sense, think and act by leveraging our work across mobile, fixed and cloud networks. In addition, we create value with intellectual property and long-term research, led by the award-winning Nokia Bell Labs. </p><p class=\"\">With truly open architectures that seamlessly integrate into any ecosystem, our high-performance networks create new opportunities for monetization and scale. Service providers, enterprises and partners worldwide trust Nokia to deliver secure, reliable and sustainable networks today – and work with us to create the digital services and applications of the future.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media inquiries</strong></p><p class=\"\">Nokia Press Office</p><p class=\"\">Email: Press.Services@nokia.com </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Follow us on social media</strong></p><p class=\"\">LinkedIn X Instagram Facebook YouTube</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX299Wwj:0-nokia-and-orange-france-extend-long-term-partnership-with-new-5g-deal/",
            "pub_date": "2025-02-05 16:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}