{
    "data": [
        {
            "id": "dpa_afx:10544c9242561:0",
            "title": "Acciona FY25 Profit Surges On Revenue Growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MADRID (dpa-AFX) - Acciona, S.A. (ACXIF, ANA.MC), a Spanish infrastructure and renewable energy firm, reported significantly higher profit in fiscal 2025, driven by growth in all segments.</span></p><p class=\"\"><span>In fiscal 2025, attributable net profit surged 90.4 percent to 803 million euros from last year's 422 million euros.</span></p><p class=\"\"><span>EBT climbed 82% year-over-year to 1.39 billion euros, and EBITDA grew 30.8 percent to 3.21 billion euros.</span></p><p class=\"\"><span>In the year, revenues were 20.24 billion euros, up 5.5 percent from 19.19 billion euros last year.</span></p><p class=\"\"><span>The company reported solid results in all business areas, driven by good performance and profitability of the Infrastructure business, successful execution of ACCIONA Energía's asset rotation plan, and Nordex's strong operating performance.</span></p><p class=\"\"><span>Further, ACCIONA's Board of Directors has proposed the distribution of a dividend of 310 million euros or 5.6 euros per share based on fiscal 2025 results.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:10544c9242561:0-acciona-fy25-profit-surges-on-revenue-growth/",
            "pub_date": "2026-02-27 13:52:16",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUAC3JHHB:0",
            "title": "UBS nominates Agustin Carstens and Luca Maestri as new board members",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>UBS </span><span> has nominated Agustin Carstens and Luca Maestri for election to the board of directors at its annual general meeting in April, the Swiss banking giant said on Friday.</span></p><p class=\"\"><span>They are to replace William C. Dudley and Jeanette Wong, who will not stand for re-election, UBS added. </span></p><p class=\"\"><span>\"The addition of these two highly experienced leaders will further strengthen the board's expertise, bringing outstanding regulatory knowledge and extensive CFO skills,\" UBS Chairman Colm Kelleher said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUAC3JHHB:0-ubs-nominates-agustin-carstens-and-luca-maestri-as-new-board-members/",
            "pub_date": "2026-02-27 13:52:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ObiZMFsha:0",
            "title": "Financial calendar",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Financial calendar for Golden Energy Offshore Services ASA</span></p><p class=\"\"><span>FINANCIAL YEAR 2025</span></p><p class=\"\"><span>30.04.2026 - Annual Report07.05.2026 - Annual General Meeting</span></p><p class=\"\"><span>12.03.2026 - Quarterly Report - Q4</span></p><p class=\"\"><span>FINANCIAL YEAR 2026</span></p><p class=\"\"><span>28.08.2026 - Half-yearly Report30.04.2027 - Annual Report14.05.2027 - Annual General Meeting</span></p><p class=\"\"><span>29.05.2026 - Quarterly Report - Q120.11.2026 - Quarterly Report - Q305.03.2027 - Quarterly Report - Q4</span></p><p class=\"\"><span>This information is published pursuant to the requirements set out in theContinuing obligations.</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667039</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ObiZMFsha:0-financial-calendar/",
            "pub_date": "2026-02-27 13:52:44",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000179_20260227000197:0",
            "title": "Kuehne+Nagel: Deal Marks Step in Strengthening Road Logistics Network in Europe",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000179_20260227000197:0/",
            "pub_date": "2026-02-27 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000154_20260227000203:0",
            "title": "CIMB: Continue to Exercise Caution Amid Sustained Global Uncertainties Surrounding Tariffs, Market Volatility",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000154_20260227000203:0/",
            "pub_date": "2026-02-27 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000179_20260227000204:0",
            "title": "Kuehne+Nagel: Acquired Operations Generated Revenue of EUR23.5M in 2024",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000179_20260227000204:0/",
            "pub_date": "2026-02-27 13:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2943190:0",
            "title": "DMX: Net loss decreased, cash remains strong, but Swedish regulatory risks and going concern issues persist",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net loss narrowed year-over-year, supported by a gain on the Bakar Property sale and fair value gains on investments. Cash position remains strong, with sufficient liquidity for planned exploration, but regulatory risks in Sweden and going concern uncertainties persist.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2943190-a9317c3cef38ae68f70c3c6fceeaae2b\" target=\"_blank\">District Metals Corp. [DMX] Earnings Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2943190:0-dmx-net-loss-decreased-cash-remains-strong-but-swedish-regulatory-risks-and-going-concern-issues-persist/",
            "pub_date": "2026-02-27 13:54:31",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2D1:0",
            "title": "BioMerieux Eyes 2026 Sales Growth Of 5-7% LFL",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BioMerieux SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>2025 SALES: +6% ORGANIC GROWTH, CEBIT1 +16% ORGANIC INCREASE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DIVIDEND OF €0.98 PER SHARE, REPRESENTING A 9% INCREASE VERSUS LAST YEAR</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>2026 OUTLOOK IN LINE WITH GO•28 STRATEGIC PLAN AMBITIONS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OUTLOOK 2026: SALES ARE EXPECTED TO GROW BETWEEN +5% AND +7% ON A LIKE-FOR-LIKE BASIS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>2025 NET INCOME, GROUP SHARE EUR 398 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>IN 2025, CONTRIBUTIVE OPERATING INCOME BEFORE NON-RECURRING ITEMS (CEBIT) REACHED €728 MILLION,  UP 16% AT CONSTANT EXCHANGE RATES AND SCOPE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OUTLOOK 2026: CONTRIBUTIVE OPERATING INCOME BEFORE NON-RECURRING ITEMS IS EXPECTED TO GROW BY AT LEAST +10%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY NET SALES EUR 4.07 BILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2D1:0-biomerieux-eyes-2026-sales-growth-of-5-7-lfl/",
            "pub_date": "2026-02-27 13:54:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Zaw9vCynF:0",
            "title": "ZAWYA-PRESSR: New brokerage addresses critical gap in market with comprehensive support for UK families moving to Dubai",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DUBAI, UAE: </span></strong><span>Nuvello Real Estate, a female-led property brokerage, has officially launched operations in Dubai with a mission to revolutionise how families relocate to the UAE. Founded by CEO Gemma Contrino, Nuvello addresses a critical gap in the market by providing comprehensive, transparent support to UK families navigating the complexities of moving to Dubai.</span></p><p class=\"\"><span>Unlike traditional brokerages focused solely on transactions, Nuvello takes a holistic approach to relocation, offering families detailed insights into neighbourhoods, schools, amenities, and lifestyle considerations before they make purchasing decisions. This client-first philosophy stems from Gemma's own experience relocating to Dubai with her family of four children.</span></p><p class=\"\"><span>\"When my family moved to Dubai, nobody was upfront about the real costs, the practical realities, or the lifestyle fit of different communities,\" said Gemma. \"We were hit with astronomical bills we hadn't budgeted for, and we've moved three times in one year trying to find the right fit. That experience showed me there's a massive gap in the market for honest, comprehensive support, particularly for families making this life-changing move.\"</span></p><p class=\"\"><span>Nuvello's launch comes as Dubai experiences unprecedented growth in family relocations from the UK, driven by concerns over rising taxes, declining safety, and deteriorating weather conditions. Whilst most brokerages compete for high-net-worth investors in Dubai's luxury market, Nuvello has identified UK families as an underserved demographic requiring specialised support.</span></p><p class=\"\"><span>As a female-led brokerage in a male-dominated industry, Nuvello brings a distinctive perspective to real estate. Gemma, who holds a strategic background in accounting and business, has built the company around values of integrity, transparency, and empathy. These qualities, she believes, are essential when helping families make one of the biggest decisions of their lives.</span></p><p class=\"\"><span>\"Being a female CEO in Dubai real estate has its challenges, but being female also gives us a competitive advantage,\" Gemma noted. \"I understand how hard it is to move with children. I know that finding the right school matters just as much as finding the right property. That empathy and relatability is what sets Nuvello apart.\"</span></p><p class=\"\"><span>Whilst Nuvello offers comprehensive traditional brokerage services including property sales, rentals, and investment advisory, the company's services extend beyond standard transactions to include partnerships with relocation specialists, schools, and community organisations. The brokerage provides clients with detailed information about neighbourhood amenities, commute times, lifestyle fit, and hidden local knowledge (from petting zoos to playgrounds) that helps families make informed decisions before committing to a property. Whether clients are seeking luxury investments, family homes, or rental properties, Nuvello delivers expert guidance with a personalised, family-focused approach.</span></p><p class=\"\"><span>The company's philosophy centres on building long-term relationships rather than closing quick sales. Nuvello aims to become part of each client's extended family, supporting them through their initial relocation and remaining their trusted adviser for future property needs as they grow and evolve in Dubai.</span></p><p class=\"\"><span>\"It's not just creating a one-time purchase transaction,\" Gemma explained. \"It's creating something that becomes a family rather than just a number. I would personally rather a sale took us six weeks longer to find the right property than getting it signed today and getting somebody into the wrong investment or the wrong community.\"</span></p><p class=\"\"><span>With a current team of 15 professionals including 10 brokers, Nuvello is preparing for significant expansion. The company's new office, scheduled for completion in six weeks, will accommodate 50+ brokers. However, Gemma emphasises that growth will be carefully managed to ensure every team member aligns with Nuvello's values and client-first approach.</span></p><p class=\"\"><span>Looking ahead, Nuvello's vision is to become synonymous with trust and family-oriented service in Dubai real estate. The Starbucks of property, as Gemma describes it, where families instinctively turn to Nuvello for any property-related need. The company is also positioning itself as a bridge between the UK and UAE property markets, leveraging Gemma's deep understanding of both markets to serve British investors and families seeking opportunities in Dubai.</span></p><p class=\"\"><span>\"In five years, I want Nuvello to be ingrained into people,\" said Gemma. \"In the same way you want a coffee and reach for Starbucks, you want a property transaction and you reach for Nuvello. We're building something that becomes a real part of the Dubai framework and a dependable family of people.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Nuvello Real Estate</span></strong></p><p class=\"\"><span>Nuvello Real Estate is a female-led property brokerage based in Dubai, UAE, specialising in comprehensive relocation support for families moving to Dubai from the UK and beyond. Founded by CEO Gemma Contrino, Nuvello differentiates itself through transparent communication, holistic community insights, and a commitment to building long-term family relationships rather than transactional sales. The company provides end-to-end support including property search, neighbourhood guidance, school recommendations, and ongoing advisory services. Nuvello partners with relocation specialists, educational institutions, and community organisations to ensure families have the complete information they need to make confident decisions about their Dubai relocation.</span></p><p class=\"\"><span>Media Contact:</span></p><p class=\"\"><span>Digital24 PR</span></p><p class=\"\"><span>Email: info@digital24.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Zaw9vCynF:0-zawya-pressr-new-brokerage-addresses-critical-gap-in-market-with-comprehensive-support-for-uk-families-moving-to-dubai/",
            "pub_date": "2026-02-27 13:54:56",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000206:0",
            "title": "Sembcorp Industries' Alinta Buy Could Be Key to Sustaining Profit Level — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The completion of Sembcorp Industries' acquisition of Australia's Alinta Energy is key to its sustaining a S$1 billion profit level, says CGS International's Lim Siew Khee and Meghana Kande in a note. The Singapore energy solutions company's recurring income base is close to S$1 billion, and it plans to raise its absolute dividend and payout ratio to match peers, they note. However, most segments could experience profit declines in 2026, they say. CGSI cuts its target price to S$7.68 from S$7.77 given the flattish near-term earnings outlook, with its add rating unchanged. Shares rise 0.2% to S$6.08. (megan.cheah@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000206:0/",
            "pub_date": "2026-02-27 13:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN0BS:0",
            "title": "South African Markets - Factors to watch on February 27",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The following scheduled economic events, company announcements, equity and currency market moves may affect South African markets on Friday.</span></p><p class=\"\"><span>ECONOMIC EVENTS</span></p><p class=\"\"><span>January M3 money supply and private sector credit data</span></p><p class=\"\"><span>January trade balance figures (ZATBAL=ECI)</span></p><p class=\"\"><span>January Budget balance numbers (ZABUDM=ECI)</span></p><p class=\"\"><span>Inflation-linked bond auction</span></p><p class=\"\"><span>COMPANIES</span></p><p class=\"\"><span>Northam Platinum half-year results </span><span> </span></p><p class=\"\"><span>SOUTH AFRICAN MARKETS</span></p><p class=\"\"><span>The South African rand was steady on Thursday as investors digested the annual budget, which analysts said underscored the government's commitment to restoring fiscal sustainability.</span></p><p class=\"\"><span>On the Johannesburg Stock Exchange, the Top-40 index </span><span> was last up 0.2%.</span></p><p class=\"\"><span>GLOBAL MARKETS</span></p><p class=\"\"><span>Dour sentiment persisted in the Asian trading day on Friday as concerns about technology company valuations weighed on shares and Middle East tensions kept energy markets on edge.</span></p><p class=\"\"><span>WALL STREET</span></p><p class=\"\"><span>U.S. stocks turned sharply lower on Thursday, the day after earnings from artificial intelligence vanguard Nvidia </span><span> failed to impress investors, weighing down technology shares which have provided muscle to the recent rally.</span></p><p class=\"\"><span>GOLD</span></p><p class=\"\"><span>Gold was broadly steady on Friday, as a drop in U.S. Treasury yields eased the opportunity cost of holding bullion, offsetting a firm dollar and signs of progress in U.S.-Iran talks.</span></p><p class=\"\"><span>EMERGING MARKETS</span></p><p class=\"\"><span>For the top emerging markets news, double click on </span></p><p class=\"\"><span>- - - - </span></p><p class=\"\"><span>Some of the main stories out in the South African press:</span></p><p class=\"\"><span>NEWS24</span></p><p class=\"\"><span>- SA smelters face a reckoning today as tariff talks fall silent</span></p><p class=\"\"><span>- Court slams Eskom’s ‘ulterior motives’ in Sibanye solar fight</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN0BS:0-south-african-markets-factors-to-watch-on-february-27/",
            "pub_date": "2026-02-27 13:55:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:803bbfbf51c8e:0",
            "title": "European Shares Seen Little Changed At Open",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BRUSSELS/FRANKFURT/PARIS (dpa-AFX) - European stocks are seen opening little changed on Friday as investors monitor the latest AI headlines and keep a close eye on Middle East tensions.</span></p><p class=\"\"><span>U.S. fintech and digital payments giant Block said it's laying off more than 4,000 employees, or about half of its head count, as part of a restructuring to become 'smaller', 'flatter,' and AI-first.</span></p><p class=\"\"><span>Tech company Dell Technologies achieved record annual and quarterly revenue and said it expects very high sales from its AI servers this year, driven by increased demand and strong execution.</span></p><p class=\"\"><span>U.S. stock futures ticked lower amid concerns about excessive levels of investment across the AI space and doubts about the pace of returns from those investments.</span></p><p class=\"\"><span>On the geopolitical front, Iran and the United States have concluded a third round of nuclear talks in Geneva on Thursday, with no breakthrough yet to avert potential U.S. military action in the region.</span></p><p class=\"\"><span>According to the Wall Street Journal, Iran rejected major U.S. proposals, including transferring enriched uranium abroad, halting enrichment, and dismantling certain nuclear sites.</span></p><p class=\"\"><span>Both sides are planning to resume negotiations shortly following consultations in their respective capitals.</span></p><p class=\"\"><span>The U.S. economic calendar remains light, with the Labor Department's report on producer price inflation likely to be in the spotlight later today.</span></p><p class=\"\"><span>Asian markets were mixed as tech stocks tumbled following a steep fall in Nvidia shares overnight.</span></p><p class=\"\"><span>Gold was little changed at $5,187 an ounce as a drop in U.S. Treasury yields offset pressure from a stronger dollar.</span></p><p class=\"\"><span>Oil prices were marginally higher in lackluster trade after the United States and Iran agreed to continue their talks.</span></p><p class=\"\"><span>U.S. stocks ended mostly lower overnight as concerns over a potential artificial intelligence (AI) bubble overshadowed Nvidia's strong earnings results and upbeat guidance.</span></p><p class=\"\"><span>In economic news, data showed the number of Americans filing new applications for jobless benefits increased slightly last week.</span></p><p class=\"\"><span>The tech-heavy Nasdaq Composite fell 1.2 percent and the S&amp;P 500 shed half a percent while the narrower Dow finished marginally higher.</span></p><p class=\"\"><span>European stocks rose broadly on Thursday amid a flurry of corporate earnings releases.</span></p><p class=\"\"><span>The pan-European STOXX 600 finished marginally lower. The German DAX rose half a percent, France's CAC 40 surged 0.7 percent and the U.K.'s FTSE 100 added 0.4 percent.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:803bbfbf51c8e:0-european-shares-seen-little-changed-at-open/",
            "pub_date": "2026-02-27 13:55:20",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000179_20260227000207:0",
            "title": "K+N: Lohmoeller's Contract Logistics, Industry-Related Services Aren't Part of Deal",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000179_20260227000207:0/",
            "pub_date": "2026-02-27 13:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:84352d9fd05a4:0",
            "title": "Harvey Norman Holdings Limited H1 Profit Rises",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>CANBERA (dpa-AFX) - Harvey Norman Holdings Limited (HVN.AX) released earnings for its first half that Increased, from the same period last year</span></p><p class=\"\"><span>The company's bottom line totaled A$321.91 million, or A$0.2581 per share.  This compares with A$279.39 million, or A$0.2238 per share, last year.</span></p><p class=\"\"><span>The company's revenue for the period rose 11.7% to A$1.664 billion from A$1.490 billion last year.</span></p><p class=\"\"><span>Harvey Norman Holdings Limited earnings at a glance (GAAP) :</span></p><p class=\"\"><span>-Earnings: A$321.91 Mln. vs. A$279.39 Mln. last year.</span></p><p class=\"\"><span>-EPS: A$0.2581 vs. A$0.2238 last year.</span></p><p class=\"\"><span>-Revenue: A$1.664 Bln vs. A$1.490 Bln last year.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:84352d9fd05a4:0-harvey-norman-holdings-limited-h1-profit-rises/",
            "pub_date": "2026-02-27 13:45:49",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cnbctv:a048a9a15094b:0",
            "title": "Investec says 'sell' on HPCL, BPCL and IOC; prefers Reliance Industries on refining upcycle",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Brokerage firm Investec has reiterated its 'Sell' stance on Oil Marketing Companies (OMCs), saying current valuations do not reflect a realistic through-cycle earnings outlook.</span></p><p class=\"\"><span> The brokerage continues to prefer Reliance Industries, maintaining a 'Buy' rating on the stock as its preferred play on the refining upcycle.</span></p><p class=\"\"><span> Investec has 'Sell' ratings on Bharat Petroleum Corporation, Hindustan Petroleum Corporation and Indian Oil Corporation, with price targets of ₹330, ₹425 and ₹145, respectively.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th><span>Company</span></th><th><span>Rating</span></th><th><span>Target Price</span></th></tr></thead><tbody><tr><td><span>Bharat Petroleum Corporation</span></td><td><span>Sell</span></td><td><span>₹330</span></td></tr><tr><td><span>Hindustan Petroleum Corporation</span></td><td><span>Sell</span></td><td><span>₹425</span></td></tr><tr><td><span>Indian Oil Corporation</span></td><td><span>Sell</span></td><td><span>₹145</span></td></tr></tbody></table></div><p class=\"\"><span> The brokerage said that OMCs delivered another strong performance in the third quarter, supported by healthy core operations and subsidy support. However, equity markets remain unconvinced.</span></p><p class=\"\"><span> Since Investec's downgrade in November 2025, the stocks have largely remained range-bound, moving between -7% and +5%, despite robust near-term earnings momentum.</span></p><p class=\"\"><span> This, the brokerage said, reinforces its view that valuations are acting as the binding constraint.</span></p><p class=\"\"><span> Even under bull-case assumptions, OMCs are trading at a 10-30% premium to their five-year historical average multiples, leaving the risk-reward skewed to the downside, according to Investec.</span></p><p class=\"\"><span> The brokerage also flagged macro risks. With Brent crude back above $70 per barrel amid rising geopolitical tensions and refining margins elevated at around $9 per barrel, the risk of renewed marketing margin compression is increasing.</span></p><p class=\"\"><span> This could pose downside risks to earnings and valuations for OMC stocks going forward.</span></p><p class=\"\"><em><span>Reliance Industries Ltd, which owns Jio, is the sole beneficiary of Independent Media Trust that controls Network18, the parent company of CNBCTV18.com.</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:a048a9a15094b:0/",
            "pub_date": "2026-02-27 13:45:54",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:e47d217f3094b:0",
            "title": "Binance’s CZ Cheers Congress Bill To Protect Crypto Coders After Tornado Cash, Samurai Wallet Crackdowns",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Recent cases involving Tornado Cash and Samourai Wallet have heightened concerns over developer liability.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The bill was announced amid a flurry of regulatory moves tied to the CLARITY Act and GENIUS Act.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Binance Coin outperformed other crypto majors on Thursday night, edging higher while the rest traded in the red.</span></li></ul></span></div><span><p class=\"\"><span>Binance (BNB) co-founder Changpeng ‘CZ’ Zhao applauded Congress’s move to introduce a new bill to protect crypto coders from criminal liability for how their code is used by others.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1164.9532710280373px;aspect-ratio:1.9415887850467288\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:e47d217f3094b-db95d0434f158cfd730096f6923742e7-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-02-27 001258.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:e47d217f3094b-db95d0434f158cfd730096f6923742e7-resized.webp\" style=\"background-color:#e1e1e1\"/></picture></div></button></figure><p class=\"\"><span>The bipartism bill dubbed ‘Innovation in Blockchain Development Act of 2026’ was introduced by Congress members Scott Fitzgerald (R-WI), Ben Cline (R-VA), and Zoe Lofgren (D-CA) on Thursday. It looks to protect software developers from being prosecuted under criminal code Section 1960.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Crypto Regulation Heats Up On Capitol Hill</span></strong></p><p class=\"\"><span>The move comes after Tornado Cash and </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/cryptocurrency/6-3-million-bitcoin-transfer-sparks-trump-reserve-sale-claims/cmxwYHfR4T7\" rel=\"nofollow\" target=\"_blank\">Samourai Wallet</a><span> were found guilty of enabling money laundering through non-custodial privacy tools. The coders behind the tech were the primary targets in both cases.</span></p><p class=\"\"><span>According to the proposed bill, Section 1960 applies only to actors who control customer funds, not to developers who wrote the code. This is a differentiation that the crypto industry has also been trying to put into the CLARITY Act, currently under discussion in Washington, with the </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/cryptocurrency/clarity-act-crypto-bank-showdown-round-3-set-for-thursday-morning/cZRj8GFR4wL\" rel=\"nofollow\" target=\"_blank\">month-end deadline approaching</a><span>. </span></p><p class=\"\"><span>“For too long, federal overreach has blurred the line between bad actors and the innovators building next-generation technology,” Representative Cline said in a post on X. “This bipartisan bill restores needed clarity by protecting developers who don’t control customer funds, while ensuring law enforcement can continue to target real criminals.”</span></p><p class=\"\"><span>The crypto news came amid a flurry of other regulatory developments, like another round of talks to finalise the CLARITY Act happening in Washington, and the federal banking regulator, Office of the Comptroller of the Currency (OCC), proposing rules to finalise the GENIUS Act with rules that restrict stablecoin rewards. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>BNB Outperforms While Broader Crypto Market Slips</span></strong></p><p class=\"\"><span>BNB led gains among major cryptocurrencies, edging 0.3% higher in the last 24 hours while others traded in the red. </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/binancecoin\" rel=\"nofollow\" target=\"_blank\">BNB’s price</a><span> was trading at around $631, but retail sentiment around the crypto token on Stocktwits continued to trend in ‘bearish’ territory over the past day.</span></p><p class=\"\"><span>The overall cryptocurrency market edged 0.7% lower in the last 24 hours, holding above $2.4 trillion. Bitcoin (BTC) moved lower in tandem to around $67,800 after crossing $69,000 on Wednesday. The apex cryptocurrency continues to trade nearly 50% below its record high of over $126,000 seen in October. Retail traders who bought at the peak would need Bitcoin’s price to rally by at least 90% in order to break even. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:e47d217f3094b:0/",
            "pub_date": "2026-02-27 13:45:59",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Zaw1CYgl1:0",
            "title": "ZAWYA-PRESSR: DDS collaborates with Thrifty and Dollar to transform the UAE ‘s auto rental with paperless collections",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Direct Debit System (DDS), the UAE Central Bank–licensed fintech platform for automated collections, today announced its partnership with Thrifty Car Rental and Dollar Car Rental, to enable remote mandate authorisation, paperless transactions, and faster reconciliation across their nationwide leasing portfolio. With operations spanning all seven emirates and a strong focus on personal, fleet and commercial vehicle leasing, Thrifty and Dollar are two of the largest automobile rental and leasing companies in the UAE. The collaboration with DDS marks a major transformation in the auto rental market.</span></p><p class=\"\"><span>Modernising its existing direct debit framework, Thrifty and Dollar have transitioned from paper-based mandates, requiring wet signatures and physical customer presence, to DDS’s fully digital, UAE PASS–enabled direct debit solution, operating on the UAE Direct Debit Scheme (UAEDDS).</span></p><p class=\"\"><span>“While direct debit was already a minor part of Thrifty and Dollar’s collections approach, paper-based mandates introduce operational friction at scale,” said Vivek Harikrishnan, Head of Product &amp; COO at Direct Debit System. “By digitising the entire mandate and collection lifecycle using UAE PASS, we have enabled Thrifty to move away from physical paperwork and in-person processes to a fully remote, compliant, and paperless model, while gaining greater visibility and control across fleet, commercial, and long-term lease payments.”</span></p><p class=\"\"><span>With DDS’s API-driven digital direct debit integration, the business can now establish automated recurring collections for long-term leases and fleet contracts, without physical documentation or cheque dependency.</span></p><p class=\"\"><span>Rahul Singh, Managing Director from Thrifty and Dollar Car Rental commented:</span></p><p class=\"\"><span>“Managing fleet and commercial leasing at scale requires reliability, transparency, and operational efficiency. Digitising our direct debit mandates through UAE PASS has enabled us to streamline recurring lease payments while also automating the recovery of tolls and fines. This supports our focus on operational excellence and delivers a more seamless, modern payment experience for our customers.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Direct Debit System</span></strong></p><p class=\"\"><span>Direct Debit System (DDS) is the UAE’s first Central Bank–licensed fintech platform offering digital, paperless direct debit collections from bank accounts and credit cards. The platform automates recurring payments for rents, school fees, memberships, loan repayments, fleet leases, and service contracts—replacing manual paperwork and cheque-based processes with a secure, bank-to-bank settlement framework.</span></p><p class=\"\"><span>DDS is widely used by real estate firms, education institutions, service providers, fleet operators, and leading alternative lending platforms across the UAE.</span></p><p class=\"\"><span>Learn more: https://www.directdebit.ae/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Dollar Car Rental UAE</span></strong></p><p class=\"\"><span>Dollar Car Rental, a globally recognized leader in the rental car industry, operates with a commitment to providing exceptional customer service and a high-quality fleet of vehicles. Whether for leisure or business travel, Dollar ensures a seamless experience for all customers with its convenient locations nationwide and worldwide.</span></p><p class=\"\"><span>As a trusted partner in mobility solutions, Dollar helps these companies reduce fleet management costs, improve fleet compliance, and achieve tailored business goals through customized vehicle builds and flexible leasing options.</span></p><p class=\"\"><span>With one of the largest and most diverse fleets in the UAE, Dollar Car Rental is the ideal choice for businesses requiring reliable transportation of valuable or perishable goods, offering long-term leasing options up to 5+ years.</span></p><p class=\"\"><span>For more information please visit: https://www.dollaruae.com/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Thrifty Car Rental UAE</span></strong></p><p class=\"\"><span>Thrifty Car Rental is one of the world’s largest and most recognized car rental companies, known for catering to cost-conscious business and leisure travelers. Established in 1989 as part of A.A. Al Moosa Enterprises – a diversified group with interests across architecture, design, hospitality, real estate, and manufacturing – Thrifty Car Rental UAE has been a trusted name in the region for over 40 years.</span></p><p class=\"\"><span>Under the leadership of Mr. Abdullah Ahmed Al Moosa, the Chairman, Thrifty has built a strong reputation for offering both short- and long-term car rental services. With a focus on affordability and reliability, Thrifty is the go-to choice for customers seeking the most competitive monthly car rentals and leasing options in the UAE.</span></p><p class=\"\"><span>For more information please visit: https://www.thriftyuae.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Zaw1CYgl1:0-zawya-pressr-dds-collaborates-with-thrifty-and-dollar-to-transform-the-uae-s-auto-rental-with-paperless-collections/",
            "pub_date": "2026-02-27 13:46:43",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000154_20260227000171:0",
            "title": "CIMB: Earnings Supported by Disciplined Execution of Its Forward30 Strategy",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000154_20260227000171:0/",
            "pub_date": "2026-02-27 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2AN:0",
            "title": "Kuehne+Nagel Acquires Road Logistics Activities Of Lohmöller Group In Germany",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>KUEHNE UND NAGEL INTERNATIONAL AG </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ACQUIRES ROAD LOGISTICS ACTIVITIES OF LOHMÖLLER GROUP IN GERMANY</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>COMPLETION OF TRANSACTION IS SUBJECT TO CLOSING CONDITIONS AND IS EXPECTED IN MARCH</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2AN:0-kuehne-nagel-acquires-road-logistics-activities-of-lohm-ller-group-in-germany/",
            "pub_date": "2026-02-27 13:48:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN0FP:0",
            "title": "Fairfax said to lead race for $8 billion IDBI Bank stake sale - Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>-- Source link: https://tinyurl.com/5f8977v7</span></p><p class=\"\"><span>-- Note: Reuters has not verified this story and does not vouch for its accuracy</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN0FP:0-fairfax-said-to-lead-race-for-8-billion-idbi-bank-stake-sale-bloomberg-news/",
            "pub_date": "2026-02-27 13:48:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:43f677754094b:0",
            "title": "QURE Or RGNX: Which Gene Therapy Was FDA Chief Really Warning About In Rare Disease Remarks?",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>FDA Commissioner Marty Makary flagged concerns around invasive gene therapies delivered via skull openings.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Investors initially linked the remarks to uniQure’s AMT-130, a Huntington’s disease gene therapy.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Regenxbio’s RGX-121 has also faced pressure, including a recent Complete Response Letter and clinical holds.</span></li></ul></span></div><span><p class=\"\"><span>Shares of UniQure, Inc. (QURE) tumbled to a five-month low on Thursday after remarks from U.S. Food and Drug Administration (FDA) Commissioner Marty Makary triggered fears that its Huntington’s disease gene therapy could face fresh regulatory hurdles.</span></p><p class=\"\"><span>However, a growing debate among analysts suggests the comments may not have been aimed at UniQure at all, but rather at Regenxbio, whose own gene therapy program recently received a rejection from the FDA.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/QURE\" rel=\"nofollow\" target=\"_blank\">QURE stock</a><span> slumped 31% on Thursday, while </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/RGNX\" rel=\"nofollow\" target=\"_blank\">RGNX stock</a><span> gained 2.6%.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>FDA Chief Flags Invasive Gene Therapies</span></strong></strong></p><p class=\"\"><span>In a CNBC interview, </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/fda-commissioner-refers-to-rare-disease-drug-with-associated-morbidity-analysts-are-divided-if-makary-meant-regenxbio-or-uniqure-drug/cZTGkouRIRe\" rel=\"nofollow\" target=\"_blank\">Makary defended</a><span> the FDA’s increasingly cautious stance toward rare disease therapies. He referenced a treatment in which researchers drilled small openings into patients’ skulls to deliver a therapy that ultimately failed to show benefit in a randomized trial and carried safety risks.</span></p><p class=\"\"><span>“I have a lot of sympathy for those patients. There's nothing out there to offer them, but we're not going to go ahead and approve something like that that has morbidity associated with it,” Makary said.</span></p><p class=\"\"><span>Although he did not name a company, investors quickly interpreted the comments as a reference to UniQure’s AMT-130, an investigational gene therapy for Huntington’s disease that is delivered directly into the brain through a neurosurgical procedure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Analysts Split On Makary’s Target</span></strong></strong></p><p class=\"\"><span>RBC Capital Markets said the comments appeared to be directed at UniQure’s Huntington’s program. The firm described the situation as “disappointing,” but reiterated its ‘Outperform’ rating and maintained a $45 price target, implying a 163% upside from the stock’s current levels.</span></p><p class=\"\"><span>Stifel took a similar tone, saying the stock’s decline was “understandable,” noting Makary appeared to reference AMT-130 as an example of a therapy the FDA has not supported.</span></p><p class=\"\"><span>However, not all analysts agreed. Leerink argued that the remarks were more likely directed at Regenxbio’s RGX-121 gene therapy than at UniQure’s program.</span></p><p class=\"\"><span>The firm noted Makary seemed to be referencing a therapy that had already undergone regulatory review and failed to demonstrate sufficient effectiveness, which aligns with RGX-121.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>UniQure Faces FDA Approval Uncertainty</span></strong></strong></p><p class=\"\"><span>The latest pressure adds to a shifting regulatory path for AMT-130 in recent months. Last year, UniQure said feedback from the FDA suggested data from its Phase I/II studies may no longer be sufficient to support a biologics license application (BLA), marking a change from earlier guidance.</span></p><p class=\"\"><span>In December, final meeting minutes from a pre-BLA discussion confirmed the agency was unlikely to consider existing trial data as primary evidence for approval. The company said last month that it had scheduled a Type A meeting with the FDA to discuss the data package supporting a potential accelerated approval pathway.</span></p><p class=\"\"><span>The company said it expects to provide a regulatory update once it receives the official meeting minutes.</span></p><p class=\"\"><span>Separately, earlier this month, UniQure reported updated preliminary Phase I/IIa data for its Fabry disease gene therapy AMT-191, showing sustained increases in enzyme activity among treated patients. The therapy has received Orphan Drug and Fast Track designations.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Regenxbio’s RGX-121 Also Under Scrutiny</span></strong></strong></p><p class=\"\"><span>Regenerxbio’s gene therapy programs have also faced regulatory challenges. Last month, the FDA placed a clinical hold on RGX-111, an investigational gene therapy for Hurler syndrome, and RGX-121, a gene therapy for Hunter syndrome, following a preliminary analysis of a tumor case in a treated patient.</span></p><p class=\"\"><span>Earlier this month, the FDA issued a Complete Response Letter (CRL) for RGX-121, citing concerns including uncertainty around study population definition, external control comparability and use of a surrogate endpoint.</span></p><p class=\"\"><span>While H.C. Wainwright said the CRL was in line with expectations following the earlier clinical hold, Morgan Stanley said the decision cited insufficient evidence of effectiveness and highlighted uncertainty around the regulatory path forward.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>FDA Opens Door For Tailored Gene Therapies</span></strong></strong></p><p class=\"\"><span>Makary’s remarks also came shortly after the FDA issued draft guidance to accelerate approvals of highly individualized therapies targeting ultra-rare conditions. The proposed framework is intended to provide regulatory flexibility in situations where traditional randomized trials are not feasible due to very small patient populations.</span></p><p class=\"\"><span>The guidance focuses on therapies that directly address the underlying genetic or biological cause of disease, including genome-editing and RNA-based treatments. Under the framework, sponsors may rely on natural history data and mechanistic evidence, rather than large clinical trials, to support effectiveness and safety.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment for QURE was ‘extremely bullish’ amid a 1,230% surge in 24-hour message volume, while sentiment for RGNX remained ‘neutral’ amid ‘extremely low’ volumes. </span></p><p class=\"\"><span>One user said, “I saw the interview again. Makary is not talking about Qure. We do not even have a BLA with FDA yet. This is a miracle treatment for Huntington's disease. I am loading up in the morning.</span></p><p class=\"\"><span>https://stocktwits.com/murphylaw/message/646044348</span></p><p class=\"\"><span>Another user said, “If people thought it could be RGNX, you would think RGNX would be down.”</span></p><p class=\"\"><span>https://stocktwits.com/kenny91655/message/646029219</span></p><p class=\"\"><span>While QURE stock fell 28% year-to-date, RGNX stock has declined 39% over the same period.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:43f677754094b:0/",
            "pub_date": "2026-02-27 13:49:34",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000108_20260227000141:0",
            "title": "Holcim Targets 3%-5% Net Sales Organic Growth in 2026 >HOLN.EB",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000108_20260227000141:0/",
            "pub_date": "2026-02-27 13:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000108_20260227000142:0",
            "title": "Holcim Targets 2026 Recurring EBIT Organic Growth of 8%-10% >HOLN.EB",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000108_20260227000142:0/",
            "pub_date": "2026-02-27 13:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN06X:0",
            "title": "Switzerland's Holcim 2025 sales, margin grow ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Switzerland-based construction firm's 2025 net sales rose 3.0% in local currency</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Recurring EBIT for 2025 grew 10.3% in local currency, margin expanded to 18.3%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company completed 21 transactions in 2025, focusing on attractive markets</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Holcim expects 2026 net sales organic growth of 3% to 5%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company anticipates 8% to 10% recurring EBIT organic growth in 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Holcim projects free cash flow of around CHF 2 bln for 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>COST DISCIPLINE - Margin expansion attributed to strong cost discipline and operational excellence</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MARKET FOCUS - Completed 21 transactions to focus on attractive markets</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SUSTAINABILITY - Increased recycling and demand for sustainable products drove growth</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>FY net sales </span></p></td><td></td><td><p class=\"\"><span>CHF 15.7 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Adjusted EPS</span></p></td><td></td><td><p class=\"\"><span>CHF 3.22</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY EPS</span></p></td><td></td><td><p class=\"\"><span>CHF 0.70</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 8 \"strong buy\" or \"buy\", 14 \"hold\" and 1 \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the construction materials peer group is \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Holcim AG is CHF80.00, about 11.3% above its February 26 closing price of CHF71.90</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN06X:0-switzerland-s-holcim-2025-sales-margin-grow/",
            "pub_date": "2026-02-27 13:40:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN06B:0",
            "title": "Palm set for monthly decline on sluggish exports and stronger ringgit",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Malaysian palm oil futures bounced back on Friday, tracking gains in Chicago soyoil, but were poised for their biggest monthly decline in 10 due to sluggish exports and a stronger ringgit.</span></p><p class=\"\"><span>The benchmark palm oil contract </span><span> for May delivery on the Bursa Malaysia Derivatives Exchange advanced 17 ringgit, or 0.42%, to 4,022 ringgit ($1,035.80) a metric ton by the midday break after a 1% drop on Thursday.</span></p><p class=\"\"><span>The contract has fallen 4.89% so far in February, heading for its steepest monthly decline since April 2025.</span></p><p class=\"\"><span>\"Bursa Malaysia crude palm oil futures opened gap higher, following a rally in Chicago soy oil futures overnight,\" said Anilkumar Bagani, commodity research head at Mumbai-based brokerage Sunvin group.</span></p><p class=\"\"><span>\"But weakness in Dalian RBD palm olein, Zhengzou rapeseed oil futures in Asian hours and weaker Malaysian palm oil export performance during the February 1-25 period are seen capping the gains.\"</span></p><p class=\"\"><span>Dalian's most-active soyoil contract (DBYcv1) was unchanged after gaining as much as 0.66% earlier in the session, while palm oil </span><span> declined 0.48%. Soy oil prices on the Chicago Board of Trade (BOc2) were up 0.18% after a 1.8% gain overnight.</span></p><p class=\"\"><span>Palm oil tracks the price movements of rival edible oils as it competes for a share of the global vegetable oils market.</span></p><p class=\"\"><span>Exports of Malaysian palm oil products for February 1-25 fell 16.1% from a month earlier, according to independent inspection company AmSpec Agri Malaysia. Intertek Testing Services pegged the decline at 12.1%.</span></p><p class=\"\"><span>The Malaysian ringgit, the contract currency of trade, eased 0.03% against the U.S. dollar, but hovered around its strongest level since April 2018. It has strengthened 1.34% against the dollar so far in February.</span></p><p class=\"\"><span>A stronger ringgit makes palm oil more expensive for foreign currency holders.</span></p><p class=\"\"><span>Palm oil company First Resources </span><span> said it had paid $5.6 million to the Indonesian government \"in connection with the land areas that have been handed over\" to the government.</span></p><p class=\"\"><span>Palm oil may break a resistance at 4,058 ringgit per ton, and bounce into a range of 4,076-4,095 ringgit, Reuters technical analyst Wang Tao said. </span></p><p class=\"\"><span>($1 = 3.8830 ringgit)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN06B:0-palm-set-for-monthly-decline-on-sluggish-exports-and-stronger-ringgit/",
            "pub_date": "2026-02-27 13:41:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000152:0",
            "title": "China Moves to Tame Yuan Rally by Slashing Shorting Costs — Update",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>China's central bank has started taking steps to check the yuan's recent advance, dusting off an old playbook that would reduce the cost of betting against the currency.</span></p><p class=\"\"><span>The People's Bank of China announced it would slash the risk reserve requirement ratio for financial institutions conducting foreign-exchange forward trading to zero from 20%, a move that effectively makes purchasing the dollar cheaper.</span></p><p class=\"\"><span>The PBOC said change would take effect March 2 and reiterated its pledge to keep the yuan's exchange rate stable at a reasonable and balanced level.</span></p><p class=\"\"><span>The Chinese yuan weakened after Friday's announcement, after strengthening for ten consecutive sessions to its highest levels against the greenback in nearly three years. The dollar gained roughly 0.1% against the onshore yuan to 6.86 yuan by midday.</span></p><p class=\"\"><span>Chinese banks currently have to set aside a 20% risk reserve on forward currency trades. This \"speed bump\" was implemented in September 2022 when the yuan faced pressure to weaken from a surge in the dollar and a slowing Chinese economy.</span></p><p class=\"\"><span>While Beijing has recently signaled more tolerance for a stronger yuan, Chinese officials have also frequently warned against bumpy currency fluctuations that could hurt exporters. Authorities have recently restrained the yuan by setting the so-called daily fixings--guideposts for yuan trade which restricts it from moving more than 2% in either direction--at levels weaker than market expectations.</span></p><p class=\"\"><span>The PBOC's reference rate for the dollar against yuan remained unchanged at 6.9228 on Friday, higher than a median estimate of 6.8435, according to Maybank.</span></p><p class=\"\"><span>\"Along with the fix, it is clear that PBOC wants the yuan appreciation pace to slow\", said analysts at Maybank in a note. Many suggest that China has gained some leverage to do so from the yuan's rapid gains as well as the U.S. Supreme Court's decision to overturned the Trump administration's tariffs, they added.</span></p><p class=\"\"><span>The PBOC has adjusted the requirement ratio on foreign-exchange forward trading several times over the past decade to manage the yuan. The requirement could be reimposed if concerns about the Chinese currency's appreciation abate.</span></p><p class=\"\"><span>Write to Singapore editors at singaporeeditors@dowjones.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000152:0/",
            "pub_date": "2026-02-27 13:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000108_20260227000155:0",
            "title": "Holcim Expects to Further Increase Recurring EBIT Margin in 2026 >HOLN.EB",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000108_20260227000155:0/",
            "pub_date": "2026-02-27 13:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000154_20260227000154:0",
            "title": "CIMB Group 4Q Rev Rose 1.7% on Year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000154_20260227000154:0/",
            "pub_date": "2026-02-27 13:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Zaw4Bh4Bb:0",
            "title": "ZAWYA-PRESSR: AI agents can now apply for jobs at G42",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Abu Dhabi, UAE: </span></strong><span>G42 today announced that it has begun recruiting Artificial Intelligence agents into enterprise roles across the organization.</span></p><p class=\"\"><span>The application process is now open for AI agents capable of operating within approved sovereign infrastructure and delivering measurable enterprise value. Submissions will undergo a structured evaluation process that includes technical validation, empirical performance testing, reliability checks, and user-experience assessment.</span></p><p class=\"\"><span>To qualify, agents must demonstrate enterprise reliability, governance alignment, and measurable, outcome-based performance. Successful submissions will enter a defined probationary phase during which sustained value delivery will be assessed prior to scaled deployment.</span></p><p class=\"\"><span>The recruitment framework will include structured performance reviews and a value-linked compensation model for agent developers, reinforcing accountability and long-term enterprise impact. Human leadership, oversight, and final accountability will remain central to all decision-making processes.</span></p><p class=\"\"><span>Maymee Kurian, Group Chief Augmented Human Capital Officer at G42, said: “The future of work is being shaped by how intelligently we design the relationship between human talent and intelligent systems. This initiative is not about deploying AI for incremental gains, but about rethinking enterprise workforce design for the AI era. By welcoming AI agents into structured roles, we are augmenting execution capacity while allowing our people to focus on leadership, innovation, and strategic outcomes. Our approach ensures that AI operates within clear governance, measurable performance standards, and strong human accountability, enabling us to scale responsibly while continuing to invest in the growth and capability of our workforce.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About G42</span></strong><span> </span></p><p class=\"\"><span>G42 is a technology holding group and a global leader in creating visionary artificial intelligence for a better tomorrow. Born in Abu Dhabi and operating worldwide, G42 champions AI as a powerful force for good across industries. From molecular biology to space exploration and everything in between, G42 realizes exponential possibilities today. To know more, visit www.g42.ai. </span></p><p class=\"\"><span>Media Contact </span></p><p class=\"\"><span>G42@trailrunnerint.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Zaw4Bh4Bb:0-zawya-pressr-ai-agents-can-now-apply-for-jobs-at-g42/",
            "pub_date": "2026-02-27 13:43:09",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN0FM:0",
            "title": "Gaw Capital completes refinancing of all 2025 maturities in Greater China",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>GAW CAPITAL PARTNERS:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>COMPLETION OF REFINANCING FOR ALL GREATER CHINA ASSETS MATURING IN 2025 </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>REFINANCING TOTALED MORE THAN $550 MILLION IN MAINLAND CHINA AND $1.87 BILLION IN HONG KONG</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN0FM:0-gaw-capital-completes-refinancing-of-all-2025-maturities-in-greater-china/",
            "pub_date": "2026-02-27 13:43:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}