{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310246:0",
            "title": "Southwest Airlines Keeps Quarterly Dividend at $0.18 a Share, Payable April 2 to Holders of Record on March 12",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310246:0/",
            "pub_date": "2025-02-06 00:27:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008102:0",
            "title": "Zillow Group Is Maintained at Buy by Benchmark",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:28 GMT) </strong>Zillow Group Price Target Raised to $100.00/Share From $80.00 by Benchmark</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008102:0/",
            "pub_date": "2025-02-06 00:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310249:0",
            "title": "Baird Adjusts AMETEK Price Target to $197 From $200",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AMETEK  has an average rating of overweight and mean price target of $203.50, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310249:0/",
            "pub_date": "2025-02-06 00:28:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310225:0",
            "title": "Advanced Micro Devices' Lack of Datacenter Revenue Growth, AI Visibility Remains Concerning, Morgan Stanley Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Advanced Micro Devices'  overall Q4 results were about in line, however, the main issue remains the lack of growth in datacenter revenue, Morgan Stanley said in a note Wednesday. </p><p class=\"\">The analysts said that in the Q3 earnings call, the company suggested datacenter would be the largest contributor to quarter-over-quarter growth in Q4, but the client segment ended up being the bigger contributor. Even if all the growth versus the midpoint of guidance came from the client segment, both areas still contributed similarly to the quarter-over-quarter growth in December. They added that it is especially disappointing considering that datacenter revenue in H1 is expected to be similar to H2 2024, contrary to their more optimistic view that server business was improving toward the end of 2024. </p><p class=\"\">\"Our biggest concern has been expectations in artificial intelligence, which clearly have come down closer to our level; consensus numbers for calendar year 2025 are likely to come down to our level, and we are relatively optimistic around traditional servers as well as embedded, but AI visibility likely needs to improve for the stock to find its footing,\" the analysts said. </p><p class=\"\">They added that while there may be a slowdown in the client segment at some point due to the strong 2024, it is clear that Advanced Micro Devices can continue to capture modest market share there. That being said, AI expectations still drive the stock's value, and they believe it's important to remain \"conservative\" for the 2025 calendar year, as the transition from the MI325 to MI350 models is not moving as quickly as Nvidia's shift from the H200 to Blackwell models. </p><p class=\"\">Morgan Stanley adjusted its price target on Advanced Micro Devices to $137 from $147 while keeping its equalweight rating. </p><p class=\"\">Shares fell by nearly 9% in recent trading activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310225:0/",
            "pub_date": "2025-02-06 00:28:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310251:0",
            "title": "Truist Securities Adjusts AMETEK Price Target to $216 From $222, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AMETEK  has an average rating of overweight and mean price target of $203.50, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310251:0/",
            "pub_date": "2025-02-06 00:29:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310250:0",
            "title": "Twin Disc Keeps Quarterly Dividend at $0.04 a Share, Payable March 3 to Holders of Record Feb. 17",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310250:0/",
            "pub_date": "2025-02-06 00:29:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008112:0",
            "title": "U.S. Gold Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">    New York (Dow Jones)--Engelhard Corp's base price for industrial <br/>gold bullion was $2,864.00 per troy ounce, up $26.00 from previous. <br/>    Handy &amp; Harman's base price for gold was $2,871.15 per troy ounce, <br/>up $27.60. The fabricated form price was $3,186.98, up $30.64. <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008112:0/",
            "pub_date": "2025-02-06 00:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN2LwVN6:0",
            "title": "Proposed Issue and Placing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Faron Pharmaceuticals Ltd | Company announcement | February 05, 2025 at 18:30:00 EET</p><p class=\"\">Inside Information: Proposed Issue and Placing of preliminarily approx. EUR 10 million by way of an accelerated book-building</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">KEY HIGHLIGHTS</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A proposed private placement of newly issued treasury shares (“<strong class=\"root-Tkn6WL2y\">Placing Shares</strong>”) to raise preliminarily approximately EUR 10 million, to be conducted by way of an accelerated book-building, directed to a limited number of institutional and other investors.</li><li class=\"listItem-bmN0_SHH\">Subject to the Company raising approximately EUR 10 million, the Company will have sufficient funding for its working capital needs into Q4 2025 and be able to meet its financial covenants into August 2025. The total cash and cash equivalents held by the Company as of 31 December 2024 was ca. EUR 9.5 million.</li><li class=\"listItem-bmN0_SHH\">The net proceeds will strengthen the Company’s financial position ahead of its upcoming BEXMAB Phase II trial topline readout, which is expected in April 2025. The proceeds will be used for the continuation of the BEXMAB Phase II trial, mainly to produce follow-up data (duration of response and survival) and to prepare the package for end of Phase II FDA meeting and to enhance the Company’s balance sheet.  </li><li class=\"listItem-bmN0_SHH\">The Company will continue to actively evaluate further business transactions such as licensing as well as financing alternatives (e.g. equity, convertible or debt instruments) in order to achieve the best commercial outcome for its shareholders. The proposed Placing would improve the Company’s negotiation position ahead of the BEXMAB Phase II efficacy and safety readout, while also ensuring compliance with the financial covenants.</li><li class=\"listItem-bmN0_SHH\">Carnegie Investment Bank AB (publ), Finland Branch (“<strong class=\"root-Tkn6WL2y\">Carnegie</strong>”), Bryan, Garnier &amp; Co Ltd. and Bryan Garnier Securities SAS (together with Bryan, Garnier &amp; Co Ltd., “<strong class=\"root-Tkn6WL2y\">Bryan Garnier</strong>”) are acting as joint bookrunners (“<strong class=\"root-Tkn6WL2y\">Joint Bookrunners</strong>”) in the placing.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">TURKU, FINLAND</strong> - Faron Pharmaceuticals Ltd. (AIM: FARN, First North: FARON), a clinical-stage biopharmaceutical company focused on tackling cancers via novel immunotherapies, today announces a proposed private placement to raise preliminarily approximately EUR 10 million before expenses to a limited number of institutional investors and other investors (“<strong class=\"root-Tkn6WL2y\">Placing</strong>”). Carnegie and Bryan Garnier are acting as Joint Bookrunners in the Placing.</p><p class=\"\">The Placing will be conducted in a private placement by way of an accelerated book-building process in which selected investors may submit bids for the Placing Shares (the <strong class=\"root-Tkn6WL2y\">\"Bookbuild\"</strong>). The subscription price per Placing Share is to be determined on the basis of the bids received in the Bookbuild in EUR. The Bookbuild is expected to commence immediately following this announcement and is expected to end by 9:00 a.m. EET on 6 February 2025 at the latest. The Bookbuild may be discontinued or extended at any time during the book-building process. Following the close of the Bookbuild, the Board of Directors of Faron (the \"<strong class=\"root-Tkn6WL2y\">Board</strong>\") will first make the decision to issue the relevant number of treasury shares to Faron itself without consideration, followed by the decision to then convey such Placing Shares, including, as applicable, acceptance of the received bids, the number of Placing Shares to be conveyed to investors and the subscription price per Placing Share (the \"<strong class=\"root-Tkn6WL2y\">Issue Price</strong>\"), subject to the registration of the Placing Shares in the Finnish Trade Register. The Company has received non-binding indications of interest from potential investors to subscribe for the Placing Shares under the Placing during a pre-marketing process.</p><p class=\"\">As soon as practicable after the close of the Bookbuild, and following receipt of binding commitments from investors, an announcement will be made on the final number of the Placing Shares to be issued first to Faron itself without consideration and then to be conveyed to investors in the Placing, the expected registration date of the Placing Shares and the Issue Price.</p><p class=\"\">Further details on the terms and conditions of the Placing are set out below. The Placing Shares are expected to be admitted to trading on Nasdaq First North Growth Market Finland (“<strong class=\"root-Tkn6WL2y\">First North</strong>”) and AIM (“<strong class=\"root-Tkn6WL2y\">AIM</strong>”) in London as set out below.</p><p class=\"\">\"This fundraise will enable us to continue our ambitious <em>bexmarilimab</em> development program as previously communicated, with a specific focus on hematologic malignancies,” said Dr. Juho Jalkanen, Chief Executive Officer of Faron.</p><p class=\"\">As to alternative funding options and partnering discussions, the Company continues to evaluate timing, scope and the best available options and terms for a commercial deal. To allow continued flexibility in pursuing the best commercial outcome for the Company and its shareholders through being in a better negotiation position with BEXMAB Phase II efficacy and safety readout, while also ensuring compliance with the financial covenants, the Company will, while taking into account the actual equity raised in the Placing, also continue to actively evaluate further financing alternatives and business transactions (which could include equity or convertible instruments).  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">REASONS FOR THE PROPOSED PLACING</strong></p><p class=\"\">The development of <em>bexmarilimab</em> has advanced significantly over the past 12 months and the furthering of its development provides an opportunity to build additional value for shareholders. The proceeds of the Placing are to be used to advance the development of the Company’s pipeline and to strengthen the financial position of the Company.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><em>Bexmarilimab</em> development<ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Securing topline readout of Phase II BEXMAB trial in April 2025.</li><li class=\"listItem-bmN0_SHH\">Continuation of the BEXMAB Phase II trial to generate high-quality follow-up data (duration of response and survival)</li><li class=\"listItem-bmN0_SHH\">Preparing for a meeting with FDA after Phase II topline response rate readout.</li></ul></li><li class=\"listItem-bmN0_SHH\">Strengthening of financial position of the Company to enhance its position while securing compliance with financial covenants relating to financial arrangements.</li></ul><p class=\"\">DETAILS OF THE PROPOSED PLACING AND ISSUE OF EQUITY</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Faron intends to raise preliminarily approximately EUR 10 million by offering Placing Shares to a limited number of institutional and other investors in the Placing. The Company has an authorization to offer a maximum of 19,113,496 Placing Shares in the Company.</li><li class=\"listItem-bmN0_SHH\">Subject to the Company raising preliminarily approximately EUR 10 million, the Company will have sufficient funding for its working capital needs into Q4 2025.</li><li class=\"listItem-bmN0_SHH\">Carnegie and Bryan Garnier are acting as Joint Bookrunners in the Placing.</li></ul><p class=\"\">The proposed Placing is being carried out within the authorisation granted to the Board by shareholders at the Company’s Annual General Meeting held on 5 April 2024 to issue up to a total of 20,000,000 new ordinary shares in the Company as well as to convey up to the same maximum number (20,000,000) of treasury shares in the possession of the Company, in a directed share issue and in deviation from the shareholders’ pre-emptive rights. A total of 886,504 warrants have been issued by the Company in connection with a previous funding arrangement. Therefore, pursuant to the outstanding authority, the Company may issue and further convey up to a maximum of 19,113,496 ordinary shares, which represents approximately 18.3 per cent of all the issued shares and votes in the Company immediately prior to the Placing.</p><p class=\"\">The Placing, arranged by Carnegie and Bryan Garnier, will be conducted in a private placement by way of the Bookbuild, which is an accelerated book-building process in which selected investors may submit bids for the Placing Shares. In the Placing, the Company is primarily targeting long-term institutional and other qualified investors that are capable of offering substantial investments cost-effectively, at attractive terms. The Issue Price is to be determined on the basis of the bids received in the Bookbuild. The Bookbuild is expected to commence immediately following this announcement and is expected to end by 9:00 EET a.m. on 6 February 2025 at the latest. The Bookbuild may be discontinued at any time during the book-building process. Following the close of the Bookbuild, the Board will make the decision to issue the relevant number of new Placing Shares to the Company itself and subsequently convey the Placing Shares to the investors in the Placing, including deciding upon, as applicable, the acceptance of the received bids, the number of Placing Shares to be conveyed and the Issue Price. As soon as practicable after the close of the Bookbuild, receipt of binding commitments from investors and the Board having resolved on carrying out the Placing, an announcement will be made on the final outcome of the Bookbuild and, as applicable, the number of the Placing Shares to be issued to the Company itself and then conveyed to investors, the Issue Price as well as the expected registration date of the Placing Shares.</p><p class=\"\">In connection with the proposed Placing, the Company has entered into a placing agreement with Carnegie and Bryan Garnier (the \"<strong class=\"root-Tkn6WL2y\">Placing Agreement</strong>\"). Pursuant to the terms of the Placing Agreement, the Joint Bookrunners have agreed to use their reasonable endeavours to procure the subscription of Placing Shares.</p><p class=\"\">The Placing Agreement contain customary warranties and an indemnity from the Company in favour of the Joint Bookrunners. The Placing Agreement also contain provisions which enable the Joint Bookrunners to terminate the Placing Agreement in certain circumstances before the completion of the Bookbuild, the Board's resolution on carrying out the Placing and the settlement of the Placing Shares to investors, including where there has been a material breach of any of the warranties contained in the Placing Agreement or where there is a material adverse change, e.g., in the business or financial affairs of the Company. The Company has agreed to pay the Joint Bookrunners certain commissions and fees in connection with the Placing. Pursuant to the terms of the Placing Agreement, the Joint Bookrunners shall collect payment of the gross Issue Price from the investors in respect of the Placing Shares allocated in the Placing, paying such amounts to the Company on behalf of the investors and organizing the delivery of the Placing Shares to the investors against payment of the Issue Price in full (DVP).</p><p class=\"\"> The Placing is conditional upon, inter alia:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">the Placing Agreement having become unconditional in all respects;</li><li class=\"listItem-bmN0_SHH\">the Board resolving to carry out the Placing at the Issue Price and the Company and Joint Bookrunners entering into a separate pricing agreement confirming the Issue Price and the number of the Placing Shares; and</li><li class=\"listItem-bmN0_SHH\">the Placing Shares being issued and being registered with the Finnish Trade Register.</li></ul><p class=\"\">Subject to all conditions being met, the Placing Shares are expected to be entered in the Finnish Trade Register approximately on 6 February 2025.</p><p class=\"\">DEVIATION FROM THE PRE-EMPTIVE SUBSCRIPTION RIGHT OF SHAREHOLDERS</p><p class=\"\">As previously announced by the Company on 22 October 2024, in order to enable more flexibility in pursuing the best commercial outcome for the Company and its shareholders, in continued compliance with the financial covenants and to facilitate availability of high-quality Phase II BEXMAB efficacy data, the Company could, subject to market conditions, consider strengthening its financial position before concluding discussions concerning partnering as it believes that the better the Company is financed, the better its position is to conclude a partnership. The Company has been exploring and continues to explore several funding alternatives and has concluded that a promptly executed private placement by way of a book-building process is the most suitable option available to the Company at this time.</p><p class=\"\">The Placing represents a deviation from the shareholders’ pre-emptive subscription right. Prior to resolving to pursue the Placing, the Board has conducted an overall assessment and carefully investigated the alternatives for raising capital, also observing the broader fundraise arranged by the Company in June 2024 enabling shareholder participation. As previously announced, the Company’s current funding provides sufficient working capital into Q2 2025 and the Company’s ability to satisfy its financial covenants until the latter half of March 2025. The Placing, in the form of accelerated book-building, reduces both execution and completion risk as it enables an equity raise efficiently and in a timely manner, typically with a lower discount to the current trading price, less exposure to market volatility, at a lower cost and with significantly reduced completion risk compared to a share issue enabling broader shareholder and investor participation. In the Placing, the Company is primarily targeting long-term institutional and other qualified investors due to their capability of offering substantial investments cost-effectively, at attractive terms. In particular, the rapidness of the Placing is considered as a significant advantage as it would provide the Company with funding prior to the forthcoming topline readout of Phase II BEXMAB trial and, consequently, continued operations and flexibility in pursuing the best commercial outcome in the partnering discussions. As indicated by the Company in the summer 2024, a rights issue or a broader share issue, the latter as organised by the Company in June 2024 enabling wider shareholder participation would be significantly more time-consuming and require resources from the Company which the Company does not currently have. The private placement structure is known to the market from previous funding actions of the Company. Based on an overall assessment, the Board considers the Placing to be the most favourable alternative for the Company to raise capital.</p><p class=\"\">In light of the above, the Board considers that that the Placing is in the best interest of the Company and all of its shareholders, and that there is a weighty financial reason for the Company to deviate from the shareholders’ pre-emptive subscription right.</p><p class=\"\">As the subscription price in the Placing would be determined through an accelerated book-building process, it is the Board’s assessment that the subscription price is determined on market terms, reflecting current market conditions and investor demand.</p><p class=\"\">ISSUE OF THE PLACING SHARES AND ADMISSION TO TRADING</p><p class=\"\">The Placing Shares are expected to be issued in one tranche to the Company itself as treasury shares and subsequently conveyed to the investors, and applications will be made for the admission of the Placing Shares to trading on First North and AIM with said admissions expected to become effective and trading to commence on or around 7 February 2025 (the \"<strong class=\"root-Tkn6WL2y\">Admissions</strong>\"). The dates above may be subject to change.</p><p class=\"\">A further announcement will be made to confirm the outcome of the Placing (subject to, <em>inter alia</em>, satisfaction of the above conditions) and to confirm the expected timing of issue of the Placing Shares to the Company itself and subsequent issuance to investors, and the Admissions.</p><p class=\"\">Upon registration with the Finnish Trade Register and further conveyance of the Placing Shares to investors (DVP), the Placing Shares will rank <em>pari passu</em> in all respects with the existing shares of the Company.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information please contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contact, Media Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Faron Pharmaceuticals</strong></p><p class=\"\">E-mail: faron@icrhealthcare.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ICR Healthcare</strong>Mary-Jane Elliott, David Daley, Lindsey Neville</p><p class=\"\">Phone: +44 (0)20 3709 5700</p><p class=\"\">E-mail: faron@consilium-comms.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Cairn Financial Advisers LLP, Nomad</strong></p><p class=\"\">Sandy Jamieson, Jo Turner</p><p class=\"\">Phone: +44 (0) 207 213 0880</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Peel Hunt LLP, Broker</strong></p><p class=\"\">Christopher Golden, James Steel</p><p class=\"\">Phone: +44 (0) 20 7418 8900</p><p class=\"\">Sisu Partners Oy, Certified Adviser on Nasdaq First North</p><p class=\"\">Juha Karttunen</p><p class=\"\">Phone: +358 (0)40 555 4727</p><p class=\"\">Jukka Järvelä</p><p class=\"\">Phone: +358 (0)50 553 8990</p><p class=\"\">MEMBERS OF THE PUBLIC ARE NOT ELIGIBLE TO SUBSCRIBE FOR, OTHERWISE ACQUIRE OR DISPOSE OF ANY SECURITIES IN FARON PHARMACEUTICALS LTD (\"FARON\") PURSUANT TO THE PROPOSED TRANSACTION REFERRED TO IN THIS ANNOUNCEMENT. THIS ANNOUNCEMENT IS THEREFORE DIRECTED ONLY AT, IN A MEMBER STATE OF THE EUROPEAN ECONOMIC AREA, PERSONS WHO ARE \"QUALIFIED INVESTORS\" AS DEFINED IN ARTICLE 2(E) OF THE EU PROSPECTUS REGULATION (WHICH MEANS REGULATION (EU) 2017/1129) (THE \"PROSPECTUS REGULATION\"). THIS ANNOUNCEMENT IS FOR INFORMATION PURPOSES ONLY AND DOES NOT CONSTITUTE OR CONTAIN ANY INVITATION, SOLICITATION, RECOMMENDATION, OFFER OR ADVICE TO ANY PERSON TO SUBSCRIBE FOR, OTHERWISE ACQUIRE OR DISPOSE OF ANY SECURITIES IN FARON OR ANY OTHER ENTITY IN ANY JURISDICTION IN WHICH ANY SUCH OFFER WOULD BE UNLAWFUL.</p><p class=\"\">IN ADDITION, IN THE UNITED KINGDOM, THIS ANNOUNCEMENT IS ONLY DIRECTED AT PERSONS IN THE UNITED KINGDOM THAT ARE QUALIFIED INVESTORS WITHIN THE MEANING OF ARTICLE 2(E) OF THE PROSPECTUS REGULATION AS INCORPORATED INTO UK DOMESTIC LAW BY VIRTUE OF THE EUROPEAN UNION (WITHDRAWAL) ACT 2018 THAT ARE ALSO (I) INVESTMENT PROFESSIONALS FALLING WITHIN ARTICLE 19(5) OF THE FINANCIAL SERVICES AND MARKETS ACT 2000 (FINANCIAL PROMOTION) ORDER 2005 (THE \"ORDER\") AND/OR (II) HIGH NET WORTH ENTITIES, AND OTHER PERSONS TO WHOM IT MAY LAWFULLY BE COMMUNICATED, FALLING WITHIN ARTICLE 49(2)(A) TO (E) OF THE ORDER (EACH SUCH PERSON, TOGETHER WITH QUALIFIED INVESTORS AS DEFINED IN THE PROSPECTUS REGULATION, BEING REFERRED TO AS A “RELEVANT PERSON”).</p><p class=\"\">ACCORDINGLY, THIS ANNOUNCEMENT AND ITS CONTENTS MUST NOT BE ACTED ON OR RELIED ON BY PERSONS WHO ARE NOT RELEVANT PERSONS. ANY INVESTMENT OR INVESTMENT ACTIVITY TO WHICH THIS ANNOUNCEMENT RELATES IS AVAILABLE ONLY TO RELEVANT PERSONS AND WILL BE ENGAGED IN ONLY WITH RELEVANT PERSONS. PERSONS INTO WHOSE POSSESSION THIS ANNOUNCEMENT COMES ARE REQUIRED TO INFORM THEMSELVES ABOUT AND TO OBSERVE ANY SUCH RESTRICTIONS.</p><p class=\"\">THE PROPOSED TRANSACTION REFERRED TO IN THIS ANNOUNCEMENT WOULD BE MADE PURSUANT TO A PRIVATE PLACEMENT EXEMPTION UNDER THE PROSPECTUS REGULATION FROM THE REQUIREMENTS TO PRODUCE A PROSPECTUS UNDER THE PROSPECTUS REGULATION FOR OFFERS OF SECURITIES. FARON HAS NOT TAKEN ANY ACTION, NOR WILL IT TAKE ANY ACTION, TO OFFER ANY OF THE PLACING SHARES THAT ARE TO BE SUBSCRIBED FOR PURSUANT TO THE TRANSACTION REFERRED TO IN THIS ANNOUNCEMENT OR ANY DOCUMENTS RELATING TO THE PLACING TO THE PUBLIC IN FINLAND, SWEDEN, NORWAY OR DENMARK, OR IN ANY OTHER JURISDICTION IN ANY FORM WHICH WOULD CONSTITUTE AN OFFER TO THE PUBLIC.</p><p class=\"\">THIS ANNOUNCEMENT IS NOT FOR PUBLICATION OR DISTRIBUTION, DIRECTLY OR INDIRECTLY, IN OR INTO THE UNITED STATES OF AMERICA. THIS ANNOUNCEMENT IS NOT AN OFFER OF SECURITIES FOR SALE INTO THE UNITED STATES. THE PLACING SHARES HAVE NOT BEEN AND WILL NOT BE REGISTERED UNDER THE UNITED STATES SECURITIES ACT OF 1933, AS AMENDED (THE \"SECURITIES ACT\"), OR UNDER THE SECURITIES LAWS OF ANY STATE OR OTHER JURISDICTION OF THE UNITED STATES, AND MAY NOT BE OFFERED, SOLD OR TRANSFERRED, DIRECTLY OR INDIRECTLY, IN OR INTO OR FROM THE UNITED STATES EXCEPT PURSUANT TO AN EXEMPTION FROM, OR IN A TRANSACTION NOT SUBJECT TO, THE REGISTRATION REQUIREMENTS OF THE SECURITIES ACT AND IN COMPLIANCE WITH ANY APPLICABLE SECURITIES LAWS OF ANY STATE OR OTHER JURISDICTION OF THE UNITED STATES. THERE IS NO INTENTION TO REGISTER THE PLACING SHARES IN THE UNITED STATES OR TO MAKE A PUBLIC OFFERING IN THE UNITED STATES.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About BEXMAB</strong></p><p class=\"\">The BEXMAB trial is an open-label Phase I/II clinical trial investigating <em>bexmarilimab</em> in combination with standard of care (SoC) in the aggressive hematological malignancies of acute myeloid leukemia (AML) and myelodysplastic syndrome (MDS). The primary objective is to determine the safety and tolerability of <em>bexmarilimab</em> in combination with SoC (azacitidine) treatment. Directly targeting Clever-1 could limit the replication capacity of cancer cells, increase antigen presentation, ignite an immune response, and allow current treatments to be more effective. Clever-1 is highly expressed in both AML and MDS and associated with therapy resistance, limited T cell activation and poor outcomes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About</strong> <em><strong class=\"root-Tkn6WL2y\">bexmarilimab</strong></em></p><p class=\"\"><em>Bexmarilimab</em> is Faron's wholly owned, investigational immunotherapy designed to overcome resistance to existing treatments and optimize clinical outcomes, by targeting myeloid cell function and igniting the immune system. <em>Bexmarilimab</em> binds to Clever-1, an immunosuppressive receptor found on macrophages leading to tumor growth and metastases (i.e. helps cancer evade the immune system). By targeting the Clever-1 receptor on macrophages, <em>bexmarilimab</em> alters the tumor microenvironment, reprogramming macrophages from an immunosuppressive (M2) state to an immunostimulatory (M1) one, upregulating interferon production and priming the immune system to attack tumors and sensitizing cancer cells to standard of care.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Faron Pharmaceuticals Ltd</strong></p><p class=\"\">Faron (AIM: FARN, First North: FARON) is a global, clinical-stage biopharmaceutical company, focused on tackling cancers via novel immunotherapies. Its mission is to bring the promise of immunotherapy to a broader population by uncovering novel ways to control and harness the power of the immune system. The Company’s lead asset is <em>bexmarilimab</em>, a novel anti-Clever-1 humanized antibody, with the potential to remove immunosuppression of cancers through reprogramming myeloid cell function. <em>Bexmarilimab</em> is being investigated in Phase I/II clinical trials as a potential therapy for patients with hematological cancers in combination with other standard treatments. Further information is available at www.faron.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">IMPORTANT INFORMATION</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Market Abuse Regulation</strong></p><p class=\"\">Market soundings, as defined in Regulation (EU) No 596/2014 (\"<strong class=\"root-Tkn6WL2y\">MAR</strong>\"), were taken in respect of the proposed Placing with the result that certain persons became aware of inside information, as permitted by MAR. That inside information in relation to the Placing is set out in this announcement and has been disclosed as soon as possible in accordance with paragraph 7 of article 17 of MAR. Therefore, those persons that received inside information in such market sounding are no longer in possession of inside information relating to the Company and its securities.</p><p class=\"\">This announcement contains inside information for the purposes of Article 7 of MAR and Article 7 of UK MAR.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">MiFID II</strong></p><p class=\"\">Solely for the purposes of the product governance requirements contained within: (a) EU Directive 2014/65/EU on markets in financial instruments, as amended (\"<strong class=\"root-Tkn6WL2y\">MiFID II</strong>\"); (b) Articles 9 and 10 of Commission Delegated Directive (EU) 2017/593 supplementing MiFID II; and (c) local implementing measures (together, the \"<strong class=\"root-Tkn6WL2y\">MiFID II Product Governance Requirements</strong>\"), and disclaiming all and any liability, whether arising in tort, contract or otherwise, which any \"manufacturer\" (for the purposes of the MiFID II Product Governance Requirements) may otherwise have with respect thereto, the Placing Shares have been subject to a product approval process, which has determined that the Placing Shares are: (i) compatible with an end target market of: (a) retail investors, (b) investors who meet the criteria of professional clients and (c) eligible counterparties (each as defined in MiFID II); and (ii) eligible for distribution through all distribution channels as are permitted by MiFID II (the \"<strong class=\"root-Tkn6WL2y\">Target Market Assessment</strong>\"). Notwithstanding the Target Market Assessment, distributors should note that: the price of the Placing Shares may decline and investors could lose all or part of their investment; the Placing Shares offer no guaranteed income and no capital protection; and an investment in the Placing Shares is compatible only with investors who do not need a guaranteed income or capital protection, who (either alone or in conjunction with an appropriate financial or other adviser) are capable of evaluating the merits and risks of such an investment and who have sufficient resources to be able to bear any losses that may result therefrom. The Target Market Assessment is without prejudice to the requirements of any contractual, legal or regulatory selling restrictions in relation to the offer.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Caution regarding forward-looking statements</strong></p><p class=\"\">Certain statements in this announcement are, or may be deemed to be, forward-looking statements. Forward-looking statements are identified by their use of terms and phrases such as ''believe'', ''could'', \"should\", \"expect\", ''envisage'', ''estimate'', ''intend'', ''may'', ''plan'', ''potentially'', ''will'' or the negative of those, variations or comparable expressions, including references to assumptions. These forward-looking statements are not based on historical facts but rather on the Directors' current expectations and assumptions regarding the Company's future growth, results of operations, performance, future capital and other expenditures (including the amount, nature and sources of funding thereof), competitive advantages, business prospects and opportunities. Such forward-looking statements reflect the Directors' current beliefs and assumptions and are based on information currently available to the Directors.</p><p class=\"\">A number of factors could cause actual results to differ materially from the results and expectations discussed in the forward-looking statements, many of which are beyond the control of the Company. In addition, other factors which could cause actual results to differ materially include the ability of the Company to successfully licence its programmes, risks associated with vulnerability to general economic and business conditions, competition, environmental and other regulatory changes, actions by governmental authorities, the availability of capital markets or other sources of funding, reliance on key personnel, uninsured and underinsured losses and other factors. Although any forward-looking statements contained in this announcement are based upon what the Directors believe to be reasonable assumptions, the Company cannot assure investors that actual results will be consistent with such forward-looking statements. Accordingly, readers are cautioned not to place undue reliance on forward-looking statements. Subject to any continuing obligations under applicable law or any relevant AIM Rule requirements, in providing this information the Company does not undertake any obligation to publicly update or revise any of the forward-looking statements or to advise of any change in events, conditions or circumstances on which any such statement is based.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN2LwVN6:0-proposed-issue-and-placing/",
            "pub_date": "2025-02-06 00:30:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr5lbDHm:0",
            "title": "FISKARS CORPORATION: ACQUISITION OF OWN SHARES 05.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Fiskars Corporation<p class=\"\"></p><p class=\"\">Fiskars Corporation</p><p class=\"\">Stock Exchange Release</p><p class=\"\">05.02.2025 at 18:30 EET/EEST</p><p class=\"\">FISKARS CORPORATION: ACQUISITION OF OWN SHARES 05.02.2025</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Date</p></td><td><p class=\"\">05.02.2025</p></td><td></td></tr><tr><td><p class=\"\">Exchange transaction</p></td><td><p class=\"\">Buy</p></td><td></td></tr><tr><td><p class=\"\">Share class</p></td><td><p class=\"\">FSKRS</p></td><td></td></tr><tr><td><p class=\"\">Amount </p></td><td><p class=\"\">1300</p></td><td></td></tr><tr><td><p class=\"\">Average price/share</p></td><td><p class=\"\">14.8913</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Highest price/share</p></td><td><p class=\"\">15.0000</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Lowest price/share</p></td><td><p class=\"\">14.8000</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Total price</p></td><td><p class=\"\">19,358.69</p></td><td><p class=\"\">EUR</p></td></tr></tbody></table></div><p class=\"\">The share buybacks are executed in compliance with Regulation No. 596/2014 of the European Parliament and Council (MAR) Article 5 and the Commission Delegated Regulation (EU) 2016/1052.</p><p class=\"\">The shares held by Fiskars Corporation on 05.02.2025:</p><p class=\"\"></p><p class=\"\">FSKRS  186,510</p><p class=\"\">On behalf of Fiskars Corporation</p><p class=\"\">Skandinaviska Enskilda Banken AB (Publ)</p><p class=\"\">Antti Salakka    Jaakko Kosunen</p><p class=\"\">For more information, please contact:</p><p class=\"\">Media and investor contacts</p><p class=\"\">Fiskars Corporation</p><p class=\"\">Tel. +358 50 458 4014</p><p class=\"\">communications@fiskars.com </p><p class=\"\">www.fiskarsgroup.com</p><p class=\"\">https://news.cision.com/fiskars-corporation/r/fiskars-corporation--acquisition-of-own-shares-05-02-2025%2Cc4101202</p><p class=\"\">FSKRS SBB 05022025</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr5lbDHm:0-fiskars-corporation-acquisition-of-own-shares-05-02-2025/",
            "pub_date": "2025-02-06 00:30:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr80XpfM:0",
            "title": "ALEXANDRIA GROUP OYJ: ACQUISITION OF OWN SHARES 05.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Alexandria Group Oyj<ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ALEXANDRIA GROUP OYJ</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">NOTIFICATION</p></li></ul><p class=\"\">05.02.2025 at 18:30 EET</p><p class=\"\">ALEXANDRIA GROUP OYJ: ACQUISITION OF OWN SHARES 05.02.2025</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Date</p></td><td><p class=\"\">05.02.2025</p></td><td></td></tr><tr><td><p class=\"\">Exchange transaction</p></td><td><p class=\"\">Buy</p></td><td></td></tr><tr><td><p class=\"\">Share class</p></td><td><p class=\"\">ALEX</p></td><td></td></tr><tr><td><p class=\"\">Amount</p></td><td><p class=\"\">200</p></td><td></td></tr><tr><td><p class=\"\">Average price/share</p></td><td><p class=\"\">9.3500</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Highest price/share</p></td><td><p class=\"\">9.3500</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Lowest price/share</p></td><td><p class=\"\">9.3500</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Total price</p></td><td><p class=\"\">1,870.00</p></td><td><p class=\"\">EUR</p></td></tr></tbody></table></div><p class=\"\">The shares held by Alexandria Group Oyj on 05.02.2025:</p><p class=\"\"></p><p class=\"\">ALEX 50,662</p><p class=\"\">On behalf of Alexandria Group Oyj</p><p class=\"\">Skandinaviska Enskilda Banken AB (publ) Helsinki branch</p><p class=\"\">Antti Salakka Jaakko Kosunen</p><p class=\"\">For more information, please contact:</p><p class=\"\">Jan Åkesson</p><p class=\"\">CEO</p><p class=\"\">jan.akesson@alexandria.fi</p><p class=\"\">+358 40 731 2325</p><p class=\"\">https://news.cision.com/alexandria-group-oyj/r/alexandria-group-oyj--acquisition-of-own-shares-05-02-2025%2Cc4101176</p><p class=\"\">ALEX SBB 05022025</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr80XpfM:0-alexandria-group-oyj-acquisition-of-own-shares-05-02-2025/",
            "pub_date": "2025-02-06 00:30:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0Z1:0",
            "title": "US crude imports from Mexico drop to record low in Jan 31 week, EIA says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        U.S. crude oil imports from Mexico fell by 372,000 barrels per day (bpd) to a weekly record low of 149,000 bpd in the week ended Jan. 31, according to data from the U.S. Energy Information Administration's (EIA) Petroleum Supply Report going back to 2010.</p><p class=\"\">That was lower than the prior all-time low for U.S. crude oil imports from Mexico of 151,000 bpd in the week ended Nov. 22, 2024.</p><p class=\"\">Last week's record low came during the week before U.S. President Donald Trump threatened to impose 25% tariffs on Mexico and Canada. Those tariffs were later paused until March in return for concessions on border and crime enforcement with the countries.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0Z1:0-us-crude-imports-from-mexico-drop-to-record-low-in-jan-31-week-eia-says/",
            "pub_date": "2025-02-06 00:30:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACS96bdya:0",
            "title": "Cummins Group in India Launches HELM(TM) Engine Platforms and Advanced Power Solutions at the Bharat Mobility Global Expo 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Showcases the widest range of integrated, smarter and cleaner power solutions.</p><p class=\"\">Cummins</p><div class=\"blockquote-xrkxvh37\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key Points</strong></p><p class=\"\">Key highlights from the Cummins Pavilion at Bharat Mobility Global Expo 2025:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Introduces the innovative <strong class=\"root-Tkn6WL2y\">Cummins HELM™ engine platforms</strong> in India.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Unveils the <strong class=\"root-Tkn6WL2y\">BSVI-ready L10 engine</strong>, part of Cummins' 10-liter HELM™ platform and the base for future BSVII and Euro 7 capable products.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Introduces the <strong class=\"root-Tkn6WL2y\">B6.7N natural gas engine</strong> enabling the transition of heavy-duty vehicles to CNG/LNG.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Introduces Cummins' advanced F<!-- -->uel Delivery System with Type IV tanks for safe storage of Hydrogen on commercial vehicles.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Demonstrates <strong class=\"root-Tkn6WL2y\">integrated powertrain capability</strong> for zero, low and reduced carbon emissions, offering Power of Choice to customers.</p></li></ul></div><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 5, 2025 / Today, at Bharat Mobility Global Expo 2025, Cummins Group in India <strong class=\"root-Tkn6WL2y\">(\"Cummins\")</strong>, a leading power technology provider, announced the launch of its next generation <strong class=\"root-Tkn6WL2y\">HELM™</strong> (<strong class=\"root-Tkn6WL2y\">H</strong>igher <strong class=\"root-Tkn6WL2y\">E</strong>fficiency, <strong class=\"root-Tkn6WL2y\">L</strong>ower emissions, <strong class=\"root-Tkn6WL2y\">M</strong>ultiple fuels) engine platforms, with the <strong class=\"root-Tkn6WL2y\">high performance L10 engine</strong>, along with, an advanced <strong class=\"root-Tkn6WL2y\">Hydrogen Fuel Delivery System (FDS)</strong> with Type IV on-vehicle storage vessels and the innovative <strong class=\"root-Tkn6WL2y\">B6.7N natural gas engine</strong>.</p><p class=\"\">Showcased within an integrated powertrain concept, these launches underscore the company's deep understanding of the Indian Commercial Vehicle (CV) market and its commitment to addressing current demands and future environmental requirements.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Introducing Cummins HELM™ engine platforms:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Cummins HELM™ platforms</strong> represent the company's forward thinking-approach to engine technology, prioritizing performance, efficiency, and sustainability. The platforms deliver advanced internal combustion engine technology with fuel-type flexibility, enabling customers to choose from <strong class=\"root-Tkn6WL2y\">advanced diesel, natural gas, or hydrogen</strong> variants, to meet their diverse operational needs and sustainability goals.</p><p class=\"\">Designed to meet evolving environmental standards, the platform utilizes a common base to deliver multiple engine versions, each optimized for a single fuel type. Cummins HELM™ platforms empower customers to achieve their sustainability goals.</p><p class=\"\">Highlights of Cummins product launches at Bharat Mobility Global Expo 2025:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Next-generation L10 engine:</strong> Built on the <strong class=\"root-Tkn6WL2y\">10-liter Cummins HELM™ platform</strong>, this high-performance engine supports faster logistics, improved productivity and reduced emissions. This new-generation platform not only meets BSVI emissions standards but will form the base for future BSVII and Euro 7 capable engines for the Indian market. The clean sheet design underscores Cummins' technical expertise and leadership in delivering solutions that meet current regulations, while being adaptable to future needs.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fuel Delivery System (FDS)</strong>: An advanced 350-bar and 700-bar hydrogen fuel delivery system, with Type IV on-vehicle storage vessels. The system marks a major step in progressing India's hydrogen economy. The FDS facilitates on-vehicle hydrogen fuel storage, addressing a key challenge in the adoption of hydrogen powered commercial vehicles.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">B6.7N Natural Gas Engine</strong>: Designed to provide diesel-equivalent performance with lower carbon emissions, the innovative B6.7N natural gas engine facilitates the adoption of CNG and LNG fuels in heavy-duty vehicles. The B6.7N reflects Cummins' commitment to offer solutions that help its customers navigate the energy transition without compromising operational costs, reliability or operational efficiency for fleets.</p></li></ul><p class=\"\">Unveiling the new products, <!-- -->Jane Beaman, Vice President - Global On-Highway and Pickup Business, Cummins Inc., said, \"<!-- -->Our world is at a pivotal moment in its journey to lower emissions. In line with our Destination Zero™ strategy, we are committed to supporting industry-wide decarbonization through a portfolio of diverse power solutions. The products on display at Bharat Mobility Global Expo are testimony to our ability to deliver advanced low-and-reduced carbon technologies today, while innovating zero carbon solutions for tomorrow. These innovations not only future proof our customers' businesses but also set the stage for the next era of smarter, cleaner, and integrated power.\"</p><p class=\"\">Nitin Jirafe, Managing Director, Tata Cummins Pvt. Ltd., and Head, Engine Business, Cummins India, added, \"<!-- -->At Cummins, we have always believed in designing solutions that not only meet the needs of our customers but also contribute meaningfully to our country's progress. The products launched today align with transformative Viksit Bharat and Make in India initiatives, while addressing the evolving needs of commercial vehicle industry. Collectively, these offerings will give our customers the power of choice, enabling them to select the right technology for their needs while supporting the economic and environmental aspirations of the nation.\"</p><p class=\"\">At its state-of-the-art pavilion in <!-- -->Hall 2, Booth 2, in Bharat Mandapam, Pragati Maidan, New Delhi, Cummins is showcasing the widest array of low and zero emission technologies for the CV industry. The display features advanced engines seamlessly integrated with next-generation components such as aftertreatment systems, automated manual transmission, axles and power electronics, all optimized for high power efficiency. Interactive exhibits at the booth offer insights into Cummins' advanced technologies and their transformative impact on the transportation ecosystem.</p><p class=\"\">For more information about Cummins India at Bharat Mobility Global Expo 2025, please click here.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cummins Group in India</strong></p><p class=\"\">Cummins Group in India is a leading provider of integrated power solutions for the industrial and automotive sectors. The company operates through thirteen entities with a wide-ranging portfolio. It is engaged in designing, manufacturing, distributing, and servicing diesel and natural gas engines and powertrain-related components, including drivetrain, braking, after-treatment, turbochargers, fuel systems, control systems, air handling systems, transmissions, and electrified power systems solutions for commercial vehicles and industrial markets. The company has a remarkable presence in the region, with state-of-the-art manufacturing plants, assembly, and distribution facilities employing over 10,000 employees committed to powering a more prosperous world.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Abhilasha Shukla</strong></p><p class=\"\">Communications Leader, Cummins India</p><p class=\"\">abhilasha.shukla@cummins.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Monica Iyengar (Aggarwal)</strong></p><p class=\"\">+91 9833049690</p><p class=\"\">MIyengar@webershandwick.co</p><p class=\"\">View additional multimedia and more ESG storytelling from Cummins Inc on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Cummins Inc</p><p class=\"\">Website: https://www.3blmedia.com/profiles/cummins-inc</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Cummins Inc</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACS96bdya:0/",
            "pub_date": "2025-02-06 00:30:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_IndbTsJjm:0",
            "title": "UNITED BANKERS PLC: ACQUISITION OF OWN SHARES 05.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">United Bankers Plc</li><li class=\"listItem-bmN0_SHH\">NOTIFICATION</li></ul><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Date</td><td>05.02.2025</td><td></td></tr><tr><td>Exchange transaction</td><td>Buy</td><td></td></tr><tr><td>Share class</td><td>UNITED</td><td></td></tr><tr><td>Amount</td><td>225</td><td></td></tr><tr><td>Average price/share</td><td>18.3000</td><td>EUR</td></tr><tr><td>Highest price/share</td><td>18.3000</td><td>EUR</td></tr><tr><td>Lowest price/share</td><td>18.3000</td><td>EUR</td></tr><tr><td>Total price</td><td>4,117.50</td><td>EUR</td></tr></tbody></table></div><p class=\"\">UNITED 33,568</p><p class=\"\">05.02.2025 at 18:30</p><p class=\"\">UNITED BANKERS PLC: ACQUISITION OF OWN SHARES 05.02.2025</p><p class=\"\">The shares held by United Bankers Plc on 05.02.2025</p><p class=\"\">On behalf of United Bankers Plc</p><p class=\"\">Skandinaviska Enskilda Banken AB (Publ) Helsinki Branch</p><p class=\"\">Antti Salakka Janne Tiihonen</p><p class=\"\">For more information, please contact:John Ojanperä, CEO, United Bankers Plce-mail: Phone: 040 842 3472, 09 25 380 356</p><p class=\"\">john.ojanpera@unitedbankers.fi www.unitedbankers.fi</p><strong class=\"root-Tkn6WL2y\">Attachments</strong>UB SBB 05022025.xlsx</span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_IndbTsJjm:0-united-bankers-plc-acquisition-of-own-shares-05-02-2025/",
            "pub_date": "2025-02-06 00:30:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310230:0",
            "title": "BNP Paribas Exane Adjusts Price Target on NXP Semiconductors NV to $270 From $260",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NXP Semiconductors NV  has an average rating of overweight and mean price target of $249.31, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310230:0/",
            "pub_date": "2025-02-06 00:22:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310237:0",
            "title": "Baird Adjusts Fair Isaac Price Target to $1,775 From $1,975",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of Hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310237:0/",
            "pub_date": "2025-02-06 00:22:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0YY:0",
            "title": "Is the Fed too stringent with its 2% inflation target?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">S&amp;P 500, Nasdaq dip; Dow ~flat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Comm svcs weakest S&amp;P sector; Real estate leads gainers</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro STOXX 600 index up ~0.3%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar down; crude falls ~2%; gold up, bitcoin gains ~1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-Year Treasury yield slides to ~4.42%</li></ul></span></div><span><p class=\"\">IS THE FED TOO STRINGENT WITH ITS 2% INFLATION TARGET?</p><p class=\"\">The Federal Reserve may be being too rigid on how it calculates getting inflation back to its 2% annual target and could be underestimating the likelihood that inflation will drop more than expected, according to Societe Generale analyst Albert Edwards.</p><p class=\"\">Fed officials have expressed concern that inflation will remain higher for longer, which would make further interest rate cuts less likely. The prospect of tariffs by the Trump administration has added to inflation fears.</p><p class=\"\">But Edwards notes that several factors, including a strong U.S. dollar, may point to lower inflation. “The dollar plays a major role in the ups and downs of import prices and the recent dollar surge is set to send import prices sharply lower,” he said. Excess capacity in China is adding to drops in import prices.</p><p class=\"\">Meanwhile concerns about entrenched supercore services inflation are likely overdone, with labor costs back close to 2% year on year. Shelter inflation, which has kept the core consumer price index stubbornly high, is also set to accelerate its decline.</p><p class=\"\">Edwards further argues that the Fed should not be focused on core CPI at 3.2%, but instead the core PCE deflator, which is rising annually at 2.8%. And market based measures of this core PCE deflator are even lower at 2.4%.</p><p class=\"\">Former Fed Chair Paul Volcker “excoriated the Fed” in Oct. 2018, when he argued that the 2% annual target must have some degree of latitude on either side due to measurement errors, and that from 2010 to 2020 “the Fed’s obsession to drive it back up to 2% caused it to pursue an excessively loose monetary policy.”</p><p class=\"\">“Volcker’s criticism equally applies now, but in the opposite direction,” Edwards said. The Fed should be focusing on the core PCE deflator, and not core CPI. Meanwhile, “measurement errors mean that a stable core PCE between 2-3% is just fine and consistent with price stability.”</p><p class=\"\">Thus, Edwards warns that deflationary forces could overwhelm any inflationary impact from tariffs and surprise market participants.</p><p class=\"\">(Karen Brettell)</p><p class=\"\">     *****</p><p class=\"\">FOR WEDNESDAY'S EARLIER LIVE MARKETS POSTS:</p><p class=\"\">HUMP DAY DATA: ADP, SERVICES PMI, TRADE BALANCE, MORTGAGES - CLICK HERE</p><p class=\"\">MAIN U.S. INDEXES RED, BUT YIELDS TAKE A TUMBLE - CLICK HERE</p><p class=\"\">NASDAQ COMPOSITE: CONFRONTING AN INTERNAL STRUGGLE - CLICK HERE</p><p class=\"\">\"MORE PAY\": UK CONSUMER EYES BOOST - CLICK HERE</p><p class=\"\">FX TRADERS' HORIZONS \"AS SHORT AS THEY'VE EVER BEEN\" - CLICK HERE</p><p class=\"\">GOLD MINERS: MIND THE GAP - CLICK HERE</p><p class=\"\">BIG GAINERS BUT STOXX 600 FLAT - CLICK HERE</p><p class=\"\">EUROPE BEFORE BELL: EARNINGS KEEP YOU BUSY - CLICK HERE</p><p class=\"\">MARKETS CONFOUNDED BY TRUMP'S GAZA PROPOSAL - CLICK HERE</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0YY:0-is-the-fed-too-stringent-with-its-2-inflation-target/",
            "pub_date": "2025-02-06 00:22:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310241:0",
            "title": "MoffettNathanson Adjusts Equinix's Price Target to $990 From $965",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equinix  has an average rating of buy and mean price target of $1,040.96, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310241:0/",
            "pub_date": "2025-02-06 00:23:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006989:0",
            "title": "Treasury Keeps Plans for Bond Issuance Steady. It's a Relief, for Now. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Karishma Vanjani</p><p class=\"\">A looming risk to the bond market eased after the Treasury Department on Wednesday said it plans to keep the sizes of its bond sales steady well into 2025.</p><p class=\"\">In its debt-sale plan, the Treasury listed the same amounts of 10-, 20-, and 30-year bonds for sale from February to April as it did for November to January.</p><p class=\"\">A bigger concern was over its plans for sales in future quarters. But the Treasury said it \"anticipates maintaining nominal coupon and FRN auction sizes for at least the next several quarters.\" That matches what the department, which is responsible for borrowing on behalf of the government, has said for the past four consecutive quarters: that it doesn't anticipate changing the sizes of its debt auctions \"for at least the next several quarters.\"</p><p class=\"\">Strategists had been on edge, speculating over whether a change in language could be coming that would signal larger auctions of long-term bonds. The appointment of Scott Bessent, who officially took charge as Treasury secretary last week, created uncertainty because of the likelihood that his team would reassess the government's borrowing needs. He has previously blasted former Treasury Secretary Janet Yellen's decisions.</p><p class=\"\">Sales are expected to increase at some point, especially if proposals by President Donald Trump, such as an extension of tax cuts due to expire this year, are approved by Congress without any corresponding big cuts or freezes in other government spending. The Treasury would then need to step in to borrow money to cover the gap between government revenue and the amounts Trump wants to spend.</p><p class=\"\">Goldman Sachs, J.P. Morgan and Deutsche Bank strategists are all predicting that sizes of bond offerings won't begin gradually rising until November.</p><p class=\"\">More supply is the bond market's nemesis because all things being equal, having more debt available to buy would weigh on bond prices and increase yields.</p><p class=\"\">The 10-year yield was down 0.044 percentage points at 4.466% after the news on Wednesday.</p><p class=\"\">Write to Karishma Vanjani at karishma.vanjani@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006989:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008068:0",
            "title": "RXO Shares Drop After Wider-Than-Expected 4Q Loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">RXO shares were down 13% to $21.92 after the company reported a wider-than-expected fourth-quarter loss.</p><p class=\"\">The transportation-services company said it had a quarterly loss of $20 million, or 12 cents a share, compared with earnings of $2 million, or 2 cents a share, in the same quarter last year.</p><p class=\"\">Analysts polled by FactSet were looking for a loss of $13.6 million, or 7 cents a share.</p><p class=\"\">Revenue for the quarter was $1.67 billion, compared with last year's $978 million and the $1.66 billion analysts were expecting.</p><p class=\"\">RXO said brokerage volume increased 10% from the third quarter, and its managed-transportation sales pipeline now has nearly $2 billion in freight under management. Last-mile service grew 15% year over year.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008068:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008066:0",
            "title": "Mondelez To Up Chocolate Prices if Cocoa Costs Stay High — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1124 ET - Mondelez International expects adjusted earnings per share to fall 10% in 2025 due to elevated cocoa costs, after the snack maker said operating income declined 28% in the fourth quarter primarily due to that inflation. If chocolate costs remain high, Mondelez plans to gradually increase prices in the second half of this year, especially in developed markets, but the company said consumer confidence is still rocky, which could pose challenges to its pricing plan. Chief financial officer Luca Zaramella said he expects earnings per share to grow again in 2026, either from price increases or cocoa costs normalizing. (katherine.hamilton@wsj.com)</p><p class=\"\">1120 ET - Harley-Davidson CEO Jochen Zeitz says the company's electric motorcycle spinoff \"needs to perform\" following another disappointing year. LiveWire sold 612 bikes in 2024, far below its expectation of up to 1,500 bikes, and lost $110 million. Its CEO, Karim Donnez, says the company is cutting costs and hopes to succeed in Europe with a new \"maxi-scooter.\" Harley owns nearly 90% of LiveWire, and some analysts say the spinoff's losses are dragging down Harley's financial results. Zeitz says while the slow adoption of EV vehicles has hurt LiveWire, \"we'll obviously have to look at some optionalities\" if results don't improve. (john.keilman@wsj.com)</p><p class=\"\">1112 ET - Home Depot and Lowe's might report a better 4Q than Wall Street expects given recent results from the home-improvement chains' suppliers, Stanley Black &amp; Decker, Sherwin-Williams and Scotts Miracle-Gro, Davidson analyst Michael Baker says in a research note. Stanley Black &amp; Decker reports 2% organic growth in tools and outdoor products, an improvement from the 4% decline last quarter and the best increase since 2Q of 2021, the analyst says. Sherwin-Williams' consumer brands business, which is Lowe's main paint supplier, was flat in North America instead of down in the high-single digit percentage range like the three prior quarters, he says. And Scotts Miracle-Gro showed an acceleration of its gains from the prior quarter, the analyst says. (dean.seal@wsj.com)</p><p class=\"\">1047 ET - Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p><p class=\"\">1038 ET - The U.S. Treasury refunding announcement \"was mostly uneventful,\" Santander's Stephen Stanley writes. The U.S. Treasury says it is offering $125 billion in securities to refund around $106.2 billion of notes and bonds maturing this month, while raising around $18.8 billion in new cash. The Treasury warns of greater-than-normal issuance variability until the debt limit is suspended or increased. Stanley says the Treasury's current schedule \"should be fine for most or all of calendar 2025.\" He says coupon auction sizes will likely need to increase. Treasury yields are falling, showing no reaction to the refunding announcement. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1029 ET - GSK has to prove its pipeline is packed with new blockbuster treatments to withstand investors' concerns over its vaccine business slowdown in China and the U.S., AJ Bell investment director Russ Mould says. Further worries over the likely appointment of vaccine-sceptic Robert F Kennedy Jr. as Secretary of Health and Human Services in the U.S. still linger, he says. The British pharma giant's posted a second consecutive drop in sales in the fourth quarter, driven by a 19% decline in sales of its flu shots and a 52% plunge for its respiratory treatment Arexvy. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">1028 ET - U.S. growth came in surprisingly strong in 2024 versus start-of-year projections, and most economists expect the momentum to carry into 2025. But while the consumer economy and the services sector are thriving, industrial companies are complaining of a grimmer backdrop. \"Recent economic activity is primarily being led by the strength in service-related sectors,\" while the physical economy has been weaker, Dow CFO Jeff Tate tells analysts on a recent earnings call. Dow executives several times on the call referred to a \"prolonged economic downturn.\" Eastman Chemical CEO Mark Costa gave a similar take on the company's recent analyst call. \"The macro economy is certainly challenging right now as we all know,\" he said. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1002 ET - A new Redfin report reveals that nearly 70% of single, divorced, or separated individuals struggle with rent or mortgage payments, compared to over half of married people. Those living with a partner but unmarried face the highest struggle at over 75%. Single individuals often rely on one income, with 63% earning under $50,000 annually, versus 26% of married couples. Conversely, 29% of married people earn over $100,000, compared to just 7% of singles and 6% of divorced. Married couples benefit from tax advantages, enhancing financial stability. Despite these struggles, most pay on time, Redfin says.  (chris.wack@wsj.com)</p><p class=\"\">0924 ET — Capri Chief Executive John Idol says two of its key brands--Michael Kors and Versace--made missteps that contributed to an 11.6% decline in revenue and a net loss of $547 million in its third quarter. The Kors brand added too much fashion, alienating core customers. Versace removed too many unique statement items and reduced the number of lower-priced products. Idol says Kors will refocus on its heritage and plans to add a more balanced mix of products, while reducing some prices to be more in line with historical levels. Versace will add more products at the lower end of its price range to appeal to a broader base of consumers. (suzanne.kepner@wsj.com)</p><p class=\"\">0901 ET - ADP's employment estimate indicates solid U.S. job growth in January. The payroll and HR-services provider figures that the economy added 183,000 jobs last month. It also sharply revises up its December estimate: now to 176,000, from 122,000 previously. Carl Weinberg and Mary Chen of High Frequency Economics warn that the ADP figure isn't a stellar predictor of official data, but say adds useful color. \"Right now, [the big picture] is one of still substantial increases in jobs by a fast-growing economy but a slowing trend in job creation,\" they write. \"Today's figures do not upset that trend.\" (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0857 ET - Goldman Sachs economists think the risks of tariff escalation remain very real. The bank's team now projects that the U.S. will enact a 10% global tariff on critical imports such as semiconductors and pharmaceuticals as its baseline forecast, as well as a tariff on cars from the EU. If its current expected scenario is implemented, the tariffs could erase most progress on inflation otherwise expected this year, leaving core PCE inflation at 2.6% over the 12 months through December, Goldman projects. If Canada and Mexico tariffs are implemented after all, inflation would instead increase, peaking just above 3%, Goldman writes. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0847 ET - Oil futures are losing ground after an industry report of a large build in U.S. crude stocks, while the prospect of a trade war fuels concerns about demand. \"All of this tariff talk and general confusion that it's generating is bearish demand as companies can't expand if they don't know what their costs are or what they can sell their goods for,\" Scott Shelton of TP ICAP says in a note. The API reported a 5 million barrel increase in U.S. stocks for last week, analysts note. EIA data inventory are due later this morning, with a Wall Street Journal survey predicting a 1.3 million barrel build. WTI is off 1% at $71.97 a barrel and Brent is down 1.1% at $75.38 a barrel. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008066:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008060:0",
            "title": "Ball Corp Is Maintained at Overweight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:24 GMT) </strong>Ball Corp Price Target Cut to $70.00/Share From $75.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008060:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464074:0",
            "title": "Rolls-Royce, UK Ministry of Defence Recyle Tornado Fighter Jet Components",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rolls-Royce (RR.L) is working on a recycling initiative aimed at turning old Royal Air Force Tornado fighter jet components into new parts for the Orpheus small engine concept. </p><p class=\"\">The British aerospace and defense group said Wednesday the Tornado 2 Tempest project will convert jet components into powdered metal, which will then be used for 3D printing. </p><p class=\"\">The initiative, which marks the first of its kind, is in partnership with the UK Ministry of Defence and Additive Manufacturing Solutions Ltd.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464074:0/",
            "pub_date": "2025-02-06 00:24:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310238:0",
            "title": "Jefferies Adjusts Fair Isaac Price Target to $2,175 From $2,275",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of Hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310238:0/",
            "pub_date": "2025-02-06 00:24:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW1AB:0",
            "title": "Blackrock To List Bitcoin Exchange-Traded Product In Europe- Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BLACKROCK TO LIST BITCOIN EXCHANGE-TRADED PRODUCT IN EUROPE- BLOOMBERG NEWS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW1AB:0-blackrock-to-list-bitcoin-exchange-traded-product-in-europe-bloomberg-news/",
            "pub_date": "2025-02-06 00:24:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310242:0",
            "title": "JPMorgan Adjusts Fair Isaac Price Target to $1,900 From $2,150",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of Hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310242:0/",
            "pub_date": "2025-02-06 00:24:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310239:0",
            "title": "Fubon Adjusts Price Target on NXP Semiconductors to $235 From $284",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NXP Semiconductors  has an average rating of overweight and mean price target of $249.31, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310239:0/",
            "pub_date": "2025-02-06 00:24:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW1AA:0",
            "title": "Japan-U.S. Summit Statement To Call For 'Golden Age' Of Bilateral Ties, Nikkei Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nikkei:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">JAPAN-U.S. SUMMIT STATEMENT TO CALL FOR 'GOLDEN AGE' OF BILATERAL TIES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">STATEMENT WILL EMPHASIZE REALIZING FREE AND OPEN INDO-PACIFIC AND BRINGING JAPAN-U.S. ALLIANCE TO \"NEW HEIGHTS\"</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ISHIBA, TRUMP, WILL ISSUE JOINT STATEMENT AFTER THEIR SUMMIT FRIDAY LAYING OUT SHARED VIEWS ON THE ECONOMY, SECURITY AND CHINA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW1AA:0-japan-u-s-summit-statement-to-call-for-golden-age-of-bilateral-ties-nikkei-reports/",
            "pub_date": "2025-02-06 00:18:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310217:0",
            "title": "Gibson Energy Maintained at Outperform with a $29.00 Price Target by National Bank of Canada",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">National Bank of Canada on Wednesday reiterated its outperform rating on the shares of Gibson Energy  and its $29.00 price target. </p><p class=\"\">Gibson recently announced that Sean Brown stepped down from his role as chief financial officer. Riley Hicks succeeded Brown in the role. </p><p class=\"\">National Bank said that during Brown's tenure since early 2016, the company delivered a total return of over 115% on the back of firming up its cash flow quality profile and solidifying an investment grade balance sheet. </p><p class=\"\">Meanwhile, Hicks joined Gibson in 2018 and most recently held the position of senior VP, corporate development, marketing and strategy.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310217:0/",
            "pub_date": "2025-02-06 00:18:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008032:0",
            "title": "Match's CEO Switch Fails to Quell Dating-App Growth Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Denny Jacob</p><p class=\"\">Match Group shares fell as the naming of a new CEO failed to quell concerns about the dating company's growth prospects.</p><p class=\"\">The online dating company on Tuesday named board member Spencer Rascoff as its new chief executive officer, replacing Bernard Kim.</p><p class=\"\">The timing was somewhat surprising but fit into a history of executive turnover at Match. Kim, who was recruited from mobile gaming company Zynga in 2022, would have had his contract automatically renewed in May.</p><p class=\"\">J.P. Morgan's Cory Carpenter in a note following the announcement said while the change wasn't shocking given challenges during Kim's tenure, this \"is not something we expected this soon.\"</p><p class=\"\">Rascoff, who joined the board last year as part of an agreement between Match and activist Elliott Investment Management, appeared to hint at Match's execution challenges.</p><p class=\"\">\"I'm here as CEO to make sure that the plans get executed and then some. I'm bringing urgency, I'm bringing accountability and prior experience to the role,\" said Rascoff, who noted he would buy $2 million worth of stock on Thursday as a sign of his conviction in the company, on an earnings call Wednesday.</p><p class=\"\">Shares are off about 7.5% at $33.75. The stock is down around 81% from its all-time closing high of $175.53 in October 2021.</p><p class=\"\">The Dallas company is turning to new executives to right the ship. Match in October named Steven Bailey as chief financial officer, effective March 1. Gary Swidler will leave the CFO role but remain as president.</p><p class=\"\">Match's priorities will circle around innovating Tinder, meeting its three-year targets laid out at its Investor Day, and keeping its activist investors--which includes Starboard Value and Anson Funds Management--at bay.</p><p class=\"\">The activists have pushed Match to improve its performance. Of the three, Starboard has been the most vocal about Match's struggles and said it should consider going private if it can't fix Tinder and hit on other growth opportunities.</p><p class=\"\">Representatives for the three activist investors couldn't be reached immediately for comment on Rascoff's appointment.</p><p class=\"\">Results from the fourth quarter present a mixed picture on the company's progress. Revenue declined slightly to $860 million from $866 million in the prior-year period, but exceeded Wall Street's estimates of $857.1 million.</p><p class=\"\">At Tinder, however, revenue from the app declined 3.4% to $476 million year-over-year, while the number of paying users edged down to 9.5 million. The dating app has posted declining payers on a year-over-year basis since the second quarter of 2023.</p><p class=\"\">Match also offered detailed revenue guidance for the first quarter and 2025, which was below Wall Street's estimates on a reported basis. Analysts noted that adjusted revenue guidance for 2025 was consistent with the outlook provided at Investor Day in December but relies on assumed strength in the back half of the year.</p><p class=\"\">\"While [foreign-exchange-neutral] revenue guidance was maintained, it's also back-weighted driven by assumptions Tinder [monthly active user] trends improve,\" Citi analyst Ygal Arounian said in a research note.</p><p class=\"\">Write to Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008032:0/",
            "pub_date": "2025-02-06 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008033:0",
            "title": "Chinese Retailer Stocks Fall After USPS Pauses, Then Resumes Shipping",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">Shares of Chinese online retail companies pared back losses after the U.S. Postal Service said it would resume accepting packages from China and Hong Kong--a reversal from its announcement the previous night that it would stop accepting such packages--though the stocks remained down amid continued uncertainty about the effect of tariffs.</p><p class=\"\">Chinese online marketplace Alibaba saw its New York-traded American depositary receipts fall as low as $99.69, a 2.6% drop from market close on Tuesday, but they recovered some of their loss Wednesday morning. New York-traded ADRs of PDD, which owns budget e-retailer Temu, dipped as much as 4.6% to $108.83 after market close, and were still recently down 3%.</p><p class=\"\">The stocks have had a week of ups and downs as the Trump administration's 10% tariffs on Chinese imports threaten to upend their distribution of low-cost products to U.S. customers. The USPS said Wednesday morning it is working with Customs and Border Protection to establish an efficient way to collect the new tariffs while limiting distribution to package delivery.</p><p class=\"\">Some U.S.-based companies that rely on cheap shipping from China also reacted. Amazon's stock fell as much as 2.7% from Tuesday's closing price.</p><p class=\"\">As part of the tariffs, Trump also closed a trade loophole that has helped many Chinese retailers keep prices low for U.S. customers. The loophole, called de minimis, allows exports under $800 to enter the U.S. without duties, and has been crucial savings for e-commerce companies selling cheap clothing, electronics and furniture from China.</p><p class=\"\">Nearly 1.4 billion shipments in 2024 claimed the de minimis exemption, a more-than-sixfold increase from a decade ago, Customs and Border Protection said in January. The cost savings of de minimis has helped companies like Temu offer prices 20% to 40% lower than U.S. competitors and make an estimated $20 billion in 2024, KeyBanc analyst Brad Thomas told The Wall Street Journal.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008033:0-chinese-retailer-stocks-fall-after-usps-pauses-then-resumes-shipping/",
            "pub_date": "2025-02-06 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}