{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE728XRY:0",
            "title": "Ivo raises $16M Series A to deliver reliable AI contract review at scale, as it launches Ivo Search Agent",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AI-powered legal assistant cuts contract review time by 75%, as demand surges for intelligent automation in corporate legal departments.</p><p class=\"\">San Francisco , Feb.  05, 2025  (GLOBE NEWSWIRE) — Contract negotiation remains the most challenging bottleneck in the contract lifecycle, with legal teams spending hours on manual redlining and revisions while ensuring perfect accuracy. As contract volumes surge, in-house lawyers face mounting pressure to review more agreements than ever before – yet traditional automation tools prioritize speed over accuracy, forcing legal teams to choose between efficiency and reliability. Today, Ivo announces a $16 million Series A funding round to scale its AI-powered contract review solution that has already helped over 150 corporate legal teams negotiate their agreements. Ivo’s customers include companies like Canva, Fonterra, Pipedrive, Weightwatchers, Eventbrite, Blue Cross Blue Shield Kansas City, and several Fortune 500’s.</p><p class=\"\">The Series A funding round is led by Costanoa Ventures, with participation from Fika Ventures, Uncork Capital, NFDG, Blackbird VC, GD1, and Phase One Ventures. It brings Ivo's total funding to $22.2 million, following early backing from Daniel Gross and a $4.8 million seed round led by Fika Ventures and Uncork Capital. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:898.1528431727635px;aspect-ratio:1.4969214052879392\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNE728XRY-def9731ac77fbc7af515b3f250b4b424-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNE728XRY-def9731ac77fbc7af515b3f250b4b424-resized.jpeg\" style=\"background-color:#605e5f\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"description-S5VA5POt\">Ivo founders: Jacob Duligall and Min-Kyu Jung.</span></figcaption></figure></span></p><p class=\"\">Ivo has developed a breakthrough approach to contract review that sets new standards for accuracy. The platform automatically checks agreements against company requirements, generates specific suggestions for resolving discrepancies, and creates compromise language between conflicting clauses. Unlike competitors that treat legal review as a simple automation problem, Ivo's sophisticated AI produces naturalistic redlines that mirror the work of experienced attorneys, maintaining consistent terminology and making minimal necessary changes. </p><p class=\"\">\"When I was a corporate lawyer, contract review was amongst the most manual and time-consuming tasks,\" <strong class=\"root-Tkn6WL2y\">says Min-Kyu Jung, CEO and Co-founder of Ivo.</strong> Determined to solve this problem himself, Jung left his legal career, taught himself to code, and began building what would become Ivo. After speaking with hundreds of legal professionals and iterating through multiple versions of the product, his team developed a solution that lawyers could use in confidence.</p><p class=\"\">The impact on legal teams has been immediate and significant. “Ivo reduced our average time to approve counterparty NDAs for signatures from four days to two, while first pass turn improved from an average of 11 hours to 5 minutes,” <!-- -->says Adrie Christiansen, Legal Operations Lead at Quora. Similarly, Geotab's legal team reports an average savings of 45 minutes per contract review – a 75% efficiency gain that allows their lawyers to focus on strategic work. This improvement comes without sacrificing accuracy, as Ivo's transparency allows lawyers to understand and validate every suggestion. The platform has proven particularly valuable for high-volume contract review, where maintaining consistency across thousands of agreements is critical. Through extensive customization options and playbook features, legal teams can establish clear guardrails that enable business users to handle initial contract reviews while ensuring proper escalation protocols.</p><p class=\"\">The timing of Ivo's expansion is critical. As artificial intelligence emerges as potentially the most transformative technology since the internet, legal teams face mounting pressure to adopt solutions that can scale their capabilities. Yet most AI tools lack the sophistication to handle complex legal analysis, creating more work for lawyers who must double-check every output. With its team of in-house lawyers continually refining and enhancing the platform, Ivo has developed an approach that augments rather than replaces legal judgment – acting as a “powerful force multiplier” for teams handling increasingly large volumes of contracts.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:870.4663212435233px;aspect-ratio:1.450777202072539\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNE728XRY-c4cdaa765cdeb553f11a0fca9035aa3b-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNE728XRY-c4cdaa765cdeb553f11a0fca9035aa3b-resized.jpeg\" style=\"background-color:#f7f6f0\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"description-S5VA5POt\">The Ivo Search Agent: running a query.</span></figcaption></figure></span></p><p class=\"\">Today's launch of Ivo Search Agent marks another milestone in the company's mission to transform how legal teams work. This new capability revolutionizes contract search and analysis by eliminating the need for manual metadata tagging — a significant pain point in traditional contract lifecycle management systems. Legal teams can now search and generate reports across their entire contract portfolio regardless of where documents are stored, whether in cloud storage solutions like Box and SharePoint or local computers. The system works seamlessly across various data sources, including CLM integrations, requiring minimal implementation while delivering comprehensive insights.</p><p class=\"\">\"Ivo is fundamentally transforming contract review for lawyers and legal teams,\" said <strong class=\"root-Tkn6WL2y\">Amy Cheetham, Partner at Costanoa Ventures</strong>. \"By leveraging AI to manage the meticulous, painstaking work of contract review, Ivo gives legal teams tools designed by lawyers to work faster with greater accuracy. In a world where legal organizations are constantly under pressure to meet business demands and improve efficiency, the launch of Ivo's new search tool will allow legal teams to search and generate reports across their entire contract portfolio, significantly reducing their workload and increasing efficiency.\"</p><p class=\"\">\"The legal profession is in the early stages of an AI-driven transformation,\" <strong class=\"root-Tkn6WL2y\">adds Min-Kyu Jung</strong>. \"We're building Ivo to ensure this change enhances rather than diminishes the crucial role of legal judgment. Our vision is to give every legal team the power to handle enterprise-scale contract volumes while maintaining the highest standards of accuracy and control.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Ends </strong></p><p class=\"\">Media images can be found here. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Ivo</strong></p><p class=\"\">Ivo is on a mission to reduce the time, effort and cost spent on contracts. Ivo was founded out of a belief that contracts are foundational to commerce. The founders saw first-hand how contract review was slowing down mission-critical projects, and decided to do something about it.</p><p class=\"\">Founded in New Zealand and now headquartered in San Francisco, Ivo powers the world's most comprehensive and accurate AI Contract Review platform, designed to help legal and business teams accelerate time-to-close and unblock contracts from key business processes.</p><p class=\"\"> By using AI to reduce the time, effort, and cost of negotiating contracts, Ivo makes it easier for businesses to work together. For more information please visit https://www.ivo.ai/ or follow via LinkedIn </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Costanoa Ventures</strong></p><p class=\"\">Founded in 2012, Costanoa Ventures partners with technical and product founders as early as company formation, with a focus on apps and infrastructure in data, dev and fintech. Costanoa is a long-term partner to entrepreneurs who want hands-on help in their earliest company stages on all things go-to-market and talent. For more information, please visit https://costanoa.vc/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE728XRY:0-ivo-raises-16m-series-a-to-deliver-reliable-ai-contract-review-at-scale-as-it-launches-ivo-search-agent/",
            "pub_date": "2025-02-05 23:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007404:0",
            "title": "How Your Home Can Shelter You From Taxes — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Ashlea Ebeling</p><p class=\"\">For most Americans, buying a home is the biggest investment they will make. There are ways to make it less taxing.</p><p class=\"\">The Internal Revenue Service spells out the details in Publication 530, Tax Information for Homeowners, which it updates each year. To see all the key tax numbers for filing 2024 taxes and this year's tax planning, visit our tax-changes guide. Here are some key things to know about when it comes to taxes and owning or buying a home.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   1. DEDUCTIONS <br/> <br/>   2. CREDITS <br/> <br/>   3. SELLING A HOME </pre><p class=\"\">DEDUCTIONS</p><p class=\"\">Mortgage interest deduction</p><p class=\"\">Taxpayers who itemize deductions, instead of taking the standard deduction, can deduct mortgage interest paid for loans on their main home and a second home — up to a point.</p><p class=\"\">You generally can deduct home mortgage interest only to the extent the loan proceeds from your mortgage are used to buy, build or substantially improve the home securing the loan.</p><p class=\"\">The loan can be a first or second mortgage, a home-improvement loan, a home-equity loan or a refinanced mortgage.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">For mortgages originated on or before Dec. 15, 2017, interest on up to $1   million of debt is deductible ($500,000 if married filing separately). </li><li class=\"listItem-bmN0_SHH\">For mortgages originated after Dec. 15, 2017, interest on up to $750,000   of debt is deductible ($375,000 if married filing separately). </li></ul><p class=\"\">These rules are subject to change after 2025, depending on whether Congress extends the 2017 tax-law provisions on mortgage interest deductions.</p><p class=\"\">IRS Publication 936, Home Mortgage Interest Deduction, has more details.</p><p class=\"\">Deduction for state and local property taxes</p><p class=\"\">Homeowners who itemize deductions can deduct state and local real-estate taxes, subject to an overall SALT cap.</p><p class=\"\">The deduction for state and local taxes, including income, sales or real-estate taxes, is limited to $10,000 per return ($5,000 if married filing separately).</p><p class=\"\">That cap, though, is controversial, and lawmakers are fighting over its fate. The so-called SALT cap is one of the temporary provisions of the 2017 tax law that is set to expire at the end of 2025. If it does, or the level of the cap is increased, more taxpayers, especially in states with high property-tax rates, may be able to itemize and get a larger deduction.</p><p class=\"\">Home-office deduction</p><p class=\"\">Self-employed individuals who use part of their home exclusively and regularly for business purposes can deduct expenses related to a home office. The catch is that you have to have self-employment income. You can't take the deduction for working from home for a job where you receive a W-2 from an employer.</p><p class=\"\">A simplified method allows taxpayers to use a rate of $5 a square foot of the portion of the home used for business, up to a maximum of 300 square feet, to compute the business use of home deduction.</p><p class=\"\">IRS Publication 587, Business Use of Your Home, has details.</p><p class=\"\">What you can't deduct</p><p class=\"\">While homeownership brings many possible deductions, there are a number of things you can't use to reduce your taxes, according to the IRS. These include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Insurance, including title insurance</li><li class=\"listItem-bmN0_SHH\">Wages you pay for domestic help</li><li class=\"listItem-bmN0_SHH\">Depreciation</li><li class=\"listItem-bmN0_SHH\">The cost of utilities or home repairs</li><li class=\"listItem-bmN0_SHH\">Internet or Wi-Fi</li><li class=\"listItem-bmN0_SHH\">Homeowners or condominium association fees</li></ul><p class=\"\">CREDITS</p><p class=\"\">Energy-efficient home improvement credit</p><p class=\"\">Homeowners who make certain energy-efficient improvements to their homes can claim a tax credit of up to $3,200 a year.</p><p class=\"\">This credit equals 30% of the cost of allowed improvements. Insulation, windows and doors can qualify. Heat pumps, water heaters and biomass stoves can count, too.</p><p class=\"\">There are sublimits for different types of improvements: $600 for windows, $2,000 for a heat pump, for example.</p><p class=\"\">Unlike tax deductions that lower income, a tax credit is typically a dollar-for-dollar reduction of tax.</p><p class=\"\">Certain efficiency standards must be met to qualify. For more information, see the IRS Energy Efficient Home Improvement Credit information page.</p><p class=\"\">These credits were expanded under the Inflation Reduction Act of 2022. There is the possibility that some or all of them might come under fire in the new Trump administration.</p><p class=\"\">Solar, wind and geothermal credit</p><p class=\"\">Homeowners who add solar-, wind- or geothermal-power generation, solar water heaters or battery storage to their homes can claim residential clean-energy credits.</p><p class=\"\">The credit covers 30% of the cost of allowed improvements, with no annual or lifetime maximum.</p><p class=\"\">The credit is nonrefundable, meaning the amount you receive can't exceed the amount you owe in tax. You can carry forward any excess unused credit to future tax years.</p><p class=\"\">For more information, see the IRS Residential Clean Energy Credit information page.</p><p class=\"\">These credits may also be called into question in the new administration and as the new Congress takes up tax legislation.</p><p class=\"\">SELLING A HOME</p><p class=\"\">Home seller's exclusion</p><p class=\"\">If you sell your home when you are living and it has gone up in value since you bought it, you will potentially owe capital-gains taxes on the gain.</p><p class=\"\">The gain is the difference between the selling price and the adjusted basis — what you paid for the house, plus any renovations or other capital improvements and certain selling expenses. IRS Publication 523, Selling Your Home, has examples of improvements that count, such as new siding, a patio or ductwork.</p><p class=\"\">The home-sale exclusion lets homeowners skip taxes on a large chunk of profit when they sell their homes.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Single filers can exclude up to $250,000 of capital gains.</li><li class=\"listItem-bmN0_SHH\">Married couples filing jointly can exclude up to $500,000 of capital gains.</li></ul><p class=\"\">To be eligible, the homeowner typically must have used the house as a primary residence for at least two of the previous five years.</p><p class=\"\">Leaving your home to heirs</p><p class=\"\">Keeping your home until death is one of the ultimate tax breaks.</p><p class=\"\">When an owner dies and leaves a property to heirs, the capital gains can effectively get reset to zero. This is called a step-up in basis. It means the heir would owe capital-gains taxes only on the home's growth in value over the fair-market price at the time of the owner's death.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">This explanatory article may be periodically updated.</li></ul><p class=\"\">Write to Ashlea Ebeling at ashlea.ebeling@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007404:0/",
            "pub_date": "2025-02-05 23:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX5RHvdC:0",
            "title": "GTA Home Sales and Average Price Expected to Increase Moderately in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TORONTO, Feb.  05, 2025  (GLOBE NEWSWIRE) — The Toronto Regional Real Estate Board’s (TRREB) <em>Market Outlook and Year in Review report</em> reveals that a well-supplied housing market will keep average annual home price growth at the rate inflation, with the average selling price increasing moderately in the Greater Toronto Area (GTA) over the course of the year.</p><p class=\"\">This year’s sought-after report and interactive digital digest includes new Ipsos consumer polling results, homebuying and selling intentions, and TRREB’s outlook on home sales and average price.</p><p class=\"\">“A growing number of homebuyers will take advantage of lower borrowing costs as we move toward the 2025 spring market, resulting in increased transactions and a moderate uptick in average selling prices in 2025. However, the positive impact of lower mortgage rates could be reduced, at least temporarily, by the negative impact of trade disruptions on the economy and consumer confidence,” said TRREB Chief Market Analyst Jason Mercer.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The 2025 Outlook</strong></p><p class=\"\">For 2025, TRREB forecasts:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A total of 76,000 home sales in 2025, up by 12.4 per cent over 2024. Lower borrowing costs coupled with ample supply will improve affordability and prompt more buyers to move off the sidelines.</li><li class=\"listItem-bmN0_SHH\">The average selling price to reach $1,147,000, up by 2.6 per cent over 2024, for all home types combined. Price growth will be stronger for single-family homes, as compared to the well-supplied condo apartment market.</li></ul><p class=\"\">The Ipsos polling results on buying and selling intentions show:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">28 per cent of survey respondents said they are likely to buy a home in 2025. Nine per cent of these respondents are very likely to purchase a home this year. These results matched intentions for 2024.</li><li class=\"listItem-bmN0_SHH\">First-time buyers accounted for 42 per cent of intending homebuyers.</li><li class=\"listItem-bmN0_SHH\">On average, homeowners rented for 8.5 years before purchasing their first home. However, 25 per cent of homeowners said they rented for two years or less before buying.</li><li class=\"listItem-bmN0_SHH\">Intended down payments remain substantial, at an average of 28 per cent of the purchase price.</li><li class=\"listItem-bmN0_SHH\">37 per cent of survey respondents said they are likely to sell a home in 2025, with 14 per cent very likely to sell. This result was in line with 2024 polling.</li><li class=\"listItem-bmN0_SHH\">The great majority of poll respondents said that high taxes are making homeownership less affordable and if taxes continue to increase many will have to adjust their home buying intentions.</li></ul><p class=\"\">\"As we look to the future, prioritizing housing diversity and supply remains paramount. Encouraging the development of missing-middle housing—such as townhomes, duplexes, and low-rise multi-unit buildings—is critical to delivering a range of attainable options for individuals and families. Purpose-built rentals also play a vital role in ensuring everyone has access to a place they can call home,\" said TRREB President Elechia Barry-Sproule.</p><p class=\"\">The report also unveils new research on traffic congestion and its staggering societal and economic impact on GTA residents. In addition, solutions to reduce the Landlord and Tenant Board backlog are presented alongside policy recommendations aimed at addressing issues within Ontario’s tax, development charge and municipal funding frameworks.</p><p class=\"\">\"At TRREB, we believe the solution starts with collaboration. Traffic congestion and affordability are interconnected challenges that require integrated approaches. The current system of high development charges, taxes, and administrative hurdles only exacerbates the issues. This stalls progress on building the housing supply we need to support our growing communities,” said TRREB CEO John DiMichele.</p><p class=\"\">The <em>2025 Market Outlook and Year in Review</em> report covers all aspects of the GTA real estate market including trends for new homes and condos and a look at the commercial market.</p><p class=\"\">For more insights, head to the digital digest and download the full report.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">January Market Stats Summary</strong></p><p class=\"\">The year started off with GTA REALTORS® reporting 3,847 home sales through TRREB’s MLS® System in January 2025 – down by 7.9 per cent compared to the same period last year. New listings in the MLS® System amounted to 12,392 – up by 48.6 per cent year-over-year. On a seasonally adjusted basis, January sales were up month-over-month compared to December 2024. The MLS® Home Price Index Composite benchmark was up by 0.44 per cent year-over year in January 2025. The average selling price, at $1,040,994, was up by 1.5 per cent compared to the January 2024.</p><p class=\"\">Visit TRREB.ca to read the January 2025 Market Watch report now.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Inquiries:</strong></p><p class=\"\">Maria Karafilidis<strong class=\"root-Tkn6WL2y\">, </strong>Manager, Public Affairs maria.karafilidis@trreb.ca 416-443-8139</p><p class=\"\">The Toronto Regional Real Estate Board is Canada’s largest real estate board with over 73,000 residential and commercial professionals connecting people, property and communities.</p><p class=\"\">Photos accompanying this announcement are available at:</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/06ac0f17-bc6a-4b47-971d-d3015e80f1d9</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/64f6664e-0f0f-4cf4-a843-1713505628c4</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/2594a346-7819-4f80-8133-8ed40c3dc16a</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/691ae33b-431d-48c5-808a-72ea91c0f0eb</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/fec3eba1-4378-4a2a-bb5a-48ecef7a1b90</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/69caccc8-05fe-485c-ac39-876f163c5cc1</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RREB MLS® Sales and Average Price</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">January 2025</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">TRREB MLS® Sales and Average Price by Home Type</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">January 2025</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">TRREB MLS® HPI</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">January 2025</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">TRREB MLS® Sales and Average Price</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Year-to-Date 2025</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">TRREB MLS® Sales and Average Price by Home Type</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Year-to-Date 2025</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">TRREB MLS® Seasonally Adjusted Stats</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">January 2025</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX5RHvdC:0-gta-home-sales-and-average-price-expected-to-increase-moderately-in-2025/",
            "pub_date": "2025-02-05 23:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXb27jH2:0",
            "title": "Double Your Deposit and Get $50 Bonus with 100x Leverage Crypto Trading at BexBack – No KYC!",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1034.3434343434344px;aspect-ratio:1.7239057239057238\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXb27jH2-dd21c59ae37280974331a8dfd53460e1-resized.webp\" type=\"images/webp\"/><img alt=\"Image\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXb27jH2-dd21c59ae37280974331a8dfd53460e1-resized.jpeg\" style=\"background-color:#373226\"/></picture></div></figure></span></p><p class=\"\">SINGAPORE, Feb.  05, 2025  (GLOBE NEWSWIRE) — With the price of bitcoin once again trading below $100,000, many analysts believe it will enter a long period of high volatility. Holding spot positions may not continue to generate profits in the short term. <strong class=\"root-Tkn6WL2y\">BexBack Exchange</strong> is stepping up its efforts to provide traders with irresistible preferential packages. The platform now offers a <strong class=\"root-Tkn6WL2y\">100% deposit bonus</strong>, a $50 welcome bonus for new users, and a 100x leverage on cryptocurrency trading, creating unparalleled opportunities for investors.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Is 100x Leverage and How Does It Work?</strong></p><p class=\"\">Simply put, 100x leverage allows you to open larger trading positions with less capital. For example:</p><p class=\"\">Suppose the Bitcoin price is $100,000 that day, and you open a long contract with 1 BTC. After using 100x leverage, the transaction amount is equivalent to 100 BTC.</p><p class=\"\">One day later, if the price rises to $105,000, your profit will be (105,000 - 100,000) * 100 BTC / 100,000 = 5 BTC, a yield of up to 500%.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">With BexBack's deposit bonus</strong></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:560.25px;max-width:1200px;aspect-ratio:2.14190093708166\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXb27jH2-e12dba87a7e06bc0bd5aa47babb07d07-resized.webp\" type=\"images/webp\"/><img alt=\"Double the funds\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXb27jH2-e12dba87a7e06bc0bd5aa47babb07d07-resized.jpeg\" style=\"background-color:#493455\"/></picture></div></figure></span></p><p class=\"\">BexBack offers a <strong class=\"root-Tkn6WL2y\">100% deposit bonus</strong>. If the initial investment is 2 BTC, the profit will increase to 10 BTC, and the return on investment will double to 1000%.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Note:</strong> Although leveraged trading can magnify profits, you also need to be wary of liquidation risks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How Does the 100% Deposit Bonus Work?</strong></p><p class=\"\">The deposit bonus from BexBack cannot be directly withdrawn but can be used to open larger positions and increase potential profits. Additionally, during significant market fluctuations, the bonus can serve as extra margin, effectively reducing the risk of liquidation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About BexBack?</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BexBack</strong> is a leading cryptocurrency derivatives platform that offers 100x leverage on BTC, ETH, ADA, SOL, and XRP futures contracts. It is headquartered in Singapore with offices in Hong Kong, Japan, the United States, the United Kingdom, and Argentina. It holds a US MSB (Money Services Business) license and is trusted by more than 500,000 traders worldwide. Accepts users from the United States, Canada, and Europe. There are no deposit fees, and traders can get the most thoughtful service, including 24/7 customer support.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Why recommend BexBack?</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">No KYC Required:</strong> Start trading immediately without complex identity verification.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">100% Deposit Bonus</strong><strong class=\"root-Tkn6WL2y\">:</strong> Double your funds, double your profits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">High-Leverage Trading: </strong>Offers up to 100x leverage, maximizing investors' capital efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Demo Account</strong><strong class=\"root-Tkn6WL2y\">: </strong>Comes with 10 BTC in virtual funds, ideal for beginners to practice risk-free trading.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Comprehensive Trading Options: </strong>Feature-rich trading available via Web and mobile applications.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Convenient Operation:</strong> No slippage, no spread, and fast, precise trade execution.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Global User Support: </strong>Enjoy 24/7 customer service, no matter where you are.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Lucrative Affiliate Rewards:</strong> Earn up to 50% commission, perfect for promoters.</p><p class=\"\">Take Action Now—Don’t Miss Another Opportunity!</p><p class=\"\">If you missed the previous crypto bull run, this could be your chance. With BexBack's 100x leverage and <strong class=\"root-Tkn6WL2y\">100% deposit bonus</strong> and <strong class=\"root-Tkn6WL2y\">$50 bonus for new users</strong> (complete one trade within one week of registration), you can be a winner in the new bull run.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sign up on BexBack now</strong>, claim your exclusive bonus and start accumulating more BTC today!</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Website:</strong> www.bexback.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong> business@bexback.com</p><p class=\"\">Contact:</p><p class=\"\">Amanda</p><p class=\"\">business@bexback.com</p><p class=\"\">Disclaimer: This content is provided by BexBack. The statements, views and opinions expressed in this column are solely those of the content provider. The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities. Please conduct your own research and invest at your own risk.</p><p class=\"\">Photos accompanying this announcement are available at:</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/2d7570e1-dd49-41f2-bb56-fdde6bb57717</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/b704fe83-5d72-424f-8e4d-faedb85932fd</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/b1489dbf-1cba-4388-8bb7-dd56cd0dd96f</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/3653b677-5659-44e3-b40f-346380acd8ca</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bexback</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Bexback</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Double the funds </strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Double the funds </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">100x leverage, BTC Futures Trading</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">100x leverage, BTC Futures Trading</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How to Clalm</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">How to Clalm</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXb27jH2:0-double-your-deposit-and-get-50-bonus-with-100x-leverage-crypto-trading-at-bexback-no-kyc/",
            "pub_date": "2025-02-05 23:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007418:0",
            "title": "Blackbaud K-12 Executive Advisory Board Welcomes New Executive Director and Members",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Blackbaud K-12 Executive Advisory Board Welcomes New Executive Director and Members</p><p class=\"\">PR Newswire</p><p class=\"\">CHARLESTON, S.C., Feb. 5, 2025</p><p class=\"\">Members Bring Deep Expertise on the Needs of the K--12 Independent School Market and Advise on Technology Development</p><p class=\"\">CHARLESTON, S.C., Feb. 5, 2025 /PRNewswire/ — Blackbaud , the leading provider of software for powering social impact, has welcomed a new executive director and new members to its K--12 Executive Advisory Board, which gathers leaders from prominent K--12 independent schools across the U.S. and Canada to offer their expertise on the needs of the sector.</p><p class=\"\">The 19 members on the current board represent a variety of school offices and disciplines, including admissions, marketing and communication, technology, advancement, business operations, registrar and academics. The board advises and assists Blackbaud through continuous, independent reviews of its products, processes, and services for K--12 independent schools, providing input on all aspects of Blackbaud's product design, development, customer success, distribution and support.</p><p class=\"\">\"This marks the 22nd year of our K--12 Executive Advisory Board, and the insights we've gained from our members through the years are invaluable, \" said Mark Davis, vice president, education products, Blackbaud. \"Having direct relationships with private school leaders allows Blackbaud to better understand the challenges and opportunities schools are facing. By better understanding both their immediate and long-term needs, we can provide the best possible experience through Blackbaud's Total School Solution to empower their communities.\"</p><p class=\"\">In 2024, Blackbaud hosted nine meetups with more than 500 K--12 independent school leaders, in addition to 10 advisory board sessions and an annual advisory board retreat filled with breakout sessions, product deep dives, and an opportunity to submit shark tank ideas for Blackbaud product development consideration. Blackbaud interacts with the board regularly to evaluate and gain input on strategic topics, such as the application of AI, partner connections, data insights, reporting and system connectivity--all topics that facilitate fast-paced innovation across Blackbaud's K--12 portfolio.</p><p class=\"\">The deep sector knowledge that comes from this engagement has informed Blackbaud products directly, enabling the company to better serve schools across the country. Recently, American Heritage School and NSU University School selected Blackbaud to deliver components of the Total School Solution to modernize their school operations across admissions and enrollment, student information, learning management, financial aid, and tuition management. Additionally, Punahou School and Pine Crest School, who both have representatives on the current K--12 Executive Advisory Board, have recently decided to extend their longstanding relationships with Blackbaud while continuing to leverage Blackbaud's Total School Solution to manage their entire school operations.</p><p class=\"\">\"During our vendor selection process, I was impressed to learn that Blackbaud had invested so much in cultivating such an effective advisory board specific to the K--12 independent school sector,\" shared Jacob Glickman, associate head of school operations at NSU University School. \"The fact that Blackbaud seeks direct guidance from so many of my peers made me much more confident in our decision to ultimately select Blackbaud as our vendor of choice.\"</p><p class=\"\">Davis added, \"We want to thank our outgoing executive director Hiram Cuevas, director of information systems and academic technology at St. Christopher's School, for his dedication and meaningful contributions over the last six years that have helped us serve our K--12 customers. In addition, we're thrilled to welcome our new executive director Austin Ewachiw, director of technology at Calvert Hall College High School, and we're excited to learn from all our members who represent roles across the school business office.\"</p><p class=\"\">The full list of Blackbaud K--12 Advisory Board members can be found here, and more details on Blackbaud's K--12 solutions can be found here.</p><p class=\"\">About Blackbaud</p><p class=\"\">Blackbaud  is the leading software provider exclusively dedicated to powering social impact. Serving the nonprofit and education sectors, companies committed to social responsibility and individual change makers, Blackbaud's essential software is built to accelerate impact in fundraising, nonprofit financial management, digital giving, grantmaking, corporate social responsibility and education management. With millions of users and over $100 billion raised, granted or managed through Blackbaud platforms every year, Blackbaud's solutions are unleashing the potential of the people and organizations who change the world. Blackbaud has been named to Newsweek's list of America's Most Responsible Companies, Quartz's list of Best Companies for Remote Workers, and Forbes' list of America's Best Employers. A remote-first company, Blackbaud has operations in the United States, Australia, Canada, Costa Rica, India and the United Kingdom, supporting users in 100+ countries. Learn more at www.blackbaud.com or follow us on X/Twitter, LinkedIn, Instagram and Facebook.</p><p class=\"\">Media Inquiries</p><p class=\"\">media@blackbaud.com</p><p class=\"\">Forward-looking Statements</p><p class=\"\">Except for historical information, all of the statements, expectations and assumptions contained in this news release are forward-looking statements that involve a number of risks and uncertainties, including statements regarding expected benefits of products and product features. Although Blackbaud attempts to be accurate in making these forward-looking statements, it is possible that future circumstances might differ from the assumptions on which such statements are based. In addition, other important factors that could cause results to differ materially include the following: general economic risks; uncertainty regarding increased business and renewals from existing customers; continued success in sales growth; management of integration of acquired companies and other risks associated with acquisitions; risks associated with successful implementation of multiple integrated software products; the ability to attract and retain key personnel; risks associated with management of growth; lengthy sales and implementation cycles; technological changes that make our products and services less competitive; and the other risk factors set forth from time to time in the SEC filings for Blackbaud, copies of which are available free of charge at the SEC's website at www.sec.gov or upon request from Blackbaud's investor relations department. All Blackbaud product names appearing herein are trademarks or registered trademarks of Blackbaud, Inc.</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/blackbaud-k12-executive-advisory-board-welcomes-new-executive-director-and-members-302368803.html</p><p class=\"\">SOURCE Blackbaud</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007418:0/",
            "pub_date": "2025-02-05 23:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:60170e94541eb:0",
            "title": "BXP Executive Vice President Sells Over 12,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Spann Hilary J.</td></tr><tr><td>Relationship</td><td>Executive Vice President</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$891,535</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1900835/000124699125000066/xslF345X05/wk-form4_1738767132.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Hilary J. Spann, Executive Vice President of BXP, sold 12,379 shares of Common Stock at a weighted average price of $72.02 per share, totaling $891,535. Following the transaction, Spann directly owns 7,271 shares of the company.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1900835/000124699125000066/xslF345X05/wk-form4_1738767132.xml\" rel=\"nofollow\" target=\"_blank\">BXP, Inc. [ BXP ] - Form 4 - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:60170e94541eb:0-bxp-executive-vice-president-sells-over-12-000-shares/",
            "pub_date": "2025-02-05 23:00:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObitwH2Fa:0",
            "title": "RANA: Invitation to the Fourth Quarter 2024 Presentation, Thursday, February 13",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rana Gruber ASA will release its fourth-quarter results for 2024 on Thursday,February 13, at 7:00 a.m. CET.The results will be presented in a webcast with CEO Gunnar Moe and CFO ErlendHøyen at 8:00 a.m. CET.</p><p class=\"\">The presentation, followed by a Q&amp;A session, will be held in English and canbeviewed live athttps://teams.microsoft.com/dl/launcher/launcher.html?url=%2F_%23%2Fl%2Fmeetup-join%2F19%3Ameeting_YjgzZWM1MjktYmM0NC00YWU0LWE5NzMtNDZhZjdkN2U3NWJl%40thread.v2%2F0%3Fcontext%3D%7B%22Tid%22%3A%22aa27140a-2345-453d-8e7f-29143981b2a9%22%2C%22Oid%22%3A%229ec47a9b-5851-4476-a295-580fffed32fc%22%7D%26anon%3Dtrue&amp;type=meetup-join&amp;deeplinkId=366ec13c-c83b-458e-b6d9-148a33c8c5c5&amp;directDl=true&amp;msLaunch=true&amp;enableMobilePage=true</p><p class=\"\">A recording of the presentation will be made available onhttps://ranagruber.no/investors/ after the presentation.</p><p class=\"\">For more information, please contact: Gunnar Moe, Chief Executive Officer: +47 941 47 650 Erlend Høyen, Chief Financial Officer: +47 902 02 741</p><p class=\"\">About Rana Gruber Rana Gruber is a Norwegian iron ore producer established in 1964, withoperations based on more than 200 years of mining experience. The company'sproducts are based on natural mineral resources, which are processed andexported to customers worldwide. Key customers include steel producers andparticipants in the chemical industry. The company has about 370 employees andaproduction capacity of 1.8 million metric tons of iron ore concentrates.</p><p class=\"\">https://newsweb.oslobors.no/message/637791</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObitwH2Fa:0-rana-invitation-to-the-fourth-quarter-2024-presentation-thursday-february-13/",
            "pub_date": "2025-02-05 23:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310093:0",
            "title": "Evercore ISI Adjusts KKR Price Target to $165 From $158, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KKR  has an average rating of overweight and mean price target of $171.56, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310093:0/",
            "pub_date": "2025-02-05 23:00:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464064:0",
            "title": "Banco Santander Unit Places NOK500 Million Bonds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Banco Santander's  Santander Consumer Bank placed 500 million Norwegian kroner of new floating rate senior unsecured bonds for settlement Feb. 11. </p><p class=\"\">The bonds were priced at 100% and are due on Feb. 11, 2028, with a coupon of three-month Norwegian interbank offered rate plus 60 basis points, according to a Wednesday release. </p><p class=\"\">SEB served as the lead manager for the transaction.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464064:0/",
            "pub_date": "2025-02-05 23:00:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW213:0",
            "title": "Reliance Power Dec-Quarter Consol Net Profit 419.5 Million Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reliance Power Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET PROFIT 419.5 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 18.53 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW213:0-reliance-power-dec-quarter-consol-net-profit-419-5-million-rupees/",
            "pub_date": "2025-02-05 23:00:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446786:0",
            "title": "Lead Hits 6-week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lead increased to a 6-week high of 1999.00 USD/T. Over the past 4 weeks, Lead gained 2.62%, and in the last 12 months, it decreased 5.69%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446786:0-lead-hits-6-week-high/",
            "pub_date": "2025-02-05 23:00:31",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310067:0",
            "title": "Super Micro Computer Says AI Data Center Reaches Full Production Availability",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Super Micro Computer  said Wednesday that its artificial intelligence data center, Building Block Solutions, has reached full production availability using Nvidia's  Blackwell platform. </p><p class=\"\">The company said its AI center provides the infrastructure needed to scale Blackwell, including air-cooled and liquid-cooled systems with multiple central processing unit options, including traditional air cooling, as well as liquid-to-liquid and liquid-to-air cooling. </p><p class=\"\">Shares of Super Micro Computer were up more than 3% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310067:0/",
            "pub_date": "2025-02-05 23:00:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007453:0",
            "title": "Talos Energy Is Maintained at Overweight by Stephens & Co.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007453:0/",
            "pub_date": "2025-02-05 23:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007360:0",
            "title": "Johnson Controls Up Over 13%, on Track for Record High Close — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Johnson Controls International plc (JCI) is currently at $87.42, up $10.13 or 13.11%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be new all-time high (Based on available data back to Jan. 21, 1972)</li><li class=\"listItem-bmN0_SHH\">Would be the first record close since Nov. 11, 2024, when it closed at $86.60</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Feb. 3, 2009, when it rose 19.32%</li><li class=\"listItem-bmN0_SHH\">Currently up two consecutive days; up 13.53% over this period</li><li class=\"listItem-bmN0_SHH\">Best two day stretch since the two days ending Jan. 25, 2016, when it rose 13.87%</li><li class=\"listItem-bmN0_SHH\">Up 10.76% year-to-date</li><li class=\"listItem-bmN0_SHH\">Up 60.7% from 52 weeks ago (Feb. 7, 2024), when it closed at $54.40</li><li class=\"listItem-bmN0_SHH\">Would be a new 52-week closing high</li><li class=\"listItem-bmN0_SHH\">Up 60.7% from its 52-week closing low of $54.40 on Feb. 7, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $88.90; new all-time intraday high (Based on available data back to Jan. 21, 1972)</li><li class=\"listItem-bmN0_SHH\">Up 15.02% at today's intraday high; largest intraday percent increase since Feb. 3, 2009, when it rose as much as 20.11%</li><li class=\"listItem-bmN0_SHH\">Best performer in the S&amp;P 500 today</li></ul><p class=\"\">All data as of 9:51:34 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007360:0/",
            "pub_date": "2025-02-05 22:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009185:0",
            "title": "Gold Keeps Hitting Record Highs. Here's Why — and Which Stocks Could Benefit. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul R. La Monica</p><p class=\"\">Worries about tariffs are spooking many investors. But not gold bulls. Fans of the yellow metal are probably relishing all the uncertainty that President Donald Trump's tariff threats are creating.</p><p class=\"\">Gold prices are up about 8.5% already this year. At just under $2,900 an ounce, the yellow metal is at a record high. And that follows a nearly 30% gain for gold in 2024.</p><p class=\"\">Investors in mining stocks are doing even better. The VanEck Gold Miners exchange-traded fund, which has big stakes in Newmont Corp., Agnico Eagle Mines and Barrick Gold, has soared more than 18% so far in 2025.</p><p class=\"\">Should investors be a little wary after such a big run this year on top of 2024's enormous gains? Of course. That would be prudent. But it's worth noting that the mining stocks could have more room to run if gold prices keep climbing. And that seems very plausible.</p><p class=\"\">It appears that both foreign central banks and retail investors are fueling the rally. Poland, Turkey, India, and China have been big buyers, according to data from late last year from the World Gold Council.</p><p class=\"\">\"Emerging market banks are very committed to gold and well positioned to purchase more. Strategically, they will continue to be buyers,\" said Joe Cavatoni, senior markets strategist with the World Gold Council, in an interview with Barron's.</p><p class=\"\">The World Gold Council said in a report Wednesday that demand for gold in the fourth quarter rose to a new quarterly high and that the outlook for 2025 was bright.</p><p class=\"\">\"Central banks and ETF investors [are] likely to drive demand with economic uncertainty supporting gold's role as a risk hedge,\" the WGC said.</p><p class=\"\">It's all about the Trump trade war. The continued surge in gold is a bit unusual since it's happening at a time when the U.S. dollar is also strengthening.</p><p class=\"\">Frank Watson, a markets analyst for Kinesis Money, pointed out that a surging greenback is \"normally a bearish element for dollar-denominated gold prices,\" but he added that \"gold's safe haven appeal remains undiminished amid uncertainty over the economic and inflationary effects of expected US trade tariffs.\" In other words, Trump's trade policies may trump the usual impact a strong dollar has on gold.</p><p class=\"\">Silver prices have been climbing too, rising about 14% so far this year. Alex Ebkarian, chief operating officer of physical precious metals dealer Allegiance Gold, said in an email to Barron's that the prices of both metals should keep climbing due to the market uncertainty.</p><p class=\"\">\"In a high-risk environment, the appeal of physical gold and silver becomes even more pronounced, as they eliminate counterparty risk and provide a reliable store of value,\" he said, adding that a recent move by JPMorgan Chase to deliver about $4 billion worth in gold futures is \"an apparent hedge against potential trade disruptions.\"</p><p class=\"\">So how much higher could gold go? Michael Arone, chief investment strategist for State Street's SPDR Business, thinks gold could top $3,000 an ounce sometime this year due to all that is happening on the worldwide landscape.</p><p class=\"\">\"Geopolitical risks and structural transitions in monetary and fiscal policies should also boost the prospects for gold,\" Arone wrote. \"Central bank purchases throughout the year will likely continue to support gold's price. All that could finally unleash some pent up investment demand from investors chasing last year's record gold prices.\"</p><p class=\"\">That should be good news as well for the mining stocks, which despite their big run already this year, remain reasonably valued. The VanEck Gold Miners ETF is trading for just 12 times 2025 earnings estimates, lower than its 5-year average of 15. It's also trading at about a price-to-earnings ratio that is 45% below the S&amp;P 500, much steeper than its usual 20% discount to the broader market.</p><p class=\"\">Write to Paul R. La Monica at paul.lamonica@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009185:0/",
            "pub_date": "2025-02-05 22:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310077:0",
            "title": "Wolfe Research Adjusts Apollo Global Management's Price Target to $183 From $193",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Apollo Global Management  has an average rating of overweight and mean price target of $184.28, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310077:0/",
            "pub_date": "2025-02-05 22:54:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446782:0",
            "title": "US Private Sector Activity Expands at Slower Pace",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global US Composite PMI came in at 52.7 in January 2025, slightly above the preliminary estimate of 52.4 but well below December’s 55.4.</p><p class=\"\">While marking the lowest reading since April 2024, the PMI still indicated a solid monthly expansion in business activity.</p><p class=\"\">A renewed uptick in manufacturing output offset a slower rise in services activity.</p><p class=\"\">Meanwhile, the pace of new business growth softened, but job creation accelerated to its fastest rate since June 2022.</p><p class=\"\">On the inflation front, both input costs and output prices rose at a quicker pace.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446782:0-us-private-sector-activity-expands-at-slower-pace/",
            "pub_date": "2025-02-05 22:54:37",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310075:0",
            "title": "Fubon Securities Adjusts PayPal Holdings Price Target to $88 From $82, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal Holdings  has an average rating of overweight and mean price target of $95.22, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310075:0/",
            "pub_date": "2025-02-05 22:54:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX4M4JFf:0",
            "title": "SEALSQ to Host Quantum Day at NASDAQ Roundtable and Closing Bell Ceremony on February 11, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New York, NY, Feb.  05, 2025  (GLOBE NEWSWIRE) — </p><p class=\"\">Industry Experts to Discuss U.S. Strategic Technological Independence in Semiconductors, Post-Quantum AI, and Cybersecurity</p><p class=\"\">SEALSQ Corp  (\"SEALSQ\" or \"Company\"), a company that focuses on developing and selling Semiconductors, PKI, and Post-Quantum technology hardware and software products, today announced that it will host <strong class=\"root-Tkn6WL2y\">SEALSQ Quantum Day</strong> at NASDAQ on February 11, 2025<strong class=\"root-Tkn6WL2y\">,</strong> featuring a high-profile <strong class=\"root-Tkn6WL2y\">Roundtable Discussion</strong> following the <strong class=\"root-Tkn6WL2y\">NASDAQ Closing Bell Ceremony</strong>. The event will focus on the <!-- -->United States' strategic need for technological independence in <!-- -->semiconductors, post-quantum artificial intelligence (AI), and cybersecurity, which are critical for national security, economic growth, and technological leadership.</p><p class=\"\">With increasing geopolitical tensions and supply chain vulnerabilities, <!-- -->United States must secure and accelerate the development of cutting-edge semiconductor technologies. SEALSQ USA is leading the way by leveraging <!-- -->established innovation hubs in Arizona and New York to bring <strong class=\"root-Tkn6WL2y\">next-generation security solutions</strong> to the American market. This initiative aligns with the United States government’s broader strategy to reduce reliance on foreign semiconductor manufacturing and enhance domestic production capabilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Event Details</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Venue:</strong> NASDAQ MarketSite, New York</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Date:</strong> February 11, 2025</p><p class=\"\">Roundtable Discussion: The Path to U.S. Technological Sovereignty</p><p class=\"\">The roundtable discussion will explore how <!-- -->advanced semiconductors, post-quantum cryptography, and cybersecurity innovations will define the future of global competitiveness. <strong class=\"root-Tkn6WL2y\">Industry leaders and technology visionaries</strong> will discuss the challenges and opportunities in creating a <!-- -->secure, self-sufficient U.S. semiconductor ecosystem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Moderator:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">David Fergusson</strong> – Executive Managing Director, M&amp;A &amp; Technology Practice Leader, <strong class=\"root-Tkn6WL2y\">Generational Equity, LLC</strong></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Panelists:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Carlos Moreira</strong> – CEO &amp; Founder, <strong class=\"root-Tkn6WL2y\">SEALSQ</strong></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Bernard Vian</strong> – Managing Director, <strong class=\"root-Tkn6WL2y\">SEALSQ</strong></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Mark Minevich</strong> – President &amp; Founding Partner, <strong class=\"root-Tkn6WL2y\">Going Global Ventures</strong></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Hossein Rahnama</strong> – Founder &amp; CEO, <strong class=\"root-Tkn6WL2y\">Flybits Inc.</strong>, Associate Professor, <strong class=\"root-Tkn6WL2y\">Ryerson University</strong>, Visiting Professor, <strong class=\"root-Tkn6WL2y\">MIT Media Lab</strong></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cristina Dolan</strong> – MIT Alum, Engineer, Expert in Open Banking, PSD2, Cybersecurity, Blockchain, IoT, Cloud AI, IPOs, and Innovation Speaker (TEDx, Keynotes)</li></ul><p class=\"\">Why U.S. Leadership in Semiconductors and Quantum AI Matters</p><p class=\"\">The semiconductor industry is at the heart of the global economy, powering everything from smartphones to national defense systems. However, <!-- -->recent supply chain disruptions and international tensions have highlighted the urgent need for the United States to reduce its dependence on foreign-made chips.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">National Security:</strong> U.S. defense and intelligence operations require secure, domestically produced semiconductors that cannot be compromised by foreign adversaries.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Economic Competitiveness:</strong> As the global semiconductor race accelerates, U.S. companies must remain at the forefront of <!-- -->chip design, manufacturing, and AI-driven security solutions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Post-Quantum Cybersecurity:</strong> With the imminent arrival of quantum computing, legacy encryption methods will become obsolete, making <!-- -->quantum-resistant security solutions a critical investment for U.S. infrastructure.</li></ul><p class=\"\">SEALSQ’s Role in the Future of U.S. Semiconductor Innovation</p><p class=\"\">SEALSQ has pioneered <!-- -->post-quantum cryptography and cybersecurity solutions, ensuring that America remains resilient against cyber threats. Through its strategic partnerships and R&amp;D investments, <!-- -->SEALSQ USA is actively contributing to the reshaping of the semiconductor industry by fostering <!-- -->innovation in trusted hardware security and next-generation AI applications.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Join Us at NASDAQ Quantum Day</strong></p><p class=\"\">This exclusive event provides an opportunity for industry leaders, policymakers, and investors to <!-- -->engage with top experts in semiconductors, AI, and cybersecurity. The insights shared will help shape <strong class=\"root-Tkn6WL2y\">the next decade of U.S. technological independence</strong>.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Register Here:</strong> https://www.sealsq.com/quantum-day-invitation</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About SEALSQ:</strong></p><p class=\"\">SEALSQ is a leading innovator in Post-Quantum Technology hardware and software solutions. Our technology seamlessly integrates Semiconductors, PKI (Public Key Infrastructure), and Provisioning Services, with a strategic emphasis on developing state-of-the-art Quantum Resistant Cryptography and Semiconductors designed to address the urgent security challenges posed by quantum computing. As quantum computers advance, traditional cryptographic methods like RSA and Elliptic Curve Cryptography (ECC) are increasingly vulnerable.</p><p class=\"\">SEALSQ is pioneering the development of Post-Quantum Semiconductors that provide robust, future-proof protection for sensitive data across a wide range of applications, including Multi-Factor Authentication tokens, Smart Energy, Medical and Healthcare Systems, Defense, IT Network Infrastructure, Automotive, and Industrial Automation and Control Systems. By embedding Post-Quantum Cryptography into our semiconductor solutions, SEALSQ ensures that organizations stay protected against quantum threats. Our products are engineered to safeguard critical systems, enhancing resilience and security across diverse industries.</p><p class=\"\">For more information on our Post-Quantum Semiconductors and security solutions, please visit www.sealsq.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This communication expressly or implicitly contains certain forward-looking statements concerning SEALSQ Corp and its businesses. Forward-looking statements include statements regarding our business strategy, financial performance, results of operations, market data, events or developments that we expect or anticipates will occur in the future, as well as any other statements which are not historical facts. Although we believe that the expectations reflected in such forward-looking statements are reasonable, no assurance can be given that such expectations will prove to have been correct. These statements involve known and unknown risks and are based upon a number of assumptions and estimates which are inherently subject to significant uncertainties and contingencies, many of which are beyond our control. Actual results may differ materially from those expressed or implied by such forward-looking statements. Important factors that, in our view, could cause actual results to differ materially from those discussed in the forward-looking statements include SEALSQ's ability to continue beneficial transactions with material parties, including a limited number of significant customers; market demand and semiconductor industry conditions; and the risks discussed in SEALSQ's filings with the SEC. Risks and uncertainties are further described in reports filed by SEALSQ with the SEC.</p><p class=\"\">SEALSQ Corp is providing this communication as of this date and does not undertake to update any forward-looking statements contained herein as a result of new information, future events or otherwise.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">SEALSQ Corp.Carlos MoreiraChairman &amp; CEOTel: +41 22 594 3000info@sealsq.com</li><li class=\"listItem-bmN0_SHH\">SEALSQ Investor Relations (US)The Equity Group Inc.Lena CatiTel: +1 212 836-9611 lcati@equityny.com</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX4M4JFf:0-sealsq-to-host-quantum-day-at-nasdaq-roundtable-and-closing-bell-ceremony-on-february-11-2025/",
            "pub_date": "2025-02-05 22:55:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007366:0",
            "title": "Costamare Is Maintained at Hold by Jefferies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:55 GMT) </strong>Costamare Price Target Maintained With a $13.00/Share by Jefferies</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007366:0/",
            "pub_date": "2025-02-05 22:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX8BvsfN:0",
            "title": "Avid Bioservices poised for significant growth with new partners GHO Capital and Ampersand Capital Partners",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Acquisition of biologics Contract Development and Manufacturing Organisation Avid Bioservices now completed</li><li class=\"listItem-bmN0_SHH\">GHO and Ampersand’s deep experience in CDMO investing to support Avid’s next stage of rapid growth including expanded offerings, talent investment and greater geographic reach</li></ul><p class=\"\">LONDON and BOSTON and TUSTIN, Calif., Feb.  05, 2025  (GLOBE NEWSWIRE) — GHO Capital Partners LLP (\"GHO\"), the European specialist investor in global healthcare, and Ampersand Capital Partners (“Ampersand”), a private equity firm specialising in growth equity investments in the life sciences and healthcare sectors, today announced the successful closing of the previously announced acquisition of Avid Bioservices (“Avid” of the “Company”), a dedicated biologics Contract Development and Manufacturing Organisation (“CDMO”) working to improve patient lives by providing high quality development and manufacturing services to biotechnology and pharmaceutical companies.</p><p class=\"\">Avid has experienced significant growth in recent years, offering its clients full lifecycle capabilities—from concept to commercial supply. With substantial investment already made by the Company in its capacity at its state-of-the art facilities and its expertise in bioprocess optimisation, analytical testing, and regulatory compliance, Avid delivers high-quality, industry leading complex biologics to a roster of international customers.</p><p class=\"\">GHO has considerable expertise in the CDMO sector through investments in its portfolio in companies like Ardena, Sterling Pharma Solutions, RoslinCT, and Alcami Corporation. Its strategy focuses on expanding technological capabilities, driving acquisitions, and supporting transatlantic expansion across the CDMO value chain, from early-stage development to commercial manufacturing. Leveraging its healthcare expertise and network, GHO Capital transforms CDMOs to enhance their services and market reach, ultimately delivering better, faster and more accessible healthcare.</p><p class=\"\">Alan MacKay and Mike Mortimer, Managing Partners of GHO, commented: “We are delighted to start 2025 with the completion of this transaction, our first public to private deal. GHO has a deep understanding of the CDMO sector and Avid perfectly exemplifies a company that is operating in high growth markets supporting the growing biotech sector in research and development and big pharma and large biotech for the commercialisation of cutting-edge biologics. Avid's recent investments, both in capacity and its exemplary team, have created a strong foundation for future growth. We look forward to partnering closely with the Avid team to unlock the business’s full potential.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nick Green, President and CEO of Avid, said: </strong>“Avid has succeeded by evolving and adapting to meet our customers' complex development and manufacturing needs. The completion of this transaction marks an exciting milestone as we move forward with new owners in GHO Capital and Ampersand who will provide us with access to resources that will accelerate our growth. With their support, we are well-positioned to enhance our capabilities, expand our service offerings, and deliver even greater value to our customers in this next phase of our journey.\"</p><p class=\"\">David Anderson, General Partner of Ampersand, added: “Avid has earned its reputation as a leader in biopharmaceutical development and manufacturing through technical excellence, customised solutions, and consistent regulatory compliance. By combining our deep industry expertise with Avid's established capabilities, we are positioned to deliver enhanced value and accelerate innovation for clients globally.”</p><p class=\"\">On 7 November 2024, GHO and Ampersand entered into a definitive merger agreement for Avid to be acquired by funds managed by GHO and Ampersand in an all-cash transaction valued at approximately $1.1 billion. With the completion of the transaction, Avid’s stockholders are entitled to receive $12.50 per share in cash. The Company's common stock has ceased trading and will be delisted from Nasdaq.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Advisors</strong></p><p class=\"\">William Blair served as buyside financial advisers, Ropes &amp; Gray served as legal counsel, ClearView Healthcare Partners served as commercial advisor and Alvarez &amp; Marsal served as financial advisors to GHO and Ampersand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">GHO Capital</strong></p><p class=\"\">Amber Fennell / Kris Lam</p><p class=\"\">ICR Healthcare</p><p class=\"\">+44 7739658783</p><p class=\"\">ghocapital@icrhealthcare.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Avid Bioservices</strong></p><p class=\"\">Stephanie Diaz</p><p class=\"\">Vida Strategic Partners</p><p class=\"\">415-675-7401</p><p class=\"\">sdiaz@vidasp.com</p><p class=\"\">Tim Brons</p><p class=\"\">Vida Strategic Partners</p><p class=\"\">415-675-7402</p><p class=\"\">tbrons@vidasp.com</p><p class=\"\">Aaron Palash / Allison Sobel</p><p class=\"\">Joele Frank, Wilkinson Brimmer Katcher</p><p class=\"\">(212) 355-4449</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GHO Capital</strong></p><p class=\"\">Global Healthcare Opportunities, or GHO Capital Partners LLP, is a leading specialist healthcare investment advisor based in London. GHO Capital applies global capabilities and perspectives to unlock high growth healthcare opportunities, targeting Pan-European and transatlantic internationalisation to build market leading businesses of strategic global value. GHO Capital’s proven investment track record reflects the unrivalled depth of our industry expertise and network. GHO Capital partners with strong management teams to generate long-term sustainable value, improving the efficiency of healthcare delivery to enable better, faster, more accessible healthcare. For further information, please visit www.ghocapital.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Avid Bioservices, Inc. </strong></p><p class=\"\">Avid Bioservices is a dedicated CDMO focused on development and CGMP manufacturing of biologics. The Company provides a comprehensive range of process development, CGMP clinical and commercial manufacturing services for the biotechnology and biopharmaceutical industries. With more than 30 years of experience producing biologics, Avid's services include CGMP clinical and commercial drug substance manufacturing, bulk packaging, release and stability testing and regulatory submissions support. For early-stage programs the Company provides a variety of process development activities, including cell line development, upstream and downstream development and optimization, analytical methods development, testing and characterization. The scope of our services ranges from standalone process development projects to full development and manufacturing programs through commercialization. www.avidbio.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Ampersand Capital Partners</strong></p><p class=\"\">Ampersand Capital Partners, founded in 1988, is a middle-market private equity firm with $3 billion of assets under management, dedicated to growth-oriented investments in the healthcare sector. With offices in Boston, MA, and Amsterdam, Netherlands, Ampersand leverages a unique blend of private equity and operating experience to build value and drive long-term performance alongside its portfolio company management teams. Ampersand has helped build numerous market-leading companies across each of the firm's core healthcare sectors. For additional information, visit www.ampersandcapital.com or follow us on LinkedIn.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX8BvsfN:0-avid-bioservices-poised-for-significant-growth-with-new-partners-gho-capital-and-ampersand-capital-partners/",
            "pub_date": "2025-02-05 22:55:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310080:0",
            "title": "Keefe Bruyette & Woods Adjusts Apollo Global Management's Price Target to $194 From $196",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Apollo Global Management  has an average rating of overweight and mean price target of $184.28, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310080:0/",
            "pub_date": "2025-02-05 22:55:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW0LM:0",
            "title": "Price Forbes expands Turkish operations with Süer named chairman & CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Price Forbes, the speciality broker which forms part of the Ardonagh Group, has expanded its brand into the Turkish insurance market with Gökçen Süer appointed as chairman and CEO of Price Forbes Türkiye.</p><p class=\"\">Süer brings over 25 years of wholesale and reinsurance broking experience to Price Forbes Türkiye. He founded Türkiye’s first wholesale broker, GRC Re, and also served as chairman of Howden Sigorta and GRC Howden Re.</p><p class=\"\">Price Forbes said in a statement on Wednesday that the appointment marks a “pivotal step” in the broker’s strategy to strengthen its footprint in the region.</p><p class=\"\">Besso Sigorta, which has been operating in the Turkish market for over a decade, will now rebrand to Price Forbes Türkiye.</p><p class=\"\">Süer will spearhead the rebrand and lead the company’s expansion into Türkiye, the Middle East and the Commonwealth of Independent States. The company will expand its services to offer a broader range of wholesale and reinsurance broking solutions, providing expertise in complex and industrial risks, specialty solutions and treaty reinsurance.</p><p class=\"\">Süer said: “The reputation of the Price Forbes brand and the growth journey of the Ardonagh Group were key factors that attracted me to this role.</p><p class=\"\">“I am excited to join at the start of an exciting new chapter for the team who are focused on creating the best-quality services and solutions to clients in Türkiye and the wider region. Our ambition is to become the most trusted reinsurance and wholesale broker in Türkiye, as well as a reputable partner for our clients across the Middle East and CIS regions.”</p><p class=\"\">John Thompson, CEO of specialty broking at Price Forbes, added: “Gökçen’s track record of building and leading successful businesses makes him the ideal person to drive Price Forbes Türkiye forward. His deep market knowledge and established relationships will be instrumental in strengthening our presence in the region and achieving our long-term growth objectives.”</p><p class=\"\">Price Forbes is the largest independent specialty broker in the London market, managing over $6bn in gross written premium with a global team of 2,500 colleagues.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW0LM:0-price-forbes-expands-turkish-operations-with-s-er-named-chairman-ceo/",
            "pub_date": "2025-02-05 22:55:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310082:0",
            "title": "UBS Adjusts Price Target on Oscar Health to $15 From $17, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oscar Health  has an average rating of overweight and mean price target of $20.06, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310082:0/",
            "pub_date": "2025-02-05 22:55:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310084:0",
            "title": "Barclays Adjusts Apollo Global Management's Price Target to $196 From $200",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Apollo Global Management  has an average rating of overweight and mean price target of $184.28, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310084:0/",
            "pub_date": "2025-02-05 22:55:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX25SpFD:0",
            "title": "Avid Bioservices poised for significant growth with new partners GHO Capital and Ampersand Capital Partners",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Avid Bioservices poised for significant growth with new partners GHO Capital and </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Ampersand Capital Partners </strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Acquisition of biologics Contract Development and Manufacturing Organisation Avid Bioservices now completed</li><li class=\"listItem-bmN0_SHH\">GHO and Ampersand’s deep experience in CDMO investing to support Avid’s next stage of rapid growth including expanded offerings, talent investment and greater geographic reach</li></ul><p class=\"\">London, UK, Boston, MA and Tustin, CA, February 5, 2025 — GHO Capital Partners LLP (\"GHO\"), the European specialist investor in global healthcare, and Ampersand Capital Partners (“Ampersand”), a private equity firm specialising in growth equity investments in the life sciences and healthcare sectors, today announced the successful closing of the previously announced acquisition of Avid Bioservices (“Avid” or the “Company”), a dedicated biologics Contract Development and Manufacturing Organisation (“CDMO”) working to improve patient lives by providing high quality development and manufacturing services to biotechnology and pharmaceutical companies.</p><p class=\"\">Avid has experienced significant growth in recent years, offering its clients full lifecycle capabilities—from concept to commercial supply. With substantial investment already made by the Company in its capacity at its state-of-the art facilities and its expertise in bioprocess optimisation, analytical testing, and regulatory compliance, Avid delivers high-quality, industry leading complex biologics to a roster of international customers.</p><p class=\"\">GHO has considerable expertise in the CDMO sector through investments in its portfolio in companies like Ardena, Sterling Pharma Solutions, RoslinCT, and Alcami Corporation. Its strategy focuses on expanding technological capabilities, driving acquisitions, and supporting transatlantic expansion across the CDMO value chain, from early-stage development to commercial manufacturing. Leveraging its healthcare expertise and network, GHO transforms CDMOs to enhance their services and market reach, ultimately delivering better, faster and more accessible healthcare.</p><p class=\"\">Alan MacKay and Mike Mortimer, Managing Partners of GHO, commented: “We are delighted to start 2025 with the completion of this transaction, our first public to private deal. GHO has a deep understanding of the CDMO sector and Avid perfectly exemplifies a company that is operating in high growth markets supporting the growing biotech sector in research and development and big pharma and large biotech for the commercialisation of cutting-edge biologics. Avid's recent investments, both in capacity and its exemplary team, have created a strong foundation for future growth. We look forward to partnering closely with the Avid team to unlock the business’s full potential.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nick Green, President and CEO of Avid, said: </strong>“Avid has succeeded by evolving and adapting to meet our customers' complex development and manufacturing needs. The completion of this transaction marks an exciting milestone as we move forward with new owners in GHO Capital and Ampersand who will provide us with access to resources that will accelerate our growth. With their support, we are well-positioned to enhance our capabilities, expand our service offerings, and deliver even greater value to our customers in this next phase of our journey.\"</p><p class=\"\">David Anderson, General Partner of Ampersand, added: “Avid has earned its reputation as a leader in biopharmaceutical development and manufacturing through technical excellence, customised solutions, and consistent regulatory compliance. By combining our deep industry expertise with Avid's established capabilities, we are positioned to deliver enhanced value and accelerate innovation for clients globally.”</p><p class=\"\">On 7 November 2024, GHO and Ampersand entered into a definitive merger agreement for Avid to be acquired by funds managed by GHO and Ampersand in an all-cash transaction valued at approximately $1.1 billion. With the completion of the transaction, Avid’s stockholders are entitled to receive $12.50 per share in cash. The Company's common stock has ceased trading and will be delisted from Nasdaq.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Advisors</strong></p><p class=\"\">William Blair served as buyside financial advisers, Ropes &amp; Gray served as legal counsel, ClearView Healthcare Partners served as commercial advisor and Alvarez &amp; Marsal served as financial advisors to GHO and Ampersand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">GHO Capital</strong></p><p class=\"\">Amber Fennell / Kris Lam</p><p class=\"\">ICR Healthcare</p><p class=\"\">+44 7739658783</p><p class=\"\">ghocapital@icrhealthcare.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Avid Bioservices</strong></p><p class=\"\">Stephanie Diaz</p><p class=\"\">Vida Strategic Partners</p><p class=\"\">415-675-7401</p><p class=\"\">sdiaz@vidasp.com</p><p class=\"\">Tim Brons</p><p class=\"\">Vida Strategic Partners</p><p class=\"\">415-675-7402</p><p class=\"\">tbrons@vidasp.com</p><p class=\"\">Aaron Palash / Allison Sobel</p><p class=\"\">Joele Frank, Wilkinson Brimmer Katcher</p><p class=\"\">(212) 355-4449</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GHO Capital</strong></p><p class=\"\">Global Healthcare Opportunities, or GHO Capital Partners LLP, is a leading specialist healthcare investment advisor based in London. GHO Capital applies global capabilities and perspectives to unlock high growth healthcare opportunities, targeting Pan-European and transatlantic internationalisation to build market leading businesses of strategic global value. GHO Capital’s proven investment track record reflects the unrivalled depth of our industry expertise and network. GHO Capital partners with strong management teams to generate long-term sustainable value, improving the efficiency of healthcare delivery to enable better, faster, more accessible healthcare. For further information, please visit www.ghocapital.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Avid Bioservices, Inc. </strong></p><p class=\"\">Avid Bioservices is a dedicated CDMO focused on development and CGMP manufacturing of biologics. The Company provides a comprehensive range of process development, CGMP clinical and commercial manufacturing services for the biotechnology and biopharmaceutical industries. With more than 30 years of experience producing biologics, Avid's services include CGMP clinical and commercial drug substance manufacturing, bulk packaging, release and stability testing and regulatory submissions support. For early-stage programs the Company provides a variety of process development activities, including cell line development, upstream and downstream development and optimization, analytical methods development, testing and characterization. The scope of our services ranges from standalone process development projects to full development and manufacturing programs through commercialization. www.avidbio.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Ampersand Capital Partners</strong></p><p class=\"\">Ampersand Capital Partners, founded in 1988, is a middle-market private equity firm with $3 billion of assets under management, dedicated to growth-oriented investments in the healthcare sector. With offices in Boston, MA, and Amsterdam, Netherlands, Ampersand leverages a unique blend of private equity and operating experience to build value and drive long-term performance alongside its portfolio company management teams. Ampersand has helped build numerous market-leading companies across each of the firm's core healthcare sectors. For additional information, visit www.ampersandcapital.com or follow us on LinkedIn.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX25SpFD:0-avid-bioservices-poised-for-significant-growth-with-new-partners-gho-capital-and-ampersand-capital-partners/",
            "pub_date": "2025-02-05 22:55:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007292:0",
            "title": "Sappi Delivers Results Ahead of Expectations for the Second Financial Quarter",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:47 GMT) </strong>*Sappi 2Q Adj EPS 12c<br/><strong class=\"root-Tkn6WL2y\">(14:47 GMT) </strong>*Sappi 2Q EBITDA Ex-Special Items $183 M<br/><strong class=\"root-Tkn6WL2y\">(14:48 GMT) </strong>Press Release: Sappi Delivers Results Ahead of Expectations for the Second Financial Quarter</p><p class=\"\">Sappi Delivers Results Ahead of Expectations for the Second Financial Quarter</p><p class=\"\">JOHANNESBURG--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Commenting on the group's results, Sappi Chief Executive Officer Steve Binnie said: \"Within the context of subdued underlying market conditions due to the challenging macroeconomic environment I am pleased that the group delivered EBITDA of US$183 million, which was 10% above the prior year.\"</p><p class=\"\">The increase was primarily due to an improvement from the pulp segment and significant costs savings, which included a 9% reduction in cash fixed costs following the closure of the Stockstadt and Lanaken Mills in Europe. Included in EBITDA was a positive plantation fair value price adjustment of US$3 million. A modest recovery in global paper markets was also observed following the extended destocking cycle in 2023.</p><p class=\"\">Looking forward to Sappi's third quarter, Binnie stated: \"While we expect a gradual improvement in paper markets there will be a reduction in output due to a number of planned maintenance shuts in the quarter. We therefore anticipate that EBITDA (excluding a slightly negative fair value price adjustment) for the third quarter of FY2024 will be below that of the second quarter but substantially above last year.\"</p><p class=\"\">Financial summary for the quarter</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">EBITDA excluding special items US$183 million (Q2 FY23 US$167 million)     </li><li class=\"listItem-bmN0_SHH\">EPS excluding special items 12 US cents (Q2 FY23 11 US cents)     </li><li class=\"listItem-bmN0_SHH\">Net debt US$1,366 million (Q2 FY23 US$1,225 million)     </li><li class=\"listItem-bmN0_SHH\">Closure of Stockstadt and Lanaken Mills completed   </li></ul><p class=\"\">Dissolving pulp (DP) demand was strong throughout the quarter boosted by a tight supply landscape, low downstream inventory levels and high viscose staple fibre (VSF) operating rates following the Chinese Lunar New Year celebrations. Sales volumes for the pulp segment increased by 2% year-on-year and hardwood DP spot prices closed the quarter higher at US$940/ton. Profitability for the segment was further supported by significant cost savings, particularly for wood and chemicals.</p><p class=\"\">Packaging and speciality papers demand rebounded during the quarter. Sales volumes improved by 9% compared to the prior year with a mixed performance across the regions. Selling prices came under significant pressure in the second half of FY2023 and were 13% below the prior year. Cost savings were insufficient to offset the negative impact of lower selling prices and profitability for the segment declined compared to last year.</p><p class=\"\">The gradual recovery of graphic papers demand continued throughout the quarter as downstream value chain inventories normalised causing sales volumes to increase by 7% compared to the prior year. However, there has been a structural decline in demand from the highs of 2022. The combination of increased sales volumes and cost savings facilitated a year-on-year improvement in profitability for the segment.</p><p class=\"\">Profitability of the European business continued to recover slowly from the lows of the second half of FY2023. The improvement was driven by increased year-on-year sales volumes and cost savings, offset to some extent by selling price reductions across all product categories. A notable increase in capacity utilisation was achieved due to the successful transfer of Stockstadt and Lanaken sales volumes to our other assets following the termination of production at both mills in the prior quarter. Variable costs were 16% below last year driven by lower purchased pulp and wood costs. However, variable costs increased from the prior quarter on the back of rising pulp prices which were boosted by supply disruptions in Europe due to the Finnish port strikes and mechanical failures at a number of European pulp mills. Fixed costs were 17% below the prior year due to the strategic restructuring of the European business.</p><p class=\"\">The North American business delivered a good performance despite a slower than expected recovery in demand for graphic paper. A strong increase in paperboard sales volumes combined with cost savings offset lower selling prices for packaging. Variable costs were 9% below last year with savings achieved for all major input categories. Fixed costs were 5% above the prior year primarily due to higher personnel costs.</p><p class=\"\">The South African business delivered a solid performance with profitability benefiting from significant cost savings and a ZAR56 million forestry fair value price adjustment. Variable costs were 7% below the prior year due to lower wood, chemical and delivery costs. Fixed costs were well managed with a year-on-year increase of 6%.</p><p class=\"\">Outlook</p><p class=\"\">The third quarter is seasonally the weakest in terms of demand for our products. However, market sentiment is generally improving across all of our product segments and Sappi is well positioned with healthy cash reserves and liquidity to manage current market uncertainties.</p><p class=\"\">Dissolving pulp demand remains healthy, buoyed by low inventory levels across the VSF value chain. VSF pricing has faced downward pressure in recent weeks, which could be a risk for DP pricing in the third quarter. However, the high operating rates through the VSF value chain and relatively constrained DP supply landscape continue to offering some support for DP prices.</p><p class=\"\">Graphic papers demand is expected to continue its slow recovery in the third quarter, but the market fundamentally remains in oversupply and industry operating rates remain below historical levels. Our European restructuring programme has significantly increased our capacity utilisation which, combined with the fixed costs savings, is expected to improve our competitive position. We continue to diligently adapt our product and market mix to match demand in North America ahead of the Somerset PM2 conversion and expansion in 2025. The sale of the Stockstadt Mill site is on track to be concluded in the third quarter.</p><p class=\"\">Packaging and speciality paper markets continue to improve across all regions, and we expect good demand in North America and South Africa. Market conditions in Europe generally remain subdued due to the persistently weak economy and low consumer confidence.</p><p class=\"\">Variable costs have reduced substantially from the peak in 2023 but have plateaued in the second quarter and remain above historical levels for many of our input categories. Globally, pulp market prices have started rising which could negatively impact the profitability of our paper businesses, particularly in Europe where proactive margin management will be required. In the third quarter, the Saiccor and Somerset Mills will take scheduled maintenance shuts, which will have an estimated impact of US$30 million on group profitability.</p><p class=\"\">Capital expenditure for FY2024 is expected to be in the region of US$500 million and as previously communicated includes approximately US$154 million for the Somerset PM2 conversion and expansion project. We remain committed to disciplined capital allocation as we execute our strategy to reduce exposure to graphic paper markets while investing for growth in renewable packaging, dissolving pulp and biomaterials.</p><p class=\"\">The plantation fair value price adjustment for the third quarter is expected to be slightly negative due to higher fuel costs and discount rates.</p><p class=\"\">The full results announcement is available at www.sappi.com.</p><p class=\"\">There will be a conference call to which investors are invited. Full details are available at www.sappi.com using the links Investors; Latest financial results</p><p class=\"\">Forward-looking statements</p><p class=\"\">Certain statements in this release that are neither reported financial results nor other historical information, are forward-looking statements, including but not limited to statements that are predictions of or indicate future earnings, savings, synergies, events, trends, plans or objectives. The words \"believe\", \"anticipate\", \"expect\", \"intend\", \"estimate\", \"plan\", \"assume\", \"positioned\", \"will\", \"may\", \"should\", \"risk\" and other similar expressions, which are predictions of or indicate future events and future trends and which do not relate to historical matters, identify forward-looking statements. In addition, this document includes forward-looking statements relating to our potential exposure to various types of market risks, such as interest rate risk, foreign exchange rate risk and commodity price risk. You should not rely on forward-looking statements because they involve known and unknown risks, uncertainties and other factors which are in some cases beyond our control and may cause our actual results, performance or achievements to differ materially from anticipated future results, performance or achievements expressed or implied by such forward-looking statements (and from past results, performance or achievements). Certain factors that may cause such differences include but are not limited to:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">the highly cyclical nature of the pulp and paper industry (and the   factors that contribute to such cyclicality, such as levels of demand,   production capacity, production, input costs including raw material,   energy and employee costs, and pricing);     </li><li class=\"listItem-bmN0_SHH\">the COVID-19 pandemic;     </li><li class=\"listItem-bmN0_SHH\">the impact on our business of adverse changes in global economic   conditions;     </li><li class=\"listItem-bmN0_SHH\">unanticipated production disruptions (including as a result of planned   or unexpected power outages);     </li><li class=\"listItem-bmN0_SHH\">changes in environmental, tax and other laws and regulations;     </li><li class=\"listItem-bmN0_SHH\">adverse changes in the markets for our products;     </li><li class=\"listItem-bmN0_SHH\">the emergence of new technologies and changes in consumer trends   including increased preferences for digital media;     </li><li class=\"listItem-bmN0_SHH\">consequences of our leverage, including as a result of adverse changes   in credit markets that affect our ability to raise capital when needed;     </li><li class=\"listItem-bmN0_SHH\">adverse changes in the political situation and economy in the countries   in which we operate or the effect of governmental efforts to address   present or future economic or social problems;     </li><li class=\"listItem-bmN0_SHH\">the impact of restructurings, investments, acquisitions, dispositions   and other strategic initiatives (including related financing), any delays,   unexpected costs or other problems experienced in connection with   dispositions or with integrating acquisitions or implementing   restructurings or other strategic initiatives, and achieving expected   savings and synergies;     </li><li class=\"listItem-bmN0_SHH\">currency fluctuations.   </li></ul><p class=\"\">We undertake no obligation to publicly update or revise any of these forward-looking statements, whether to reflect new information or future events or circumstances or otherwise.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205624441/en/</p><p class=\"\">CONTACT:    André F Oberholzer</p><p class=\"\">Group Head Corporate Affairs</p><p class=\"\">Sappi Limited</p><p class=\"\">Tel +27 (0)11 407 8044</p><p class=\"\">Mobile +27 (0)83 235 2973</p><p class=\"\">Andre.Oberholzer@sappi.com</p><p class=\"\">Tracy Wessels</p><p class=\"\">Group Head Investor Relations and Sustainability</p><p class=\"\">Sappi Limited</p><p class=\"\">Tel +27 (0)11 407 8391</p><p class=\"\">Mobile +27 (0)83 666 6589</p><p class=\"\">Tracy.wessels@sappi.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007292:0/",
            "pub_date": "2025-02-05 22:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:8757b8b90094b:0",
            "title": "MORE US S&P PMI SERVICES: SOME RESPONDENTS CITE BAD WINTER WEATHER IN SLOWER GROWTH IN JAN.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/macenews:8757b8b90094b:0-more-us-s-p-pmi-services-some-respondents-cite-bad-winter-weather-in-slower-growth-in-jan/",
            "pub_date": "2025-02-05 22:48:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007306:0",
            "title": "Cohen & Steers Launches Active ETFs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cohen &amp; Steers Launches Active ETFs</p><p class=\"\">PR Newswire</p><p class=\"\">NEW YORK, Feb. 5, 2025</p><p class=\"\">NEW YORK, Feb. 5, 2025 /PRNewswire/ — Cohen &amp; Steers, Inc.  announced today the launch of three fully transparent active ETFs trading on the NYSE Arca. The launch provides advisors and investors with access to the firm's flagship investment strategies through an active ETF vehicle.</p><p class=\"\">The ETFs focus on providing total return, tax-efficient income and portfolio diversification through real estate, preferred securities and natural resource equities strategies. The three active ETFs are:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cohen &amp; Steers Real Estate Active ETF (NYSE Arca: CSRE) is designed to   provide total return and portfolio diversification by accessing a broad   universe of listed real estate securities. It invests in the firm's   highest conviction ideas in US REITs while opportunistically investing in   international and other real estate related securities. CSRE is managed   by Jason Yablon, Head of Listed Real Estate, and Portfolio Managers   Mathew Kirschner and Ji Zhang.   </li><li class=\"listItem-bmN0_SHH\">Cohen &amp; Steers Preferred and Income Opportunities Active ETF (NYSE Arca:   CSPF) is designed to provide high-quality tax efficient income, portfolio   diversification and total return, by investing across the preferred   securities universe with a focus on investment grade, institutional   preferreds. CSPF is managed by Elaine Zaharis-Nikas, Head of Fixed Income   and Preferred Securities, and Portfolio Managers Jerry Dorost and Robert   Kastoff.   </li><li class=\"listItem-bmN0_SHH\">Cohen &amp; Steers Natural Resources Active ETF (NYSE Arca: CSNR) is designed   to provide total return and inflation protection amidst an era of   resource scarcity. It invests in companies involved in the production,   extraction and processing of natural resources including energy,   agriculture and metals. CSNR is managed by Tyler Rosenlicht, Head of   Natural Resource Equities. </li></ul><p class=\"\">As a market leader in actively managed REIT and preferred securities mutual funds and a long-time investor in natural resource equities, Cohen &amp; Steers brings deep expertise in listed real assets and alternative income to the growing active ETF market. The launch of CSRE, CSPF and CSNR underscores the firm's dedication to helping advisors build better portfolios through actively managed allocations to real estate, preferred securities and natural resource equities.</p><p class=\"\">Joseph Harvey, Chief Executive Officer, said:</p><p class=\"\">\"The launch of our active ETFs strategies reinforces our commitment to providing investors with vehicles that help them achieve their objectives and unlock the full potential of their portfolios. We see significant tailwinds for real assets and preferred securities and believe that an allocation to these asset classes can lead to superior investment outcomes compared to traditional 60/40 stock bond portfolios.\"</p><p class=\"\">Daniel Noonan, Head of the Wealth Management Consulting Group, said:</p><p class=\"\">\"Active ETFs have seen tremendous market growth and have become the preferred vehicle for many wealth managers and their clients. Launching active ETFs represents a significant opportunity for Cohen &amp; Steers to expand access to our time-tested strategies in real assets and alternative income. We look forward to educating advisors on how active management in these specialized asset classes can help diversify portfolios and improve client outcomes.\"</p><p class=\"\">To learn more about Cohen &amp; Steers' Active ETFs, please visit the Cohen &amp; Steers Active ETFs Knowledge Center on our website: www.cohenandsteers.com/etfs.</p><p class=\"\">About Cohen &amp; Steers. Cohen &amp; Steers is a leading global investment manager specializing in real assets and alternative income, including listed and private real estate, preferred securities, infrastructure, resource equities, commodities, as well as multi-strategy solutions. Founded in 1986, the firm is headquartered in New York City, with offices in London, Dublin, Hong Kong, Tokyo and Singapore.</p><p class=\"\">Please consider the investment objectives, risks, charges and expenses of any Cohen &amp; Steers fund carefully before investing. A summary prospectus and prospectus containing this and other information may be obtained, free of charge, by visiting cohenandsteers.com or by calling 866.737.6370. Please read the summary prospectus and prospectus carefully before investing.</p><p class=\"\">Investing involves risk, including entire loss of capital invested. There can be no assurance that the investment strategy will meet its investment objectives.</p><p class=\"\">Cohen &amp; Steers Capital Management, Inc. (Cohen &amp; Steers) is a U.S. registered investment advisory firm that provides investment management services to corporate retirement, public and union retirement plans, endowments, foundations and mutual funds. The Cohen &amp; Steers ETFs are distributed by Foreside Fund Services, LLC. Foreside Fund Services, LLC is not affiliated with Cohen &amp; Steers.</p><p class=\"\">View original content:https://www.prnewswire.com/news-releases/cohen--steers-launches-active-etfs-302368963.html</p><p class=\"\">SOURCE Cohen &amp; Steers, Inc.</p><p class=\"\">/CONTACT: Robert Klemens, Vice President, Communications, media@cohenandsteers.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007306:0/",
            "pub_date": "2025-02-05 22:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007301:0",
            "title": "A10 Networks Is Maintained at Buy by BWS Financial",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:48 GMT) </strong>A10 Networks Price Target Maintained With a $24.00/Share by BWS Financial</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007301:0/",
            "pub_date": "2025-02-05 22:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}