{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463584:0",
            "title": "G.R.Cables Changes Company Name to Clenon Enterprises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">G.R.Cables  has changed the company's name to Clenon Enterprises, effective Tuesday, according to a same-day disclosure to the BSE. </p><p class=\"\">The name change took effect after receiving a fresh Certificate of Incorporation from India's Ministry of Corporate Affairs.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463584:0/",
            "pub_date": "2025-02-05 08:32:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW00P:0",
            "title": "Aussie, New Zealand dollars get respite ahead of China's reopen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Australian and New Zealand dollars clung to gains on Wednesday ahead of the resumption of trade in Chinese markets, where eyes are on Beijing's fixing of the yuan midpoint rate following the outbreak of Donald Trump's trade war.</p><p class=\"\">The dollar was on the back foot in the early Asian session, giving some respite to heavily battered currencies like the euro , which bounced back above the $1.02 level and last bought $1.0374.</p><p class=\"\">Volatility in currency markets eased a little on Wednesday after a turbulent start of the week following Trump's imposition of steep tariffs on top U.S. trading partners, with those on Mexico and Canada having since been delayed following negotiations.</p><p class=\"\">But China on Tuesday slapped tariffs on U.S. imports in a swift response to new U.S. duties on Chinese goods, and Trump said the same day he is in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the world's two largest economies.</p><p class=\"\">China returns from the extended Lunar New Year break on Wednesday and traders are closely watching the fixing of the yuan midpoint rate by the People's Bank of China (PBOC) - within which it allows the yuan to trade on any given day, for a sense of whether Chinese authorities will allow for a weaker currency to blunt the impact of tariffs.</p><p class=\"\">The offshore yuan  had tumbled to a record low of 7.3765 per dollar at the start of the week, though it has since recovered some of those losses.</p><p class=\"\">The Australian and New Zealand dollars, often used as liquid proxies for the yuan, were clinging to overnight gains, with the Aussie  last at $0.6251 after rising 0.47% on Tuesday.</p><p class=\"\">The kiwi  last fetched $0.5648, having gained 0.44% overnight.</p><p class=\"\">\"What the PBOC does to the fixing today would tell us a lot about the PBOC's stance on how to deal with the trade war with the U.S.,\" said Carol Kong, a currency strategist at Commonwealth Bank of Australia (CBA).</p><p class=\"\">\"Our base case is that China will increase its tolerance for currency's weakness in response to the U.S. tariffs. Whether or not the PBOC does that as soon as today remains in question.\"</p><p class=\"\">Elsewhere, the Canadian dollar  extended its rebound from Monday's 22-year low and last stood at C$1.4333.</p><p class=\"\">The Mexican peso  was steady at 20.4910 per dollar, away from a trough of 21.2882 hit on Monday, its weakest level in nearly three years.</p><p class=\"\">Sterling  was similarly little changed at $1.2479.</p><p class=\"\">\"I am actually quite surprised at the resilience of markets. Risk sentiment...has been quite positive despite all the tariff headlines and the resumption of the U.S.-China trade war,\" said CBA's Kong.</p><p class=\"\">\"I think part of the optimism stems from the fact that the U.S. was willing to delay tariffs as long as the other countries gave Trump what he wanted.\"</p><p class=\"\">In Japan, the yen  was a touch higher and last stood at 154.30 per dollar. The dollar index  was flat at 108.04.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW00P:0-aussie-new-zealand-dollars-get-respite-ahead-of-china-s-reopen/",
            "pub_date": "2025-02-05 08:33:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463588:0",
            "title": "Tamilnadu Petroproducts Appoints CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tamilnadu Petroproducts  has appointed C. Parthiban as chief financial officer of the company, with effect from Feb. 12, according to a Tuesday filing to the Indian stock exchanges. </p><p class=\"\">Parthiban will take over from K T Vijayagopal, whose tenure as whole-time director (finance) and chief financial officer will expire on Feb. 11.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463588:0/",
            "pub_date": "2025-02-05 08:34:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463590:0",
            "title": "Rio Tinto Faces Fresh Shipping Delays as Cyclones Hit Pilbara Ports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rio Tinto Group  is grappling with further iron ore shipment delays after Cyclones Taliah and Vince caused high seas off its Western Australian ports, according to multiple media reports released Tuesday, citing a company spokesperson. </p><p class=\"\">The company moved iron ore ships from Cape Lambert and Dampier ports to avoid dangerous wave conditions, the reports said. </p><p class=\"\">The disruption follows damage from Tropical Cyclone Sean in January, which flooded rail infrastructure and impacted operations, the reports added. </p><p class=\"\">The ongoing repairs on the East Intercourse Island dumper are further compounding the challenges. </p><p class=\"\">If repairs take longer than three to four weeks, Rio could struggle to make up for the delay in the second half, posing a risk to its production guidance, Reuters quoted Capital Markets analyst Kaan Peker as saying. </p><p class=\"\">Shares of the company rose nearly 2% in recent Wednesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463590:0/",
            "pub_date": "2025-02-05 08:34:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXbKLGJX:0",
            "title": "Callan JMB Announces Pricing of $5.12 Million Initial Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SPRING BRANCH, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — Callan JMB Inc. (NASDAQ: CJMB) (“Callan” or the “Company”), an integrative logistics company empowering the healthcare industry and emergency management agencies through exceptional fulfillment, storage, monitoring, and cold chain logistics services, today announced the pricing of its initial public offering (the “<strong class=\"root-Tkn6WL2y\">Offering</strong>”) of 1,280,000 shares (the “<strong class=\"root-Tkn6WL2y\">Shares</strong>”) of common stock (“<strong class=\"root-Tkn6WL2y\">Common Stock</strong>”) at an initial public offering price of $4.00 per Share for a total of approximately $5,120,000 of gross proceeds to the Company before deducting underwriting discounts and commissions and estimated offering expenses payable by the Company. In addition, Callan has granted the underwriters a 45-day option to purchase, at the public offering price, up to an additional 192,000 shares of Common Stock at the public offering price, less the underwriting discounts and commissions.</p><p class=\"\">The Shares are expected to begin trading on the Nasdaq Capital Market on February 5, 2025, under the ticker symbol “CJMB”. The Offering is expected to close on or about February 6, 2025, subject to the satisfaction of customary closing conditions.</p><p class=\"\">The Company intends to use the net proceeds of the Offering primarily for sales support, marketing, customer expansion and general corporate purposes, including working capital.</p><p class=\"\">Alexander Capital L.P. (“<strong class=\"root-Tkn6WL2y\">Alexander</strong>”) is the managing underwriter for the Offering, and Alexander and Paulson Investment Company, LLC are acting as joint book-runners for the Offering. Sichenzia Ross Ference Carmel LLP is serving as counsel to the Company, and Sullivan &amp; Worcester LLP is serving as counsel to Alexander in connection with the Offering.</p><p class=\"\">A registration statement on Form S-1, as amended (File No. 333-282879), relating to the Shares described above was filed with the U.S. Securities and Exchange Commission (“<strong class=\"root-Tkn6WL2y\">SEC</strong>”) and was declared effective on February 4, 2025. The Offering is being made only by means of a prospectus. A copy of the final prospectus relating to the Offering may be obtained, when available, from Alexander Capital, L.P., via email: <strong class=\"root-Tkn6WL2y\">info@alexandercapitallp.com</strong>, or by calling +1 (212) 687-5650, or by standard mail at Alexander Capital L.P., 10 Drs James Parker Blvd, Suite 202 Red Bank, New Jersey 07701, Attention: Equity Capital Markets. In addition, a copy of the final prospectus, when available, relating to the Offering may be obtained via the SEC’s website at <strong class=\"root-Tkn6WL2y\">www.sec.gov</strong>.</p><p class=\"\">Before you invest, you should read the prospectus and other documents the Company has filed or will file with the SEC for more complete information about the Company and the Offering. This press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. Any offers, solicitations, or offers to buy, or any sales of securities will be made in accordance with the registration requirements of the Securities Act of 1933, as amended.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Callan JMB</strong></p><p class=\"\">Callan JMB is an integrative logistics company empowering the healthcare industry and emergency management agencies through exceptional fulfillment, storage, monitoring, and cold chain logistics services to secure medical materials and protect patients and communities with compliant, safe, and effective medicines. Our combined expertise in supply chain logistics, thermodynamics, biologics, inventory management, regulatory compliance and emergency preparedness is unparalleled in the industry. We offer the Gold Standard in client experience with customizable interfaces, next-level reliability in shipping and environmental sustainability in our specialty packaging.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward Looking Statements:</strong></p><p class=\"\">This press release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the “<strong class=\"root-Tkn6WL2y\">Exchange Act</strong>”) (which Sections were adopted as part of the Private Securities Litigation Reform Act of 1995). Statements preceded by, followed by or that otherwise include the words “believe,” “anticipate,” “estimate,” “expect,” “intend,” “plan,” “project,” “prospects,” “outlook,” and similar words or expressions, or future or conditional verbs, such as “will,” “should,” “would,” “may,” and “could,” are generally forward-looking in nature and not historical facts. These forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the Company's actual results, performance, or achievements to be materially different from any anticipated results, performance, or achievements for many reasons. The Company disclaims any intention to, and undertakes no obligation to, revise any forward-looking statements, whether as a result of new information, a future event, or otherwise. For additional risks and uncertainties that could impact the Company's forward-looking statements, please see the Company's Registration Statement Under the Securities Act of 1933 on Form S-1, including but not limited to the discussion under “Risk Factors” therein, which the Company filed with the SEC and which may be viewed at http://www.sec.gov/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contacts:</strong></p><p class=\"\">Valter Pinto, Managing Director</p><p class=\"\">KCSA Strategic Communications</p><p class=\"\">CallanJMB@kcsa.com</p><p class=\"\">212.896.1254</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXbKLGJX:0-callan-jmb-announces-pricing-of-5-12-million-initial-public-offering/",
            "pub_date": "2025-02-05 08:34:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463592:0",
            "title": "New Zealand's Commodity Price Index Up 1.8% in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The ANZ World Commodity Price Index rose 1.8% month-over-month in January, according to a Wednesday report from ANZ Research. </p><p class=\"\">The New Zealand dollar eased 1.2% in the month, pushing up the NZD Trade Weighted Index by 3.2% month-over-month. </p><p class=\"\">All sectors except forestry reported gains during the period, with meat and wool recording the largest gains, the report said. </p><p class=\"\">Dairy prices inched up 0.6% month-over-month in the period in world price terms. Prices for whole milk powder fell slightly over the month, while prices for skim milk powder fell 3.5% over the period. Butter, cheese, and casein all made gains over the period. </p><p class=\"\">The meat and fiber index increased 3.1% over the period, and returns for the sector soared 27% year-over-year. </p><p class=\"\">The horticulture index rose just 0.9% month-over-month, as the export season finished, with the increase reflecting the last few batches of the green variety trickling through some overseas markets. </p><p class=\"\">The forestry index fell 2.4%, as logs faced reduced demand from China. </p><p class=\"\">Aluminum prices were up 1.2% month-over-month.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463592:0/",
            "pub_date": "2025-02-05 08:35:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463591:0",
            "title": "South Korea's Official Foreign Reserves Decline in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">South Korea's foreign reserves contracted to $411 billion in January from $415.6 billion as of end-December, the Bank of Korea said Wednesday. </p><p class=\"\">The country's official forex reserves consisted of securities amounting to $362 billion, deposits of $25.3 billion, special drawing rights of $14.7 billion, gold worth $4.8 billion, and the country's IMF position at $4.2 billion. </p><p class=\"\">South Korea's forex reserve holdings ranked ninth largest globally as of the end of December, the central bank said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463591:0/",
            "pub_date": "2025-02-05 08:35:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW01G:0",
            "title": "New Zealand's Tower gains on upgraded FY profit forecast",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Tower Ltd  rise 4.2% to NZ$1.355</p><p class=\"\">** Stock set for its best session since mid-April 2024, if current gains hold; among top gainers on the benchmark S&amp;P/NZX 50 index  </p><p class=\"\">** Insurer raises full-year underlying NPAT forecast to a range of NZ$60 mln to NZ$70 mln ($33.90 mln-$39.55 mln), from NZ$50 mln to NZ$60 mln previously expected</p><p class=\"\">** Says upward revision reflects strong business performance in the first quarter of 2025 financial year along with positive early indications from January's performance</p><p class=\"\">** Says forecast for gross written premiums (GWP) is revised to between 7% and 12%, from a range of 10% to 15%</p><p class=\"\">** Nearly 589,800 shares change hands, 1.5 times the 30-day average volume</p><p class=\"\">** Stock down 3.7% this year, as of last close</p><p class=\"\">($1 = 1.7699 New Zealand dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW01G:0-new-zealand-s-tower-gains-on-upgraded-fy-profit-forecast/",
            "pub_date": "2025-02-05 08:29:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW00L:0",
            "title": "Australian shares rise on commodity boost; US-China trade war stays in focus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Australian shares rose on Wednesday, tracking overnight Wall Street gains, led by local commodity stocks after the country's top trading partner China took a measured approach in responding to the new U.S. tariffs.</p><p class=\"\">The S&amp;P/ASX 200 index  rose 0.5% to 8,419.6, as of 0005 GMT. The benchmark ended 0.1% lower on Tuesday.</p><p class=\"\">Overnight, the U.S. Dow Jones Industrial Average  rose 0.30%, the S&amp;P 500  gained 0.72% while Nasdaq  added 1.35%. </p><p class=\"\">China imposed targeted tariffs on U.S. imports and put several companies, including Google, on notice for possible sanctions, in a measured response to U.S. President Donald Trump's levies, which came into effect on Tuesday.</p><p class=\"\">It was unclear when the leaders of the two countries would talk after Trump said he was in no hurry.</p><p class=\"\">A conversation between Chinese President Xi Jinping and Trump is seen as key to a potential easing or delay of tariffs, just like last-minute talks resulted in one-month reprieves on levies against Canada and Mexico.</p><p class=\"\">Prospects of a trade war prompted investors to flock to safe-haven gold, boosting the metal's prices to an all-time high. </p><p class=\"\">The domestic gold sub-index  jumped 1.3% to a more than three-month high.</p><p class=\"\">The heavyweight mining index  added 1.7% to hit a two-week high. BHP Group  and Rio Tinto  gained 1.3% and 1.4%, respectively.</p><p class=\"\">Energy stocks  rose 1.9%, tracking a rebound in oil prices. Sector heavyweights Woodside Energy  and Santos  advanced 1% and 1.7%, respectively.</p><p class=\"\">Technology stocks  rose 0.6% and real-estate stocks (.AXRE) added 0.5%.</p><p class=\"\">Among individual stocks, Insignia Financial  jumped 6.4% and was among the top gainers on the benchmark index. The wealth manager received an A$3.07 billion ($1.92 billion) bid from Canadian firm Brookfield , matching the latest offers from Bain Capital and CC Capital Partners.</p><p class=\"\">In New Zealand, the benchmark S&amp;P/NZX 50 index  fell 0.5% to 12,839.6.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW00L:0-australian-shares-rise-on-commodity-boost-us-china-trade-war-stays-in-focus/",
            "pub_date": "2025-02-05 08:29:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV1EZ:0",
            "title": "Fed's Jefferson: Rates likely to fall over medium term",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Federal Reserve can continue cutting interest rates at least \"over the medium term,\" Fed Vice Chair Philip Jefferson said on Tuesday, reiterating the U.S. central bank's message that policymakers needn't rush their next rate cut.</p><p class=\"\">\"Overall, the U.S. economy is starting the year in a good position. I expect inflation’s slow descent to continue, and I anticipate that economic growth and labor market conditions will remain solid,\" Jefferson said in remarks prepared for delivery at Lafayette College in Easton, Pennsylvania.</p><p class=\"\">   In that situation, \"over the medium term, I continue to see a gradual reduction in the level of monetary policy restraint placed on the economy as we move toward a more neutral stance as the most likely outcome,\" Jefferson said. \"That said, I do not think we need to be in a hurry to change our stance.\"</p><p class=\"\">\"As long as the economy and labor market remain strong, I see it as appropriate...to be cautious in making further adjustments,\" he said.</p><p class=\"\">The outlook for this year is good, he said, but \"we face additional uncertainties about the exact shape of government policies, as well as their economic implications.\"</p><p class=\"\">The Fed at its policy meeting last week held its benchmark interest rate steady in the 4.25% to 4.5% range. Inflation remains more than half a percentage point above the Fed's 2% target and has shown little improvement over the last half year.</p><p class=\"\">While Fed policymakers are confident price pressures continue to ease in the economy, they are also watching closely to understand the net impact of the Trump administration's tariff, immigration, tax and other policies.</p><p class=\"\">Investors currently expect the Fed to cut the policy rate by a quarter of a percentage point in June and again in December.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV1EZ:0-fed-s-jefferson-rates-likely-to-fall-over-medium-term/",
            "pub_date": "2025-02-05 08:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013971_20250204013971:0",
            "title": "Fed's Jefferson: No 'Hurry to Change Our Stance'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013971_20250204013971:0/",
            "pub_date": "2025-02-05 08:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013971_20250204013972:0",
            "title": "Fed's Jefferson: Employment, Inflation Goals ' Roughly in Balance'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013971_20250204013972:0/",
            "pub_date": "2025-02-05 08:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013975:0",
            "title": "Fed's Jefferson Sees Strong But Mixed Economic Backdrop — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The economy remains on solid footing but its health is uneven across sectors, Fed Vice Chair Philip Jefferson said Tuesday. In a lecture at Pennsylvania's Lafayette College, Jefferson notes strength in household spending, retail sales and activity in the services sector. \"The consumer spending data we have received recently have surprised me to the upside,\" Jefferson said, per his published remarks. On the other hand, some sectors have been notably weak. Residential investment has been flattish over the past three quarters, he notes, and production from the domestic manufacturing sector was about flat last year too. \"Much of the equipment investment that did take place came from imports,\" Jefferson says. (matt.grossman@wsj.com; @mattgrossman)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013975:0/",
            "pub_date": "2025-02-05 08:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013974:0",
            "title": "Fed Vice Chair Jefferson Urges Patience on Rate Cuts — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Nicholas Jasinski</p><p class=\"\">A solid economy and still-too-high inflation argue for holding interest rates steady until more progress is made in slowing price growth, Federal Reserve Vice Chair Philip Jefferson said on Tuesday evening, echoing recent remarks from several of his colleagues on the Federal Open Market Committee.</p><p class=\"\">\"As long as the economy and labor market remain strong, I see it as appropriate for the Committee to be cautious in making further adjustments,\" Jefferson said in prepared remarks for an address at Lafayette College in Easton, Pa., on Tuesday evening. \"Over the medium term, I continue to see a gradual reduction in the level of monetary policy restraint placed on the economy as we move toward a more neutral stance as the most likely outcome.\"</p><p class=\"\">Jefferson is a voting member of the Federal Open Market Committee, the Fed's policymaking body. He has served on the Fed's Board of Governors since May 2022.</p><p class=\"\">The FOMC held its target for the federal-funds rate at a range of 4.25% to 4.5% at its January meeting. It cut rates by a total of a percentage point at its final three meetings of 2024.</p><p class=\"\">\"The U.S. economy is starting the year in a good position,\" Jefferson said. \"I expect inflation's slow descent to continue, and I anticipate that economic growth and labor market conditions will remain solid.\"</p><p class=\"\">Jefferson attributed the continuing economic resilience despite widespread forecasts of a downturn over the past few years to the strength of the American consumer, with spending growth supported by a solid labor market and low unemployment.</p><p class=\"\">\"I see a labor market that is in solid condition and not a source of significant inflationary pressure,\" Jefferson said. \"While the downside risks of a rapidly weakening labor market appear to have lessened, I expect some further softening that could cause the unemployment rate to edge just slightly higher this year but stay in a range consistent with recent readings.\"</p><p class=\"\">After real gross domestic product expanded by 2.8% in 2024, Jefferson expects \"slightly lower\" growth this year.</p><p class=\"\">That said, Jefferson cautioned that 2025 is a year to be humble about economic projections, given the usual dose of uncertainty as well as additional questions about the eventually enacted policies of the new administration in Washington and what their overall economic impact will be.</p><p class=\"\">As for inflation, Jefferson expects a \"bumpy\" path toward the Fed's 2% annual target. He noted that goods inflation has returned to prepandemic levels and non-housing services price growth has cooled alongside the labor market, while housing-price growth remains somewhat elevated.</p><p class=\"\">But he expects more progress in that category in 2025, as more tenants renew their leases.</p><p class=\"\">\"With supply and demand conditions having moved into better balance, wage growth slowing to a more sustainable pace, and longer-term inflation expectations remaining well anchored, I see a path for inflation to continue its progress toward our longer-run goal,\" Jefferson said.</p><p class=\"\">The FOMC's next meeting is on March 18-19, when officials will have two more months of inflation and jobs data to consider. Futures are pricing in a roughly 85% chance of a continued pause in interest rates.</p><p class=\"\">Write to Nicholas Jasinski at nicholas.jasinski@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013974:0/",
            "pub_date": "2025-02-05 08:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013971:0",
            "title": "Fed Vice Chair Jefferson Calls for Caution on Further Rate Cuts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(00:30 GMT) </strong>*Fed's Jefferson: No 'Hurry to Change Our Stance'<br/><strong class=\"root-Tkn6WL2y\">(00:30 GMT) </strong>*Fed's Jefferson: Employment, Inflation Goals ' Roughly in Balance'<br/><strong class=\"root-Tkn6WL2y\">(00:30 GMT) </strong>Fed Vice Chair Jefferson Calls for Caution on Further Rate Cuts</p><p class=\"\">By Matt Grossman</p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said the central bank should continue to be cautious about further adjustments to interest rates as long as the economy and labor markets remain strong.</p><p class=\"\">In a lecture at Lafayette College in Easton, Pa., Jefferson said that the economy and the labor market came into 2025 with momentum after a solid 2024, supporting the Fed's move last month to hold rates steady after three straight meetings of cuts.</p><p class=\"\">Jefferson noted that inflation remains above the central bank's target, and that its path down from multi-decade highs in 2022 has been \"bumpy,\" which he said he expects to continue.</p><p class=\"\">\"I do not think we need to be in a hurry to change our stance,\" Jefferson said Tuesday night, according to a published text of his remarks.</p><p class=\"\">Even after the Fed reduced interest rates by a percentage point between September and December, its policy stance still seems to be working to cool off the economy, although not as forcefully as earlier last year, Jefferson said. Echoing remarks by many of his colleagues on the Fed's monetary-policy committee in recent months, Jefferson said he thinks that risks to the Fed's two goals--controlling inflation, and maintaining a thriving labor market--are now roughly balanced.</p><p class=\"\">That has set the stage for what many on Wall Street think will be a pause in further rate cuts perhaps until May or June at the soonest, as reflected in traders' bets in interest-rate futures markets.</p><p class=\"\">Questions about Trump administration economic policy, including on immigration and trade, have clouded the picture of how inflation and the labor market will evolve in the next few months.</p><p class=\"\">Jefferson said that \"currently we face additional uncertainties about the exact shape of government policies, as well as their economic implications.\"</p><p class=\"\">Separately, Jefferson said he expects slower economic growth this year than in 2024, in part because households and businesses \"face an uncertain environment.\" Jefferson said growth could surpass his expectations if consumer spending proves more resilient than he has forecast.</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013971:0/",
            "pub_date": "2025-02-05 08:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:d6622a3a8098b:0",
            "title": "Vaxcyte COO Jim Wassil Sells 8,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Wassil Jim</td></tr><tr><td>Relationship</td><td>CHIEF OPERATING OFFICER</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$689,790</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1813798/000164909425000010/xslF345X05/wk-form4_1738714793.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Vaxcyte's Chief Operating Officer, Jim Wassil, sold 8,000 shares of common stock on February 3, 2025, under a Rule 10b5-1 trading plan. The sales were executed at weighted-average prices of $85.996, $86.665, and $87.94, totaling $689,790. Following these transactions, Wassil directly owns 205,695 shares of Vaxcyte.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1813798/000164909425000010/xslF345X05/wk-form4_1738714793.xml\" rel=\"nofollow\" target=\"_blank\">Vaxcyte, Inc. [ PCVX ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:d6622a3a8098b:0-vaxcyte-coo-jim-wassil-sells-8-000-shares/",
            "pub_date": "2025-02-05 08:30:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:7e726a03300f3:0",
            "title": "Summit Midstream Corp's CEO Sells 3,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Deneke J Heath</td></tr><tr><td>Relationship</td><td>Chairman, President and CEO</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$124,860</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2024218/000202421825000011/xslF345X05/wk-form4_1738715125.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Summit Midstream Corp's Chairman, President, and CEO, Deneke J Heath, sold a total of 3,000 shares of Common Stock on dates ranging from January 31 to February 4, 2025. The sales were conducted at weighted average prices ranging from $41.04 to $42.33 per share, resulting in a total sale amount of $124,860. Following these transactions, Heath directly owns 258,326 shares of Summit Midstream Corp. The sales were executed in compliance with a Rule 10b5-1 trading plan.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2024218/000202421825000011/xslF345X05/wk-form4_1738715125.xml\" rel=\"nofollow\" target=\"_blank\">Summit Midstream Corp [ SMC ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:7e726a03300f3:0-summit-midstream-corp-s-ceo-sells-3-000-shares/",
            "pub_date": "2025-02-05 08:30:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_TnwbBVVRS:0",
            "title": "Onco-Innovations Applauds Lundin Cancer Fund for $4 Million Contribution to the Canadian Cancer Society",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><p class=\"\">Vancouver, Canada – February 4,2025 – TheNewswire – Onco-Innovations Limited (CSE: ONCO) (Frankfurt:W1H, WKN: A3EKSZ)(\"Onco\" or the \"Company\") applauds the Lundin Cancer Fundfor its generous $4 million donation to the Canadian Cancer Society toestablish a pan-Canadian glioblastoma research program. Thiscontribution marks the largest philanthropic gift ever received by theCanadian Cancer Society for glioblastoma research. 1</p><p class=\"\">The $4 million donation from the Lundin Cancer Fundwill enable the Canadian Cancer Society to establish a pan-Canadianglioblastoma research program, focusing on accelerating researchefforts to develop new treatment options for one of the mostaggressive and difficult-to-treat forms of brain cancer. Thisinitiative aims to bring together top researchers across the country,fostering collaboration and driving innovation in glioblastomatreatment. Together, the organizations also intend to raise anadditional $4 million, for a total of $8 million, to transform braincancer outcomes. In honour of Mr. Lukas Lundin, and to further supportthis initiative, two of Vancouver’s fundraising events—theCanadian Cancer Society Daffodil Ball and the Lundin Cancer FundGala—will come together in 2025 for a united effort to advance braincancer research.2 </p><p class=\"\">Onco-Innovations applauds this significantcontribution, recognizing its potential to make a meaningful impact inthe fight against cancer. Investments like this not only advancescientific research but also provide hope for patients and familiesaffected by glioblastoma.</p><p class=\"\">Additionally, the Company announces that it hasextended the term of its engagement with MCS Market CommunicationService GmbH (business address: Rheinpromenade 13, 40789 Monheim amRhein, Nordrhein-Westfalen, Deutschland, email: info@mcsmarket.de;telephone: +491772481220; and website: www.mcsmarket.de)(\"MCS\") for the continued provision of a range of onlinemarketing services, including campaign creation, production ofmarketing materials, as well as research and analytics (the\"Services\").  The Services will continue and are expectedto run until June 2025, or until budget exhaustion.  The Company haspaid MCS EUR 500,000 for the extended term of Services, and nosecurities have been provided to MCS or its principals ascompensation. The Services will be executed via digital channels,including Google Ads and native advertising.</p><p class=\"\">About Onco-Innovations Limited</p><p class=\"\">Onco-Innovations is a Canadian-based company dedicatedto cancer research and treatment, specializing in oncology. Onco’smission is to prevent and cure cancer through pioneering research andinnovative solutions. The Company has secured an exclusive worldwidelicense to patented technology that targets solid tumours, setting newstandards in cancer treatment. Onco’s commitment to excellence andinnovation drives it to develop advanced therapies that improvepatient outcomes and offer hope in the fight against cancer.</p><p class=\"\">ON BEHALF OF ONCO-INNOVATIONSLIMITED,</p><p class=\"\">“ThomasO’Shaughnessy”</p><p class=\"\">Chief Executive Officer</p><p class=\"\">For more information, please contact:</p><p class=\"\">Thomas O’Shaughnessy</p><p class=\"\">Chief Executive Officer</p><p class=\"\">Tel: + 1 888 261 8055</p><p class=\"\">investors@oncoinnovations.com</p><p class=\"\">oncoinnovations.com</p><p class=\"\">The CSE and Information Service Provider have notreviewed and do not accept responsibility for the accuracy or adequacyof this release.</p><p class=\"\">Forward-Looking StatementsCaution. This news release may containforward-looking statements, including in relation to the prospects ofthe Company, and the Company’s business and plans generally, andother statements that are not historical facts. Forward-lookingstatements are often identified by terms such as “will”,“may”, “potential”, “should”, “anticipate”,“expects” and similar expressions. All statements other thanstatements of historical fact, included in this release areforward-looking statements that involve risks and uncertainties. Therecan be no assurance that such statements will prove to be accurate andactual results and future events could differ materially from thoseanticipated in such statements. The reader is cautioned thatassumptions used in the preparation of any forward-looking informationmay prove to be incorrect. Events or circumstances may cause actualresults to differ materially from those predicted, as a result ofnumerous known and unknown risks, uncertainties, and other factors,many of which are beyond the control of the Company. The reader iscautioned not to place undue reliance on any forward-lookinginformation. Such information, although considered reasonable bymanagement at the time of preparation, may prove to be incorrect andactual results may differ materially from those anticipated.Forward-looking statements contained in this news release areexpressly qualified by this cautionary statement. The forward-lookingstatements contained in this news release are made as of the date ofthis news release and the Company will update or revise publicly anyof the included forward-looking statements as expressly required byapplicable law.</p><p class=\"\">1 https://www.bnnbloomberg.ca/investment-trends/2025/02/03/lundin-cancer-fund-contributes-4-million-to-the-canadian-cancer-society-to-establish-pan-canadian-glioblastoma-research-program/</p><p class=\"\">2 https://www.bnnbloomberg.ca/investment-trends/2025/02/03/lundin-cancer-fund-contributes-4-million-to-the-canadian-cancer-society-to-establish-pan-canadian-glioblastoma-research-program/</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_TnwbBVVRS:0-onco-innovations-applauds-lundin-cancer-fund-for-4-million-contribution-to-the-canadian-cancer-society/",
            "pub_date": "2025-02-05 08:30:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSI:0",
            "title": "Japan's service activity grows thanks to Asian demand, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Japan's service activity expanded for a third straight month in January, helped by a rebound in new export business on Asian demand, a private-sector survey showed on Wednesday.</p><p class=\"\">The final au Jibun Bank Service purchasing managers' index (PMI) rose to 53.0 in January from 50.9 in December, the highest level since September last year, the survey compiled by S&amp;P Global Market Intelligence showed.</p><p class=\"\">It was higher than a flash reading of 52.7 and stayed above the 50.0 threshold separating expansion from contraction for a third straight month. </p><p class=\"\">\"The strength of the service sector continued to underpin growth of the overall private sector,\" said Usamah Bhatti, economist at S&amp;P Global Market Intelligence.</p><p class=\"\">Firms were confident about their business outlook, \"with hopes underpinned by an expected recovery in manufacturing output and a broad-based economic recovery,\" he said.</p><p class=\"\">The services industry has been a bright spot for Japan's economy, offsetting some of the weakness in the manufacturing sector.</p><p class=\"\">The subindex of new business expanded for a seventh consecutive month in January and grew to the same level seen in July last year, the survey showed. Firms said that new client wins and store openings contributed to the rise in the new business.</p><p class=\"\">Export growth supported overall demand in January with new export business expanding for the first time in four months to its strongest level since last August, thanks to demand across Asia.</p><p class=\"\">Firms' business expectations stayed upbeat in January supported by new contract and business expansion plans as well as more hiring, the survey found. Employment expanded for a 16th straight month to meet business requirements. </p><p class=\"\">Rising wages, increasing fuel and raw material costs boosted input prices in January. As a result, prices charged grew to the highest since last May as firms passed on rising costs.</p><p class=\"\">The composite PMI, which combines manufacturing and service activity, grew to 51.1 in January, the strongest expansion since September last year.</p><p class=\"\">The Bank of Japan raised interest rates to their highest for Japan in 17 years at last month's meeting when policymakers discussed the likelihood of further rate hikes with some warning of upside inflation risks.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSI:0-japan-s-service-activity-grows-thanks-to-asian-demand-pmi-shows/",
            "pub_date": "2025-02-05 08:30:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463583:0",
            "title": "Sharda Motor Industries Names CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Auto-ancillary company Sharda Motor Industries  has appointed Ghan Shyam Dass, the existing chief commercial officer of the company, as the new chief financial officer and key managerial personnel, effective April 1, according to a Tuesday filing to the Indian bourses. </p><p class=\"\">Dass will take over from incumbent CFO Puru Aggarwal, who will retire from the company on March 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463583:0/",
            "pub_date": "2025-02-05 08:30:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW01U:0",
            "title": "Voya Financial Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Voya Financial Inc  reported quarterly adjusted earnings of $1.40​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $1.63.  The mean expectation of fourteen analysts for the quarter was for earnings of 83 cents per share. Wall Street expected results to range from 35 cents to $2.08 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 10.5% to $2.01 billion from a year ago; analysts expected $1.89 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Voya Financial Inc's reported EPS for the quarter was 94 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $93 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Voya Financial Inc shares had risen by 0.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 61.4% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, nine analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 6 \"strong buy\" or \"buy,\" 8 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the diversified investment services peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Voya Financial Inc is $83.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 12:20 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.83</p></td><td><p class=\"\">1.40</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.04</p></td><td><p class=\"\">2.12</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.14</p></td><td><p class=\"\">2.27</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.61</p></td><td><p class=\"\">1.77</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW01U:0-voya-financial-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 08:21:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW01Y:0",
            "title": "O-I Glass Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">O-I Glass Inc  reported a quarterly adjusted loss of 5 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 12 cents.  The mean expectation of ten analysts for the quarter was for a loss of 7 cents per share. Wall Street expected results to range from -12 cents to -2 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 6.8% to $1.53 billion from a year ago; analysts expected $1.60 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">O-I Glass Inc's reported EPS for the quarter was a loss of $1.00​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported a quarterly loss of $155 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">O-I Glass Inc shares had risen by 7.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 3.6% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 6 \"strong buy\" or \"buy,\" 3 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the non-paper containers &amp; packaging peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for O-I Glass Inc is $15.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 12:20 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">-0.07</p></td><td><p class=\"\">-0.05</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.04</p></td><td><p class=\"\">-0.04</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.43</p></td><td><p class=\"\">0.44</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.39</p></td><td><p class=\"\">0.45</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW01Y:0-o-i-glass-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 08:21:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW02K:0",
            "title": "Nov Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Nov Inc  reported quarterly adjusted earnings of 41 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 28 cents.  The mean expectation of twenty two analysts for the quarter was for earnings of 37 cents per share. Wall Street expected results to range from 32 cents to 59 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 1.5% to $2.31 billion from a year ago; analysts expected $2.24 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Nov Inc's reported EPS for the quarter was 41 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $160 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Nov Inc shares had fallen by 2.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 2.9% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 10 \"strong buy\" or \"buy,\" 11 \"hold\" and 3 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the oil related services and equipment peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Nov Inc is $19.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 12:22 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.37</p></td><td><p class=\"\">0.41</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.36</p></td><td><p class=\"\">0.33</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.35</p></td><td><p class=\"\">0.57</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.27</p></td><td><p class=\"\">0.30</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW02K:0-nov-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 08:22:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463587:0",
            "title": "Lunnon Metals Starts Drilling at Western Australia Gold, Nickel Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lunnon Metals  started a diamond drilling program at its Defiance West prospect at its Kambalda gold and nickel project in Western Australia, according to a Wednesday Australian bourse filing. </p><p class=\"\">The program is co-funded by the exploration incentive scheme of the Department of Energy, Mines, Industry Regulation and Safety in the government of the state of Western Australia, the filing said. </p><p class=\"\">It will drill two holes for an estimated total depth of 1,800 meters.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463587:0/",
            "pub_date": "2025-02-05 08:24:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013935_20250204013938:0",
            "title": "LG CNS Is an IT Service Affiliate of Conglomerate LG Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013935_20250204013938:0/",
            "pub_date": "2025-02-05 08:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013916_20250204013940:0",
            "title": "Keppel: Integrated Power Business Recorded Lower Rev Due to Lower Wholesale Prices >BN4.SG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013916_20250204013940:0/",
            "pub_date": "2025-02-05 08:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013916_20250204013942:0",
            "title": "Keppel Ltd. Will Continue to Drive Asset Monetization Program Towards S$10-S$12B by End-2026 >BN4.SG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013916_20250204013942:0/",
            "pub_date": "2025-02-05 08:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:7b27e0b27094b:0",
            "title": "Trump says tomorrow more hostages will be released",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Trump continuing</p><p class=\"\">Earlier:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Trump says US 'will take over the Gaza Strip'</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:7b27e0b27094b:0-trump-says-tomorrow-more-hostages-will-be-released/",
            "pub_date": "2025-02-05 08:17:23",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013943:0",
            "title": "Honda Motor, Nissan Motor May End Merger Talks, Asahi Reports, Citing Sources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Honda Motor and Nissan Motor may discontinue merger talks, Japanese daily Asahi reported Wednesday, citing sources it didn't name.</li><li class=\"listItem-bmN0_SHH\">Both companies will soon hold board meetings to discuss possibly ending the merger talks, Asahi reported.</li><li class=\"listItem-bmN0_SHH\">Nissan is opposed to an idea of the company becoming Honda's subsidiary, the Asahi report said.</li></ul><p class=\"\">Full story (in Japanese): https://www.asahi.com/articles/AST244RNXT24ULFA01XM.html</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013943:0-honda-motor-nissan-motor-may-end-merger-talks-asahi-reports-citing-sources/",
            "pub_date": "2025-02-05 08:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013916_20250204013951:0",
            "title": "Keppel Ltd. Declares Total Dividend of S$0.34 for 2024 >BN4.SG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013916_20250204013951:0/",
            "pub_date": "2025-02-05 08:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}