{
    "data": [
        {
            "id": "DJN_DN20250204014196_20250204014211:0",
            "title": "GH Research Granted Underwriters Option for Additional 1,500,000 Shares >GHRS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014196_20250204014211:0/",
            "pub_date": "2025-02-05 09:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446649:0",
            "title": "Oil Holds Decline",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WTI crude oil futures held its recent decline to around $73 per barrel on Wednesday as traders weighed concerns over a US-China trade war against President Trump's intensified economic pressure on Iran.</p><p class=\"\">On Tuesday, Trump reinstated his \"maximum pressure\" campaign, aiming to reduce Iran's oil exports to zero and counter its regional influence.</p><p class=\"\">This followed China's retaliation against US tariffs with levies on American coal, LNG, and crude oil, raising fears of weaker global demand.</p><p class=\"\">Meanwhile, OPEC+ confirmed plans to gradually increase oil output from April.</p><p class=\"\">On the supply side, API data showed US crude inventories surged by 5.025 million barrels last week, exceeding expectations of a 3.17 million barrel build.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446649:0-oil-holds-decline/",
            "pub_date": "2025-02-05 09:58:18",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446650:0",
            "title": "Brent Holds Decline",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brent crude oil futures held its recent decline to around $76 per barrel on Wednesday as traders weighed concerns over a US-China trade war against President Trump's intensified economic pressure on Iran.</p><p class=\"\">On Tuesday, Trump reinstated his \"maximum pressure\" campaign, aiming to reduce Iran's oil exports to zero and counter its regional influence.</p><p class=\"\">This followed China's retaliation against US tariffs with levies on American coal, LNG, and crude oil, raising fears of weaker global demand.</p><p class=\"\">Meanwhile, OPEC+ confirmed plans to gradually increase oil output from April.</p><p class=\"\">On the supply side, API data showed US crude inventories surged by 5.025 million barrels last week, exceeding expectations of a 3.17 million barrel build.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446650:0-brent-holds-decline/",
            "pub_date": "2025-02-05 09:58:39",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_JCN95781a:0",
            "title": "Fujitsu to highlight AI-powered network technologies at MWC Barcelona 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KAWASAKI, Japan, Feb 5, 2025 - (JCN Newswire) - Fujitsu Limited today announces its participation in Mobile World Congress Barcelona 2025 (MWC25). Under the theme \"Boundless Potential,\" Fujitsu will unveil its latest advancements in network technologies and enterprise solutions, and highlight how AI is revolutionizing networks and driving business transformation.</p><p class=\"\">At booth 2G60 (Hall 2), Fujitsu will offer visitors interactive demonstrations of AI-enhanced network infrastructure, including solutions for optimizing 5G and optical networks, showcasing improved resource allocation and reduced latency. Attendees will see innovative AI applications in action, such as AI agents improving efficiency in manufacturing and IT operations and an ocean digital twin utilizing AI and autonomous underwater vehicles (AUVs) for environmental monitoring and predictive maintenance of marine infrastructure. Fujitsu will also highlight the high-performance, energy-efficient processor FUJITSU-MONAKA (1), showcasing its capabilities in accelerating AI workloads and reducing power consumption.</p><p class=\"\">Customer use cases and demonstrations will illustrate how Fujitsu's solutions are already contributing to sustainability transformation (SX) by optimizing supply chains, enhancing resilience, and driving operational efficiency across various sectors.</p><p class=\"\">For more information, or to arrange an interview or tour of the Fujitsu booth, please contact us below or visit MWC Barcelona 2025 Fujitsu Website.</p><p class=\"\">Exhibition highlights</p><p class=\"\">1. Connectivity zone - solutions to enhance networks and AI</p><p class=\"\">Network for AI: Network infrastructure solutions that ensure high reliability, security, and reduced power consumption for stable operation of sophisticated AI services, including:</p><p class=\"\">- The AI-RAN solution which optimizes resource allocation on GPU servers, integrating RAN functions and AI applications for efficient resource management.</p><p class=\"\">- Demonstration of the O-RAN compliant 5G Radio Unit (RU) solution.</p><p class=\"\">- Live demo of the 1FINITY series optical transmission solution showcasing zero-latency switching.</p><p class=\"\">AI for Network: Interactive demonstrations showcasing how AI enhances network design, operation and maintenance, improving efficiency, reducing costs, and boosting performance.</p><p class=\"\">- The smart fault recovery solution which rapidly identifies the root cause of network failures, minimizing downtime and improving business continuity.</p><p class=\"\">- Network operation and maintenance enhancement solutions using Fujitsu's AI, trained with the knowledge of skilled operators.</p><p class=\"\">- The network resource optimization solution which optimizes resource management in complex Beyond 5G networks, dynamically allocating resources to meet fluctuating demands, ensuring stable network low power consumption/cost.</p><p class=\"\">2. AI zone - solving societal issues and transforming customer operations</p><p class=\"\">- Ocean digital twin technology to accurately replicate ocean conditions and support ecosystem conservation, carbon neutrality, and the inspection and maintenance of marine structures.</p><p class=\"\">- Fujitsu's AI agents developed as core technology for the Fujitsu Kozuchi AI service.</p><p class=\"\">- Fujitsu's next-generation Arm-based processor FUJITSU-MONAKA (currently under development, targeted for release in 2027).</p><p class=\"\">- Demonstration of Fujitsu Data Intelligence PaaS case studies showing this platform uses data and AI to optimize supply chains, enhance resilience, and transform on-site operations, including system development and maintenance.</p><p class=\"\">Overview of MWC Barcelona 2025 and Fujitsu booth</p><p class=\"\">Date: Monday, March 3, 2025 to Thursday, March 6, 2025</p><p class=\"\">Venue: Fira Gran Via, Barcelona, Spain</p><p class=\"\">Fujitsu booth: 2G60 (Hall 2)</p><p class=\"\">(1) FUJITSU-MONAKA :This is based on results obtained from a project subsidized by the New Energy and Industrial Technology Development Organization (NEDO).</p><p class=\"\">About Fujitsu</p><p class=\"\">Fujitsu's purpose is to make the world more sustainable by building trust in society through innovation. As the digital transformation partner of choice for customers in over 100 countries, our 124,000 employees work to resolve some of the greatest challenges facing humanity. Our range of services and solutions draw on five key technologies: Computing, Networks, AI, Data &amp; Security, and Converging Technologies, which we bring together to deliver sustainability transformation. Fujitsu Limited  reported consolidated revenues of 3.7 trillion yen (US$26 billion) for the fiscal year ended March 31, 2024 and remains the top digital services company in Japan by market share. Find out more: www.fujitsu.com.</p><p class=\"\">Press Contacts</p><p class=\"\">Fujitsu Limited</p><p class=\"\">Public and Investor Relations Division</p><p class=\"\">Inquiries</p><p class=\"\">Source: Fujitsu Ltd</p><p class=\"\">Copyright 2025 JCN Newswire . All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_JCN95781a:0-fujitsu-to-highlight-ai-powered-network-technologies-at-mwc-barcelona-2025/",
            "pub_date": "2025-02-05 09:58:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014224:0",
            "title": "Ways to Cope if You're a Newly Fearful Flier — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dawn Gilbertson</p><p class=\"\">PHOENIX — Kimberly Mack took a free fear-of-flying class at Sky Harbor International Airport more than a decade ago and has relied on the tools she learned on every flight since.</p><p class=\"\">On Monday, the 54-year-old Arizona small-business owner called Ron Nielsen, the retired airline captain who runs the classes, for a one-on-one refresher. Mack has a flight to Napa, Calif., later this month and considered canceling after last week's devastating midair collision in Washington, D.C., and medical-jet crash in Philadelphia.</p><p class=\"\">The guy she calls \"Captain Ron\" reassured her in a call that stretched over an hour. \"He's not like: Your fears aren't valid. You have to remember things happen. It reiterated everything.\"</p><p class=\"\">You don't have to be a nervous flier to be suddenly anxious about airline safety. The American Airlines-Black Hawk helicopter crash, which killed 67 people, was the worst aviation incident on U.S. soil in a generation. Frequent fliers as well as casual travelers are talking about it with their families and co-workers and airline crews are stunned.</p><p class=\"\">Nielsen, who runs a Phoenix-based business called Fearless Flight and has a master's degree in professional counseling, saw it at his latest free airport class on Saturday night. He says a third of the attendees signed up because of the accident.</p><p class=\"\">\"It doesn't make people afraid but it elevates the fears that they've been repressing,\" he says. \"It activates their fear-of-flying gene.\"</p><p class=\"\">Dial a Pilot, an 18-month-old business run by a major airline pilot, has seen a \"massive surge\" in bookings for its $65, 30-minute sessions. \"The calls were not necessarily centered on the accident, they were more centered on: I have this one fear. Is it valid?\" says founder Kyle Koukol.</p><p class=\"\">It is. But while I can help you navigate annoying airline seat fees, airport lounge restrictions and pesky carry-on bag rules, I'm not the right person to soothe your frayed flying nerves. That's for the professionals.</p><p class=\"\">So I turned to Nielsen, Koukol and licensed therapists for their coping strategies, though each said they don't love dashing off tips because there is no one-size-fits-all strategy.</p><p class=\"\">\"It's such a complex problem,\" Nielsen says, but there are ways to manage your anxiety.</p><p class=\"\">Stop doom scrolling and do a reality check</p><p class=\"\">Nathan Feiles, a licensed therapist and fear-of-flying specialist in New York City, says major airline accidents tend to put a spotlight on all types of airline incidents that follow — no matter how routine, like a flight returning to an airport.</p><p class=\"\">\"It creates a sense of reverse normalization,\" he says. \"It starts to make people think that there's a lot more danger happening.\"</p><p class=\"\">Yes, this crash was awful. But flying is still the safest form of transportation.</p><p class=\"\">To help put things in perspective, Brenda Wiederhold, a licensed clinical psychologist in San Diego, recommends patients scroll the departure boards for an airport (online is fine) to see the flurry of flights that take off and land day in, day out.</p><p class=\"\">She asks frequent fliers, \"Have you ever not landed safely?\"</p><p class=\"\">Then she asks them how many times they've had a fender bender. If they say two or three she responds, \"You still get in your car and drive.\"</p><p class=\"\">Don't self-medicate just to board a plane</p><p class=\"\">Downing several drinks or popping a few pills before boarding a flight might help temporarily but it can become a crutch.</p><p class=\"\">Travelers need to address the underlying fear rather than put it off, Wiederhold says.</p><p class=\"\">\"You're telling yourself, 'I can't do this,'\" she says. \"I'm saying you will make it worse by avoiding it. The monster gets bigger, the fear gets bigger.\"</p><p class=\"\">Use anxiety-management tools</p><p class=\"\">Deep breathing is a big one, of course.</p><p class=\"\">Nielsen is a big fan of distanced self-talk, a technique promoted by Ethan Kross, an experimental psychologist and neuroscientist and director of the Emotional and Self Control Lab at the University of Michigan. He wrote the book \"Chatter: The Voice in Our Head, Why It Matters, and How to Harness It.\"</p><p class=\"\">The bottom line: You distance yourself emotionally from a situation. Nielsen says travelers can reframe a flight situation that scares them, like turbulence, by writing, \"I hate this but I've been here before and I lived\" over and over.</p><p class=\"\">\"You're changing from negative cognitions to positive cognitions,\" he says.</p><p class=\"\">Find your community and feed off each other</p><p class=\"\">I found this to be the most practical and widely applicable advice for those without severe phobias.</p><p class=\"\">You'll get no shortage of online recommendations, but the key is to find the right fit. Scrolling through Reddit travel threads, including its Fear of Flying subreddit, I found recommendations as basic as watching videos on airplanes or perversely bingeing episodes of National Geographic's \"Air Crash Investigation.'</p><p class=\"\">Dial a Pilot clients who join its No Fear Flight Club get access to an online forum where members share coping mechanisms. Koukol finds it fascinating that a lot of the tips revolved around time. One client counts to 30 over and over again until the turbulence stops.</p><p class=\"\">\"That's kind of her way of just taking the power away from the turbulence,\" he says.</p><p class=\"\">A couple of months ago, Taylor Swift entered the fearful flying lexicon when a client who overcame her fear of flying and is now training to be a pilot mentioned she listens to the 10-minute version of \" All Too Well\" on repeat.</p><p class=\"\">Katherine Morgan, a 31-year-old bookstore owner in Portland, Ore., has her own routine to fight off flight jitters and paid extra attention to it on a Saturday flight to San Diego. She kisses the plane when boarding, reads a romance novel because she knows the ending will be happy and orders a ginger ale.</p><p class=\"\">\"It gives me some kind of feeling of control.\"</p><p class=\"\">Write to Dawn Gilbertson at dawn.gilbertson@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014224:0/",
            "pub_date": "2025-02-05 10:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014231:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 9 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Recover Despite China Tariff Fears</strong></p><p class=\"\">A call between Trump and Xi Jinping hasn't happened Tuesday, but might come Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How U.S. Agriculture Market Is Approaching Tariffs and a Potential Trade War</strong></p><p class=\"\">Traders and farmers hope that the Trump administration is using tariff threats as leverage in trade negotiations, as opposed to following through with a major disruption to agricultural trade.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The U.K. Has Dodged Trump's Tariffs So Far. Here Are Some (Very British) Reasons Why.</strong></p><p class=\"\">In his global tariff offensive, President Trump has said trade with the U.K., while out of line, can be worked out.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Keeps Hitting Record Highs. Here's Why-and Which Stocks Could Benefit.</strong></p><p class=\"\">The yellow metal is trading just below $2,900 an ounce. Miner stocks are rallying too. Geopolitical turmoil is boosting gold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RFK Jr. Clears Committee Vote, Is On Track to Become Health Secretary</strong></p><p class=\"\">Next, the full Senate will vote whether to confirm Robert F. Kennedy Jr.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Antitrust Shouldn't Become Trade War Weapon, EU Says</strong></p><p class=\"\">Competition enforcement is not a tool to be used in trade disputes, the European Commission said after U.S. tariffs triggered a tit-for-tat reaction from China.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014231:0/",
            "pub_date": "2025-02-05 10:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014230:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 9 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chipotle Shares Fall as Chain Tempers Sales Growth Hopes</strong></p><p class=\"\">Chipotle reduced its financial outlook for same-store sales this year to an increase in the low to mid-single digits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Match Group Replaces CEO as Growth Eludes Dating Apps</strong></p><p class=\"\">The owner of Tinder, Hinge and OkCupid apps said CEO Bernard Kim would step down and be succeeded by board member Spencer Rascoff, a co-founder and former CEO of home-listings portal Zillow Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mattel Relying on Supply Chain, Potential Price Increases to Offset Tariff Impacts</strong></p><p class=\"\">Chief Executive Ynon Kreiz said the company has spent years building out a supply chain that isn't overly reliant upon any one country. It will also consider increasing its prices, he said.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Its Direct Stakes in Three Companies</strong></p><p class=\"\">The firm said it would increase its investment in the companies by $1.1 billion in total as part of its unusual strategy of taking long-term stakes in businesses it likes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Brookfield Enters Race for Australia's $1.9 Billion Insignia Financial</strong></p><p class=\"\">Brookfield made a non-binding proposal of $2.88 a share, the same value as the proposal made last month by CC Capital Partners, and later matched by Bain Capital.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apollo Eyes 'Industrial Renaissance' After Investing Record $222 Billion Last Year</strong></p><p class=\"\">Apollo Global Management invested a firm record of $222 billion last year as the credit specialist sees increased opportunities to finance infrastructure developers in what it calls a \"global industrial renaissance.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014230:0/",
            "pub_date": "2025-02-05 10:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014228_20250204014228:0",
            "title": "Marubeni Corp Sees FY Net Y500.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014228_20250204014228:0/",
            "pub_date": "2025-02-05 10:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014227_20250204014227:0",
            "title": "Marubeni Corp 9-Mos Oper Pft Y222.31B Vs Pft Y211.59B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014227_20250204014227:0/",
            "pub_date": "2025-02-05 10:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014226_20250204014226:0",
            "title": "Marubeni Corp 9-Mos Net Y425.18B Vs Net Y371.47B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014226_20250204014226:0/",
            "pub_date": "2025-02-05 10:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW05W:0",
            "title": "Unum Group reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Unum Group  reported quarterly adjusted earnings of $2.03​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.79.  The mean expectation of fourteen analysts for the quarter was for earnings of $2.14 per share. Wall Street expected results to range from $2.07  to $2.22 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 2.9% to $3.24 billion from a year ago; analysts expected $3.29 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Unum Group's reported EPS for the quarter was $1.92​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $348.7 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Unum Group shares had risen by 4.4% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 0.1% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, four analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 9 \"strong buy\" or \"buy,\" 5 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the life &amp; health insurance peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Unum Group is $82.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:59 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">2.14</p></td><td><p class=\"\">2.03</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.10</p></td><td><p class=\"\">2.13</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.02</p></td><td><p class=\"\">2.16</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.97</p></td><td><p class=\"\">2.12</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW05W:0-unum-group-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 10:00:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446651:0",
            "title": "South Korean Stocks Rally for 2nd Session",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The benchmark KOSPI climbed 1.3% to around 2,513 points on Wednesday, extending gains from the previous sessions and tracking Wall Street’s tech-led overnight rally.</p><p class=\"\">Market sentiment improved as the US and its trading partners adopted a cautious approach to tariffs despite ongoing global trade tensions.</p><p class=\"\">Domestically, South Korea's inflation rate rose to 2.2% in January 2025, the highest in six months, driven by a weaker currency that increased import costs.</p><p class=\"\">This supported the Bank of Korea’s decision to keep interest rates at 3%, balancing economic growth concerns with currency pressures amid political instability.</p><p class=\"\">Among index heavyweights, software stocks led the advance, driven by expectations of cheaper AI after China's Deepseek launch, with Kakao rising 5.8% on its AI partnership with OpenAI and Naver gaining 5.7%.</p><p class=\"\">Other notable gains include chips, battery and auto makers, such as SK Hynix (2.6%), LG Energy Solutions (1.8%), and Kia Corp (1%).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446651:0-south-korean-stocks-rally-for-2nd-session/",
            "pub_date": "2025-02-05 10:00:12",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463619:0",
            "title": "Kawasaki Kisen Kaisha's Profit Surges Nearly Fourfold in April-December 2024 Period; Shares Up Nearly 5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kawasaki Kisen Kaisha  reported a 283.9% year-on-year surge in attributable profit to 284.71 billion yen in the fiscal nine months ended Dec. 31, 2024, up from 74.2 billion yen a year earlier. </p><p class=\"\">The profit growth was boosted by higher operating revenues, equity in earnings of subsidiaries and affiliates as well as foreign exchange gains. </p><p class=\"\">Basic earnings per share (EPS) rose to 423.19 yen from 102.19 yen a year ago, according to a Tokyo Stock Exchange filing on Tuesday. </p><p class=\"\">Operating revenue increased 12.5% to nearly 805 billion yen from 715.4 billion yen a year earlier, driven by strong performance in its dry bulk and product logistics segments. </p><p class=\"\">For the fiscal year ending March 31, the company expects attributable profit to rise 189.2% to 295 billion yen, or 443.40 yen per share, and operating revenues to increase 9.6% to 1.05 trillion yen. </p><p class=\"\">It expects to pay a final dividend of 50 yen per share for the fiscal year. </p><p class=\"\">Kawasaki Kisen's shares gained nearly 5% in early trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463619:0/",
            "pub_date": "2025-02-05 10:00:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463620:0",
            "title": "BlinkLab Brings First Clinical Site on Board for Autism Diagnostic Registrational Trial, Shares Rise 10%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BlinkLab  said PriMED Clinical Research in Ohio became the first site to join the initial phase of the firm's US-based autism diagnostic registrational trial, according to a Wednesday Australian bourse filing. </p><p class=\"\">The site is expected to commence patient recruitment and testing for the 100-patient study in February. </p><p class=\"\">PriMED will use the overarching institutional review board approval BlinkLab secured for the clinical trial. </p><p class=\"\">The firm is seeking to start initiating partnerships with sixteen sites across the US. </p><p class=\"\">The firm's shares rose 10% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463620:0/",
            "pub_date": "2025-02-05 09:51:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX8PRZ5X:0",
            "title": "GH Research Announces Pricing of $150 Million Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DUBLIN, Feb.  05, 2025  (GLOBE NEWSWIRE) — GH Research PLC , a clinical-stage biopharmaceutical company dedicated to transforming the lives of patients by developing a practice-changing treatment in depression, today announced the pricing of its previously announced underwritten public offering in the United States of 10,000,000 ordinary shares at a public offering price of $15.00 per share for total gross proceeds of approximately $150 million. All of the ordinary shares are being offered by GH Research PLC. The offering is expected to close on February 6, 2025, subject to customary closing conditions. In addition, GH Research PLC has granted the underwriters a 30-day option to purchase up to an additional 1,500,000 ordinary shares at the public offering price, less underwriting discounts and commissions.</p><p class=\"\">Cantor, Stifel and RBC Capital Markets are acting as joint book-running managers for the offering. Canaccord Genuity and Citizens JMP are acting as co-lead managers for the offering.</p><p class=\"\">A registration statement relating to these securities was filed with the U.S. Securities and Exchange Commission (the \"SEC\") and declared effective on March 17, 2023. Copies of the registration statement can be accessed through the SEC's website free of charge at www.sec.gov. A preliminary prospectus supplement and an accompanying prospectus relating to and describing the terms of the offering were filed with the SEC and are available free of charge by visiting EDGAR on the SEC's website free of charge at www.sec.gov. When available, copies of the final prospectus supplement and the accompanying prospectus related to the offering can be accessed through the SEC's website free of charge at www.sec.gov or obtained free of charge from any of the joint book-running managers for the offering: Cantor Fitzgerald &amp; Co., Attention: Capital Markets, 110 East 59th Street, 6th Floor, New York, New York 10022, or by email at prospectus@cantor.com; Stifel, Nicolaus &amp; Company, Incorporated, Attention: Syndicate, One Montgomery Street, Suite 3700, San Francisco, California 94104, by telephone at (415) 364-2720, or by email at syndprospectus@stifel.com; or RBC Capital Markets, LLC, Attention: Equity Capital Markets, 200 Vesey Street, New York, New York 10281, by telephone at 877-822-4089 or by email at equityprospectus@rbccm.com. For the avoidance of doubt, any such prospectus supplement or the accompanying prospectus will not constitute a “prospectus” for the purposes of the Irish Companies Act 2014 (as amended), the EU Prospectus Regulation (EU) 2017/1129 (as amended) (the “Prospectus Regulation”), the European Union (Prospectus) Regulations 2019 of Ireland (as amended) or the Central Bank (Investment Market Conduct) Rules 2019 of Ireland and will not have been reviewed by Central Bank of Ireland, as competent authority, or any competent authority in any European Economic Area (the \"EEA\") member state or the United Kingdom.</p><p class=\"\">This press release does not constitute an offer to sell or the solicitation of an offer to buy securities, and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that jurisdiction.</p><p class=\"\">In any member state of the EEA this announcement and any offering are only addressed to and directed at persons who are \"qualified investors\" (\"Qualified Investors\") within the meaning of the Prospectus Regulation. In the United Kingdom, this announcement and any offering are only addressed to and directed at Qualified Investors (i) who have professional experience in matters relating to investments falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the \"Order\"), or (ii) who fall within Article 49(2)(a) to (d) of the Order, and (iii) to whom it may otherwise lawfully be communicated (all such persons being referred to as \"relevant persons\").</p><p class=\"\">This announcement must not be acted on or relied on (i) in the United Kingdom, by persons who are not relevant persons, and (ii) in any member state of the EEA, by persons who are not Qualified Investors. Any investment or investment activity to which this announcement relates is available only to and will only be engaged with (i) in the United Kingdom, relevant persons, and (ii) in any member state of the EEA, Qualified Investors.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GH Research PLC</strong></p><p class=\"\">GH Research PLC is a clinical-stage biopharmaceutical company dedicated to transforming the lives of patients by developing a practice-changing treatment in depression. GH Research PLC's initial focus is on developing its novel and proprietary mebufotenin therapies for the treatment of patients with treatment-resistant depression (TRD).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains certain forward-looking statements, including statements with regard to GH Research PLC’s expectations regarding the completion of the proposed securities offering. Words such as “anticipates,” “believes,” “expects,” “intends,” “projects,” “anticipates,” and “future” or similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to the inherent uncertainties in predicting future results and conditions and no assurance can be given that the proposed securities offering discussed above will be consummated on the terms described or at all. Completion of the proposed offering and the terms thereof are subject to numerous factors, many of which are beyond the control of GH Research PLC, including, without limitation, market conditions, failure of customary closing conditions and the risk factors and other matters set forth in GH Research PLC’s filings with the SEC. GH Research PLC undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations</strong></p><p class=\"\">Julie Ryan</p><p class=\"\">GH Research PLC</p><p class=\"\">investors@ghres.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX8PRZ5X:0-gh-research-announces-pricing-of-150-million-public-offering/",
            "pub_date": "2025-02-05 09:52:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014199:0",
            "title": "Chinese Share Mixed; Tariff Developments in Focus — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chinese shares are mixed in early trade, with the Shanghai Composite Index dropping 0.3% to 3240.74. The Shenzhen Composite Index is 0.35% higher and the ChiNext Price Index gains 0.4%. Investors are closely watching the latest tariff developments after China's retaliatory measures following President Trump's tariff hike. Technology companies are leading the gains with sentiment still positive about China's DeepSeek low-cost AI model. Beijing Kingsoft Office Software surges 16% and iFlytek is 8.3% higher. Decliners include Midea, which is down 2.5% and Yonghui Superstores, which is 4.2% lower. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014199:0/",
            "pub_date": "2025-02-05 09:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463621:0",
            "title": "Apollo Minerals Kickstarts Phase-Two Drilling at Salanie Gold Project in Gabon; Shares Climb 13%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Apollo Minerals  started the second phase of its drilling program at the Salanie gold project in Gabon, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">The current phase will focus on extensions to the identified A1 prospect mineralization and untested targets at other key prospects, per the filing. It follows \"exception results\" from the 2024 program, which intersected up to 11.7 meters at 4.3 grams per tonne grade of gold from 9.6 meters. </p><p class=\"\">Apollo Minerals' shares climbed nearly 13% in recent Wednesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463621:0/",
            "pub_date": "2025-02-05 09:52:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014196_20250204014200:0",
            "title": "GH Research Announces Pricing of $150M Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014196_20250204014200:0/",
            "pub_date": "2025-02-05 09:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW05R:0",
            "title": "Hanover Insurance Group Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Hanover Insurance Group Inc  reported quarterly adjusted earnings of $5.32​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $3.13.  The mean expectation of eight analysts for the quarter was for earnings of $3.37 per share. Wall Street expected results to range from $3.20  to $3.62 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 7.4% to $1.45 billion from a year ago; analysts expected $1.42 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Hanover Insurance Group Inc's reported EPS for the quarter was $4.59​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $167.9 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Hanover Insurance Group Inc shares had fallen by 0.8% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 0.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 4 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the property &amp; casualty insurance peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Hanover Insurance Group Inc is $175.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:52 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">3.37</p></td><td><p class=\"\">5.32</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.53</p></td><td><p class=\"\">3.05</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">1.85</p></td><td><p class=\"\">1.88</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.71</p></td><td><p class=\"\">3.08</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW05R:0-hanover-insurance-group-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:53:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446647:0",
            "title": "Japanese Yen Hits 7-Week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Japanese yen strengthened past 154 per dollar on Wednesday, reaching a seven-week high, as strong wage and services data bolstered expectations of a more hawkish stance from the Bank of Japan.</p><p class=\"\">Data revealed that real wages in Japan rose for the second consecutive month in December, with nominal wage growth hitting a near three-decade high, driven by a surge in winter bonuses.</p><p class=\"\">Additionally, Japan's services PMI for January was revised upward to 53, from a flash reading of 52.7.</p><p class=\"\">The Bank of Japan raised interest rates in January and signaled its readiness to hike rates further if economic and price trends align with its forecasts.</p><p class=\"\">On the external front, the yen also gained from a broad pullback in the dollar, as the US delayed tariffs on Mexico and Canada, while trade tensions with China proved less severe than anticipated.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446647:0-japanese-yen-hits-7-week-high/",
            "pub_date": "2025-02-05 09:53:34",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446648:0",
            "title": "China Services Growth Hits 4-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Caixin China General Services PMI unexpectedly declined to 51.0 in January 2025 from December’s seven-month high of 52.2, below market forecasts of 52.3.</p><p class=\"\">The latest reading marked the softest expansion in the services sector since September as new business growth eased to a four-month low, employment fell the most since April 2024, and selling price inflation slowed.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446648:0-china-services-growth-hits-4-month-low/",
            "pub_date": "2025-02-05 09:53:59",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014205:0",
            "title": "Hong Kong Shares Fall, Weighed by Consumer, Auto Stocks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong's Hang Seng Index falls 1.1% to 20553.22, weighed by consumer and auto stocks. Markets are keeping an eye on the influence of AI developments as well as developments relating to U.S. tariffs, given that Trump's policies have triggered market uncertainty, analysts at Nanhua Futures write in a note. Nongfu Spring falls 4.8%, Haidilao International loses 4.0% and Geely Automobile is 3.5% lower. Among advancers, Lenovo Group gains 3.4%, Orient Overseas (International) gains 2.0% and WH Group is 0.8% higher. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014205:0/",
            "pub_date": "2025-02-05 09:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463618:0",
            "title": "Delton Cables Leases Industrial Property in Palwal, India for Manufacturing Capacity Expansion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Delton Cables  has leased a 59,825-square-foot industrial property in the Palwal district of Haryana, India, for an undisclosed amount, according to a Tuesday disclosure to the BSE. </p><p class=\"\">The property will be used for the expansion of its manufacturing capacity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463618:0/",
            "pub_date": "2025-02-05 09:54:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:e05b6d32e094b:0",
            "title": "China January Caixin Services PMI 51.0 (vs. 52.2 in December)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China January Caixin Services PMI </p><p class=\"\">vs. 52.2 in December</p><p class=\"\">Composite:</p><p class=\"\">more to come </p></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:e05b6d32e094b:0-china-january-caixin-services-pmi-51-0-vs-52-2-in-december/",
            "pub_date": "2025-02-05 09:45:06",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014184:0",
            "title": "JGBs Fall, Weighed by Prospects of More BOJ Rate Increases — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JGBs fall in price terms during the morning Tokyo session. Data released earlier show Japan's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases and adding to the case for another BOJ rate hike. The sharp rise in the BOJ's core CPI inflation forecasts in the January outlook report, together with Gov. Ueda's recent comment that there's \"still a significant distance to the neutral rate of interest,\" has sparked worries over an acceleration of rate hikes and an increase in the terminal rate for this cycle, Mitsubishi UFJ Morgan Stanley Securities' fixed income strategists say in a recent report. The JGB 10-year yield is 1.5 bps higher at 1.290%. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014184:0/",
            "pub_date": "2025-02-05 09:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW05L:0",
            "title": "Jack Henry & Associates Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Jack Henry &amp; Associates Inc  reported quarterly adjusted earnings of $1.34​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.26.  The mean expectation of seventeen analysts for the quarter was for earnings of $1.32 per share. Wall Street expected results to range from $1.28  to $1.37 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 5.2% to $573.85 million from a year ago; analysts expected $576.23 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Jack Henry &amp; Associates Inc's reported EPS for the quarter was $1.34​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $97.85 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Jack Henry &amp; Associates Inc shares had fallen by 0.3% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 1.9% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, five analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 12 \"hold\" and 2 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the it services &amp; consulting peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Jack Henry &amp; Associates Inc is $190.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:45 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.32</p></td><td><p class=\"\">1.34</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.61</p></td><td><p class=\"\">1.63</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">1.32</p></td><td><p class=\"\">1.38</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.17</p></td><td><p class=\"\">1.19</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW05L:0-jack-henry-associates-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:46:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014187:0",
            "title": "RBNZ's OCR Cuts Still Blunted by Earlier Policy Tightening — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">There are no signs yet that aggressive interest rate cuts by the Reserve Bank of New Zealand since mid-2024 are gaining traction and lifting the economy, says Ben Jarman, chief economist at JP Morgan. To be sure, recent GDP revisions show a more worrying economic trajectory, he adds. The data have yet to turn up meaningfully because policy traction is still being blunted by earlier OCR hikes, he adds. This has slowed the lowering of new mortgage rates, and any improvement in disposable incomes, Jarman says. A number of households will still be rolling their mortgages into higher rates than previous, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014187:0/",
            "pub_date": "2025-02-05 09:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014189:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">2044 ET - There are no signs yet that aggressive interest rate cuts by the Reserve Bank of New Zealand since mid-2024 are gaining traction and lifting the economy, says Ben Jarman, chief economist at JP Morgan. To be sure, recent GDP revisions show a more worrying economic trajectory, he adds. The data have yet to turn up meaningfully because policy traction is still being blunted by earlier OCR hikes, he adds. This has slowed the lowering of new mortgage rates, and any improvement in disposable incomes, Jarman says. A number of households will still be rolling their mortgages into higher rates than previous, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2046 ET - JGBs fall in price terms during the morning Tokyo session. Data released earlier show Japan's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases and adding to the case for another BOJ rate hike. The sharp rise in the BOJ's core CPI inflation forecasts in the January outlook report, together with Gov. Ueda's recent comment that there's \"still a significant distance to the neutral rate of interest,\" has sparked worries over an acceleration of rate hikes and an increase in the terminal rate for this cycle, Mitsubishi UFJ Morgan Stanley Securities' fixed income strategists say in a recent report. The JGB 10-year yield is 1.5 bps higher at 1.290%. (ronnie.harui@wsj.com)</p><p class=\"\">2041 ET - New Zealand's unemployment in 4Q 2024 rose to a four-year high of 5.1%. While this was in line with the Reserve Bank of New Zealand's forecasts, money markets should expect a cut in the official cash rate later this month of \"at least\" 50 basis points, says Kieran Davies, chief macro strategist at Coolabah Capital. The unemployment rate almost matches the peak of 5.2% reached during the short Covid recession in 2020, Davies notes. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2032 ET - From a policy perspective, data showing New Zealand's unemployment rates at a 4-year high of 5.1% reaffirm the view that the Reserve Bank of New Zealand will continue to lower rates sequentially over 1H, including another 50-basis-point cut at a policy meeting later this month, says Andrew Boak, chief economist at Goldman Sachs. Boak continues to expect the RBNZ to slow the pace of cuts to 25 basis points per meeting, starting in April, ultimately reaching a terminal official cash rate of 3.0% in July. Still, the risks are skewed to faster and deeper cuts if the recent improvement in high-frequency surveys does not translate into some improvement in the economy, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">1958 ET - Trump's 10% tariff hike on China will likely cause faster industry consolidation among its industrial companies, Citi Research analysts led by Eric Lau say. While major exporters like Techtronic and Shenzhou have diversified production into Asean to avoid tariffs, smaller Chinese companies are unable to do so given difficulty in obtaining bank loans and lack of management resources, they say in a note. The tariff hike could cause them significant distress and spike the unemployment rate in China as these firms constitute about 79% of the total workforce, they add. That could lead China to roll out more stimulus to counter the economic impact. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">1957 ET - U.S.-China trade tensions have some investors concerned about potentially higher tariffs on Asean. While that can't be ruled out, Citi Research analysts led by Eric Lau think tariffs are unlikely to be on par with those levied at Mexico or China as Asean is an attractive region to help dilute CPI inflation for U.S. imported goods. Many major China exporters have diversified production into Asean to avoid tariffs but focus on labor-intensive, non-tech industries such as apparel and footwear that aren't targeted for reshoring into the U.S., they say. Mexico meanwhile has attracted automotive supply-chain industries as the U.S. government seems inclined to emphasize auto manufacturing reshoring, they add. \"The tariff hike scenario in Mexico may not necessarily apply to Asean, in our view.\"(fabiana.negrinochoa@wsj.com)</p><p class=\"\">1937 ET - South Korea's benchmark Kospi rises 0.9% to 2503.94 in early trade, as battery, semiconductor and auto stocks advance. Foreign and retail investors are net buyers amid easing fears over U.S. tariffs. Battery makers LG Energy Solution and Samsung SDI rise 2.0% and 2.9%, respectively, recovering from recent losses. Memory-chip maker SK Hynix gains 2.6%. Carmaker Kia is up 1.1%. Meanwhile, LG CNS, an IT service affiliate of LG Group, is down 2.9% on its stock exchange debut. USD/KRW is 0.5% lower at 1,454.90, compared with the prior session's Seoul onshore trading close. South Korea's 10-year government bond yield is up 0.9 bp at 2.844%. (kwanwoo.jun@wsj.com)</p><p class=\"\">1930 ET - The economy remains on solid footing but its health is uneven across sectors, Fed Vice Chair Philip Jefferson said Tuesday. In a lecture at Pennsylvania's Lafayette College, Jefferson notes strength in household spending, retail sales and activity in the services sector. \"The consumer spending data we have received recently have surprised me to the upside,\" Jefferson said, per his published remarks. On the other hand, some sectors have been notably weak. Residential investment has been flattish over the past three quarters, he notes, and production from the domestic manufacturing sector was about flat last year too. \"Much of the equipment investment that did take place came from imports,\" Jefferson says. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1913 ET - Japanese stocks are higher in early trade as fears about U.S. tariffs subside for now. Electronics stocks are leading the gains. Renesas Electronics is up 3.4% and Hitachi Ltd. is 2.9% higher. USD/JPY is at 154.31, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are closely watching U.S. trade talks as well as domestic earnings. Toyota Motor is scheduled to report its quarterly results later in the day. The Nikkei Stock Average is up 0.7% at 39070.87. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1850 ET - Japanese stocks may rise as fears about U.S. tariffs subside for now. Nikkei futures are up 0.4% at 38975 on the SGX. USD/JPY is at 154.17, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are focusing on U.S. trade talks as well as domestic earnings. Toyota Motor is set to announce its quarterly results later in the day. The Nikkei Stock Average rose 0.7% to 38798.37 on Tuesday. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1825 ET - BlackRock, the world's largest asset manager, last year announced a series of acquisitions of private market-focused firms that \"lay a foundation for an increased integration of public and private\" assets, Apollo's CEO Marc Rowan says during an earnings call. \"I continue to believe this convergence of public and private will be a very important source of demand for private assets,\" Rowan says. BlackRock last year acquired infrastructure-focused Global Infrastructure Partners and agreed to buy credit specialist HPS Investment Partners as well as Preqin, a provider of private-market research. \"We envision that traditional asset managers will evolve their businesses to include products that are public and private,\" Rowan adds. \"Our industry and our firm will be a supplier of products to [them].\" (luis.garcia@wsj.com; @lhvgarcia)</p><p class=\"\">1551 ET - Treasury yields lose steam as the trade war cools down a little and both factory orders and job openings in the U.S. fall. Economists surveyed by The Wall Street Journal expect the ADP private-sector jobs report tomorrow to show an increase to 150,000 from December's 122,000, while December trade deficit is forecast to widen to $96.8 billion from $78.19 billion. Jobless claims on Thursday are expected to accelerate and Friday's payrolls increases are expected to slow. Analysts show increasing concerns over stickier inflation and weaker growth potentially resulting from trade wars. The 10-year yield loses 0.031 percentage point to 4.511% and the two-year falls 0.051 p.p. to 4.213%. (paulo.trevisani@wsj.com; @ptrevisani)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014189:0/",
            "pub_date": "2025-02-05 09:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446646:0",
            "title": "China Composite PMI Hits 4-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Caixin China General Composite PMI edged down to 51.1 in January 2025 from 51.4 in December, marking the lowest print since September.</p><p class=\"\">Despite this, it pointed to the 15th month of growth in private sector activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446646:0-china-composite-pmi-hits-4-month-low/",
            "pub_date": "2025-02-05 09:47:48",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSO:0",
            "title": "China's services activity grows at slower pace, Caixin PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Employment levels decline at fastest pace since April 2024</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">New business growth eases to four-month low</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Business optimism improves, Trump tariffs major concern</li></ul></span></div><span><p class=\"\">    China's services activity expanded at a slower pace in January, with the Lunar New Year holidays worsening employment, but business sentiment improved, a private sector survey showed on Wednesday.</p><p class=\"\">The Caixin/S&amp;P Global services purchasing managers' index (PMI), slipped to 51.0 from 52.2 in December, but remained above the 50-mark that separates expansion from contraction on a monthly basis.</p><p class=\"\">That echoes the official PMI, which showed services activity weakened to 50.3 from 52.0.</p><p class=\"\">The Caixin survey showed that new business growth eased to a four-month low, while employment fell to the weakest since April 2024. </p><p class=\"\">The fall in January's employment sub-index was partly due to the earlier-than-usual Lunar New Year holiday this year, as some restaurants shut down temporarily and sent workers back home for the more than one week-long celebrations.</p><p class=\"\">The level of unfinished work fell for the first time in six months due to slower new business growth and better working efficiency. </p><p class=\"\">Business sentiment rose from December, but some firms expressed concerns over rising competition and uncertainties pertaining to the outlook for international trade.</p><p class=\"\">U.S. President Donald Trump on Saturday ordered 10% tariffs on goods from China. That prompted Beijing to swiftly respond on Tuesday with its own levies on some U.S. imports.</p><p class=\"\">\"The new duties will nearly double the effective tariff rate on Chinese imports (to the U.S.), but Chinese policymakers have ample scope to mitigate the damage to economic growth,\" said Gavekal Dragonomics's Thomas Gatley in a note on Monday. </p><p class=\"\">Julian Evans-Pritchard, head of China economics at Capital Economics, said that there could be a silver lining for China, with Trump's willingness to undermine U.S. alliances likely to leave China in a stronger geopolitical position.</p><p class=\"\">The Caixin/S&amp;P Global Composite PMI, which combines the manufacturing and services PMIs, fell to 51.1 in January from 51.4 the month prior.</p><p class=\"\">The pace of growth softened to the lowest in four months, as quicker manufacturing output growth failed to counter a softening pace of growth in services activity.</p><p class=\"\">China is struggling with a prolonged property crisis that has curbed investment and dented confidence though policymakers have pledged to prioritise domestic consumption in this year's policies. </p><p class=\"\">The country's movie box office took in record revenue during the Lunar New Year holiday, as sequels to popular Chinese hits drew theatregoers. Some local governments issued cinema vouchers as part of a campaign to revive consumption. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSO:0-china-s-services-activity-grows-at-slower-pace-caixin-pmi-shows/",
            "pub_date": "2025-02-05 09:48:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}