{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0RW:0",
            "title": "US long-dated yields rise on market relief amid tariff delay",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US JOLTS report shows lower job openings</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US factory orders drop</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US yield curve steepens as bond market stabilizes</li></ul></span></div><span><p class=\"\">    Long-dated U.S. Treasury yields rose on Tuesday after the Trump administration granted 30-day tariff reprieves to Canada and Mexico, unwinding some of the previous session's safe-haven bid that had pushed rates lower, </p><p class=\"\">However, data showing U.S. job openings dropped sharply in December saw longer-dated yields pare some of their earlier gains, led by the 10-year note. The benchmark 10-year yield was last up 1.2 basis points (bps) at 4.555% , after dropping on Monday to its lowest since mid-December.</p><p class=\"\">Data showed that job openings, a measure of labor demand, slid to 7.6 million on the last day of December, based on the Bureau of Labor Statistics' Job Openings and Labor Turnover Survey, or JOLTS report.</p><p class=\"\">   The market's focus, however, has been less on the data and more on tariffs.</p><p class=\"\">U.S. President Donald Trump on Monday suspended his threat of 25% tariffs on Mexico and Canada at the last minute, agreeing to a 30-day pause in return for concessions on border and crime enforcement.</p><p class=\"\">China, on the other hand, imposed targeted tariffs on American imports on Tuesday and put several companies, including Google, on notice for possible sanctions, in what market participants described as a measured response to an additional 10% U.S. tariff on Chinese exports.</p><p class=\"\">\"What we're seeing today is a bit of a relief not only due to delays on tariffs on Mexico and Canada, but a more measured  opening salvo between the U.S. and China,\" said Chip Hughey, managing director of fixed income, at Truist Advisory Services in Richmond, Virginia.</p><p class=\"\">China's new tariffs will not take effect until Feb. 10, giving Washington and Beijing time to try to seek a deal that Chinese policymakers have indicated they hope to reach with Trump.</p><p class=\"\">In late morning trading, U.S. two-year yields, which are tied to the Federal Reserve's policy moves, fell 3.5 bps to 4.230% (US2YT=RR).</p><p class=\"\">Also helping push the two-year yield down was a report showing that new orders for U.S.-manufactured goods dropped 0.9% in December after a revised 0.8% decline in November. Economists polled by Reuters had forecast factory orders would fall 0.7% after a previously reported 0.4% drop in November</p><p class=\"\">The rise in the 10-year yield and the fall in the two-year slightly steepened the yield curve to 31.9 bps (US2US10=TWEB), from 30.2 bps late on Monday. The curve hit its narrowest since late December on Monday after the initial tariff announcements.</p><p class=\"\">Investors have been selling the long end of the curve, demanding higher compensation, the so-called \"term premium\", in exchange for dealing with policy uncertainty over a longer time horizon. </p><p class=\"\">The current term premium for U.S. 10-year notes stood at 72 bps, according to estimates from the St. Louis Fed, compared with about 45 bps in early December.</p><p class=\"\">\"You expect yields to fall further, but that lack of clarity on policy is really giving intermediate and long-term investors more pause,\" said Truist's Hughey.</p><p class=\"\">U.S. 30-year yields also edged higher to 4.790%, up 1.9 bps (US30YT=RR).</p><p class=\"\">U.S. rate futures, meanwhile, have priced in about 44 bps of easing this year, up from 41 bps late on Monday, according to LSEG calculations, with the first rate cut likely happening at the Fed's June policy meeting.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0RW:0-us-long-dated-yields-rise-on-market-relief-amid-tariff-delay/",
            "pub_date": "2025-02-05 00:51:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV19M:0",
            "title": "Saint-Gobain To Launch Low-Carbon Stone Wool Production Line In Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Compagnie de Saint Gobain SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">TO LAUNCH ITS FIRST LOW-CARBON STONE WOOL PRODUCTION LINE IN SPAIN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">€40 MILLION INVESTMENT TO EXPAND AND DECARBONIZE ITS INSULATION PLANT</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">NEW INSTALLATIONS ARE EXPECTED TO BE OPERATIONAL IN THE FIRST HALF OF 2026</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MODERNIZATION WILL INCREASE STONE WOOL PRODUCTION CAPACITY BY APPROXIMATELY 40%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV19M:0-saint-gobain-to-launch-low-carbon-stone-wool-production-line-in-spain/",
            "pub_date": "2025-02-05 00:51:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309069:0",
            "title": "NeuroOne Medical Technologies Regains Nasdaq Compliance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NeuroOne Medical Technologies  said Tuesday it has regained compliance with Nasdaq's minimum share price requirement for continued listing. </p><p class=\"\">The company said it was notified by Nasdaq Monday that its bid price deficiency had been cured and NeuroOne was in compliance will all applicable listing standards. </p><p class=\"\">Shares of the company were down 2.2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309069:0/",
            "pub_date": "2025-02-05 00:51:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008596:0",
            "title": "New Tariffs Could Push iPhone Prices Higher. But a Trade War Could Play Out in Others Ways Too. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Angela Palumbo</p><p class=\"\">Smartphones, laptops, and other electronics devices could get pricier thanks to tariffs.</p><p class=\"\">President Donald Trump announced over the weekend that he would be implementing 10% tariffs on China and 25% tariffs on Canada and Mexico. Mexican and Canadian tariffs were paused on Monday following talks with those countries' leaders, but the levies on China went into effect overnight into Tuesday.</p><p class=\"\">China has responded by announcing import taxes of 15% on U.S. crude oil, machinery, and some cars, and a 10% increase of tariffs on coal and liquefied natural gas.</p><p class=\"\">Tariffs are taxes that are charged onto goods being imported from other countries. Companies that bring in goods from these impacted countries pay those taxes to the government. It's common for those companies to pass the increased costs from tariffs onto the consumer through higher prices. This time around, a 10% tariff on China — a country where many components and products come from — is likely to lead to higher priced phones, laptops, and more.</p><p class=\"\">According to a report from the Consumer Technology Association in January, tariffs on technology products could lead to a $90 billion to $143 billion decline in U.S. consumer purchasing power.</p><p class=\"\">\"If these tariffs are sticky and they continue to hold on, then I think the time frame for the permanent price escalation is after six to 12 months, when we're going to see that, hey, everything's more expensive,\" Jim Cagnina, senior market analyst at NinjaTrader, told Barron's.</p><p class=\"\">Just a few of the companies that could feel impacts from tariffs include chip company Intel and PC maker Dell Technologies along with smartphone giant Apple. Some of these consumer electronic makers have already spoken about what tariffs could mean for them.</p><p class=\"\">Intel, Dell and Apple didn't respond to requests for comment about the tariffs.</p><p class=\"\">Intel reported fourth-quarter revenue of $14.3 billion on Jan. 30, which was higher than Wall Street estimates. On the company's fourth-quarter earnings call, interim co-chief executive officer David Zinsner said that \"we expect a portion of Q4 revenue upside was due to customers hedging against potential tariffs.\"</p><p class=\"\">But Intel also provided disappointing revenue guidance for the current quarter. Zinsner said this was due to \"added pressure coming from macro uncertainty especially around tariffs, balancing of PC inventory and increasing competition.\"</p><p class=\"\">As the China tariffs kicked in on Tuesday, shares of Apple were up 1.8%, while Intel and Dell were up 0.2% and 1.8%, respectively.</p><p class=\"\">The trade dynamic could be a problem for an already weakened PC market, which saw demand decline after the Covid-19 pandemic fueled purchases of at-home devices. Companies have been pushing out new AI powered PCs to try to spur consumer excitement, but increased prices along with higher for longer interest rates doesn't bode well for the sector.</p><p class=\"\">\"The overall macroeconomic concerns seem to be overshadowing some of the progress and excitement around AI PCs. However, we maintain the view that the impact that on-device AI will have on the industry will be positive, even if the inflection point is delayed,\" Ryan Reith, group vice president with IDC, wrote in a research report last month.</p><p class=\"\">Meanwhile, iPhone maker Apple is an interesting piece to the tariff puzzle. Most of Apple's manufacturing is done in China. Importantly, though, the Cupertino based tech giant was exempt from tariffs the last time Trump was in office.</p><p class=\"\">When asked about the potential impacts on tariffs during Apple's first-quarter earnings call on Jan. 30, CEO Tim Cook said the company is monitoring the situation, but had nothing more to add. That's led investors and consumers alike to wonder whether the price of iPhones, MacBooks and more would increase.</p><p class=\"\">If Trump's new trade policies stick, one possible outcome would be for companies like Apple to move some of their manufacturing to countries that aren't impacted by the tariffs. Barron's has previously reported that about 80% of smartphones are imported from China, and if the manufacturing moved to other places, the average cost of smartphones could rise by more than $200.</p><p class=\"\">\"As the new tariff is imposed on imports from China, Apple could have its manufacturing partners ramp up production in India and ship to the U.S. This could also be done for other Apple products that are manufactured in countries including Vietnam, Malaysia, etc.,\" BofA Securities analyst Wamsi Mohan wrote on Monday. \"We have assumed 80% of Apple products sold in the U.S. can be sourced from other countries, apart from China.\"</p><p class=\"\">It's also possible that Apple chooses not to increase prices for consumers to keep a competitive edge.</p><p class=\"\">\"It might be that they take the decision that 'we're actually going to swallow some of this for our consumers,' especially if competitors don't increase the price, at least in the short term,\" Martin Balaam, chief executive of product information management platform Pimberly, told Barron's.</p><p class=\"\">In the long-term, though, a potential trade war means consumers may be dishing out more dollars for new gadgets than they once anticipated.</p><p class=\"\">Write to Angela Palumbo at angela.palumbo@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008596:0/",
            "pub_date": "2025-02-05 00:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309060:0",
            "title": "RBC Bearings Offers 'Attractive' Growth, Margin Expansion Potential, Morgan Stanley Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RBC Bearings  offers an \"attractive\" growth and margin expansion potential, given its management's strong execution and expectations of continued healthy demand for its aerospace and defense products, Morgan Stanley said in a Tuesday note. </p><p class=\"\">The company reported fiscal Q3 adjusted earnings Friday of $2.34 per diluted share, up from $1.85 a year earlier, as net sales rose to $394.4 million from $373.9 million. Morgan Stanley noted that RBC's industrial business returned to growth during the quarter, while aerospace and defense sales rose year over year. </p><p class=\"\">According to the investment firm, synergies between RBC and Dodge also contributed to the quarter's adjusted EBITDA margin of about 31%. Morgan Stanley said RBC's acquisition of Dodge in 2021 still provides strong cash flow generation, a recurring industrial business, and improved manufacturing technology. </p><p class=\"\">\"Given RBC's improved leverage, we continue to see the potential for accretive M&amp;A following its successful acquisition and integration of Dodge,\" Morgan Stanley added. </p><p class=\"\">Morgan Stanley raised its target price on RBC Bearings stock to $390 from $360, while maintaining its overweight rating.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309060:0/",
            "pub_date": "2025-02-05 00:52:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008604:0",
            "title": "Regeneron Pharmaceuticals on Pace for Largest Percent Increase Since August 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Regeneron Pharmaceuticals, Inc. (REGN) is currently at $700.00, up $33.15 or 4.97%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Jan. 15, 2025, when it closed at $703.43</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Aug. 3, 2023, when it rose 5.37%</li><li class=\"listItem-bmN0_SHH\">Snaps a three day losing streak</li><li class=\"listItem-bmN0_SHH\">Down 1.73% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 41.75% from its all-time closing high of $1201.76 on Aug. 27, 2024</li><li class=\"listItem-bmN0_SHH\">Down 25.36% from 52 weeks ago (Feb. 6, 2024), when it closed at $937.81</li><li class=\"listItem-bmN0_SHH\">Down 41.75% from its 52-week closing high of $1201.76 on Aug. 27, 2024</li><li class=\"listItem-bmN0_SHH\">Up 4.97% from its 52-week closing low of $666.85 on Feb. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Traded as high as $709.98; highest intraday level since Jan. 15, 2025, when it hit $712.60</li><li class=\"listItem-bmN0_SHH\">Up 6.47% at today's intraday high; largest intraday percent increase since Aug. 3, 2023, when it rose as much as 7.61%</li><li class=\"listItem-bmN0_SHH\">Third best performer in the Nasdaq 100 today</li></ul><p class=\"\">All data as of 11:51:35 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008604:0/",
            "pub_date": "2025-02-05 00:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309073:0",
            "title": "European Equities Close Mixed in Tuesday Trading; BP Shelves Australia Renewable Project Amid Cutbacks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The European stock markets closed mixed in Tuesday trading as The Stoxx Europe 600 rose 0.27%, Germany's DAX gained 0.39%, the FTSE 100 in London was off 0.12%, France's CAC 40 was up 0.74%, and the Swiss Market Index declined 0.57%. </p><p class=\"\">In Italy, the Italian National Institute of Statistics said preliminary estimates for the consumer price index was up 0.6% compared with the previous month, and up 1.5% on an annual basis. Istat attributed the annual increase to the prices of energy products. </p><p class=\"\">In Germany, the service sector, excluding financial and insurance services, registered 0.5% less price-adjusted and 0.3% less nominal sales in November compared with October according to preliminary results from the Federal Statistical Office. </p><p class=\"\">And in corporate news, BP is shelving plans to convert its former Kwinana oil refinery in Australia to produce renewable fuels, Bloomberg reported Tuesday, citing an email from the company. The report also cited an internal memo that said BP has stopped or paused 30 projects since June as the oil and gas giant enacts cutbacks. BP did not immediately respond to a request for comment from MT Newswires. </p><p class=\"\">Alcoholic beverage company Diageo said Tuesday that it is removing its medium-term guidance due to \"macroeconomic and geopolitical uncertainty in many of our key markets impacting the pace of recovery.\"</p><p class=\"\">UBS Group reported Q4 earnings Tuesday of $0.23 per diluted share, swinging from a loss of $0.09 a year earlier. Analysts polled by FactSet expected earnings of $0.30. Underlying revenue for the quarter ended Dec. 31 was $11.06 billion, compared with $10.42 billion a year earlier. Analysts surveyed by FactSet expected $11.17 billion. The company also said it plans to repurchase $1 billion of shares in H1 and up to an additional $2 billion in H2.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309073:0-european-equities-close-mixed-in-tuesday-trading-bp-shelves-australia-renewable-project-amid-cutbacks/",
            "pub_date": "2025-02-05 00:53:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008611:0",
            "title": "Canada, Mexico Should Have Called Trump's Tariff Bluff, Rosenberg Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Economist and market strategist David Rosenberg says he believes Canada and Mexico should have called President Trump's bluff on a 25% tariff. \"That may end up having been a mistake,\" says the head of Rosenberg Research. In a note to clients after the tariff reprieve, Rosenberg says he believes trade uncertainty overhanging Canada and Mexico will dissipate. \"The 30-day reprieve is a joke. Trump is not raising tariffs and probably was never going to,\" Rosenberg says. Canada now avoids a deep recession, Rosenberg says. The Canadian dollar has strengthened, with USDCAD at C$1.4318, or down 3.2% from a Sunday night peak. Still, Rosenberg sticks to his call for USDCAD at C$1.62, with Canada's economy set to underperform the U.S. and require more rate relief. (Paul.Vieira@wsj.com, @paulvieira)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008611:0/",
            "pub_date": "2025-02-05 00:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:04bfb83bd094b:0",
            "title": "ATL FED'S BOSTIC APPEARANCE AT NATIONAL HOUSING TASK FOR EVENT ENDED",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/macenews:04bfb83bd094b:0-atl-fed-s-bostic-appearance-at-national-housing-task-for-event-ended/",
            "pub_date": "2025-02-05 00:54:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SSNdRnh:0",
            "title": "Adjustment due to share distribution in Embracer: Asmodee Group (29/25)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NASDAQ NordicProduct information</p><p class=\"\">Adjustment due to share distribution in Embracer: Asmodee Group (29/25)</p><p class=\"\">The Extraordinary General Meeting (EGM) of Embracer Group has resolved on ashare distribution of Asmodee Group AB (Asmodee Group) to Embracer Groupshareholders, whereby one (1) Embracer Group share of class A and class B willentitle their holder to receive one (1) share of corresponding share class(i.e., class A or class B) in Asmodee Group. The Ex-date is February 4, 2025.The class B shares of Asmodee Group are expected to be listed on NasdaqStockholm on February 7, 2025. NASDAQ Derivatives Markets has carried out are-calculation of options and regular forwards/futures in Embracer Group(EMBRAC).</p><p class=\"\">For further information, please see the attached file.https://view.news.eu.nasdaq.com/view?id=bb5ee53d22aed2a1bbb0144692d8e86a0&amp;lang=en&amp;src=omxlink</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SSNdRnh:0-adjustment-due-to-share-distribution-in-embracer-asmodee-group-29-25/",
            "pub_date": "2025-02-05 00:54:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008628:0",
            "title": "ON Semiconductor Is Maintained at Underweight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:55 GMT) </strong>ON Semiconductor Price Target Cut to $52.00/Share From $64.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008628:0/",
            "pub_date": "2025-02-05 00:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309077:0",
            "title": "Bernstein Upgrades Air Products and Chemicals to Outperform From Market Perform, Adjusts PT to $375 From $290",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Air Products and Chemicals  has an average rating of overweight and mean price target of $356.58, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309077:0/",
            "pub_date": "2025-02-05 00:55:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463527:0",
            "title": "UK Regulator Approves Valneva's Vaccine for Chikungunya Disease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UK's Medicines and Healthcare products Regulatory Agency approved Valneva's  IXCHIQ vaccine against Chikungunya disease, which is caused by the chikungunya virus that is transmitted by infected mosquitoes. </p><p class=\"\">The approval authorizes the use of the Swedish biologics manufacturer's chikungunya vaccine (live) brand as a single-dose prophylaxis for adults aged 18 years and older. The decision was based on two main studies, where the required level of antibodies was met after one month by 99% of participants, while a follow-up showed that the target level was maintained by 97% of the participants even after two years. </p><p class=\"\">The British drug regulator said it will monitor the vaccine's safety and effectiveness under close review.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463527:0/",
            "pub_date": "2025-02-05 00:55:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008550:0",
            "title": "Advanced Micro Devices Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:47 GMT) </strong>Advanced Micro Devices Price Target Cut to $147.00/Share From $158.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008550:0/",
            "pub_date": "2025-02-05 00:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309051:0",
            "title": "Palantir Technologies' Big Q4 Beat Boosted by AI Demand, US Commercial Segment, UBS Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palantir Technologies'  Q4 results beat market expectations on a jump in US commercial sales and demand for artificial intelligence, underpinning strong margins and cash flow growth, UBS Securities said Tuesday in a report. </p><p class=\"\">On Monday, Palantir's results \"stood in sharp contrast to the mixed results from Microsoft  and ServiceNow  last week,\" the report said. </p><p class=\"\">\"The guidance for strong 54% US commercial revs growth in 2025 is a</p><p class=\"\">positive signal,\" UBS said. </p><p class=\"\">\"In light of DeepSeek, Palantir reaffirmed its views that model costs are falling fast, and performance gaps are narrowing,\" UBS said. Palantir's pricing structure \"may help to insulate it from any resulting AI price deflation,\" the report said. </p><p class=\"\">UBS raised its price target on Palantir stock to $105 from $80 and affirmed its neutral rating. Several other analysts boosted their price targets. </p><p class=\"\">Palantir shares jumped 25% in recent Tuesday trading. Microsoft gained 0.5%, and ServiceNow fell 1.3%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309051:0/",
            "pub_date": "2025-02-05 00:47:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:eba42dcb2094b:0",
            "title": "TradingView's General Manager Pierce Crosby Departs to Launch Consulting Firm for Startups",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">After nearly six years at the charting and analysis firm TradingView, Pierce Crosby is moving on to his next venture. The former General Manager of TradingView announced his departure to launch Merchant Seven (M7), a consulting firm focused on accelerating growth for early-stage technology companies. </p><p class=\"\">\"M7 provides a fractional, high-impact team and operational systems to help businesses move faster without the burden of full-time exec hires, Crosby posted on LinkedIn today (Tuesday). \"Why now? TradingView is in good hands, and the early-stage ecosystem is evolving rapidly. The right expertise at the right time is the perfect catalyst.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fintech and Tech Expert</strong></p><p class=\"\">With a decade of experience in fintech and trading technology, Crosby is now shifting his expertise toward helping startups scale. According to his post, Merchant Seven (M7) is designed to offer strategic guidance and operational support to growing tech firms.Pierce Crosby, Source: LinkedIn</p><p class=\"\">M7 reportedly provides a \"fractional, high-impact team\" to help businesses move forward without requiring full-time executive hires. The firm is already working with five clients and plans to expand its team this spring. </p><p class=\"\">\"We're launching with five clients already on board and expanding our team this spring to take on more. If you're building something ambitious and looking for support, drop us a note.\"</p><p class=\"\">Crosby highlighted the evolving early-stage startup ecosystem as a key reason for launching M7. By offering specialized consulting, M7 now aims to streamline growth processes and enhance operational efficiency for emerging companies. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Teaming Up with Former Colleagues</strong></p><p class=\"\">Crosby isn't embarking on this new venture alone. Joining him at M7 are two former TradingView colleagues, Milana Ruchkina. Ruchkina, previously the US Growth Director at TradingView, will serve as Chief of Staff at M7.Milana Ruchkina, Source: LinkedIn</p><p class=\"\">\"I've joined the Merchant Seven team to continue pursuing that vision and passion. My focus will be working with early-stage companies to help their dreams come true too!,\" Ruchkina wrote. </p><p class=\"\">Crosby's tenure at TradingView began in 2019, where he played a crucial role in expanding the platform's influence, particularly among retail FX and CFD brokers.</p><p class=\"\">Before that, he spent five years at StockTwits in various leadership roles, including VP of Revenue Strategy and Head of Business Development.</p></span></div>",
            "link": "https://www.tradingview.com/news/financemagnates:eba42dcb2094b:0-tradingview-s-general-manager-pierce-crosby-departs-to-launch-consulting-firm-for-startups/",
            "pub_date": "2025-02-05 00:47:10",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308952:0",
            "title": "Top Midday Stories: China Retaliates With Tariffs, Antitrust Probe of Google; Merck Shares Tumble on Downbeat Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">All three major US stock indexes were up in late morning trading on Tuesday as investors digest the latest US tariff news. </p><p class=\"\">China imposed retaliatory measures on Tuesday after President Donald Trump announced a 10% tariff on Chinese goods over the weekend. China announced tariffs of 15% on coal and LNG coming from the US and 10% for crude oil, farm machinery and certain vehicles, set to take effect Feb. 10. In addition, China's State Administration for Market Regulation opened an antitrust investigation in Alphabet's  Google over suspected violations of the country's anti-monopoly law, according to media reports. Lastly, China's Commerce Ministry has reportedly placed PVH , owner of brands like Calvin Klein and Tommy Hilfiger, and Illumina  on its \"unreliable entity\" list, the reports said. Alphabet shares were up 1.9%, while those of PVH and Illumina were down 1.3% and 5.8%, respectively. </p><p class=\"\">Merck  reported Q4 non-GAAP earnings Tuesday of $1.72 per share, up from $0.03 a year earlier and above the consensus estimate of analysts surveyed by FactSet of $1.61. Fourth-quarter sales were $15.62 billion, up from $14.63 billion a year earlier and above the FactSet consensus estimate of $15.48 billion. For full-year 2025, Merck expects non-GAAP EPS of $8.88 to $9.03 on sales of $64.1 billion to $65.6 billion. Analysts polled by FactSet expect non-GAAP EPS of $9.13 on sales of $67.07 billion. Merck shares were down about 11%. </p><p class=\"\">PepsiCo  reported fiscal Q4 core earnings Tuesday of $1.96 per diluted share, up from $1.78 a year earlier and above the FactSet consensus estimate of $1.94. Fiscal Q4 revenue was $27.78 billion, down from $27.85 billion in the year-ago period and below the FactSet consensus of $27.89 billion. The company expects fiscal 2025 core earnings to increase by low-single digits and expects low-single-digit organic revenue growth. Pepsi shares were down 4.2%. </p><p class=\"\">Palantir Technologies  reported Q4 adjusted earnings late Monday of $0.14 per share, up from $0.08 a year earlier and above the FactSet consensus of $0.11. Fourth-quarter revenue was $827.5 million, up from $608.4 million in the year-ago period and above the FactSet consensus of $775.8 million. The company expects Q1 revenue of $858 million to $862 million, compared to the FactSet consensus estimate of $799.6 million. For full-year 2025 revenue, Palantir expects $3.74 billion to $3.76 billion, compared to the FactSet consensus of $3.50 billion. Palantir shares were up nearly 25%. </p><p class=\"\">Pfizer  reported Q4 adjusted earnings Tuesday of $0.63 per diluted share, up from $0.10 a year earlier and above the FactSet consensus estimate of $0.47. Fourth-quarter revenue was $17.76 billion, up from $14.57 billion a year earlier and above the FactSet consensus of $17.35 billion. The company reaffirmed both its full-year 2025 adjusted EPS guidance of $2.80 to $3 and its full-year 2025 revenue guidance of $61 billion to $64 billion. Pfizer shares were down 1.2%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308952:0/",
            "pub_date": "2025-02-05 00:47:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008565:0",
            "title": "VeriSign Is Maintained at Buy by Citigroup",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008565:0/",
            "pub_date": "2025-02-05 00:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309070:0",
            "title": "FirstService Raises Quarterly Dividend to $0.275 a Share From $0.25, Payable April 7 to Holders of Record March 31",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309070:0/",
            "pub_date": "2025-02-05 00:48:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008580:0",
            "title": "Trump Tariffs Loom Over Ad Industry, From Brands to Digital Sellers — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Patrick Coffee</p><p class=\"\">President Trump's new tariffs on China, and those threatened against Canada and Mexico, may slow advertising growth at top digital powers such as Meta Platforms and Google and encourage some major brands to cut ad spending more broadly, industry analysts said.</p><p class=\"\">Trump's 10% tariffs on imports from China took effect on Tuesday morning, along with an order suspending the de minimis rule that has exempted shipments worth less than $800 from tariffs.</p><p class=\"\">White House trade adviser Peter Navarro said this morning that Trump will talk with Chinese leader Xi Jinping later Tuesday about a potential tariff pause, and it's possible that the Trump administration could ultimately avoid tariffs and preserve the de minimis exception with all three countries.</p><p class=\"\">Should the opposite happen, however, the turmoil in aggregate would \"absolutely impact everybody, including the large ad platforms,\" said Youssef Squali, managing director at banking company Truist Financial and head of its internet and digital research group.</p><p class=\"\">Chinese e-commerce giants such as Temu and Shein built enormous businesses around the de minimis exception in recent years, spending billions of dollars on digital advertising to market their low-cost goods to American consumers. Eliminating the rule will force the companies to either raise prices for U.S. buyers or accept lower profits.</p><p class=\"\">\"A suspension of the de minimis exemption poses a risk to ad spend from Chinese e-comm platforms like Temu &amp; Shein,\" Bank of America analysts wrote in a note Monday, describing the change as a negative for the largest digital ad platforms. \"With the exemption removed, their growth could be significantly constrained, potentially leading to cuts [to] marketing budgets.\"</p><p class=\"\">Even if Temu and Shein don't significantly reduce their advertising, a modest cutback would be noticeable at the companies' key platforms including Meta's Facebook and Instagram and Alphabet's YouTube and Google search, said Squali.</p><p class=\"\">Temu spent $2 billion on Meta ads in 2023, The Wall Street Journal has reported.</p><p class=\"\">Temu was the second-largest advertiser on Meta's platforms last month and the seventh largest digital advertiser in the U.S., according to market research firm Sensor Tower.</p><p class=\"\">Other advertisers will also be impacted by the tariffs against China, and even more so if those against Canada and Mexico take effect. Sellers of cars and trucks, household items, sporting goods, computers and agricultural products all rely heavily on imports to build their products, Bank of America noted.</p><p class=\"\">Automakers, for example, spend millions of dollars every year on imports from Mexico, Canada and China in order to build car seats and safety belts, according to research from consulting firm AlixPartners. They had hoped that the administration would grant them a carve-out from the tariffs promised against Mexico and Canada, but no such exception materialized.</p><p class=\"\">The price of each car sold in the U.S. will go up by around $3,000 as a result of the tariffs if they all take effect, and discretionary spending categories like marketing will be the first place automakers look to counter those losses, said Arun Kumar, partner, managing director and global co-leader of the advanced mobility practice at AlixPartners.</p><p class=\"\">The pandemic saw a 20% decline in overall ad spending, Kumar said. The tariffs on China plus those threatened against Canada and Mexico would likely power a 5% to 15% drop, with large car brands slashing brand marketing efforts, especially in traditional formats like print and linear TV, in favor of digital performance campaigns, he said.</p><p class=\"\">\"The long-term equity, brand building, that's going to be the first one they'll kind of dial back because obviously they can live without that,\" Kumar said.</p><p class=\"\">Platforms could weather the tariffs' effects in the long run. Investors believe that Meta, for example, may be well-positioned to absorb the blow given its scale and grip on advertisers, as demonstrated by the company's own price hikes, said Squali of Truist. Meta's price per ad increased 14% in the fourth quarter of 2024 compared with the period a year earlier, according to its most recent earnings.</p><p class=\"\">Brands may also recover from the initial shock of the first stages of Trump's pending trade war. But the general sense of market volatility will affect revenue by discouraging consumers who may have already been hesitant to buy big-ticket items like cars, said Kumar.</p><p class=\"\">\"Net-net, the situation today [for advertisers] does not look as rosy as it did a week ago, when we didn't have these tariffs contemplated in our models,\" said Squali.</p><p class=\"\">Write to Patrick Coffee at patrick.coffee@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008580:0/",
            "pub_date": "2025-02-05 00:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008577:0",
            "title": "Base Metal Prices Rise on Tariff Delay, Weaker U.S. Dollar — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Base metal prices rise, with LME three-month copper up 0.5% at $9,158.50 a metric ton and LME three-month aluminum up 0.6% at $2,636.50 a ton. The market has bounced back from losses incurred by President Trump's proposed tariffs on Canada and Mexico, which have been postponed a month after last-minute agreements on Monday. An additional 10% China tariff has proceeded. This has eased market worries of reduced industrial growth and demand. Canada and Mexico are significant suppliers to the U.S. across the whole base-metals complex, ranging from around 20% of copper imports to nearly half of its aluminum imports. News of the delay also sent the U.S. dollar lower, a tailwind for metals as it becomes cheaper for international buyers to purchase dollar-denominated commodities. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008577:0/",
            "pub_date": "2025-02-05 00:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446595:0",
            "title": "CAC 40 Rises as Earnings Offset Trade Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The CAC 40 climbed 0.7% to close at 7,906 on Tuesday, rebounding from early losses and the prior session’s sharp decline, driven by strong corporate earnings despite lingering trade tensions.</p><p class=\"\">BNP Paribas surged 4.2% after reporting higher earnings and boosting shareholder returns, lifting other major financial stocks.</p><p class=\"\">SImilarly, Dassault Systèmes soared 8.9% following better-than-expected Q4 results.</p><p class=\"\">Meanwhile, luxury mega caps were mixed amid uncertainty over Chinese demand.</p><p class=\"\">On the geopolitical front, U.S. President Trump’s new 10% tariff on Chinese imports took effect, prompting Beijing to retaliate with tariffs on select U.S. exports, including oil, gas, and automobiles, alongside an antitrust probe into Google.</p><p class=\"\">However, Trump delayed imposing 25% tariffs on Mexico and Canada for a month in exchange for commitments on migration and drug trafficking, adding a degree of relief to markets.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446595:0-cac-40-rises-as-earnings-offset-trade-concerns/",
            "pub_date": "2025-02-05 00:49:09",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1PF:0",
            "title": "Vaccine makers fall as Kennedy moves closer to health secretary job",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of vaccine makers fall after President Donald Trump's pick for U.S. health secretary, Robert F. Kennedy Jr., moved closer to the job following a favorable vote by a U.S. Senate panel</p><p class=\"\">** Kennedy, who founded the anti-vaccine group Children's Health Defense, has long sown doubts about the safety and efficacy of vaccines</p><p class=\"\">** Shares of Pfizer  fall 1.5%, Moderna  fall 4.2%, U.S.-listed shares of BioNTech  down 2.5% and Novavax  down 2.3%</p><p class=\"\">** Earlier on Tuesday, Pfizer shares were up 2% in pre-market trading on better-than-expected quarterly results </p><p class=\"\">** Up to the last close, PFE down 2.7%, MRNA down 62.5% in the last 12 months</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1PF:0-vaccine-makers-fall-as-kennedy-moves-closer-to-health-secretary-job/",
            "pub_date": "2025-02-05 00:49:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008588:0",
            "title": "ServiceNow Is Maintained at Buy by Citigroup",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:50 GMT) </strong>ServiceNow Price Target Cut to $1426.00/Share From $1432.00 by Citigroup</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008588:0/",
            "pub_date": "2025-02-05 00:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSQ2TkQa:0",
            "title": "Empower Federal Credit Union Employs Process-Mapping and Robotic Process Automation with The Lab Consulting to Improve Efficiency, Boost Member Experience, and Enable Higher Levels of Employee Productivity",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Innovative Credit Union Taps The Lab Consulting for End-to-End Process Mapping and Automation Implementation</p><p class=\"\">SYRACUSE, NY / ACCESS Newswire / February 4, 2025 / Empower Federal Credit Union is pleased to announce the results of its recent, ongoing strategic initiative to improve operational efficiency, scalability, end-to-end processes, and experience for its more than 280,000 members and 600 employees.</p><p class=\"\">By recently engaging with Houston-based The Lab Consulting to business-process-map the organization, Empower FCU was able to identify hundreds of valuable process improvements, identify high-value automation use cases, and define an implementation roadmap for self-sustaining their new automation program.</p><p class=\"\">The initiative was extensive, fast paced, and detailed. Thousands of work activities-scrutinized down to the one-to-three-minute-activity level-were mapped. Over 100 Robotic Process Automation (RPA) use cases were identified, business value quantified, and each prioritized for implementation. Additionally, more than 150 industry best practices-spanning people, processes, and technology-were identified as part of the effort.</p><p class=\"\">End-to-end business processes mapped included retail new-account opening; branch operations and support; consumer, mortgage, and commercial loan origination and servicing; card operations; and payments and deposit operations.</p><p class=\"\">Implementation of the identified opportunities was prioritized by benefits across three waves in a \"crawl/walk/run\" cadence, with the first implementation wave already complete. Five select Robotic Process Automation \"bots\" already implemented for Empower FCU, in partnership with The Lab's US-based development team, include: Right-to-Offset, ACH Returns, General-Ledger Balancing, Account Warning Flag Removal, and Delinquent Loan Charge Offs.</p><p class=\"\">\"Our dedication to process improvement is anchored by a commitment to reduce friction for our members and employees. With an established goal to decrease processing times by eliminating manual tasks, we partnered with The Lab and started our continuous improvement journey. Through business-process mapping we've now identified, prioritized, and implemented improvements that allow our team to focus on higher-value work while minimizing tedious tasks,\" said Jen Wolfe, EVP/COO, Empower FCU.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information:</strong></p><p class=\"\">Chris Keller | Chief Marketing Officer</p><p class=\"\">Empower FCU</p><p class=\"\">ckeller@empowerfcu.com</p><p class=\"\">Chris Wilds | Director, Automation</p><p class=\"\">The Lab Consulting</p><p class=\"\">cwilds@thelabconsulting.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Empower FCU</strong></p><p class=\"\">Empower Federal Credit Union is a not-for-profit financial cooperative owned by and operated for its members since its founding in 1939. Since then, Empower FCU has grown to over $3.8 billion in assets, serving more than 280,000 members, with 24 branch locations across upstate New York. To learn more, visit <em>www.empowerfcu.com</em><em>.</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About The Lab Consulting</strong></p><p class=\"\">Houston-based The Lab Consulting is a leading provider of process improvement and data standardization for white-collar work, or \"knowledge work.\" The Lab's \"process-first\" approach has accelerated strategic benefits for credit unions and banks with process standardization, robotic process automation (RPA), artificial intelligence (AI), data analytics and more. Since 1993, The Lab has helped businesses worldwide to reclaim capacity, preserve margin and increase sales. Visit <em>thelabconsulting.com.</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> The Lab Consulting</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSQ2TkQa:0/",
            "pub_date": "2025-02-05 00:50:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0VC:0",
            "title": "PREVIEW: Advanced Micro Devices shares up; Q4 rev, EPS seen rising",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in chip designer Advanced Micro Devices  up 2.4% ahead of quarterly report due after market close</p><p class=\"\">** Wall Street sees AMD reporting Q4 adj EPS of $1.08 vs $0.77 in year-ago quarter on rev of $7.53 bln vs $$6.17 bln year-ago, according to latest data from LSEG</p><p class=\"\">** In last 8 quarters AMD met or beat the Street on EPS 7 times while its rev met or beat every time</p><p class=\"\">** Investors will closely watch for details of AMD's artificial intelligence strategy with doubts about its place in the AI race, which Nvidia  already dominates while Microsoft , Amazon.com , Meta  are working on custom chips</p><p class=\"\">** Last traded at $117 vs median PT of $166.50 as per LSEG, which shows 51 analyst ratings: 12 'strong buy,' 24 'buy,' 14 'hold' and 1 'sell' recommendation</p><p class=\"\">** AMD shares down ~2.9% YTD after falling 18.1% in 2024 while Philadelphia semiconductor index  down ~0.1% YTD after rising 19.3% in 2024 </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0VC:0-preview-advanced-micro-devices-shares-up-q4-rev-eps-seen-rising/",
            "pub_date": "2025-02-05 00:50:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC69ty9p:0",
            "title": "Zoeta Dogsoul Launches Groundbreaking Dog Knowledge Base",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A Game-Changer in Dog Training and Canine Behavior Understanding</p><p class=\"\">Chiang Mai, Thailand--(Newsfile Corp. - February 4, 2025) -  Zoeta Dogsoul, a global pioneer in science-backed dog training and behavioral research, proudly unveils its <strong class=\"root-Tkn6WL2y\">Comprehensive Dog Knowledge Base</strong>-a transformative resource designed to revolutionize the way dog owners, trainers, and enthusiasts understand and connect with their dogs.</p><p class=\"\">Sebastian Stroeller Behavior Expert | Zoeta Dogsoul</p><p class=\"\">With a mission rooted in <strong class=\"root-Tkn6WL2y\">bridging science and soul in dog training</strong>, Zoeta Dogsoul's new knowledge base is not just another collection of dog training tips. Instead, it's an evolving platform that integrates cutting-edge research, time-tested methodologies, and deep behavioral insights to <!-- -->help humans truly understand their canine companions.</p><p class=\"\">Beyond Training: A Holistic Approach to Canine Behavior</p><p class=\"\">\"Our goal has always been to go beyond traditional dog training and tap into the emotional, psychological, and instinctual world of dogs,\" said <strong class=\"root-Tkn6WL2y\">Sebastian Stroeller, CEO of Zoeta Dogsoul.</strong></p><p class=\"\">\"This knowledge base isn't just about training commands-it's about fostering communication, trust, and harmony between dogs and their owners.\"</p><p class=\"\">This comprehensive resource offers <strong class=\"root-Tkn6WL2y\">scientifically-backed insights</strong> into key areas such as: <strong class=\"root-Tkn6WL2y\">Dog Training</strong> - Structured guidance from basic obedience to advanced training techniques (Explore training topics).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Behavioral Science</strong> - Expert analysis of canine psychology, problem-solving, and social intelligence (Understand behavior).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nutrition &amp; Health</strong> - Data-driven dietary recommendations to optimize canine well-being (Dive into nutrition).</p><p class=\"\">Key Highlights of the Zoeta Dogsoul Knowledge Base:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Science-Backed Learning:</strong> Articles, videos, and research-driven content provide real solutions for dog owners (Read: Why the Alpha Dominance Theory is Outdated).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mastering Canine Psychology:</strong> A deep dive into how dogs think, learn, and interact with humans (Master Dog Psychology).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Behavioral Problem-Solving:</strong> Strategies to prevent and manage common dog issues (Preventing &amp; Managing Behavioral Problems).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Evolution of Training Methods:</strong> The history and science behind dog training, from early domestication to modern methods (History of Dog Training).</p><p class=\"\">A Resource for Every Dog Owner, Trainer, and Enthusiast</p><p class=\"\">Designed for accessibility and ease of use, the <strong class=\"root-Tkn6WL2y\">Zoeta Dogsoul Knowledge Base</strong> offers engaging, interactive content for all learning styles. Whether a first-time dog owner, a professional trainer, or a canine behaviorist, users will find <strong class=\"root-Tkn6WL2y\">actionable insights</strong> that <strong class=\"root-Tkn6WL2y\">enhance their connection with dogs</strong> while addressing real-world challenges like behavioral issues, nutrition, and training roadblocks.</p><p class=\"\">With <!-- -->continuous updates, fresh research, and real-world case studies, Zoeta Dogsoul ensures that its knowledge base remains at the forefront of the <!-- -->global dog training and behavioral science landscape.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Experience the Future of Dog Training</strong></p><p class=\"\">Discover the <strong class=\"root-Tkn6WL2y\">Zoeta Dogsoul Comprehensive Dog Knowledge Base</strong> today and unlock the secrets to a <strong class=\"root-Tkn6WL2y\">harmonious, well-trained dog</strong>: Start Learning Now.</p><p class=\"\">Zoeta Dogsoul Center Chiang Mai</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Zoeta Dogsoul</strong></p><p class=\"\">Zoeta Dogsoul is a leading innovator in dog training, behavioral science, and canine education. Through AI-powered technology, expert-led insights, and a deep commitment to understanding the soul of the dog, Zoeta Dogsoul continues to set new standards in dog training worldwide. Available in 95 languages, our AI Training Assistant, Live Training Sessions, and Video-on-Demand features provide unparalleled access to professional dog training anytime, anywhere.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Press Inquiries</strong></p><p class=\"\">Zoeta Dogsoul</p><p class=\"\">https://zoeta-dogsoul.com/</p><p class=\"\">Sebastian Stroeller</p><p class=\"\">sebastian@zoeta-dogsoul.com</p><p class=\"\">+66958496783</p><p class=\"\">To view the source version of this press release, please visit https://www.newsfilecorp.com/release/239587</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC69ty9p:0-zoeta-dogsoul-launches-groundbreaking-dog-knowledge-base/",
            "pub_date": "2025-02-05 00:41:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC7p34Pl:0",
            "title": "CSE Bulletin: CSE Family Day Schedule",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toronto, Ontario--(Newsfile Corp. - Le 4 février/February 2025) - CSE market and offices will be closed on Monday, February 17, 2025 for Family Day. Regular trading hours for CSE will resume on Tuesday, February 18, 2025. Trade and settlement dates are as follows:</p><p class=\"\">_________________________________</p><p class=\"\">Le marché et les bureaux du CSE seront fermés le lundi 17 février 2025 pour le jour de la Famille. Les heures normales de négociation pour CSE reprendront le mardi 18 février 2025. Les dates de transaction et de règlement sont les suivantes:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Holiday/ Vacances</p></td><td><p class=\"\">Family Day/ Le jour de la Famille</p><p class=\"\">Le 17 février/February 2025</p></td></tr><tr><td><p class=\"\">Trade Date/ Date du commerce</p></td><td><p class=\"\">Le 14 février/February 2025</p></td></tr><tr><td><p class=\"\">Settlement date/Date de règlement</p></td><td><p class=\"\">Le 18 février/February 2025</p></td></tr></tbody></table></div><p class=\"\">If you require further information on the holiday schedule, please contact CSE Market Operations at Marketops@thecse.com or 416-306-0772.</p><p class=\"\">Si vous avez besoin de plus amples informations sur le calendrier des vacances, veuillez contacter les opérations de marché du CSE à Marketops@thecse.com ou au 416-306-0772.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC7p34Pl:0-cse-bulletin-cse-family-day-schedule/",
            "pub_date": "2025-02-05 00:41:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008496:0",
            "title": "PepsiCo on Pace for Largest Percent Decrease Since October 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PepsiCo, Inc. (PEP) is currently at $143.47, down $6.80 or 4.53%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be lowest close since Jan. 10, 2025, when it closed at $142.64</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent decrease since Oct. 5, 2023, when it fell 5.22%</li><li class=\"listItem-bmN0_SHH\">Currently down three consecutive days; down 5.55% over this period</li><li class=\"listItem-bmN0_SHH\">Worst three day stretch since the three days ending May 20, 2022, when it fell 7.02%</li><li class=\"listItem-bmN0_SHH\">Down 5.65% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 26.85% from its all-time closing high of $196.12 on May 12, 2023</li><li class=\"listItem-bmN0_SHH\">Down 16.30% from 52 weeks ago (Feb. 6, 2024), when it closed at $171.42</li><li class=\"listItem-bmN0_SHH\">Down 21.65% from its 52-week closing high of $183.11 on May 16, 2024</li><li class=\"listItem-bmN0_SHH\">Up 0.58% from its 52-week closing low of $142.64 on Jan. 10, 2025</li><li class=\"listItem-bmN0_SHH\">Traded as low as $143.10; lowest intraday level since Jan. 13, 2025, when it hit $142.14</li><li class=\"listItem-bmN0_SHH\">Down 4.77% at today's intraday low; largest intraday percent decrease since Oct. 5, 2023, when it fell as much as 5.35%</li><li class=\"listItem-bmN0_SHH\">Second worst performer in the Nasdaq 100 today</li></ul><p class=\"\">All data as of 11:40:41 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008496:0/",
            "pub_date": "2025-02-05 00:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008497:0",
            "title": "Croatia Issues 2 Billion Euros in 12-Year Bonds — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Emese Bartha</p><p class=\"\">Croatia issued 2 billion euros ($2.07 billion) in February 2037-dated bonds via a bank syndicate on Tuesday, drawing demand in excess of 5 billion euros, one of the joint lead manager banks said.</p><p class=\"\">The books include 175 million euros of joint lead manager demand.</p><p class=\"\">The spread on the bond was set 90 basis points above mid-swaps, the same bank said. The bond has a 3.25% coupon, and it was priced at 99.745, at a yield of 3.276%, the same bank said.</p><p class=\"\">Joint lead managers of the transaction were Erste Group; IMI-Intesa Sanpaolo/PBZ; ING; J.P. Morgan and Morgan Stanley.</p><p class=\"\">Write to Emese Bartha at emese.bartha@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008497:0-croatia-issues-2-billion-euros-in-12-year-bonds-update/",
            "pub_date": "2025-02-05 00:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}