{
    "data": [
        {
            "id": "tradingview:dbf980f59de63:0",
            "title": "NPK International Inc. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>NPK International Inc., a leading provider of recyclable composite matting systems and related services, has released its 2025 10-K report, showcasing significant financial growth, strategic initiatives, and operational highlights. The company, which primarily serves the power transmission sector, has demonstrated robust performance and a clear vision for future expansion.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Revenues</span></strong><span>: $277.0 million, increased 27% from 2024 driven by a 26% increase in rental and service revenues and a 30% increase in product sales revenues.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Gross Profit Margin</span></strong><span>: 36.4%, improved by 90 basis points from 2024 due to a higher proportion of rental revenues.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operating Income from Continuing Operations</span></strong><span>: $46.8 million, increased 45% from 2024, reflecting higher revenues and improved operational efficiency.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income</span></strong><span>: $38.9 million, compared to a net loss of $150.3 million in 2024, primarily due to the absence of the loss on sale of the Fluids Systems business.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Income from Continuing Operations</span></strong><span>: $35.9 million, slightly up from $35.6 million in 2024, reflecting stable performance in core operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Income (Loss) from Discontinued Operations</span></strong><span>: $3.0 million, compared to a loss of $185.9 million in 2024, due to the gain on sale related to the resolution of certain estimated deferred consideration and liabilities.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income (Loss) Per Common Share - Basic</span></strong><span>: $0.46, compared to $(1.75) in 2024, reflecting improved profitability.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income (Loss) Per Common Share - Diluted</span></strong><span>: $0.45, compared to $(1.72) in 2024, indicating a return to profitability.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments</span></strong><span>: In 2025, 66% of NPK International Inc.'s revenues were generated from the rental of recyclable composite matting systems, along with related site construction and services. The remaining 34% of revenues came from the sale of manufactured recyclable composite mats, with power transmission being the primary end market.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance</span></strong><span>: Approximately 93% of the company's revenues in 2025 were generated domestically within the United States, with the remaining 7% from international markets, primarily the United Kingdom.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Customer Segments</span></strong><span>: In 2025, 60% of rental and service revenues were derived from customers in the power transmission sector. The company's three largest customers accounted for 19%, 15%, and 10% of total revenues, respectively.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Product Launches</span></strong><span>: NPK International Inc. has launched newer generation matting systems that offer a reduction in weight, utilizing proprietary technology to enhance environmental and safety benefits.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Production Launches</span></strong><span>: The company plans to expand its composite mat production capacity in 2026, with additional capacity expected to come online in the first half of 2027.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Efficiency</span></strong><span>: Throughout 2025, NPK International Inc. focused on efficiency improvements and operating cost optimization, including the rollout of a new cloud-based enterprise resource planning (ERP) system.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: The company intends to continue its strategy of accelerating organic growth through geographic expansion and increasing customer market share, as well as pursuing inorganic growth opportunities to enhance shareholder value.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Growth</span></strong><span>: In 2025, NPK International Inc. pursued accelerated organic growth by expanding its rental business, focusing on larger-scale, longer-term projects, and geographic expansion within the U.S. The company also pursued inorganic growth through the acquisition of Grassform Plant Hire Limited, enhancing its U.K. operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Efficiency</span></strong><span>: Operational efficiency was improved by streamlining the organization and implementing a new cloud-based ERP system.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management</span></strong><span>: The company repurchased 3.0 million shares, representing 4% of its outstanding shares, for $20.4 million under its share repurchase program. It also entered into a new $150 million Credit Facility, replacing its previous asset-based revolving credit agreement, and maintained finance leases primarily related to transportation equipment. The company reported a total debt to capitalization ratio of 4.6% as of December 31, 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: NPK International Inc. plans to invest in expanding its composite mat production capacity, with additional capacity expected to come online in the first half of 2027. The company anticipates capital expenditures of $45 million to $55 million in 2026, primarily focused on expanding its mat rental fleet. It also intends to use existing liquidity to return value to shareholders and pursue long-term strategic initiatives.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Competition</span></strong><span>: NPK International Inc. operates in a competitive market for temporary worksite access solutions, with significant reliance on the power transmission sector, which accounts for a substantial portion of its revenues. The company faces challenges in maintaining its market position against competitors offering alternative products, such as wood mats and stone, and must continue to innovate to retain its competitive edge.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Economic and Market Conditions</span></strong><span>: Fluctuations in infrastructure construction and maintenance spending, particularly in the power transmission and oil and natural gas sectors, could adversely affect demand for NPK's products and services.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Customer Concentration</span></strong><span>: A significant portion of revenues is derived from a small number of large customers, posing a risk if any of these customers reduce their business with NPK.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Manufacturing Capacity Expansion</span></strong><span>: Delays or cost overruns in expanding production capacity could negatively impact financial results.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>International Operations</span></strong><span>: The company's operations in the UK expose it to risks such as political instability, regulatory compliance, and currency fluctuations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Raw Material Prices</span></strong><span>: Dependence on HDPE and potential supply chain disruptions could affect production costs and profitability.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Legal and Regulatory Compliance</span></strong><span>: Compliance with complex international laws and potential changes in environmental regulations could increase operational costs.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Cybersecurity</span></strong><span>: Increasingly sophisticated cyber threats pose a risk to the company's information systems and data integrity.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies</span></strong><span>: Management highlights strategic actions to address these risks, including expanding the rental business, pursuing acquisitions, streamlining operations, and prioritizing investments in rental fleet expansion and manufacturing capacity.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks</span></strong><span>: The company is exposed to market risks, including interest rate risk and foreign exchange risk, which could impact financial performance.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/71829/000007182926000009/nr-20251231.htm\" rel=\"nofollow\" target=\"_blank\">NPK International Inc. [ NPKI ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:dbf980f59de63:0-npk-international-inc-sec-10-k-report/",
            "pub_date": "2026-02-28 03:35:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:ab6e5a776094b:0",
            "title": "Metallic Minerals to Exhibit at PDAC 2026 in Toronto, March 1-4 (Booth 2724)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - </span><strong class=\"root-Tkn6WL2y\"><span>Metallic Minerals Corp. </span><span> (OTCQB: MMNGF) (FSE: 9MM1)</span></strong><span> </span><strong class=\"root-Tkn6WL2y\"><span>(\"Metallic\" </span></strong><span>or the</span><strong class=\"root-Tkn6WL2y\"><span> \"Company\")</span></strong><span> is pleased to be attending the 2026 Prospectors &amp; Developers Association of Canada (\"PDAC\") Convention in Toronto from March 1-4, 2026. </span></p><p class=\"\"><span>The Company will be exhibiting at Booth #2724 at the Metro Toronto Convention Centre under The Metallic Group, shared with Stillwater Critical Minerals Corp. </span><span>. Management will be available to provide updates on the Company's La Plata copper-silver-gold-PGE critical minerals project in Colorado, supported by a strategic investment from Newmont Corporation, as well as its 100%-owned, district-scale Keno Silver project in Yukon, located adjacent to Hecla Mining's Keno Hill operations. </span></p><p class=\"\"><span>Shareholders, investors, and industry participants are invited to visit Booth #2724 to discuss recent progress and upcoming catalysts across Metallic Minerals' portfolio.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Metallic Minerals</span></strong></p><p class=\"\"><span>Metallic Minerals Corp. is a resource-stage exploration and development company advancing copper, silver, gold, platinum group elements, and other critical minerals at the La Plata project in southwestern Colorado, and high-grade silver exploration at the Keno Silver project in the Yukon Territory, adjacent to Hecla Mining's Keno Hill silver operations. The Company is also one of the largest holders of alluvial gold claims in the Yukon and is building a production royalty business through partnerships with experienced mining operators.</span></p><p class=\"\"><span>Metallic is led by a team with a strong track record of discovery and exploration success across multiple precious and base metal deposits in North America and is backed by strategic investment by Newmont Corporation and Eric Sprott. The Company integrates advanced data analytics into its exploration process to support target generation, accelerate discovery, and unlock value across its portfolio.</span></p><p class=\"\"><span>Metallic's project districts have a history of significant mineral production and benefit from existing infrastructure, including road access and nearby power. The Company is committed to responsible and sustainable resource development, engaging and collaborating with Canadian First Nation groups, U.S. Tribal and Native Corporations, and local communities to support long-term project advancement.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Upcoming Events</span></strong></p><p class=\"\"><span>Metallic's management team will be attending several upcoming key industry events over the coming months and welcomes the opportunity to meet with investors and stakeholders:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/1KQXjcRbgy\" rel=\"nofollow\" target=\"_blank\">Metals Investor Forum</a><span> - Toronto, Canada, February 27-28, 2026.</span></li><li class=\"listItem-bmN0_SHH\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/A8qoYUpvGw\" rel=\"nofollow\" target=\"_blank\">PDAC 2026</a><span> - Toronto, Canada, March 1-4, 2026.</span></li><li class=\"listItem-bmN0_SHH\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/ZEjOwTMz2z\" rel=\"nofollow\" target=\"_blank\">Swiss Mining Institute Conference</a><span> - Zurich, Switzerland, March 18-19, 2026.</span></li><li class=\"listItem-bmN0_SHH\"><span>SAFE Summit 2026 - Washington, D.C., USA, April 27-28, 2026.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FOR FURTHER INFORMATION, PLEASE CONTACT:</span></strong></p><p class=\"\"><span>Website: metallic-minerals.com Phone: 604-629-7800</span></p><p class=\"\"><span>Email: info@metallic-minerals.com Toll Free: 1-888-570-4420</span></p><p class=\"\"><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><p class=\"\"></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Statements</span></strong></p><p class=\"\"><span>This news release includes certain statements that may be deemed \"forward-looking statements\". All statements in this release, other than statements of historical facts including, without limitation, statements regarding potential mineralization, historic production, estimation of mineral resources, the realization of mineral resource estimates, interpretation of prior exploration and potential exploration results, the timing and success of exploration activities generally, the timing and results of future resource estimates, permitting timelines, metal prices and currency exchange rates, availability of capital, government regulation of exploration operations, environmental risks, reclamation, title, statements about expected results of operations, royalties, cash flows, financial position and future dividends as well as financial position, prospects, and future plans and objectives of the Company are forward-looking statements that involve various risks and uncertainties. Although Metallic Minerals believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Forward-looking statements are based on a number of material factors and assumptions. Factors that could cause actual results to differ materially from those in forward-looking statements include failure to obtain necessary approvals, unsuccessful exploration results, unsuccessful operations, changes in project parameters as plans continue to be refined, results of future resource estimates, future metal prices, availability of capital and financing on acceptable terms, general economic, market or business conditions, risks associated with regulatory changes, defects in title, availability of personnel, materials and equipment on a timely basis, accidents or equipment breakdowns, uninsured risks, delays in receiving government approvals, unanticipated environmental impacts on operations and costs to remedy same and other exploration or other risks detailed herein and from time to time in the filings made by the Company with securities regulators. Readers are cautioned that mineral resources that are not mineral reserves do not have demonstrated economic viability. Mineral exploration, development of mines and mining operations is an inherently risky business. Accordingly, the actual events may differ materially from those projected in the forward-looking statements. For more information on Metallic Minerals and the risks and challenges of their businesses, investors should review their annual filings that are available at sedarplus.ca. </span></p><p class=\"\"><em><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></em></p></div></section></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:ab6e5a776094b:0-metallic-minerals-to-exhibit-at-pdac-2026-in-toronto-march-1-4-booth-2724/",
            "pub_date": "2026-02-28 03:36:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN15C:0",
            "title": "Argentina's $10 billion river privatization tender gets three bids",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Maximilian Heath</span></p><p class=\"\"><span>Three foreign companies have submitted bids for the contract to dredge and operate Argentina's Parana River, a vital waterway for the country's agricultural exports, Argentine Economy Minister Luis Caputo announced on Friday.</span></p><p class=\"\"><span>The bid opening comes two months after Argentina, a major global food exporter, launched the tender.</span></p><p class=\"\"><span>\"Three bidders have come forward. All are 100% privately-owned companies of international origin, which are prepared to invest an estimated $10 billion in our country over the next 25 years,\" Caputo said in a post on social media.</span></p><p class=\"\"><span>The economy ministry confirmed in a statement that the participating companies were Belgium's Jan De Nul NV and DEME, in addition to Brazil's DTA Engenharia. The ministry said their involvement underscores international interest in Argentina's logistical infrastructure.</span></p><p class=\"\"><span>The terms of the tender explicitly barred state-owned companies from other countries, thereby preventing bids from Chinese firms. </span></p><p class=\"\"><span>Argentina's grain exporters' chamber CIARA-CEC, which collaborated with the government on the bidding specifications, has indicated that this new tender will deepen the Parana River to 40 feet, an increase from its current level of 34 feet.</span></p><p class=\"\"><span>Argentina is the world's leading exporter of soybean oil and meal, and the third-largest exporter of corn.</span></p><p class=\"\"><span>Over 80% of Argentina's agricultural and agro-industrial exports depart the country via the Parana River, flowing from the Rosario agro-industrial hub and surrounding areas to the South Atlantic Ocean. CIARA-CEC anticipates that the contract will be awarded in May.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN15C:0-argentina-s-10-billion-river-privatization-tender-gets-three-bids/",
            "pub_date": "2026-02-28 03:36:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:4821fe5b1094b:0",
            "title": "Beyond Meat Stock Breaches $1 Amid Launch Of New Flavors In Beverage Line",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Beyond Meat launched its beverage line Beyond Immerse in mid-January.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>According to data from Koyfin, three of the seven analysts covering BYND rate it a ‘Hold’ while two each rate it ‘Sell’ or ‘Strong Sell'.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The stock has an average 12-month price target of $1.61, indicating a potential upside of around 70%.</span></li></ul></span></div><span><p class=\"\"><span>Shares of Beyond Meat, Inc. (BYND) rallied 23% on Friday on the heels of the company launching four new flavor variations of its beverage line, Beyond Immerse.</span></p><p class=\"\"><span>The company’s stock hit an intraday high of $1.05 on Friday, before paring back some gains to touch $1.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment around BYND jumped from ‘bullish’ to ‘extremely bullish’ territory over the past 24 hours, while message volume rose from ‘high’ to ‘extremely high’ levels. </span></p><p class=\"\"><span>A Stocktwits user expressed disappointment at the stock breaching the $1 mark only to dip below at the time of writing.</span></p><p class=\"\"><span>https://www.stocktwits.com/BigZe/message/646139778</span></p><p class=\"\"><span>Another, however, dismissed the dip as a “normal correction” and added that the stock will rally again.</span></p><p class=\"\"><span>https://www.stocktwits.com/Riaruena/message/646139586</span></p><p class=\"\"><span>According to data from Koyfin, three of the seven analysts covering BYND rate it a ‘Hold’, while two each rate it ‘Sell’ or ‘Strong Sell'. The stock has an average 12-month price target of $1.61, indicating a potential upside of around 70%.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>New Flavors Lift Sentiment</span></strong></p><p class=\"\"><span>The plant-based meat company added four flavors to its beverage lineup on Thursday: Cherry Berry, Strawberry Lemonade, Piña Colada, and Cucumber Grapefruit, noting that the new flavor launch follows “strong consumer response.” The new flavors will join the current flavor lineup of Peach Mango, Lemon Lime, and Orange Tangerine, and will be available for a limited time at the company’s direct-to-consumer site, it said.</span></p><p class=\"\"><span>“Beyond Immerse represents a meaningful next chapter for our brand as we expand beyond center-of-the-plate protein,” said CEO Ethan Brown. The company launched the beverage line mid-January. </span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/BYND\" rel=\"nofollow\" target=\"_blank\">BYND stock</a><span> has lost 69% of its value over the past 12 months. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:4821fe5b1094b:0/",
            "pub_date": "2026-02-28 03:36:51",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN122:0",
            "title": "US oil output fell in December to lowest since June 2025, EIA says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>U.S. oil production fell for the second consecutive month in December to its lowest level since June last year, while demand reached a multi-month high, the Energy Information Administration said on Friday.</span></p><p class=\"\"><span>Crude oil output averaged 13.66 million barrels per day in December, down about 133,000 bpd from November, the EIA said. That was the largest month-over-month decline in U.S. oil output since January 2025, when adverse weather caused shut-ins at major production centers.</span></p><p class=\"\"><span>The U.S. is the world's top oil-producing nation as well as its top consumer, but analysts have been expecting output to slow in response to the decline in oil prices in recent years. U.S. West Texas Intermediate crude futures were trading near $67 on Friday, compared with about $77.50 at the same time in 2024.</span></p><p class=\"\"><span>Total U.S. petroleum demand rose 624,000 bpd to 20.85 million bpd in December, highest since August, the EIA data showed. Gasoline demand rose 101,000 bpd to 8.78 million bpd in December, while demand for distillate fuels, which include diesel and heating oil, rose 16,000 bpd to 3.81 million bpd, the data showed.</span></p><p class=\"\"><span>Meanwhile, U.S. gross natural gas production from the Lower 48 states rose to a record 135.9 billion cubic feet per day (bcfd) in December, up from the prior all-time high of 134.2 bcfd in November.</span></p><p class=\"\"><span>In top gas-producing states, monthly output in December rose by 1% to a monthly record high of 38.5 bcfd in Texas. Output also rose by 2% to 21.5 bcfd in Pennsylvania, the EIA said.</span></p><p class=\"\"><span>That compares with a prior monthly all-time high of 38.2 bcfd in November in Texas. Pennsylvania's record high of 21.9 bcfd was in December 2021.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN122:0-us-oil-output-fell-in-december-to-lowest-since-june-2025-eia-says/",
            "pub_date": "2026-02-28 03:37:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009306:0",
            "title": "Earnings Could Push the Stock Market Higher. Too Bad About Everything Else. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Teresa Rivas</span></p><p class=\"\"><span>Not two months have gone by since the start of 2026, and the U.S. has seen heightened political tensions with Europe, China, Latin America, and the Middle East; mass protests; two partial government shutdowns; more tariff drama; and the market's spiraling fears about artificial intelligence, just to name some highlights.</span></p><p class=\"\"><span>With all those headlines, investors can be forgiven for forgetting about earnings. Yet the latest round of financial results is one bright spot that might carry stocks to new highs, despite this year's turmoil.</span></p><p class=\"\"><span>With fourth-quarter reporting season largely in the rearview mirror, more S&amp;P 500 companies are beating estimates than the long-term average, and at a higher rate.</span></p><p class=\"\"><span>Those strong results and guidance support Citi strategist Scott Chronert's bullish full-year outlook. Per-share earnings for the index look likely to surpass Citi's $275 estimate for 2025 at this point, thereby making it easier for companies to match or exceed 2026 estimates.</span></p><p class=\"\"><span>In addition, full-year earnings estimates have remained stable for the S&amp;P 500 as a whole. That's particularly encouraging because the fourth-quarter reporting period is when companies typically issue forecasts for the year ahead. Those outlooks tend to be conservative — after all, it's better to underpromise and overdeliver — often leading to estimate cuts. But that hasn't happened this year, outside of a few sectors like energy and healthcare, and those cases likely reflect most or all of the bad news.</span></p><p class=\"\"><span>It's also worth noting that the fourth quarter's earnings wins were spread out across sectors, and not just concentrated among big tech companies. For all the recent worries that AI will destroy whole industries and gobble up tech's cash, Chronert says the ongoing spending boom will boost profits this year. However, \"AI disruption concerns will persist and be reflected more in valuations than in 2026 earnings expectations,\" he warned.</span></p><p class=\"\"><span>Therefore Chronert left his 2026 S&amp;P 500 EPS estimate unchanged at $320, slightly above consensus.</span></p><p class=\"\"><span>Focusing on earnings might ultimately be a way to cut through the increasing noise that has been denting stocks recently. While it's certainly true that AI's impact makes it harder to forecast profits for front-line companies like software firms, the overall picture remains strong. And at the end of the day, solid results have supported much of the rally.</span></p><p class=\"\"><span>The earnings backdrop makes it easier to see how the market could climb higher this year, despite a chaotic news cycle.</span></p><p class=\"\"><span>The S&amp;P 500 is up less than 1% year to date through Thursday's close and has basically gone nowhere since October, a \"near-unprecedented holding pattern,\" notes Mark Hackett, Chief Markets Strategist for Nationwide.</span></p><p class=\"\"><span>Yet that's actually impressive, he says.</span></p><p class=\"\"><span>\"Given the tall wall of worry — AI volatility, Nvidia-driven swings, tariffs, geopolitics and stubborn inflation — you'd expect a sharper drop. Instead, the market is grinding sideways,\" Hackett writes. \"That resilience suggests this is more of a pause than a turning point, and once it clears, the path of least resistance is higher.\"</span></p><p class=\"\"><span>Numbers don't lie, and U.S. companies are still throwing up good ones. That should let the market climb higher, if it weren't for everything else getting in the way.</span></p><p class=\"\"><span>Write to Teresa Rivas at teresa.rivas@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009306:0/",
            "pub_date": "2026-02-28 03:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009308:0",
            "title": "Amphastar Pharmaceuticals Stock Falls as 4Q Profit, Revenue Miss Analyst Estimates",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Kelly Cloonan</span></p><p class=\"\"><span>Amphastar Pharmaceuticals shares declined after the company's fourth-quarter profit and revenue came in below Wall Street's expectations.</span></p><p class=\"\"><span>The stock slid 20% to $21.31 on Friday, on pace for its largest percent decrease since 2022. Shares are down about 32% from 52 weeks ago.</span></p><p class=\"\"><span>The biopharmaceutical company posted a profit of $24.4 million, or 51 cents a share, compared with $38 million, or 74 cents a share, a year earlier.</span></p><p class=\"\"><span>Adjusted earnings per share were 73 cents, compared with estimates of 90 cents a share according to analysts polled by FactSet.</span></p><p class=\"\"><span>Revenue fell 2% to $183.1 million, compared with analyst estimates of $188.8 million.</span></p><p class=\"\"><span>The decrease was due to lower sales of glucagon products, driven by lower average selling price and volumes as a result of competition and a continued shift toward ready-to-use glucagon products, the company said.</span></p><p class=\"\"><span>Write to Kelly Cloonan at kelly.cloonan@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009308:0/",
            "pub_date": "2026-02-28 03:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947678:0",
            "title": "PRFoods: Revenue fell 23% and net loss widened as weak demand persisted, despite UK market stability",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue and profitability declined sharply year-over-year due to weak demand in Estonia and cost pressures, while the UK market remained stable. Debt restructuring extended maturities and reduced interest costs, but net losses widened and liquidity weakened.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947678-402557cb8649359c34def6833e9a3b75\" target=\"_blank\">PRFoods AS [PRF1T] Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947678:0-prfoods-revenue-fell-23-and-net-loss-widened-as-weak-demand-persisted-despite-uk-market-stability/",
            "pub_date": "2026-02-28 03:38:39",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN15V:0",
            "title": "Canadian dollar hits 11-day high as investors shake off GDP data",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Canadian dollar gains 0.4% against the greenback</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Touches an 11-day high at 1.3626</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Canada's fourth-quarter GDP decreases 0.6% on annualized basis</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Ten-year yield approaches three-month low</span></li></ul></span></div><span><p class=\"\"><span>By Fergal Smith</span></p><p class=\"\"><span>    The Canadian dollar clawed back most of its monthly losses against the U.S. dollar on Friday as broad-based declines for the greenback offset domestic data that showed the economy contracting in the fourth quarter.</span></p><p class=\"\"><span>The loonie </span><span> was trading 0.4% higher at 1.3630 per U.S. dollar, or 73.37 U.S. cents, after touching its strongest level since February 16 at 1.3626. Among the Group of 10 currencies, only the safe-haven Swiss franc posted stronger gains.</span></p><p class=\"\"><span>Another safe-haven is gold </span><span>. It rose to nearly a one-month high, supported by geopolitical tensions after the U.S. and Iran extended nuclear talks.</span></p><p class=\"\"><span>\"With gold rallying, the USD has come under pressure and that has helped to propel USD-CAD lower,\" said George Davis, chief technical strategist at RBC Capital Markets, adding that month-end flows could also have helped support the loonie, which was down 0.1% in February.</span></p><p class=\"\"><span>The U.S. dollar edged lower against a basket of major currencies, while the price of oil rose 2.7% to $66.99 a barrel as traders remained on alert for potential supply disruptions. Oil is one of Canada's major exports.</span></p><p class=\"\"><span>Canadian Prime Minister Mark Carney will meet business leaders in Mumbai and start talks on a comprehensive trade agreement, which is expected to be completed by November, Canada's foreign minister told Reuters.</span></p><p class=\"\"><span>    Canada's gross domestic product fell at an annualized pace of 0.6% in the October-December quarter as manufacturers dipped heavily into inventories to meet demand, closing out the slowest year of growth for the country since 2020. Economists and the Bank of Canada had expected a flat reading.</span></p><p class=\"\"><span>\"The Canadian economy continues to struggle and track somewhat weaker than the Bank of Canada's latest MPR (Monetary Policy Report) projections, although some of the underlying detail in today's report was admittedly stronger than the headline figure,\" Andrew Grantham, a senior economist at CIBC Capital Markets, said in a note.</span></p><p class=\"\"><span>Canadian government bond yields eased across the curve, tracking moves in U.S. Treasuries. The 10-year (CA10YT=RR) was down 3.6 basis points at 3.139%, marking its lowest level since November 28.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN15V:0-canadian-dollar-hits-11-day-high-as-investors-shake-off-gdp-data/",
            "pub_date": "2026-02-28 03:38:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009312:0",
            "title": "FS Bancorp Is Maintained at Neutral by DA Davidson",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:39 GMT) </span></strong><span>FS Bancorp Price Target Raised to $46.00/Share From $45.00 by DA Davidson</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009312:0/",
            "pub_date": "2026-02-28 03:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947679:0",
            "title": "TRAXION/A: 2026 guidance targets double-digit growth, lower CapEx, and stable margins amid market recovery",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Completed Solistica integration, maintained leverage, and achieved 2025 guidance. 2026 targets ~10% revenue and EBITDA growth, with lower CapEx and a focus on asset-light operations. Operating cash flow surged, while net income fell due to higher interest and FX impacts.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947679:0-traxion-a-2026-guidance-targets-double-digit-growth-lower-capex-and-stable-margins-amid-market-recovery/",
            "pub_date": "2026-02-28 03:39:16",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:5a09a81f0d95b:0",
            "title": "Film And TV Charity Unveils New Principles To Support Mental Health On Set",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>WASHINGTON (dpa-AFX) - The Film and TV Charity has introduced a new set of guiding principles aimed at promoting mental wellbeing on productions, as part of efforts to address rising stress levels and burnout in the industry.</span></p><p class=\"\"><span>The move follows findings from the charity's Looking Glass survey, which highlighted worsening mental health across the UK film and television sector. Around 35% of participants rated their mental health as 'poor' or 'very poor,' while nearly 30% reported experiencing suicidal thoughts within the last year. Additionally, 63% said their work negatively impacted their mental wellbeing, and 64% had considered leaving the industry due to mental health concerns.</span></p><p class=\"\"><span>The principles focus on building leadership cultures that prioritize well-being, encouraging respectful working relationships, ensuring access to visible mental health support, and carefully managing the challenges posed by sensitive content and interactions with on-screen talent. They also emphasize structured workloads, healthy working patterns, and clearly defined team roles.</span></p><p class=\"\"><span>FTVC chief executive Marcus Ryder said, 'Importantly, we already have the evidence that productions that use the charity's tools to adhere to these principles enjoy better mental health outcomes.</span></p><p class=\"\"><span>'This is a major step towards creating healthier, fairer and more supportive working environments across UK production - and we can lead the way in showing global industry partners how embedding best practice can not only improve worker wellbeing but also deliver positive benefits to businesses too.'</span></p><p class=\"\"><span>Each principle is supported by practical recommendations for producers, department heads, and other decision-makers, which will be accessible through the charity's website. The nine principles represent the first phase of an update to its Whole Picture Toolkit.</span></p><p class=\"\"><span>Sara Putt, Bafta chair and FTVC vice-chair, commented, 'Across every stage of a screen industry career, our Bafta talent programme participants and members tell us the same thing, that instability of freelance jobs, lack of access to training and skills development, the realities of production working conditions and pressures from fewer job opportunities, are not only driving a talent drain, but also having a profound impact on the mental health and wellbeing of our workforce.</span></p><p class=\"\"><span>'As a result, we have put mental health and wellbeing best practice at the centre of our programmes.'</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:5a09a81f0d95b:0-film-and-tv-charity-unveils-new-principles-to-support-mental-health-on-set/",
            "pub_date": "2026-02-28 03:31:05",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006768:0",
            "title": "OpenAI's Sam Altman Calls for De-Escalation in Anthropic Showdown With Hegseth — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Keach Hagey</span></p><p class=\"\"><span>OpenAI Chief Executive Sam Altman waded into the standoff between Anthropic and the Pentagon over the use of AI on the battlefield, telling his staff Thursday evening that the company was working on a deal that might help solve the impasse.</span></p><p class=\"\"><span>Altman in a memo to staff said that the company was working with the Defense Department to see if its models could be used in classified settings in a way that kept the same safety guardrails that have brought its rival Anthropic into a stalemate with the government. Altman said he hoped OpenAI could find a solution that could work for the rest of the industry.</span></p><p class=\"\"><span>No deal has been signed, and the talks could fall through, according to a person familiar with the matter.</span></p><p class=\"\"><span>\"We are going to see if there is a deal with the DoW that allows our models to be deployed in classified environments and that fits with our principles,\" Altman wrote in a note to staff Thursday evening viewed by The Wall Street Journal. \"We would ask for the contract to cover any use except those which are unlawful or unsuited to cloud deployments, such as domestic surveillance and autonomous offensive weapons.\"</span></p><p class=\"\"><span>Altman said he hoped to help broker a peace between the two camps and avoid dangerous precedents for the industry.</span></p><p class=\"\"><span>\"We would like to try to help de-escalate things,\" he wrote.</span></p><p class=\"\"><span>Altman voiced his support for Anthropic's position in principle, even as he acknowledged the government's concerns about a private company having control over significant national-security issues.</span></p><p class=\"\"><span>\"We have long believed that AI should not be used for mass surveillance or autonomous lethal weapons, and that humans should remain in the loop for high-stakes automated decisions. These are our main red lines,\" he wrote.</span></p><p class=\"\"><span>\"We believe this dispute isn't about how AI will be used, but about control. We believe that a private US company cannot be more powerful than the democratically-elected US government, although companies can have lots of input and influence. Democracy is messy, but we are committed to it.\"</span></p><p class=\"\"><span>OpenAI believes it can enforce its red lines practically by adding technical safeguards, like confining models to the cloud rather than so-called edge environments, which would create additional barriers to uses like autonomous weapons. It also hopes to ensure that researchers can obtain security clearances so they can help inform the government about the technology's limitations and risks, the person said.</span></p><p class=\"\"><span>\"We would also build technical safeguards and deploy personnel (FDEs) to partner with the government to ensure things are working correctly, and we would offer similar services to other allied nations,\" Altman wrote. \"If we are successful, perhaps this can be a path that can work for other AI labs, too.\"</span></p><p class=\"\"><span>Earlier on Thursday evening, Anthropic CEO Dario Amodei announced that the company had rejected the Defense Department's demands that it make its technology available for \"all lawful uses,\" insisting that it be able to bar its use for mass domestic surveillance and autonomous weapons.</span></p><p class=\"\"><span>In a post on X, Emil Michael, the undersecretary of war for research and engineering, said that mass surveillance is already illegal under the Fourth Amendment and the department \"won't have any big tech company decide Americans' civil liberties.\"</span></p><p class=\"\"><span>News Corp, owner of The Wall Street Journal, has a content-licensing partnership with OpenAI.</span></p><p class=\"\"><span>Write to Keach Hagey at Keach.Hagey@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006768:0/",
            "pub_date": "2026-02-28 03:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN15B:0",
            "title": "Wall St on course for monthly declines on AI worries, renewed tariff angst, geopolitical strife ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Indexes down: Dow 1.32%, S&amp;P 500 0.77%, Nasdaq 1.21%</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Financials fall on worries over lending standards</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Block surges on plan to cut 4,000 jobs on AI bet</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Netflix climbs after ending Warner Bros Discovery pursuit</span></li></ul></span></div><span><p class=\"\"><span>By Stephen Culp and Ragini Mathur</span></p><p class=\"\"><span>    Wall Street extended its selloff on Friday, as weakness in tech and financial shares helped put the S&amp;P 500 and the Nasdaq on track for their largest monthly percentage losses since March 2025, capping a February marked by worries over costs and disruption related to artificial intelligence, revived tariff uncertainties and simmering geopolitical tensions.</span></p><p class=\"\"><span>All three major indexes were decisively lower, and poised to show steep weekly declines, with the blue-chip Dow on the verge of logging its biggest weekly drop since November.</span></p><p class=\"\"><span>\"February was a terrible month for the Nasdaq, and we saw a rotation into old-economy stocks,\" said Peter Cardillo, chief market economist at Spartan Capital Securities in New York. \"That rotation helped the broader market a little bit.\"</span></p><p class=\"\"><span>Financial stocks </span><span> slid after worries of contagion in the sector after reports that Barclays, Jefferies </span><span>, Wells Fargo </span><span> and other banks face potential losses related to the collapse of UK mortgage provider Market Financial Solutions Ltd, amid broader concerns about lending standards. Wells Fargo, Jefferies and U.S.-listed shares of Barclays </span><span> dropped between 4.2% and 10.8%.</span></p><p class=\"\"><span>Tech shares </span><span> also continued to weigh on the indexes as lingering fears related to AI dragged chips </span><span> and software down 2.0% and 1.9%, respectively.</span></p><p class=\"\"><span>Defensive sectors such as consumer staples </span><span>, healthcare </span><span> and utilities </span><span> were the session's clear outperformers.</span></p><p class=\"\"><span>\"Credit fears are weighing on the banking sector today,\" Cardillo added. \"And of course this continuing AI selloff and the PPI report, which was very ugly. So today we're seeing a flight to safety.\"  </span></p><p class=\"\"><span>On the economics front, a hotter-than-expected Producer Price Index reading fortified expectations that the U.S. Federal Reserve is unlikely to cut its key interest rate in the near term.</span></p><p class=\"\"><span>Financial markets are currently pricing in a 96.1% probability that the central bank will leave the Fed funds target rate in the 3.50% to 3.75% range at its upcoming monetary policy meeting in March, according to CME's FedWatch tool.</span></p><p class=\"\"><span>The Dow Jones Industrial Average </span><span> fell 654.72 points, or 1.32%, to 48,844.48, the S&amp;P 500 </span><span> lost 53.45 points, or 0.77%, to 6,855.41 and the Nasdaq Composite </span><span> lost 277.68 points, or 1.21%, to 22,600.70. </span></p><p class=\"\"><span>Of the 11 major sectors in the S&amp;P 500, energy </span><span> led the gainers with a boost from rising crude prices </span><span>, while financial and technology stocks suffered the steepest percentage losses.</span></p><p class=\"\"><span>Nvidia </span><span> slid 3.4%, extending the previous session's 5.5% drop despite solid earnings, a sign that risk sentiment for all things AI remained shaky.</span></p><p class=\"\"><span>Zscaler </span><span> plunged 12.6% after the cloud security firm reported a wider net loss in the second quarter. </span></p><p class=\"\"><span>Netflix </span><span> jumped 13.0% as investors cheered its decision to exit the fight for Warner Bros Discovery </span><span>, which dropped 2.0%. Paramount Skydance </span><span>, WBD's likely buyer, soared by 23.2%.</span></p><p class=\"\"><span>Block </span><span> surged 14.5% after the payments firm said it would axe nearly half its workforce, as part of its effort to embed AI across operations.</span></p><p class=\"\"><span>Declining issues outnumbered advancers by a 1.56-to-1 ratio on the NYSE. There were 450 new highs and 92 new lows on the NYSE.</span></p><p class=\"\"><span>On the Nasdaq, 1,434 stocks rose and 3,226 fell as declining issues outnumbered advancers by a 2.25-to-1 ratio. </span></p><p class=\"\"><span>The S&amp;P 500 posted 45 new 52-week highs and 2 new lows while the Nasdaq Composite recorded 65 new highs and 104 new lows.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN15B:0-wall-st-on-course-for-monthly-declines-on-ai-worries-renewed-tariff-angst-geopolitical-strife/",
            "pub_date": "2026-02-28 03:32:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009295:0",
            "title": "Sterling Infrastructure Is Maintained at Buy by DA Davidson",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:34 GMT) </span></strong><span>Sterling Infrastructure Price Target Raised to $500.00/Share From $460.00 by DA Davidson</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009295:0/",
            "pub_date": "2026-02-28 03:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008720:0",
            "title": "Palantir Stock Gets an Upgrade. Analysts and Customers See Growth Opportunities. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Mackenzie Tatananni</span></p><p class=\"\"><span>Palantir stock found itself among the casualties of a recent software selloff, but its growth story is intact, UBS analysts say. Don't believe them? Take it from Palantir's customers themselves.</span></p><p class=\"\"><span>In a research note Thursday, UBS upgraded the stock to Buy from Neutral with a $180 price target. Shares ticked 0.5% lower to $135.24 on Friday. The tech-heavy Nasdaq Composite was down 1.1%.</span></p><p class=\"\"><span>Given the 70% revenue growth Palantir achieved in the fourth quarter and its 2026 guidance for 61% growth, \"the consensus view baked into the stock is that at least near-term, the company is facing extraordinary demand,\" analysts wrote. \"As such, bullish checks are expected.\"</span></p><p class=\"\"><span>The firm recommends that investors take advantage of the stock's 35% move off its recent high \"for the premier growth story in software\" that sits at the nexus of artificial intelligence and data, the \"two most powerful spending trends,\" according to UBS.</span></p><p class=\"\"><span>The near-term debate surrounding the shares is whether Palantir can sustain durable growth and whether other players such as Databricks, OpenAI, and Anthropic might arise as challengers.</span></p><p class=\"\"><span>The firm is a longtime supporter of Palantir, even quietly from the sidelines. UBS initiated coverage on the stock in December 2024. At the times, analysts \"were quite positive on the company fundamentals then and ever since.\" Concerns over Palantir's lofty valuation stood in the way of a Buy rating at the time, but those have abated amid a broad-based software selloff.</span></p><p class=\"\"><span>Given lingering concerns that the AI boom has run its course, the analysts may sound overly enthusiastic. Don't believe them? Palantir's customers are just as positive.</span></p><p class=\"\"><span>To underscore their conviction in Palantir's growth story, the firm spoke with several of customers and partners. These conversations \"reaffirmed our view that Palantir is facing significant demand for AI and data software, with use case expansion in the existing customer base and no material emerging competition,\" analysts wrote.</span></p><p class=\"\"><span>One Palantir Vanguard Elite partner pointed to continued opportunities for expansion in the government sector. \"The Army went all in on logistics in Palantir with Vantage,\" the partner said, noting that most other agencies have implemented its software to some degree — including the Space Force and Air Force — and adding cryptically that \"a number of three- or four-letter agencies\" were starting to expand.</span></p><p class=\"\"><span>A second partner noted that many clients turned to Palantir for \"speed to value,\" asserting that the company was \"good at stitching data together,\" which gives it an edge over players like Anthropic, the developer of Claude Code.</span></p><p class=\"\"><span>A third customer working in healthcare IT noted that the Palantir spend would be close to $50 million by the end of the year after starting at the $30 million to $35 million range.</span></p><p class=\"\"><span>Many of the players whose customer relation management software is used in the pharmaceutical industry today \"are not capable of generating these insights,\" the customer said, adding that \"most companies won't leverage their AI capabilities.\"</span></p><p class=\"\"><span>UBS analysts asserted that this view reflects \"the AI disruption bear case on application software,\" with incumbent CRM applications serving merely as data stores that can be accessed by Palantir \"to extract real insights for customers.\"</span></p><p class=\"\"><span>They aren't the only bulls. On Friday, Rosenblatt Securities initiated coverage on shares of the data-analytics company with a Buy rating and $150 price target.</span></p><p class=\"\"><span>Write to Mackenzie Tatananni at mackenzie.tatananni@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008720:0/",
            "pub_date": "2026-02-28 03:26:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003520:0",
            "title": "Duolingo Stock Plummets 20%. Why a Strategy Shake-Up Is Spooking Wall Street. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By George Glover</span></p><p class=\"\"><span>Duolingo stock was plummeting on Friday after the educational technology company said it would sacrifice near-term revenue growth to focus on boosting its user base.</span></p><p class=\"\"><span>Shares tumbled 20% to $93.81 in early trading. The S&amp;P 500 was 0.9% lower as investors carried on ditching risk assets.</span></p><p class=\"\"><span>Duolingo said in a fourth-quarter earnings report filed after Thursday's close that its medium-term goal was to reach 100 million daily active users by 2028, having passed the 50 million level in 2025. User growth decelerated last year.</span></p><p class=\"\"><span>To reach its target, Duolingo said it would prioritize user numbers over near-term revenue growth. It added that it would scale back some monetization initiatives to boost \"top-of-funnel user growth.\"</span></p><p class=\"\"><span>For the current quarter, the company expects revenue of $288.5 million, below the $291.4 million that analysts polled by FactSet were expecting.</span></p><p class=\"\"><span>\"Management believes that a portion of the deceleration in user growth over the course of 2025 could be attributed to the push to monetize, which in turn led to disgruntled users and a meaningful negative impact to 'word-of-mouth' marketing,\" D.A. Davidson analyst Wyatt Swanson, who rates the stock at Neutral, wrote in a research note.</span></p><p class=\"\"><span>\"This guidance for 2026 is meant to fix that issue through an abundance of experimentation and reduced friction for users to have a better experience,\" he added, cutting his price target to $85 from $170.</span></p><p class=\"\"><span>The consensus on Wall Street was that the short-term pain could be worth it if Duolingo does manage to boost its user base.</span></p><p class=\"\"><span>\"While we believe this is the right long-term move, the near-term effect is clear,\" KeyBanc analyst Justin Patterson, who rates the stock at Sector Weight, said.</span></p><p class=\"\"><span>The soft revenue guidance overshadowed a fourth-quarter earnings and revenue beat.</span></p><p class=\"\"><span>Duolingo reported adjusted earnings before interest, taxes, depreciation, and amortization, or Ebitda, of $84.3 billion, as revenue jumped 35% to $282.9 billion. Wall Street was looking for adjusted Ebitda of $78.1 billion on revenue of $276 billion.</span></p><p class=\"\"><span>Write to George Glover at george.glover@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003520:0/",
            "pub_date": "2026-02-28 03:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009267:0",
            "title": "Cable One Is Maintained at Hold by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009267:0/",
            "pub_date": "2026-02-28 03:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009269:0",
            "title": "EMCOR Is Maintained at Buy by DA Davidson",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:29 GMT) </span></strong><span>EMCOR Price Target Raised to $900.00/Share From $800.00 by DA Davidson</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009269:0/",
            "pub_date": "2026-02-28 03:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009271:0",
            "title": "Carlyle Group Is Maintained at Buy by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009271:0/",
            "pub_date": "2026-02-28 03:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN2KP:0",
            "title": "DoubleVerify Holdings Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DoubleVerify Holdings Inc </span><span> reported quarterly adjusted earnings of 18 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 14 cents.  The mean expectation of nineteen analysts for the quarter was for earnings of 16 cents per share. Wall Street expected results to range from 10 cents to 20 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 7.9% to $205.59 million from a year ago; analysts expected $208.76 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DoubleVerify Holdings Inc's reported EPS for the quarter was 18 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of $29.33 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DoubleVerify Holdings Inc shares had fallen by 16.7% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 0.3% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no negative revisions of earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 11 \"strong buy\" or \"buy,\" 9 \"hold\" and 1 \"sell\" or \"strong sell.\" The average consensus recommendation for the software peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for DoubleVerify Holdings Inc is $12.25, about 22.2% above its last closing price of $9.53</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 07:29 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>0.16</span></p></td><td><p class=\"\"><span>0.18</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>0.10</span></p></td><td><p class=\"\"><span>0.06</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.05</span></p></td><td><p class=\"\"><span>0.06</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.02</span></p></td><td><p class=\"\"><span>0.01</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN2KP:0-doubleverify-holdings-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-28 03:29:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSMM6QNa:0",
            "title": "Newsmax Delivers 4 Million+ Viewers in Breakout State of Union Coverage",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BOCA RATON, FL / ACCESS Newswire / February 27, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>Newsmax Inc. </span></strong><span> (\"Newsmax\" or the \"Company\") today announced that more than four million Americans tuned in across the Company's channels for the network's comprehensive live coverage of President Donald Trump's State of the Union address Tuesday night.</span></p><p class=\"\"><span>The coverage marks a major ratings and digital milestone for the Company.</span></p><p class=\"\"><span>Newsmax's coverage began at 6:00pm ET with \"Carl Higbie FRONTLINE\" followed by \"Rob Schmitt Tonight.\"</span></p><p class=\"\"><span>Beginning at 8:00pm ET, the Newsmax network delivered wall-to-wall special coverage anchored live from Washington, D.C., by </span><strong class=\"root-Tkn6WL2y\"><span>Greta Van Susteren</span></strong><span> and </span><strong class=\"root-Tkn6WL2y\"><span>Rob Finnerty,</span></strong><span> with analysis from </span><strong class=\"root-Tkn6WL2y\"><span>Mark Meadows,</span></strong><span> former White House chief of staff, and commentator </span><strong class=\"root-Tkn6WL2y\"><span>Mercedes Schlapp.</span></strong></p><p class=\"\"><span>The special broadcast continued through midnight, providing viewers with in-depth analysis, real-time reactions and exclusive interviews.</span></p><p class=\"\"><span>The Newsmax channel alone drew 2.8 million total viewers Tuesday night, according to Nielsen, while an additional 1.3 million streaming viewers watched coverage on Newsmax2, underscoring the growing reach of the Company's digital platforms.</span></p><p class=\"\"><span>The Newsmax audience was so large on cable that its total audience exceeded the combined viewership of Fox Business, CNBC and NewsNation combined by 23%.</span></p><p class=\"\"><span>Throughout the evening, Newsmax's editorial team provided regular updates to Newsmax.com and engaged the network's more than 23 million social media followers with breaking developments, video highlights and expert commentary.</span></p><p class=\"\"><span>\"The president gave an epic speech, and America tuned in, with a big chunk of his audience tuning into Newsmax,\" said Newsmax CEO Chris Ruddy. \"It was a big night for the president and for us.\"</span></p><p class=\"\"><span>In addition to airing the president's address live, Newsmax offered continual reporting and instant analysis from top newsmakers and commentators.</span></p><p class=\"\"><span>High-profile guests appearing on the network included Speaker of the House </span><strong class=\"root-Tkn6WL2y\"><span>Mike Johnson</span></strong><span>, R-La., Majority Leader </span><strong class=\"root-Tkn6WL2y\"><span>Steve Scalise</span></strong><span>, R-La., Health Secretary </span><strong class=\"root-Tkn6WL2y\"><span>Robert F. Kennedy Jr.</span></strong><span> and HUD Secretary </span><strong class=\"root-Tkn6WL2y\"><span>Scott Turner.</span></strong></p><p class=\"\"><span>Other major figures included Sens. </span><strong class=\"root-Tkn6WL2y\"><span>Rick Scott,</span></strong><span> R-Fla., Markwayne Mullin, R-Okla., </span><strong class=\"root-Tkn6WL2y\"><span>Ron Johnson</span></strong><span>, R-Wis., John Cornyn, R-Texas, </span><strong class=\"root-Tkn6WL2y\"><span>Ted Cruz,</span></strong><span> R-Texas, John Barrasso, R-Wyo. and </span><strong class=\"root-Tkn6WL2y\"><span>Chris Coons</span></strong><span>, D-Del.</span></p><p class=\"\"><span>Additional contributors included </span><strong class=\"root-Tkn6WL2y\"><span>Trish Regan,</span></strong><span> Trump presidential envoy </span><strong class=\"root-Tkn6WL2y\"><span>Richard Grenell</span></strong><span>, presidential pollsters John McLaughlin and </span><strong class=\"root-Tkn6WL2y\"><span>Dick Morris</span></strong><span> and House chairmen </span><strong class=\"root-Tkn6WL2y\"><span>Rep. James Comer</span></strong><span>, R-Ky., and Rep. Jim Jordan, R-Ohio.</span></p><p class=\"\"><span>Other members of Congress appearing included Rep. Anna Paulina Luna, R-Fla., </span><strong class=\"root-Tkn6WL2y\"><span>Rep. Dan Crenshaw</span></strong><span>, R-Texas, Rep. Byron Donalds, R-Fla., </span><strong class=\"root-Tkn6WL2y\"><span>Rep. Brandon Gill</span></strong><span>, R-Texas and Rep. Chip Roy, R-Texas.</span></p><p class=\"\"><span>Newsmax2 also featured live coverage with anchors </span><strong class=\"root-Tkn6WL2y\"><span>Ed Henry</span></strong><span> and </span><strong class=\"root-Tkn6WL2y\"><span>Bianca de la Garza</span></strong><span>, providing viewers with additional perspectives and extended post-speech analysis across streaming platforms.</span></p><p class=\"\"><span>\"Our network coverage was first-rate and was not only on par with major networks but delivered the kind of comprehensive reporting viewers don't see much anymore,\" said Gary Kanofsky, Newsmax's senior vice president of news.</span></p><p class=\"\"><span>\"From our anchors in Washington to our contributors and production teams across the country, this was a total newsroom effort,\" he said.</span></p><p class=\"\"><span>The strong performance reflects Newsmax's continued growth as a trusted destination for millions of Americans seeking live news events, in-depth analysis and diverse perspectives.</span></p><p class=\"\"><span>With expanded distribution across cable, satellite, OTT and streaming platforms, Newsmax continues to solidify its position as one of the nation's leading news networks.</span></p><p class=\"\"><span>Millions of Americans are now watching Newsmax anytime, anywhere by downloading our free app on smartphones and TVs.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Newsmax</span></strong></p><p class=\"\"><span>Newsmax Inc. is listed on the NYSE (NMAX) and operates, through Newsmax Broadcasting LLC, one of the nation's leading news outlets, the Newsmax channel. The fourth highest-rated network is carried on all major pay TV providers. Newsmax's media properties reach more than 50 million Americans regularly through Newsmax TV, the N2 Channel, the Newsmax App, its popular website Newsmax.com, and publications such as Newsmax Magazine. Through its social media accounts, Newsmax reaches over 22 million combined followers. Reuters Institute says Newsmax is one of the top U.S. news brands and Forbes has called Newsmax \"a news powerhouse.\"</span></p><p class=\"\"><span>For more information, please visit Investor Relations | Newsmax Inc.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investor Contacts</span></strong></p><p class=\"\"><span>Newsmax Investor Relations</span></p><p class=\"\"><span>ir@newsmax.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Newsmax Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSMM6QNa:0/",
            "pub_date": "2026-02-28 03:30:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009274:0",
            "title": "LatAm Political, Economic Calendar - Week Ahead",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>All dates are in local time </span><br/><span> </span><br/><span>Sunday, March 1, 2026                                          Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>1000/1500/1000  PER  Jan      ACAE - Advance Economic Activities </span><br/><span>1000/1500/1000  PER  Feb      CPI </span><br/><span>                                 CPI, M/M%                                +0.10% </span><br/><span> </span><br/><span>Monday, March 2, 2026                                          Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>0830/1130/0630  CHI  Jan      IMACEC monthly index of economic activity </span><br/><span>                                 Economic Activity Idx, Y/Y%              +1.7% </span><br/><span>1000/1300/0800  BRA  Feb      Brazil Manufacturing PMI </span><br/><span>                                 PMI, Mfg                                 47.0 </span><br/><span>0900/1500/1000  MEX  Feb      Mexico Manufacturing PMI </span><br/><span>    N/A         COL  Q4       Balance of Payments </span><br/><span>                                 Current Account (USD)                    -2.85B </span><br/><span> </span><br/><span>Tuesday, March 3, 2026                                         Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>0500/0800/0300  BRA  Feb      Fipe Monthly CPI </span><br/><span>                                 CPI, M/M%                                +0.21% </span><br/><span>0900/1200/0700  BRA  Q4       GDP </span><br/><span>                                 GDP, Q/Q%                                +0.1% </span><br/><span>                                 GDP, Y/Y%                                +1.8% </span><br/><span>1000/1500/1000  COL  Jan      External Trade - Exports </span><br/><span>                                 Exports, Y/Y%                            +1.3% </span><br/><span>                                 Exports (USD)                            4.54B </span><br/><span> </span><br/><span>Wednesday, March 4, 2026                                       Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>0900/1200/0700  BRA  Jan      PPI </span><br/><span>1000/1300/0800  BRA  Feb      Brazil Services PMI </span><br/><span>                                 PMI, Services                            51.3 </span><br/><span> </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009274:0/",
            "pub_date": "2026-02-28 03:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:7e09b1a60a9af:0",
            "title": "Dura Publishes its Year-end Report for 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dura reports continued growth and improved profitability for 2025, reflecting solid operational execution and strategic expansion during the year.</span></strong></p><p class=\"\"><span>For the fourth quarter, net sales amounted to 152.3 MSEK and EBIT to 0.4 MSEK. For the full year 2025, net sales amounted to 648.0 MSEK and EBIT to 73.2 MSEK. On a pro forma basis, revenue amounted to 685.3 MSEK and adjusted EBITDA to 100.9 MSEK.</span></p><p class=\"\"><span>CEO Niclas Winberg comments:</span></p><p class=\"\"><span>“2025 was a year of strong execution for Dura. We strengthened our platform, expanded our geographic footprint and continued to build a scalable organisation focused on long-term value creation.</span></p><p class=\"\"><span>We enter 2026 with solid demand and a clear strategic direction. Our priorities remain profitable organic growth, disciplined acquisitions and continued development of the Dura platform.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><span>Niclas Winberg</span></p><p class=\"\"><span>CEO</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:niclas@duragroup.se\" rel=\"nofollow\" target=\"_blank\">niclas@duragroup.se</a></p><p class=\"\"><span>+46 73 578 50 14</span></p><p class=\"\"><span>Alexander Singer</span></p><p class=\"\"><span>CFO</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:alexander@duragroup.se\" rel=\"nofollow\" target=\"_blank\">alexander@duragroup.se</a></p><p class=\"\"><span>+46 73 402 51 86</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/6ca70944-3418-47df-8387-c2bdb74a1a08/dura-sverige-ab-year-end-report.pdf\" rel=\"nofollow\" target=\"_blank\">Dura Sverige AB Year End Report</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:7e09b1a60a9af:0-dura-publishes-its-year-end-report-for-2025/",
            "pub_date": "2026-02-28 03:30:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009273:0",
            "title": "An Ex-Marvel CEO Lists His Home in a Secretive California Community — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Katherine Clarke</span></p><p class=\"\"><span>In a secretive California community where few homes are ever publicly available for sale, a five-bedroom house is hitting the market for $6.9 million.</span></p><p class=\"\"><span>At Smoke Tree Ranch in Palm Springs, homes usually trade quietly between family members and friends. But former Marvel Enterprises CEO Eric Ellenbogen, who purchased the oldest home at Smoke Tree in 2021 for $3.95 million, is bucking that trend by listing the house publicly with Bennion Deville Homes/Luxury Portfolio International.</span></p><p class=\"\"><span>\"We felt strongly that offering the property on the open market would provide the greatest opportunity to identify the right architectural steward, like ourselves,\" said Ellenbogen, 68, who bought the house with his husband, Dominic Ramos-Ruiz.</span></p><p class=\"\"><span>At the foot of the San Jacinto Mountains, Smoke Tree Ranch has a near-mythical status in Palm Springs. Dating to the early 1900s, the ranch has long drawn some of America's wealthiest families, including Walt Disney and the Ford family of the Ford Motor Company. Known for its Wild West feel, the community has dirt roads and unassuming homes, many of which still belong to the families that built them.</span></p><p class=\"\"><span>Ellenbogen's home, built in the 1930s, had been owned by the Gilmore pharmaceutical family for roughly 90 years before he bought it. After the purchase, Ellenbogen worked to have the home successfully designated as a historic landmark by the city of Palm Springs.</span></p><p class=\"\"><span>Sitting on about 1.8 acres, the roughly 5,500-square-foot house surrounds a central courtyard with a large pool, according to the listing agents, Patrick Jordan and Stewart Smith. On the exterior, there are steel casement windows and wood shake shingles.</span></p><p class=\"\"><span>Ellenbogen has bought and sold several Midcentury-Modern homes over the years, including several in Palm Springs: a 1960s house designed by architect William F. Cody, and Twin Palms, which was once owned by Frank Sinatra. He also owned a Los Angeles home designed by Modernist architect Carl Maston, which he sold to \"Glee\" creator Ryan Murphy. Ellenbogen joked that house hopping is his \"unfortunate habit.\"</span></p><p class=\"\"><span>A native Angeleno, Ellenbogen was CEO of Marvel in the late 1990s. After his stint at the comic-book publisher, he co-founded the entertainment company Classic Media, which sold to DreamWorks Animation for $155 million in 2012 and later to NBCUniversal.</span></p><p class=\"\"><span>The Gilmore house was already in great condition when he purchased it, Ellenbogen said, but it took more than two years of research and documentation to secure its landmark status. \"It was not protected, and absent this historical designation could have been torn down or ruined,\" he said.</span></p><p class=\"\"><span>Ellenbogen said he is selling the property because he and Ruiz have other homes around the country, and are spending more time at their home in Spain. \"I did what I set out to do, which was really to protect the property,\" he said.</span></p><p class=\"\"><span>Write to Katherine Clarke at Katherine.Clarke@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009273:0/",
            "pub_date": "2026-02-28 03:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN1VT:0",
            "title": "Truth Social parent explores spinning off social media platform",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Trump Media &amp; Technology Group </span><span> said on Friday it is in discussions with TAE Technologies and Texas Ventures Acquisition III about spinning off businesses including Truth Social into a new publicly traded company.</span></p><p class=\"\"><span>Under the proposal, shares in the spun-off company will be distributed to eligible TMTG shareholders, after which the new entity would merge with the special purpose acquisition company. </span></p><p class=\"\"><span>TMTG said no definitive agreement has been reached and discussions are ongoing.</span></p><p class=\"\"><span>The company's shares were more than 3% down in afternoon trading.</span></p><p class=\"\"><span>In December, TMTG agreed to merge with TAE in an all-stock deal valued at more than $6 billion, marking a pivot toward fusion energy and the creation of a publicly traded company focused on developing utility-scale power plants to help meet rising electricity demand, including from AI data centers.</span></p><p class=\"\"><span>TAE Technologies is a California-based private company developing advanced nuclear fusion technology that has raised more than $1 billion from investors including Alphabet's </span><span> Google and Chevron </span><span>.</span></p><p class=\"\"><span>The startup focuses on a form of fusion designed to produce electricity without releasing large amounts of neutron radiation, reducing radioactive waste.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN1VT:0-truth-social-parent-explores-spinning-off-social-media-platform/",
            "pub_date": "2026-02-28 03:17:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_EMjvDkJa:0",
            "title": "BANK MILLENNIUM SPÓŁKA AKCYJNA - English version (translation) of Annual Consolidated Report of Bank Millennium Capital Group for the 12-month period ending 31st December 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>POLISH FINANCIAL SUPERVISION AUTHORITY</span></p><p class=\"\"><span>UNI - EN REPORT No 2 / 2026</span></p><p class=\"\"><span>Date of issue: 2026-02-27</span></p><p class=\"\"><span>Short name of the issuer</span></p><p class=\"\"><span>BANK MILLENNIUM S.A.</span></p><p class=\"\"><span>Subject</span></p><p class=\"\"><span>English version (translation) of Annual Consolidated Report of Bank Millennium Capital Group for</span></p><p class=\"\"><span>the 12-month period ending 31st December 2025</span></p><p class=\"\"><span>Official market - legal basis</span></p><p class=\"\"><span>Art. 56. 1. 2 of Act on Public Offering</span></p><p class=\"\"><span>Unofficial market - legal basis</span></p><p class=\"\"><span>/-/</span></p><p class=\"\"><span>Contents of the report:</span></p><p class=\"\"><span>Management Board Report on the activity of Bank Millennium and Capital Group of Bank Millennium in</span></p><p class=\"\"><span>2025 (incl. sustainability reporting - ESG); Annual Consolidated Financial Report of the Bank</span></p><p class=\"\"><span>Millennium S.A. Capital Group for the 12-month period ending 31st December 2025;  Supervisory Board</span></p><p class=\"\"><span>Statement (audit); Supervisory Board Statement (reports); Report on the Audit of the Annual</span></p><p class=\"\"><span>Consolidated Financial Statements; Independent Limited Assurance Report - ESG</span></p><p class=\"\"><span>Annexes</span></p><p class=\"\"><span>File Description</span></p><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260227_201848_1990819744_1_ManagementBoardReportMillennium2025.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEM3Sc3Tca\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260227_201848_1990819744_2_MILLENNIUMGROUP_CFS_2025_EN.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEM8qv2Kra\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260227_201848_1990819744_3_StatementoftheSupervisoryBoardofBankMillenniumS.A.-Audit.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEM5j7SPga\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260227_201848_1990819744_4_StatementoftheSupervisoryBoardofBankMillenniumS.A.-annual-reports.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEM1ZV8Q9a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260227_201848_1990819744_Bank_Millennium_Sprawozdanie_z_badania_SSF_31122025_ENG.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEM6QTNXWa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260227_201848_1990819744_EN_Sprawozdanie_BR_z_atestacji_SZR_Bank_Millennium_2025.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEM24d4h3a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_EMjvDkJa:0-bank-millennium-sp-ka-akcyjna-english-version-translation-of-annual-consolidated-report-of-bank-millennium-capital-group-for-the-12-month-period-ending-31st-december-2025/",
            "pub_date": "2026-02-28 03:19:04",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009231:0",
            "title": "Zscaler Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009231:0/",
            "pub_date": "2026-02-28 03:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009225_20260227009225:0",
            "title": "Tevogen Signs Letter Of Intent To Evaluate Potential Acquisition Of A Contract Research Organization >TVGN",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009225_20260227009225:0/",
            "pub_date": "2026-02-28 03:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009229:0",
            "title": "CG Oncology Is Maintained at Buy by HC Wainwright & Co.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:20 GMT) </span></strong><span>CG Oncology Price Target Raised to $80.00/Share From $75.00 by HC Wainwright &amp; Co.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009229:0/",
            "pub_date": "2026-02-28 03:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}