{
    "data": [
        {
            "id": "DJN_DN20250204002006:0",
            "title": "Manila Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in pesos <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Aboitiz Equity Ventures        32.20      31.40      +0.80      +2.55 <br/>  ABS-CBN                         5.23       5.02      +0.21      +4.18 <br/>  Ayala Corp                    557.00     547.00     +10.00      +1.83 <br/>  Ayala Land                     24.60      24.00      +0.60      +2.50 <br/>  Belle Corp                      1.64       1.62      +0.02      +1.23 <br/>  DMCI Holdings                  11.10      10.92      +0.18      +1.65 <br/>  Ginebra San Miguel            272.40     272.40       unch       unch <br/>  Global Ferronickel Hldgs        1.01       1.01       unch       unch <br/>  Global-Estate Resorts           0.59       0.59       unch       unch <br/>  Intl Container Terminal       367.00     341.00     +26.00      +7.62 <br/>  Ionics                          0.87       0.90      -0.03      -3.33 <br/>  JG Summit Holdings             16.00      16.00       unch       unch <br/>  Jollibee Foods                235.00     226.00      +9.00      +3.98 <br/>  Lepanto Consd Mining            0.07       0.07      +0.00      +1.45 <br/>  Lepanto Consld Mining B         0.07       0.07      +0.00      +2.94 <br/>  Lopez Holdings                  2.80       2.84      -0.04      -1.41 <br/>  Manila Electric               478.20     450.00     +28.20      +6.27 <br/>  MegaWorld                       1.77       1.75      +0.02      +1.14 <br/>  Metropolitan Bank &amp; Trust      71.80      67.10      +4.70      +7.00 <br/>  Petron Corp                     2.37       2.39      -0.02      -0.84 <br/>  Philippine National Bank       28.65      28.40      +0.25      +0.88 <br/>  PLDT                        1,350.00   1,310.00     +40.00      +3.05 <br/>  San Miguel Corp                75.00      72.00      +3.00      +4.17 <br/>  SM Prime Holdings              24.25      23.40      +0.85      +3.63 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002006:0/",
            "pub_date": "2025-02-04 16:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9b3jgs:0",
            "title": "Jabra Launches the PanaCast 40 VBS, the First 180-Degree Android-Powered Video Bar Designed for Small Rooms",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Jabra extends its premium collaboration portfolio with PanaCast 40 VBS (Video Bar System), the only small room Android-bar that captures the entire room with 180-degree field of view</li><li class=\"listItem-bmN0_SHH\">The PanaCast 40 VBS has advanced audio technology for exceptional voice clarity with quick and easy installation, ensuring a seamless setup experience</li><li class=\"listItem-bmN0_SHH\">Future-proof investment with flexible deployment options on Microsoft Teams, Zoom, or permanent BYOD setups and managed seamlessly with Jabra+</li></ul><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:600px;aspect-ratio:1\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX9b3jgs-0b265813aee3d2dd846fd5eb103ff308-resized.webp\" type=\"images/webp\"/><img alt=\"Jabra PanaCast 40 VBS\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX9b3jgs-0b265813aee3d2dd846fd5eb103ff308-resized.jpeg\" style=\"background-color:#f1f1f1\"/></picture></div></figure></span></p><p class=\"\">BARCELONA, Spain, Feb.  04, 2025  (GLOBE NEWSWIRE) — ISE — Today, Jabra, the world’s leading professional audio brand, announced the launch of the PanaCast 40 VBS, the only Android-powered video bar designed specifically for small meeting rooms that captures the entire room with 180-degree field-of-view (FoV). This latest innovation builds on the success of Jabra’s PanaCast 50 VBS, bringing the same powerful performance to smaller spaces in a more compact and cost-effective package.</p><p class=\"\">As more organizations transition back to the office and hybrid work environments become the norm, the demand for efficient small meeting space solutions continues to grow. These spaces often pose unique challenges for video collaboration, as traditional solutions struggle to capture all participants equally—particularly those seated closer to the screen—while some lack video conferencing equipment altogether. This imbalance can result in empty meeting rooms and gaps in communication, underscoring the need for solutions that provide clear, inclusive experiences for everyone, regardless of location.</p><p class=\"\">The PanaCast 40 VBS bridges this gap by delivering an all-in-one solution that transforms small meeting rooms into high-performing collaboration hubs. With its wide field of view, exceptional audio quality, and seamless usability, the PanaCast 40 VBS ensures every participant is seen and heard clearly, enabling organizations to fully utilize their small spaces and bring collaboration to new heights.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Redefining collaboration for small spaces</strong></p><p class=\"\">Globally, less than 3% of small meeting spaces, or huddle rooms, are video enabled*, leaving millions of these rooms underutilized and underserved. The PanaCast 40 VBS addresses this challenge with its innovative dual-camera systems, delivering a seamless 180-degree field of view through advanced stitching technology. This ensures full room coverage, making every participant clearly visible on video.</p><p class=\"\">The video capabilities are matched by the advanced audio performance, which stems from the GN group-wide unique sound processing capabilities. The sound is powered by a single high-quality speaker and six microphones with adaptive beamforming. Intelligent audio algorithms enhance sound clarity for exceptional voice pickup, so every word is heard clearly and accurately, fostering more natural and engaging virtual interactions and ensuring remote participants feel fully included.</p><p class=\"\">The PanaCast 40 VBS reimagines what’s possible for huddle rooms, transforming small spaces into comfortable collaboration areas and allowing facility managers to unlock the full potential of these underutilized spaces.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Designed for ease of use and rapid deployment</strong></p><p class=\"\">Designed with simplicity and ease of use at its core, the PanaCast 40 VBS offers a straightforward installation process—from unboxing to mounting to the first meeting. Its intuitive setup ensures that even first-time customers can get their systems up and running in seconds, making collaboration effortless.</p><p class=\"\">New packaging enhances the deployment experience further by allowing provisioning without the need to remove the product from the box. The design also features easy cable routing, reducing installation time. The PanaCast 40 VBS is ideal for quick and easy installations in small rooms, such as Express Install for Microsoft Teams Rooms.<em>  </em></p><p class=\"\">It also ensures a consistent and seamless experience for small meeting spaces by sharing many of the same accessories as its medium room counterpart, the PanaCast 50 VBS. This enables simplified operations for administrators and flexibility across different room sizes, making the PanaCast 40 VBS a versatile and efficient solution for modern office needs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A future-proof investment </strong></p><p class=\"\">The PanaCast 40 VBS is built to adapt to the evolving needs of modern workplaces, particularly for small Android environments. With its certified compatibility for Android environments, it offers flexibility with Zoom, Microsoft Teams, and BYOD deployment options.</p><p class=\"\">To enhance usability and longevity, the PanaCast 40 VBS includes optional accessories such as a touch controller and a detachable faceplate for easy cleaning. It can also be purchased as a bundle, with both the PanaCast 40 VBS and the touch controller included. Seamless integration with ecosystem partners ensures a future-proof investment, complemented by up-to-date manageability through Jabra+ software and the reassurance of Jabra Warranty+ services.</p><p class=\"\">Holger Reisinger, SVP Enterprise Video Business Unit at Jabra said: “The modern workplace is undergoing a transformation, with organizations reimagining how their spaces can drive productivity and collaboration. Small rooms, phone booths and huddle spaces are a cornerstone of this evolution, yet they’ve often been overlooked by traditional video solutions. With the PanaCast 40 VBS, we’re addressing this gap by delivering a flexible, intuitive, and future-proof Android solution that empowers teams to collaborate seamlessly, regardless of room size or platform preference.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key features of the PanaCast 40 VBS include:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Full-room coverage – 180-degree field-of-view with dual cameras and 4x digital zoom</li><li class=\"listItem-bmN0_SHH\">Superior audio – 1 speaker and 6 microphones, enhanced by intelligent audio algorithms for crystal-clear sound and voice pickup</li><li class=\"listItem-bmN0_SHH\">Streamlined setup – New packaging enables provisioning without removing the product from the box</li><li class=\"listItem-bmN0_SHH\">Consistent experience – Shared touch controller and stand with the PanaCast 50 VBS medium room solution for seamless integration across spaces</li><li class=\"listItem-bmN0_SHH\">Effortless installation – Simplified cable routing and protection for easy, clean setup</li><li class=\"listItem-bmN0_SHH\">Flexible deployment – Compatible with Microsoft Teams, Zoom, and BYOD setups</li><li class=\"listItem-bmN0_SHH\">MDEP-based solution (Microsoft Device Ecosystem Platform) – Delivers strengthened security and enhanced meeting experiences</li><li class=\"listItem-bmN0_SHH\">Intelligent Meeting Space – Enables users to personalize and set virtual meeting space boundaries – perfect for open-plan offices or glass-walled rooms</li><li class=\"listItem-bmN0_SHH\">Always up to date – Managed via Jabra+, ensuring the latest features and functionality</li><li class=\"listItem-bmN0_SHH\">Reliability – Backed by Jabra Warranty+ for added peace of mind</li><li class=\"listItem-bmN0_SHH\">Modern design – Clean, professional aesthetic that fits seamlessly into contemporary workspaces</li><li class=\"listItem-bmN0_SHH\">Practical features – Easy-clean cover and ADA compliance for enhanced usability</li></ul><p class=\"\">Jabra PanaCast 40 VBS will be available from Mid-2025. MSRP: $1,499. For more information please visit https://www.jabra.com/panacast40vbs.</p><p class=\"\"><em>*Frost and Sullivan, 2024</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Note to editors</strong> </p><p class=\"\">Hayley Minardi</p><p class=\"\">Manager, PR &amp; Communications, North America</p><p class=\"\">hminardi@jabra.com  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Jabra</strong></p><p class=\"\">Jabra is a world leading brand in audio, video and collaboration solutions – engineered to empower businesses. Proudly part of GN Group, we are committed to bringing people closer to one another and to what is important to them. Jabra engineering excellence leads the way, building on over 150 years of pioneering work within GN. This allows us to create integrated tools for contact centers, offices, and collaboration to help professionals work more productively from anywhere<em>. </em><em>www.jabra.com</em></p><p class=\"\">Founded in 1869, GN Group employs more than 7,000 people and is listed on Nasdaq Copenhagen (GN.CO). GN's solutions are sold in 100 countries across the world.  Visit our homepage <em>GN.com</em><em> or connect with us on </em><em>LinkedIn</em><em>, </em><em>Facebook</em><em>, and </em><em>X</em><em>. </em></p><p class=\"\">© 2024 GN Group. All rights reserved. Jabra® is a registered trademark of GN Group. All other trademarks included herein are the property of their respective owners (design and specifications are subject to change without notice).</p><p class=\"\">Photos accompanying this announcement are available at:</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/fc30d00d-063a-40a9-ad5b-70d4406a3597</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/c026aaa2-62ef-4c1c-9b32-bd137bad8bc4</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/d94cff48-9b76-41f5-81d5-e2143affc28a</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/989c5fb5-678a-4287-b7f3-9f7266ce11c3</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jabra PanaCast 40 VBS is newest in Jabra's PanaCast lineup</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">As part of Jabra’s enhanced Android video bar lineup for small and medium rooms, new Jabra PanaCast 40 VBS delivers the premium features from Jabra PanaCast 50 VBS in a smaller form factor.</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Jabra PanaCast 40 VBS</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Everyone is seen, every voice is heard, no one gets left out with the PanaCast 40 VBS 180-degree field of view.</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Jabra PanaCast 40 VBS</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Meet Jabra's PanaCast 40 VBS, coming mid-2025. The only small room Android video bar solution that captures the entire room. With a 180-degree field of view all meeting participants are seen, heard and included. </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Jabra PanaCast 40 VBS Designed for Small Rooms</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">The new Jabra PanaCast 40 VBS is the only small room Android bar that captures the entire room.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9b3jgs:0-jabra-launches-the-panacast-40-vbs-the-first-180-degree-android-powered-video-bar-designed-for-small-rooms/",
            "pub_date": "2025-02-04 16:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE2VHxd1:0",
            "title": "GN introduces its most intelligent hearing portfolio yet, including ReSound Vivia - the world's smallest AI powered hearing aid",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Built on decades of shared AI research and development across the GN Group, GN has pioneered a unique approach to AI that mimics the brain’s natural sound processing via a new Intelligent Focus feature to create a superior hearing experience in noise.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">This breakthrough technology is packed in the world's smallest rechargeable Receiver-in-Ear hearing aid, (microRIE), ReSound Vivia™ offering all-day battery power and comfort without compromise.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">ReSound Vivia is powered by a dedicated Deep Neural Network (DNN) chip trained on 13.5 million spoken sentences that spotlights speech and eliminates distracting noise, offering the best solution for hearing in noise without cutting people off from the world around them.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">To enable even more people to experience their best-in-class technologies, GN is bringing some of its most advanced features, including Bluetooth® Low Energy (LE) Audio and Auracast™ broadcast audio, to a new essentials range with the launch of ReSound Savi™.</li></ul><p class=\"\">BALLERUP, Denmark, Feb.  04, 2025  (GLOBE NEWSWIRE) — GN, the global leader in hearing aid innovation, today announces the launch of ReSound Vivia, the world's smallest AI powered hearing aid, and ReSound Savi, an essentials range featuring Bluetooth LE Audio and Auracast broadcast audio.</p><p class=\"\">The new ReSound Vivia hearing aids deliver unparalleled sound quality in noisy environments and all-day comfort without compromising size or battery life. Central to this innovation is GN's unique human approach to AI, which models the brain's natural sound processing capability to create voice clarity in complex listening environments. GN's Intelligent Focus feature is distinctive in its ability to respond to the direction a person is looking, ensuring the AI enhances sounds based on the user's natural response to their environment. GN’s proprietary technology provides a more natural and effortless listening experience, even in challenging situations like noisy restaurants or crowded venues.</p><p class=\"\">A new, dedicated Deep Neural Network (DNN) chip enables the superior listening experience. This DNN-powered solution is up to 17 times more efficient than other leading hearing solutions with directionality and DNN noise reduction, resulting in a significant improvement to speech understanding.1 Trained on 13.5 million spoken sentences in various languages and with varied vocal effort, across 3.9 million tuned sound parameters, the DNN can perform 4.9 trillion operations per day to spotlight speech and reduce background noise.</p><p class=\"\">Studies show ReSound Vivia offers the world's best hearing in noise experience, with 64% of users experiencing improved hearing in noisy environments compared to other AI hearing solutions, so they can enjoy conversations with greater ease and understanding.1</p><p class=\"\">All of this advanced technology is packed into the world's smallest AI hearing aid, the ReSound Vivia microRIE. The microRIE style offers 30 hours wear on one battery charge and 20 hours of use for a typical day using a combination of Intelligent Focus and streaming.2 This all-day power ensures users can enjoy uninterrupted hearing and seamless connectivity without compromise.</p><p class=\"\">Brian Dam Pedersen, Chief Technology Officer, Head of Research and Technology at GN, explains: <!-- -->“With ReSound Vivia, we've fundamentally reimagined how AI can enhance the hearing experience. Our unique Intelligent Focus feature mimics natural human behavior, allowing the AI to prioritize sounds based on where the user is looking, not just how loud they are. This creates a far more intuitive and natural listening experience, seamlessly integrating with the user's own perception of their environment. It's not just about amplifying sound; it's about intelligently enhancing the sounds that matter most. And we are not stopping here – all the knowledge, capabilities, and research we have acquired will be applied across other GN products and projects, furthering innovation across the Group.\"</p><p class=\"\">Recognizing the importance of accessibility, GN is launching ReSound Savi to ensure that even more people with hearing loss can experience the latest in connectivity innovation. Both ReSound Vivia and ReSound Savi support Bluetooth LE Audio, including Auracast broadcast audio, the state-of-the-art low-energy connectivity feature. Building on a legacy of seamless connectivity, more people than ever will enjoy new streaming and communication opportunities in public places such as theaters, airports, restaurants, and arenas.  </p><p class=\"\">As part of these launches, GN also introduces the world’s first app which integrates an Auracast Assistant for hearing aids. Connecting to Auracast is now as simple as a single tap in the ReSound Smart 3D™ app. This streamlined process simplifies selecting Auracast streams, even with smartphones and devices that don’t yet have an Auracast assistant built in.</p><p class=\"\">Scott Davis, Hearing division President at GN, describes: <!-- -->\"ReSound Vivia and ReSound Savi represent a significant leap forward. Now you can have it all with ReSound Vivia, which combines world leading sound quality, all-day battery life, and the smallest size on the market for discretion and comfort, so users can hear their best without compromise. With ReSound Savi, we're making our cutting-edge connectivity, including Bluetooth LE Audio and Auracast, accessible to a wider audience. These two product lines demonstrate GN's unwavering commitment to delivering innovation that brings people closer to each other and the things they love to do.\"</p><p class=\"\">GN understands the challenges and specific needs of hearing care professionals. This is why, alongside the launch of ReSound Vivia and ReSound Savi, GN is introducing improvements to fitting software, alignment of domes and receivers for optimal comfort and acoustic performance across the portfolio, and exchangeable mic filters for easy care that improves hygiene and device longevity. These enhancements are designed to streamline clinic workflow, improve fitting accuracy, and ultimately enhance the user experience.</p><p class=\"\">The new ReSound Vivia hearing aids are available in a microRIE rechargeable and two non-rechargeable RIE models, including a CROS model in the microRIE style - all in a wide variety of colors - including the new and elegant Navy Blue and Red. ReSound Savi is available in a new miniRIE rechargeable and two non-rechargeable RIE models in five modern colors. ReSound Vivia and ReSound Savi hearing aids will be rolled out in the US and Germany on 20th February with more markets following, along with the equivalent Beltone Envision™ and Beltone Commence™ line-ups.</p><p class=\"\">For more information, visit the ReSound and Beltone websites.</p><p class=\"\">© 2025 GN Hearing A/S. All rights reserved. ReSound and Beltone are trademarks of GN Hearing A/S. The Bluetooth word mark and logos are registered trademarks owned by Bluetooth SIG, Inc. The Auracast word mark and logos are trademarks owned by Bluetooth SIG, Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Press and the media</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Marie Schleimann Nordlund Director of Communication &amp; CommunityTel: +45 3126 3734</li><li class=\"listItem-bmN0_SHH\">Steen Frentz Laursen Vice President, Group CommunicationTel: +45 45 75 07 21</li></ul><p class=\"\">Investors and analysts</p><p class=\"\">Rune SandagerHead of Investor Relations Tel: +45 45 75 92 57</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">NOTES TO EDITORS</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GN </strong></p><p class=\"\">GN brings people closer through our leading intelligent hearing, audio, video, and gaming solutions. Inspired by people and driven by innovation, we deliver technologies that enhance the senses of hearing and sight. We help people with hearing loss overcome real-life challenges, improve communication and collaboration for businesses, and provide great experiences for audio and gaming enthusiasts.</p><p class=\"\">GN was founded more than 150 years ago with a vision to connect the world. Today, inspired by our strong heritage, GN touches more lives than ever with our unique expertise and the broadest portfolio of products and services in our history – bringing people closer to what is important to them.</p><p class=\"\">We market our solutions with the brands Jabra, ReSound, SteelSeries, Beltone, Interton, BlueParrott, Danavox, and FalCom in 100 countries. Founded in 1869, GN Group employs more than 7,000 people and is listed on Nasdaq Copenhagen (GN.CO). </p><p class=\"\">Visit our homepage GN.com and connect with us on LinkedIn, Facebook and  X.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">References</strong></p><p class=\"\">1 Jespersen, Dieu &amp; Rubachandran (2024) </p><p class=\"\">2 GN Proprietary data on file</p><p class=\"\">Photos accompanying this announcement are available at: </p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/64e0e772-cf35-49ef-8198-92f1e3783997</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/30548b59-a0c3-488c-844c-7559280496bf</p><p class=\"\">A video accompanying this announcement is available at:</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/170d36a8-d637-48a1-8aa6-ef0e0fd54548</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE2VHxd1:0-gn-introduces-its-most-intelligent-hearing-portfolio-yet-including-resound-vivia-the-world-s-smallest-ai-powered-hearing-aid/",
            "pub_date": "2025-02-04 16:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002004:0",
            "title": "Big Endeavor Group Holders Likely to Battle Silver Lake Over Buyout Price, $6 Billion Windfall — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Andrew Bary</p><p class=\"\">A battle could soon play out in Delaware courts between a group of institutional investors in Endeavor Group Holdings and Silver Lake, the tech investment firm, over Silver Lake's deal to buy out public shareholders for $27.50 a share in cash.</p><p class=\"\">Endeavor, which is led by Hollywood superagent Ari Emanuel, counts as its most valuable asset a majority stake in TKO Group Holdings, which owns UFC (Ultimate Fight Championship) and WWE (World Wrestling Entertainment).</p><p class=\"\">Since the $13 billion, take-private deal was unveiled in April 2024, TKO's stock has surged almost 75% to $157 and the value of the TKO embedded in each Endeavor share has risen to nearly $40 a share from $20. There is roughly 0.25 share of TKO embedded in each Endeavor share, based on Wall Street estimates including one from Citigroup analyst Jason Bazinet in a report from December.</p><p class=\"\">Endeavor shares were down 0.5% Monday to $30.44 but trade above the deal price with the transaction expected to close by the end of the current quarter. TKO stock gained 1.2% to $157.05.</p><p class=\"\">Endeavor has other assets including a sports and talent management business including WME (whose core includes the former William Morris Agency) that could be worth another few dollars a share, putting the total value of the company comfortably above $40 a share, according to Roy Behren, co-president of Westchester Capital, which runs the $2 billion Merger Fund, an owner of Endeavor stock.</p><p class=\"\">\"There will be tons of shareholders seeking appraisal,\" he says. \"This is one of the most popular trades in the merger and event-driven community. This is a really unfair transaction for public shareholders,\" Behren says.</p><p class=\"\">As it now stands, Silver Lake and the Endeavor management participating in the take-private deal stand to reap a $6 billion windfall from the rise in TKO stock since the deal was announced last April.</p><p class=\"\">Many Endeavor shareholders want a share of that windfall.</p><p class=\"\">The way it works is that Endeavor holders who feel the takeover price of $27.50 a share undervalues the company can seek appraisal rights in Delaware Chancery Court and ask a judge to grant them more than $27.50 a share. The courts can grant investors more or less than the deal price depending on the judge's ruling.</p><p class=\"\">The deadline for submitting appraisal rights is believed to be Tuesday, Feb. 4, based on a long Endeavor filing in January where it stated the deadline would be 20 days from Jan. 15.</p><p class=\"\">Shareholders who don't plan to seek appraisal rights may want to consider selling their shares because Endeavor stock may fall towards $27.50 after the appraisal deadline.</p><p class=\"\">Silver Lake told Barron's recently in a statement: \"We believe the transaction price is fair and will not increase it.\" Silver Lake declined to comment further and Endeavor had no comment.</p><p class=\"\">A who's who of leading risk-arbitrage and special-situations investors hold Endeavor.</p><p class=\"\">The largest outside investor is Troluce Capital Advisors which recently boosted its stake to 35.5 million shares, a roughly 8% stake in the company. Other holders include Pentwater Capital, a well-regarded firm that engages in takeover arbitrage; and Millennium Management, the multi-strategy firm headed by billionaire Israel (Izzy) Englander. Barron's counts at least 80 million shares — roughly a third of the estimated public float of about 240 million shares, that may seek appraisal rights.</p><p class=\"\">Most of the shareholder holdings are as of Sept. 30, 2024, and it is estimated that more Endeavor shares have since migrated to institutional holders who may exercise appraisal rights. There will be a better sense of the appraisal landscape once big investors release their Dec. 31 holdings around Feb. 14.</p><p class=\"\">The little-known appraisal process isn't normally pursued by investors because of the time and expense involved — a complex process that can take two to three years. It can be tough for individual investors. An Endeavor filing in January states that \"failure to precisely follow\" statutory rules on appraisal rights could doom an investor's ability to pursue them.</p><p class=\"\">In these proceeding, investors argue that the deal price has short-changed them and they often bring experts to buttress their case while a company maintains otherwise. A Delaware Chancery Court judge then renders a decision and investors can get more or less than the deal price.</p><p class=\"\">The key date for determining fairness is the closing date of the transaction, according to a 2022 article by Skadden Arps lawyers and the language of Endeavor's recent filing supports that. This should benefit investors seeking appraisal rights since Endeavor is worth considerably more now than in April 2024 due to the rally in TKO shares.</p><p class=\"\">Often, appraisal cases boil down to dueling estimates of a company's value based on discounted cash flow analysis, which is subjective. But with Endeavor, investors seeking the appraisal rights can point to the easily measurable value of TKO stock. Silver Lake could argue that the TKO stock should be adjusted downward for any taxes that shareholders might incur in a potential distribution.</p><p class=\"\">Another issue that the Delaware courts may weigh in fairness.</p><p class=\"\">While the deal got approval of the Endeavor board, public shareholders weren't given a vote on the transaction.</p><p class=\"\">Such a vote is considered to be good governance and has been regularly employed by control shareholders like media mogul John Malone in deals. In these situations, deals are contingent on the support of the majority of public shareholders unaffiliated with the control holder. The lack of such a vote could help those seeking appraisal rights.</p><p class=\"\">In the Endeavor situation, key management members led by Ari Emanuel will participate in the deal with Silver Lake. Management owns 49 million shares while Silver Lake holds 174 million out of a total of around 470 million.</p><p class=\"\">What obligation does management owe to public holders? It is tough to argue that the current price is fair to holders. As a result, it's possible that the Endeavor board and management may be sued by shareholders for breaching fiduciary obligations to investors.</p><p class=\"\">One plus for shareholders seeking appraisal rights is that they are entitled to get paid interest at five percentage points above a key short rate — resulting in a rate of about 9% from the date the deal closes until a judge's ruling. Given this high rate, some companies make partial payment to those seeking appraisal rights soon after the deal closes, enabling them to save on interest costs.</p><p class=\"\">So what may happen? It's possible that despite its insistence otherwise that Silver Lake boosts the value of its offer for Endeavor in an effort to dissuade investors from seeking appraisal. Silver Lake could stand pat, betting that the potential cost of appraisals is less than paying all public holders more than $27.50. It's also possible that Silver Lake tries to cut a deal with shareholders seeking appraisal rights.</p><p class=\"\">It promises to be an eventful few months for Endeavor and its shareholders. Key events to watch are the disclosure of investor holdings of the company on Feb. 14 and any potential statements from big holders on their intentions.</p><p class=\"\">Write to Andrew Bary at andrew.bary@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002004:0/",
            "pub_date": "2025-02-04 16:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2sRb8z:0",
            "title": "Beltone Debuts Latest Hearing Innovations with Beltone Envision(TM) Hearing Aids –The World’s Best Technology for Hearing in Noise And New Auracast Assistant",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BALLERUP, Denmark, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">Beltone</strong> proudly introduces its latest innovation: <strong class=\"root-Tkn6WL2y\">Beltone Envision™ hearing aids</strong>. Featuring <strong class=\"root-Tkn6WL2y\">the world’s best technology for hearing in noise</strong>1, Beltone Envision sets a new standard in noise management and voice clarity. These hearing aids keep users connected to their surroundings while bringing important sounds, like a friend's voice during a conversation at a busy restaurant, into clear focus.</p><p class=\"\">Only 1 in 5 people who could benefit from hearing aids actually use them, leaving many to miss out on the sounds of life, communicating and socializing2. Representing Beltone’s most advanced hearing technology to date, Beltone Envision hearing aids empower users to connect with family, collaborate with colleagues, and engage fully with their surroundings. These devices intelligently detect the environment, noise levels, and speech cues, automatically adjusting settings for an optimal listening experience. </p><p class=\"\">Everyday noises such as air conditioning, traffic, kitchen sounds, and wind noise can be particularly distracting for those with hearing loss. The artificial intelligence (AI)3 inside Beltone Envision is trained to recognize and suppress thousands of unwanted noises while highlighting the sounds and voices users want to hear, ensuring a clearer and more focused listening experience. Beltone's unique human approach to AI mimics natural behavior, allowing the AI to prioritize sounds based on where the user is looking, not just how loud they are ensuring the user is in control and is the decision maker. A new, dedicated Deep Neural Network (DNN) chip enables the superior listening experience. This DNN-powered solution is up to 17 times more efficient than other leading hearing solutions with directionality and DNN noise reduction, resulting in a significant improvement to speech understanding4.</p><p class=\"\">Available in the <strong class=\"root-Tkn6WL2y\">world’s smallest AI hearing aid</strong>5 and new streamlined RIE (receiver-in-ear) styles, Beltone Envision offers a discreet, modern, and comfortable solution to hearing loss, along <strong class=\"root-Tkn6WL2y\">with the clearest Bluetooth</strong><strong class=\"root-Tkn6WL2y\">®</strong><strong class=\"root-Tkn6WL2y\"> Low Energy (LE) Audio experience ever</strong><strong class=\"root-Tkn6WL2y\">6</strong>, without compromising size, comfort or a full day battery performance. Compatible with Auracast™ broadcast audio, the next generation of assistive listening technology, Beltone Envision helps users stay connected to news and entertainment directly through their hearing aids. Additionally, Beltone is introducing a groundbreaking feature to the highly-rated Beltone HearMax™ app: the <strong class=\"root-Tkn6WL2y\">Auracast Assistant</strong>. This first-of-its-kind feature simplifies the listening experience, enabling users to connect to Auracast broadcasts with just a tap.</p><p class=\"\">Beltone is also launching a new essential range of hearing aids with <strong class=\"root-Tkn6WL2y\">Beltone Commence™</strong><strong class=\"root-Tkn6WL2y\">.</strong> Suitable for individuals with mild to profound hearing loss, Beltone Commence combines innovative technology, updated designs, and future-proof connectivity, including Bluetooth LE Audio and Auracast broadcast audio, offering a powerful hearing solution for all to experience.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key Features of Beltone Envision:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Advanced Noise Management &amp; Voice Clarity: </strong>Utilizing cutting-edge AI technology, Beltone Envision excels at managing and reducing background noise. For example, in a bustling restaurant, these hearing aids can minimize the clatter of dishes and surrounding conversations, allowing users to clearly hear and engage with their companions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">New &amp; Comfortable Designs: </strong>The microRIE style, our smallest option, offers a discreet fit with its gently curved shape, while the updated RIE styles are also ergonomically designed for all-day comfort. Available in a variety of colors, including new Navy Blue and bold Red, these designs cater to personal style preferences.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Effortless Streaming: </strong>Users can easily stream TV audio, music, and more directly to their Beltone Envision hearing aids for crystal-clear sound. Additionally, they can take important phone or video calls hands-free7 while on the go, simply by tapping their ear or device8.</li></ul><p class=\"\">Plus, Beltone Envision and Beltone Commence hearing aids are built to last with an all-over coating that makes them weatherproof and sweatproof, allowing users to enjoy their day regardless of the weather. Available in both rechargeable and replaceable battery styles, the rechargeable option provides all-day power on a single charge9, making these hearing aids perfect for on-the-go lifestyles.</p><p class=\"\">The new Beltone Envision and Beltone Commence hearing aids will be available in the US and Germany starting on February 20, 2025 with more markets following. For more information, please visit <strong class=\"root-Tkn6WL2y\">www.beltone.com</strong><strong class=\"root-Tkn6WL2y\">.</strong></p><p class=\"\">© 2025 GN Hearing A/S. All rights reserved. ReSound and Beltone are trademarks of GN Hearing A/S. The Bluetooth word mark and logos are registered trademarks owned by Bluetooth SIG, Inc. The Auracast word mark and logos are trademarks owned by Bluetooth SIG, Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Press and the media</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Marie Schleimann Nordlund Director of Communication &amp; CommunityTel: +45 3126 3734</li><li class=\"listItem-bmN0_SHH\">Steen Frentz Laursen Vice President, Group CommunicationTel: +45 45 75 07 21</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">NOTES TO EDITORS</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GN </strong></p><p class=\"\">GN brings people closer through our leading intelligent hearing, audio, video, and gaming solutions. Inspired by people and driven by innovation, we deliver technologies that enhance the senses of hearing and sight. We help people with hearing loss overcome real-life challenges, improve communication and collaboration for businesses, and provide great experiences for audio and gaming enthusiasts.</p><p class=\"\">GN was founded more than 150 years ago with a vision to connect the world. Today, inspired by our strong heritage, GN touches more lives than ever with our unique expertise and the broadest portfolio of products and services in our history – bringing people closer to what is important to them.</p><p class=\"\">We market our solutions with the brands Jabra, ReSound, SteelSeries, Beltone, Interton, BlueParrott, Danavox, and FalCom in 100 countries. Founded in 1869, GN Group employs more than 7,000 people and is listed on Nasdaq Copenhagen (GN.CO). </p><p class=\"\">Visit our homepage GN.com and connect with us on LinkedIn, Facebook and X.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Beltone</strong></p><p class=\"\">Beltone is a leading hearing brand based on individual care and technically optimal hearing solutions – sold via 1,500 Beltone branded hearing care stores in the US and via hearing care professional in select other markets. Visit us at Beltone.com and connect with us on LinkedIn.</p><p class=\"\">1 Schumacher &amp; Growth (2025), Cui &amp; Groth (2024), Quilter (2021), GN Proprietary Data on File</p><p class=\"\">2 Deafness and hearing loss. World Health Organization 2022</p><p class=\"\">3 Available only in Beltone Envision microRIE style</p><p class=\"\">4 Jespersen, Dieu &amp; Rubachandran (2024) </p><p class=\"\">5 GN Proprietary Data on File</p><p class=\"\">6 Based on claims by Bluetooth SIG</p><p class=\"\">7 Hands-free calls are available on compatible iOS and Android™ devices. For a list of devices check: https://www.beltone.com/en-us/help-center/compatibility</p><p class=\"\">8 TapControl is available with Beltone Envision microRIEs. Hands-free calls are available on compatible iOS and Android™ devices. For a list of devices check: https://www.beltone.com/en-us/help-center/compatibility</p><p class=\"\">9 Styles with replaceable batteries are also available. GN Proprietary Data on File</p><p class=\"\">Photos accompanying this announcement are available at: </p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/bdd2437f-9f35-4d9b-8f61-908c156fb177</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/9a64b7fd-7882-4c2d-8f8a-5eefc7a967a7</p><p class=\"\">Video accompanying this announcement is available at:</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/14969e92-e197-408e-b37f-4d26aa95cf88</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beltone Envision</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Beltone Envision</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beltone Commence</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Beltone Commence</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2sRb8z:0-beltone-debuts-latest-hearing-innovations-with-beltone-envision-tm-hearing-aids-the-world-s-best-technology-for-hearing-in-noise-and-new-auracast-assistant/",
            "pub_date": "2025-02-04 16:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8l70yF:0",
            "title": "AT&T extends voice core relationship with Nokia to drive new services, faster deployment times, and operational efficiencies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Press Release</p><p class=\"\">AT&amp;T extends voice core relationship with Nokia to drive new services, faster deployment times, and operational efficiencies</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Multi-year expansion deal will support AT&amp;T in delivering on its vision of securely providing customer-focused networks and automation that drive new services, faster deployment times, and operational efficiencies.</li><li class=\"listItem-bmN0_SHH\">Deal includes Nokia 5G IMS Voice Core and Nokia Digital Operations software.</li><li class=\"listItem-bmN0_SHH\">AT&amp;T will utilize Nokia’s voice core applications through the Nokia Cloud Platform to streamline network activities, enhance automation, and minimize manual intervention. </li></ul><p class=\"\">4 February 2025 </p><p class=\"\">Espoo, Finland – AT&amp;T is extending its voice core relationship with Nokia in a multi-year expansion deal that will support the U.S. operator in delivering on its vision of securely providing customer-focused networks and automation that drive new services, faster deployment times, and operational efficiencies.</p><p class=\"\">AT&amp;T is evolving its current Nokia IMS Voice Core to include Voice over New Radio (VoNR). The updated IMS Voice Core is a fully cloud-native architecture that enables flexible scaling and increased automation to improve AT&amp;T’s time to market with new services and yield greater cost savings.</p><p class=\"\">Yigal Elbaz, Senior Vice President, Technology &amp; Network Services at AT&amp;T, said: “With focused execution and investment, AT&amp;T continues to make excellent progress in realizing automation at all levels of its network and service operations. We are pleased to continue our relationship with Nokia to further optimize our network operations and enable new services that better support our customers’ evolving needs.”</p><p class=\"\">The U.S. operator will utilize Nokia’s voice core applications through the Nokia Cloud Platform (NCP) to streamline network activities, enhance automation, and minimize manual intervention. NCP reflects Nokia’s multi-cloud strategy of providing operators with the infrastructure of their choice.</p><p class=\"\">AT&amp;T will also use Nokia Digital Operations software solutions, open and designed for multi-vendor networks, to deliver capabilities that automate the design, delivery, and assurance of customer services at scale.</p><p class=\"\">Raghav Sahgal, President of Cloud and Network Services at Nokia, said: “As a long-time collaborator with AT&amp;T, Nokia fully understands the important journey AT&amp;T is on to enhance automation, reduce complexity, decrease deployment times, and perform operational workflows faster to better serve its customers, and glean more value from its network. Through our network solutions, Nokia will boost AT&amp;T’s network agility, efficiency, and service offerings.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Nokia</strong></p><p class=\"\">At Nokia, we create technology that helps the world act together.</p><p class=\"\">As a B2B technology innovation leader, we are pioneering networks that sense, think and act by leveraging our work across mobile, fixed and cloud networks. In addition, we create value with intellectual property and long-term research, led by the award-winning Nokia Bell Labs.</p><p class=\"\">With truly open architectures that seamlessly integrate into any ecosystem, our high-performance networks create new opportunities for monetization and scale. Service providers, enterprises and partners worldwide trust Nokia to deliver secure, reliable and sustainable networks today – and work with us to create the digital services and applications of the future.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media inquiries</strong></p><p class=\"\">Nokia Press Office</p><p class=\"\">Email: Press.Services@nokia.com </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Follow us on social media</strong></p><p class=\"\">LinkedIn X Instagram Facebook YouTube</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8l70yF:0-at-t-extends-voice-core-relationship-with-nokia-to-drive-new-services-faster-deployment-times-and-operational-efficiencies/",
            "pub_date": "2025-02-04 16:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN2dTLqW:0",
            "title": "The Nomination Committee’s Proposal for a New Board at Stille AB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Stille AB (publ) announces the Nomination Committee's proposal for a new board composition for the 2025 Annual General Meeting. Chairman of the Board Lars Kvarnhem has declined re-election, and Jón Sigurdsson is proposed as the new Chairman of the Board.</p><p class=\"\">The Nomination Committee proposes the re-election of Per Carlsson, Yonna Olsson, Victor Steien, and Jens Viebke, and that Jón Sigurdsson be elected as Chairman of the Board. Lars Kvarnhem has informed the Nomination Committee that he declines re-election.</p><p class=\"\">Jón Sigurdsson is, among other, Chairman of the Board at Vitrolife (publ) and has previously been the CEO of Össur. Jón has extensive experience in both organic and acquisition-driven growth.</p><p class=\"\">The Nomination Committee’s remaining proposals will be presented in the notice for the Annual General Meeting.</p><p class=\"\">The current Nomination Committee at Stille consists of Bengt Julander, appointed by Linc AB, Chairman of the Nomination Committee, Fredrik Strömholm, appointed by Impilo, Leif Almhorn, appointed by SEB Asset Management, and Lars Kvarnhem, Chairman of the Board.</p><p class=\"\">Torshälla, February 4th, 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN2dTLqW:0-the-nomination-committee-s-proposal-for-a-new-board-at-stille-ab/",
            "pub_date": "2025-02-04 16:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN6Rl3Mb:0",
            "title": "Devyser launches a new updated NGS assay to simplify thalassemia testing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Devyser has launched Devyser Thalassemia v2, a next-generation sequencing (NGS) solution designed to further simplify genetic testing. The improved technology, will help broader screening for thalassemia with greater precision in detecting structural variants, saving time and ensuring better results for researchers worldwide.</p><p class=\"\">This product will allow laboratories to achieve rapid, comprehensive results, reducing workflow complexity and enabling efficient genetic profiling through a single assay. Devyser Thalassemia v2 offers a streamlined protocol with minimal hands-on time, empowering labs to deliver reliable and reproducible results consistently.</p><p class=\"\">“The Devyser Thalassemia product is one of our most successful products. With thalassemia affecting millions globally, the market for advanced genetic testing is projected to grow significantly. Devyser Thalassemia v2 positions the company as a leader in this expanding field. Our mission with the next generation of this product is to enable more comprehensive, simpler, and more reliable thalassemia testing for clinical researchers worldwide,” said Theis Kipling, CCO at Devyser. “This product embodies our commitment to providing state-of-the-art solutions for genetic research and advancing the field of thalassemia testing.”</p><p class=\"\">Devyser Thalassemia v2 is currently available globally as a Research Use Only (RUO) product. For product details, visit: https://devyser.com/devyser-thalassemia-v2</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN6Rl3Mb:0-devyser-launches-a-new-updated-ngs-assay-to-simplify-thalassemia-testing/",
            "pub_date": "2025-02-04 16:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN7TCB8L:0",
            "title": "Carnegie Access: OssDsign: Strong sales, again – Q4 initial comment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new flash comment on OssDsign following recent news flow.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/ossdsign/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN7TCB8L:0-carnegie-access-ossdsign-strong-sales-again-q4-initial-comment/",
            "pub_date": "2025-02-04 16:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr71dFYV:0",
            "title": "United Fintech acquires Commercial Banking Applications (CBA) with backing from leading global banks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>United Fintech UK<p class=\"\">United Fintech, the industry-neutral digital transformation platform, has announced the full acquisition of Commercial Banking Applications (CBA), a leading banking technology provider specializing in API-driven trade finance and payments solutions. The acquisition was financed by both equity and debt from existing investors, which include four major banks: BNP Paribas, Citi, Danske Bank, and Standard Chartered. This strategic move marks United Fintech’s entry into the commercial banking segment and represents a significant acquisition.</p><p class=\"\">Expanding into Commercial Banking: Digitizing Legacy Infrastructure for Banks</p><p class=\"\">United Fintech and CBA share a common goal: providing banks with scalable, cutting-edge technology. CBA serves a strong network of leading banks across Europe and Asia, with ABN AMRO standing out as one of its top-tier banking customers. This highlights the trust major financial institutions place in CBA’s cutting-edge solutions. It also demonstrates the strength and reliability of CBA’s solutions in supporting major financial institutions. By integrating CBA’s API-driven trade finance and payments technology, United Fintech enhances its ability to support financial institutions in their digital transformation. This acquisition strengthens automation, efficiency, and security for commercial banks worldwide, ensuring they can seamlessly integrate innovative fintech solutions.</p><p class=\"\">CBA’s expertise in API-based banking technology, combined with United Fintech’s global reach, will drive operational efficiency for financial institutions. United Fintech remains committed to expanding its platform through strategic acquisitions and partnerships, reinforcing its position as a leading fintech provider for banks seeking advanced digital solutions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Reinvestment in United Fintech's Growth</strong></p><p class=\"\">As part of the deal, 15% of the total consideration has been reinvested into United Fintech shares, ensuring that CBA’s employees remain actively engaged in the company’s future. This reinvestment reflects a strong commitment from CBA employees to the long-term vision of United Fintech, reinforcing a shared ambition to drive innovation in commercial banking technology. By aligning interests, this structure allows to leverage the combined expertise and scale solutions for financial institutions worldwide.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Shared Vision for Innovation</strong></p><p class=\"\">Christian Frahm, CEO &amp; Founder of United Fintech, commented: <!-- -->“We are thrilled to welcome CBA into the United Fintech family. CBA has a proven track record of delivering innovative, high-quality solutions that help banks optimize their operations. Their technology perfectly complements our vision of building a comprehensive digital ecosystem for financial institutions. With CBA’s talented team and industry-leading expertise, we are well-positioned to strengthen our digital commercial banking roadmap.”</p><p class=\"\">Rolf Hauge, CEO &amp; Founder of CBA, expressed his enthusiasm about becoming part of United Fintech: <!-- -->“Joining United Fintech is an exciting new chapter for CBA. Our technology stack aligns seamlessly with United Fintech’s strategy, and this partnership will enable us to scale our solutions globally. Additionally, becoming a United Fintech shareholder reflects our long-term commitment to driving innovation in the financial services industry.”</p><p class=\"\">-END-</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact ·</strong> For more information, please contact rossen@unitedfintech.com or +45 20729972.</p><p class=\"\">https://news.cision.com/united-fintech-uk/r/united-fintech-acquires-commercial-banking-applications--cba--with-backing-from-leading-global-banks%2Cc4100031</p><p class=\"\">CBA and UF horizontal dark with line</p><p class=\"\">CBA and UF horizontal light blue with line</p><p class=\"\">Christian Frahm - CEO and Founder of United Fintech</p><p class=\"\">Rolf Hauge CEO CBA</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr71dFYV:0-united-fintech-acquires-commercial-banking-applications-cba-with-backing-from-leading-global-banks/",
            "pub_date": "2025-02-04 16:00:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE7bJKR0:0",
            "title": "EAACI-ESCD Skin Allergy Meeting (SAM) 2025: Pioneering Innovations in Skin Allergy and Contact Dermatitis",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ZURICH, Feb.  04, 2025  (GLOBE NEWSWIRE) — The Organising Committee is delighted to announce the seventh edition of the <strong class=\"root-Tkn6WL2y\">EAACI-ESCD Skin Allergy Meeting (SAM),</strong> Europe’s leading event dedicated to skin allergies. This year, SAM 2025 will take place in person in<strong class=\"root-Tkn6WL2y\"> Bilbao, Spain, from March 27th to 29th</strong>, providing a unique platform for clinicians, researchers, and healthcare professionals to explore the latest breakthroughs and advancements in skin allergy research, diagnosis, and treatment.</p><p class=\"\">The meeting’s opening day will feature an exciting<strong class=\"root-Tkn6WL2y\"> Joint Session </strong>by <!-- -->Sociedad Española de Alergología e Inmunología Clínica (SEAIC) and<!-- --> Sociedade Portuguesa de Alergologia e Imunologia Clínica (SPAIC) titled <!-- -->“Cracking the Code of Contact Dermatitis: The Importance of Standard Batteries” moderated by María José Torres, EAACI President and André Moreira, EAACI Vice-president Congresses. This insightful session will delve into the evolving science and clinical application of standard allergen batteries in patch testing. Attendees will gain valuable insights into the latest updates, regional differences, and their impact on effectively diagnosing and managing contact dermatitis.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SAM 2025 Scientific Programme</strong> is packed with world-renowned experts sharing their insights on critical topics, including atopic dermatitis, urticaria, cutaneous drug allergy, food and the skin, angioedema, and pediatric contact dermatitis. Keynote lectures and in-depth sessions will provide opportunities to explore individualised treatment strategies, including the role of biologicals and targeted therapies in managing complex cases like ocular involvement in atopic dermatitis.</p><p class=\"\">This EAACI focused meeting aims to foster collaboration, spark enriching discussions, and inspire innovative joint research and clinical initiatives. Attendees will have the chance to connect with peers and leading experts to advance their understanding of skin allergy and related conditions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Registration and Further Information</strong></p><p class=\"\">Visit <strong class=\"root-Tkn6WL2y\">SAM 2025</strong> to explore the full program and access the registration form. Stay updated on EAACI’s social media channels for event news.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About EAACI</strong></p><p class=\"\">The European Academy of Allergy and Clinical Immunology (EAACI) is the leading professional organisation dedicated to excellence in allergy and clinical immunology. Learn more at https://eaaci.org.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">communications@eaaci.org</p><p class=\"\">+41 44 205 55 33</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/41af57ba-5085-4ff7-bd6e-8b5a9bc54c6e</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE7bJKR0:0-eaaci-escd-skin-allergy-meeting-sam-2025-pioneering-innovations-in-skin-allergy-and-contact-dermatitis/",
            "pub_date": "2025-02-04 16:00:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXb6nK9m:0",
            "title": "Hi-View Resources Appoints CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VANCOUVER, British Columbia, Feb.  04, 2025  (GLOBE NEWSWIRE) — <!-- -->Hi-View Resources Inc. (‘Hi-View' or the ‘Company’) (CSE: HVW; OTCQB: HVWRF; FSE: B63) announces it has appointed Mr. Robert “Nick” Horsley to the role of CEO. Mr. Horsley has over 20 years of public markets experience in finance, investor relations, marketing, management, and merger &amp; acquisitions. Mr. Horsley has served as a director and a consultant to several public and private companies and has experience in a variety of industries including mineral exploration, telecom, CPG, Esports, and technology.</p><p class=\"\">Howard Milne will remain President of the Company.</p><p class=\"\">Hi-View Resources CEO, R. Nick Horsley states: “<!-- -->It’s an exciting time in the Toodoggone district with Amarc’s AuRoRa discovery and Thesis and TDG advancing their projects rapidly. Hi-View’s properties are contiguous to Amarc, Thesis and TDG’s projects and we have multiple targets and are fully drill permitted.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Hi-View Resources Inc.</strong></p><p class=\"\">Hi-View is a mineral exploration company focused on the acquisition, exploration and development of mineral properties in Canada and the USA. The Company, through its subsidiary holds a 100% interest in the newly acquired Babine Copper-Gold property as well as interests in the Golden Stranger Property and the Lawyers West, East, South projects, together with claims acquired directly through staking, all located in the Toodoggone region of northern BC, prospective for gold, silver, and copper. The collective holdings with the Babine property cover 9,749 hectares.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\">Hi-View Resources Inc.</p><p class=\"\">Howard Milne, President</p><p class=\"\">Email: hdmcap@shaw.ca </p><p class=\"\">Telephone: (604) 377-8994</p><p class=\"\">Website: www.hiviewresources.com  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">FORWARD LOOKING STATEMENTS: </strong></p><p class=\"\">This news release includes certain statements that may be deemed “forward-looking statements”. All statements in this new release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words “expects”, “plans”, “anticipates”, “believes”, “intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Forward-looking statements in this news release includes statements related to the proposed Transaction and related matters. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include market prices, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company’s management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</p><p class=\"\">Neither the Canadian Securities Exchange nor its Regulation Services Provider accepts responsibility for the adequacy or accuracy of this release.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXb6nK9m:0-hi-view-resources-appoints-ceo/",
            "pub_date": "2025-02-04 16:01:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6BWll2:0",
            "title": "Check Point Announces New AI-Powered Innovations to Bolster Unified Security Management for the Infinity Platform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VIENNA, Feb.  04, 2025  (GLOBE NEWSWIRE) — Check Point Software Technologies Ltd. , a pioneer and global leader of cyber security solutions, today announced new Infinity Platform capabilities to accelerate zero trust, strengthen threat prevention, reduce complexity, and simplify security operations.</p><p class=\"\">“We live in a hyperconnected, digital world with new cyber threats emerging every day,” said Nataly Kremer, Chief Product Officer at Check Point. “Meanwhile, security teams are struggling to adequately prevent cyber-attacks due to complex and siloed security solutions. We are pleased to introduce several new AI-powered Innovations that cut down complexity and strengthen the Unified Security Management capabilities of the Infinity Platform. Our customers will experience enhanced threat prevention, while finding it very easy to collaborate with third-party products.”</p><p class=\"\">Many organizations rely on a siloed security approach. IT teams are tasked with deploying security tools that are designed to provide a specific type of protection across the network, endpoints, email, and cloud environments. This siloed approach requires dozens of systems to manage, which leads to operational challenges, fragmented policies, and security gaps for IT teams. At the same time, cyber-attacks increased 44% year-over-year, placing extreme pressure on security teams.</p><p class=\"\">The siloed nature of hybrid environments demands that security teams review and reconcile policies and processes across dozens of systems and tools. These tasks are often performed manually, slowing down operations and leading to gaps in zero trust, threat resolution, and infrastructure management, resulting in a heightened risk of cyberattacks and system failures. Check Point’s six new and improved AI-powered innovations accelerate operations and supercharge threat prevention in three ways:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Unified Identity &amp; Policy</strong></p><p class=\"\">By leveraging AI and identity awareness, administrators can implement more effective and granular security policies, ensuring that only authorized users have access to critical resources. Unifying visibility and analysis of policies across environments enables security teams to maintain security hygiene and compliance.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Quantum Policy Insights  <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Analyzes existing policies and recommends policy changes to improve security posture</li><li class=\"listItem-bmN0_SHH\">Enforces zero trust by eliminating overly permissive access and conflicting policies</li></ul> </li><li class=\"listItem-bmN0_SHH\">Quantum Policy Auditor  <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Ensures alignment with corporate security guidelines</li><li class=\"listItem-bmN0_SHH\">Identifies policies that violate organizational guidelines using a policy visualization UI</li><li class=\"listItem-bmN0_SHH\">Analyzes thousands of rules in seconds, saving security and audit teams weeks of tedious labor by synthesizing complex policies/rules into powerful business-level graphical insights</li></ul> </li><li class=\"listItem-bmN0_SHH\">Infinity Identity  <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cloud service that manages centralized identity across the Infinity Platform</li><li class=\"listItem-bmN0_SHH\">Seamlessly integrates with third party identity providers</li><li class=\"listItem-bmN0_SHH\">Adds support for new identity sources: Microsoft Defender, Microsoft Intune and Harmony Endpoint </li></ul> </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Collaborative Threat Prevention</strong></p><p class=\"\">AI can help organizations identify and block threats across multiple enforcement points in real-time, eliminating human error and reducing time to remediation.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Infinity Playblocks  <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Provides security automation and orchestration across Infinity Platform and 3rd parties</li><li class=\"listItem-bmN0_SHH\">Extends the reach of siloed security solutions to stop attacks across the enterprise</li><li class=\"listItem-bmN0_SHH\">100+ out of the box playbooks including threat prevention, auto remediation, reporting, and more</li><li class=\"listItem-bmN0_SHH\">Enables enterprises to easily create custom playbooks using natural language GenAI</li></ul> </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operational Simplicity</strong></p><p class=\"\">AI-based insights can minimize tedious, error prone work to streamline operations across the entire security stack. This results in improved zero trust, better lifecycle management, and less infrastructure downtime.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Infinity AIOps  <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">AI agent proactively monitors gateways to predict and help mitigate failures in advance</li><li class=\"listItem-bmN0_SHH\">Provides real-time monitoring of security infrastructure health, including CPU, memory utilization, and more</li></ul> </li><li class=\"listItem-bmN0_SHH\">Infinity AI Copilot  <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Chat-based GenAI assistant knows an organization’s policies, access rules, objects, and logs, as well as all product documentation.</li><li class=\"listItem-bmN0_SHH\">Provides contextualized and comprehensive answers to security admins, IT departments, and security operations teams, accelerating security administration and improving incident mitigation and response.</li><li class=\"listItem-bmN0_SHH\">Powerful, time saving entry point for automation/collaboration across entire Infinity Platform</li></ul> </li></ul><p class=\"\">Learn more about AI Security Management: https://www.checkpoint.com/ai-unified-security-management/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Follow Check Point via:</strong></p><p class=\"\">LinkedIn: https://www.linkedin.com/company/check-point-software-technologies</p><p class=\"\">X (formerly Twitter): https://www.twitter.com/checkpointsw</p><p class=\"\">Facebook: https://www.facebook.com/checkpointsoftware</p><p class=\"\">Blog: https://blog.checkpoint.com </p><p class=\"\">YouTube: https://www.youtube.com/user/CPGlobal</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Check Point Software Technologies Ltd.  </strong></p><p class=\"\">Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading AI-powered, cloud-delivered cyber security platform provider protecting over 100,000 organizations worldwide. Check Point leverages the power of AI everywhere to enhance cyber security efficiency and accuracy through its Infinity Platform, with industry-leading catch rates enabling proactive threat anticipation and smarter, faster response times. The comprehensive platform includes cloud-delivered technologies consisting of Check Point Harmony to secure the workspace, Check Point CloudGuard to secure the cloud, Check Point Quantum to secure the network, and Check Point Infinity Platform Services for collaborative security operations and services.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Legal Notice Regarding Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements. Forward-looking statements generally relate to future events or our future financial or operating performance. Forward-looking statements in this press release include, but are not limited to, statements related to our expectations regarding future growth, the expansion of Check Point’s industry leadership, the enhancement of shareholder value and the delivery of an industry-leading cyber security platform to customers worldwide. Our expectations and beliefs regarding these matters may not materialize, and actual results or events in the future are subject to risks and uncertainties that could cause actual results or events to differ materially from those projected. The forward-looking statements contained in this press release are also subject to other risks and uncertainties, including those more fully described in our filings with the Securities and Exchange Commission, including our Annual Report on Form 20-F filed with the Securities and Exchange Commission on April 2, 2024. The forward-looking statements in this press release are based on information available to Check Point as of the date hereof, and Check Point disclaims any obligation to update any forward-looking statements, except as required by law.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>MEDIA CONTACT:</td><td>INVESTOR CONTACT:</td></tr><tr><td>Liz Wu</td><td>Kip E. Meintzer</td></tr><tr><td>Check Point Software Technologies</td><td>Check Point Software Technologies</td></tr><tr><td>press@us.checkpoint.com</td><td>ir@us.checkpoint.com</td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6BWll2:0-check-point-announces-new-ai-powered-innovations-to-bolster-unified-security-management-for-the-infinity-platform/",
            "pub_date": "2025-02-04 16:01:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN6Crftn:0",
            "title": "Carnegie Access: Norsk Titanium: All targets confirmed – H2 first take",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new flash comment on Norsk Titanium following recent news flow.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/norsk-titanium/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN6Crftn:0-carnegie-access-norsk-titanium-all-targets-confirmed-h2-first-take/",
            "pub_date": "2025-02-04 15:50:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001932:0",
            "title": "Crest Nicholson Pretax Loss Widens on Higher Costs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anthony O. Goriainoff</p><p class=\"\">Crest Nicholson said its pretax loss widened after booking higher costs, and that it was mindful of current macroeconomic uncertainty.</p><p class=\"\">The London-listed housebuilder said Tuesday that pretax loss for the year ended Oct. 31 was 143.7 million pounds ($178.9 million), compared with a loss of 23.1 million pounds the year before. The company booked an exceptional pretax charge of 166.1 million pounds related to fire-remediation provisions.</p><p class=\"\">Revenue fell to 618.2 million pounds from 657.5 million pounds, as home completions fell to 1,873 from 2,020 the year prior. The company said this was due to a weak order book at the start of the fiscal year on low levels of confidence in the housing market.</p><p class=\"\">The company said that at the end of January its forward order book for fiscal 2025 had 1,051 units.</p><p class=\"\">The board proposed a final dividend of 1.2 pence a share, down from 11.5 pence a share for fiscal 2023, taking the total for the year to 2.2 pence, down from 17 pence.</p><p class=\"\">For the fiscal year ahead the company guided for pretax profit in the 28 million to 38 million pounds range.</p><p class=\"\">\"With our initiatives and the anticipated stabilization of the macroeconomic environment, we believe we are well-positioned to navigate this evolving landscape effectively,\" it said.</p><p class=\"\">Write to Anthony O. Goriainoff at anthony.orunagoriainoff@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001932:0/",
            "pub_date": "2025-02-04 15:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463297:0",
            "title": "Vodafone Group Kicks Off EUR480 Million Share Buyback",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vodafone Group  on Tuesday launched a share buyback program of up to 480 million euros, according to a same-day filing. </p><p class=\"\">The British telecommunications company is looking to reduce its share capital by buying back up to 4,053,092,397 shares on the London bourse under the scheme. The program will run until May 19, with the targeted shares to be held in treasury and then either canceled or used for employee share rewards.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463297:0/",
            "pub_date": "2025-02-04 15:51:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463305:0",
            "title": "Bravida Bags DKK86 Million Contract to Install Electricity Supply Line in Denmark",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bravida  said Tuesday its Denmark unit secured a contract worth 86 million Danish kroner to install a new electricity supply line in Frederiksberg. </p><p class=\"\">The new 132-kilovolt cable will replace old oil and gas boilers, allowing renewable district heating in the city. Danish transmission company Centralkommunernes Transmissionsselskab is commissioning the project. </p><p class=\"\">The Swedish multi-technical services company will oversee the planning, design, dimensioning and delivery of the cable as part of the contract. Work will begin in March 2025, with entire project completion anticipated by mid-2027.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463305:0/",
            "pub_date": "2025-02-04 15:53:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0F5:0",
            "title": "Safari Industries (India) Dec-Qtr Consol PAT 311.4 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Safari Industries (India) Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAFARI INDUSTRIES (INDIA) DEC-QUARTER CONSOL PAT 311.4 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAFARI INDUSTRIES (INDIA) DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 4.43 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0F5:0-safari-industries-india-dec-qtr-consol-pat-311-4-mln-rupees/",
            "pub_date": "2025-02-04 15:53:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001960:0",
            "title": "Team Internet Performance Hurt by Search Unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Ian Walker</p><p class=\"\">Team Internet Group said it expects to report lower earnings for last year due mainly to its search unit, which faced challenging market conditions in the second half of the year.</p><p class=\"\">The U.K. media company--which is in 315.2 million pound ($392.4 million) takeover talks with Verdane Fund Manager--said Tuesday that it expects to report gross revenue for the year of $803 million compared with $837 million, and net revenue of $188 million compared with $191 million. Adjusted earnings before interest, taxes, depreciation and amortization is expected to be $92 million compared with $96 million.</p><p class=\"\">Within this, the search unit's gross revenue fell 11% to $537 million, net revenue fell 15% to $91 million, and adjusted Ebitda fell 24% to $56 million.</p><p class=\"\">Team Internet said, despite headwinds for the search business, the group has prioritized improved customer experience and brand trust over volume growth to strengthen long-term sustainability.</p><p class=\"\">\"We are confident that our search division's transition into a more content-rich consumer experience will ultimately set up the division for sustainable long-term growth,\" Chief Executive Michael Riedl said.</p><p class=\"\">The company ended the year with record cash flow of $95 million, it said.</p><p class=\"\">Separately, Team Internet said that the U.K. Takeover Panel has agreed to an extension for Verdane to make an offer for the company or walk away until March 4 so that the two companies can continue due diligence, negotiations over the terms of a deal, and other pre-conditions.</p><p class=\"\">On Jan. 7, the company said that it received takeover approaches from TowerBrook Capital Partners and Verdane worth 125 pence a share in cash. Since then, TowerBrook has withdrawn its proposal.</p><p class=\"\">Team Internet shares closed at 103.40 pence on Monday. They are currently up 9.9% over the year to date and 15% higher over the past month.</p><p class=\"\">Write to Ian Walker at ian.walker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001960:0/",
            "pub_date": "2025-02-04 15:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001959:0",
            "title": "Smirnoff Vodka Maker Diageo Scraps Midterm Guidance on Uncertainty in Key Markets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Andrea Figueras</p><p class=\"\">U.K. spirits maker Diageo scrapped its midterm outlook, citing macroeconomic and geopolitical uncertainty in key markets affecting the pace of recovery.</p><p class=\"\">The owner of Johnnie Walker, Guinness and Smirnoff said Tuesday that it has withdrawn its target of organic net sales growth between 5% and 7%.</p><p class=\"\">\"We remain confident in both the favorable long-term industry fundamentals and our ability to outperform the market,\" it said.</p><p class=\"\">For the second half of fiscal 2025, the company had expected to build on the momentum during the first six months and deliver a sequential improvement in organic net sales growth. However, the implementation of tariffs in the U.S. could affect this goal.</p><p class=\"\">As for organic operating profit growth, the group said it will assess the effect of levies and update as appropriate.</p><p class=\"\">For the first half of its fiscal year, the group booked net sales of $10.90 billion in the six months to Dec. 31, beating analysts' estimates of $10.72 billion, according to consensus estimates provided by the company. Sales grew 1% organically on year.</p><p class=\"\">Operating profit stood at $3.155 billion, 5% lower compared with the prior-year period and below analysts' projections of $3.31 billion.</p><p class=\"\">Write to Andrea Figueras at andrea.figueras@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001959:0-smirnoff-vodka-maker-diageo-scraps-midterm-guidance-on-uncertainty-in-key-markets/",
            "pub_date": "2025-02-04 15:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001963:0",
            "title": "Eurozone Bond Yields Rise as Trump Pauses Tariffs on Mexico, Canada — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Eurozone 10-year government bond yields edge higher, tracking U.S. Treasury yields after the latest twist in President Trump's tariff policy. Trump agreed to postpone the tariffs on Mexico and Canada for a month after talks with the leaders of both countries. Ten-year eurozone bond yields rise about 3 basis points across the board, with the Bund yield up at 2.417%, according to Tradeweb. Eurozone rates are likely to continue to be sensitive to growth risks, ING's Padhraic Garvey and Michiel Tukker say in a note. \"Especially the front end may find itself even lower in the near term,\" the rates strategists say. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001963:0/",
            "pub_date": "2025-02-04 15:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0MH:0",
            "title": "India's Mishra Dhatu Nigam gains after Q3 earnings jump",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Mishra Dhatu Nigam Ltd  climb 2.2% to 305.75 rupees</p><p class=\"\">** State-owned defence firm's Q2 profit doubles to 255.2 million rupees, helped by 13% drop in expenses</p><p class=\"\">** MISR supplies steel to defence and aerospace clients</p><p class=\"\">** Stock was flat ahead of results</p><p class=\"\">** More than 1.3 mln shares traded in stock's busiest session in 2 months</p><p class=\"\">** MISR dropped 2.7% in January, same as India's top state-owned stocks (.NIFTYPSE)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0MH:0-india-s-mishra-dhatu-nigam-gains-after-q3-earnings-jump/",
            "pub_date": "2025-02-04 15:54:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV08W:0",
            "title": "Euro zone yields rise as markets weigh Trump's tariff plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Euro zone bond yields rose on Tuesday, while investors weighed the impact of U.S. President Donald Trump's tariffs as levies on China came into effect. </p><p class=\"\">Minutes after the U.S. tariffs took effect, China announced it was slapping tariffs on some U.S. imports. Trump on Monday paused levies on Mexico and Canada at the last minute.</p><p class=\"\">Germany's 10-year bond yield (DE10YT=RR), the benchmark for the euro zone bloc, rose 3 basis points (bps) to 2.42%, after falling 7 bps on Monday. </p><p class=\"\">Yields move inversely to prices. </p><p class=\"\">Italy's 10-year yield  was higher by 2.5 bps at 3.527%, and the gap between Italian and German yields (DE10IT10=RR) stood at 110 bps. </p><p class=\"\">Germany's two-year bond yield (DE2YT=RR), which is more sensitive to European Central Bank rate expectations, was up 2 bps at 2.057%. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV08W:0-euro-zone-yields-rise-as-markets-weigh-trump-s-tariff-plans/",
            "pub_date": "2025-02-04 15:55:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU19N:0",
            "title": "Mangalore Chemicals And Fertilisers Dec-Qtr Profit 573.9 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mangalore Chemicals and Fertilisers Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">MANGALORE CHEMICALS AND FERTILISERS DEC-QUARTER PROFIT 573.9 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MANGALORE CHEMICALS AND FERTILISERS DEC-QUARTER TOTAL INCOME 9.75 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU19N:0-mangalore-chemicals-and-fertilisers-dec-qtr-profit-573-9-mln-rupees/",
            "pub_date": "2025-02-04 15:55:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463291:0",
            "title": "HokuHoku Financial's Nine-Month Profit Jumps 48%; Shares Up 9%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hokuhoku Financial Group's  attributable net income surged 48.1% year over year in the fiscal nine months ended Dec. 31, 2024, from 21.0 billion yen, a filing with the Tokyo Exchange said on Monday. </p><p class=\"\">Diluted earnings per share rose to 247.95 yen from 162.78 yen in the comparable period. </p><p class=\"\">Ordinary income was up 4.4% to 151.4 billion yen from 145.1 billion yen a year earlier. </p><p class=\"\">For the year ending March 31, the company expects to book an attributable net income of 35.0 billion yen, ordinary profits of 46.0 billion yen and basic earnings per share of 278.50 yen. </p><p class=\"\">Shares of the financial services group surged over 9% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463291:0/",
            "pub_date": "2025-02-04 15:46:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001859_20250204001915:0",
            "title": "Diageo CFO: Company Will Provide New Midterm Guidance Once There Is More Visibility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001859_20250204001915:0/",
            "pub_date": "2025-02-04 15:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463296:0",
            "title": "Sirius Real Estate to Purchase German Business Park in EUR20 Million Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sirius Real Estate (, SRE.JO) agreed to buy the Reinsberg business park in Saxony, Germany for 20.4 million euros, according to a Tuesday release. </p><p class=\"\">The British business and industrial parks owner said the 75%-occupied property features 37,000 square meters of lettable space.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463296:0/",
            "pub_date": "2025-02-04 15:47:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463300:0",
            "title": "Nippon Kayaku's Attributable Profit Zooms 371% in 9M 2024; Shares Surge 19%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nippon Kayaku's  profit attributable to owners surged 371% for nine months ended Dec. 31, 2024 to 13.3 billion yen from 2.83 billion yen a year earlier, a filing with the Tokyo Exchange said on Monday. </p><p class=\"\">Profit attributable to owners of parent per share primary increased to 81.02 yen from 17.06 yen in the comparable period. </p><p class=\"\">Net sales were up over 12% year over year to 168.0 billion yen from 149.8 billion yen. </p><p class=\"\">The chemicals company forecasted an attributable profit of 17.9 billion yen for the year ending March 31, a profit attributable to owners of parent per share of 109.58 yen and net sales of 223.7 billion yen. </p><p class=\"\">Shares of the company zoomed nearly 19% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463300:0/",
            "pub_date": "2025-02-04 15:48:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463294:0",
            "title": "Tuticorin Alkali Chemicals Sees Sharp Decline in Fiscal Q3 Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tuticorin Alkali Chemicals And Fertilizers'  net profit plunged to 48.9 million Indian rupees in the fiscal third quarter ended Dec. 31, 2024, against 191.6 million rupees a year ago. </p><p class=\"\">Earnings per share contracted to 0.40 rupees compared with the year-ago figure of 1.57 rupees, according to a Monday filing to the BSE by the chemicals manufacturer. </p><p class=\"\">Revenue from operations in fiscal Q3 increased to 818.6 million rupees from 761.5 million rupees a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463294:0/",
            "pub_date": "2025-02-04 15:48:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001917_20250204001917:0",
            "title": "Swedbank Names Erik Odhnoff New Chief Credit Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001917_20250204001917:0/",
            "pub_date": "2025-02-04 15:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}