{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0ME:0",
            "title": "Betolar Targets Positive Cash Flow From Operating Activities By End Of 2026",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Betolar Oyj :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BETOLAR UPDATES ITS FINANCIAL TARGETS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACHIEVING POSITIVE CASH FLOW FROM OPERATING ACTIVITIES BY END OF 2026</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">TARGET: ACHIEVING POSITIVE CASH FLOW FROM OPERATING ACTIVITIES BY END OF 2026</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0ME:0-betolar-targets-positive-cash-flow-from-operating-activities-by-end-of-2026/",
            "pub_date": "2025-02-05 14:15:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX3jPD03:0",
            "title": "AppSecure Security Partners with Jazzee AI to Bolster US Market Expansion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SINGAPORE, Feb.  05, 2025  (GLOBE NEWSWIRE) — In a strategic move to strengthen its presence in the US market, AppSecure Security, a global offensive Pentest and Red teaming company, has announced a partnership with Jazzee AI, an innovative SaaS and Cloud app marketplace. This collaboration aims to boost AppSecure's customer acquisition in the United States while complementing Jazzee's security offerings.</p><p class=\"\">Securing the Future of SaaS with Offensive Security Expertise</p><p class=\"\">AppSecure Security, renowned for its hacker-focused Pentesting and Red Teaming services, has earned a reputation for identifying and mitigating critical vulnerabilities in APIs and applications. With a clientele of over 300 global enterprises and startups, AppSecure, is a trusted partner in safeguarding digital ecosystems.</p><p class=\"\">Sandeep Hodkasia, Founder of AppSecure Security, shared his enthusiasm: \"Partnering with Jazzee AI allows us to combine our offensive security expertise with Jazzee’s AI-driven innovation. Together, we’re not just enhancing cybersecurity; we’re enabling businesses to securely harness the power of the best SaaS tools available.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Agentic AI: Revolutionizing the Buying Experience</strong></p><p class=\"\">At the heart of this partnership is Jazzee AI’s extensive use of Agentic AI. Jazzee’s revolutionary AI capabilities are encapsulated in its \"mother agent,\" a sophisticated chatbot that consolidates powerful tools such as the Buyer Assist Agent, Price Discovery Agent and Contract Analyzer Agent. This AI powerhouse empowers consumers to:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Identify the best product fit tailored to their needs.</li><li class=\"listItem-bmN0_SHH\">Optimize budgets with intelligent negotiation guidance.</li><li class=\"listItem-bmN0_SHH\">Access genuine, crowd-sourced reviews from real users across the internet.</li></ul><p class=\"\">Rajat Dhariwal, Chief AI Officer and Co-founder of Jazzee, explained the vision: \"Jazzee AI is redefining how businesses and consumers navigate the SaaS and Cloud app landscape. Our mother agent doesn’t just assist—it transforms decision-making, ensuring enterprise customers find the right tools, negotiate the best deals, and make informed, confident choices.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Driving Growth in a Booming Market</strong></p><p class=\"\">The global application security market is expected to grow from USD 9.95 billion in 2023 to USD 25.30 billion by 2030, with a CAGR of 14.3%. This partnership positions both companies to capitalize on this surge, addressing the growing sophistication of cyber threats and the increasing demand for AI-driven solutions. Jazzee’s platform, powered by Agentic AI, ensures clients can trust the SaaS solutions they choose while benefiting from robust cybersecurity measures provided by AppSecure.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Transformative Synergy for US Enterprises</strong></p><p class=\"\">AppSecure's approach to security, which involves simulating real-world attack scenarios on APIs and applications, complements Jazzee's AI-powered SaaS curation and optimization services. This synergy is expected to provide US enterprises with a comprehensive solution that not only secures their digital assets but also ensures they are utilizing the promising and trusted SaaS tools available.</p><p class=\"\">As both companies look to expand their footprint in the US market, this partnership represents a significant step towards creating a more secure and efficient digital ecosystem for businesses. With the combined strengths of AppSecure's offensive security expertise and Jazzee's AI-driven marketplace, US enterprises can look forward to a new era of cybersecurity and SaaS optimization.</p><p class=\"\">About Appsecure.security</p><p class=\"\">AppSecure Security is a CREST-accredited offensive cybersecurity company that provides comprehensive security solutions to protect businesses worldwide. With a team of skilled white hat hackers, including top bug bounty hunters from Fortune 500 companies like PayPal, LinkedIn, and Reddit, AppSecure offers a unique and robust approach to identifying and addressing critical security vulnerabilities.</p><p class=\"\">The company's core philosophy revolves around an offensive security stance, which involves simulating real-world attacks to uncover concealed vulnerabilities from a hacker's perspective. This proactive approach allows organizations to anticipate and prevent sophisticated system attacks before they occur.</p><p class=\"\">AppSecure's services encompass a wide range of security solutions, including:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Web Application Penetration Testing: Utilizing advanced red teaming techniques to identify and address potential weaknesses within web applications.</li><li class=\"listItem-bmN0_SHH\">API Security: Offering comprehensive testing of API endpoints to ensure airtight data flow and protection against common vulnerabilities.</li><li class=\"listItem-bmN0_SHH\">Network Penetration Testing: Conducting thorough assessments to uncover exposed internal pathways and blind spots in network security.</li><li class=\"listItem-bmN0_SHH\">Red Teaming Exercises: Simulating real-world attack scenarios to evaluate an organization's security posture and response capabilities.</li></ul><p class=\"\">The company's methodology aligns with industry standards such as the OWASP Top 10 and the Penetration Testing Execution Standard (PTES). This ensures that their assessments are thorough, accurate, and up-to-date with the latest security threats and best practices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact:</strong></p><p class=\"\">Name: Vrinda</p><p class=\"\">Website: https://appsecure.security</p><p class=\"\">Email: marketing@appsecure.security</p><p class=\"\">Ph.no.: +917018971376</p><p class=\"\">Disclaimer: This content is provided by the AppSecure Security. The statements, views, and opinions expressed in this column are solely those of the content provider. The information shared in this press release is not a solicitation for investment, nor is it intended as investment, financial, or trading advice. It is strongly recommended that you conduct thorough research and consult with a professional financial advisor before making any investment or trading decisions. Please conduct your own research and invest at your own risk.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/9b52f376-8ce2-4634-922e-9b96072f9030</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Appsecure security and Jazzee</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Appsecure Security and Jazzee AI</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX3jPD03:0-appsecure-security-partners-with-jazzee-ai-to-bolster-us-market-expansion/",
            "pub_date": "2025-02-05 14:15:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0EF:0",
            "title": "Semiconductor firm Melexis forecasts lower sales and margins for Q1",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Melexis , Belgium's largest semiconductor supplier, said on Wednesday that it expected lower margins and sales for the first quarter of 2025, compared with a year earlier.</p><p class=\"\">The company expects its operating margin to reach 16% in the first three months of the year, down from the 26.4% it posted in the same quarter in 2024.</p><p class=\"\">It also sees lower sales in a range of 190 million to 200 million euros ($197.1 million to $207.5 million), versus 228.6 million euros in the prior year.</p><p class=\"\">($1 = 0.9639 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0EF:0-semiconductor-firm-melexis-forecasts-lower-sales-and-margins-for-q1/",
            "pub_date": "2025-02-05 14:16:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463773:0",
            "title": "Valneva Obtains UK Approval for Chikungunya Vaccine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Valneva  received marketing authorization from the UK's Medicines and Healthcare products Regulatory Agency for its chikungunya vaccine, IXCHIQ. </p><p class=\"\">The approval covers the use of the single-use vaccine on people aged at least 18 years. The French specialty vaccine company said the decision was based on the results of a phase 3 trial, according to a Thursday release. </p><p class=\"\">In addition to the UK, the vaccine is approved in the US, Europe and Canada. Brazil is expected to issue marketing approval for IXCHIQ within the first quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463773:0/",
            "pub_date": "2025-02-05 14:17:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN7xgQy:0",
            "title": "The Board of Directors of Stillfront has resolved to exercise its authorisation to acquire own shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Board of Directors of Stillfront AB (publ) (“Stillfront”) has resolved, pursuant to the authorisation granted by the Annual General Meeting held on 14 May 2024, to acquire own shares on Nasdaq Stockholm. The purpose of the repurchase is to enable payment with Stillfront’s own shares of certain future earn-out payments relating to acquisitions.</p><p class=\"\">The repurchase programme is subject to the following terms and conditions:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Acquisitions shall be effected on Nasdaq Stockholm in accordance with the Nordic Main Market Rulebook for Issuers of Shares.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may be made on one or several occasions from 6 February 2025 up until the 2025 Annual General Meeting. No acquisitions will be made during 30 days before the publication of Stillfront’s interim financial or year-end reports.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may be made up to a total amount of SEK 50 million. Stillfront’s holding of own shares may, however, not at any time exceed one-tenth of all shares in Stillfront.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may only be effected at a price within the registered price interval on Nasdaq Stockholm at any given time, which refers to the interval between the highest purchase price and the lowest selling price.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may also be made by way of block trades in accordance with applicable rules.</li><li class=\"listItem-bmN0_SHH\">Payment of acquired shares shall be made in cash.</li></ul><p class=\"\">The repurchases will be administered by Carnegie Investment Bank AB (publ), that will act in accordance with instructions from Stillfront.</p><p class=\"\">The purpose of the repurchase programme is to enable payment with Stillfront’s own shares in certain future earn-out considerations relating to acquisitions. Assuming no material changes in the historical trading volumes in Stillfront’s shares and/or current market conditions, the board of directors’ intention is that Stillfront shall complete the repurchase programme prior to the closed period that commences 30 days prior to the release of Stillfront’s interim report for the period January – March 2025.</p><p class=\"\">The total number of shares in Stillfront is 517,968,480. At the time of this press release, Stillfront holds 15,699,698 own shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN7xgQy:0-the-board-of-directors-of-stillfront-has-resolved-to-exercise-its-authorisation-to-acquire-own-shares/",
            "pub_date": "2025-02-05 14:18:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463769:0",
            "title": "Amak Resumes Operations at Copper, Zinc Concentrate Plants Following Maintenance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Almasane Alkobra Mining (SASE:1322), d/b/a Amak, restarted operations at its copper and zinc concentrate processing plants on Tuesday after scheduled periodic maintenance. </p><p class=\"\">The Saudi miner said Wednesday the Al Masane and the Moyeath mine processing plants were shut down for five weeks for maintenance work, which is expected to boost their efficiency and reliability.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463769:0/",
            "pub_date": "2025-02-05 14:18:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000624:0",
            "title": "Gold Hits String of Record Highs in Tension-Fueled Bullish Rally — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gold is mounting a notable bullish rally, fueled by market uncertainty, says Ahmad Assiri, research strategist at Pepperstone. Trade tensions following the U.S.'s imposition of a 10% tariff on Chinese imports, and delayed but looming tariffs on Canadian and Mexican products, have fueled a shift toward safe haven assets, he writes in a note. Although the USD index initially strengthened earlier in the week, posing a headwind for gold, its retracement helped revive buying interest in the precious metal. From a technical perspective, gold is testing resistance that could trigger some profit-taking but the broader trend remains supported by hedging activities amid an uncertainty, Assiri adds. He sees scope for new record peaks if the risk landscape persists. Gold has hit a series of record highs in recent days and was last around $2,857/oz. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000624:0/",
            "pub_date": "2025-02-05 14:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463767:0",
            "title": "Equinor Posts Lower FY24 Attributable Net Income, Revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equinor  said Wednesday net income and revenue for 2024 fell year over year. </p><p class=\"\">Net income attributable to equity holders for the 12 months ended Dec. 31, 2024, was $8.81 billion, compared with $11.89 billion earlier. EPS moved to $3.11 from $3.93. </p><p class=\"\">The oil and gas giant's revenue was $102.50 billion, compared with $106.85 billion a year ago. </p><p class=\"\">Meanwhile, the board proposed a dividend of $0.37 per share for the fourth quarter of 2024, payable May 28 to shareholders on record May 16. It paid $0.35 per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463767:0/",
            "pub_date": "2025-02-05 14:19:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr6HhbLn:0",
            "title": "UPM updates its Disclosure Policy and changes its method of issuing profit guidance and outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>UPM-Kymmene Oyj<p class=\"\">UPM-Kymmene Corporation Stock Exchange Release (Other information disclosed according to the rules of the Exchange)              5 February 2025 at 08:20 EET</p><p class=\"\">UPM updates its Disclosure Policy and changes its method of issuing profit guidance and outlook</p><p class=\"\">The Board of Directors of UPM-Kymmene Corporation has today approved the updated Disclosure Policy for UPM. According to the renewed Disclosure Policy, UPM may present a numerical assessment of the development of profitability and earnings for a selected time period (profit guidance) in its financial statements release, half-year report and quarterly reports. In addition, UPM may issue a verbal description of the events and circumstances effecting the profit guidance (outlook). The updated Disclosure Policy will enter into force immediately and will be available at UPM's website at www.upm.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UPM, Media Relations</strong></p><p class=\"\">Mon-Fri 9:00-16:00 EET</p><p class=\"\">tel. +358 40 588 3284</p><p class=\"\">media@upm.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UPM</strong></p><p class=\"\">We deliver renewable and responsible solutions and innovate for a future beyond fossils across six business areas: UPM Fibres, UPM Energy, UPM Raflatac, UPM Specialty Papers, UPM Communication Papers and UPM Plywood. As the industry leader in responsibility, we are committed to the UN Business Ambition for 1.5°C and the science-based targets to mitigate climate change. We employ 16,600 people worldwide and our annual sales are approximately EUR 10.5 billion. Our shares are listed on Nasdaq Helsinki Ltd. UPM Biofore - Beyond fossils. www.upm.com</p><p class=\"\">Follow UPM on X | LinkedIn | Facebook | YouTube | Instagram | #UPM #biofore #beyondfossils</p><p class=\"\">https://news.cision.com/upm-kymmene-oyj/r/upm-updates-its-disclosure-policy-and-changes-its-method-of-issuing-profit-guidance-and-outlook%2Cc4100718</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr6HhbLn:0-upm-updates-its-disclosure-policy-and-changes-its-method-of-issuing-profit-guidance-and-outlook/",
            "pub_date": "2025-02-05 14:20:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463771:0",
            "title": "Maggie Beer Holdings To Restructure Operations After Strategic Review",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Maggie Beer Holdings  said it will restructure and simplify its operations as a result of a strategic review, according to a Wednesday Australian bourse filing. </p><p class=\"\">In line with the restructuring, each of the e-commerce and Maggie Beer products businesses will be operated as a profit center with a divisional head to help focus and drive the strategic objectives of each business unit, the filing said. </p><p class=\"\">Joint Interim Group Chief Operating Officer and Chief Financial Officer Penny Diamantakiou is set to leave the company to explore career opportunities and the roles will be discontinued, per the filing. </p><p class=\"\">The firm's chairperson Sue Thomas said the board held that the cost of business was too high and new structure would allow it to focus on costs, core products, and customers, while being reflective</p><p class=\"\">of its current market capitalization. </p><p class=\"\">The firm added that the sale of Paris Creek Farms is progressing. </p><p class=\"\">The firm's current group finance managers will jointly lead the finance team.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463771:0/",
            "pub_date": "2025-02-05 14:20:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463774:0",
            "title": "Saudi Awwal Bank Ups H2 2024 Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The board of Saudi Awwal Bank (SASE:1060) will pay a cash dividend of 1 Saudi riyal per share for the second half of 2024. </p><p class=\"\">The Saudi Arabian lender will disclose the dividend's eligibility and distribution dates at a later date, according to a Wednesday release. It paid 0.98 riyal per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463774:0/",
            "pub_date": "2025-02-05 14:20:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000584:0",
            "title": "Gold Demand Rose to Fresh High in 2024, Report Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Hoppe</p><p class=\"\">Gold demand hit a new record in 2024 driven by central banks and investors, according to a new report.</p><p class=\"\">Total gold demand rose 1% on-year to an all-time high of 4,974.5 metric tons, the World Gold Council said Wednesday in a new report on gold-demand trends. The value of that demand soared to a record $382 billion, driven by record-high prices on geopolitical and economic uncertainty and investors seeking out safe-haven assets.</p><p class=\"\">Gold demand was a record $111 billion in the fourth quarter. The healthy demand has persisted into the new year, helping continuous gold future prices hit a fresh record in late European trading on Tuesday of $2,877.10 a troy ounce. New York Mercantile Exchange gold futures are up around 8.9% in the year to date.</p><p class=\"\">\"Geopolitical uncertainty remains very high and that's always going to be a supportive element for investment--whether it's shifting from concerns of military conflict to uncertainties around trade conflicts,\" said Louise Street, senior markets analyst at the WGC.</p><p class=\"\">Central-bank demand--and emerging-market-bank demand in particular--was the greatest driver behind the increase, with buying exceeding 1,000 metric tons of the precious metal for the third year in a row. On an annual basis, central-bank demand declined 1%, but purchases rocketed 54% on-year in the fourth quarter, to 332.9 tons.</p><p class=\"\">Poland's central bank led purchases, adding 90 tons to its reserves, and central-bank demand is expected to stay high going into the new year, Street said.</p><p class=\"\">\"Geopolitical and economic uncertainty remains high in 2025 and it seems as likely as ever that central banks will once again turn to gold as a stable strategic asset,\" the report said.</p><p class=\"\">Gold investment also drove up demand, rising 25% on-year, to a four year high of 1,180 tons. Gold ETFs marked their first year since 2020 to avoid sizeable outflows, and in the fourth quarter, global gold-backed ETFs posted a second consecutive quarter of inflows--primarily driven by China and India in particular, Street said.</p><p class=\"\">Investment in gold was concentrated in the second half of the year as falling interest rates, geopolitical uncertainty and gold's continued strong price performance attracted inflows. Asian-listed funds led the charge, adding 78 tons of holdings over the year. North American funds added just 8 tons--though this was the first annual increase since 2020--while European funds saw outflows, albeit at a lower level on-year.</p><p class=\"\">Looking ahead, tailwinds for gold ETFs, over-the-counter purchases and futures-based investment are likely given expectations for lower global interest rates, high-valued equities, a weaker U.S. dollar and geopolitical risks through trade conflicts, the WGC said.</p><p class=\"\">On the other hand, gold demand for jewelry has fallen on year, driven by higher prices. Weakness was seen in every major region, with global demand falling 11%, driven by China and--to a lesser extent--India. Stripping out a coronavirus-pandemic-driven slump in 2020, gold-jewelry demand fell to its lowest level since 2009, the WGC said.</p><p class=\"\">\"If the gold price remains at current or higher levels, it could further erode jewelry demand, particularly as growth is also weak or slowing in all four major gold regions,\" the WGC said.</p><p class=\"\">Elsewhere, technology demand also rose 7%, to 326 tons, mostly driven by strong demand in AI-related applications and some recovery in the consumer-electronic markets.</p><p class=\"\">Write to Joe Hoppe at joseph.hoppe@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000584:0-gold-demand-rose-to-fresh-high-in-2024-report-says/",
            "pub_date": "2025-02-05 14:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463764:0",
            "title": "Agility Global Issues EUR76 Million Guarantees for DSV Hedge",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Agility Global (ADX:AGILITY) issued 75.6 million euros in corporate guarantees to secure hedging deals with banks for some of its DSV  shares. </p><p class=\"\">The Abu Dhabi-listed investment and assets management company said Wednesday the guarantees are part of a hedging optimization and do not change the number of hedged shares or require additional funding.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463764:0/",
            "pub_date": "2025-02-05 14:14:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1F2:0",
            "title": "Melexis Expects Q1 Sales At 190 To 200 Million EUR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Melexis NV :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK: EXPECTS SALES IN THE FIRST QUARTER OF 2025 TO BE IN THE RANGE OF 190 TO 200 MILLION EUR</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK: EXPECTS Q1 A GROSS PROFIT MARGIN AROUND 40% AND AN OPERATING MARGIN AROUND 16%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FOR THE FULL YEAR 2025, EXPECTS CAPEX TO BE AROUND 50 MILLION EUR</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SALES IN THE SECOND HALF OF 2025 ARE EXPECTED TO GROW SIGNIFICANTLY COMPARED TO THE FIRST HALF OF 2025</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q424 SALES EUR 197.4 MILLION -21% YOY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q424 EBIT EUR 27.6 MILLION -55% YOY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q424 NET RESULT EUR 18.3 MILLION -63% YOY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1F2:0-melexis-expects-q1-sales-at-190-to-200-million-eur/",
            "pub_date": "2025-02-05 14:14:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000587_20250205000587:0",
            "title": "Strong launch for Cresemba in Japan triggers first sales milestone payment from AKP to Basilea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000587_20250205000587:0/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX3h9JBj:0",
            "title": "Strong launch for Cresemba in Japan triggers first sales milestone payment from AKP to Basilea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Allschwil, Switzerland, February 05, 2025</strong></p><p class=\"\">Basilea Pharmaceutica Ltd, Allschwil , a commercial-stage biopharmaceutical company committed to meeting the needs of patients with severe bacterial and fungal infections, reported today that the sales of the antifungal Cresemba® (isavuconazole) in Japan exceeded the threshold triggering the first sales milestone payment from its partner Asahi Kasei Pharma (AKP), amounting to approximately CHF 1.2 million. </p><p class=\"\">David Veitch, Chief Executive Officer of Basilea, said: “Japan is a key market with significant growth potential for Cresemba. The achievement of the first sales milestone already in the second year of commercialization is a testament of the commercial capability of our partner AKP in this important market. The strong sales ramp-up in the early stage of its life cycle in Japan underscores that Cresemba is meeting critical medical needs of patients with life-threatening fungal infections.”</p><p class=\"\">By year-end 2024, Cresemba was marketed in more than 70 countries. According to the latest available market data, total global in-market sales of Cresemba in the twelve-month period between October 2023 and September 2024 amounted to USD 533 million, a 20 percent growth year-on-year, making it the largest branded antifungal for invasive fungal infections worldwide.1</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cresemba</strong><strong class=\"root-Tkn6WL2y\">®</strong> <strong class=\"root-Tkn6WL2y\">(isavuconazole)</strong></p><p class=\"\">Isavuconazole is an intravenous (i.v.) and oral azole antifungal, commercialized under the trade name Cresemba. In Japan, the oral and intravenous formulations are approved for the treatment of adult patients with aspergillosis, mucormycosis, and cryptococcosis.2 Isavuconazole is also approved in the United States (US),3 China, the EU4 and several additional countries in Europe and beyond.5</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Basilea</strong></p><p class=\"\">Basilea is a commercial-stage biopharmaceutical company founded in 2000 and headquartered in Switzerland. We are committed to discovering, developing and commercializing innovative drugs to meet the needs of patients with severe bacterial and fungal infections. We have successfully launched two hospital brands, Cresemba for the treatment of invasive fungal infections and Zevtera for the treatment of bacterial infections. In addition, we have preclinical and clinical anti-infective assets in our portfolio. Basilea is listed on the SIX Swiss Exchange . Please visit basilea.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disclaimer</strong></p><p class=\"\">This communication expressly or implicitly contains certain forward-looking statements, such as \"believe\", \"assume\", \"expect\", \"forecast\", \"project\", \"may\", \"could\", \"might\", \"will\" or similar expressions concerning Basilea Pharmaceutica Ltd, Allschwil and its business, including with respect to the progress, timing and completion of research, development and clinical studies for product candidates. Such statements involve certain known and unknown risks, uncertainties and other factors, which could cause the actual results, financial condition, performance or achievements of Basilea Pharmaceutica Ltd, Allschwil to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Basilea Pharmaceutica Ltd, Allschwil is providing this communication as of this date and does not undertake to update any forward-looking statements contained herein as a result of new information, future events or otherwise.</p><p class=\"\">For further information, please contact:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\">  Peer Nils Schröder, PhD    Head of Corporate Communications &amp; Investor RelationsBasilea Pharmaceutica International Ltd, Allschwil Hegenheimermattweg 167b4123 AllschwilSwitzerland                  </td></tr><tr><td>  Phone  </td><td>  +41 61 606 1102  </td></tr><tr><td>  E-mail  </td><td>  media_relations@basilea.cominvestor_relations@basilea.com      </td></tr></tbody></table></div><p class=\"\">This press release can be downloaded from www.basilea.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">References</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">IQVIA Analytics Link, September 2024. In-market sales reported as moving annual total (MAT) in US dollar.</li><li class=\"listItem-bmN0_SHH\">PMDA List of Approved Drugs April 2022 to March 2023: https://www.pmda.go.jp/files/000267877.pdf [Accessed: February 04, 2025]</li><li class=\"listItem-bmN0_SHH\">Full US prescribing information: https://www.astellas.us/docs/cresemba.pdf [Accessed: February 04, 2025]</li><li class=\"listItem-bmN0_SHH\">European Public Assessment Report (EPAR): https://www.ema.europa.eu/en/medicines/human/EPAR/cresemba [Accessed: February 04, 2025]</li><li class=\"listItem-bmN0_SHH\">The registration status and approved indications may vary from country to country.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Press release (PDF)</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX3h9JBj:0-strong-launch-for-cresemba-in-japan-triggers-first-sales-milestone-payment-from-akp-to-basilea/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000596:0",
            "title": "News Highlights: Top Global Markets News of the Day - Wednesday at 1 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Recover Despite China Tariff Fears</strong></p><p class=\"\">A call between Trump and Xi Jinping hasn't happened Tuesday, but might come Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Eggs Are Through the Roof. What's Up With Food Prices?</strong></p><p class=\"\">Bird flu is making eggs costly, and looming tariffs could cause price hikes in certain items like avocados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How U.S. Agriculture Market Is Approaching Tariffs and a Potential Trade War</strong></p><p class=\"\">Traders and farmers hope that the Trump administration is using tariff threats as leverage in trade negotiations, as opposed to following through with a major disruption to agricultural trade.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Keeps Hitting Record Highs. Here's Why-and Which Stocks Could Benefit.</strong></p><p class=\"\">The yellow metal is trading just below $2,900 an ounce. Miner stocks are rallying too. Geopolitical turmoil is boosting gold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000596:0-news-highlights-top-global-markets-news-of-the-day-wednesday-at-1-am-et/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000595:0",
            "title": "News Highlights: Top Company News of the Day - Wednesday at 1 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Toyota Raises Earnings Guidance After Profit Jumps</strong></p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda's Merger Terms, Putting Deal in Peril</strong></p><p class=\"\">The Japanese automakers had announced a plan to combine in December.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Earnings Must Show GLP-1 Market Still Set for Big Growth</strong></p><p class=\"\">Novo's Wegovy and Ozempic are among the most closely watched new medications in recent history, but face serious competition from Eli Lilly's Zepbound and Mounjaro.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Australia Bans DeepSeek From Government Devices</strong></p><p class=\"\">Australia directed all government entities to prevent the use of DeepSeek products, applications and web services on government systems and mobile devices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LG CNS Makes Weak Debut in South Korea After IPO</strong></p><p class=\"\">The information-technology services affiliate of conglomerate LG Group raised around $826 million in South Korea's biggest listing in three years.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Match Group Replaces CEO as Growth Eludes Dating Apps</strong></p><p class=\"\">The owner of Tinder, Hinge and OkCupid apps said CEO Bernard Kim would step down and be succeeded by board member Spencer Rascoff, a co-founder and former CEO of home-listings portal Zillow Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000595:0-news-highlights-top-company-news-of-the-day-wednesday-at-1-am-et/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Obi0NrJca:0",
            "title": "NOD: Share Buyback Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Board of Directors of Nordic Semiconductor ASA has in a board meeting heldon February 4, 2025, authorized the Company to commence a share repurchaseprogram.</p><p class=\"\">The share repurchase program will be carried out in accordance with applicablelaws and regulations.</p><p class=\"\">The purpose of the program is to have available shares to settle the company'sobligations under the Employee long-term equity linked incentive programs. Keyterms of the share repurchase program include:</p><p class=\"\">* The maximum number of shares that the Company may purchase under the programis up to 9.96% of the outstanding shares, however limited to a total purchaseofNOK 240 million.</p><p class=\"\">* In accordance with the authorization from the AGM, the maximum price thatcanbe paid per share is NOK 350.</p><p class=\"\">* The share repurchase program period runs from February 5, 2025, and ends onthe latest on the Annual General Meeting in 2025.</p><p class=\"\">* No shares may be bought at a price higher than the greater of the sharepriceof the latest independent trade or the highest current independent offer priceat Oslo Børs at the time of the trade.</p><p class=\"\">* The maximum number of shares in the Company which may be purchased on eachtrading day corresponds to maximum 20% of the average daily trading volume ofthe Company for that day.</p><p class=\"\">Transactions will be conducted in accordance with the Market Abuse Regulation(EU) No 596/2014 (\"MAR\") and Commission Delegated Regulation (EU) No 2016/1052(\"Safe Harbour Regulation\") as further set out i.a. in the NorwegianSecuritiesTrading Act of 2007 and the Oslo Stock Exchange's Guidelines for buy-backprograms and price stabilization dated February 2021.</p><p class=\"\">For questions: Pål Elstad, Chief Financial Officer Mobile: (+47) 99 166 293</p><p class=\"\">This information is subject to the disclosure requirements pursuant to Section5-12 of the Norwegian Securities Trading Act and the Market Abuse Regulation.</p><p class=\"\">This stock exchange announcement was published by Kine-Elena Reigstad, VPInternational Finance, on February 5, 2025 at 07.15 CET.</p><p class=\"\">https://newsweb.oslobors.no/message/637721</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Obi0NrJca:0-nod-share-buyback-program/",
            "pub_date": "2025-02-05 14:15:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN1NDcqd:0",
            "title": "Carnegie Access: Björn Borg: Set to grow at double-digits in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new commissioned research report on Björn Borg.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/bjornborg/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN1NDcqd:0-carnegie-access-bj-rn-borg-set-to-grow-at-double-digits-in-2024/",
            "pub_date": "2025-02-05 14:15:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr1gGZql:0",
            "title": "The Board of Directors of Alma Media Corporation has decided on new periods under the long-term share-based incentive schemes for key employees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Alma Media<p class=\"\">Alma Media Corporation          Stock Exchange Release            5 March 2025 at 8.15 a.m. </p><p class=\"\">THE BOARD OF DIRECTORS OF ALMA MEDIA CORPORATION HAS DECIDED ON NEW PERIODS UNDER THE LONG-TERM SHARE-BASED INCENTIVE SCHEMES FOR KEY EMPLOYEES </p><p class=\"\">The Board of Directors of Alma Media Corporation has decided on the commencement of a new period under the long-term share-based incentive scheme for senior management. The Board of Directors has further decided on the commencement of a new period under the performance- and share-based incentive scheme aimed at middle management and selected key employees. The incentive schemes were established and originally announced on December 18, 2018.</p><p class=\"\">The objective of the share-based incentive schemes is to align the interests of the management and key employees with those of Alma Media's shareholders by creating a long-term equity interest for the participants and thus to increase the company's value in the long term as well as to drive a performance culture, to retain key resources and to offer them competitive compensation for excellent performance in the company.</p><p class=\"\">New period in the Matching Share Plan for senior management (MSP 2025)</p><p class=\"\">In the Matching Share Plan (MSP 2025), the participant will receive two matching shares for each invested share free of charge after a three-year holding period. Should all of the eligible individuals participate in MSP 2025 by making the required share investment, the maximum aggregate amount of matching shares to be delivered based on the fixed matching ratio is 241,400 shares (representing a gross reward from which the applicable payroll tax is withheld, and the remaining net value is paid to the participants in shares). The fixed matching shares will be delivered in the spring of 2028.</p><p class=\"\">In MSP 2025, the potential performance-based matching share rewards will be delivered to the participants after the three-year performance period in the spring of 2028 provided that the performance targets set by the Board of Directors for the plan are achieved.</p><p class=\"\">The performance targets applied to MSP 2025 are Alma Media's earnings per share (EPS), the relative total shareholder return of Alma Media's share (TSR) and ESG measures. If the performance targets set by the Board of Directors are achieved in full, the participant will receive in total six performance-based matching shares for each invested share free of charge. In that case, if all of the eligible individuals participate in MSP 2025 by making the required share investment, the maximum aggregate amount of performance-based matching shares delivered based on MSP 2025 is 724,200 shares (representing a gross reward from which the applicable payroll tax is withheld, and the remaining net value is paid to the participants in shares).</p><p class=\"\">The rewards based on MSP 2025 will be paid in shares of Alma Media Corporation.</p><p class=\"\">Eligible to participate in MSP 2025 are the members of Alma Media's Group Executive Team.</p><p class=\"\">The total value of MSP 2025 based on the current value of Alma Media's share is approximately EUR 11.4 million.</p><p class=\"\">The middle management's and selected key persons' Performance Share Plan (PSP 2025)</p><p class=\"\">The Performance Share Plan (PSP 2025) commences effective as of the beginning of 2025 and the potential share rewards thereunder will be paid in the spring of 2028 provided that the performance targets set by the Board of Directors for the plan are achieved. The potential rewards will be paid in shares of Alma Media Corporation.</p><p class=\"\">The performance targets applied to the PSP 2025 plan are the relative total shareholder return of Alma Media's share (TSR), EBIT of the participant's relevant business area and ESG measures.</p><p class=\"\">Eligible to participate in PSP 2025 are approximately 90 individuals at the maximum.</p><p class=\"\">If all of the performance targets set for PSP 2025 are achieved in full, the aggregate maximum number of shares to be paid based on this plan within the performance share structure is 306,000 shares (representing a gross reward from which the applicable payroll tax is withheld and the remaining net value is paid to the participants in shares).</p><p class=\"\">The total value of PSP 2025 based on the current value of Alma Media's share is approximately EUR 3.6 million.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Other terms and conditions</strong></p><p class=\"\">Both of the incentive schemes mentioned above are subject to a condition concerning the continuation of the service relationship. Accordingly, if a participant's service contract with Alma Media Group is terminated before the share-based reward is due to be paid, the participant is not, as a rule, entitled to the reward under the scheme.</p><p class=\"\">Alma Media applies a recommendation concerning share ownership to the members of the Group Executive Team. According to the recommendation, each member of the Group Executive Team is expected to retain ownership of at least half of the net shares received through the company's share-based incentive schemes until the total value of the Alma Media shares held corresponds to at least one year's fixed gross annual salary.</p><p class=\"\">The Board of Directors anticipates that no new shares will be issued in connection with the share-based incentive scheme. Consequently, the incentive scheme will have no dilutive effect on the number of the company's registered shares.</p><p class=\"\">ALMA MEDIA CORPORATION</p><p class=\"\">Board of Directors</p><p class=\"\">For more information, please contact: Mikko Korttila, General Counsel of Alma Media Corporation, secretary to the Board of Directors, tel. +358 50 593 4589</p><p class=\"\">Distribution: NASDAQ Helsinki Stock Exchange, main media, www.almamedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Alma Media in brief</strong></p><p class=\"\">Alma Media is an international company of digital media, marketplaces and services with a strong capacity for renewal. We inspire human curiosity and choice by creating services that combine technology and content with a local heart. In Finland, our best-known brands include Kauppalehti, Talouselämä, Iltalehti, Jobly, Etuovi.com, Nettiauto and Nettimoto. Our recruitment services include prace.cz and jobs.cz in the Czech Republic, Profesia.sk in Slovakia and mojposao.net in Croatia.</p><p class=\"\">In Finland, our business operations include leading housing and automotive marketplaces, financial and professional media, national consumer media and content and data services for businesses and professionals. Alma Media's international business in Eastern Central Europe, Sweden and the Baltic countries consists of recruitment services and an online marketplace for commercial properties.</p><p class=\"\">Alma Media operates in 11 countries in Europe and employs approximately 1,700 professionals. Alma Media's revenue from continuing operations was EUR 313 million in 2024 of which the share of digital business was 84%. Alma Media's share is listed on NASDAQ Helsinki. Read more at www.almamedia.fi/en/.</p><p class=\"\">https://news.cision.com/alma-media/r/the-board-of-directors-of-alma-media-corporation-has-decided-on-new-periods-under-the-long-term-shar%2Cc4100532</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr1gGZql:0-the-board-of-directors-of-alma-media-corporation-has-decided-on-new-periods-under-the-long-term-share-based-incentive-schemes-for-key-employees/",
            "pub_date": "2025-02-05 14:15:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr6LF7w8:0",
            "title": "Betolar updates its financial targets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Betolar Oyj<p class=\"\">Betolar Plc </p><p class=\"\">Company Release </p><p class=\"\">5 February 2025 at 8:15 A.M. EET </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Betolar updates its financial targets</strong> </p><p class=\"\">Betolar's Board of Directors has approved the company's financial targets, which are as follows: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Achieving positive cash flow from operating activities by the end of 2026 </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The long-term financial target to achieve one billion euros in revenue and a 30 percent EBITDA margin by the end of 2033 remains unchanged. </p></li></ul><p class=\"\">Betolar does not consider the financial targets as guidance for any specific year. In the long term, low-carbon solutions that replace cement are expected to grow, especially in the mining and metal industries as well as in construction, and Betolar aims to capture a significant market share.  </p><p class=\"\">Previously, the medium-term financial targets were: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Net sales EUR 50-100 million at the end of 2026 </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Achieving positive cash flow from operating activities during 2026 </p></li></ul><p class=\"\">Betolar Plc </p><p class=\"\">More information: </p><p class=\"\">Tuija Kalpala, CEO &amp; President, Betolar Plc, tuija.kalpala@betolar.com, +358 50 567 6608 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Certified Adviser:</strong> </p><p class=\"\">Aktia Alexander Corporate Finance Oy, +358 50 520 4098 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Betolar </strong></p><p class=\"\">Betolar is a circular economy enabler and materials technology specialist, providing innovative solutions to help use industrial sidestreams to produce low-carbon and cement-free products for the mining and construction sectors.  Betolar's mission is to help reduce carbon emissions and the use of virgin resources in mining and construction.   </p><p class=\"\">Betolar's circular economic innovations significantly reduce CO2 emissions from cement use and the use of virgin raw materials by utilizing industrial sidestreams.  Betolar is continuously developing its low-carbon Geoprime solution for the mining, metals and construction industries. In addition, Betolar's AI-based data platform creates value from industrial side streams and accelerates solution development. The SidePrime analytics service, based on the data platform, maps the potential for utilization of industrial side streams and waste.   </p><p class=\"\">Betolar was founded in 2016 and is domiciled in Kannonkoski, Finland. Betolar is listed on the Nasdaq First North Growth Market. For more information www.betolar.com</p><p class=\"\">https://news.cision.com/betolar-oyj/r/betolar-updates-its-financial-targets%2Cc4100656</p><p class=\"\">3462713_0.png</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr6LF7w8:0-betolar-updates-its-financial-targets/",
            "pub_date": "2025-02-05 14:15:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXc69MZY:0",
            "title": "Nomad Internet Launches Nomad Dragon- The Best Verizon Modem on the Planet",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NEW BRAUNFELS, Texas, Feb.  05, 2025  (GLOBE NEWSWIRE) — Nomad Internet has announced the launch of Nomad Dragon, the best Verizon Modem on the planet. Nomad Dragon comes with high-speed internet connectivity and up to 10 hours of battery backup, which means users can work, stream, and stay connected without interruptions.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:418.359375px;max-width:1200px;aspect-ratio:2.8683473389355743\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXc69MZY-a887e52559473d6938c9c8130465c26f-resized.webp\" type=\"images/webp\"/><img alt=\"Nomad Dragon\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXc69MZY-a887e52559473d6938c9c8130465c26f-resized.jpeg\" style=\"background-color:#252c20\"/></picture></div></figure></span></p><p class=\"\">The Nomad Dragon ensures dependable, fast connections perfect for streaming ultra-HD 8K videos, gaming without delays, and operating essential business applications. This modem is designed for outstanding reliability, delivering excellent performance even in the toughest network environments.</p><p class=\"\">Innovative Battery Backup for Uninterrupted Connectivity</p><p class=\"\">Pioneering advancements in wireless technology, the Nomad Dragon is the first modem in Nomad Internet’s collection to include an integrated battery backup system with a 10-hour battery backup. Created for residential and commercial applications, the battery guarantees smooth performance during electricity failures, providing consistent connectivity during essential times. Whether working from home, gaming, or controlling smart gadgets, users can depend on the Nomad Dragon’s power durability to remain connected when it’s essential.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Support for Up to 128 Devices</strong></p><p class=\"\">Designed for flexibility, the Nomad Dragon can accommodate up to 128 devices, making it a perfect choice for larger homes, companies, and shared work environments. Thanks to its powerful hardware and smart traffic management, users can experience quick, dependable, and secure connectivity on all their devices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Advanced Network Security.</strong></p><p class=\"\">The Nomad Dragon comes with cutting-edge network security capabilities to protect users from cyber dangers. Users of Nomad Dragon can enjoy a secure, encrypted connection that guarantees data privacy and safety.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Blazing-Fast, Reliable Internet</strong></p><p class=\"\">The Nomad Dragon revolutionizes connectivity for individuals needing exceptional speed and dependability on the move, offering unlimited data and no contracts. Designed for enhanced performance, Nomad Dragon facilitates seamless Ultra HD 8K streaming, uninterrupted video calls, and lag-free online gaming, all while providing advanced mobility and an integrated battery backup.</p><p class=\"\">Nomad Dragon embodies Nomad Internet's steadfast dedication to innovation, quality, and customer satisfaction. With reliable connectivity, long-lasting battery life and the ability to provide high-speed, reliable connection on the go make Nomad Dragon the best Verizon modem on the planet.</p><p class=\"\">For a limited time, Nomad Internet is offering the Nomad Dragon (retail price $799.95) for free with its unlimited internet plan. It is a unique opportunity for users to enjoy a high-speed and reliable internet connection at a remarkably affordable price.</p><p class=\"\">Nomad Dragon is available for order on NomadInternet.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Nomad Internet</strong></p><p class=\"\">Nomad Internet is America’s leading wireless internet provider for rural communities, delivering high-speed, reliable, and affordable connectivity to those in areas where traditional services fall short.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\">Company Name: Nomad Internet</p><p class=\"\">Contact Person: Manish Roshan</p><p class=\"\">Email: manish@nomadinternet.com</p><p class=\"\">Website: https://nomadinternet.com</p><p class=\"\">Phone: +1 281 800 1000</p><p class=\"\">Disclaimer: This content is provided by the Nomad Internet. The statements, views, and opinions expressed in this column are solely those of the content provider. The information shared in this press release is not a solicitation for investment, nor is it intended as investment, financial, or trading advice. It is strongly recommended that you conduct thorough research and consult with a professional financial advisor before making any investment or trading decisions. Please conduct your own research and invest at your own risk.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/f5535f54-cc1d-4a68-a9ef-a46d1b5cbd4e</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nomad Dragon</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Nomad Dragon</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXc69MZY:0-nomad-internet-launches-nomad-dragon-the-best-verizon-modem-on-the-planet/",
            "pub_date": "2025-02-05 14:15:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446677:0",
            "title": "Russia Services PMI Rises to 12-Month High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Russia Services PMI increased to 54.8 in January 2025, up from December’s three-month low of 51.2, marking the highest reading since January 2024, as output grew the most in a year amid a sustained rise in new orders and more favorable conditions.</p><p class=\"\">New business increased for the seventh month running, with the pace of growth quickened to the fastest in 12 months and was solid overall.</p><p class=\"\">Employment climbed for the third straight month while backlogs of work rose solidly, and one that was the second-fastest since August 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446677:0-russia-services-pmi-rises-to-12-month-high/",
            "pub_date": "2025-02-05 14:15:31",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000391_20250205000488:0",
            "title": "Credit Agricole S.A. Raises Dividend to EUR1.10",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000391_20250205000488:0/",
            "pub_date": "2025-02-05 14:06:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000492:0",
            "title": "Indonesia's Economy Sustained Steady Pace Growth in 2024 — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Ying Xian Wong and Fabiana Negrin Ochoa</p><p class=\"\">Indonesia's economy grew at a steady pace in 2024 as momentum picked up in the final quarter of the year, signaling stability but a long road ahead to the government's lofty growth aims.</p><p class=\"\">Annual growth of 5.03% compared with the 5.05% expansion seen in 2023, the statistics agency said Wednesday. Economists at HSBC and DBS had expected a reading of 5.0%.</p><p class=\"\">That continues a years-long run of growth at a roughly 5% clip, with Southeast Asia's largest economy having expanding at the same pace since about 2016, barring the Covid shock over 2020 and 2021.</p><p class=\"\">Indonesia's resource-rich economy grew 5.02% from a year earlier in the fourth quarter of 2024, compared with a 4.95% expansion in the third quarter. That exceeded economists' expectations, with a Wall Street Journal poll tipping growth at 4.89%.</p><p class=\"\">Things looked dimmer on a quarterly basis, with gross domestic product up just 0.53% in the fourth quarter compared with 1.50% the previous quarter.</p><p class=\"\">All business sectors grew on the year in the last three months of 2024, with the other services industry leading the gains in part thanks to international tourism, said Amalia Adininggar Widyasanti, acting chief of Statistics Indonesia.</p><p class=\"\">Manufacturing--the sector that makes up the biggest share of Indonesia's GDP--grew 4.89% from the prior-year period, she added.</p><p class=\"\">The main contributor to fourth-quarter GDP by expenditure was household consumption, followed by investments. Exports recorded strong growth too, driven by both non-gas and gas shipments.</p><p class=\"\">The data comes as President Prabowo Subianto looks to jumpstart growth during his five-year term. The former general, who was sworn in October last year, has set his sights high, aiming to bring GDP growth to 8%--levels it hasn't reached since the mid 1990s.</p><p class=\"\">To that end, the government has announced a multibillion-dollar stimulus package for 2025 and joined the BRICS organization as a full member in January, a move that could draw in more investment and trade.</p><p class=\"\">Parliament this week also approved the Daya Anagata Nusantara Agency for Investment Management, Indonesia's new sovereign wealth fund.</p><p class=\"\">Danantara, as the fund is known, is modeled after state investment entities like Singapore's Temasek and Norway's Norges Bank Investment Management, Citi Research analyst Ferry Wong said. Assets totaling about $600 billion place Danantara as one of the world's largest sovereign wealth funds, with the aim of managing Indonesia's state-owned assets to bolster economic growth and enhance global competitiveness, he said in a note.</p><p class=\"\">The government is also looking to harness more of the country's abundant natural resources by requiring exporters to keep all proceeds onshore for at least one year.</p><p class=\"\">The repatriation regulation change, set to kick in March 1st, could strain businesses' cashflows but shows \"the government's commitment to bringing USD back onshore and boosting FX reserves, with expectations of up to US$90 billion in inflows,\" UOB economist Enrico Tanuwidjaja said.</p><p class=\"\">Increased onshore dollar liquidity is anticipated to boost foreign-exchange and bond market activity, and if a significant portion of the proceeds are converted into IDR, could strengthen the rupiah, he added in a report.</p><p class=\"\">But with trade uncertainties mounting, and Indonesia's economy vulnerable to commodity price shocks, it remains to be seen if the policy efforts will pay off.</p><p class=\"\">Current indicators suggest that economic growth will likely remain around 5% this year, ANZ economists Arindam Chakraborty and Sanjay Mathur said in a recent note. While the Indonesian government's focus on welfare-driven spending could help support consumption, the 2025 budget looks conservative, they added.</p><p class=\"\">Capital Economics' senior Asia economist, Gareth Leather, thinks growth has been accelerating, but is not as stable as official figures suggest.</p><p class=\"\">\"We expect growth to slow on our measure of activity as the impact of lower commodity prices and subdued global demand offsets the boost from lower interest rates,\" he said.</p><p class=\"\">Write to Ying Xian Wong at yingxian.wong@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000492:0/",
            "pub_date": "2025-02-05 14:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000375_20250205000501:0",
            "title": "Handelsbanken: Repurchase Programme of a Maximum 120 Million Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000375_20250205000501:0/",
            "pub_date": "2025-02-05 14:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000375_20250205000495:0",
            "title": "Handelsbanken Proposes Share Repurchase Programme Extended by a Further Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000375_20250205000495:0/",
            "pub_date": "2025-02-05 14:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463755:0",
            "title": "Australian Shares Rise Despite China's Response to US Tariff Strike; Insignia Financial Receives Takeover Bid From Brookfield Capital Partners",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australian shares rose on Wednesday's close, even as Wall Street and other Asian markets fell as US-China trade war tensions continue to escalate. </p><p class=\"\">The S&amp;P/ASX 200 Index rose 0.5% or 42.9 points to close at 8,416.9. </p><p class=\"\">After being hit with a 10% tariff, Beijing responded by imposing new tariffs, launching an antitrust probe into Google, tightening mineral export controls, and blacklisting two US firms, Bloomberg reported. </p><p class=\"\">China's cautious reply avoided escalations, but concerns grew as weaker manufacturing data and yuan depreciation affected Chinese stocks, the report said. </p><p class=\"\">On the domestic front, Business activity in Australia's services sector grew further in January, while confidence surged to a 32-month high, according to a survey by S&amp;P Global. </p><p class=\"\">Australia's living cost indexes (LCI) for the December 2024 quarter were a mixed bag, with movements between a 0.1% decline and 0.4% growth, data from the Australian Bureau of Statistics showed. </p><p class=\"\">Australia's industrial activities improved further in January, albeit gradually as demand remained subdued, according to a report by Ai Group. The Ai Group Australian Industry Index improved by 1.4 points to negative 17.4, its highest level in 12 months. </p><p class=\"\">In company news, Insignia Financial  received a confidential, non-binding, and indicative takeover proposal via a scheme of arrangement from Brookfield Capital Partners (UK) at AU$4.60 cash per share. Shares of the company rose 7% at market close and earlier hit a 52-week high. </p><p class=\"\">Amcor  reported fiscal second-quarter adjusted earnings Tuesday of $0.161 per diluted share, up from $0.157 a year earlier. Shares of the company rose 3% at market close. </p><p class=\"\">Lastly, Cleanaway Waste Management  said a \"significant\" fire has disrupted operations at its liquid waste processing facility in St Marys, New South Wales.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463755:0-australian-shares-rise-despite-china-s-response-to-us-tariff-strike-insignia-financial-receives-takeover-bid-from-brookfield-capital-partners/",
            "pub_date": "2025-02-05 14:07:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0BG:0",
            "title": "Ringkjoebing Landbobank Proposes Increasing Dividend To DKK 11 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ringkjoebing Landbobank A/S :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">EXPECTATIONS FOR NET PROFIT FOR 2025 IN RANGE DKK 1.8 - 2.2 BILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WE PROPOSE INCREASING DIVIDEND TO DKK 11 PER SHARE AND CONTINUING DKK 500 MILLION SHARE BUYBACK</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0BG:0-ringkjoebing-landbobank-proposes-increasing-dividend-to-dkk-11-per-share/",
            "pub_date": "2025-02-05 14:08:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}