{
    "data": [
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zaw66ggdK:0",
            "title": "ZAWYA-PRESSR: EDGE and Republic of Korea's DAPA advance major defence cooperation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>It establishes a comprehensive industrial partnership spanning integrated air defence, advanced aircraft, and maritime capabilities, with cooperation valued at approximately $35 billion</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Abu Dhabi, UAE –</span></strong><span> EDGE Group has signed a Defence Industry Cooperation Framework with the Republic of Korea's Defense Acquisition Program Administration (DAPA), during the Republic of Korea’s recent high-level visit to Abu Dhabi, marking a significant milestone in the bilateral defence partnership between both countries.</span></p><p class=\"\"><span>The agreement was signed by H.E. Faisal Al Bannai, Adviser to the UAE President for Strategic Research and Advanced Technology Affairs and Chairman of the Board of Directors of EDGE, and Mr. Lee, Yong Cheol, Minister of DAPA, in the presence of other senior officials from the UAE and Republic of Korea. The visit underscored the enduring strength of the 'Special Strategic Partnership' between the two nations.</span></p><p class=\"\"><span>The MoU establishes a framework for comprehensive defence industry cooperation, encompassing design, development, training, and maintenance, moving beyond a traditional procurement relationship toward deeper, long-term collaboration. Areas of cooperation include integrated air defence systems, advanced aircraft capabilities, and maritime power, with defence cooperation under the framework expected to amount to approximately $35 billion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About EDGE</span></strong></p><p class=\"\"><span>Launched in November 2019, the UAE’s EDGE is one of the world’s leading advanced technology groups, established to develop agile, bold, and disruptive solutions for defence and beyond, and to be a catalyst for change and transformation. It is dedicated to bringing breakthrough innovations, products, and services to market with greater speed and efficiency, to position the UAE as a leading global hub for future industries, and to creating clear paths within the sector for the next generation of highly skilled talent to thrive.  With a focus on the adoption of 4IR technologies, EDGE is driving the development of sovereign capabilities for global export and for the preservation of national security, working with front-line operators, international partners, and adopting advanced technologies such as autonomous capabilities, cyber-physical systems, advanced propulsion systems, robotics, and smart materials. EDGE converges R&amp;D, emerging technologies, digital transformation, and commercial market innovations with military capabilities to develop disruptive solutions tailored to the specific requirements of its customers. Headquartered in Abu Dhabi, capital of the UAE, EDGE consolidates more than 35 entities into five core clusters: Platforms &amp; Systems, Missiles &amp; Weapons, Space &amp; Cyber Technologies, Technologies &amp; Industrialisation, and Homeland Security.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For media enquiries, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>EDGE Group Press Office</span></strong></p><p class=\"\"><span>media@edgegroup.ae</span></p><p class=\"\"><span>+971 52 220 2930</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zaw66ggdK:0-zawya-pressr-edge-and-republic-of-korea-s-dapa-advance-major-defence-cooperation/",
            "pub_date": "2026-02-28 20:33:56",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSR9N2Ta:0",
            "title": "Hospitality Entrepreneurs Romain Kapadia and Joseph Pachioli Introduce Le Tesserae, a 20,000-Square-Foot Architecturally Significant Events Destination in Houston",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>HOUSTON, TX / ACCESS Newswire / February 28, 2026 / Hospitality entrepreneurs Romain Kapadia and Joseph Pachioli, partners at Lexington Union, LLC, recently unveiled Le Tesserae , a 20,000-square-foot indoor-outdoor private events venue overlooking Buffalo Bayou and the Houston skyline, capable of hosting up to 1,500 guests. Developed as a greenfield hospitality project, Le Tesserae reflects a growing national shift away from standardized hotel ballrooms toward architecturally distinctive environments designed to create more meaningful and immersive guest experiences.</span></p><p class=\"\"><span>For decades, hotel ballrooms have served as the default infrastructure for weddings, corporate gatherings, and private events. Yet as hospitality has evolved, many of these spaces, built primarily for scale and operational efficiency, have become increasingly commoditized, offering limited architectural identity or emotional resonance. Le Tesserae was conceived as a direct response to this shift: a venue designed not simply to accommodate events, but to elevate them through architectural character that evoke strong feelings.</span></p><p class=\"\"><span>Located at 2990 Clinton Drive, minutes from downtown Houston, Le Tesserae was developed over a multi-year period with a singular guiding principle - that hospitality environments should be built with the permanence and material integrity traditionally reserved for cultural and civic architecture.</span></p><p class=\"\"><span>Guests arrive through a grand reception lobby anchored by a hand-laid mosaic floor composed of millions of individual tiles, each placed to create a surface that feels both intricate and timeless. Overhead, custom crown moldings and architectural detailing establish an immediate sense of permanence and craftsmanship. This arrival sequence was intentionally designed to create a gradual transition from the exterior urban environment into a fully immersive architectural interior.</span></p><p class=\"\"><span>Beyond the lobby, the main ballroom unfolds beneath soaring ceilings and dramatic floor-to-ceiling windows that frame unobstructed views of Houston's skyline and the surrounding natural landscape of Buffalo Bayou. Natural light moves dynamically through the space throughout the day, while seamless transitions between the ballroom, wraparound balcony, and covered outdoor terraces create a continuous dialogue between interior architecture and the surrounding environment.</span></p><p class=\"\"><span>Inspired by European historic spaces and informed by the partners' international travels, Le Tesserae incorporates custom millwork, handmade detailing, and layered architectural finishes designed to conjure the character of longstanding institutions. The result is a newly constructed venue that carries the visual weight and authenticity of a space that has existed for centuries, an increasingly rare quality in modern hospitality development.</span></p><p class=\"\"><span>Complementing the main venue is an adjacent 5,000-square-foot rooftop bar, offering panoramic views of the Houston skyline and introducing an open-air dimension to the property. The rooftop allows hosts to design multi-layered experiences, ranging from welcome receptions and cocktail hours to after-parties and private gatherings, within a single cohesive destination. This layered spatial composition reflects evolving guest expectations, where movement between environments contributes to the overall experiential narrative.</span></p><p class=\"\"><span>Le Tesserae represents the latest development from Kapadia and Pachioli, whose hospitality portfolio spans multiple venues, culinary concepts, and experiential destinations operated under a single umbrella. Over more than a decade, the partners have built their platform with a consistent focus on creating environments where architectural design and guest experience are inseparable.</span></p><p class=\"\"><span>\"Our intention with Le Tesserae was to create something enduring,\" said Kapadia. \"We wanted to build a space defined by craftsmanship and permanence, an environment that feels timeless and elevates the experience of gathering.\"</span></p><p class=\"\"><span>Pachioli added, \"There is a growing recognition that the physical environment plays a central role in how people experience important moments. Le Tesserae reflects our belief that hospitality spaces should be designed with the same care, intention, and architectural integrity as the experiences they host.\"</span></p><p class=\"\"><span>Kapadia and Pachioli began developing their hospitality platform by identifying an opportunity to create event environments that moved beyond the limitations of traditional venues. After raising outside capital during the company's launch, the partners later reacquired full ownership of their business to pursue long-term independent development aligned with their architectural vision.</span></p><p class=\"\"><span>The onset of the COVID-19 pandemic shortly thereafter created one of the most disruptive periods in modern hospitality history, halting operations across the industry. Rather than retreat, Kapadia and Pachioli continued investing in development and infrastructure, advancing Le Tesserae as a reflection of their conviction in experiential hospitality's long-term evolution.</span></p><p class=\"\"><span>The completion of Le Tesserae comes amid growing national demand for architecturally distinctive hospitality environments that offer differentiation beyond standardized event infrastructure. As experiential hospitality continues to evolve, Le Tesserae positions Houston among a select group of cities investing in design-driven destinations defined by architectural integrity, material craftsmanship, and immersive guest experiences.</span></p><p class=\"\"><span>Today, Le Tesserae stands as both an architectural statement and a reflection of its founders' long-term commitment to creating hospitality environments defined by permanence, craftsmanship, and experiential intention.</span></p><p class=\"\"><span>More than a venue, Le Tesserae represents a philosophy, one where architecture, material integrity, and spatial intention converge to create environments designed not simply to host events, but to shape lasting experiences.</span></p><p class=\"\"><span>Person contact: hello@letesseraeevents.com</span></p><p class=\"\"><span>Company Name: letesseraeevents</span></p><p class=\"\"><span>Person name: Romain Kapadia</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Le Tesserae</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSR9N2Ta:0/",
            "pub_date": "2026-02-28 20:35:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zaw4xTjmY:0",
            "title": "ZAWYA-PRESSR: Fintech innovator PaySelect advances payment optimisation for hospitality businesses",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dubai –</span></strong><span> As the UAE continues to strengthen its position as a global tourism and hospitality hub, payment infrastructure is playing a growing role in protecting profitability and financial efficiency. Beyond occupancy levels and room rates, international collections, exchange rate fluctuations, and delayed settlements can quietly impact margins for hotels and restaurants operating across borders.</span></p><p class=\"\"><span>PaySelect, an innovative UAE-based payments comparison platform, is reshaping how hospitality businesses manage their payment infrastructure, enabling them to compare and implement more efficient payment processing, cross-border transactions, and FX solutions tailored to their operations.</span></p><p class=\"\"><span>“Hospitality operators often focus on revenue growth, yet the way funds move into and out of the business has a direct impact on profitability,” said Sissel Nielsen, Founder &amp; CEO of PaySelect. “We work with hotels and restaurants to modernise their payment infrastructure, reduce avoidable international costs, and improve settlement predictability — without disrupting their commercial relationships.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Rethinking international collections</span></strong></p><p class=\"\"><span>Hotels receiving payments from overseas tour operators, travel agencies, and global partners frequently rely on traditional bank transfers that involve intermediary banks, retail FX spreads, and multi-day settlement cycles. These inefficiencies can restrict liquidity and create operational friction, particularly during peak seasons.</span></p><p class=\"\"><span>Through PaySelect’s network of regulated payment and FX partners, hospitality businesses can collect international payments via local accounts in key source markets such as Europe, the UK, and the United States. Overseas partners transact domestically, while funds are consolidated and settled into the UAE more efficiently, often within one business day. This structure improves cash flow visibility, reduces hidden charges, and enhances financial planning across properties.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Supporting franchise and management fee payments</span></strong></p><p class=\"\"><span>Beyond inbound collections, PaySelect also supports outbound cross-border payments, including franchise and management fee transfers to international hotel chains. A UAE-based hotel operating under a European or global brand franchise can leverage PaySelect to identify the most suitable payment gateway or FX partner when remitting fees to its headquarters. By comparing corridor-specific pricing, routing structures, and settlement options, owners gain greater transparency and cost control when fulfilling contractual obligations.</span></p><p class=\"\"><span>Exchange rate structures and routing decisions can materially affect annual profitability for multi-property operators. Even small percentage improvements in FX pricing or settlement timing can translate into significant savings across portfolios.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How restaurants benefit</span></strong></p><p class=\"\"><span>Restaurants and hospitality groups face equally complex requirements, spanning in-venue POS systems, online reservations, deposits, group bookings, events, and international guest payments. Rather than relying on a single provider or navigating multiple sales channels, operators can compare payment gateways, POS providers, and payment link solutions based on transaction volumes, service models, and expansion plans. This enables F&amp;B brands to streamline checkout experiences, reduce transaction costs, and maintain operational flexibility as they scale across locations.</span></p><p class=\"\"><span>“Restaurants today require flexible payment ecosystems, not just terminals,” added Nielsen. “We ensure operators select infrastructure that supports reservations, deposits, events, and international guests, allowing payments to enhance the guest journey rather than complicate it.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Advisory for hospitality groups</span></strong></p><p class=\"\"><span>In addition to its comparison platform, PaySelect provides independent payments consulting to hotel groups across the GCC and MENA. The firm advises multi-property operators on acquiring optimisation, cross-border routing strategy, fee benchmarking, settlement improvements, and FX efficiency. Unlike traditional consultants or single-provider sales teams, PaySelect operates a market-wide advisory model, working closely with more than 20 local and global payment providers. This ecosystem gives hospitality groups direct visibility into pricing structures, provider capabilities across jurisdictions, approval criteria, and risk mitigation — while enabling objective benchmarking and faster implementation.</span></p><p class=\"\"><span>“Our ambition is to remove friction from hospitality payments at every stage,” said Nielsen. “By helping operators build resilient, future-ready payment infrastructure today, we are contributing to a more efficient and globally connected hospitality ecosystem.”</span></p><p class=\"\"><span>As hospitality businesses continue expanding internationally and managing increasingly diverse revenue streams, payment optimisation is becoming a strategic function rather than a back-office task. By simplifying how hotels and restaurants collect, route, and manage payments across borders, PaySelect enables operators to reduce friction behind the scenes — allowing leadership teams to focus on what matters most: delivering exceptional guest experiences, strengthening brand reputation, and expanding their international footprint with confidence.</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zaw4xTjmY:0-zawya-pressr-fintech-innovator-payselect-advances-payment-optimisation-for-hospitality-businesses/",
            "pub_date": "2026-02-28 20:28:45",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zaw46PS7x:0",
            "title": "ZAWYA-PRESSR: Sohar International and Sohar Islamic introduce Ramadan auto financing campaign with rates starting from 3.45%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Muscat</span></strong><strong class=\"root-Tkn6WL2y\"><span>:</span></strong><span> As a bank that has consistently advanced customer-focused financing solutions aligned with evolving lifestyle needs, Sohar International, along with its Islamic banking window, Sohar Islamic, recently launched its Ramadan auto finance campaign. Under the initiative, Sohar International is offering competitive interest rates starting from 3.45% on auto loans, while Sohar Islamic is providing Shariah-compliant auto financing with profit rates also starting from 3.45%. Positioned to enable customers to make timely and well-considered decisions during the Holy Month, the campaign underscores the bank’s continued emphasis on responsible lending practices, disciplined pricing frameworks, and value-oriented financial solutions designed to serve diverse customer segments.</span></p><p class=\"\"><span>Commenting on the offering, Abdul Qadir Al Sumali, Chief Retail &amp; Premier Banking Officer, stated, “Ramadan represents a period of heightened consumer activity, and our responsibility as a leading financial institution is to respond with solutions that balance accessibility with prudent financial discipline. This campaign has been structured within a clearly defined risk and pricing framework, ensuring that competitiveness does not come at the expense of sustainability. Our objective is not merely to stimulate demand, but to enable informed financial decisions through transparent pricing, structured tenors, and value-added features that enhance overall affordability. By aligning our auto finance proposition with evolving customer behavior during the Holy Month, we reinforce our commitment to responsible lending, portfolio quality, and long-term customer financial wellbeing. At Sohar International, growth must be deliberate and sustainable. Through disciplined execution and customer-centric structuring, we continue to strengthen our retail franchise while maintaining the credit integrity that underpins our performance.”</span></p><p class=\"\"><span>Fahad Akbar Al Zadjali, Head of Sohar Islamic, said, “Our approach to Islamic auto finance is rooted in delivering solutions that uphold ethical principles while remaining practical for modern financial requirements. This campaign reflects our focus on transparency, fairness, and responsible structuring, ensuring customers benefit from financing that is both Shariah-compliant and aligned with their long-term financial wellbeing. We continuously work to refine our offerings so they not only meet market expectations but also reinforce trust, clarity, and value at every stage of the customer journey, particularly during Ramadan, a time when financial decisions often carry deeper personal significance.”</span></p><p class=\"\"><span>The Ramadan auto finance campaign offers tenors of up to 10 years, providing customers with the flexibility to structure repayments in alignment with their income cycles and overall financial planning priorities. Beyond competitive pricing, the campaign incorporates practical value enhancements, including complimentary vehicle registration coverage of up to OMR 40, alongside motor protection support of up to OMR 100 when the insurance or takaful policy is obtained through the bank’s approved partners. These features are designed to strengthen overall affordability while delivering measurable and immediate customer value.</span></p><p class=\"\"><span>The offer is extended to both Omani nationals and expatriate residents, subject to applicable income, employment, and age criteria, with eligibility commencing from 18 years for Omani nationals and 21 years for expatriate residents, and extending up to a maximum age of 65 years at finance maturity. Available under both salary transfer and non-salary transfer arrangements, the campaign is supported by a clearly defined documentation framework to ensure a transparent and efficient application process for customers financing either new or used vehicles. By maintaining structured credit standards while enabling flexibility across employment segments, the bank continues to balance accessibility with prudent risk management principles.</span></p><p class=\"\"><span>Sohar International closely monitors market dynamics and customer purchasing patterns, remaining deliberate in refining its product propositions to reflect prevailing market conditions and consumer sentiment. The ongoing campaign exemplifies this adaptive approach, combining timely market responsiveness with sound financial discipline. As customer expectations evolve, the bank remains committed to enhancing its offerings to ensure sustained competitiveness, relevance, and alignment with long-term financial sustainability.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Sohar International:</span></strong></p><p class=\"\"><span>Sohar International is Oman’s fastest-growing bank, guided by a clear vision to become a world-leading Omani service company that helps customers, communities, and people prosper and grow. With a purpose to help people ‘win’ by delivering responsive banking for their ever-changing world, the bank offers innovative solutions across Commercial and Investment Banking, Wealth Management, Islamic Banking, and more. Operating with a strong digital-first approach and an expanding regional footprint—including presence in the Kingdom of Saudi Arabia—Sohar International is committed to driving value through strategic partnerships and a dynamic customer experience. Learn more at www.SIB.om</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zaw46PS7x:0-zawya-pressr-sohar-international-and-sohar-islamic-introduce-ramadan-auto-financing-campaign-with-rates-starting-from-3-45/",
            "pub_date": "2026-02-28 20:28:54",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002098:0",
            "title": "These fintech stocks are loved by analysts and could bounce back in a big way",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Emily Bary and Philip van Doorn</span></p><p class=\"\"><span>Shares of PayPal and Block are both cheap relative to historic levels, but only one of them commands heavy enthusiasm from analysts</span></p><p class=\"\"><span>PayPal and Block are examples of financial-technology stocks trading at low price-to-earnings ratios relative to their three-year average valuations.</span></p><p class=\"\"><span>Financial-technology stocks have been battered in recent years - and now may be worth a fresh look.</span></p><p class=\"\"><span>The Global X FinTech ETF FINX has fallen 48% over the past five years, while the S&amp;P 500 SPX has risen 80% and the S&amp;P 500 financials sector XX:SP500.40 has increased 59%. Analysts now see plenty of opportunity in the fintech sector, particularly as valuations have come down for some high-profile names.</span></p><p class=\"\"><span>Recent actions in the payment-technology industry suggest that major players are getting more serious about improving operating performance. Block (XYZ), the parent of Square and Cash App, said this week that it would slash more than 40% of its workforce in a bid to drive operational efficiencies and reduce organizational friction. Management said that artificial-intelligence tools are driving major productivity benefits that will enable the company to do more with less.</span></p><p class=\"\"><span>See more: Block says AI will allow it to cut more than 4,000 jobs. Some argue that's not the whole story.</span></p><p class=\"\"><span>Block CFO Amrita Ahuja told MarketWatch that the move came from a \"position of strength,\" as the company simultaneously announced fourth-quarter results that exceeded the consensus view. But the reality is that Block shares have plunged 77% from their 2021 peak, as pricey acquisitions have failed to yield commensurate financial benefits and as fintech valuations have receded from pandemic-era levels.</span></p><p class=\"\"><span>In turn, the stock's valuation is now more compelling. As of Friday's close, Block was trading at 17.4-times estimated earnings per share over the next 12 months, according to LSEG data. That valuation compares with a three-year average price-to-earnings multiple of 24.2 for its stock. Block is heavily favored by analysts working for brokerage and research firms polled by LSEG, as you can see below.</span></p><p class=\"\"><span>Then there's PayPal Holdings (PYPL), which in early February announced that Enrique Lores, formerly of HP (HPQ), would be taking over as CEO after prior turnaround attempts failed to manifest quickly enough. Critics have noted that PayPal underinvested in its core business, ceded its first-mover advantages to Apple Pay (AAPL) and moved too slowly with its push to monetize Venmo.</span></p><p class=\"\"><span>Some analysts are now intrigued by the possibility of a breakup or outright sale of the company. Lores doesn't exactly have a payments-sector background, but PayPal called him the \"lead architect\" of the 2015 split of HP and Hewlett Packard Enterprise (HPE). And Bloomberg News reported earlier this week that multiple entities have expressed early interest in buying either parts of the company or all of it. PayPal declined to comment on those talks.</span></p><p class=\"\"><span>See also: PayPal's stock pops on takeover hopes. Here's who could swoop in with a purchase.</span></p><p class=\"\"><span>Off 85% from their 2021 peak, PayPal shares sport a potentially compelling forward P/E valuation of 8.6, compared with a three-year average valuation of 12.4.</span></p><p class=\"\"><span>Then again, Wall Street analysts aren't enthusiastic about PayPal, even at the current low P/E level: Only 10 out of 45 analysts polled by LSEG who cover the company rate the stock a buy or the equivalent.</span></p><p class=\"\"><span>See more: Could Stripe 'salvage' PayPal? What Wall Street has to say about the latest takeover talk.</span></p><p class=\"\"><span>For more perspective on the valuations, the S&amp;P 500 trades at a forward P/E of 21.6, while its financial sector trades at a forward P/E of 15.3. Payment-processing stalwarts Visa (V) and Mastercard (MA), which have competitive moats and enviable profit margins, trade at respective P/E valuations of 23.6 and 25.7. Those are well below the three-year average forward P/Es of 27.6 for Visa and 31 for Mastercard.</span></p><p class=\"\"><span>Investors have been worried about a laundry list of issues, including regulatory changes, economic prospects and whether there's simply much more room to convert cash-based payments over to cards. The stocks even got hit in the wake of Citrini Research's viral blog post floating a futuristic scenario in which AI-fueled stablecoins disrupt established payment networks and AI-driven productivity boosts force mass underemployment, leaving knowledge workers with less money to spend.</span></p><p class=\"\"><span>\"The sad truth in this market is also that if you have to say 'xyz is not an AI loser but a winner,' then you have already lost (at least the debate),\" Bernstein analyst Harshita Rawat wrote in a note to clients earlier this week. But she also noted that Mastercard and Visa have \"two-sided networks across billions of consumers and hundreds of millions of merchants\" that confer major incumbency advantages.</span></p><p class=\"\"><span>See more: How to play payments stocks after essentially their worst run in 15 years</span></p><p class=\"\"><span>MarketWatch conducted a broader screen of fintech stocks to assess which are most favored by analysts. We narrowed our universe to the 41 U.S. companies in the Global X FinTech ETF that are expected to generate positive 12-month earnings per share and that are covered by at least five analysts. That left us with 34 companies, and we also added Visa and Mastercard.</span></p><p class=\"\"><span>Among those, 18 are rated a buy or the equivalent by at least two-thirds of the analysts covering them, according to LSEG data. Here's the full list, sorted by ascending forward P/E:</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>   Company                             Forward P/E  Feb. 27 price  Consensus price target  Implied 12-month upside potential  2026 price change </span><br/><span>   LendingTree Inc.                            7.3         $37.37                  $81.33                               118%               -30% </span><br/><span>   LendingClub Corp.                           8.1         $14.91                  $24.01                                61%               -21% </span><br/><span>   SS&amp;C Technologies Holdings Inc.            10.8         $75.29                 $100.92                                34%               -14% </span><br/><span>   Mitek Systems Inc.                         12.1         $14.58                  $15.00                                 3%                38% </span><br/><span>   ACI Worldwide Inc.                         13.1         $39.68                  $62.65                                58%               -17% </span><br/><span>   Sezzle Inc.                                14.9         $72.95                  $97.00                                33%                15% </span><br/><span>   Intuit Inc.                                16.0        $409.03                 $630.51                                54%               -38% </span><br/><span>   Payoneer Global Inc.                       16.3          $4.32                   $8.19                                90%               -23% </span><br/><span>   HealthEquity Inc.                          16.5         $76.49                 $116.94                                53%               -17% </span><br/><span>   Block Inc.                                 17.4         $63.70                  $83.88                                32%                -2% </span><br/><span>   i3 Verticals Inc.                          19.0         $22.38                  $31.33                                40%               -11% </span><br/><span>   Jack Henry &amp; Associates Inc.               23.2        $162.46                 $203.58                                25%               -11% </span><br/><span>   Visa Inc.                                  23.6        $320.14                 $400.90                                25%                -9% </span><br/><span>   Blend Labs Inc.                            23.9          $1.68                   $4.21                               151%               -45% </span><br/><span>   Mastercard Inc.                            25.7        $517.21                 $661.68                                28%                -9% </span><br/><span>   Paymentus Holdings Inc.                    29.3         $24.47                  $33.32                                36%               -23% </span><br/><span>   Affirm Holdings Inc.                       30.6         $46.98                  $85.06                                81%               -37% </span><br/><span>   Guidewire Software Inc.                    41.5        $145.32                 $249.79                                72%               -28% </span><br/><span>                                                                                                                                Source: FactSet </span></pre><p class=\"\"><span>Related: Financial stocks are off to their worst yearly start in a decade. How to spot value.</span></p><p class=\"\"><span>-Emily Bary -Philip van Doorn</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002098:0/",
            "pub_date": "2026-02-28 20:30:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zawb0XyzG:0",
            "title": "ZAWYA-PRESSR: Dubai real estate surges in February 2026 with AED 60.6bln in sales",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The second month of 2026 showed exceptional momentum, recording strong sales across both residential and commercial sectors, supported by strong investor confidence.</span></p><p class=\"\"><span>According to the Dubai Land Department (DLD), the total sales reached 16,959, generating a total value of AED 60.60 billion. This demonstrates a 5% increase in sales and 18.14% increase in value compared to February 2025. The city recorded 10,526 off-plan sales, approximately 62% of the total sales. Ready sales account for 38%, totaling 6,437. A total of 738 gift sales have been registered, with a combined value of AED 6.86 billion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Mortgage Market</span></strong></p><p class=\"\"><span>The mortgage-backed transactions are on an upward trajectory. A total of 3,867 mortgage transactions were registered, totaling AED 16.43 billion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sales Comparison by Property Type</span></strong></p><p class=\"\"><span>Here is the detailed comparison of February 2025 vs February 2026:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Property Type</span></p></td><td><p class=\"\"><span>Total Sales in February 2025</span></p></td><td><p class=\"\"><span>Total Sales Value in February 2025</span></p></td><td><p class=\"\"><span>Total Sales in February 2026</span></p></td><td><p class=\"\"><span>Total Sales Value in February 2026</span></p></td></tr><tr><td><p class=\"\"><span>Apartment</span></p></td><td><p class=\"\"><span>11,385</span></p></td><td><p class=\"\"><span>AED 21.7 billion</span></p></td><td><p class=\"\"><span>12,820</span></p></td><td><p class=\"\"><span>AED 26.6 billion</span></p></td></tr><tr><td><p class=\"\"><span>Villa</span></p></td><td><p class=\"\"><span>3,966</span></p></td><td><p class=\"\"><span>AED 19.7 billion</span></p></td><td><p class=\"\"><span>1,563</span></p></td><td><p class=\"\"><span>AED 6.4 billion</span></p></td></tr><tr><td><p class=\"\"><span>Commercial</span></p></td><td><p class=\"\"><span>443</span></p></td><td><p class=\"\"><span>AED 1.2 billion</span></p></td><td><p class=\"\"><span>717</span></p></td><td><p class=\"\"><span>AED 9.54 billion</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Top Performing Areas by Volume</span></strong></p><p class=\"\"><span>The following are the top-performing areas by volume:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Area</span></p></td><td><p class=\"\"><span>Sales Volume</span></p></td></tr><tr><td><p class=\"\"><span>Jumeirah Village Circle</span></p></td><td><p class=\"\"><span>1,146</span></p></td></tr><tr><td><p class=\"\"><span>Al Yelayiss 1</span></p></td><td><p class=\"\"><span>916</span></p></td></tr><tr><td><p class=\"\"><span>Madinat Al Mataar</span></p></td><td><p class=\"\"><span>828</span></p></td></tr><tr><td><p class=\"\"><span>Dubai Land Residence Complex (DLRC)</span></p></td><td><p class=\"\"><span>750</span></p></td></tr><tr><td><p class=\"\"><span>Business Bay</span></p></td><td><p class=\"\"><span>733</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Top Performing Areas by Value</span></strong></p><p class=\"\"><span>These areas are the best-performing areas in terms of value:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Area</span></p></td><td><p class=\"\"><span>Sales Value</span></p></td></tr><tr><td><p class=\"\"><span>Al Yelayiss 1</span></p></td><td><p class=\"\"><span>AED 5,384,203,445</span></p></td></tr><tr><td><p class=\"\"><span>Al Yelayiss 5</span></p></td><td><p class=\"\"><span>AED 2,409,324,184</span></p></td></tr><tr><td><p class=\"\"><span>Me’Aisem Second</span></p></td><td><p class=\"\"><span>AED2,266,888,144</span></p></td></tr><tr><td><p class=\"\"><span>Business Bay</span></p></td><td><p class=\"\"><span>AED 2,205,729,585</span></p></td></tr><tr><td><p class=\"\"><span>Palm Jumeirah</span></p></td><td><p class=\"\"><span>AED 1,886,308,416</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Most Expensive Projects Sold in February 2026</span></strong></p><p class=\"\"><span>The following are the most expensive apartment projects sold in February 2026:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>The Alba Residences by Omniyat: AED 225,965,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Peninsula Dubai Residences - Tower 2: AED 210,000,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Solara Tower Dubai: AED 113,658,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Passo by Beyond: AED 98,000,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Como Residences: AED 63,504,800</span></li></ul><p class=\"\"><span>The most expensive villas sold in February 2026 are given below:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>EOME at Palm Jumeirah: AED 115,000,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Zaya Zuha Island at The World Islands: AED 68,575,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Zaya Zuha Island at The World Islands: AED 68,575,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Zaya Zuha Island at The World Islands: AED 68,575,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Amali Island at The World Islands: AED 68,400,000</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Best-Selling Projects in February 2026</span></strong></p><p class=\"\"><span>The following are the best-selling projects in February 2026:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Project</span></p></td><td><p class=\"\"><span>Type</span></p></td><td><p class=\"\"><span>Volume</span></p></td><td><p class=\"\"><span>Value</span></p></td></tr><tr><td><p class=\"\"><span>Maybach Six</span></p></td><td><p class=\"\"><span>Apartment</span></p></td><td><p class=\"\"><span>433</span></p></td><td><p class=\"\"><span>AED 722,253,980</span></p></td></tr><tr><td><p class=\"\"><span>Hado by Beyond</span></p></td><td><p class=\"\"><span>Apartment</span></p></td><td><p class=\"\"><span>213</span></p></td><td><p class=\"\"><span>AED 783,968,840</span></p></td></tr><tr><td><p class=\"\"><span>Damac Islands 2 - Bahamas 1</span></p></td><td><p class=\"\"><span>Villa</span></p></td><td><p class=\"\"><span>139</span></p></td><td><p class=\"\"><span>AED 449,573,000</span></p></td></tr><tr><td><p class=\"\"><span>Damac Islands 2 - Bahamas 2</span></p></td><td><p class=\"\"><span>Villa</span></p></td><td><p class=\"\"><span>126</span></p></td><td><p class=\"\"><span>AED 391,570,330</span></p></td></tr></tbody></table></div><p class=\"\"><span>Tara Khan, Sales Director of Kelt and Co Realty, said, “Hitting over AED 60 billion in sales volume solidifies Dubai’s position as one of the globe’s most resilient and desirable real estate hubs. This surge is driven by a balanced blend of end-user demand and enduring investor confidence. The market has reached a mature phase – price growth is steady, supply is strategically managed, and buyer involvement is across emerging and established communities.”</span></p><p class=\"\"><span>She added, “These numbers demonstrate a clear transformation in Dubai’s global image. It has become a preferred destination for long-term residents looking for stability, a luxurious lifestyle, and better opportunities.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Kelt and Co</span></strong></p><p class=\"\"><span>Kelt and Co Realty is a prominent real estate agency in Dubai, offering the highest standards of service. Their professionals leverage years of experience and in-depth market knowledge to provide bespoke guidance to the clients, ensuring they make well-informed and strategic decisions. From buying and selling to property management, handover, and investment consultancy, Kelt and Co Realty is dedicated to maintaining the highest standards of professionalism, integrity, and client satisfaction.</span></p><p class=\"\"><span>For more inquiries, contact us at:</span></p><p class=\"\"><span>Website: www.keltandcorealty.com</span></p><p class=\"\"><span>Email: info@keltandcorealty.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zawb0XyzG:0-zawya-pressr-dubai-real-estate-surges-in-february-2026-with-aed-60-6bln-in-sales/",
            "pub_date": "2026-02-28 20:30:06",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:7841660ad094b:0",
            "title": "Micron Celebrates Opening of India’s First Semiconductor Assembly and Test Facility",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><em><span>State-of-the-art site in Sanand, Gujarat, expands Micron’s global footprint and advances India's semiconductor ecosystem</span></em></p><p class=\"\"><span>SANAND, India, Feb. 28, 2026 (GLOBE NEWSWIRE) -- Micron Technology, Inc. </span><span> today celebrated the grand opening of its semiconductor assembly and test facility in Sanand, Gujarat, India. The state-of-the-art facility converts advanced DRAM and NAND wafers from Micron's global manufacturing network into finished memory and storage products. Once fully ramped, the first phase of Micron’s Sanand operation will feature more than 500,000 square feet of cleanroom space, making it one of the world’s largest single-floor assembly and test cleanrooms. The site serves customers worldwide to meet the growing global demand for memory and storage fueled by AI.</span></p><p class=\"\"><span>The facility represents a combined investment of approximately $2.75 billion by Micron and its government partners, advancing semiconductor manufacturing capabilities in India. Micron Chairman, President and CEO Sanjay Mehrotra and other executives witnessed the opening ceremony with Prime Minister Narendra Modi, Chief Minister of Gujarat Bhupendra Patel, Union Minister for Railways, Communications, Electronics &amp; IT Ashwini Vaishnaw, U.S. Ambassador to India Sergio Gor and other distinguished government officials and guests.</span></p><p class=\"\"><span>\"Today is a proud moment for Micron and India's growing semiconductor industry,\" said Sanjay Mehrotra, Chairman, President and CEO of Micron Technology. “This pioneering facility, the first assembly and test site of its kind in the country, helps build a resilient ecosystem that underpins the global AI economy. We are deeply grateful to the government of India, the Gujarat government and all of the partners involved for their steadfast support in making this achievement possible.\"</span></p><p class=\"\"><span>The Sanand site is ISO 9001:2015 certified and has begun commercial production. To mark the grand opening of the site, Micron presented its first shipment of made-in-India memory modules to Dell Technologies for its laptops made in India for India. Micron expects to assemble and test tens of millions of chips at Sanand in 2026, scaling to hundreds of millions in 2027. The expansion of conventional assembly and test operations in India complements Micron's planned development of advanced manufacturing and packaging capabilities in the United States and strengthens the company’s global assembly and test network.</span></p><p class=\"\"><span>“The inauguration of Micron’s semiconductor facility in Sanand marks a historic milestone as Bharat begins its first commercial semiconductor chip production,” said Union Minister Ashwini Vaishnaw. “This is a decisive step towards building a trusted, resilient and self-reliant semiconductor ecosystem under the leadership of Hon’ble PM Shri Narendra Modi Ji. India is now moving from being a consumer of chips to becoming a global hub for semiconductor manufacturing and innovation.”</span></p><p class=\"\"><span>Micron is building India's next generation of semiconductor talent to support its operations in India. Through partnerships with Pandit Deendayal Energy University (PDEU), Namtech, leading universities nationwide and government-sponsored skills development programs, Micron is supporting STEM education, specialized training, workforce readiness for advanced manufacturing roles and community initiatives, including digital and AI literacy programs across the region. </span></p><p class=\"\"><span>Micron built and is operating the assembly and test facility in accordance with the company's sustainability goals, rigorous health and safety standards, and with local and global environmental commitments. The facility is designed to meet or exceed Leadership in Energy and Environmental Design (LEED) Gold standards. Additionally, the facility uses advanced water-saving technologies to enable zero liquid discharge.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Micron Technology, Inc.</span></strong></p><p class=\"\"><span>Micron Technology, Inc. is an industry leader in innovative memory and storage solutions, transforming how the world uses information to enrich life for all. With a relentless focus on our customers, technology leadership and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND and NOR memory and storage products. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence (AI) and compute-intensive applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience. To learn more about Micron Technology, Inc. </span><span>, visit </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=fDrOUEAZn5LqvSxeNPPe4D_xwzKD0HnBL7R9VEzobcQTxFtlf-6i7Rg46dS99rrYhuA4nQAdgOKPpgdWBPEWWMIi3m8wwYeOv24kfuUzqJ23uSUj1gzWBkhLl4FwSd8Tg3VmbHYatVAnuWDO2KWDYdHgWg7xhMWZOpFRlXpbCyOdqJCUADeivsp58Qq0RdqiDVwgRVMLjxO80yMtO7SnTBMTnwACIVY0SNh_THJtaBw=\" rel=\"nofollow\" target=\"_blank\">micron.com</a><span>.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Statements</span></strong></p><p class=\"\"><span>This press release contains forward-looking statements, including statements regarding expectations of future production. These forward-looking statements are subject to a number of risks and uncertainties that could cause actual results to differ materially. Please refer to the documents Micron files with the Securities and Exchange Commission, specifically its most recent Form 10-K and Form 10-Q. These documents contain and identify important factors that could cause actual results to differ materially from those contained in these forward-looking statements. These certain factors can be found at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=NC-nl8nRSqrnSBHdL7bCRvazZeBw8slMHFOijMJ8kj3HkOnzWIbnHSYtRT9DZH9DmAg3ALcMsSZmrv6jSWkquGtcghaFlNBmsgT529HRBs0hxIY2wI41KKRsY4c1Je3uPL1RToJRZnSErkh-7meWotlp0nX7Cb0NBH7PuW1YIyZ0n-LgjSV6Ii_ZHA9rczmPQT-s0A02svSI827yVCPX6hvwagkylVR6m0cJebJ6a0u2zzcCMiXo4bIltCIAcqqc0beDBhuRW7XOfNlEtcJeEQzjCIvE1isWfF7XcG6NWSGRMEcZM3x16YR5VBcwpn9kpDvlhZIGRqpmO58FRBtqcitRpdN6ArHCuqjYYtC2P7NOXJV2fa0cMj0MXm01s6ia1hypQVeeU0j8eQvJgcErDJo69AaVnRA85hDulKHtKRcU7ZMnHnSLars9gXb4dh_T5ntleCDJf5mVamcMmW_3IxQo7nVERswoNSDekMjrDPaoO64p9IOCrLkLs-3yhLbVbUANfrSNrvE_yb7ueSPNtMNJOSS96wWrSrZ-9yEBtVJsJu6qm9cj62fLD5RU_sxOiNwoYh-l5TDm6Rmf0QhQoZYXfJhMNEfIeX9zGsUAO-ic4tlgSM0KzSshTHH6ixLG\" rel=\"nofollow\" target=\"_blank\">https://investors.micron.com/risk-factor</a><span>. Although Micron believes that the expectations reflected in the forward-looking statements are reasonable, Micron cannot guarantee future results, levels of activity, or achievements. Micron is under no duty to update any of the forward-looking statements after the date of this press release to conform these statements to actual results.</span></p><p class=\"\"><em><span>© 2026 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Micron Media Relations Contact</span></strong></p><p class=\"\"><span>Mark Plungy</span></p><p class=\"\"><span>+1 (408) 203-2910</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=dkOGVJ4qa_0Xrq1utlto4zvMv-J5etcUgQQIYP-Kpp0LSYYqa1MmN-WvHlJQK2YbxPorG2EUz_C4M0aCXLi0anxuJuY8qC_770baO9Ppb82OZWEQweiCfhKgguDGgrAeW9cKCNaKfM6e47oFlY2vPdIkI6KNIMrP27a24Q-M0gweuPNZZQJQMpQZBm59hBs8Wf5igKV5zo6EfrkZ_twxtbvKG2lKFVH-aXkEqrBCgrHdr_8bZNNQ2moEmGPZ9H2Gcbvi9IHphKAS40tKaj1cqg==\" rel=\"nofollow\" target=\"_blank\">corpcomms@micron.com</a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Micron Investor Relations Contact</span></strong><span> </span></p><p class=\"\"><span>Satya Kumar </span></p><p class=\"\"><span>+1 (408) 450-6199 </span></p><p class=\"\"><span>satyakumar@micron.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:7841660ad094b:0-micron-celebrates-opening-of-india-s-first-semiconductor-assembly-and-test-facility/",
            "pub_date": "2026-02-28 20:00:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ObikgcHYa:0",
            "title": "Hofseth International Q4 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Quarterly report Hofseth International Q4 2025</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667189</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ObikgcHYa:0-hofseth-international-q4-2025/",
            "pub_date": "2026-02-28 20:03:09",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACShVYv2a:0",
            "title": "MEWA Launches the First Saudi Water Week Next April to Shape the Future of the Water Sector Regionally and Globally",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>MEWA Launches the First Saudi Water Week Next April</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>RIYADH, SA / ACCESS Newswire / February 28, 2026 /</span></strong><span> The Ministry of Environment, Water and Agriculture will inaugurate the first Saudi Water Week during the second week of April. This premier national and international forum will convene policymakers, specialists, researchers, private sector entities, and relevant water sector organizations from both within Saudi Arabia and internationally. This initiative underscores the Ministry's sustained commitment to bolstering water security, reinforcing the sustainable governance of water resources, and fostering scientific research and innovation within this critical sector.</span></p><p class=\"\"><span>The Ministry clarified that the Saudi Water Week will feature several specialized events, including the Arab Water Forum and the Second Stakeholders Meeting for the World Water Forum 2027, in addition to detailed presentations of the achievements of the water sector in the Kingdom and other national sectors.</span></p><p class=\"\"><span>The organization of Saudi Water Week comes as an extension of the Kingdom's leading role in developing the water system locally, regionally, and internationally. It aims to enhance the exchange of experiences, discuss common challenges, review practical solutions and modern technologies, and support partnerships and quality investments in the water sector, in line with the objectives of the Kingdom's Vision 2030.</span></p><p class=\"\"><span>The Saudi Water Week is expected to receive widespread media attention at the local, regional, and international levels, due to its strategic importance and the vital issues it raises concerning the future of water, its sustainability, and its role in supporting comprehensive development and quality of life.</span></p><p class=\"\"><span>It is noted that the World Water Forum 2027, scheduled to be held in Riyadh, is the world's largest event in water issues, with broad participation from countries, international organizations, and experts. The second stakeholders meeting of the World Water Forum, held within the Saudi Water Week, is seen as one of the pivotal stations in the preparatory path for this global event, reflecting the Kingdom's advanced position and its influential role in leading international efforts to address water challenges and enhance global cooperation in this field.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For Registration:</span></strong></p><p class=\"\"><span>https://swweek.mewa.gov.sa</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information:</span></strong></p><p class=\"\"><span>Ministry of Environment, Water and Agriculture (MEWA)</span></p><p class=\"\"><span>info@mewa.gov.sa</span></p><p class=\"\"><span>0112038888</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Ministry of Environment, Water and Agriculture</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACShVYv2a:0/",
            "pub_date": "2026-02-28 19:56:27",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000661:0",
            "title": "Coal Power's Comeback Isn't Spurring New Investment — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Jennifer Hiller</span></p><p class=\"\"><span>Coal-fired power generation is having something of a moment. It isn't clear just how long it will last.</span></p><p class=\"\"><span>President Trump is trying to throw a lifeline to coal, the once-dominant fuel source for the U.S. power grid that has been in steep decline for more than 15 years. His efforts, combined with the boom in construction of power-hungry artificial-intelligence data centers, could keep coal plants that were once slated for retirement operating years longer than expected.</span></p><p class=\"\"><span>The Trump administration has ordered an expansion of coal mining, leasing and exports, while requiring a handful of power plants to continue operating past their expected retirement dates.</span></p><p class=\"\"><span>Trump touted coal on the campaign trail and included it in his day-one executive order declaring an energy emergency. An electricity capacity crunch has emerged as new artificial-intelligence data centers strain power supplies.</span></p><p class=\"\"><span>\"I don't use the word coal,\" Trump said at a White House event this month. \"It needs a PR job because it had a bad reputation for a while. It has to be preceded by 'beautiful, clean' coal. We're cleaning it up.\"</span></p><p class=\"\"><span>Extreme weather and gas price spikes have created recent openings for coal. Coal generation increased about 13% in 2025 from the previous year as higher natural gas costs made coal more competitive, according to the Energy Information Administration. In January, coal generation soared again as a winter storm brought freezing temperatures to much of the country and natural-gas prices rose.</span></p><p class=\"\"><span>The National Mining Association has pointed to those events and said access to coal-fired generation has helped keep the lights on and prevent greater spikes in customer bills.</span></p><p class=\"\"><span>\"The cost of our AI-powered future is showing up on Americans' electricity bills; states with greater access to coal generation are in a much better position to manage that price volatility,\" said Rich Nolan, president and chief executive of the association.</span></p><p class=\"\"><span>Energy Secretary Chris Wright last week called coal the \"MVP of recent winter storms\" while renewing an emergency order to keep a coal plant in Michigan operating.</span></p><p class=\"\"><span>\"The energy sources that perform when you need them most are inherently the most valuable,\" Wright said.</span></p><p class=\"\"><span>Although the AI boom has helped create a window of opportunity for coal, it won't be long-lived, said Gary Dorris, chief executive and founder of Ascend Analytics, which forecasts power prices and provides software for financial modeling and resource planning.</span></p><p class=\"\"><span>\"The economics of this are a gravitational force that can't be ignored by or overwritten by politics,\" Dorris said.</span></p><p class=\"\"><span>Particularly in markets west of the Mississippi River, renewable energy projects can push wholesale electricity prices sharply lower, or even negative, for several hours every day. Generators pay grid operators to take power. Coal plants, which can't easily shut down and restart, either operate at a loss during those hours or ramp down to levels that are inefficient and cause mechanical wear and tear, Dorris said. That makes coal operations difficult to sustain.</span></p><p class=\"\"><span>\"The question becomes, how long and at what rate will the legacy coal continue into the future?\" Dorris asked.</span></p><p class=\"\"><span>The Rhodium Group estimates that economywide emissions increased 2.4% in 2025, growing faster than the overall economy. A colder winter drove more space heating and fuel use in buildings, while in the power industry coal generation grew.</span></p><p class=\"\"><span>Power plant stacks emitted more sulfur dioxide, nitrogen oxide and carbon dioxide last year, according to an analysis of government data.</span></p><p class=\"\"><span>Coal was once the largest fuel source for electricity generation in the U.S. but began a steep slide around 2008. A surge in domestic natural gas supplies unleashed by the shale boom undercut coal's economics, as did cheap renewables, while state environmental policies accelerated the shift away from coal. Hundreds of plants closed.</span></p><p class=\"\"><span>Expenses at a coal plant are roughly double that of a natural gas plant, according to Energy Department data. They might require a few hundred workers versus dozens. Between 2011 and 2019, more than 100 coal plants were converted to or replaced by natural gas-fired plants, according to the Energy Information Administration.</span></p><p class=\"\"><span>Jim McMahon, head of the energy practice at Charles River Associates, said the closures were driven by a combination of high costs, the availability of cheaper renewables and an era of flat electricity demand. Many utilities and plant operators independently made the decision to close their coal plants.</span></p><p class=\"\"><span>\"Suddenly everyone took action and many coal plants were on the chopping block or getting retired,\" McMahon said. \"And then you had all this growth. Capacity became king.\"</span></p><p class=\"\"><span>Projections for future electricity demand vary widely, but all forecasts point up. Consulting firm ICF expects U.S. power demand to rise 25% by 2030 from 2023's levels, largely because of data center needs.</span></p><p class=\"\"><span>The Trump administration's latest action to boost coal came last week with the rollback of mercury and other toxic emission standards for coal-fired power plants. The move reverses more stringent Biden-era standards to levels established in 2012.</span></p><p class=\"\"><span>The president recently signed an executive order that directs the Defense Department to buy electricity from coal plants and issued federal awards for retrofits and upgrades at power plants in West Virginia, Ohio, North Carolina and Kentucky.</span></p><p class=\"\"><span>Analysts at ClearView Energy Partners consider the actions by the Trump administration \"more likely to extend lifetimes for existing coal mining and generation assets than spur new investment.\"</span></p><p class=\"\"><span>Units at 29 coal-fired power plants are slated for retirement through 2028, according to ClearView. So far, four of those plants are operating under emergency orders to stay open, while the Tennessee Valley Authority this month reversed plans to close two coal plants.</span></p><p class=\"\"><span>Still, even as U.S. electricity generation is set to climb 1.4% this year and 2.5% next, the spoils will largely bypass coal, the EIA projects.</span></p><p class=\"\"><span>Solar and wind output are expected to rise. So is hydropower following two historically dry summers. Coal-fired power generation could fall by 6% this year and 4% in 2027, with some plants retiring or remaining idle while still connected to the grid, the EIA said.</span></p><p class=\"\"><span>Write to Jennifer Hiller at jennifer.hiller@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000661:0/",
            "pub_date": "2026-02-28 20:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002071:0",
            "title": "Any chance the Fed cuts rates this year is 'evaporating before our very eyes' as Iran tensions raise oil prices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Greg Robb</span></p><p class=\"\"><span>Experts see high potential for a military strike</span></p><p class=\"\"><span>President Donald Trump greets members of the Joint Chiefs of Staff as he arrives to deliver his State of the Union address on Tuesday.</span></p><p class=\"\"><span>With oil prices rising in response to growing tensions with Iran, the rationale for additional interest-rate cuts by the Federal Reserve is disappearing.</span></p><p class=\"\"><span>\"The argument for having lower rates is just evaporating right before our very eyes,\" said Brian Bethune, an economist at Boston College, in an interview. The uptick in oil prices combined with the Trump administration's aggressive approach to tariffs is putting upward pressure on inflation, complicating any Fed rate cut, he said.</span></p><p class=\"\"><span>Over the past several months, the Fed has struggled to tamp down inflation amid pressure from the White House and the markets to cut rates. These latest developments only add to the central bank's challenges.</span></p><p class=\"\"><span>Prices at the wholesale level started to accelerate in December and are running at a 3% annual rate, frustrating Federal Reserve officials who hoped that the taxes on imports would only have a transitory impact on inflation. It's likely that the increase in producer prices will soon be passed on to consumers, said Ethan Harris, former chief economist at BofA Securities, in a note on LinkedIn.</span></p><p class=\"\"><span>Inflation is looking like it is heating up in the first quarter, agreed Scott Anderson, chief U.S. economist at BMO Capital Markets. Core personal-consumption expenditures could rise to 3.1% annual rate in January, the highest rate in two years - and that's before any impact from a potential U.S. strike on Iran. The Fed's target for inflation is 2%.</span></p><p class=\"\"><span>Any $10 increase in crude-oil prices is estimated to raise consumer-price inflation by 0.2% to 0.4% over the coming year, Anderson said.</span></p><p class=\"\"><span>WTI crude-oil futures (CL00) (CLJ26) are up about 16% year to date, or $10 per barrel since the beginning of the year.</span></p><p class=\"\"><span>\"Just the growing risk of a conflict with Iran is already impacting energy markets and prices, adding to U.S. inflation pressures and creating major headwinds for further Fed rate cuts,\" Anderson said.</span></p><p class=\"\"><span>A prolonged conflict might raise the possibility that the central bank's next move would be to raise interest rates, he added.</span></p><p class=\"\"><span>\"You're really talking about problems for the Fed in terms of putting a lid on inflation,\" Bethune said. \"In this situation, the Fed can't lower rates.\"</span></p><p class=\"\"><span>Traders in derivate markets still expect two quarter-point rate cuts this year, with the first coming in June and the second in September.</span></p><p class=\"\"><span>Both tariffs and oil prices are supply shocks, raising the costs of inputs into production of the economy, which are very hard for the Fed to cool.</span></p><p class=\"\"><span>The Fed's interest-rate tool works more on the demand side of the economy, by either spurring companies and consumers to spend or nudging them to pull back.</span></p><p class=\"\"><span>Military action in Iran is likely, analysts say</span></p><p class=\"\"><span>Oil prices are expected to spike if there is any attack on Iran, with the only debate about how long the higher prices might last.</span></p><p class=\"\"><span>Analysts see a very high potential for some kind of military strike on Iran in the coming weeks.</span></p><p class=\"\"><span>There has been a \"slow-motion effort\" to get U.S. military assets in the Middle East region since January, said Suzanne Maloney, director of the Foreign Policy program at the Brookings Institution.</span></p><p class=\"\"><span>U.S. military action against Iran \"seems more likely than not,\" said Christopher Granville, managing director of TS Lombard, a macroeconomic forecasting consultancy firm based in London.</span></p><p class=\"\"><span>Granville said a military confrontation between the U.S. and Iran is unlikely to send the global economy into a full-blown oil crisis and stagflationary shock. Still, it's possible we'll face an \"oil squall\" similar to what happened after Russia invaded Ukraine in early 2022, when oil prices surged over $100 a barrel and remained high for six months.</span></p><p class=\"\"><span>That so-called squall was enough to fuel inflation in the U.S., with the core PCE price index rising at an annual pace of 5.6% in September 2022, the highest rate in almost 40 years.</span></p><p class=\"\"><span>Still, many economists say it's hard to forecast the future in the Middle East and how any confrontation would impact oil prices. Bank analysts still expect 2026 average prices to remain around the low $60-a-barrel range.</span></p><p class=\"\"><span>Karen Young, senior research scholar at the Center for Global Energy Policy at Columbia University, said any price spike depends on whether the Iranian regime strikes oil-production facilities of its neighbors in the Middle East in response to U.S. action.</span></p><p class=\"\"><span>Iran also has the ability to disrupt the flow of oil through the Strait of Hormuz, a crucial maritime passage connecting the Persian Gulf with the Gulf of Oman and the Arabian Sea.</span></p><p class=\"\"><span>Vali Nasr, a professor at the Johns Hopkins University's School of Advanced International Studies, thinks it is likely that Iran tries to hit its neighbors.</span></p><p class=\"\"><span>The Iranian government's conclusion is that if President Trump calculates that war is cost-free, \"he's going to continue doing it,\" Nasr said during a discussion of the conflict earlier this week sponsored by the Chicago Council on Global Affairs.</span></p><p class=\"\"><span>-Greg Robb</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002071:0/",
            "pub_date": "2026-02-28 20:00:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:cb1bfd377094b:0",
            "title": "Bitcoin Price Could Bottom Out At $51,000 Based On These Pricing Bands",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>As February comes to a close, it would be fair to say that the Bitcoin price has had one of its worst monthly performances in over two years. What’s worrisome is that the premier cryptocurrency doesn’t appear to be done, as the bear market roars on. Below are some of the relevant support levels to watch out for over the next few months.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>MVRV Bands Put BTC Bear Market Bottom At $51,558</span></strong></strong></p><p class=\"\"><span>In a recent post on the X platform, popular crypto analyst Ali Martinez identified two levels that could be crucial to the future of the Bitcoin price in the coming months. This evaluation revolves around the MVRV (Market Value to Realized Value) pricing bands.</span></p><p class=\"\"><span>The MVRV pricing bands are an on-chain analytics tool that shows the different profitability levels of the investors of a cryptocurrency (Bitcoin, in this scenario). Typically, these pricing bands represent dynamic support and resistance levels, as they compare the current market price to the average realized value of all investors.</span></p><p class=\"\"><span>Hence, the MVRV pricing bands can be useful in identifying potential market tops (in overheated conditions) and price bottoms (of undervalued assets). According to Glassnode data shared by Martinez, the potential bottom in the current Bitcoin bear market lies between $51,558 and $54,703.</span></p><p class=\"\"><span>The purple line (which shows a -1 standard deviation of the MVRV ratio) represents a deep capitulation phase for the market and has always been a point of reversal for the Bitcoin price in past bear markets. As shown in the chart below, the price of BTC got rejected twice at this level in 2022, during the thick of the crypto winter.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:480px;aspect-ratio:0.8\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:cb1bfd377094b-40e10502d37b465a39878a42ac179967-resized.webp\" type=\"image/webp\"/><img alt=\"Bitcoin price\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:cb1bfd377094b-40e10502d37b465a39878a42ac179967-resized.webp\" style=\"background-color:#eeeeee\"/></picture></div></button></figure><p class=\"\"><span>At the time of publishing his post, Martinez revealed that the purple MVRV band stood at around $51,558. While this suggests that the $51,000 level could be the potential bottom of the current bear market, it is worth mentioning that the MVRV band could shift slightly downward as the price steadily falls.</span></p><p class=\"\"><span>In the unlikely scenario that the Bitcoin price witnesses a turnaround at its current price point, it would have to contend with a key resistance level around $73,726. According to Glassnode’s MVRV pricing bands, the -0.5 standard deviation line represents an accumulation zone, where investors might look to offload their tokens once they break even.</span></p><p class=\"\"><span>Ultimately, these MVRV pricing bands hint at the potential turning points for the Bitcoin price over the coming months.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin Price At A Glance</span></strong></strong></p><p class=\"\"><span>As of this writing, the price of BTC stands at around $65,800, reflecting an over 2% dip in the past 24 hours.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:cb1bfd377094b:0-bitcoin-price-could-bottom-out-at-51-000-based-on-these-pricing-bands/",
            "pub_date": "2026-02-28 20:00:32",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:d98a18fed094b:0",
            "title": "Binance founder CZ Slams New York Times Over Leaked Draft Detailing $4.3B Settlement Talks",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Binance founder Zhao said the New York Times used an unauthorized early draft of his soon-to-be-released memoir and ignored requests to wait for the finalized manuscript.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The report described 2023 negotiations that led to Binance agreeing to a $4.3 billion settlement with U.S. authorities.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The draft also recounted Zhao’s four-month prison sentence and a detainer issued by Immigration and Customs Enforcement near the end of his custody.</span></li></ul></span></div><span><p class=\"\"><span>Binance founder Changpeng Zhao slammed a New York Times article on Friday that detailed previously undisclosed Department of Justice (DOJ) negotiations from a draft of his memoir without permission.</span></p><p class=\"\"><span>Zhao wrote that his team had asked the New York Times to “hold off on the article till just a few days before publishing” and to use the official copy of the manuscript. “They couldn’t wait,” he said. In another post, he added that the newspaper “only had a copy of a very early draft, without permission.”</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:500.62893081761007px;aspect-ratio:0.8343815513626834\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:d98a18fed094b-1c629ca9f3c4b8b6ce0f60c1cbf593d5-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-02-28 at 6.44.55 AM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:d98a18fed094b-1c629ca9f3c4b8b6ce0f60c1cbf593d5-resized.webp\" style=\"background-color:#b3b6b5\"/></picture></div></button></figure><p class=\"\"><span>Zhao’s post came as The New York Times published an article on Friday detailing content from a draft of his upcoming memoir, Freedom of Money. </span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/binancecoin\" rel=\"nofollow\" target=\"_blank\">Binance Coin (BNB)</a><span> was trading at $596, down by 2.9% in the last 24 hours. On Stocktwits, retail sentiment around BNB remained in 'bearish' territory, with 'low' chatter levels over the past day. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DOJ Negotiations And Prison Account</span></strong></p><p class=\"\"><span>The report described behind-the-scenes negotiations between Binance and the U.S. Department of Justice (DOJ) in 2023, during which prosecutors initially sought a $6.8 billion penalty before the company ultimately agreed to pay $4.3 billion.</span></p><p class=\"\"><span>According to the article, Zhao consulted more than a dozen lawyers during the process and considered remaining outside the United States rather than returning to face charges. He ultimately pleaded guilty to a single count of violating an anti-money-laundering statute and stepped down as Binance’s chief executive officer. He was sentenced to four months in prison in 2024. </span></p><p class=\"\"><span>The draft manuscript also recounted Zhao’s time in prison, including interactions with guards and inmates, and detailed a previously unreported detainer placed by Immigration and Customs Enforcement that briefly put him under additional custody near the end of his sentence. </span></p><p class=\"\"><span>Zhao’s lawyer, Teresa Goody Guillén, said that the article relied on material “that is neither in CZ’s book nor in his words,” adding that readers would see his “real words once the finished book is published soon.”</span></p><p class=\"\"><span>Zhao said in the previous month that he planned to self-publish the memoir in February or March of this year.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:d98a18fed094b:0/",
            "pub_date": "2026-02-28 19:52:11",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coinpedia:8500da358094b:0",
            "title": "Is 2026 the Year Banks Finally Adopt XRP? Clarity Act and Ripple’s Next Move",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The Clarity Act is heading toward a make-or-break moment. Ripple CEO Brad Garlinghouse has put the odds of the bill passing by April at 80%, and the White House has set a March 1 target to resolve the stablecoin yield dispute holding it up.</span></p><p class=\"\"><span>If it passes, XRP would be classified as a digital commodity. That single shift would greenlight U.S. banks for On-Demand Liquidity adoption and open the floodgates for ETF products. </span></p><p class=\"\"><span>If it doesn’t clear before midterm election season, Jake Claver of Digital Ascension Group warns the window could close. Passing legislation gets much harder once the political cycle takes over.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Banks Went From “No” to “Yes” in 12 Months</span></strong></p><p class=\"\"><span>A year ago, Claver would have said banks were not ready. That changed after he attended the Ondo Summit and several recent industry events. BNY Mellon is already custodying RLUSD. Fidelity, Citi, and Franklin Templeton are all leaning in. </span></p><p class=\"\"><span>JP Morgan runs Onyx for internal settlement but needs interoperability with external chains, something only full regulatory clarity unlocks.</span></p><p class=\"\"><span>Ripple CTO David Schwartz has framed the real barrier differently. According to Claver, Schwartz has stated the main obstacle is not clarity itself but asset volatility. Banks want a high, stable XRP price, not a volatile one.</span></p><p class=\"\"><span>The early signals are already showing. XRP saw $5 million in inflows within the first five minutes of a recent morning session. Payment volume between accounts surged roughly 400%.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ripple Built the Full Stack While Everyone Waited</span></strong></p><p class=\"\"><span>Ripple has assembled an end-to-end infrastructure. Hidden Road is now Ripple Prime. G Treasury is now Ripple Treasury. Ripple 1 bundles stablecoin issuance, custody, and digital identity into one integrated product.</span></p><div class=\"blockquote-xrkxvh37\"><span> </span><p class=\"\"><span>Paraphrasing Garlinghouse, Claver said: </span><em><span>“It really doesn’t matter which way it goes as long as we have something in place and we’re going to be able to run because we’re so far ahead of everybody else.”</span></em></p><span> </span></div><p class=\"\"><span>Once the Clarity Act passes, NDA expirations could unleash a wave of partnership announcements. Deutsche Bank has already gone public. Ripple President Monica Long expects full-scale institutional adoption for the XRP Ledger in 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Rotation Is Already Starting</span></strong></p><p class=\"\"><span>Bitcoin dominance has fallen from 61% in November to roughly 58%, signaling capital is beginning to shift toward large-cap alts. But Claver warns this cycle’s rotation will look different. </span></p><p class=\"\"><span>Bitcoin is now held primarily through ETFs and structured products, not on exchanges. The liquidity leaving BTC will likely flow into structured vehicles, not traditional altcoin markets.</span></p><p class=\"\"><span>For XRP, that distinction matters. If clarity arrives and institutional products scale, XRP sits at the front of that queue.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FAQs</span></strong></p><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>What happens if the Clarity Act does not pass before the midterm election cycle?</span></strong></strong><span> </span><p class=\"\"><span>If Congress does not act before midterms, legislative priorities often shift toward campaigning and partisan positioning. That can delay crypto regulation for months or even years, extending uncertainty for companies and financial institutions planning long-term integration.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Who would directly benefit from XRP being classified as a digital commodity?</span></strong></strong><span> </span><p class=\"\"><span>U.S. banks, payment providers, and asset managers would gain clearer compliance pathways. Institutional investors could also access XRP through regulated structures, reducing legal ambiguity around custody, trading, and product issuance.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>How could regulatory clarity change competition among blockchain networks?</span></strong></strong><span> </span><p class=\"\"><span>Clear U.S. rules may give networks like the XRP Ledger an advantage in attracting institutional partnerships. Platforms without defined regulatory treatment could face slower adoption from banks that require strict compliance standards.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>What should investors watch in the coming weeks?</span></strong></strong><span> </span><p class=\"\"><span>Investors should monitor congressional timelines, White House negotiations on stablecoin provisions, and public statements from regulators. Institutional product filings and bank partnership announcements may also signal how quickly the market responds.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/coinpedia:8500da358094b:0-is-2026-the-year-banks-finally-adopt-xrp-clarity-act-and-ripple-s-next-move/",
            "pub_date": "2026-02-28 18:43:42",
            "source": "Coinpedia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:9d3632dcb094b:0",
            "title": "TRUMP SOCIAL MEDIA POST: US, ISRAEL LAUNCH MAJOR MILITARY STRIKE AGAINST IRAN; IRAN HITS BACK AT US MILITARY INSTALLATIONS IN MIDEAST",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/macenews:9d3632dcb094b:0-trump-social-media-post-us-israel-launch-major-military-strike-against-iran-iran-hits-back-at-us-military-installations-in-mideast/",
            "pub_date": "2026-02-28 19:38:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coinpedia:183bc8b7c094b:0",
            "title": "Ethereum Price Crashes 10% After US and Israel Strike Iran, $155M Liquidated",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Ethereum, the world’s second-largest cryptocurrency, has fallen 10% today after the U.S. and Israel strike Iran. The sharp drop triggered heavy liquidations across the market, wiping out billions from its market value. Even large traders, including Machi Big Brother, were liquidated.</span></p><p class=\"\"><span>Despite the crash, some Ethereum whales continue to accumulate heavily.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ethereum Drops 10% as US and Israel Strike Iran.</span></strong></p><p class=\"\"><span>The United States and Israel launched a coordinated operation reportedly targeted at an Iranian military facility to counter nuclear threats.</span></p><p class=\"\"><span>Meanwhile, the situation has intensified now as Iran retaliated with missile and drone attacks on Israel and U.S. bases in the region, including reported launches toward Qatar, Bahrain, and Abu Dhabi. </span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">Donald J. Trump</div><div class=\"username-n2KCMK3i\">@realDonaldTrump</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/BZuJDudLej\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/BZuJDudLej</a></p></div><span class=\"date-n2KCMK3i\">Feb 28, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/realDonaldTrump/status/2027651077865157033\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>Within an hour of the news breaking, the ETH price dropped to around $1,850, down roughly 10% within just one hour. Ethereum has erased all the gains it made three days ago when it touched $2,000. </span></p><p class=\"\"><span>Meanwhile, the ETH token price has dropped nearly 37% in a month.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>$155 Million ETH Liquidated as Long Traders Wiped Out</span></strong></p><p class=\"\"><span>The sharp drop triggered heavy liquidations across derivatives markets. In the past 24 hours, 16,630 traders were liquidated, with total liquidations reaching $155.40 million. Around 88% of those liquidations came from long positions.</span></p><p class=\"\"><span>Among the notable liquidations was well-known trader Machi Big Brother. According to on-chain tracker Lookonchain, his 25x leveraged long position of 304 ETH was force-closed near the $1,863 level. </span></p><p class=\"\"><span>Just four days earlier, he deposited $245,000 in USDC into Hyperliquid to reopen his trade. Most of that money is now gone, and the wallet balance is close to $13,580. </span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">Lookonchain</div><div class=\"username-n2KCMK3i\">@lookonchain</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>After Israel's strike on Iran, </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">BITSTAMP:ETHUSD</a><span> dropped sharply — and Machi(</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://twitter.com/machibigbrother?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">@machibigbrother</a><span>) got liquidated again!</span></p><p class=\"\"><span>His account is now down to only $13,580.</span></p><p class=\"\"><span>He put in $245K just 4 days ago — and it’s already gone again.</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/lwXUSKAqoa\" rel=\"nofollow\" target=\"_blank\">https://t.co/lwXUSKAqoa</a><span> </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/5lA2hfbdKm\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/5lA2hfbdKm</a></p></div><span class=\"date-n2KCMK3i\">Feb 28, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/lookonchain/status/2027638047748329964\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>Overall, his tosses have crossed $29 million.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ethereum Whales Continue Accumulating: Cryptoquant</span></strong></p><p class=\"\"><span>While retail traders faced liquidations, Cryptoquant data shows that some large holders used the dip as a buying opportunity. On February 28, a whale identified as 0x172 borrowed $7 million USDC from Aave during the downturn and purchased 3,753 ETH at an average price of $1,865.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1046.5116279069766px;aspect-ratio:1.744186046511628\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/coinpedia:183bc8b7c094b-03decf334c3680f22918b7a5020f0af9-resized.webp\" type=\"image/webp\"/><img alt=\"Ethereum Whales Continue Accumulating: Cryptoquant after U.S. and Israel strike Iran\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/coinpedia:183bc8b7c094b-03decf334c3680f22918b7a5020f0af9-resized.webp\" style=\"background-color:#fafafa\"/></picture></div></button></figure><p class=\"\"><span>The wallet now holds 15,964 ETH, valued at approximately $29.68 million. The move suggests that some large investors view the correction as a temporary reaction rather than a long-term structural decline.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FAQs</span></strong></p><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Why is Ethereum price down today?</span></strong></strong><span> </span><p class=\"\"><span>Ethereum price is down today due to rising geopolitical tensions after U.S. and Israel strikes on Iran, triggering panic selling and $155M in liquidations.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>How much Ethereum was liquidated during the crash?</span></strong></strong><span> </span><p class=\"\"><span>About $155 million in ETH positions were liquidated in 24 hours, with nearly 88% coming from long traders caught in the sudden drop.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Why are Ethereum whales buying during the crash?</span></strong></strong><span> </span><p class=\"\"><span>Some whales see the dip as temporary volatility and are accumulating ETH at lower prices, betting on long-term recovery.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Is Ethereum’s crash linked to geopolitical tensions?</span></strong></strong><span> </span><p class=\"\"><span>Yes. Escalating conflict between the U.S., Israel, and Iran increased market uncertainty, pushing investors away from risk assets like crypto.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/coinpedia:183bc8b7c094b:0-ethereum-price-crashes-10-after-us-and-israel-strike-iran-155m-liquidated/",
            "pub_date": "2026-02-28 18:29:08",
            "source": "Coinpedia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZO05S:0",
            "title": "JPMorgan cuts services for Citadel Securities in clash over roles- FT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>-- Source link: https://tinyurl.com/mtmu4wy7</span></p><p class=\"\"><span>-- Note: Reuters has not verified this story and does not vouch for its accuracy</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZO05S:0-jpmorgan-cuts-services-for-citadel-securities-in-clash-over-roles-ft/",
            "pub_date": "2026-02-28 19:28:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000652:0",
            "title": "Newly-listed MetaOptics Ltd delivers strong year-on-year revenue growth of 891%, and remains well-capitalised for growth with cash position of S$8.8 million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SINGAPORE, Feb. 28, 2026 /PRNewswire/ — MetaOptics Ltd (Catalist: 9MT) (\"MetaOptics\" or the \"Company\", and together with its subsidiaries, the \"Group\") which listed recently in September 2025, is pleased to announce its inaugural financial results for the financial year ended 31 December 2025 (\"FY2025\").</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>                                              2025         2024      +/- </span><br/><span>                                               S$           S$        % </span><br/><span>                                            Unaudited </span><br/><span>Revenue                                        787,388       79,440  891 </span><br/><span>-----------------------------------------  -----------  -----------  --- </span><br/><span>Gross profit                                   159,826       26,569  502 </span><br/><span>-----------------------------------------  -----------  -----------  --- </span><br/><span>Loss after income tax and total </span><br/><span>    comprehensive loss                     (5,445,573)  (1,950,882)  179 </span><br/><span>-----------------------------------------  -----------  -----------  --- </span><br/><span>Loss per share for loss attributable to </span><br/><span>    the equity holders of the Group: </span><br/><span>----------------------------------------   -----------  -----------  --- </span><br/><span>- Basic and diluted loss per share (in </span><br/><span>    cents)                                      (2.54)       (1.01)  152 </span><br/><span> </span></pre><p class=\"\"><span>The Company delivered significant year-on-year increase in revenue by 891% to S$0.8 million in FY2025, primarily due to delivery of a direct laser writer to a customer in Taiwan, as announced by the Company on 24 September 2025, enabling metalens prototyping and fabrication in the region's semiconductor supply chain, as well as higher sales of metalenses and modules to customers globally, to facilitate customers' evaluation of metalens solutions and integration into their applications.</span></p><p class=\"\"><span>The net loss for FY2025 of S$5.4 million was primarily attributable to the following areas:</span></p><p class=\"\"><span>(i) Expenses incurred as the Group seeks platforms for growth. One-off professional fees of approximately S$2.4 million was incurred in FY2025, in connection with the Company's listing on Catalist of the SGX-ST in September 2025, and the proposed dual listing of the Company on the NASDAQ stock exchange as announced on 17 November 2025;</span></p><p class=\"\"><span>(ii) Approximately S$1 million in non-cash expenses including finance expenses and depreciation and amortisation; and</span></p><p class=\"\"><span>(iii) Enhanced research and development efforts. Research and development expenses of approximately S$1.8 million was incurred in FY2025 in connection with and to drive new product launches, including the launch of the Group's latest proprietary metalens-powered consumer electronics prototypes and generation-2 products at the recently held CES 2026, which are expected to further strengthen the Group's competitive position, in view of the strong customer feedback and traction.</span></p><p class=\"\"><span>Positioning the Group for growth</span></p><p class=\"\"><span>As part of its succession planning and strategic expansion plans, the Group has also appointed Mr Aloysius Chua Hao Peng (\"Aloysius\") as Executive Director and Chief Executive Officer, to further drive and lead strategic initiatives and growth of the Group's 4 business groups encompassing:</span></p><p class=\"\"><span>(i) Metalens equipment</span></p><p class=\"\"><span>- Focuses on the sale of advanced metalens production machines, including the direct laser writer, metalens automatic tester, and metalens automatic assembler</span></p><p class=\"\"><span>(ii) Metalens foundry</span></p><p class=\"\"><span>- Manufacturing and fabrication of customised metalenses, including in the United States as a strategic growth base, enabling the Group to provide its metalens design &amp; manufacturing expertise to world class clients and partners across the United States in the fields of 5G smart phones, data communications, data centres, fiber optics, AI semiconductor manufacturing, and consumer electronics</span></p><p class=\"\"><span>(iii) Metalens products</span></p><p class=\"\"><span>- Design and development of the IoT powered products specifically the metalens 5G smartphone, pico projectors, and smart glasses incorporating metalens with 3D gesture recognition</span></p><p class=\"\"><span>(iv) MetaOptics artificial intelligence (\"AI\")</span></p><p class=\"\"><span>- Development of 3D biometric, gesture recognition, imaging and IoT algorithms to optimise the implementation and performance of metalens technology</span></p><p class=\"\"><span>Mr Thng Chong Kim, as Executive Chairman, continues to oversee management performance, strategic planning and business development, including the recent expansion to the United States with the recent incorporation of the subsidiary in the United States, and membership in Stanford Engineering's SystemX Alliance program, supporting the Group's strategy to deliver high-performance metaoptics solutions to customers across North America.</span></p><p class=\"\"><span>The Group remains well-capitalised, with a cash balance of approximately S$2.9 million and S$4.8 million unutilised from the net proceeds raised in connection with the IPO and placement exercise undertaken in December 2025, respectively, providing a strong cash base totalling S$8.8 million allowing the Group to execute its commercial rollout globally and support customers' requirements with high performance metalens solutions.</span></p><p class=\"\"><span>By Order of the Board</span></p><p class=\"\"><span>Thng Chong Kim</span></p><p class=\"\"><span>Executive Chairman</span></p><p class=\"\"><span>28 February 2026</span></p><p class=\"\"><span>About MetaOptics Ltd</span></p><p class=\"\"><span>MetaOptics Ltd (Catalist: 9MT) is a leading-edge semiconductor optics company pioneering glass-based metalens solutions enhanced by AI-driven image processing. Using advanced optical design and a scalable 12-inch DUV lithography process, it powers next-generation applications in CPO, mobile, AR VR, automotive and other emerging markets. Headquartered in Singapore, MetaOptics aims to deliver high-performance optics with the reliability and scalability demanded by today's most innovative technology brands. Find out more at www.metaoptics.sg.</span></p><p class=\"\"><span>View original content:https://www.prnewswire.com/news-releases/newly-listed-metaoptics-ltd-delivers-strong-year-on-year-revenue-growth-of-891-and-remains-well-capitalised-for-growth-with-cash-position-of-s8-8-million-302700170.html</span></p><p class=\"\"><span>SOURCE METAOPTICS LTD</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000652:0/",
            "pub_date": "2026-02-28 19:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO04A:0",
            "title": "UBS plans to keep Ermotti on as CEO for longer, NZZ reports",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    The board of directors of Swiss banking giant UBS </span><span> plans to keep Chief Executive Sergio Ermotti on for longer than originally planned, Swiss newspaper Neue Zuercher Zeitung reported on Saturday.</span></p><p class=\"\"><span>Ermotti, who oversaw the Swiss bank's 2023 emergency takeover of Credit Suisse, is set to step down by the middle of 2027, although that timeline is not finalised, two sources with knowledge of the matter told Reuters last month.</span></p><p class=\"\"><span>However, the board led by Chairman Colm Kelleher, wants to keep Ermotti beyond that date to guide UBS's pushback against the Swiss government’s plans for tighter regulation, the NZZ reported, citing people familiar with the matter. </span></p><p class=\"\"><span>\"As we have repeatedly said, Sergio P. Ermotti will remain Group CEO until at least early 2027,\" a UBS spokesperson said when asked by Reuters about the NZZ report, adding that it was \"premature to speculate about the timing of Sergio stepping down\". </span></p><p class=\"\"><span>\"When the time comes to decide on a successor, the Board will be able to draw on a strong bench of internal candidates, but will of course fulfill its fiduciary duty by also evaluating external candidates,\" the spokesperson added.</span></p><p class=\"\"><span>MEASURES TO PREVENT FINANCIAL CRISES</span></p><p class=\"\"><span>In June, the Swiss government proposed measures aimed at preventing future banking crises following the 2023 collapse of Credit Suisse. The plans could require UBS to hold up to $24 billion in additional capital.</span></p><p class=\"\"><span>Other proposals include that UBS can no longer count software and deferred tax assets towards its Common Equity Tier 1 capital, whiles its foreign units must be fully backed with CET1 capital.</span></p><p class=\"\"><span>UBS has rejected the proposals, arguing they would make Switzerland less competitive.</span></p><p class=\"\"><span>NZZ said the bank was looking at different potential outcomes of that discussion, and that it might determine whether the bank remains based in Switzerland or moves its headquarters abroad.</span></p><p class=\"\"><span>\"We will do everything we can to ensure that UBS can continue to operate successfully as a global bank from Switzerland. Nevertheless, the Board of Directors is obliged to prepare for all scenarios,\" the spokesperson said.    </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO04A:0-ubs-plans-to-keep-ermotti-on-as-ceo-for-longer-nzz-reports/",
            "pub_date": "2026-02-28 19:15:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO04V:0",
            "title": "India likely to see above-average temperatures in March, weather office says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>India is likely to experience above-average temperatures across most regions in March following a warmer-than-usual February, the weather office said on Saturday.</span></p><p class=\"\"><span>Both maximum and minimum temperatures are expected to remain above average in most areas during March, Mrutyunjay Mohapatra, director-general of the India Meteorological Department, said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO04V:0-india-likely-to-see-above-average-temperatures-in-march-weather-office-says/",
            "pub_date": "2026-02-28 19:08:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000642:0",
            "title": "Why I Waited Until 70 to Start Collecting Social Security — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Tom Wilk</span></p><p class=\"\"><span>I didn't realize it then, but I received my first piece of advice about when to claim Social Security benefits 60 years ago, when I was 10.</span></p><p class=\"\"><span>For me, 1966 was a year of transition. My mother remarried that July, 14 months after my father died of a heart attack at age 41. My sister, my mother and I moved to a new town to live with our new father, also a widower, and his son.</span></p><p class=\"\"><span>The adjustment wasn't always easy. When things got tense, my new dad used to say, \"Patience is a virtue.\" That old saw became a household mantra — a reminder to think before acting.</span></p><p class=\"\"><span>As an adult, I learned that patience had financial applications. Don't make major purchases impulsively. And perhaps most consequential of all: Don't be in a hurry to claim Social Security benefits.</span></p><p class=\"\"><span>That patience paid off when I turned 70 on New Year's Day and received my first Social Security check shortly thereafter.</span></p><p class=\"\"><span>Weighty decision</span></p><p class=\"\"><span>Financial planners often describe Social Security as the best annuity available. It lasts for life, rises with inflation and provides a guaranteed income stream. The longer you wait to claim, the larger that stream becomes.</span></p><p class=\"\"><span>Waiting isn't for everyone. Some people need the income earlier in retirement to make ends meet. Others may be in poor health and doubt they will live long enough to benefit from waiting. Still others don't trust the government to deliver full benefits, given Social Security's long-term funding challenges or the possibility of congressional changes to shore up the system.</span></p><p class=\"\"><span>In fact, when I talked with friends and family in my early 60s, I learned that most had claimed benefits sometime between 62 and full retirement age. Of the roughly 20 people I asked, only two waited until 70. That tracks with national data: About 90% of new Social Security claims come from people younger than 70, according to the Social Security Administration.</span></p><p class=\"\"><span>In the end, deciding when to claim Social Security is personal, shaped by one's health, finances and family circumstances.</span></p><p class=\"\"><span>Why  I  waited</span></p><p class=\"\"><span>Based on financial and personal considerations — and a suggestion from our financial advisor — I resolved not to take Social Security at age 62 and wait until at least full retirement age, which for me was 66 and two months. And after reaching full retirement age in 2022, I decided I could hold out for nearly four more years.</span></p><p class=\"\"><span>For me, the decision came down to a few factors.</span></p><p class=\"\"><span>First, by waiting, I increased the survivor benefit Elizabeth, my wife, will receive if I die first. She is six years and four months younger than I am, and this extra income could come in handy.</span></p><p class=\"\"><span>What's more, Elizabeth and I were fortunate to be financially prepared for retirement. Her full-time job covered our health insurance, and I supplemented our income with contract work for newspapers and magazines. An inheritance and a timely refinancing allowed us to pay off our mortgage nearly two years early, and we invested a portion of the remainder to generate dividend income.</span></p><p class=\"\"><span>To supplement our income, I began taking penalty-free monthly distributions from a SEP individual retirement account at age 60. I later tapped my Roth IRA for a monthly check starting at 63.</span></p><p class=\"\"><span>Longevity was a wild card given my father's early death. But my Mom lived five months past her 90th birthday in 2015, and I am in good health.</span></p><p class=\"\"><span>No regrets</span></p><p class=\"\"><span>Recently, I found a Social Security statement from late 2017. Had I claimed benefits at 62 in January 2018, I would have received $1,715 a month — about $2,242 in January 2026 dollars. At full retirement age, my benefit would have been $2,980 a month. By waiting until 70, my monthly benefit is just under $4,000.</span></p><p class=\"\"><span>My break-even point — the age at which I will receive as much in benefits as I would have had I claimed when first eligible — is somewhere around age 81 or 82, depending on cost-of-living increases.</span></p><p class=\"\"><span>Even if I don't hit break-even, I don't regret waiting. Frugality is a habit. We learned to spend conservatively and look for savings wherever possible, including shopping for groceries on senior-discount days. I drove a 2003 Toyota Corolla for 22 years and more than 200,000 miles — and would probably still be driving it if I hadn't been rear-ended in 2024.</span></p><p class=\"\"><span>I may splurge on something after receiving a few checks, though extravagance isn't really our style. Elizabeth retired in August 2024, and we decided to put off any long-distance traveling until I started collecting. We took a family trip to Florida in February.</span></p><p class=\"\"><span>\"There's no perfect time to take it,\" my financial advisor once told me about claiming Social Security benefits. When people ask him when they should start collecting, he says he needs just one piece of information. \"Let me know when you're going to die.\"</span></p><p class=\"\"><span>Write to editors@barrons.com</span></p><p class=\"\"><span>Tom Wilk, of Pitman, N.J., is a retired journalist. He is the co-author of Tales of South Jersey: Profiles and Personalities.</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000642:0/",
            "pub_date": "2026-02-28 19:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZL11P:0",
            "title": "Ken Burns on revisiting America’s founding at its 250th anniversary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Yasmeen Serhan</span></p><p class=\"\"><span>    As the United States prepares to mark 250 years since its founding, Ken Burns is urging viewers to revisit that moment anew. The award-winning documentarian — whose work has chronicled everything from the Civil War to the history of jazz — spent nearly a decade on his latest 12-hour series, “The American Revolution,” which premiered on PBS in November. </span></p><p class=\"\"><span>Speaking with Reuters at the British Library in London ahead of the film’s international release this summer, Burns discusses the myths and nostalgia that define many Americans’ understanding of the revolutionary period and his guarded optimism for the next 250 years. </span></p><p class=\"\"><span>    This conversation has been edited and condensed for clarity.  </span></p><p class=\"\"><span>    What first drew you to filmmaking — and to films about U.S. history, in particular?  </span></p><p class=\"\"><span>I knew by age 12, out of tragedy, that I wanted to be a filmmaker. My mother had cancer and had spent my entire conscious life dying, and then died when I was 11. When I was 12, I watched my dad cry — who I had never seen cry — at an old movie called \"Odd Man Out\" and I decided to be a Hollywood filmmaker.</span></p><p class=\"\"><span>By the time I got to Hampshire College in the fall of 1971, all of the teachers were social documentary still photographers. So I suddenly was (into) documentary. And then I realized that I had this completely untrained and untutored interest in American history. I don't know where it came from other than this just deep, abiding curiosity about how the country works.</span></p><p class=\"\"><span>    Your latest film recounts what you describe as the most profound revolution in history. How did telling this story compare to some of your past projects?  </span></p><p class=\"\"><span>I’ve dealt in 18th-century subjects before ... but this has no photographs. It has no newsreels. And so it presents problems. I've not been a big fan of reenactments and so what we did is over five or six years of filming (we) collected a critical mass of photography in a very impressionistic way of people who do reenactments. We collected enough material that we could use, so a volley from a set of British soldiers firing their muskets dissolves into a painting of the very same thing. And so you treat the paintings as if they're live and you treat the live as if they're paintings.</span></p><p class=\"\"><span>We've always had complex narratives. We've always been interested in lots of different ways to see the subjects and, to use the American baseball metaphor, to call balls and strikes. We just say what actually happened. The heroes are not diminished; they just have more dimension. </span></p><p class=\"\"><span>And so our films are filled with not just top-down but bottom-up stories: In this case, of women who are essential to keeping the resistance in the decade before the revolution going and are at every single battle, sometimes fighting, but more often than not burying the dead, washing the clothes. We follow many children who sign up and fight; teenagers fighting, seasoned veterans at 18 or 19. And then Native American and Black (populations). And then of course we want to know what a British and Irish soldier felt, what a German soldier felt, what the French were involved in, what the Spanish were thinking and give dimension and multiplicity to those Native American tribes that (history) just sort of reduced to a single \"them.\"</span></p><p class=\"\"><span>    And not unlike your past projects, this one took nearly a decade to complete, right?  </span></p><p class=\"\"><span>There are literally a million decisions you have to make that overcome difficulties to be able to do this, which is why it takes us 10 years — and why I've stayed with public broadcasting because I couldn't have done any of these films. I could get the money instantly. The fundraising is a pain and goes on for most of those 10 years. But nobody (else) would give me 10 years to do it.</span></p><p class=\"\"><span>The recent rescission that eliminated the Corporation for Public Broadcasting is devastating to us. It's even more devastating for the new filmmaker coming up or for the rural stations. We’ll get by. We'll figure out how to do it. It's still the best place to be.</span></p><p class=\"\"><span>    Most Americans learn a sentimental version of the country’s origin story — taxes, tea, freedom. But your series argues that democracy wasn’t an intention of the Revolution so much as an inadvertent byproduct. What do people most misunderstand about the founding moment?  </span></p><p class=\"\"><span>We sentimentalize it for understandable reasons. We know it’s about really big ideas and we don’t want those ideas diminished by the real stuff, so we suppress the violence of it. We say you can get an A on your test if you say taxes and representation. But it's really Indian land, taxes, and representation. And then all of a sudden it's \"pay no attention to those people on the other side of the woods.\"</span></p><p class=\"\"><span>We called the Congress that we set up the Continental Congress. We put George Washington at the head of the Continental Army. We knew where we were going. We had dreams of empire. Americans like to say, \"Well, at least we're not like the empires of Britain and Spain and France and Portugal and the Netherlands.\" But in fact, we are. We took over in the continental United States 300 separate sovereign nations and we don't like to tell that story and we don't like to confuse it. And I think it’s always better to confuse it and it’s so much more interesting to understand all the range of characters.</span></p><p class=\"\"><span>    And the film captures those characters while also pointing out their very clear contradictions, right?  George Washington, for example, rails against “enslavement” by British policy while himself enslaving hundreds.  </span></p><p class=\"\"><span>He's deeply flawed, he’s rash, and he makes really bad military decisions in a couple of really important cases. But he's able to inspire people in the dead of night to fight for this thing that's never been tried. He defers to Congress. He has an unbelievable humility. He's able to pick subordinate talent that is better than him and is not threatened by that. And he's convincing somebody from New Hampshire, where I live, and somebody from Georgia that they're not from separate countries, but they're one thing: American. And more important than anything else: He surrenders his military commission the second the war is over. Within weeks of the British leaving New York City, he resigns. And then he's unanimously elected president and then resigns that after two terms. That giving up of power has set in motion for at least 250 years this idea that the office is more important than the individuals.</span></p><p class=\"\"><span>    This summer marks 250 years since American Independence. How are you feeling about the next 250?  </span></p><p class=\"\"><span>You have this current political crisis that we're in, which is the lopsided power that the executive has taken vis-a-vis the legislative and the judicial (branches). It's unprecedented in that it's not happened at this highest level, but things happen. So I think that this is our supreme test. I think this — along with the Civil War and the Depression and the Second World War — is one of the greatest crises in American history. And in all those cases, we figured out a way. We were much more divided during the Revolution than we are now. We were much more divided during the Civil War, the Vietnam period, (and) the Depression than we are now. There's a bit of arrogance that the present always has, because we're alive, our stuff is the worst or the best or whatever. But a study of history tells you maybe it's not the worst.</span></p><p class=\"\"><span>    What’s next? Do you have another 10-year project in you?  </span></p><p class=\"\"><span>We've taken on a project on Reconstruction that has been going on for enough years that it might be close to 10 when it's out. I've just decided in the last year to do a film on the history of the CIA and that could take that long to get it right. What I've always said is that if I were given a thousand years to live, I wouldn't run out of topics in American history.</span></p><p class=\"\"><span>    The perspectives expressed in Culture Current are the subject’s own and do not necessarily reflect the views of Reuters News. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZL11P:0-ken-burns-on-revisiting-america-s-founding-at-its-250th-anniversary/",
            "pub_date": "2026-02-28 19:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZI069:0",
            "title": "Dramatic changes observed in one of universe's biggest stars",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Star, named WOH G64, is 28 times the mass of the sun</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>It resides in the Large Magellanic Cloud galaxy</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The star was observed evolving from red to yellow</span></li></ul></span></div><span><p class=\"\"><span>By Will Dunham</span></p><p class=\"\"><span>    The largest stars in the universe live the life of a rock star - they are born brilliant, live fast and die young. If that is the case, the one named WOH G64 might be considered the stellar equivalent of Jimi Hendrix. </span></p><p class=\"\"><span>WOH G64, which is 28 times the mass of the sun and resides in a satellite galaxy to the Milky Way called the Large Magellanic Cloud, is one of a handful of the biggest stars known, just like Hendrix was in rock 'n' roll. And observations spanning more than three decades show it is behaving unlike any star seen before.</span></p><p class=\"\"><span>Astronomers have only an incomplete understanding of the life history of the largest stars, and the WOH G64 observations are providing new insight.</span></p><p class=\"\"><span>Researchers observed a change that occurred in 2014 in the star's color, corresponding to an increase in its surface temperature, as it evolved from red to yellow. The star had been classified as an extreme red supergiant but rapidly became a yellow hypergiant. This transition happened quickly, in cosmic terms, and with no evidence of an eruption or explosion.</span></p><p class=\"\"><span>\"Typically the evolution of a star takes place on timescales of billions of years. On human timescales, we only observe more abrupt and violent events, such as eruptions, the merger of two stars or their explosive deaths,\" said astronomer Gonzalo Muñoz-Sanchez, lead author of the research published this week in the journal Nature Astronomy.</span></p><p class=\"\"><span>\"No current stellar models can fully explain this transformation\" in WOH G64, said Muñoz-Sanchez, who worked on the study at the National Observatory of Athens.</span></p><p class=\"\"><span>Compared to the sun, its luminosity is about 300,000 times greater and its diameter about 1,500 times greater. If it were in the place of the sun, its surface would extend to a distance between the orbits of Jupiter and Saturn, our solar system's fifth and sixth planets. Traveling at the speed of light would take six hours to circumnavigate the star's surface.</span></p><p class=\"\"><span>WOH G64, around 10 million years old, appears to be near the end of its lifespan. In contrast, the sun is about 4.5 billion years old and has an estimated 5 billion more years left. WOH G64 is located about 160,000 light-years from Earth. A light-year is the distance light travels in a year, 5.9 trillion miles (9.5 trillion km).</span></p><p class=\"\"><span>\"WOH G64 is a massive star and very different from the sun,\" Muñoz-Sanchez said.</span></p><p class=\"\"><span>Stars between about eight and 23 times the sun's mass are expected to evolve into red supergiants and eventually explode as a supernova. </span></p><p class=\"\"><span>For stars in the range of 23 to 30 times the sun's mass, their fate is less certain. It remains unclear whether they go boom as a supernova, collapse directly into forming a black hole or evolve from a red supergiant phase into a yellow hypergiant stage before ending their lives. Black holes are exceptionally dense objects with gravity so strong not even light can escape.</span></p><p class=\"\"><span>\"Hence, WOH G64 might be the solution to this question,\" Muñoz-Sanchez said.</span></p><p class=\"\"><span>Adding another layer of complexity to understanding WOH G64  is the fact that the observations indicated it is gravitationally bound to another star in what is called a binary system. The researchers were unable to determine the size or characteristics of the stellar companion, but said the two might at some point merge.</span></p><p class=\"\"><span>The researchers have come up with hypotheses concerning WOH G64's recent changes. They said it may have experienced a violent episode predating the observational data that turned it red and is now returning to its usual yellow quiescent state. They said it also is possible that an interaction between WOH G64 and its companion had temporarily mimicked the appearance of a red supergiant.</span></p><p class=\"\"><span>\"As astronomers continue to monitor this remarkable system, WOH G64 is poised to reshape our understanding of how the most massive stars live and die,\" Muñoz-Sanchez said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZI069:0-dramatic-changes-observed-in-one-of-universe-s-biggest-stars/",
            "pub_date": "2026-02-28 19:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coinpedia:e7b2b4a3f094b:0",
            "title": "XRP Price Rally Ahead? Key On-Chain Data and Technicals Say Yes",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>While the broader crypto market remains under pressure, attention is gradually shifting from fear to opportunity. As selling momentum fades across major assets, traders are increasingly focused on where the next reversal could begin. The XRP price rally narrative is now gaining traction in that context. Despite muted price action, a combination of on-chain accumulation, improving derivatives positioning, rising ETF inflows, and a constructive technical structure suggests that XRP may be approaching a structural bottom. The question now is whether XRP is quietly setting up for its next major move. Let’s take a closer look at what the on-chain data and charts are revealing.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>XRP’s Taker Buy-Sell Ratio Shows Buyers Taking Control</span></strong></strong></p><p class=\"\"><span>One of the clearest short-term signals comes from the taker buy-sell ratio, which measures whether market participants are entering trades aggressively on the buy or sell side.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/coinpedia:e7b2b4a3f094b-72066d77defa3ca516ffc9eca9872346-resized.webp\" type=\"image/webp\"/><img alt=\"XRP taker buy sell\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/coinpedia:e7b2b4a3f094b-72066d77defa3ca516ffc9eca9872346-resized.webp\" style=\"background-color:#1c1b20\"/></picture></div></button></figure><p class=\"\"><span>Recent data shows the ratio consistently holding above the neutral 1.0 level, with repeated readings in the 1.05–1.12 range. This indicates that buy market orders are dominating, a sign of active demand rather than passive accumulation. Crucially, this shift has occurred while price remains range-bound. Historically, XRP rallies have tended to begin after taker dominance builds quietly, not when price is already breaking out. The current setup suggests traders are positioning early rather than reacting late.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>XRP’s Ledger Activity Confirms Network Engagement Is Holding Firm</span></strong></strong></p><p class=\"\"><span>Network data from the XRP Ledger reinforces the bullish undertone. Daily transaction counts have remained elevated, fluctuating between 2.1 million and 2.8 million transactions per day, even as price volatility compresses.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/coinpedia:e7b2b4a3f094b-c3db6ff79cd8d05fd126c0859bf22113-resized.webp\" type=\"image/webp\"/><img alt=\"XRP ledger data\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/coinpedia:e7b2b4a3f094b-c3db6ff79cd8d05fd126c0859bf22113-resized.webp\" style=\"background-color:#184337\"/></picture></div></button></figure><p class=\"\"><span>This divergence, rising or stable network usage during price consolidation, is typically associated with absorption phases, where demand builds without immediate price expansion. The persistence of ledger activity indicates that XRP’s ecosystem usage remains active, lending credibility to the argument that the current range reflects position-building rather than distribution.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Whale Accumulation Signals Strategic Positioning</span></strong></strong></p><p class=\"\"><span>Wallet distribution data adds further weight to the XRP price rally thesis. Addresses holding 10 million to 100 million XRP have shown net accumulation during recent pullbacks, while smaller retail-sized wallets remain largely neutral.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:515.625px;max-width:1200px;aspect-ratio:2.327272727272727\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/coinpedia:e7b2b4a3f094b-13bfa9cbf33cda0214fbe869dfdc6ea3-resized.webp\" type=\"image/webp\"/><img alt=\"XRP whale data\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/coinpedia:e7b2b4a3f094b-13bfa9cbf33cda0214fbe869dfdc6ea3-resized.webp\" style=\"background-color:#fbfbfc\"/></picture></div></button></figure><p class=\"\"><span>This pattern matters because large holders tend to accumulate during early-stage base formations, not during late-stage rallies. The absence of significant whale outflows also suggests that selling pressure at current levels is limited. In prior cycles, similar accumulation behavior preceded periods of volatility expansion rather than prolonged decline.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>ETF Inflows Add Institutional Support</span></strong></strong></p><p class=\"\"><span>Another important layer supporting the XRP price rally thesis comes from spot XRP ETF flow data. Over the past week, XRP spot ETFs have recorded consistent positive inflows, with daily additions ranging from $1.2 million to $4.5 million. Cumulative net inflows now stand near $1.24 billion, while total net assets held across XRP ETFs remain stable around the $1.0–$1.06 billion range, despite broader market weakness.</span></p><p class=\"\"><span>ETF inflows are particularly meaningful because they reflect longer-term institutional positioning, not short-term speculative trading. The fact that inflows are occurring during consolidation, rather than after a breakout, suggests early accumulation rather than momentum chasing. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>XRP Price Analysis: Cup-and-Handle Pattern Takes Shape</span></strong></strong></p><p class=\"\"><span>XRP’s price chart is displaying a cup-and-handle pattern. The rounded base of the cup reflects a prolonged period of consolidation where selling pressure gradually weakened. This phase is typically associated with accumulation, as price stabilizes and volatility contracts. The current handle formation, a shallow pullback following the rounded recovery suggests controlled profit-taking rather than aggressive selling. </span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">STEPH IS CRYPTO</div><div class=\"username-n2KCMK3i\">@Steph_iscrypto</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://twitter.com/search?q=%24XRP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">BITSTAMP:XRPUSD</a><span> Cup and Handle formation. </span></p><p class=\"\"><span>Price target: $30 </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/skNiWldVmW\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/skNiWldVmW</a></p></div><span class=\"date-n2KCMK3i\">Feb 26, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/Steph_iscrypto/status/2026986854101250401\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>As long as XRP holds above the lower boundary of the handle near $1.20, the structure remains valid. A decisive breakout above the handle resistance, accompanied by volume expansion, would confirm the pattern and signal the start of a trend continuation move. Failure to break higher would likely result in extended consolidation rather than immediate downside, as the broader structure remains intact.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Final Thoughts</span></strong></strong></p><p class=\"\"><span>The developing XRP price rally thesis is increasingly supported by measurable data. Buyer aggression is improving, ledger activity remains strong, whales are accumulating, ETF inflows are rising, and a bullish chart structure is forming.</span></p><p class=\"\"><span>While confirmation still depends on a technical breakout, the evidence suggests XRP may be closer to a bottom than another leg lower. If broader market conditions stabilize, XRP appears structurally positioned to respond quickly when momentum returns.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FAQs</span></strong></p><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Is XRP showing signs of a price reversal?</span></strong></strong><span> </span><p class=\"\"><span>Yes. Rising buy pressure, whale accumulation, steady ledger activity, and ETF inflows suggest XRP may be forming a structural bottom.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Are whales accumulating XRP right now?</span></strong></strong><span> </span><p class=\"\"><span>Yes. Wallets holding 10M–100M XRP have increased holdings during pullbacks, a pattern commonly seen in early base-building phases.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>How do ETF inflows impact XRP price?</span></strong></strong><span> </span><p class=\"\"><span>Consistent ETF inflows reflect institutional accumulation, which can improve long-term stability and support future upside momentum.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Why is XRP price down today?</span></strong></strong><span> </span><p class=\"\"><span>XRP is down due to broader crypto market weakness, profit-taking near resistance, and short-term volatility despite steady on-chain demand.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/coinpedia:e7b2b4a3f094b:0-xrp-price-rally-ahead-key-on-chain-data-and-technicals-say-yes/",
            "pub_date": "2026-02-28 17:43:26",
            "source": "Coinpedia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coinpedia:f23ce882c094b:0",
            "title": "Crypto Crash Today: Should You Buy the Bitcoin Dip as US and Israel Strike Iran?",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bombs, not bears, just dragged Bitcoin to its lowest level since the Feb. 5 crash.</span></p><p class=\"\"><span>US and Israeli forces launched a joint strike on Iran early Saturday, sending BTC spiraling from $65,500 to $63,000 in under an hour. Ethereum slid to around $1,850. Roughly $75 billion in total crypto market cap vanished before most traders even woke up.</span></p><p class=\"\"><span>Over 154,000 traders were liquidated in the past 24 hours, with total liquidations hitting $522 million. Of that, $449 million came from longs alone. The largest single wipeout was an $11.17 million BTC position on Aster.</span></p><p class=\"\"><span>But the real tell is in the derivatives data. BTC futures volume hit $76.27 billion in the past 24 hours while spot volume sat at just $7.62 billion, per CoinGlass data. This was not organic selling but leveraged positions getting force-closed all together.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Every Iran Strike Has Crashed Crypto. Then What?</span></strong></p><p class=\"\"><span>Here’s where it gets interesting.</span></p><p class=\"\"><span>In June 2025, when Israel struck Iranian nuclear facilities, BTC dropped to around $103,000. By October, it had climbed back to new all-time highs above $125,000. In April 2024, when Iran fired missiles at Israel, BTC fell to $61,000. Months later, it broke previous highs again.</span></p><p class=\"\"><span>War crashes have historically acted as springboards. But there’s a catch.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why “Just Buy the Dip” Could Backfire This Time</span></strong></p><p class=\"\"><span>The market walking into this strike was already broken.</span></p><p class=\"\"><span>Bitcoin is down nearly 50% from its October 2025 peak of $126,000. The Fear and Greed Index sits at 14, deep in extreme fear territory. More critically, CryptoQuant confirmed that US spot Bitcoin ETFs have flipped to net sellers in February 2026, reversing last year’s trend when they were net buyers of 46,000 BTC.</span></p><p class=\"\"><span>On Deribit, the $60,000 put remains the largest put position by open interest at over 5,200 BTC, with the $55,000 put close behind at 4,657 BTC. Put volume in the last 24 hours has edged past call volume at 50.85% vs 49.15%.</span></p><p class=\"\"><span>The big players are betting on more pain.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>One Signal Worth Watching</span></strong></p><p class=\"\"><span>Not everything points down. Exchange netflows show roughly 522 BTC leaving platforms, which is an accumulation signal even as retail panics. Someone is buying what others are panic-selling.</span></p><p class=\"\"><span>The key level now is $63,100, where descending channel support sits. A clean break below that opens the door to $60,000. On the upside, $73,000 to $74,000 remains heavy resistance.</span></p><p class=\"\"><span>The pattern says bounce. The structure says caution. Which one wins likely depends on what Iran does next.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FAQs</span></strong></p><strong class=\"root-Tkn6WL2y\"><span>Why did Bitcoin crash after the US–Israel strike on Iran?</span></strong><span> </span><p class=\"\"><span>Bitcoin fell as geopolitical shock triggered mass liquidations. Leveraged long positions were force-closed, accelerating the drop.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><span>Is this Bitcoin dip similar to previous Iran-related crashes?</span></strong><span> </span><p class=\"\"><span>Past Iran-linked shocks caused sharp BTC drops but were followed by strong rebounds months later, though conditions differ now.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><span>Are institutions selling Bitcoin right now?</span></strong><span> </span><p class=\"\"><span>Yes. US spot Bitcoin ETFs turned net sellers in February 2026, signaling reduced institutional demand during this downturn.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/coinpedia:f23ce882c094b:0-crypto-crash-today-should-you-buy-the-bitcoin-dip-as-us-and-israel-strike-iran/",
            "pub_date": "2026-02-28 17:44:57",
            "source": "Coinpedia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S0N3YA07P:0",
            "title": "Top US general, Hegseth monitoring Iran strikes from Trump resort, person familiar says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Pentagon chief Pete Hegseth and Chairman of the Joint Chiefs of Staff General Dan Caine are monitoring the U.S. operation in Iran from President Donald Trump's Mar-a-Lago resort in Florida, where Trump is currently located, a person familiar with the matter told Reuters.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S0N3YA07P:0-top-us-general-hegseth-monitoring-iran-strikes-from-trump-resort-person-familiar-says/",
            "pub_date": "2026-02-28 18:25:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000629:0",
            "title": "The Date-Night Talk Every Couple Needs: Passwords, Online Accounts and More — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Julie Jargon</span></p><p class=\"\"><span>The division of labor in a marriage often results in one person handling the banking, subscriptions, passwords and more. That can leave the other person in the dark about how to locate and access the family's accounts.</span></p><p class=\"\"><span>Payal Adhikari, a Chicago pediatrician, came to this realization recently.</span></p><p class=\"\"><span>When she got married in 2014, she had debt from medical school. Her husband, Shashank Sane, offered to handle their living expenses while she focused on paying off her student loans. As the years went by and they bought a house and had two children, they stayed in their lanes, with her managing the kids' lives and household needs and Sane managing the bills.</span></p><p class=\"\"><span>Late last year , she was reading a book called \"Strangers: A Memoir of Marriage,\" about a woman disentangling the family finances after her husband of 20 years abruptly leaves her. While Adhikari had no concerns about her husband running off, the book did get her thinking about how little she knew of their monetary logistics. If something happened to Sane, she wouldn't know where to begin handling the digital subscriptions, bills and investments.</span></p><p class=\"\"><span>\"I was overwhelmed by the number of things I didn't know,\" she says.</span></p><p class=\"\"><span>Adhikari told her husband she wanted to get up to speed. She jotted down questions: What accounts were the streaming services and athletic club membership paid out of? Who held their life and disability insurance policies? To whom did they make car payments? Where were all their passwords?</span></p><p class=\"\"><span>Sane, an energy company executive, says he was happy to oblige. He had seen the trouble his mother had gone through to access accounts after his father died a few years prior. (My colleague Veronica Dagher recently wrote about a woman who spent a year untangling her family finances following the death of her husband.)</span></p><p class=\"\"><span>\"The concept of dividing the responsibilities of the house and family makes sense, but knowing what's happening is important,\" he says.</span></p><p class=\"\"><span>Spreadsheets and coffee</span></p><p class=\"\"><span>With her list of unknowns complete, Adhikari and her husband each brought their laptops to a coffee shop in January. They spent an hour creating a shared master document in a Google drive, listing all of their accounts.</span></p><p class=\"\"><span>There were things Adhikari added that Sane didn't have, including access to the bank accounts she had set up for their kids, her disability insurance information and a health savings account from a prior employer. They double-checked that both of their names were on all accounts.</span></p><p class=\"\"><span>They also printed out a list of account passwords, which they keep in a safe. They also store them digitally in a password manager both can access. (Our personal tech columnist Nicole Nguyen recommends 1Password and Dashlane).</span></p><p class=\"\"><span>The exercise was empowering, Adhikari says. \"I always tell my kids not to put things off, to do things now, and yet here I was with these things lingering in my brain,\" she says. \"You just have to rip the Band-Aid off.\"</span></p><p class=\"\"><span>Sane says the date was helpful for him, too, because it motivated him to consolidate all of their account information into a living document that can be updated as needed.</span></p><p class=\"\"><span>How to do it</span></p><p class=\"\"><span>Douglas Boneparth, a certified financial planner, had managed his family's finances until a few years ago, when his wife, Heather, decided she wanted more visibility.</span></p><p class=\"\"><span>\"When you intentionally or unintentionally step away from household finances, you don't realize right away that you're losing agency and options, but over time you start to feel it,\" Heather says.</span></p><p class=\"\"><span>The two have since co-written a book, \"Money Together,\" and give talks on how couples should have equal involvement in the family finances.</span></p><p class=\"\"><span>\"There's a low-threat way to open these conversations. You can say, 'If something happened to you, I'm concerned I wouldn't know where everything is,\" says Heather, a former corporate attorney who now manages their financial planning business. \"If your partner doesn't want you to be involved or tries to block access, that's a red flag.\"</span></p><p class=\"\"><span>The Boneparths offered some tips on how both partners can get up to speed:</span></p><p class=\"\"><span>Do it now. Don't wait until an emergency to figure out how to access accounts.</span></p><p class=\"\"><span>Ensure authorization. Even when you have joint accounts, a bank might consider one person the primary account holder. Make sure you're both authorized to talk to the bank and conduct transactions.</span></p><p class=\"\"><span>Do a trial run. Whatever your partner would normally do in a given month — flagging fraudulent charges, transferring money, checking investments — you try to do instead (and vice versa). Make sure you get the hang of handling the things your partner usually does, and that institutions recognize your ability to do so.</span></p><p class=\"\"><span>Write a note. Douglas composed what he calls a one-page, annually updated \"death note\" for Heather, detailing who to call and what to do if something were to happen to him. It includes the password to his computer. Heather made one for him, too. They keep the notes in their safe.</span></p><p class=\"\"><span>Make it a regular date. Douglas recommends couples meet quarterly to go over any account changes and to update passwords and documents. (Many multigenerational families do this.) If things are pretty stable, you might prefer doing it just once a year.</span></p><p class=\"\"><span>Write to Julie Jargon at Julie.Jargon@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000629:0/",
            "pub_date": "2026-02-28 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000631:0",
            "title": "He's Reese's Biggest Advocate — and Hershey's Biggest Headache — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Katie Deighton</span></p><p class=\"\"><span>On good days Brad Reese wakes up, throws on a bright orange shirt with the Reese's logo and hits the streets of West Palm Beach, Fla., to spread his love of the peanut-butter cups his grandfather invented.</span></p><p class=\"\"><span>Unfortunately for Hershey, current owner of the candy business, Reese also has bad days.</span></p><p class=\"\"><span>The 70-year-old grandson of H.B. Reese is the self-appointed defender of his family brand, a role that takes many forms. When he's not celebrating the candy, he's often bashing its owner. And lately he's been doing a lot of the latter.</span></p><p class=\"\"><span>\"They ruined my fun,\" he said of Hershey.</span></p><p class=\"\"><span>His Reese's opinions include but aren't limited to: Hershey should advertise the General Mills-produced Reese's Puffs Cereal on its website; Hershey should create a Reese's-branded credit card; Hershey should put more money into advertising Reese's in Europe. More than anything, he worries that any change in ingredients will erode consumer trust in the Reese's brand.</span></p><p class=\"\"><span>A Valentine's Day letter to Hershey executive Todd Scott, accusing the company of doing just that by quietly replacing milk chocolate and peanut butter with cheaper substitutes, went viral after MrBeast directed his 34 million followers to it. The YouTuber, whose real name is Jimmy Donaldson, made sure to note the \"real peanut butter\" in his Feastables cups.</span></p><p class=\"\"><span>Hershey said the famous peanut-butter cups are made the same way they always have been. The company noted it makes recipe adjustments to some Reese's products to allow for new shapes, sizes and innovations.</span></p><p class=\"\"><span>Reese hates what he calls the new flavor, but he still eats — and champions — the candy.</span></p><p class=\"\"><span>\"What my grandfather did was astronomical and to this day I'm in awe, and I like to honor him,\" said Reese, who was 7 when Hershey bought the family business.</span></p><p class=\"\"><span>For the best part of a decade, he has been posting almost exclusively Reese's-tinted thoughts to LinkedIn, where his job description often matches his mood: \"Reese's Economic Engine,\" \"Growing REESE'S Worldwide One Peanut Butter Cup at a Time,\" \"Protecting REESE's Brand Integrity.\"</span></p><p class=\"\"><span>\"There is no formal relationship between Brad Reese and the Hershey Company or Reese's,\" a company spokesperson said.</span></p><p class=\"\"><span>People who meet Reese in his brightly colored paraphernalia could be forgiven for thinking otherwise.</span></p><p class=\"\"><span>\"You run into people asking 'Do you have any free Reese's?'\" he said. \"And I say, 'No, I get much more pleasure and satisfaction out of watching people pay for them.'\"</span></p><p class=\"\"><span>People also ask how much Reese gets paid to be a brand ambassador. \"They don't believe that I'm out here doing what I'm doing, and not being an employee,\" he said.</span></p><p class=\"\"><span>Reese said his parents never encouraged him or his four siblings to get involved with the Hershey Company. His younger brother Andrew shares his love of the brand, and even owns the rights to their grandfather's name. But the other siblings prefer not to draw attention to their candy royalty status, he said.</span></p><p class=\"\"><span>Other Reese family members — H.B. had 16 children, 13 of whom survived into adulthood — wish Brad would do the same; a group of them recently issued a statement distancing themselves from his views.</span></p><p class=\"\"><span>Reese's father, Charles, co-owned the H.B. Reese Candy Company with his five brothers until 1963, when they merged the business with what was then the Hershey Chocolate Corporation. Hershey said the brothers' decision to sell transformed a $12 million-$14 million brand into a more than $3 billion icon.</span></p><p class=\"\"><span>It also transformed the Reeses' lives. Brad Reese spent his early childhood in Hershey, Pa. Immediately after the sale, his newly moneyed parents moved the family to Minneapolis. They divorced soon after and his father moved to Niagara Falls, N.Y., to oversee the construction of the Skylon Tower, which was financed in part by his Hershey shareholdings.</span></p><p class=\"\"><span>Reese said he disclaimed any inheritance. He served a stint in the military before attending Babson College and working as a trader and a consultant in digital infrastructure.</span></p><p class=\"\"><span>In 2007, he got his first taste of life online, blogging about the strategies and inner workings of Cisco on the website Network World and later his own site, BradReese.com. Wall Street Journal articles reporting on Cisco at the time occasionally featured the phrase \"first reported by blogger Brad Reese.\"</span></p><p class=\"\"><span>\"He was outspoken, he wanted to do a good job,\" said Larry Chafin, chief executive and chairman of Pluto Cloud Services, who blogged for Network World at the same time as Reese. \"Cisco didn't like us too much.\"</span></p><p class=\"\"><span>By 2015, Cisco's CEO had resigned and Reese felt the company was in good shape. It was time to move on. He turned his site into a shrine to Reese's — and a hub for his opinions on Hershey's management of the candy. It also features links to his social media and dating profiles.</span></p><p class=\"\"><span>Reese briefly moved back to Hershey in 2012, 50 years after his father left, but eventually settled in Florida. He now lives a relaxed beachside life. When he's not spreading his love of Reese's, he spends weekday afternoons singing Rolling Stones songs on karaoke machines in bars near the pier.</span></p><p class=\"\"><span>Reese has spent the past 15 years in and out of remission with non-Hodgkin lymphoma, which often fatigues him, he said. Once a month, he receives a five-hour infusion of immunotherapy. It hasn't yet put a stop to his work as the unofficial Reese's brand keeper.</span></p><p class=\"\"><span>At this point, a job at Hershey wouldn't interest him — he prefers the freedom to say what he wants.</span></p><p class=\"\"><span>\"You have to have a purpose in life,\" Reese said.</span></p><p class=\"\"><span>Write to Katie Deighton at katie.deighton@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000631:0/",
            "pub_date": "2026-02-28 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000632:0",
            "title": "All The Ways Netflix Actually Won Even Though It Lost Warner — Heard on the Street — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Dan Gallagher</span></p><p class=\"\"><span>Netflix investors are getting a happy ending, just not the one the company's management first envisioned.</span></p><p class=\"\"><span>The streaming giant's formal exit from the bidding war for Warner Bros. Discovery has cheered its own shareholders, sending the stock up nearly 14% on Friday. The stock has languished since Netflix announced its deal to acquire Warner in early December, and it was trending down even before that simply on rumors that it might make a play for the storied Hollywood studio. Before Friday, Netflix had shed about a third of its market value since The Wall Street Journal reported in mid-September that Paramount was preparing a bid for Warner.</span></p><p class=\"\"><span>Why such a harsh reaction? Buying Warner Bros. made sense for Paramount Skydance, whose subscale streaming service has long struggled to compete against the much larger offerings from Netflix, Disney and Warner.</span></p><p class=\"\"><span>But for Netflix, such a deal would have complicated the business model for a company that had already vaulted to a leading position in Hollywood on its strength as a streaming pure-play. Even its recently diminished market cap had Netflix nearly twice as valuable as Disney and far above any other media outlet. And at $72 billion, the price for Warner was steep for a company with just under $10 billion in annual free cash flow — and no history of doing megasize deals.</span></p><p class=\"\"><span>Warner could have ended up costing Netflix even more, in terms of both Hollywood drama and political trouble. The entertainment industry remained highly skeptical of Netflix's stated plans to keep Warner Bros. active in the theatrical movie business. And lawmakers had worries about a deal that could make Netflix even more dominant in the business of scripted entertainment. The need for government approval also made Netflix extra vulnerable to the whims of President Trump, who demanded last week that the company kick a former Biden administration official off its board of directors.</span></p><p class=\"\"><span>Instead, Netflix will walk away about $2.8 billion richer thanks to the termination fee outlined in their agreement with Warner. And it has run up the price on what will be a larger competitor, once Paramount Skydance and Warner Discovery get their merger over the necessary regulatory hurdles. One risk to losing the deal had been that a combined Paramount-Warner entity could pull popular content off Netflix to use for their own streaming offerings. But the merged company will now need all the cash flow it can muster to service a substantial debt load, so it is unlikely to fully turn away from the biggest payer in town.</span></p><p class=\"\"><span>That debt load — which Bernstein analyst Laurent Yoon estimates will total close to $100 billion — raises fresh questions about how combining two major studios will affect Hollywood, which has already been battered by shrinking TV and movie production. Substantial layoffs seem certain, but cost cutting alone won't make the operation into the sort of entertainment powerhouse that can better compete with the likes of Netflix and Disney. Compelling shows and movies will still be needed, and the costs of producing quality content are only going up.</span></p><p class=\"\"><span>In a report Friday, Robert Fishman of MoffettNathanson said content spending by Paramount-Warner will need to rank \"atop its media peers.\" But the company will also need to pay down a lot of debt to get back to an investment-grade credit rating, which Paramount Chief Strategy Officer Andy Gordon said the company was \"absolutely committed to\" in an earnings call on Wednesday.</span></p><p class=\"\"><span>Peter Supino of Wolfe Research said in his own report that Paramount Warner faces \"the difficult task of growing share while simultaneously deleveraging, a balance that could come at the expense of content investment.\" In a statement Friday afternoon, Paramount said it sees \"a clear path\" to investment-grade credit metrics within three years of the deal closing.</span></p><p class=\"\"><span>Netflix, meanwhile, now needs to convince investors that its pursuit of Warner wasn't coming from a place of weakness. Even with Friday's jump, the stock remains about 7% below the price it fetched before the company announced the deal in December. \"We believe it is important that Netflix management articulate how it can achieve its long-term growth goals, despite failing to obtain an asset for which it undertook significant risk in trying to acquire,\" Guggenheim analyst Michael Morris wrote on Friday.</span></p><p class=\"\"><span>To that end, Netflix at least showed some strength by pulling the plug early. The company had four business days to top Paramount's latest offer after Warner said Thursday that it found that bid superior. But Netflix called the whole thing off less than two hours after Warner's announcement.</span></p><p class=\"\"><span>That move showed discipline and helped buttress the case by Netflix management that Warner was nice to have, but not a need to have. Keeping a viewing audience engaged in a world awash in YouTube and TikTok videos will provide Netflix plenty of drama on its own.</span></p><p class=\"\"><span>Write to Dan Gallagher at dan.gallagher@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000632:0/",
            "pub_date": "2026-02-28 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002012:0",
            "title": "Iran strikes will likely boost defense stocks - but here's what will keep the cash flowing long after the conflict ends",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Jurica Dujmovic</span></p><p class=\"\"><span>A massive backlog of maintenance and software contracts will ensure recurring revenue</span></p><p class=\"\"><span>A Lockheed Martin F-22 Raptor 4001 stealth fighter is silhouetted against the setting sun in this undated file photo. Saturday's strikes on Iran by the U.S. and Israel will likely shine an even bigger spotlight on defense stocks.</span></p><p class=\"\"><span>Wars end. Maintenance contracts do not.</span></p><p class=\"\"><span>Defense stocks have been treated as geopolitical barometer. When tensions rise and military conflict breaks out, shares climb. When headlines cool, the trade fades. It's a narrative built around procurement cycles and crisis-driven spending. The attack on Tehran on Saturday by Israel and the U.S. should repeat this pattern for defense stocks in coming days.</span></p><p class=\"\"><span>But something more structural and long-term has been unfolding, something that looks far less like a one-off weapons sale and more like a long-term service contract. Parts of the defense industry are beginning to resemble subscription businesses, recurring revenue layered on top of a growing installed base.</span></p><p class=\"\"><span>For investors focused on earnings durability rather than war headlines, that distinction matters.</span></p><p class=\"\"><span>Weapons systems have evolved from disposable purchases to multi-decade ecosystems nowadays. Once a country fields a fleet of fighter jets, missile defense batteries, or naval destroyers, it commits to years or even decades of operating and support costs.</span></p><p class=\"\"><span>The Government Accountability Office has repeatedly noted that operating and support costs can account for roughly 70% of a major weapon system's total life-cycle cost, according to recent GAO report. Upkeep includes spare parts, depot maintenance, training, software updates, systems integration and availability guarantees. Since national defense cannot tolerate downtime, readiness spending tends to persist even when procurement ebbs.</span></p><p class=\"\"><span>In practical terms, the contractor that builds the platform often remains embedded in its upkeep. Every additional aircraft delivered expands the pool of long-term maintenance, logistics and modernization revenue.</span></p><p class=\"\"><span>That dynamic increasingly resembles aerospace aftermarket economy (and, in some respects, enterprise software) where installed bases drive recurring cash flow. Three companies that stand to benefit: Lockheed Martin (LMT); RTX (RTX) and Northrop Grumman (NOC).</span></p><p class=\"\"><span>Lockheed Martin: The ecosystem model: Lockheed Martin provides the clearest example of this shift. The F-35 program represented 26% of consolidated net sales in 2024, according to the company's latest Form 10-K. The filing explicitly states that F-35 revenue includes development, production, and maintenance, underscoring how support and logistics are embedded in the program's economy.</span></p><p class=\"\"><span>Service sales increased in 2024, driven in part by higher volume on F-35 upkeep contracts, the company disclosed in that same annual report.</span></p><p class=\"\"><span>By the end of 2025, Lockheed Martin reported a record $194 billion backlog and strong free cash flow generation in its full-year earnings release. That backlog provides multi-year revenue visibility that many industrial companies lack.</span></p><p class=\"\"><span>Support performance is not immune from scrutiny; a Pentagon watchdog has recently criticized aspects of F-35 maintenance and aircraft availability. Recurring revenue in defense is contractual and performance-based, not automatic.</span></p><p class=\"\"><span>Even so, the installed-base effect is unmistakable: every aircraft delivered expands a long-term revenue stream tied to readiness and modernization.</span></p><p class=\"\"><span>RTX: Installed base, diversified: RTX offers a different version of installed-base economy. The company has recently reported strong sales growth and highlighted a backlog approaching $268 billion, according to its latest earnings results.</span></p><p class=\"\"><span>On the defense side, missile systems and air defense platforms require ongoing upgrades and upkeep. Collins Aerospace operates within a vast installed base of aircraft systems that generate recurring parts and maintenance demand, the approach the company emphasizes in its investor materials.</span></p><p class=\"\"><span>Commercial aftermarket revenue behaves in many ways like an annuity tied to flight hours, while defense modernization cycles add a second layer of durability. The combination smooths earnings compared to pure production-driven models.</span></p><p class=\"\"><span>Northrop Grumman and the long arc of modernization: Northrop Grumman's portfolio is heavily weighted toward advanced systems - stealth aircraft, space assets, sensors and mission technologies.</span></p><p class=\"\"><span>Once fielded, those systems demand continuous upgrades and integration work as modern defense doctrine emphasizes ongoing modernization rather than static platforms. Sensors are refreshed. Software evolves. Networks expand. The company ended 2025 with backlog nearing $95.7 billion, according to its most recent annual report.</span></p><p class=\"\"><span>Northrop's strength in high-end systems integration positions it to benefit from that long modernization arc, although development-heavy programs can introduce project timing volatility.</span></p><p class=\"\"><span>The software layer: Defense as ongoing service: The transformation is perhaps the most visible in defense's growing digital footprint. The U.S. Defense Department's Joint Warfighting Cloud Capability contract vehicle reflects a shift toward acquiring commercial cloud services across classification levels.</span></p><p class=\"\"><span>Software-native companies like Palantir Technologies (PLTR) operate directly in that layer, providing analytics and AI systems through multi-year government contracts. Recent analyst coverage has highlighted the company's expanding government engagements and recurring revenue profile.</span></p><p class=\"\"><span>While valuation and volatility differ from traditional primes, the software layer most closely resembles true subscription economy within defense budgets.</span></p><p class=\"\"><span>The market may be behind the curve</span></p><p class=\"\"><span>Despite these structural shifts, defense contractors are often valued like cyclical industrial companies. The implicit assumption is that earnings are driven primarily by procurement wins and geopolitical events.</span></p><p class=\"\"><span>If maintenance, modernization and software continue rising as a share of revenue, that assumption will grow increasingly incomplete. Recurring support contracts and installed-base monetization can dampen earnings swings and support steadier free cash flow.</span></p><p class=\"\"><span>At the same time, intellectual property and data rights in maintenance contracts is a critical issue that the U.S. Government Accountability Office examined in its recent review of IP and sustainment planning. Control over technical data can shape who captures margin over the life of a program.</span></p><p class=\"\"><span>Markets tend to reward predictability. Businesses with durable cash flows often command stronger valuation multiples than those dependent on episodic demand. If defense contractors continue migrating toward service-heavy revenue mixes, the sector's risk profile may increasingly resemble infrastructure rather than crisis trade.</span></p><p class=\"\"><span>Defense stocks will continue to react to geopolitical headlines, but beneath those swings lies a structural evolution in how revenue is generated and sustained. The companies that control large, technologically complex installed bases -aircraft fleets, missile systems, naval platforms, secure networks - are not merely selling equipment. They are managing ecosystems that require continuous funding to remain operational.</span></p><p class=\"\"><span>This shift reframes the opportunity. Defense may no longer be just a trade on conflict. Increasingly, it resembles a long-duration cash-flow business anchored in readiness, modernization and software-driven support.</span></p><p class=\"\"><span>The market may still be pricing yesterday's model. Wars end. Maintenance contracts do not.</span></p><p class=\"\"><span>Read: Trump says 'massive' strike against Iran underway - bitcoin plunge offers a glimpse of how markets could react</span></p><p class=\"\"><span>-Jurica Dujmovic</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002012:0/",
            "pub_date": "2026-02-28 18:12:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        }
    ]
}