{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310230:0",
            "title": "BNP Paribas Exane Adjusts Price Target on NXP Semiconductors NV to $270 From $260",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NXP Semiconductors NV  has an average rating of overweight and mean price target of $249.31, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310230:0/",
            "pub_date": "2025-02-06 00:22:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310237:0",
            "title": "Baird Adjusts Fair Isaac Price Target to $1,775 From $1,975",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of Hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310237:0/",
            "pub_date": "2025-02-06 00:22:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0YY:0",
            "title": "Is the Fed too stringent with its 2% inflation target?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">S&amp;P 500, Nasdaq dip; Dow ~flat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Comm svcs weakest S&amp;P sector; Real estate leads gainers</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro STOXX 600 index up ~0.3%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar down; crude falls ~2%; gold up, bitcoin gains ~1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-Year Treasury yield slides to ~4.42%</li></ul></span></div><span><p class=\"\">IS THE FED TOO STRINGENT WITH ITS 2% INFLATION TARGET?</p><p class=\"\">The Federal Reserve may be being too rigid on how it calculates getting inflation back to its 2% annual target and could be underestimating the likelihood that inflation will drop more than expected, according to Societe Generale analyst Albert Edwards.</p><p class=\"\">Fed officials have expressed concern that inflation will remain higher for longer, which would make further interest rate cuts less likely. The prospect of tariffs by the Trump administration has added to inflation fears.</p><p class=\"\">But Edwards notes that several factors, including a strong U.S. dollar, may point to lower inflation. “The dollar plays a major role in the ups and downs of import prices and the recent dollar surge is set to send import prices sharply lower,” he said. Excess capacity in China is adding to drops in import prices.</p><p class=\"\">Meanwhile concerns about entrenched supercore services inflation are likely overdone, with labor costs back close to 2% year on year. Shelter inflation, which has kept the core consumer price index stubbornly high, is also set to accelerate its decline.</p><p class=\"\">Edwards further argues that the Fed should not be focused on core CPI at 3.2%, but instead the core PCE deflator, which is rising annually at 2.8%. And market based measures of this core PCE deflator are even lower at 2.4%.</p><p class=\"\">Former Fed Chair Paul Volcker “excoriated the Fed” in Oct. 2018, when he argued that the 2% annual target must have some degree of latitude on either side due to measurement errors, and that from 2010 to 2020 “the Fed’s obsession to drive it back up to 2% caused it to pursue an excessively loose monetary policy.”</p><p class=\"\">“Volcker’s criticism equally applies now, but in the opposite direction,” Edwards said. The Fed should be focusing on the core PCE deflator, and not core CPI. Meanwhile, “measurement errors mean that a stable core PCE between 2-3% is just fine and consistent with price stability.”</p><p class=\"\">Thus, Edwards warns that deflationary forces could overwhelm any inflationary impact from tariffs and surprise market participants.</p><p class=\"\">(Karen Brettell)</p><p class=\"\">     *****</p><p class=\"\">FOR WEDNESDAY'S EARLIER LIVE MARKETS POSTS:</p><p class=\"\">HUMP DAY DATA: ADP, SERVICES PMI, TRADE BALANCE, MORTGAGES - CLICK HERE</p><p class=\"\">MAIN U.S. INDEXES RED, BUT YIELDS TAKE A TUMBLE - CLICK HERE</p><p class=\"\">NASDAQ COMPOSITE: CONFRONTING AN INTERNAL STRUGGLE - CLICK HERE</p><p class=\"\">\"MORE PAY\": UK CONSUMER EYES BOOST - CLICK HERE</p><p class=\"\">FX TRADERS' HORIZONS \"AS SHORT AS THEY'VE EVER BEEN\" - CLICK HERE</p><p class=\"\">GOLD MINERS: MIND THE GAP - CLICK HERE</p><p class=\"\">BIG GAINERS BUT STOXX 600 FLAT - CLICK HERE</p><p class=\"\">EUROPE BEFORE BELL: EARNINGS KEEP YOU BUSY - CLICK HERE</p><p class=\"\">MARKETS CONFOUNDED BY TRUMP'S GAZA PROPOSAL - CLICK HERE</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0YY:0-is-the-fed-too-stringent-with-its-2-inflation-target/",
            "pub_date": "2025-02-06 00:22:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310241:0",
            "title": "MoffettNathanson Adjusts Equinix's Price Target to $990 From $965",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equinix  has an average rating of buy and mean price target of $1,040.96, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310241:0/",
            "pub_date": "2025-02-06 00:23:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006989:0",
            "title": "Treasury Keeps Plans for Bond Issuance Steady. It's a Relief, for Now. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Karishma Vanjani</p><p class=\"\">A looming risk to the bond market eased after the Treasury Department on Wednesday said it plans to keep the sizes of its bond sales steady well into 2025.</p><p class=\"\">In its debt-sale plan, the Treasury listed the same amounts of 10-, 20-, and 30-year bonds for sale from February to April as it did for November to January.</p><p class=\"\">A bigger concern was over its plans for sales in future quarters. But the Treasury said it \"anticipates maintaining nominal coupon and FRN auction sizes for at least the next several quarters.\" That matches what the department, which is responsible for borrowing on behalf of the government, has said for the past four consecutive quarters: that it doesn't anticipate changing the sizes of its debt auctions \"for at least the next several quarters.\"</p><p class=\"\">Strategists had been on edge, speculating over whether a change in language could be coming that would signal larger auctions of long-term bonds. The appointment of Scott Bessent, who officially took charge as Treasury secretary last week, created uncertainty because of the likelihood that his team would reassess the government's borrowing needs. He has previously blasted former Treasury Secretary Janet Yellen's decisions.</p><p class=\"\">Sales are expected to increase at some point, especially if proposals by President Donald Trump, such as an extension of tax cuts due to expire this year, are approved by Congress without any corresponding big cuts or freezes in other government spending. The Treasury would then need to step in to borrow money to cover the gap between government revenue and the amounts Trump wants to spend.</p><p class=\"\">Goldman Sachs, J.P. Morgan and Deutsche Bank strategists are all predicting that sizes of bond offerings won't begin gradually rising until November.</p><p class=\"\">More supply is the bond market's nemesis because all things being equal, having more debt available to buy would weigh on bond prices and increase yields.</p><p class=\"\">The 10-year yield was down 0.044 percentage points at 4.466% after the news on Wednesday.</p><p class=\"\">Write to Karishma Vanjani at karishma.vanjani@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006989:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008068:0",
            "title": "RXO Shares Drop After Wider-Than-Expected 4Q Loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">RXO shares were down 13% to $21.92 after the company reported a wider-than-expected fourth-quarter loss.</p><p class=\"\">The transportation-services company said it had a quarterly loss of $20 million, or 12 cents a share, compared with earnings of $2 million, or 2 cents a share, in the same quarter last year.</p><p class=\"\">Analysts polled by FactSet were looking for a loss of $13.6 million, or 7 cents a share.</p><p class=\"\">Revenue for the quarter was $1.67 billion, compared with last year's $978 million and the $1.66 billion analysts were expecting.</p><p class=\"\">RXO said brokerage volume increased 10% from the third quarter, and its managed-transportation sales pipeline now has nearly $2 billion in freight under management. Last-mile service grew 15% year over year.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008068:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008066:0",
            "title": "Mondelez To Up Chocolate Prices if Cocoa Costs Stay High — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1124 ET - Mondelez International expects adjusted earnings per share to fall 10% in 2025 due to elevated cocoa costs, after the snack maker said operating income declined 28% in the fourth quarter primarily due to that inflation. If chocolate costs remain high, Mondelez plans to gradually increase prices in the second half of this year, especially in developed markets, but the company said consumer confidence is still rocky, which could pose challenges to its pricing plan. Chief financial officer Luca Zaramella said he expects earnings per share to grow again in 2026, either from price increases or cocoa costs normalizing. (katherine.hamilton@wsj.com)</p><p class=\"\">1120 ET - Harley-Davidson CEO Jochen Zeitz says the company's electric motorcycle spinoff \"needs to perform\" following another disappointing year. LiveWire sold 612 bikes in 2024, far below its expectation of up to 1,500 bikes, and lost $110 million. Its CEO, Karim Donnez, says the company is cutting costs and hopes to succeed in Europe with a new \"maxi-scooter.\" Harley owns nearly 90% of LiveWire, and some analysts say the spinoff's losses are dragging down Harley's financial results. Zeitz says while the slow adoption of EV vehicles has hurt LiveWire, \"we'll obviously have to look at some optionalities\" if results don't improve. (john.keilman@wsj.com)</p><p class=\"\">1112 ET - Home Depot and Lowe's might report a better 4Q than Wall Street expects given recent results from the home-improvement chains' suppliers, Stanley Black &amp; Decker, Sherwin-Williams and Scotts Miracle-Gro, Davidson analyst Michael Baker says in a research note. Stanley Black &amp; Decker reports 2% organic growth in tools and outdoor products, an improvement from the 4% decline last quarter and the best increase since 2Q of 2021, the analyst says. Sherwin-Williams' consumer brands business, which is Lowe's main paint supplier, was flat in North America instead of down in the high-single digit percentage range like the three prior quarters, he says. And Scotts Miracle-Gro showed an acceleration of its gains from the prior quarter, the analyst says. (dean.seal@wsj.com)</p><p class=\"\">1047 ET - Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p><p class=\"\">1038 ET - The U.S. Treasury refunding announcement \"was mostly uneventful,\" Santander's Stephen Stanley writes. The U.S. Treasury says it is offering $125 billion in securities to refund around $106.2 billion of notes and bonds maturing this month, while raising around $18.8 billion in new cash. The Treasury warns of greater-than-normal issuance variability until the debt limit is suspended or increased. Stanley says the Treasury's current schedule \"should be fine for most or all of calendar 2025.\" He says coupon auction sizes will likely need to increase. Treasury yields are falling, showing no reaction to the refunding announcement. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1029 ET - GSK has to prove its pipeline is packed with new blockbuster treatments to withstand investors' concerns over its vaccine business slowdown in China and the U.S., AJ Bell investment director Russ Mould says. Further worries over the likely appointment of vaccine-sceptic Robert F Kennedy Jr. as Secretary of Health and Human Services in the U.S. still linger, he says. The British pharma giant's posted a second consecutive drop in sales in the fourth quarter, driven by a 19% decline in sales of its flu shots and a 52% plunge for its respiratory treatment Arexvy. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">1028 ET - U.S. growth came in surprisingly strong in 2024 versus start-of-year projections, and most economists expect the momentum to carry into 2025. But while the consumer economy and the services sector are thriving, industrial companies are complaining of a grimmer backdrop. \"Recent economic activity is primarily being led by the strength in service-related sectors,\" while the physical economy has been weaker, Dow CFO Jeff Tate tells analysts on a recent earnings call. Dow executives several times on the call referred to a \"prolonged economic downturn.\" Eastman Chemical CEO Mark Costa gave a similar take on the company's recent analyst call. \"The macro economy is certainly challenging right now as we all know,\" he said. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1002 ET - A new Redfin report reveals that nearly 70% of single, divorced, or separated individuals struggle with rent or mortgage payments, compared to over half of married people. Those living with a partner but unmarried face the highest struggle at over 75%. Single individuals often rely on one income, with 63% earning under $50,000 annually, versus 26% of married couples. Conversely, 29% of married people earn over $100,000, compared to just 7% of singles and 6% of divorced. Married couples benefit from tax advantages, enhancing financial stability. Despite these struggles, most pay on time, Redfin says.  (chris.wack@wsj.com)</p><p class=\"\">0924 ET — Capri Chief Executive John Idol says two of its key brands--Michael Kors and Versace--made missteps that contributed to an 11.6% decline in revenue and a net loss of $547 million in its third quarter. The Kors brand added too much fashion, alienating core customers. Versace removed too many unique statement items and reduced the number of lower-priced products. Idol says Kors will refocus on its heritage and plans to add a more balanced mix of products, while reducing some prices to be more in line with historical levels. Versace will add more products at the lower end of its price range to appeal to a broader base of consumers. (suzanne.kepner@wsj.com)</p><p class=\"\">0901 ET - ADP's employment estimate indicates solid U.S. job growth in January. The payroll and HR-services provider figures that the economy added 183,000 jobs last month. It also sharply revises up its December estimate: now to 176,000, from 122,000 previously. Carl Weinberg and Mary Chen of High Frequency Economics warn that the ADP figure isn't a stellar predictor of official data, but say adds useful color. \"Right now, [the big picture] is one of still substantial increases in jobs by a fast-growing economy but a slowing trend in job creation,\" they write. \"Today's figures do not upset that trend.\" (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0857 ET - Goldman Sachs economists think the risks of tariff escalation remain very real. The bank's team now projects that the U.S. will enact a 10% global tariff on critical imports such as semiconductors and pharmaceuticals as its baseline forecast, as well as a tariff on cars from the EU. If its current expected scenario is implemented, the tariffs could erase most progress on inflation otherwise expected this year, leaving core PCE inflation at 2.6% over the 12 months through December, Goldman projects. If Canada and Mexico tariffs are implemented after all, inflation would instead increase, peaking just above 3%, Goldman writes. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0847 ET - Oil futures are losing ground after an industry report of a large build in U.S. crude stocks, while the prospect of a trade war fuels concerns about demand. \"All of this tariff talk and general confusion that it's generating is bearish demand as companies can't expand if they don't know what their costs are or what they can sell their goods for,\" Scott Shelton of TP ICAP says in a note. The API reported a 5 million barrel increase in U.S. stocks for last week, analysts note. EIA data inventory are due later this morning, with a Wall Street Journal survey predicting a 1.3 million barrel build. WTI is off 1% at $71.97 a barrel and Brent is down 1.1% at $75.38 a barrel. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008066:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008060:0",
            "title": "Ball Corp Is Maintained at Overweight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:24 GMT) </strong>Ball Corp Price Target Cut to $70.00/Share From $75.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008060:0/",
            "pub_date": "2025-02-06 00:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464074:0",
            "title": "Rolls-Royce, UK Ministry of Defence Recyle Tornado Fighter Jet Components",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rolls-Royce (RR.L) is working on a recycling initiative aimed at turning old Royal Air Force Tornado fighter jet components into new parts for the Orpheus small engine concept. </p><p class=\"\">The British aerospace and defense group said Wednesday the Tornado 2 Tempest project will convert jet components into powdered metal, which will then be used for 3D printing. </p><p class=\"\">The initiative, which marks the first of its kind, is in partnership with the UK Ministry of Defence and Additive Manufacturing Solutions Ltd.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464074:0/",
            "pub_date": "2025-02-06 00:24:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310238:0",
            "title": "Jefferies Adjusts Fair Isaac Price Target to $2,175 From $2,275",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of Hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310238:0/",
            "pub_date": "2025-02-06 00:24:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW1AB:0",
            "title": "Blackrock To List Bitcoin Exchange-Traded Product In Europe- Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BLACKROCK TO LIST BITCOIN EXCHANGE-TRADED PRODUCT IN EUROPE- BLOOMBERG NEWS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW1AB:0-blackrock-to-list-bitcoin-exchange-traded-product-in-europe-bloomberg-news/",
            "pub_date": "2025-02-06 00:24:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310242:0",
            "title": "JPMorgan Adjusts Fair Isaac Price Target to $1,900 From $2,150",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of Hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310242:0/",
            "pub_date": "2025-02-06 00:24:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310239:0",
            "title": "Fubon Adjusts Price Target on NXP Semiconductors to $235 From $284",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NXP Semiconductors  has an average rating of overweight and mean price target of $249.31, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310239:0/",
            "pub_date": "2025-02-06 00:24:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW1AA:0",
            "title": "Japan-U.S. Summit Statement To Call For 'Golden Age' Of Bilateral Ties, Nikkei Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nikkei:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">JAPAN-U.S. SUMMIT STATEMENT TO CALL FOR 'GOLDEN AGE' OF BILATERAL TIES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">STATEMENT WILL EMPHASIZE REALIZING FREE AND OPEN INDO-PACIFIC AND BRINGING JAPAN-U.S. ALLIANCE TO \"NEW HEIGHTS\"</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ISHIBA, TRUMP, WILL ISSUE JOINT STATEMENT AFTER THEIR SUMMIT FRIDAY LAYING OUT SHARED VIEWS ON THE ECONOMY, SECURITY AND CHINA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW1AA:0-japan-u-s-summit-statement-to-call-for-golden-age-of-bilateral-ties-nikkei-reports/",
            "pub_date": "2025-02-06 00:18:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310217:0",
            "title": "Gibson Energy Maintained at Outperform with a $29.00 Price Target by National Bank of Canada",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">National Bank of Canada on Wednesday reiterated its outperform rating on the shares of Gibson Energy  and its $29.00 price target. </p><p class=\"\">Gibson recently announced that Sean Brown stepped down from his role as chief financial officer. Riley Hicks succeeded Brown in the role. </p><p class=\"\">National Bank said that during Brown's tenure since early 2016, the company delivered a total return of over 115% on the back of firming up its cash flow quality profile and solidifying an investment grade balance sheet. </p><p class=\"\">Meanwhile, Hicks joined Gibson in 2018 and most recently held the position of senior VP, corporate development, marketing and strategy.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310217:0/",
            "pub_date": "2025-02-06 00:18:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008032:0",
            "title": "Match's CEO Switch Fails to Quell Dating-App Growth Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Denny Jacob</p><p class=\"\">Match Group shares fell as the naming of a new CEO failed to quell concerns about the dating company's growth prospects.</p><p class=\"\">The online dating company on Tuesday named board member Spencer Rascoff as its new chief executive officer, replacing Bernard Kim.</p><p class=\"\">The timing was somewhat surprising but fit into a history of executive turnover at Match. Kim, who was recruited from mobile gaming company Zynga in 2022, would have had his contract automatically renewed in May.</p><p class=\"\">J.P. Morgan's Cory Carpenter in a note following the announcement said while the change wasn't shocking given challenges during Kim's tenure, this \"is not something we expected this soon.\"</p><p class=\"\">Rascoff, who joined the board last year as part of an agreement between Match and activist Elliott Investment Management, appeared to hint at Match's execution challenges.</p><p class=\"\">\"I'm here as CEO to make sure that the plans get executed and then some. I'm bringing urgency, I'm bringing accountability and prior experience to the role,\" said Rascoff, who noted he would buy $2 million worth of stock on Thursday as a sign of his conviction in the company, on an earnings call Wednesday.</p><p class=\"\">Shares are off about 7.5% at $33.75. The stock is down around 81% from its all-time closing high of $175.53 in October 2021.</p><p class=\"\">The Dallas company is turning to new executives to right the ship. Match in October named Steven Bailey as chief financial officer, effective March 1. Gary Swidler will leave the CFO role but remain as president.</p><p class=\"\">Match's priorities will circle around innovating Tinder, meeting its three-year targets laid out at its Investor Day, and keeping its activist investors--which includes Starboard Value and Anson Funds Management--at bay.</p><p class=\"\">The activists have pushed Match to improve its performance. Of the three, Starboard has been the most vocal about Match's struggles and said it should consider going private if it can't fix Tinder and hit on other growth opportunities.</p><p class=\"\">Representatives for the three activist investors couldn't be reached immediately for comment on Rascoff's appointment.</p><p class=\"\">Results from the fourth quarter present a mixed picture on the company's progress. Revenue declined slightly to $860 million from $866 million in the prior-year period, but exceeded Wall Street's estimates of $857.1 million.</p><p class=\"\">At Tinder, however, revenue from the app declined 3.4% to $476 million year-over-year, while the number of paying users edged down to 9.5 million. The dating app has posted declining payers on a year-over-year basis since the second quarter of 2023.</p><p class=\"\">Match also offered detailed revenue guidance for the first quarter and 2025, which was below Wall Street's estimates on a reported basis. Analysts noted that adjusted revenue guidance for 2025 was consistent with the outlook provided at Investor Day in December but relies on assumed strength in the back half of the year.</p><p class=\"\">\"While [foreign-exchange-neutral] revenue guidance was maintained, it's also back-weighted driven by assumptions Tinder [monthly active user] trends improve,\" Citi analyst Ygal Arounian said in a research note.</p><p class=\"\">Write to Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008032:0/",
            "pub_date": "2025-02-06 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008033:0",
            "title": "Chinese Retailer Stocks Fall After USPS Pauses, Then Resumes Shipping",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">Shares of Chinese online retail companies pared back losses after the U.S. Postal Service said it would resume accepting packages from China and Hong Kong--a reversal from its announcement the previous night that it would stop accepting such packages--though the stocks remained down amid continued uncertainty about the effect of tariffs.</p><p class=\"\">Chinese online marketplace Alibaba saw its New York-traded American depositary receipts fall as low as $99.69, a 2.6% drop from market close on Tuesday, but they recovered some of their loss Wednesday morning. New York-traded ADRs of PDD, which owns budget e-retailer Temu, dipped as much as 4.6% to $108.83 after market close, and were still recently down 3%.</p><p class=\"\">The stocks have had a week of ups and downs as the Trump administration's 10% tariffs on Chinese imports threaten to upend their distribution of low-cost products to U.S. customers. The USPS said Wednesday morning it is working with Customs and Border Protection to establish an efficient way to collect the new tariffs while limiting distribution to package delivery.</p><p class=\"\">Some U.S.-based companies that rely on cheap shipping from China also reacted. Amazon's stock fell as much as 2.7% from Tuesday's closing price.</p><p class=\"\">As part of the tariffs, Trump also closed a trade loophole that has helped many Chinese retailers keep prices low for U.S. customers. The loophole, called de minimis, allows exports under $800 to enter the U.S. without duties, and has been crucial savings for e-commerce companies selling cheap clothing, electronics and furniture from China.</p><p class=\"\">Nearly 1.4 billion shipments in 2024 claimed the de minimis exemption, a more-than-sixfold increase from a decade ago, Customs and Border Protection said in January. The cost savings of de minimis has helped companies like Temu offer prices 20% to 40% lower than U.S. competitors and make an estimated $20 billion in 2024, KeyBanc analyst Brad Thomas told The Wall Street Journal.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008033:0-chinese-retailer-stocks-fall-after-usps-pauses-then-resumes-shipping/",
            "pub_date": "2025-02-06 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310208:0",
            "title": "Chipotle Mexican Grill's Guidance for Flattish Transactions in Q1 Conservative, BofA Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chipotle Mexican Grill's  outlook for flattish transactions in Q1 and sequentially slower same-store sales growth in Q2 is likely conservative, BofA Securities said in a note Wednesday. </p><p class=\"\">The outlooks assume that trends would slow against tougher laps despite the company having comp drivers in place, BofA said. </p><p class=\"\">\"We expect restaurant margins will be highest in Q2 to Q3 on seasonally higher volumes — despite headwinds from portion control and potential Q2 sales deleverage — and assume Q4 margins improve over Q1,\" BofA analyst Sara Senatore said in the note. </p><p class=\"\">BofA reduced its Q1 same-store sales growth outlook to 3% from 4.5% to reflect weather and calendar shift headwinds. The firm also lowered its full-year same-store sales growth estimate to 4.3% from 5.1%, but kept its earnings per share view unchanged at $1.34. </p><p class=\"\">BofA maintained its buy rating and $71 price objective on the Chipotle Mexican Grill stock. </p><p class=\"\">The company's shares were down 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310208:0/",
            "pub_date": "2025-02-06 00:19:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310222:0",
            "title": "Update: Kenvue Stockholder Starboard Nominates Four Directors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with Kenvue's statement in the fifth paragraph.)</p><p class=\"\">Kenvue  activist investor Starboard Value has nominated four candidates for Kenvue's board ahead of the company's 2025 annual meeting, according to a US Securities and Exchange Commission filing Wednesday. </p><p class=\"\">The hedge fund and its affiliates, which hold about 22 million shares, cited concerns over financial performance and governance, claiming that Kenvue has missed financial targets, lost market share, and failed to capitalize on its brand portfolio. </p><p class=\"\">Starboard said it tried to engage with Kenvue's leadership multiple times since October 2024. </p><p class=\"\">\"We are deeply concerned that the Board's continued complacency and deference to management will jeopardize the tremendous value creation opportunity we believe is possible at Kenvue,\" according to the filing. </p><p class=\"\">Kenvue said Wednesday that its board has been assessing Starboard's nominations and will provide a \"formal recommendation in due course.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310222:0/",
            "pub_date": "2025-02-06 00:19:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX70m9WY:0",
            "title": "Michael Trites Joins Aembit as Senior Vice President of Global Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1000px;aspect-ratio:1.6666666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX70m9WY-d66f9e6254fd1920233eebf397fc1f31-resized.webp\" type=\"images/webp\"/><img alt=\"Aembit\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX70m9WY-d66f9e6254fd1920233eebf397fc1f31-resized.jpeg\" style=\"background-color:#e17744\"/></picture></div></figure></span></p><p class=\"\">SILVER SPRING, Md., Feb.  05, 2025  (GLOBE NEWSWIRE) — Aembit, the non-human identity and access management (IAM) company, today announced that Michael Trites has joined the company as senior vice president of global sales. In this role, Trites will lead Aembit’s global sales strategy, driving adoption of its industry-first Workload IAM Platform.</p><p class=\"\">Trites brings over two decades of experience scaling sales organizations at high-growth security companies. He previously served as executive vice president of global sales at Dig Security, a provider of data security posture management, where he helped drive the company’s expansion and go-to-market strategy, leading to its acquisition by Palo Alto Networks.</p><p class=\"\">\"Michael's track record spearheading adoption in emerging cybersecurity markets makes him the ideal leader to accelerate Aembit's growth,\" said David Goldschlag, co-founder and CEO of Aembit. \"His expertise will be essential as we help organizations recognize the importance of securing and managing their rapidly growing mix of client workloads, AI agents, and service accounts.\"</p><p class=\"\">Prior to Dig, Trites held sales executive roles at CyCognito, BigID (recognized by Deloitte as one of North America’s fastest-growing companies from 2020 to 2024), and Zimperium, where he helped expand market reach and drive revenue growth. He also spent more than a decade at Riverbed Technology, where he advanced through multiple sales leadership roles, ultimately overseeing sales for the Americas East region. Most recently, he led global sales at MineOS, focusing on data privacy and compliance solutions.</p><p class=\"\">Now at Aembit, he is focused on helping organizations secure non-human identities by authenticating client workloads, enforcing access rights, and issuing short-lived credentials – eliminating static secrets and reducing an attack surface increasingly implicated in high-profile data breaches.</p><p class=\"\">“Aembit’s approach to non-human identity management fills a major gap in modern security,” Trites said. “Many solutions highlight the risk, but almost none actually solve it. Unlike tools that only provide visibility into service accounts, Aembit enforces policy-based, secretless access and removes the need for developers to build authentication into applications. That lets companies move faster and build with confidence. I’m excited to help bring this model to more organizations.”</p><p class=\"\">For more information about Aembit, users can visit www.aembit.io.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aembit</strong></p><p class=\"\">Aembit is the leading provider of workload identity and access management solutions, designed to secure non-human identities like applications, AI agents, and service accounts across on-premises, SaaS, cloud, and partner environments. Aembit’s no-code platform enables organizations to enforce access policies in real time, ensuring the security and integrity of critical infrastructure. Users can visit the official website aembit.io and LinkedIn.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">Apurva Davé</p><p class=\"\">info@aembit.io</p><p class=\"\">Aembit on LinkedIn</p><p class=\"\">Website </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CMO</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apurva Davé</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aembit</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">dkaplan@aembit.io</strong></p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/f007ac12-a88a-415e-956e-91b9049a2bba</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aembit</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Aembit</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX70m9WY:0-michael-trites-joins-aembit-as-senior-vice-president-of-global-sales/",
            "pub_date": "2025-02-06 00:19:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008038:0",
            "title": "Harley-Davidson Growing Impatient with Electric Spinoff — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Harley-Davidson CEO Jochen Zeitz says the company's electric motorcycle spinoff \"needs to perform\" following another disappointing year. LiveWire sold 612 bikes in 2024, far below its expectation of up to 1,500 bikes, and lost $110 million. Its CEO, Karim Donnez, says the company is cutting costs and hopes to succeed in Europe with a new \"maxi-scooter.\" Harley owns nearly 90% of LiveWire, and some analysts say the spinoff's losses are dragging down Harley's financial results. Zeitz says while the slow adoption of EV vehicles has hurt LiveWire, \"we'll obviously have to look at some optionalities\" if results don't improve. (john.keilman@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008038:0/",
            "pub_date": "2025-02-06 00:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008036:0",
            "title": "Celestica Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:20 GMT) </strong>Celestica Price Target Raised to $160.00/Share From $140.00 by RBC Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008036:0/",
            "pub_date": "2025-02-06 00:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310233:0",
            "title": "Jefferies Adjusts PG&E's Price Target to $20 From $25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PG&amp;E  has an average rating of overweight and mean price target of $22.47, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310233:0/",
            "pub_date": "2025-02-06 00:20:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0XW:0",
            "title": "New York Times shares sink as current quarter forecast misses consensus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in New York Times Co  down 10.9% on Wednesday, hitting lowest level since May, on track for biggest one-day drop since June 2022 after quarterly report as subscription rev forecasts for the current quarter disappointed</p><p class=\"\">** NYT reported Q4 rev of $726.63 mln vs consensus view of $726.65 mln with adj EPS of $0.80 above consensus est of $0.74, as per LSGE</p><p class=\"\">** However, signaling intense competition for new readers in a busy year for media industry, NYT forecast subscription revenue growth of 7% to 10% for  Q1, with midpoint of range missing analysts' estimate of 9.9%, according to Visible Alpha     </p><p class=\"\">** After hitting low of $48.35 for session so far, NYT last traded at $49.90 vs median PT of $57, according to LSEG, which shows 12 analyst ratings: 2 'strong buy,' 4 'buy,' and 6 'hold' recommendations</p><p class=\"\">** NYT shares down 4.1% YTD after rising 6.2% in 2024 vs 2.5% gain YTD and 1.9% gain in 2024 for S&amp;P 400 media &amp; entertainment index (.SPMDCME) </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0XW:0-new-york-times-shares-sink-as-current-quarter-forecast-misses-consensus/",
            "pub_date": "2025-02-06 00:20:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310227:0",
            "title": "Griffon Keeps Quarterly Dividend Steady at $0.18 per Share, Payable March 18 to Shareholders of Record on Feb. 25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310227:0/",
            "pub_date": "2025-02-06 00:20:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0VL:0",
            "title": "US yields tumble to multi-week lows after service sector data, tariff risks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-year yield hits lowest since mid-December</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US two-year yield falls to lowest since Dec. 12</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US two/10-year yield curve flattens, narrowest gap since Dec. 23</li></ul></span></div><span><p class=\"\">    U.S. Treasury yields dropped to multi-week lows on Wednesday, weighed down by a weak report on the services sector, with investors continuing to grapple with persistent uncertainty about the Trump administration's tariff policy and the prospect of trade wars.</p><p class=\"\">    The benchmark 10-year yield dropped to its lowest since mid-December after the services data. It was last down 8.5 basis points (bps) at 4.428% . The two-year yield also fell, sliding to its weakest level since Dec. 12. It last changed hands at 4.170%, down 4.4 bps.  </p><p class=\"\">    The drop came after data showed the U.S. services sector activity unexpectedly slowed in January.</p><p class=\"\">The Institute for Supply Management's (ISM) non-manufacturing purchasing managers index (PMI) slipped to 52.8 last month from 54.0 in December. Economists polled by Reuters had forecast the services PMI edging up to 54.3.</p><p class=\"\">But the market focus remains on tariffs and trade wars.</p><p class=\"\">    \"The trade war is the recent thing driving yields. We've had the big threat of tariffs and that hasn't really materialized, at least for the moment,\" said Kathy Jones, chief fixed income strategist at Schwab in New York.  </p><p class=\"\">    \"And that was a relief to the market from the point of view of inflation or the price impact of tariffs ... But it's really a day-by-day, really a minute-by-minute assessment of the outlook. What is the outlook for the next six to 12 months?\"  </p><p class=\"\">    The uncertain outlook on tariffs came as the U.S. trade deficit widened sharply in December. Imports     surged to a record high     against the backdrop of tariff threats, which might have prompted businesses to rush purchases of foreign-made goods like metals and computers.  </p><p class=\"\">    The trade gap increased 24.7% to $98.4 billion, the highest since March 2022, from a revised $78.9 billion in November, the Commerce Department's Bureau of Economic Analysis said. The rise was the largest since March 2015. Imports increased 3.5% to an all-time high of $364.9 billion.   </p><p class=\"\">    The United States posted significant deficits with several trade partners, including China, Mexico and Canada, which have been targeted by President Donald Trump's administration for broad or additional tariffs. Trump on Monday suspended a 25% tariff on Mexican and Canadian goods until next month.  </p><p class=\"\">    In other parts of the bond market, the yield curve flattened, with the gap between two-year and 10-year yields hitting 23.7 bps (US2US10=TWEB), from 29.5 bps in the previous session.   </p><p class=\"\">    The curve hit its narrowest spread since Dec. 23, with traders describing it as a bull flattener, a scenario in which long-term rates are falling faster than short-dated one. The flattening of the curve reflects concerns about the growth and inflation outlook that could prompt the Federal Reserve to hold interest rates unchanged for longer.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0VL:0-us-yields-tumble-to-multi-week-lows-after-service-sector-data-tariff-risks/",
            "pub_date": "2025-02-06 00:20:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0V1:0",
            "title": "Canada to host summit on boosting economy after Trump tariff threat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        Canadian business and labor leaders will meet in Toronto this Friday to discuss diversifying trade and boosting the economy in the wake of U.S. threats to impose tariffs, Prime Minister Justin Trudeau said on Wednesday.  </p><p class=\"\">    U.S. President Donald Trump on Monday said he would     delay     the imposition of tariffs on Canadian exports by 30 days in return for concessions on border and crime enforcement.  </p><p class=\"\">    The move underlined long-standing calls for measures to reduce reliance on the United States, which takes 75% of all Canada's goods and services exports.  </p><p class=\"\">    Trudeau said the one-day meeting would group leaders in trade, business, public policy, and organized labor to build what he called a long-term prosperity agenda.  </p><p class=\"\">    \"(They) will explore ways to grow Canada’s economy, make it easier to build and trade within the country, diversify export markets, and rejuvenate productivity,\" he said in a statement.  </p><p class=\"\">    Trudeau's office did not immediately respond to a request for a list of attendees.  </p><p class=\"\">    Business groups have long complained about internal trade barriers between the 10 provinces and a drawn-out permitting process that means it can take years to develop and build mines, oil pipelines and other major industrial projects.   </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0V1:0-canada-to-host-summit-on-boosting-economy-after-trump-tariff-threat/",
            "pub_date": "2025-02-06 00:13:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310219:0",
            "title": "Goldman Sachs Adjusts PPG Industries' Price Target to $135 From $153",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PPG Industries  has an average rating of overweight and mean price target of $135.80, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310219:0/",
            "pub_date": "2025-02-06 00:13:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008008:0",
            "title": "U.S. Crude Oil Stockpiles Rise More Than Expected",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anthony Harrup</p><p class=\"\">U.S. crude oil stocks increased more than expected as production picked up, while the build in gasoline stocks extended to almost three months, according to data released Wednesday by the U.S. Energy Information Administration.</p><p class=\"\">Commercial crude oil stocks excluding the Strategic Petroleum Reserve rose by 8.7 million barrels to 423.8 million barrels in the week ended Jan. 31, and were about 5% below the five-year average for the time of year, the EIA said. Analysts surveyed by The Wall Street Journal had predicted crude stockpiles would increase by 1.3 million barrels.</p><p class=\"\">Oil stored in the SPR rose by 250,000 barrels to 395.1 million barrels. Oil stocks at Cushing, Okla., the Nymex delivery hub, slipped by 34,000 barrels to 20.9 million barrels.</p><p class=\"\">The EIA estimated U.S. crude oil production at 13.48 million barrels a day, up by 238,000 barrels a day from the week before. Crude imports rose by 467,000 barrels a day to 6.9 million barrels a day, and exports rose by 645,000 barrels a day to 4.3 million barrels a day.</p><p class=\"\">Refinery capacity use increased by 1 percentage point to 84.5%. Refinery runs were forecast to slip by 0.1 percentage points in the Journal survey.</p><p class=\"\">Gasoline inventories grew for a 12th consecutive week, rising by 2.2 million barrels to 251.1 million barrels, and were slightly above the five-year average, the EIA said. Gasoline stocks were forecast to be up by 100,000 barrels. Gasoline demand was little changed at 8.3 million barrels a day.</p><p class=\"\">Distillate fuel stocks fell by 5.5 million barrels to 118.5 million barrels, against expectations of a 1.6 million barrel draw, and were 12% below the five-year average.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Change in U.S. oil inventories for the week ended Jan. 31: <br/> <br/>                   Crude       Gasoline      Distillates         Refinery Use <br/>EIA data:           8.7           2.2           -5.5                  1.0 <br/>Forecast:           1.3           0.1           -1.6                 -0.1 <br/> </pre><p class=\"\">Note: Numbers in millions of barrels, with the exception of refinery use, which is in percentage points.</p><p class=\"\">Write to Anthony Harrup at anthony.harrup@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008008:0-u-s-crude-oil-stockpiles-rise-more-than-expected/",
            "pub_date": "2025-02-06 00:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012106:0",
            "title": "Novo Nordisk Expects Positive News on Weight-Loss Drugs, Soon, From FDA — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis and Elsa Ohlen</p><p class=\"\">Novo Nordisk fourth-quarter results comfortably beat expectations, easing some of investors' recent concern about the stock, including fierce competition from Eli Lilly.</p><p class=\"\">Yet, it wasn't all good news for the Danish pharma giant and maker of blockbuster weight-loss and diabetes drugs Ozempic and Wegovy. It also forecast slower sales growth ahead.</p><p class=\"\">Novo posted fourth-quarter earnings of 6.34 ($0.88) Danish kroner a share on sales of 85.7 billion DKK, beating expectations for earnings of 5.98 DKK a share on sales of 80.1 billion DKK, according to FactSet.</p><p class=\"\">Novo's American depositary receipts, or ADRs, were up 3.9% to $85.80 in premarket trading Wednesday. Novo's Danish listed shares rose 3.6%.</p><p class=\"\">Soaring sales of Ozempic and Wegovy has helped the Danish company to overtake luxury conglomerate LVMH as Europe's most valuable company.</p><p class=\"\">But Novo shares have taken a beating in recent months, with the stock's ADRs falling nearly 40% in the last six months of 2024. Shares first slid on growing worries that sales Wegovy and Ozempic wouldn't live up to the hype, and then on disappointing trial data for its next-generation weight-loss drug CagriSema.</p><p class=\"\">A positive pipeline update in January wasn't enough to reverse the momentum, and ADRs were down roughly 30% over the past 12 months as of Tuesday.</p><p class=\"\">Novo's Wegovy and Ozempic are among the most consequential, closely watched new medications in recent history, but they face serious competition both from Lilly's rival drugs Mounjaro and Zepbound and from legal copycats manufactured by compounding pharmacies and sold by telehealth firms. While compounders will soon be barred from selling knockoffs of the Lilly drugs, Novo's drugs remain in shortage, and can legally be copied.</p><p class=\"\">Ozempic sales for the quarter came in at 33.9 billion DKK, slightly above expectations of 33 billion DKK, according to analysts surveyed by FactSet. Wegovy sales more than doubled from the same period last year, and were largely in line with expectation at 19.9 billion DKK.</p><p class=\"\">Novo now forecast sales growth of between 16% and 24% in 2025, less than the 26% growth observed in 2024. Operating profit growth is expected to be between 19% and 27%, compared with a 26% growth in 2024.</p><p class=\"\">The guide range was broader than expected but better than feared and in line with the mid-point consensus call of 20%, according to BofA analyst Sachin Jain.</p><p class=\"\">\"We see an intact, strong demand for obesity treatments in the U.S. and elsewhere,\" CEO Lars Fruergaard Jørgensen said in a call with journalists early Wednesday. He highlighted that the 2025 guidance assumes a \"quite significant\" ramp in volumes in the U.S.</p><p class=\"\">The new outlook reflects expected continued periodic supply constraints and related drug shortages.</p><p class=\"\">Lingering supply constrains have been a worry for investors as Novo's inability to meet the huge demand for its products has hampered sales.</p><p class=\"\">In December, Novo closed an $11 billion deal to ramp up its supply of GLP-1 medicines, though it could take time for the results of that deal to be felt in the market.</p><p class=\"\">\"If we redirect everything that we have of GLP-1 to the U.S. we will be immediately out of the drug shortage situation,\" Henrik Wulff, executive vice president for product supply, quality, and information technology at Novo, told Barron's in December. But Novo serves markets worldwide.</p><p class=\"\">\"We try to balance these launches up against the in-market demands, and try to guesstimate how we can get out of the drug shortages,\" he said.</p><p class=\"\">Shares of Novo have yet to recover from a startling update in late December on CagriSema, a drug that combines the active ingredient in Ozempic and Wwgovy, Semaglutide, with Novo had said it expected patients to lose at least 25% of their body weight on CagriSema, but in a Phase 3 trial patients only lost 22.7%.</p><p class=\"\">In January, Novo unveiled early results on another weight loss drug, amycretin, which appeared very promising, though the drug has years of studies ahead of it before it can make it to market.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com and Elsa Ohlen at elsa.ohlen@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012106:0/",
            "pub_date": "2025-02-06 00:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}