{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0B9:0",
            "title": "Tata Projects to issue 6-year bonds, bankers say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">India's Tata Projects plans to raise 5 billion rupees ($57.4 million) selling bonds maturing in six years, three bankers said on Wednesday. </p><p class=\"\">The company has invited bids from bankers and investors for the issue on Thursday, they said. </p><p class=\"\">The company did not immediately reply to a Reuters email seeking comment. </p><p class=\"\">  Here is the list of deals reported so far on Feb. 5</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Issuer</p></td><td><p class=\"\">Tata Projects</p></td></tr><tr><td><p class=\"\">Tenure</p></td><td><p class=\"\">6 years</p></td></tr><tr><td><p class=\"\">Coupon (in %)</p></td><td><p class=\"\">To be decided</p></td></tr><tr><td><p class=\"\">Issue size (in bln rupees)*</p></td><td><p class=\"\">5</p></td></tr><tr><td><p class=\"\">Bidding date</p></td><td><p class=\"\">Feb. 6</p></td></tr><tr><td><p class=\"\">Rating</p></td><td><p class=\"\">AA (India Ratings)</p></td></tr></tbody></table></div><p class=\"\">*Size includes base plus greenshoe for some issues</p><p class=\"\">($1 = 87.1430 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0B9:0-tata-projects-to-issue-6-year-bonds-bankers-say/",
            "pub_date": "2025-02-05 11:11:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463650:0",
            "title": "CapitaLand Integrated Commercial Trust's DPU Stable in H2 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CapitaLand Integrated Commercial Trust's  distribution per unit or DPU remained unchanged year on year during the second half of 2024 at SG$0.0545, according to a filing with the Singapore Exchange on Wednesday. </p><p class=\"\">Distributable income, however, rose 6.4% to SG$385.7 million from SG$362.5 million a year earlier. </p><p class=\"\">Net property income was up 1.3% year on year to SG$571.1 million from SG$563.6 million, while gross revenue was up 1.2% on year to SG$794.4 million from SG$785.2 million. </p><p class=\"\">Analysts polled by Visible Alpha estimated revenue of SG$784.21 in H2, 2024. </p><p class=\"\">Additionally, the trust achieved a committed occupancy of 96.7% as of Dec. 31, 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463650:0/",
            "pub_date": "2025-02-05 11:11:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463647:0",
            "title": "Atlantic Lithium Says Talks on Ewoyaa Mining Lease Continue; Shares Tumble to All-Time Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Atlantic Lithium  responded to media speculation regarding the ratification of its mining lease for the Ewoyaa lithium project in Ghana. </p><p class=\"\">The company said it is in active discussions with the Ghanaian government as it strives to advance the project, which is set to be the country's first lithium mine, according to a Wednesday Australian bourse filing. </p><p class=\"\">Atlantic Lithium's shares were down 13% in recent Wednesday trade, hitting an all-time low.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463647:0/",
            "pub_date": "2025-02-05 11:11:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:f2a97d6a0094b:0",
            "title": "US Crypto Czar David Sacks calls bitcoin an ‘excellent store of value’: CNBC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Donald Trump’s AI and crypto czar David Sacks said that bitcoin is an “excellent store of value,” during an interview with CNBC on Tuesday.</p><p class=\"\">“First, you got bitcoin. It was the first digital currency. It’s the original, it’s the strongest one,” said Sacks. “It’s been around for over a dozen years now. No one’s ever hacked it. No one’s ever cracked the security around it.”</p><p class=\"\">During a news conference earlier Tuesday, Sacks outlined the Trump administration’s agenda on cryptocurrencies. The crypto czar revealed that evaluating a potential bitcoin reserve is one of the top priorities for the administration’s internal working group. A national strategic bitcoin reserve is one of many pro-crypto policies that Trump pushed during his election campaign. </p><p class=\"\">Trump has also supported greater clarity in regulating cryptocurrencies, as he signed an executive order to establish a crypto working group to draft new regulations for crypto assets.</p><p class=\"\">“I was on the Hill today meeting with the leaders of our House and Senate committees for banking and for finance, and they are very committed to moving legislation through the House and the Senate this year in order to provide that clear regulatory framework that the digital assets ecosystem needs to sustain innovation in the United States,” Sacks told CNBC, adding that it could be done in the next six months.</p><p class=\"\">Such movements were matched by a major shift happening in the U.S. Securities and Exchange Commission regarding the agency’s approach to cryptocurrencies.</p><p class=\"\">The agency’s newly created crypto task force is now working on distinguishing which cryptocurrencies are securities, which was an issue overshadowed by the SEC’s years-long “regulation by enforcement” approach under former chair Gary Gensler.</p><p class=\"\">Earlier today, the New York Times also reported that the SEC is moving to scale back its special unit for crypto enforcement actions, relocating some of its lawyers to other departments in the agency.</p><p class=\"\">During his interview with CNBC, Sacks also mentioned that the administration wants to bring stablecoin innovation, currently happening mostly offshore, to the U.S. by allowing the issuance of stablecoins domestically.</p><p class=\"\">“I think the power of stablecoins is that it could extend the dollar's dominance internationally, extend it online digitally, and create potentially trillions of dollars of new demand for our U.S. Treasuries,” Sacks said.</p><p class=\"\">Despite bitcoin being the focus of back-to-back announcements from U.S. authorities, the world’s largest cryptocurrency fell 2.8% to $98,052, struggling to recover much from China’s retaliatory announcement in response to Trump’s tariff proclamation.</p><p class=\"\">Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</p><p class=\"\">© 2024 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p></span></div>",
            "link": "https://www.tradingview.com/news/the_block:f2a97d6a0094b:0-us-crypto-czar-david-sacks-calls-bitcoin-an-excellent-store-of-value-cnbc/",
            "pub_date": "2025-02-05 11:11:55",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463652:0",
            "title": "Market Chatter: Henderson Land to Offer 5,400 Apartments Across 12 Projects in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Henderson Land Development  will inaugurate 12 projects with 5,400 apartments in 2025, the South China Morning Post reported Tuesday. </p><p class=\"\">The rollout comes as the developer is hopeful market prices will rebound in the second half, the report said. </p><p class=\"\">Among the projects to launch are phase two of the Belgravia Place in Cheung Sha Wan, with 248 units up for opening in February, the report said, citing general manager Thomas Lam Tat-man. </p><p class=\"\">Another project up for launch in the first quarter is the 300-unit offering at Nam Kok Road in Kowloon City, while another 2,060-unit offering in Kai Tak will go live, the report said, citing Mark Hahn Ka-fai, another sales manager. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463652:0/",
            "pub_date": "2025-02-05 11:12:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014475:0",
            "title": "Sime Darby's 11% ROE Target Attainable on China Motor's Turnaround, Potential Asset Divestments — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sime Darby's turnaround in its China motors operations and potential divestment of noncore assets could accelerate its goal of achieving an 11% ROE over the next five years, CIMB Securities says in a note. That is higher than its ROE of 7.2% in FY 2024. Analyst Mohd Shanaz Noor Azam says the Malaysian conglomerate could optimize working capital, streamline its portfolio and improve cost efficiencies to help it reach the target. Its industrial division is well-positioned to benefit from the global energy transition and steady demand for rental and after-sales services, contributing to long-term growth, he adds. The stock remains attractive, with projected dividend yields of 6.9% in 2025 and 7.3% in 2026. CIMB maintains a buy rating and a target price of MYR3.00 on Sime Darby. Shares are 1.8% higher at MYR2.22. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014475:0/",
            "pub_date": "2025-02-05 11:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014477:0",
            "title": "U.S. Treasury 10-Year Yield Still Faces Downside Risk, Chart Shows — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">0314 GMT - The U.S. Treasury 10-year yield still faces downside risk, based on daily charts, says Quek Ser Leang of UOB's Global Economics &amp; Markets Research in a research report. There's a possibility the 10-year yield will fall into the daily Ichimoku cloud, which is currently between 4.318% and 4.447%, the markets strategist says. Going forward, a break of the 10-year yield below the bottom of the daily Ichimoku cloud might potentially trigger sharp declines, the strategist says. On the other hand, if the 10-year yield rises above 4.690%, this would suggest that the 10-year yield is likely to trade in a range, the strategist adds. Treasury 10-year yield is steady at 4.5167%. (ronnie.harui@wsj.com)</p><p class=\"\">0257 GMT - Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0254 GMT - The future path of the U.S.-China trade conflict remains highly uncertain, say Goldman Sachs analysts in a note. China's retaliatory tariffs appear much less than proportional compared to the U.S.'s 10% across-the-board additional tariff on $525 billion worth of Chinese goods, they write. However, the combination of retaliatory tariffs with export bans, entity list additions, and antitrust probe into Google, suggests a \"more coordinated and comprehensive approach by [Chinese] policymakers\" than during the 2018-2019 U.S.-China trade war, they say. In the coming days, the U.S.'s reactions to China's retaliation will be among key events to watch, they add. (amanda.lee@wsj.com)</p><p class=\"\">0230 GMT - Unemployment in New Zealand is still rising despite rapid interest-rate cuts since mid-2024, leaving consumers and business owners still searching to see the light of an economic recovery. Mark Smith, senior economist at ASB Bank expects demand for labor will continue to weaken until a modest economic recovery finally shows up in the second half of 2025. Firms will have to carefully manage employee headcount in that time, he adds. With inflation close to the target midpoint and monetary settings still slowing the economy, further swift monetary easing looks appropriate to limit economic and labor market scarring, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0225 GMT - Japan's services sector is off to a strong start in 2025, the au Jibun Bank PMI compiled by S&amp;P Global suggests. January data point to a solid upturn in business activity across the sector, accompanied by a steeper, solid rise in new business inflows. The survey signaled a sharp jump in average prices charged by service providers, while exports rose for the first time in four months. Firms are upbeat on their prospects over the coming 12 months and have boosted staffing levels, says Usamah Bhatti, economist at S&amp;P Global Market Intelligence. Services continue to underpin growth in Japan's private sector, contrasting the weakness in manufacturing. Still, companies are confident that private-sector activity will rise over 2025, expecting a rebound in manufacturing output and a broad-based economic recovery, Bhatti says. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0226 GMT - The yen strengthens against other G-10 and Asian currencies in the morning session. Japanese data released earlier showed the economy's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases. A solid rise in Japanese labor cash earnings will reinforce the current market pricing in at least one more rate hike by the BOJ this year, CBA's Joseph Capurso says in a note. In addition, with the 'tariff war' between the U.S. and other countries seemingly ongoing, the AUD/JPY is likely to retest support at 94.69, the head of International and Sustainable Economics adds. USD/JPY falls 0.6% to 153.36; AUD/JPY drops 0.7% to 95.88. (ronnie.harui@wsj.com)</p><p class=\"\">0213 GMT - There are reasons to be hopeful that a recovery in New Zealand's economy in the second half of this year will help businesses avoid more cuts to headcount, says Mary Jo Vergara, an economist at Kiwibank. But should the required rate relief not come from the Reserve Bank of New Zealand, the risk of further ​job losses only grows, she says. The RBNZ's current forecasts suggest the OCR will get to 3.5% this year and no lower until deep in 2027. That will leave monetary conditions too restrictive, Vergara says. RBNZ will need to get the OCR down to 3% this year. Holding out longer will only cause unnecessary and indeed avoidable damage to the labor market, she adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0144 GMT - There are no signs yet that aggressive interest rate cuts by the Reserve Bank of New Zealand since mid-2024 are gaining traction and lifting the economy, says Ben Jarman, chief economist at JP Morgan. To be sure, recent GDP revisions show a more worrying economic trajectory, he adds. The data have yet to turn up meaningfully because policy traction is still being blunted by earlier OCR hikes, he adds. This has slowed the lowering of new mortgage rates, and any improvement in disposable incomes, Jarman says. A number of households will still be rolling their mortgages into higher rates than previous, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0146 GMT - JGBs fall in price terms during the morning Tokyo session. Data released earlier show Japan's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases and adding to the case for another BOJ rate hike. The sharp rise in the BOJ's core CPI inflation forecasts in the January outlook report, together with Gov. Ueda's recent comment that there's \"still a significant distance to the neutral rate of interest,\" has sparked worries over an acceleration of rate hikes and an increase in the terminal rate for this cycle, Mitsubishi UFJ Morgan Stanley Securities' fixed income strategists say in a recent report. The JGB 10-year yield is 1.5 bps higher at 1.290%. (ronnie.harui@wsj.com)</p><p class=\"\">0141 GMT - New Zealand's unemployment in 4Q 2024 rose to a four-year high of 5.1%. While this was in line with the Reserve Bank of New Zealand's forecasts, money markets should expect a cut in the official cash rate later this month of \"at least\" 50 basis points, says Kieran Davies, chief macro strategist at Coolabah Capital. The unemployment rate almost matches the peak of 5.2% reached during the short Covid recession in 2020, Davies notes. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0132 GMT - From a policy perspective, data showing New Zealand's unemployment rates at a 4-year high of 5.1% reaffirm the view that the Reserve Bank of New Zealand will continue to lower rates sequentially over 1H, including another 50-basis-point cut at a policy meeting later this month, says Andrew Boak, chief economist at Goldman Sachs. Boak continues to expect the RBNZ to slow the pace of cuts to 25 basis points per meeting, starting in April, ultimately reaching a terminal official cash rate of 3.0% in July. Still, the risks are skewed to faster and deeper cuts if the recent improvement in high-frequency surveys does not translate into some improvement in the economy, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0058 GMT - Trump's 10% tariff hike on China will likely cause faster industry consolidation among its industrial companies, Citi Research analysts led by Eric Lau say. While major exporters like Techtronic and Shenzhou have diversified production into Asean to avoid tariffs, smaller Chinese companies are unable to do so given difficulty in obtaining bank loans and lack of management resources, they say in a note. The tariff hike could cause them significant distress and spike the unemployment rate in China as these firms constitute about 79% of the total workforce, they add. That could lead China to roll out more stimulus to counter the economic impact. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014477:0/",
            "pub_date": "2025-02-05 11:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463648:0",
            "title": "Resources & Energy Group Completes First Gold Dore Pour From Gold Recovery Trial at Western Australia Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Resources &amp; Energy Group  completed its first gold dore pour from the trial vat leach program at the East Menzies gold project in Western Australia, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">Following the gold recovery trial, the company is implementing a structured mining and processing program at the project and has applied for an additional eight vat leach dams to the Western Australian Department of Mines, Industry Regulation and Safety, the filing said. </p><p class=\"\">Gold dore bars from the first pour have been delivered to the Perth Mint for refining and sale, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463648:0/",
            "pub_date": "2025-02-05 11:14:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "smallcaps:2c50806ec094b:0",
            "title": "BlueBet boosts Australian wagering market share with acquisition of Queensland bookmaker TopSport",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australian online bookmaker BlueBet Holdings  has made a $15 million offer to acquire Queensland sports and betting company TopSport. BlueBet will acquire a number of TopSport’s key assets including its customer database, brand, intellectual property and material contracts. The company expects the acquisition to advance its goal of achieving a 10% share of Australia’s wagering market. Cash-scrip payment The bid consideration will be for an upfront $10m payment to co-founders Lloyd and Tristan Merlehan. This payment will consist of $7m cash and $3m worth of new BlueBet scrip to be issued at the same price as the capital raising announced concurrent to the bid. Deferred earn-out payments will also be made based on the net gaming revenue generated from TopSport customers in the first three years of BlueBet’s ownership. If these do not reach at least $5m over the first two years, BlueBet will make up the difference in cash, putting the guaranteed total consideration at $15m. Capital raising BlueBet will fund the cash component of the upfront payment with a $15m capital raising from its institutional investors via the issue of approximately 44.1 million shares at $0.34 each. The company will satisfy all other payments from its future cash reserves. BlueBet anticipates the acquisition will be significantly accretive for shareholders, promising more than 30% growth in earnings per share across the 2026 and 2027 financial years. TopSport chief executive officer Tristan Merlehan will join BlueBet’s executive team as chief trading officer on completion of the deal. Enhanced profitability BlueBet chief executive officer Andrew Menz said the TopSport acquisition would materially enhance the company’s profitability and scale. “Inorganic growth remains a key opportunity for us and we have a repeatable mergers and acquisitions model to drive shareholder value by further consolidating the Australian wagering market,” he said. “Tristan Merlehan is one of this country’s most respected bookmakers and will help strengthen our market-leading risk and trading capability, driving margin improvement and sustainable profitability for shareholders.” Suitable partner Mr Merlehan said TopSport had identified BlueBet as the most suitable partner following a thorough process. “BlueBet’s long-term record in customer migrations and scaling wagering businesses is unrivalled and I am pleased to play a key role in its bright future as we grow our share of the Australian market,” he said. “I am very proud of what we have achieved at TopSport, and our customers will continue to receive the same levels of service going forward, together with the benefits of a significant uplift in their wagering experience.” Betr merger The TopSport acquisition follows BlueBet’s April merger with online bookmaker betr, which aimed to create a larger and more competitive online wagering service for the Australian market. It resulted in a combined active customer base across both businesses of 179,000 and approximately 341,000 open accounts. Betr’s customers migrated to BlueBet’s proprietary technology platform to drive organic and inorganic growth, retention and monetisation.</p></span></div>",
            "link": "https://www.tradingview.com/news/smallcaps:2c50806ec094b:0-bluebet-boosts-australian-wagering-market-share-with-acquisition-of-queensland-bookmaker-topsport/",
            "pub_date": "2025-02-05 11:14:26",
            "source": "Small Caps",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463653:0",
            "title": "Dynamic Metals Gets Drilling Programme of Work Approval For West Australian Gold Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dynamic Metals  received approval for a drilling program of work from the Department of Energy, Mines, Industry Regulation and Safety for the Coganc West prospect at Widgiemooltha project in Western Australia, the company said in a Wednesday Australian bourse filing. </p><p class=\"\">Previous soil sampling showed peak assay results of 2,040 grams per tonne grade of gold, the filing added. </p><p class=\"\">Drilling is set to start within the quarter upon receipt of necessary clearances.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463653:0/",
            "pub_date": "2025-02-05 11:14:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0B0:0",
            "title": "Japan's Nikkei reverses gains on BOJ's rate hike bets, stronger yen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Japan's Nikkei share average reversed early gains to inch lower on Wednesday, as escalating bets on the Bank of Japan's interest rate hike and a stronger yen dampened sentiment.</p><p class=\"\">The Nikkei  had slipped 0.18% to 38,727.19 by the midday break after opening higher and rising as much as 0.8% tracking U.S. equities' overnight gains. </p><p class=\"\">\"Market fundamental was not weak but short-term investors sold Nikkei futures as the yen strengthened, which pushed the Nikkei index lower,\" Yusuke Sakai, a senior trader at T&amp;D Asset Management, said.</p><p class=\"\">The yen  rose 0.6% in the Asian session to its highest since mid-December 2024.</p><p class=\"\">A stronger Japanese currency tends to hurt exporters' shares as it decreases the value of overseas profits in yen terms when firms repatriate them to Japan.</p><p class=\"\">Japanese government bond (JGB) yields hit new multi-year highs after government data showed a rise in wages, a key gauge for the central bank's monetary policy.</p><p class=\"\">\"The wage data and a stronger yen changed the course of the Nikkei. Both are negative to local equities,\" said Shuutarou Yasuda, a market analyst at Tokai Tokyo Intelligence Laboratory.</p><p class=\"\">In a sign of the market's firmness, of the more than 1,600 stocks trading on the Tokyo Stock Exchange's prime market, 59% rose, 36% fell and 3% traded flat.</p><p class=\"\">The broader Topix  was unchanged at 2,737.99, supported by a 11% surge in Panasonic Holdings .</p><p class=\"\">Nissan Motor  erased most of its early gains and ended the midday session 1.55% higher, after a report said the automaker and rival Honda  might call off merger talks.</p><p class=\"\">Department store operator Isetan Mitsukoshi Holdings  fell 7% to become the worst percentage loser on the Nikkei.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0B0:0-japan-s-nikkei-reverses-gains-on-boj-s-rate-hike-bets-stronger-yen/",
            "pub_date": "2025-02-05 11:15:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014426_20250204014431:0",
            "title": "Chiyoda Corp Sees FY Net Y22.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014426_20250204014431:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:52f5182e1094b:0",
            "title": "Crypto market may take over 2 months for ‘full recovery’ if 2022 pattern repeats",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">It may take until April for the crypto market to recover after US President Donald Trump’s tariff threats triggered massive crypto liquidations and raised concerns of a trade war, a crypto analyst says.</p><p class=\"\">“You likely won’t see those December highs on most Alts for a minimum of 2 months if not longer, so keep expectations tempered and just expect it to take time,” crypto analyst Matthew Hyland said in a Feb. 4 X post.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Other major events ‘took months’ to recover from</strong></p><p class=\"\">Hyland based his expectations on Feb. 3 being the “largest liquidation event in crypto history,” with over $2.24 billion liquidated from the crypto markets within 24 hours. Some crypto commentators suggest the figure could have been significantly higher.</p><p class=\"\">Bybit co-founder and CEO Ben Zhou said, “I am afraid that today’s real total liquidation is a lot more than $2 billion, by my estimation, it should be at least around $8 billion -10 billion.”</p><p class=\"\">It came amid escalating concerns over a potential trade war caused by Trump’s 25% tariffs on Canada, Mexico and China. Trump later paused the planned tariffs on Canada and Mexico after negotiations.</p><p class=\"\">On Feb. 3, Bitcoin  fell to $92,584, dipping below the $100,000 psychological level for the first time since Jan. 27.</p><p class=\"\">While it briefly rose above $102,000 the next day, it has since retraced, currently trading at $97,570 at the time of publication, according to CoinMarketCap data.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1120.5882352941176px;aspect-ratio:1.8676470588235292\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:52f5182e1094b-07e3b5191da850dba11a676a01803faf-resized.webp\" type=\"images/webp\"/><img alt=\"Cryptocurrencies, Markets\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:52f5182e1094b-07e3b5191da850dba11a676a01803faf-resized.jpeg\" style=\"background-color:#faf9f9\"/></picture></div></figure></span></p><p class=\"\">Hyland said this signals that the “low is in” but warned that other events in 2020 and 2022 that caused similar market disruption “took over 2 months for the full recovery to take place.”</p><p class=\"\">In 2020, the onset of the COVID-19 pandemic saw Bitcoin’s price shed as much as 47% of its intraday value from March 12 to March 13, with BTC falling to $5,017. By August, just five months later, Bitcoin was trading above $11,000.</p><p class=\"\">Similarly, in 2022, the collapse of the Terra blockchain in May and the collapse of the crypto exchange FTX in November both “took months” to recover from.</p><p class=\"\">Hyland said a “straight recovery” in a matter of days “is just not likely.”</p><p class=\"\">“Even a V shape like 2020 took weeks with many dips on the way back up,” Hyland said.</p><p class=\"\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:52f5182e1094b:0-crypto-market-may-take-over-2-months-for-full-recovery-if-2022-pattern-repeats/",
            "pub_date": "2025-02-05 11:05:48",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW03T:0",
            "title": "Palm eases on weak Chicago soyoil, but firmer Dalian caps losses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Malaysian palm oil futures eased on Wednesday as weaker Chicago soyoil prices pressured the market. However, stronger rival Dalian vegetable oils limited the decline.</p><p class=\"\">The benchmark palm oil contract  for April delivery on the Bursa Malaysia Derivatives Exchange fell 14 ringgit, or 0.32%, to 4,294 ringgit ($970.18) a metric ton in early trade. The contract dropped 1.35% on Tuesday.</p><p class=\"\">FUNDAMENTALS</p><p class=\"\">* Dalian's most-active soyoil contract (DBYcv1) rose 2.45%, while its palm oil contract  added 1.89%. Soyoil prices on the Chicago Board of Trade  shed 0.44%.</p><p class=\"\">* Palm oil tracks price movements of rival edible oils as it competes for a share of the global vegetable oils market.</p><p class=\"\">* India's palm oil imports in January plunged to their lowest in nearly 14 years as refiners replaced the tropical oil with cheaper rival soyoil due to negative refining margins for palm oil, five dealers said.</p><p class=\"\">* European Union soybean imports so far in the 2024-25 season that started in July 2024 reached 8.27 million metric tons by Feb. 2 compared with 7.32 million tons a year earlier.</p><p class=\"\">* The EU palm oil imports slid to 1.69 million tons from year-ago 2.14 million tons, data published by the European Commission showed.</p><p class=\"\">* Oil prices were little changed after volatile trading on Tuesday as investors shrugged off the impact of China's tariffs on U.S. energy imports, though U.S. President Donald Trump's renewed push to eliminate Iranian crude exports provided some support. O/R</p><p class=\"\">* The ringgit , palm's currency of trade, strengthened 0.32% against the U.S. dollar, making the commodity more expensive for buyers holding foreign currencies.</p><p class=\"\">* Palm oil may revisit its Feb. 3 high of 4,415 ringgit per metric ton as it managed to stabilize around support at 4,265 ringgit, Reuters technical analyst Wang Tao said. TECH/C</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:541.875px;max-width:1200px;aspect-ratio:2.2145328719723185\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW03T-031ef48f7b9076aace3b6b20f903f1ea-resized.webp\" type=\"images/webp\"/><img alt=\"tech/c\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW03T-031ef48f7b9076aace3b6b20f903f1ea-resized.jpeg\" style=\"background-color:#f6f0ed\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">cpo</span></figcaption></figure></span></p><p class=\"\">MARKET NEWS</p><p class=\"\">* Asian stock markets tried to steady on Wednesday amid hopes that U.S. tariffs would not be as painful for the global economy as feared just a day ago, though Wall Street futures took a knock from a sharp drop in Alphabet  shares as earnings disappointed. MKTS/GLOB</p><p class=\"\">DATA/EVENTS</p><p class=\"\">0850   France   HCOB - Services PMI, HCOB Composite PMI   Jan</p><p class=\"\">0855   Germany   HCOB Services PMI, HCOB Composite Final PMI   Jan</p><p class=\"\">0900   EU   HCOB Services Final PMI, HCOB - Composite Final PMI   Jan</p><p class=\"\">0930   UK   S&amp;P GLOBAL PMI: COMPOSITE - OUTPUT   Jan</p><p class=\"\">1330   US   International Trade $   Dec</p><p class=\"\">1445   US   S&amp;P Global Comp Final PMI, S&amp;P Global Svcs PMI Final   Jan</p><p class=\"\">1500   US   ISM N-Mfg PMI   Jan</p><p class=\"\">($1 = 4.4260 ringgit)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW03T:0-palm-eases-on-weak-chicago-soyoil-but-firmer-dalian-caps-losses/",
            "pub_date": "2025-02-05 11:07:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463649:0",
            "title": "China's Services Sector Sees Slower Growth in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's services sector remained in growth mode in January, but momentum slowed from the previous month. </p><p class=\"\">The Caixin China General Services Business Activity Index declined to 51.0 points last month from 52.2 in December 2024, according to a Wednesday research note from S&amp;P Global. </p><p class=\"\">New business rose, including foreign demand, but at a weaker pace, leading to the first drop in unfinished work since July 2024. </p><p class=\"\">Despite higher costs in raw materials and labor, selling price inflation softened, as firms absorbed some price pressures to boost sales. Job cuts continued, marking the fastest decline in service employment since April 2024. </p><p class=\"\">While market sentiment continued to be optimistic, service firms expressed concerns about \"intense market competition and global trade uncertainties,\" said Wang Zhe, senior economist at Caixin Insight Group.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463649:0/",
            "pub_date": "2025-02-05 11:08:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014470:0",
            "title": "China Tariffs on U.S. Energy Products May Have Limited Impact — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's countermeasures to impose tariffs on U.S. energy products should have limited impact, Citi analysts Oscar Yee and Desmond Law say in a research note. The U.S. only accounted for around 2% and 6% of China's 2024 crude oil and liquefied natural gas imports, respectively, making it easy to diversify to other sources, they say. The analysts note market focus should be on whether Beijing imposes further tariffs on ethane, propane and polyethylene, which could have much bigger impact, given that the U.S. represents around 99%, 59% and 17%, respectively, of China's 2024 imports. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014470:0/",
            "pub_date": "2025-02-05 11:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446659:0",
            "title": "Australian Dollar Holds Gains as Tariff Fears Ease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Australian dollar traded around $0.625 on Wednesday, maintaining its recent rebound as escalating trade tensions between the US and China proved less severe than expected.</p><p class=\"\">The 10% US tariffs on Chinese goods took effect on Tuesday, prompting Beijing to retaliate with its own levies on US imports, though the response has been relatively mild.</p><p class=\"\">Trump and Xi Jinping are also set to discuss the situation in an upcoming phone call, raising hopes that further escalation could be avoided and tariffs might be reversed.</p><p class=\"\">In Australia, investors are awaiting December trade figures, due for release on Thursday, to assess the health of the nation’s export-driven economy.</p><p class=\"\">Market sentiment is increasingly leaning toward expectations that the Reserve Bank of Australia may cut interest rates this month, as inflation eases and signs of slowing economic activity emerge.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446659:0-australian-dollar-holds-gains-as-tariff-fears-ease/",
            "pub_date": "2025-02-05 11:09:23",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV02L:0",
            "title": "East Timor favours Australia over Chinese firms on major gas project, president says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Stalled Greater Sunrise key for boosting East Timor revenue</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Woodside says talks on processing options ongoing, no final decision made</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">East Timor president expects nation to join ASEAN this year</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Country has issued gold mining licences, exploring onshore gas</li></ul></span></div><span><p class=\"\">    East Timor would prefer to work with Australia and partners Woodside Energy  and Japan's Osaka Gas  over Chinese firms that have expressed interest in developing the stalled Greater Sunrise natural gas field, its president said.</p><p class=\"\">The comments by President Jose Ramos-Horta in an interview with Reuters mark the first time he has publicly expressed a preference to develop the field with Australia and existing partners since he suggested doing so with new ones such as China and Kuwait last year.</p><p class=\"\">        The prospect of developing Greater Sunrise, which has 5.1 trillion cubic feet of gas reserves, with new partners had raised concerns in Australia about growing Chinese power and influence in the Pacific region.</p><p class=\"\">Ramos-Horta said East Timor has been stalling approaches from Chinese companies including state-owned Sinopec  as well as Kuwaiti firms to develop the field, as it is committed to its Australian partners. </p><p class=\"\">\"If anything, it is our side that has been holding off,\" Ramos-Horta said in an interview on Sunday during a commercial flight from Dili to Indonesia's Bali.</p><p class=\"\">State-owned Timor Gap owns a 56.6% stake in the field located about 140 km (87 miles) south of East Timor, while Australia's Woodside owns 33.4% and Osaka Gas holds 10%.</p><p class=\"\">The multi-billion dollar development of the field, whose revenues were estimated at $65 billion in 2018, has been stalled for decades amid disagreements with Australia and operator Woodside.</p><p class=\"\">It is vital to the economic growth of Southeast Asia's poorest nation, also known as Timor-Leste, which gained independence from Indonesia in 2002.</p><p class=\"\">\"Our government is open to listening to other investors. But in transparency with the existing joint venture, until the last minute, we say we want to work with Australia,\" he said.</p><p class=\"\">Ramos-Horta said Woodside's CEO had told him and the country's prime minister in private meetings that developing a liquefied natural gas plant in East Timor was a viable option, but added that Woodside and Osaka Gas were still pushing to pipe the gas to an existing LNG hub in Darwin, Australia.</p><p class=\"\">\"All evidence acknowledges that the Timor option is a viable one, not more expensive than the pipeline to Darwin,\" Ramos-Horta said, referring to findings of a report by British engineering and consultancy firm Wood  hired by the Sunrise joint venture as proof of the viability. </p><p class=\"\">The report has yet to be made public.</p><p class=\"\">Woodside said in a statement on Wednesday that the report did not make a recommendation, but it contained multiple considerations for each option including financing, technical and regulatory approvals. </p><p class=\"\">        \"At present, Woodside remains in discussion with the Sunrise Joint Venture participants about the outcome of the study and next steps,\" the company told Reuters, adding the participants remained in talks with the governments of Australia and East Timor.</p><p class=\"\">        Osaka Gas and Sinopec declined to comment, while the office of Australia's Resources Minister Madeleine King did not respond to requests for comment. </p><p class=\"\">        Ramos-Horta said a Kuwaiti private fund had visited Dili five times, expressing interest in underwriting the entire investment in the pipeline to East Timor required if the LNG plant is built there.</p><p class=\"\">\"We have no problems in financing an LNG plant in Timor-Leste ourselves. We have money,\" he said.</p><p class=\"\">Ramos-Horta said it was crucial that the Greater Sunrise agreement be signed before Australian federal elections in the first half of this year to prevent further delays, but said a meeting between the two countries had not been scheduled.</p><p class=\"\">\"Three years into the office of the current prime minister, if they have not made a decision, have not yet signed the agreement to bring the pipeline to Timor-Leste, then I wonder, what the real commitment of the government of Australia to Timor-Leste is,\" he said.</p><p class=\"\">Separately, Ramos-Horta said he expected East Timor to become a member of regional grouping Association of Southeast Asian Nations (ASEAN) this year.</p><p class=\"\">East Timor has also issued rights to mine gold to joint ventures between Timorese companies and Australian miners, and started exploring onshore natural gas in central and eastern Timor, he said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV02L:0-east-timor-favours-australia-over-chinese-firms-on-major-gas-project-president-says/",
            "pub_date": "2025-02-05 11:10:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014436_20250204014437:0",
            "title": "Nippon Yusen Sees FY Net Y450.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014436_20250204014437:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014426_20250204014430:0",
            "title": "Chiyoda Corp 9-Mos Net Y20.91B Vs Net Y15.69B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014426_20250204014430:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:0fa6a205b094b:0",
            "title": " The lesson of El Salvador’s failed Bitcoin experiment ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Opinion by: Kadan Stadelmann, chief technology officer of Komodo Platform</strong></em></p><p class=\"\">The International Monetary Fund wants to keep you down. Just look toward El Salvador for proof, where President Nayib Bukele abandoned his Bitcoin legal tender revolution in favor of international development loans. The new status quo has been made clear: while nation-states can stack and hold Bitcoin, the people cannot use it as legal tender. Instead, they must remain chained to fiat currency.</p><p class=\"\">The International Monetary Fund (IMF), a financial arm of the United Nations, has long played a significant role in the economic colonization of emerging countries on behalf of a cabal of corporations, banks and the US government. </p><p class=\"\">The IMF’s modus operandi has been to give developing countries development loans for construction and engineering projects. To receive these loans, countries often agree to balance their deficits, squeeze public spending, open their markets and privatize sectors of the economy. And, in the case of El Salvador, kill the Bitcoin Revolution and squash the opposition — Bitcoiners. This is known as “conditionality.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">The IMF says no Bitcoin for you</strong></strong></p><p class=\"\">El Salvador became the world’s first country to make Bitcoin legal tender in 2021. President Bukele gave lip service to the idea that he introduced Bitcoin as a legal tender to free the Salvadoran people from the chains of central banking.</p><p class=\"\">He has said, however, that the adoption of Bitcoin as tender by El Salvador’s Main Street has been slow. Bukele noted that it was the most unpopular measure his government had undertaken. According to a survey conducted by San Salvador University Francisco Gavidia, approximately 92% of Salvadorans did not use Bitcoin in 2023.</p><p class=\"\">It appears the revolution is dead. El Salvador has been forced to scale back its Bitcoin agenda to attract development funds from the IMF, and take a quick step back on its pro-Bitcoin legal framework. To receive a $1.4 billion credit line, Bukele chose to do what the IMF required: revoke his plan for Bitcoin as a national currency. The IMF called it mitigating Bitcoin-related risks.</p><p class=\"\">The development agency forced El Salvador’s government to reduce its Bitcoin purchases and no longer accept tax payments in Bitcoin. Bukele dropped the law requiring businesses to accept Bitcoin. Meanwhile, the IMF said the public sector’s Bitcoin-related activities will be restricted. </p><p class=\"\">Central American countries will also gradually scale back their partnership with Chivo, the Bitcoin e-wallet El Salvador launched in 2021. The plan is to either privatize or shutter Chivo. How many people use the digital wallet is not public. </p><p class=\"\">In 2021, the El Salvador government forked out $200 million to build out Bitcoin infrastructure, including Chivo and Bitcoin ATMs. It also offered $30 of free Bitcoin for those who signed up for the wallet. Most people used the Bitcoin to buy goods or exchanged it for dollars. </p><p class=\"\">Despite the changes to its Bitcoin strategy, El Salvador’s government says it remains dedicated to Bitcoin. It can still stack Bitcoin — look no further than its recent 12 Bitcoin purchase. Stacy Herbert, director of El Salvador’s National Bitcoin Office, said the country would still buy Bitcoin to continue building its strategy Bitcoin reserve. El Salvador will no longer make putting Bitcoin into the hands of the people a priority. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">The IMF vs. Bitcoin</strong></strong></p><p class=\"\">The Salvadoran government made Bitcoin legal tender so that everyday citizens could enjoy the cryptocurrency’s benefits. They could experience holding a sound asset in their hands. They could start to understand the ills that central banks cast upon society. </p><p class=\"\">The IMF disagrees. It has intended to diminish the chances that people discover how sound assets can change the lives of people with low incomes and the disenfranchised.</p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Recent: </strong></em>El Salvador buys another 12 Bitcoin for country’s reserve despite IMF deal</p><p class=\"\">“For the public sector, engagement in bitcoin-related economic activities and transactions in and purchases of Bitcoin will be confined,” the IMF stated. “Transparency, regulation, and supervision of digital assets will be enhanced to safeguard financial stability, consumer and investor protection, and financial integrity.”</p><p class=\"\">When El Salvador made Bitcoin a legal tender in September 2021, the IMF warned of financial and legal risks, which it recently said never materialized. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Bukele’s deal with the devil </strong></strong></p><p class=\"\">It’s nothing new for the IMF to keep the tools of financial liberation out of the hands of the people. Its dominion over under-resourced countries is a through-line of the post-World War II world. </p><p class=\"\">In 2024, the IMF’s colonial practices were met with mass protests in Kenya, which shed light on the predatory nature of the IMF. </p><p class=\"\">The protest called on President William Ruto to strike down an IMF-led bill for austerity and regressive taxes in the nations. </p><p class=\"\">It’s merely another case of the long arm of US colonial power prioritized at the expense of people experiencing poverty in underdeveloped countries. In Kenya and many other nations, the IMF continues pushing austerity measures, often freezing public sector bills. </p><p class=\"\">“This global financial architecture was not established by us, it was not established for us, so it cannot be the financial architecture that will help us today. [...] That is neo-colonial wealth extraction,” Tunisian-American economist Fadhel Kaboub said in an interview outside the IMF counter-summit in Marrakech. </p><p class=\"\">While people in Africa this year stood up to IMF colonization and power over debt, Bukele submitted.</p><p class=\"\">The IMF, functioning as an arm of the UN to homogenize economic policies worldwide, intends to maintain fiat currency dominance. Nation-states can stack, but the IMF’s development help must be contingent on nation-states abandoning any notions of Bitcoin as legal tender. That is the lesson of El Salvador.</p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Opinion by: Kadan Stadelmann, chief technology officer of Komodo Platform</strong></em></p><p class=\"\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:0fa6a205b094b:0-the-lesson-of-el-salvador-s-failed-bitcoin-experiment/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463643:0",
            "title": "Keppel Logs 43% Increase in H2 Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keppel's  profit in the second half of 2024 surged 43.3% to SG$660.3 million from SG$460.6 million a year earlier. </p><p class=\"\">Basic earnings per share came in at SG$0.349, up 42% from SG$0.246 in the comparable period, according to a Wednesday filing with the Singapore Exchange. </p><p class=\"\">Revenue was up nearly 4% year over year to SG$3.38 billion from SG$3.25 billion, mainly due to stable revenue from asset management fees. </p><p class=\"\">Funds under management grew to SG$88 billion in 2024. </p><p class=\"\">The global asset manager proposed a final cash dividend of SG$0.19 per share.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463643:0/",
            "pub_date": "2025-02-05 11:01:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463646:0",
            "title": "Dataprep Names Chairman",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dataprep  named Nor Adha Bin Yahya as the new company chairman on Tuesday, according to a same-day Malaysian bourse filing. </p><p class=\"\">He was re-designated from the position of independent director, the IT service provider said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463646:0/",
            "pub_date": "2025-02-05 11:02:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463639:0",
            "title": "S&P Global Singapore PMI Dips in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">S&amp;P Global Singapore Purchasing Manager's Index or PMI, a composite single figure indicator of performance, dipped under the 50.0 no-change mark during January, according to figures released by S&amp;P Global on Tuesday. </p><p class=\"\">PMI was 49.9, down from 51.5 in December 2024. </p><p class=\"\">Panelists attributed the dip to the spread of COVID-19 in the city-state which impacted new businesses and company operations. </p><p class=\"\">Business activity also declined, especially across the wholesale &amp; retail, finance &amp; insurance, and construction categories. </p><p class=\"\">However, manufacturing, consumer services, real estate &amp; business services and information and communication showed resilience during January. </p><p class=\"\">Meanwhile, employment decreased in January, following the first decrease in eight months at the end of 2024. </p><p class=\"\">Purchasing activity declined for the third consecutive month but the drop in input buying was relatively slower as compared to December 2024. </p><p class=\"\">Overall input costs increased during January with cost pressures driven by higher shipping and transportation prices.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463639:0/",
            "pub_date": "2025-02-05 11:05:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014418:0",
            "title": "Japan's Wage, Services Growth Support Case for More Rate Hikes — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014418:0/",
            "pub_date": "2025-02-05 10:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014422:0",
            "title": "LG CNS Makes Weak Debut After IPO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">LG CNS, an information-technology services affiliate of conglomerate LG Group, made a weak debut in South Korea after the country's biggest initial public offering in three years.</p><p class=\"\">Shares of LG CNS fell as much as 8.6% to 56,600 won, equivalent to $38.99, after opening at 60,500 won in their first day of trading on the Kospi stock exchange Wednesday. The shares pared some losses in later in the morning but remained below their IPO price of 61,900 won, the top end of their marketed price rage. The Kospi was recently up 0.9%.</p><p class=\"\">The company, through an oversubscribed share sale in January, raised 1.199 trillion won, equivalent to $825.9 million. That marked the largest IPO in South Korea since 2022, when battery maker LG Energy Solution raised more than $10 billion.</p><p class=\"\">The stock's lackluster performance put LG CNS's estimated market value at around $4 billion.</p><p class=\"\">LG CNS plans to use the IPO proceeds for facility investments, acquisitions of other IT firms and debt repayment.</p><p class=\"\">LG CNS said revenue rose 13% to 5.605 trillion won in 2023, while operating profit was up 12% at 464.05 billion won.</p><p class=\"\">LG Corp., the holding company for LG Group, has a 45% stake in LG CNS.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014422:0-lg-cns-makes-weak-debut-after-ipo/",
            "pub_date": "2025-02-05 10:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463642:0",
            "title": "Philippines' Headline Inflation Steady at 2.9% in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Philippines' headline inflation remained unchanged at 2.9% in January versus the previous month, according to data from the Philippine Statistics Authority on Wednesday. </p><p class=\"\">The reading also exceeded the consensus estimate for a 2.7% increase by Trading Economics. </p><p class=\"\">The higher inflation was mainly driven by a faster annual increment in the prices of food and non-alcoholic beverages at 3.8% versus 3.4% a month earlier. Another contributor was an annual increase in transport prices at 1.1% during the month, versus a 0.9% gain in the month prior. </p><p class=\"\">Food inflation also rose 4% in January from 3.5% in December 2024, the PSA said. </p><p class=\"\">Core inflation, which excludes volatile food and energy prices, also remained steady at 2.6% in December, the data showed.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463642:0/",
            "pub_date": "2025-02-05 10:58:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW03S:0",
            "title": "China's AIM jumps on vaccine's clinical trial application in US",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** AIM Vaccine  soars as much as 10.1% to HK$6.09; on course for biggest one-day pct gain since Nov. 1, 2024</p><p class=\"\">** Stock hits highest since Jan. 2 on second consecutive session of gains</p><p class=\"\">** Co submits application for clinical trial of mRNA RSV (respiratory syncytial virus) vaccines to U.S. FDA</p><p class=\"\">** Says preclinical animal tests results showed that humoral and cellular immunity of its mRNA RSV vaccine significantly higher than those of internationally marketed products</p><p class=\"\">** Adds industry consultant expects RSV vaccines' global market size to reach $16.7 bln by 2030 from $2.46 bln in 2023</p><p class=\"\">** RSV is a common respiratory tract infection pathogen, which is highly contagious and widely prevalent</p><p class=\"\">** Stock fell 21.8% last year</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW03S:0-china-s-aim-jumps-on-vaccine-s-clinical-trial-application-in-us/",
            "pub_date": "2025-02-05 10:58:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0A8:0",
            "title": "Weaker dollar, dip in US yields of no help to rupee",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Indian rupee is likely to decline at open on Wednesday weighed by the currency's weakness in the non-deliverable forward markets, while being unable to take advantage of the further decline in the dollar index.      </p><p class=\"\">The 1-month non-deliverable forward indicated that the rupee  will open at 87.14-87.16 to the U.S. dollar compared with 87.0675 in the previous session.</p><p class=\"\">There \"does not seem to be a specific reason\" for (dollar/rupee) NDF to be higher, a currency trader at a bank said.</p><p class=\"\">\"If I had to provide a reason, it's the overall direction, which is higher (on dollar rupee),\" the trader said. </p><p class=\"\">The rupee on Tuesday was in the 87.01-87.14 range, having to contend with the news flow on tariffs. The rally to near 87 brought about by the U.S. delaying tariffs on Canada and Mexico was cut short by China's retaliation to U.S. tariffs, to which the initial reaction of investors was to sell the Chinese yuan and avoid risk assets.</p><p class=\"\">That initial reaction faded, helping the rupee recover from the lows of Tuesday's session. </p><p class=\"\">All eyes on Wednesday were on China with markets resuming trade after the Lunar New Year break. The People's Bank of China set a higher-than-expected yuan mid-point. </p><p class=\"\">The onshore yuan was at 7.2832 to the U.S. dollar. Its offshore counterpart has declined past 7.36 on Tuesday.</p><p class=\"\">DOLLAR FALLS FURTHER</p><p class=\"\">The dollar index  slipped below the 108 handle after rallying to near 110 on worries over U.S. tariffs on its trading partners. U.S. suspending tariffs on Mexico and Canada interrupted the upward march on the dollar. </p><p class=\"\">\"With tariff news flow cooling off for now and no imminent deadlines, the focus will shift back towards the U.S. labour market,\" DBS Bank said in a note. </p><p class=\"\">Data released on Tuesday showed U.S. job openings fell by the most in 14 months. U.S. yields dropped. </p><p class=\"\">KEY INDICATORS:</p><p class=\"\">     ** One-month non-deliverable rupee (INRNDFOR=) forward at 87.34; onshore one-month forward premium at 18.5 paise    </p><p class=\"\">     ** Dollar index  down at 107.85</p><p class=\"\">     ** Brent crude futures  down 0.4% at $75.9 per barrel</p><p class=\"\">     ** Ten-year U.S. note yield at 4.5180    </p><p class=\"\">** As per NSDL data, foreign investors sold a net $416.5mln worth of Indian shares on Feb. 3</p><p class=\"\">     ** NSDL data shows foreign investors bought a net $22.6mln worth of Indian bonds on Feb. 3</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0A8:0-weaker-dollar-dip-in-us-yields-of-no-help-to-rupee/",
            "pub_date": "2025-02-05 10:59:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014437_20250204014437:0",
            "title": "Nippon Yusen Sees FY Net Y450.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014437_20250204014437:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}