{
    "data": [
        {
            "id": "DJN_DN20250205003088:0",
            "title": "Fincantieri Gets Large U.S. Order for Four Cruise Ships — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Cristina Gallardo</p><p class=\"\">Fincantieri said it received a large order for four cruise ships from a U.S. customer.</p><p class=\"\">The Italian state-owned shipbuilder didn't provide a value for the order, which was placed by Norwegian Cruise Line, but described it as \"very important.\" According to a person familiar with the deal, the contract is valued around 9 billion euros ($9.34 billion).</p><p class=\"\">Shares advanced 1.4% in mid-morning trade to 7.68 euros. The stock has risen 10.8% year-to-date.</p><p class=\"\">The cruise ships will be able to accommodate more than 8,300 people including crew, and will be built at the Fincantieri Monfalcone shipyard, near the Italian city of Trieste.</p><p class=\"\">They will be delivered in 2030, 2032, 2034 and 2036, Fincantieri said.</p><p class=\"\">The deal comes after the two companies signed a letter of intent in April 2024.</p><p class=\"\">Equita's analyst Emanuele Gallazzi said order the proves that the cruise sector remains a tonic, with a significant restart in orders recorded post-pandemic. The contract increases the medium and long-term visibility of Fincantieri's shipbuilding division, he added.</p><p class=\"\">\"Fincantieri's commitment and discipline regarding delivery times is important, confirming the target of maintaining the turnover of the Cruise business in the 4 billion euros area and thus avoiding excessive absorption of cash from working capital,\" he said.</p><p class=\"\">Aside from the new order, Fincantieri has already built two ships for Norwegian Cruise Line, and is about to deliver a third. Three other units are in various stages of design and construction, the shipbuilder said.</p><p class=\"\">Write to Cristina Gallardo at cristina.gallardo@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003088:0/",
            "pub_date": "2025-02-05 18:12:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0E6:0",
            "title": "Rupee drops to record low on RBI rate cut bets, stop losses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Indian rupee weakened to a record low on Wednesday as a sharp decline in the afternoon triggered stop losses amid a prevailing bearish bias on the currency and as traders positioned for a potential rate cut later this week.</p><p class=\"\">The rupee  weakened to 87.4875 against the U.S. dollar before closing at 87.4650, down 0.4% on the day. </p><p class=\"\">The currency has declined over 2% so far in 2025 and is the worst performer among major Asian currencies. Persistent foreign outflows, uncertainty surrounding U.S. trade tariffs and expectations of domestic rate cuts have all weighed on the rupee. </p><p class=\"\">Dollar sales by state-run banks near the 87.25 level offered support to the rupee earlier in the session but the currency fell sharply in the afternoon, triggering stop losses which aggravated its decline.</p><p class=\"\">Dollar demand from foreign banks and importers also pressured the currency, a trader at private bank said. </p><p class=\"\">\"Since its (USD/INR) rise above 87, there is some panic buying happening from importers,\" the trader said. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:865.8536585365854px;aspect-ratio:1.443089430894309\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0E6-d74a1c08848cb1f08a195b052be2e134-resized.webp\" type=\"images/webp\"/><img alt=\"Column chart showing performance of Asian currencies versus the U.S. dollar over 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0E6-d74a1c08848cb1f08a195b052be2e134-resized.jpeg\" style=\"background-color:#f8e5db\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Rupee is the worst performer among major Asian currencies</span></figcaption></figure></span></p><p class=\"\">The rupee had declined past 87 on Monday as U.S. President Donald Trump's tariffs on Canada, Mexico and China rattled global markets. The next day brought some reprieve for the currency as levies on Canada and Mexico were delayed.</p><p class=\"\">The dollar index was down 0.4% on Wednesday, while most Asian currencies gained but that did little to help the rupee with traders anticipating a 25-basis point rate cut by the Reserve Bank of India on Friday. </p><p class=\"\">\"While we believe RBI has become more tolerant of FX depreciation, as its focus has shifted towards supporting growth, the global backdrop remains fluid and, at this juncture, the RBI may err on the side of caution,\" Nomura said in a note. </p><p class=\"\">Although the brokerage expects a 25-bp reduction this week, it said that the chances of a \"dovish surprise\" via an outsized rate cut or a change in stance, remain low.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0E6:0-rupee-drops-to-record-low-on-rbi-rate-cut-bets-stop-losses/",
            "pub_date": "2025-02-05 18:12:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkrc2LnW8:0",
            "title": "BioStock: Elicera's CEO: \"2025 is a crucial year for us\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Elicera Therapeutics<p class=\"\">For Elicera, 2024 resulted in significant clinical progress and strategic initiatives that laid a solid foundation for continued development. The company entered 2025 with high ambitions, with data readouts from multiple clinical studies on the horison. BioStock contacted CEO Jamal el-Mosleh to get his perspective on the past year and what lies ahead. </p><p class=\"\">Read the interview at <strong class=\"root-Tkn6WL2y\">biostock.se</strong>:</p><p class=\"\">https://www.biostock.se/en/2025/02/eliceras-ceo-2025-is-a-crucial-year-for-us/</p><p class=\"\">This is a press release from <strong class=\"root-Tkn6WL2y\">BioStock - Connecting Innovation &amp; Capital</strong>. https://www.biostock.se/</p><p class=\"\">https://news.cision.com/elicera-therapeutics/r/biostock-elicera-s-ceo---2025-is-a-crucial-year-for-us-%2Cc4100937</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkrc2LnW8:0-biostock-elicera-s-ceo-2025-is-a-crucial-year-for-us/",
            "pub_date": "2025-02-05 18:12:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003106:0",
            "title": "Rampant Treasury Issuance Could Widen U.S. Yield Spread Vs Rest of World — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1013 GMT - Rampant U.S. Treasury issuance is pushing up borrowing costs and keep policy rates higher, Jupiter Asset Management's portfolio managers say in a note. \"This could widen the difference in the yield of U.S. Treasurys versus the rest of the world, attracting further capital flows and strengthening the dollar,\" they say. Inevitably, a sustained strength in dollar forces overseas investors to sell dollar-based assets, tightening financial conditions and this typically triggers the Federal Reserve to ease its policy, they say. \"One should look at the U.S. current account deficit for clues on the Fed's policy path.\" The 10-year U.S. Treasury-German Bund yield spread is 212 basis points, up 1 basis point, according to Tradeweb.(emese.bartha@wsj.com)</p><p class=\"\">0943 GMT - The U.K. Debt Management Office auction of the July 2053 green gilt at 1000 GMT is expected to perform well in relative value terms, RBC Capital Markets analysts say in a note. Wednesday's tap is likely to be the final one for the green gilt, which should support demand for the bond, the analysts say. \"We have also observed that outgoing 30-year conventional gilts have consistently outperformed into the end of their tapping cycles,\" RBC says. (miriam.mukuru@wsj.com)</p><p class=\"\">0919 GMT - Uncertainties remain around U.S. trade tariffs but easing tensions could improve risk appetite, driving U.S. Treasury yields higher, says Christopher Tahir at Exness. \"Uncertainties about further trade developments could leave investors cautious while new decisions from China and the U.S. could fuel volatility,\" the senior market strategist says in a note. \"Should trade tensions ease, risk appetite could improve, leading to a rebound in yields if traders move out of Treasury bonds.\" The 10-year U.S. Treasury yield falls 3 basis points to 4.480%, according to LSEG data. (emese.bartha@wsj.com)</p><p class=\"\">0912 GMT - The U.K. FTSE 100 index could rise to a new all-time high if the Bank of England signals additional future interest-rate cuts during Thursday's rate decision, Capital.com's Daniela Sabin Hathorn says in a note. \"A BOE rate cut could renew investor interest in U.K. stocks,\" she says. The FTSE 100 reached a new high of 8692.84 on Jan. 31. Any hints of more interest-rate cuts could reignite a U.K. equities rally, Hathorn says. (miriam.mukuru@wsj.com)</p><p class=\"\">0909 GMT - Bank Indonesia may cut rates by 25 bps in 1Q, bringing its policy rate to 5.50%, likely at its February policy meeting, as it prioritizes postpandemic easing, Barclays economist Brian Tan says in a note. Despite stable 4Q GDP growth, policymakers are expected to remain focused on reversing previous rate hikes, he notes. With USD/IDR stable around 16,300, another cut is likely, he reckons. Inflation softened in January, prompting a downward revision to Tan's 2025 average inflation forecast to 1.4% from 1.7%, below BI's 1.5%-3.5% target. If electricity discounts are extended beyond February, inflation could fall further, strengthening the case for continued monetary easing, he adds. (yingxian.wong@wsj.com)</p><p class=\"\">0859 GMT - The Polish zloty trades steady ahead of the National Bank of Poland's policy decision later. The central bank is widely expected to leave interest rates unchanged. This means the decision will be a \"non-event\" with the focus on any signals about future policy, ING analyst Frantisek Taborsky says in a note. The policy statement Wednesday and NBP Governor Adam Glapinski's press conference Thursday could both sound hawkish again by indicating rates will remain restrictive, Taborsky says. \"However, it's hard to imagine at this point what more the governor might add to the hawkish message from January.\" The NBP's decision is expected at 1400 GMT. EUR/PLN trades at 4.2112. (renae.dyer@wsj.com)</p><p class=\"\">0844 GMT - Singapore's retail sales will likely pick up this year, says OCBC's Selena Ling. Retail sales contracted 2.9% on year in December, marking its worst performance since February 2022, she writes. But with the Singapore Tourism Board expecting 17 million-18.5 million visitors this year that could generate S$29 billion to S$30.5 billion in revenue, things look brighter for the retail sector. Domestic consumption is also expected to be supported by a resilient labor market, Ling says. However, she cautions that external headwinds pose as a key risk for the retail sector, and a challenging trade environment may dampen near-term market sentiment. OCBC expects Singapore's retail sales to expand around 2% in 2025 compared to 2024's 1.2% and 2023's 2.3%.(amanda.lee@wsj.com)</p><p class=\"\">0837 GMT - The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p><p class=\"\">0830 GMT - Yields on U.K. government bonds, or gilts, fall ahead of an anticipated interest-rate cut by the Bank of England this week. Markets price in a 98% probability of a 25 basis-point cut to 4.5% on Thursday, LSEG Refinitiv data show. \"I suspect this Thursday's BOE will be sufficiently dovish to strongly raise odds of another cut already at the March meeting,\" Saxo's John Hardy says in a note. The 10-year gilt yield falls 3 basis points to 4.488%, Tradeweb data show. (miriam.mukuru@wsj.com)</p><p class=\"\">0822 GMT - The euro's gains will likely prove limited as it remains broadly unattractive given weak macroeconomic fundamentals and President Trump's threats to impose tariffs on the EU, ING analyst Francesco Pesole says. Wide eurozone-U.S. interest rate differentials in favor of the dollar reflect these factors, he says in a note. Trade news will dominate euro price action, although it will be interesting to hear whether the unexpected acceleration in January eurozone inflation triggers some change in the narrative from European Central Bank members. The ECB's chief economist, Philip Lane, is due to speak at 1400 GMT in Washington, DC. The euro rises 0.2% to $1.0402. (renae.dyer@wsj.com)</p><p class=\"\">0811 GMT - Singapore's retail sales could strengthen this year after a soft performance in 2024, buoyed by new attractions and other tailwinds, UOB associate economist Jester Koh writes in a note. Retail sales fell again in December due to weak tourist arrival numbers. For the full year, retail sales growth fell to 1.2% from 2.3% in 2023, with eight of 14 retail sales categories declining, he notes. Looking ahead, he expects new attractions, including Singapore's fifth zoological park, to lend support to sales. The upcoming budget 2025 is likely to be expansionary and further support measures could also lift sales, he adds. (amanda.lee@wsj.com)</p><p class=\"\">0803 GMT - The 10-year French-Spanish government bond yield spread is gradually nearing the 5 basis point threshold, signalling improving sentiment over France, Natixis analysts say in a note. The spread hasn't reached this level since last November, they say, describing it \"a sign that investor perception of France is less pessimistic than before.\" The 10-year French-Spanish yield differential is 5.6 basis points, according to LSEG data. French Prime Minister Francois Bayrou used special executive powers on Monday to push the 2025 budget through parliament without a vote, while facing a no-confidence motion on Wednesday. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003106:0/",
            "pub_date": "2025-02-05 18:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0QR:0",
            "title": "Morgan Stanley revises Fed rate cut forecast amid tariff uncertainty",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Morgan Stanley joined Barclays and Macquarie in forecasting a single 25 basis point interest rate cut by the U.S. Federal Reserve this year, citing uncertainty from President Donald Trump's tariff policy.</p><p class=\"\">The Wall Street brokerage had previously said it expected two 25 bps rate cuts in March and June. </p><p class=\"\">Peers Goldman Sachs and Wells Fargo continue to expect two interest rate cuts this year.</p><p class=\"\">President Trump's tariff policy is expected to drive up inflation and will increase pressure on the U.S. central bank as it looks to control persistent inflationary pressures.   </p><p class=\"\">\"Imposing tariffs more quickly than we assumed would likely mean disinflation halts at a higher pace of inflation, blocking any near-term path to cuts,\" Morgan Stanley analysts wrote in a note on Tuesday.</p><p class=\"\">\"Even if tariffs are avoided, we think their potential keeps uncertainty about PCE inflation elevated and keeps risks to PCE inflation tilted to the upside,\" they added.</p><p class=\"\">The personal consumption expenditures(PCE) price index for December, the Fed's preferred price gauge, came in line with market expectations, data showed.</p><p class=\"\">The central bank also left its benchmark overnight interest rate in the 4.25%-4.50% range at its January policy meeting, but Fed Chair Jerome Powell said more reductions in borrowing costs now hinge on further progress in lowering stubbornly high inflation.</p><p class=\"\">\"The path for monetary policy in 2025 remains highly uncertain,\" the brokerage added. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0QR:0-morgan-stanley-revises-fed-rate-cut-forecast-amid-tariff-uncertainty/",
            "pub_date": "2025-02-05 18:14:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204010892:0",
            "title": "Trump, tariffs and your 401(k) - why it's time to diversify",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Brett Arends</p><p class=\"\">Putting all your eggs in one basket is an especially bad idea now</p><p class=\"\">At moments like this, I think of Doug Ramsey.</p><p class=\"\">He's the chief investment officer of Leuthold Group, a Midwestern money-management company. Ramsey has long been running a theoretical portfolio called \"All Asset No Authority.\"</p><p class=\"\">Instead of going all in on the S&amp;P 500 SPX and the Nasdaq Composite COMP, which has been the Wall Street mania in recent years, this portfolio spreads its bets equally across what Ramsey considers to be the seven major asset classes.</p><p class=\"\">That means three-sevenths of the money, or 43%, is invested in gold, commodity futures and Treasury bonds.</p><p class=\"\">And those all happened to keep their cool during the Trump tariff panic on Monday morning as the rest of the financial world wobbled.</p><p class=\"\">Gold (GC00) jumped another $20 an ounce, hitting a fresh record of $2,855, after the Trump administration's weekend announcement of new tariffs on Canada, Mexico and China. Gold has risen more than 8% just since the start of the year and 900% since the start of the millennium.</p><p class=\"\">Meanwhile, Treasury bills BX:TMUBMUSD03M and bonds BX:TMUBMUSD10Y held their value Monday, as did commodity futures - helped by a jump in oil prices. The iShares S&amp;P GSCI Commodity Indexed exchange-traded fund GSG, Invesco DB Commodity Index fund DBC and iShares Bloomberg Roll Select Commodity Strategy ETF CMDY all edged into the black during morning trading that day.</p><p class=\"\">At the same time, the S&amp;P 500 index of large company stocks fell by nearly 1% and the Nasdaq Composite dropped by more than 1%. Small U.S. company stocks, as tracked by the Russell 2000 index RUT, also fell.</p><p class=\"\">\"The secular bull market in U.S. stocks since 2009 has been accompanied throughout by a secular bear market in diversification,\" Ramsey tells me. \"If U.S. large-cap stocks stall out over the next few years, many investors will find out just how dependent their returns have been on just a handful of stocks.\"</p><p class=\"\">The All Asset No Authority portfolio idea may seem wild and off the wall, especially compared with conventional investment approaches. Most people invest their 401(k) plans, IRAs and other retirement accounts in stocks, along with bonds.</p><p class=\"\">But there is method to the madness. Bonds, gold and commodities in particular have provided diversification benefits in the past that investors haven't been able to get from stocks.</p><p class=\"\">Consider, for example, three long periods in the past century when investors in the S&amp;P 500 got completely hosed.</p><p class=\"\">These were from 1937 to 1947, from 1965 to 1981 and from 2000 to 2012. On all three occasions, someone who invested $1 in the S&amp;P 500 at the start would have ended up with less than a dollar, after accounting for inflation, at the end. And that's before deducting investment fees and taxes.</p><p class=\"\">But in all three cases, data from Dartmouth College finance professor Kenneth French show, someone who had bet on energy and commodities (using energy stocks as a proxy) actually made good money. During the first period, energy stocks earned you a total return of 45%. In the second, they doubled your money. In the third, they nearly tripled your money. Each of these calculations, incidentally, is in real terms, meaning after deducting for inflation.</p><p class=\"\">Legendary investor and stock-market contrarian Jeremy Grantham, founder of the white-shoe investment firm GMO in Boston, reported a year ago that since 1970, resource stocks, meaning those that invest in energy and in mining, have been \"far and away the most diversifying sector\" of the market. \"At longer horizons (10 years) resources are the only sector of the stock market to be negatively correlated with the broad stock market,\" he wrote.</p><p class=\"\">The data on gold is sketchier, because the price was effectively suppressed by the federal government from the 1930s to the early 1970s. But the price went up tenfold from 1969 to 1981 and nearly sixfold from 1999 to 2012, far outpacing inflation.</p><p class=\"\">Note that gold today is very expensive by historic measures. It has more than doubled in the past decade.</p><p class=\"\">Meanwhile the data on Treasury bonds is mixed, because although they were terrific during the deflationary crash of 1929-32 that started the Great Depression and from 2000 to 2012, they were terrible during the inflationary stock-market slumps of the 1940s and 1970s.</p><p class=\"\">As for Treasury bills, generally referred to on Wall Street as \"cash\": They were a terrible investment during World War II and over the last decade, when the federal government suppressed short-term interest rates. But they held up well - and better than stocks - during other bear markets. They even kept up with inflation (just) during the bear market in stocks of the 1960s and 1970s.</p><p class=\"\">Veteran financial consultant Andrew Smithers, author of the 2009 book \"Wall Street Revalued: Imperfect Markets and Inept Central Bankers,\" calculated that Treasury bills were a better diversifier to a stock portfolio than bonds. Warren Buffett has urged his heirs to keep 90% of his fortune in the S&amp;P 500 but 10% in Treasury bills.</p><p class=\"\">Bulls like to argue that they don't need to diversify. The S&amp;P 500 has been such a great investment for so long, they can ignore everything else. But they are cherry-picking. They cheerfully cite data from the past 100 years to show that stocks outperform over the long run, but not data that show those same stocks often did very badly indeed, and for very long periods.</p><p class=\"\">So they will argue that the stock-market performance for the years and decades ahead will match its performance over the past 100 years - but only the good parts. The garden will bloom every spring and summer, but winters will never come. Maybe they're right. Then again, maybe not.</p><p class=\"\">-Brett Arends</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204010892:0/",
            "pub_date": "2025-02-05 18:15:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003115:0",
            "title": "News Highlights: Top Global Markets News of the Day - Wednesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Morgan Stanley's finally given up on the idea the Fed will cut in March. What went wrong.</strong></p><p class=\"\">Morgan Stanley has now given up on its contrarian stance the Federal Reserve will cut interest rates in March.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Rich Are Moving Assets Abroad. What's Prompting the Shift.</strong></p><p class=\"\">Some wealthy Americans are motivated by the changing political landscape under President Donald Trump, or they want to protect their assets if the U.S. economy weakens.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China's Lunar New Year Travel, Spending Boom Offer Positive Signs</strong></p><p class=\"\">Tourism revenues in China during the eight-day holiday that ended Tuesday rose 7.0% in year-over-year terms, while the number of domestic trips rose 5.9%, state media reported.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">French Industry Ends 2024 in the Doldrums</strong></p><p class=\"\">Total manufacturing output was 0.7% lower on month in December, an unexpected drop that has contributed to a backsliding in the eurozone's second-largest economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Demand Rose to Fresh High in 2024, Report Says</strong></p><p class=\"\">The record demand was driven by central banks and investors as geopolitical and economic uncertainty continued apace.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Postal Service Halts Shipments of China Parcels</strong></p><p class=\"\">The U.S. moves to halt the international parcel service popular with Chinese merchants.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003115:0-news-highlights-top-global-markets-news-of-the-day-wednesday-at-5-am-et/",
            "pub_date": "2025-02-05 18:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003114:0",
            "title": "News Highlights: Top Company News of the Day - Wednesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda Deal to Create World's No. 3 Automaker</strong></p><p class=\"\">Shares in Nissan fell while Honda stock closed higher, reflecting investor views that Nissan was more likely to benefit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tesla Stock Is Falling. California Might Be Turning Against Elon Musk.</strong></p><p class=\"\">Investors are looking for evidence Musk's politics are hurting Tesla. It's hard to find, but California might be turning against Musk-slowly.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Expects Slowing Sales Growth This Year</strong></p><p class=\"\">The Danish pharmaceutical company expects sales growth to slow this year as capacity constraints, intensifying competition and pricing pressure drag on sales of its blockbuster weight-loss and diabetes drugs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Toyota Boosts Earnings Guidance, to Set Up China EV Unit</strong></p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Watch Arm's Earnings for Clues on What DeepSeek Means for AI</strong></p><p class=\"\">The company makes money by licensing its chip designs to semiconductor companies and smartphone makers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations</strong></p><p class=\"\">Spain's biggest bank by assets was also confident it would be able to boost profitability again in 2025, raising a target despite projecting broadly stable revenue for the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003114:0-news-highlights-top-company-news-of-the-day-wednesday-at-5-am-et/",
            "pub_date": "2025-02-05 18:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN2xCygL:0",
            "title": "Instalco company wins contract at new construction of slaughterhouse",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Instalco company, Haug og Ruud VVS AS has signed an agreement as the general contractor for the heating, plumbing, ventilation, electrical and automation installations at a new slaughterhouse in Otta, north of Lillehammer, for Gudbrandsdal Slakteri AS. Another Instalco subsidiary, Istech AS, will also be involved in the assignment and the order value for Instalco is approximately NOK 95 million.</p><p class=\"\">“We are delighted to be a part of this project, which is important to the entire region. It will generate many new jobs, as well as opportunities for growth in both the business and farming communities of Gudbrandsdalen. This will be the most modern slaughterhouse in all of Norway,” says Sigbjörn Dalseghagen, CEO at Haug og Ruud VVS.</p><p class=\"\">As contractor for this assignment, Haug og Ruud will be responsible for the heating, plumbing, ventilation, electrical and automation installations. The scope and complexity of the installations is quite extensive, particularly the heating, cooling and freezer systems, as well as the plumbing, pump, air compression, hygiene and other slaughterhouse systems. It will be run as a partnering project with the client, Gudbrandsdal Slakteri AS.</p><p class=\"\">“We were able to propose a comprehensive solution to the customer, involving specialist expertise in several disciplines. Another decisive advantage was the added security of having Instalco behind it all as the parent company,” says Sigbjörn Dalseghagen.</p><p class=\"\">The project is already underway and will be completed during 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Fredrik Trahn, Head of Communications &amp; Sustainability, fredrik.trahn@instalco.se, +46-70-913 67 96</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN2xCygL:0-instalco-company-wins-contract-at-new-construction-of-slaughterhouse/",
            "pub_date": "2025-02-05 18:15:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0X5:0",
            "title": "Cash markets slip further; CPC Corp offers March gasoil",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Asia's middle distillates cash markets extended losses as expectations of ample, prompt supplies emerged, while March refiner sales activity continued to gain momentum.</p><p class=\"\">A handful of traders were concerned about the excess supplies in the near-term due to increasing import arrivals in the coming week. </p><p class=\"\">Quite a number of northeast Asia-origin cargoes will be bound for Singapore in the coming weeks, given a lack of demand there, one trade source said. </p><p class=\"\">Meantime, Asian prices need to be lower so that the wider east-west arbitrage can allow some swing suppliers to pivot west instead, a second source said. </p><p class=\"\">More March selling activity emerged, in line with expectations, as Taiwan's CPC Corp kicked off their sales tender for 10ppm sulphur gasoil. </p><p class=\"\">Refining margins (GO10SGCKMc1) closed the trading session at similar levels from the previous day, around $16.1 a barrel.     </p><p class=\"\">The 10ppm sulphur gasoil cash differentials (GO10-SIN-DIF) came under further pressure and closed at around 20 cents a barrel, as a reflection of the bearish trading sentiment and persistent offers - with no buyers in the open trading window. </p><p class=\"\">Regrade (JETREG10SGMc1) was slightly wider at a discount of 90 cents per barrel. </p><p class=\"\">SINGAPORE CASH DEALS </p><p class=\"\">- No deals for both fuels </p><p class=\"\">INVENTORIES</p><p class=\"\">-  U.S. crude oil and gasoline stocks rose last week while distillate inventories fell, market sources said, citing American Petroleum Institute figures on Tuesday.  </p><p class=\"\">- Middle distillates stocks at Fujairah Oil Industry Zone were at 1.841 million barrels, the lowest since November last year, in the week ended Feb. 3, according to industry information service S&amp;P Global Commodity Insights.</p><p class=\"\">NEWS</p><p class=\"\">- China's services activity expanded at a slower pace in January, with the Lunar New Year holidays worsening employment, but business sentiment improved, a private sector survey showed on Wednesday.</p><p class=\"\">- U.S. President Donald Trump on Tuesday restored his \"maximum pressure\" campaign on Iran that includes efforts to drive its oil exports down to zero in order to stop Tehran from obtaining a nuclear weapon.</p><p class=\"\">- Fuel oil margins climbed after Trump reimposed the stricter policy on Iran, though trade sources expect a short-lived rally due to unclear supply disruptions, while soft China demand and broader tariff fears weighed on sentiment. </p><p class=\"\">PRICES</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\"><p class=\"\">MIDDLE DISTILLATES</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">CASH ($/BBL)</p></td><td><p class=\"\">ASIA CLOSE</p></td><td><p class=\"\">Change</p></td><td><p class=\"\">Prev Close</p></td><td><p class=\"\">RIC</p></td></tr><tr><td><p class=\"\">Spot Gas Oil 0.5% </p></td><td><p class=\"\">86.57</p></td><td><p class=\"\">0.82</p></td><td><p class=\"\">85.75</p></td><td><p class=\"\">(GO-SIN)</p></td></tr><tr><td><p class=\"\">GO 0.5 Diff</p></td><td><p class=\"\">-5.41</p></td><td><p class=\"\">0.01</p></td><td><p class=\"\">-5.42</p></td><td><p class=\"\">(GO-SIN-DIF)</p></td></tr><tr><td><p class=\"\">Spot Gas Oil 0.25% </p></td><td><p class=\"\">91.51</p></td><td><p class=\"\">0.63</p></td><td><p class=\"\">90.88</p></td><td><p class=\"\">(GO25-SIN)</p></td></tr><tr><td><p class=\"\">GO 0.25 Diff</p></td><td><p class=\"\">-0.48</p></td><td><p class=\"\">-0.19</p></td><td><p class=\"\">-0.29</p></td><td><p class=\"\">(GO25-SIN-DIF)</p></td></tr><tr><td><p class=\"\">Spot Gas Oil 0.05%</p></td><td><p class=\"\">91.63</p></td><td><p class=\"\">0.60</p></td><td><p class=\"\">91.03</p></td><td><p class=\"\">(GO005-SIN)</p></td></tr><tr><td><p class=\"\">GO 0.05 Diff</p></td><td><p class=\"\">-0.36</p></td><td><p class=\"\">-0.21</p></td><td><p class=\"\">-0.15</p></td><td><p class=\"\">(GO005-SIN-DIF)</p></td></tr><tr><td><p class=\"\">Spot Gas Oil 0.001%</p></td><td><p class=\"\">92.18</p></td><td><p class=\"\">0.73</p></td><td><p class=\"\">91.45</p></td><td><p class=\"\">(GO10-SIN)</p></td></tr><tr><td><p class=\"\">GO 0.001 Diff</p></td><td><p class=\"\">0.20</p></td><td><p class=\"\">-0.08</p></td><td><p class=\"\">0.28</p></td><td><p class=\"\">(GO10-SIN-DIF)</p></td></tr><tr><td><p class=\"\">Spot Jet/Kero</p></td><td><p class=\"\">92.35</p></td><td><p class=\"\">0.48</p></td><td><p class=\"\">91.87</p></td><td><p class=\"\">(JET-SIN)</p></td></tr><tr><td><p class=\"\">Jet/Kero Diff</p></td><td><p class=\"\">1.15</p></td><td><p class=\"\">-0.03</p></td><td><p class=\"\">1.17</p></td><td><p class=\"\">(JET-SIN-DIF)</p></td></tr><tr><td colspan=\"5\"><p class=\"\">For a list of derivatives prices, including margins, please double click the RICs below.</p></td></tr><tr><td><p class=\"\">Brent M1</p></td><td colspan=\"2\"><p class=\"\">(BRENTSGMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Gasoil M1</p></td><td colspan=\"2\"><p class=\"\">(GOSGSWMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Gasoil M1/M2</p></td><td colspan=\"2\"><p class=\"\">(GOSGSPDMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Gasoil M2</p></td><td colspan=\"2\"><p class=\"\">(GOSGSWMc2)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Regrade M1</p></td><td colspan=\"2\"><p class=\"\">(JETREGSGMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Regrade M2</p></td><td colspan=\"2\"><p class=\"\">(JETREGSGMc2)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Jet M1</p></td><td colspan=\"2\"><p class=\"\">(JETSGSWMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Jet M1/M2</p></td><td colspan=\"2\"><p class=\"\">(JETSGSPDMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Jet M2</p></td><td colspan=\"2\"><p class=\"\">(JETSGSWMc2)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Gasoil 500ppm-Dubai Cracks M1</p></td><td colspan=\"2\"><p class=\"\">(GOSGCKMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Gasoil 500ppm-Dubai Cracks M2</p></td><td colspan=\"2\"><p class=\"\">(GOSGCKMc2)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Jet Cracks M1</p></td><td colspan=\"2\"><p class=\"\">(JETSGCKMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Jet Cracks M2</p></td><td colspan=\"2\"><p class=\"\">(JETSGCKMc2)</p></td><td></td><td></td></tr><tr><td><p class=\"\">East-West M1</p></td><td colspan=\"2\"><p class=\"\">(LGOAEFSMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">East-West M2</p></td><td colspan=\"2\"><p class=\"\">(LGOAEFSMc2)</p></td><td></td><td></td></tr><tr><td><p class=\"\">LGO M1</p></td><td><p class=\"\">(LGOAMc1)</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">LGO M1/M2</p></td><td colspan=\"2\"><p class=\"\">(LGOASPDMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">LGO M2</p></td><td><p class=\"\">(LGOAMc2)</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">Crack LGO-Brent M1</p></td><td colspan=\"2\"><p class=\"\">(LGOACKMc1)</p></td><td></td><td></td></tr><tr><td><p class=\"\">Crack LGO-Brent M2</p></td><td colspan=\"2\"><p class=\"\">(LGOACKMc2)</p></td><td></td><td></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0X5:0-cash-markets-slip-further-cpc-corp-offers-march-gasoil/",
            "pub_date": "2025-02-05 18:15:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0YJ:0",
            "title": "Lumen surges after Q4 revenue beat on data center demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of telecommunications company Lumen Technologies  rise 10.7% to $5.58 premarket</p><p class=\"\">** Co reports Q4 revenue of $3.33 bln vs average analysts' estimate of $3.20 bln - LSEG data</p><p class=\"\">** Co posts adj EPS of 9 cents vs estimates of 5-cent loss</p><p class=\"\">** LUMN sees FY25 free cash flow in range of $700 mln to $900 mln vs estimates of $126.6 mln</p><p class=\"\">** Currently, 14 analysts, on average, rate LUMN shares \"hold\"; median PT is $5 - LSEG</p><p class=\"\">** LUMN gained 190.2% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0YJ:0-lumen-surges-after-q4-revenue-beat-on-data-center-demand/",
            "pub_date": "2025-02-05 18:15:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463939:0",
            "title": "Marubeni's Nine Month Profit Rises Nearly 15%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marubeni  reported a 14.5% year-on-year increase in profit attributable to owners of the parent to 425.2 billion yen in the fiscal nine months ended Dec. 31, 2024, from 371.5 yen billion a year ago as improved revenue was futher boosted by a foreign currency gains associated with the end of the Qatar LNG project. </p><p class=\"\">The integrated trading and investment business conglomerate's earnings per share (EPS) rose to 255.55 yen from 219.59 yen a year ago, according to a Tokyo Stock Exchange filing on Wednesday. </p><p class=\"\">Revenue grew 5.4% to nearly 5.720 trillion from 5.428 trillion yen a year earlier. </p><p class=\"\">For the fiscal year ending March 31, 2025, Marubeni forecasted profit to grow 6.1% to 500 billion yen or 301.30 yen per share. </p><p class=\"\">It expects to pay a year-end dividend of 50 yen per share, bringing the total annual dividend to 95 yen per share.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463939:0/",
            "pub_date": "2025-02-05 18:15:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW118:0",
            "title": "Eli Lilly shares up after peer Novo Nordisk's Q4 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of U.S. drugmaker Eli Lilly  rise 1.70% to $840.08 premarket</p><p class=\"\">** Peer Novo Nordisk  posted Q4 operating profit above expectations</p><p class=\"\">** Sales of its blockbuster weight-loss drug Wegovy more than doubled</p><p class=\"\">     ** Novo lost out to Lilly in the fourth quarter in terms of total weekly prescriptions written for Wegovy compared to Lilly's Zepbound in the United States, the biggest market</p><p class=\"\">** Last month, LLY forecast Q4 sales of Zepbound below Wall Street estimates</p><p class=\"\">** LLY reports its quarterly results on Thursday</p><p class=\"\">** LLY shares gained ~32% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW118:0-eli-lilly-shares-up-after-peer-novo-nordisk-s-q4-results/",
            "pub_date": "2025-02-05 18:15:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463930:0",
            "title": "Singapore's Retail Sales Fall Further in December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's retail sales in December 2024 dropped further from the preceding month, missing analysts' prediction of a month-on-month growth. </p><p class=\"\">Retail sales declined 2.9% from the 0.5% slip in November 2024, according to data published by Singapore's Department of Statistics on Wednesday. </p><p class=\"\">Excluding motor vehicles, retail sales dropped 4%, compared to the previous month's 1.1% decline. </p><p class=\"\">The figures were far from the 1% year-on-year growth forecasted by analysts surveyed by Bloomberg, according to a same-dated Business Times report. </p><p class=\"\">The estimated total retail sales amounted to $4.6 billion in December 2024, with 13.4% coming from online retail sales, lower than 14.7% a month ago. The value of total retail sales, excluding motor vehicles, amounted to $4 billion, the statistics department said. </p><p class=\"\">The sales of computer and telecommunications equipment, and minimarts and convenience stores, as well as apparel and footwear, posted declines of between 6.7% and 13.1%. </p><p class=\"\">However, the sales of food and alcohol grew 9.4%, while that of motor vehicles climbed 6% during the month, according to the statistics department's data.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463930:0/",
            "pub_date": "2025-02-05 18:06:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0M1:0",
            "title": "Alphabet shares bear brunt of worries on massive AI spend, sluggish cloud growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Alphabet  shares dropped about 7% in premarket trading on Wednesday as investors were disappointed by the company's slowing cloud growth and concerned about its hefty investment to build artificial intelligence (AI) infrastructure.</p><p class=\"\">Alphabet has been heavily investing in infrastructure to enhance AI research and integrate it into products like search and cloud services. But its plan to pump in $75 billion towards these efforts this year was 29% higher than Wall Street's expectation of about $58 billion, according to LSEG data.</p><p class=\"\">\"This is a significant increase, and it shows that Alphabet is throwing the kitchen sink at its AI plans,\" said Kathleen Brooks, research director at trading platform XTB.</p><p class=\"\">The recent emergence of China's low-cost DeepSeek AI model, which is said to be on par or better than U.S. industry-leading models at a lower cost, has led to more pointed questions about the need for Big Tech to spend billions of dollars.</p><p class=\"\">Last week, Microsoft  and Meta Platforms  executives defended their hefty AI spending plans, saying they were crucial to staying ahead in the new field.</p><p class=\"\">Google's revenue from its cloud business increased 30% to $11.96 billion in the fourth quarter, less than the 35% in the third quarter. It was also slower than bigger rival Microsoft's  31% jump in the quarter, but more than the 19% increase that cloud market-leader Amazon  is expected to post.</p><p class=\"\">Still, despite edging out Google, Microsoft's Azure cloud platform's growth was smaller than expected. Microsoft's shares were off 0.4% in premarket trading, while Amazon, which is set to report results on Thursday, dropped 1.7%.</p><p class=\"\">\"The AI story remains strong, with surging demand for cloud-based AI training and solid growth in Gemini. This is good news not just for Alphabet's cloud business but the broader AI market at large,\" said Matt Britzman, senior equity analyst at Hargreaves Lansdown.</p><p class=\"\">Alphabet's ad business is grappling with fierce competition as advertisers increasingly flock to dynamic social media platforms such as Meta's Facebook and Instagram, and ByteDance's TikTok.</p><p class=\"\">At least four brokerages cut their price target on Alphabet's stock, bringing the median target to $220, according to LSEG data.</p><p class=\"\">That compares with the stock's price of $191.20 in premarket trading.</p><p class=\"\">Alphabet's share price had risen 9% this year through Tuesday, slightly more than Amazon's 10.3% increase, while Microsoft has dropped 2.2%.</p><p class=\"\">Still, Alphabet's shares are the cheapest of the trio, with a 12-month forward price-to-earnings ratio of 22.7. Amazon's is nearly 39 and Microsoft's is 29.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0M1:0-alphabet-shares-bear-brunt-of-worries-on-massive-ai-spend-sluggish-cloud-growth/",
            "pub_date": "2025-02-05 18:06:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003052:0",
            "title": "Palm Oil Ends Higher Amid Lower Supply — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palm oil ended higher amid lower supply. Malaysia's January palm oil inventories could fall to 1.6 million tons, down from 2.02 million tons a year ago, Shanghai Dongzheng Futures says in a research note. Malaysia is expected to continue reducing production amid a rising possibility for Indonesia implementing the B40 biodiesel mandate. Meanwhile, investors await Malaysia Palm Oil Board's release of official production and exports data next Monday. The Bursa Malaysia Derivatives contract for April delivery ended 24 ringgit higher at 4,332 ringgit a ton. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003052:0/",
            "pub_date": "2025-02-05 18:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309543:0",
            "title": "K&F Growth Acquisition Corp. II Prices $250 Million IPO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">K&amp;F Growth Acquisition Corp. II said late Tuesday it priced an initial public offering of 25 million units at $10 apiece. </p><p class=\"\">The units will be listed on the Nasdaq Global Market and likely begin trading on Wednesday under the KFIIU ticker. </p><p class=\"\">The blank-check company said a unit consists of one class A ordinary share (KFII) and one right (KFIIR) to receive 1/15 of one class A ordinary share after the completion of a business combination. </p><p class=\"\">The company has granted underwriters a 45-day option to purchase up to about 3.8 million additional units to cover any over-allotments. </p><p class=\"\">The offering will likely close on Thursday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309543:0/",
            "pub_date": "2025-02-05 18:07:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV290:0",
            "title": "Lower German renewable supply lifts spot prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    European prompt power prices rose on Wednesday as lower wind and solar output was predicted for the main market Germany, while demand increased across the region amid frosty temperatures.</p><p class=\"\">German day-ahead (TRDEBD1) power was 7.4% up at 152 euros  ($158.20) per megawatt hour at 0945 GMT.</p><p class=\"\">French baseload for the day ahead (TRFRBD1) gained 1.7% at 146 euros/MWh.</p><p class=\"\">Germany was seen losing 5.1 gigawatts (GW) of wind power production to reach 11.6 GW on Thursday, while solar generation was seen falling to 2.7 GW from 4.8 GW, according to LSEG data.</p><p class=\"\">French nuclear availability stayed unchanged at 81% of total capacity, having lost two percentage points a day earlier. </p><p class=\"\">Power consumption in Germany is expected to increase usage by 0.3 GW to a total 63.5 GW on Thursday, while France should see demand gain the same amount to arrive at 69.1 GW.</p><p class=\"\">Average temperatures in both countries are in the low positive degree Celsius area.</p><p class=\"\">Along the curve, the German year-ahead baseload (TRDEBYZ6) was virtually unchanged at 96.7 euros/MWh, while the French year-ahead position (TRFRBYZ6) was untraded after settling at 69.0 euros/MWh.</p><p class=\"\">The European carbon market's benchmark 2025 contract (CFI2Zc1) shed 1.1% at 80.05 euros per metric ton.</p><p class=\"\">German plant and equipment makers' orders grew slightly in the final month of last year, due to big-ticket contracts from abroad, but 2024 as a whole marked the second straight year of decline, the VDMA engineering association said.</p><p class=\"\">Gas-fired generation output during January in Germany, the United Kingdom, the Netherlands and Poland all jumped by well over 10% from January 2024's levels to their highest for that month since at least 2022, according to data from LSEG.</p><p class=\"\">This has helped lift regional gas prices to their highest since early 2023, and could spur some gas-to-coal switching.</p><p class=\"\">($1 = 0.9608 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV290:0-lower-german-renewable-supply-lifts-spot-prices/",
            "pub_date": "2025-02-05 18:08:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309552:0",
            "title": "Banco Santander Q4 Earnings Rise; Plans 10 Billion Euros of Stock Repurchases; Shares Jump Pre-Bell",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Banco Santander  reported Q4 earnings early Wednesday of 0.20 euros ($0.21) per diluted share, up from 0.18 euros a year earlier. </p><p class=\"\">Analysts polled by FactSet expected 0.17 euros. </p><p class=\"\">Total income for the quarter was 16.03 billion euros, up from 14.55 billion euros a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected 15.21 billion euros. </p><p class=\"\">The company expects to return 10 billion euros to shareholders through buybacks from 2025 and 2026 earnings and anticipated excess capital, in addition to its standard cash dividend distribution. </p><p class=\"\">The NYSE-listed shares of the Spanish lender traded 7.6% higher in premarket activity Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309552:0/",
            "pub_date": "2025-02-05 18:08:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE3XqVfk:0",
            "title": "Innovation thrives in labs, but operational, financial and staffing hurdles persist, Synergy by SRG finds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">London, Feb.  05, 2025  (GLOBE NEWSWIRE) —    </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">75% </strong><strong class=\"root-Tkn6WL2y\">of Lab Leaders </strong><strong class=\"root-Tkn6WL2y\">highlight automation </strong>as important to driving lab efficiency and innovation </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">55% </strong><strong class=\"root-Tkn6WL2y\">say efficiency is key </strong>to innovating process, performance and production</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">70% flagged concerns for </strong>staff retention; <strong class=\"root-Tkn6WL2y\">60% worry about talent acquisition</strong> too </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">February</strong> <strong class=\"root-Tkn6WL2y\">5</strong><strong class=\"root-Tkn6WL2y\">th</strong><strong class=\"root-Tkn6WL2y\">,</strong><strong class=\"root-Tkn6WL2y\"> 202</strong><strong class=\"root-Tkn6WL2y\">5</strong><strong class=\"root-Tkn6WL2y\">: </strong>Lab leaders are concerned about the undermining of lab efficiency and innovation, due to implications of multi-faceted operational, financial and recruitment and retention constraints, according to new insights gathered by Functional Service Provider and industry-leading life science &amp; clinical talent specialists, Synergy and SRG.  </p><p class=\"\">The <strong class=\"root-Tkn6WL2y\">Lab Leader Vision 2025</strong><strong class=\"root-Tkn6WL2y\"> report</strong>, highlighting the thoughts, opinions and experiences based on a survey of over 1000 UK laboratory leaders, reveals that whilst labs remain under pressure to boost efficiency and continue delivering high-value strategic science, they are doing so whilst operating under restrictions caused by the STEM-wide skill gap, tightening budgets and restrictive processes.  </p><p class=\"\">The report spotlights a growing emphasis on the power of automation and workflow optimisation, supported by a continued focus on upskilling and people development. Improving efficiency is the key to innovation in labs, according to 55% of lab leaders asked; though with 50% highlighting a current reliance on time-consuming manual processes, there is plenty of work to do.  </p><p class=\"\">In response to these challenges, automation was considered critical for future innovation by 28% of lab leaders, with a majority (55%) stating workflow optimisation has a vital role to play – sentiments reflected by Neil Jacques, Client Solutions Director at SRG:  </p><p class=\"\">“Lab leaders and their teams are the experts in their respective fields, there can be no doubt. But even with their skills, extensive experience and passion, there is only so much they can do – especially in the face of operational, financial and recruitment challenges and the pressure to remain at the top of the game. AI, automation and workflow optimisation has the power to relieve some of this pressure and enable labs to focus on what they do best – driving forward the future of science.”  </p><p class=\"\">Additionally, there are growing concerns regarding the skills and expertise gap within labs; a trend that is unfortunately prevalent across STEM. Lab leaders are not only uneasy about the potential for finding, attracting and hiring the next generation of lab talent, but also retaining the experts behind the pharmaceutical and biotech sectors. </p><p class=\"\">Almost three-quarters of respondents to the Lab Leader Vision 2025 survey are worried about retaining staff, with 60% facing challenges when acquiring talent for labs too. Furthermore, 10% of lab leaders believed that recruiting and retaining talent will be the biggest challenge they’ll face in 2025.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Looking ahead</strong> </p><p class=\"\">Offering detailed commentary, the Lab Leader Vision 2025 report is designed to not only highlight current laboratory challenges, but also open the doorway to potential actions and responses.  </p><p class=\"\">For example, the report emphasises the power of growth and future development. 95% of lab leaders believe that prioritising upskilling is not only vital, but easily actionable too, and can have major implications when looking to retain talent and shape workforces who can drive efficiency and achieve lab innovation.  </p><p class=\"\">And with technology such as robotics and AI changing the way many industries operate, there is seemingly endless scope to streamline and automate processes, enabling pharmaceutical and biotech experts to focus their efforts on shaping the science of tomorrow.  </p><p class=\"\">The insights from this groundbreaking report also highlight the potential power of Synergy and its laboratory management solutions – developed and delivered to support business continuity, continued improvement and increase the time a lab and its people have to focus on their core science strategies and projects. </p><p class=\"\">Carol Jennings, Operations Director, Synergy Scientific Solutions commented: “This is an exciting release for Synergy and SRG, highlighting our dedication to – and support of – laboratories and their leaders in the face of a multitude of current and future challenges.  </p><p class=\"\">“Utilising the data and insights we have gathered from the Lab Leader Vision 2025 report, Synergy’s expertise will be able to continue to transform laboratories and help them operate more efficiently, accurately and innovatively through a Functional Service Provision (FSP) model that is tailored to labs, their goals and the specific requirements of their people, skills and the way they work.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Download your free ‘</strong><strong class=\"root-Tkn6WL2y\">LAB LEADER VISION </strong><strong class=\"root-Tkn6WL2y\">2025</strong><strong class=\"root-Tkn6WL2y\">’</strong><strong class=\"root-Tkn6WL2y\"> report on our website.</strong><strong class=\"root-Tkn6WL2y\"> </strong> </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ENDS</strong> </p><p class=\"\"><em>About </em><em>Synergy</em><em> </em> </p><p class=\"\">Synergy provides a flexible FSP model, deploying and integrating expert teams to deliver core Lab Activities across the pharmaceutical, biotech, FMCG, chemical, clinical research, biopharma, and sensory industries.  </p><p class=\"\">Powered by SRG, we take a collaborative approach to delivering fundamental core scientific activities, working closely and directly with your team to understand existing processes and infrastructure, identify areas to improve operational efficiencies and innovation, and support business continuity and continued improvement. All whilst allowing your people to focus on what’s most important – your core strategic science and projects. </p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Collaborative innovation in advanced research laboratory       </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE3XqVfk:0-innovation-thrives-in-labs-but-operational-financial-and-staffing-hurdles-persist-synergy-by-srg-finds/",
            "pub_date": "2025-02-05 18:08:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW115:0",
            "title": "India stocks, rupee, swaps, call at 3:30 p.m. IST",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">STOCKS:</p><p class=\"\">The benchmark BSE Sensex  was down 0.4% at 78,271.28, while the broader NSE Nifty 50 index  declined 0.18% to 23,696.3, as a drop in consumer stocks overpowered gains in energy shares. </p><p class=\"\">RUPEE: </p><p class=\"\">The Indian rupee  dropped 0.4% versus the U.S. dollar to 87.4650. A sharp decline in the afternoon triggered stop losses amid a prevailing bearish bias on the local unit and as traders positioned for a potential domestic rate cut later this week.  </p><p class=\"\">GOVERNMENT BONDS:</p><p class=\"\">The benchmark 10-year bond (IN067934G=CC) was quoted at 100.8875 rupees, with the yield down 1 bp at 6.6623%, as sentiment was bullish ahead of anticipated rate easing by the central bank later this week. </p><p class=\"\">OVERNIGHT INDEX SWAPS:</p><p class=\"\">The one-year overnight index swap rate (INR1YMIBROIS=CC) edged down 1 bp to 6.3%, while the five-year swap rate (INR5YMIBROIS=CC) dropped 3 bps to 6.045%.</p><p class=\"\">CALL MONEY: </p><p class=\"\">India's overnight call money rate (INROND=) was at 5.90% and the overnight TREPS rate (INTREPTOT=TCCL) was at 6.11%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW115:0-india-stocks-rupee-swaps-call-at-3-30-p-m-ist/",
            "pub_date": "2025-02-05 18:08:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003011:0",
            "title": "U.K. Sells 2 Billion Pounds in July 2053 Green Gilt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Miriam Mukuru</p><p class=\"\">The U.K.'s Debt Management Office sold 2 billion pounds ($2.50 billion) in July 2053-dated green gilts at an auction on Wednesday, it said.</p><p class=\"\">The following are results of the auction, with amounts in GBP. Figures in brackets are data from the previous auction, held on Oct. 31.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Issue              1.5% July 31 2053 green gilt <br/>Amount on offer    2.0  bln <br/>Bids received      6.4   bln <br/>Bids accepted      2.0  bln <br/>Bid-to-cover ratio 3.20    (3.15) <br/>Average yield      4.976%  (4.831%) <br/>Average price      47.37   (48.53) <br/>Maximum yield      4.979%  (4.836%) <br/>Settlement date    February 6, 2025 <br/> </pre><p class=\"\">Write to Miriam Mukuru at miriam.mukuru@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003011:0/",
            "pub_date": "2025-02-05 18:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0UT:0",
            "title": "European shares dip as tech, auto losses outweigh healthcare advance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Novo Nordisk, GSK lead health stock higher on upbeat sales</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">AMD's results, forecast spark retreat in tech stocks</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Santander jumps on 10 billion euro share buyback plan</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Renault leads decline in auto stocks</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">STOXX 600 down 0.1%</li></ul></span></div><span><p class=\"\">    European shares dipped on Wednesday, as the rise in healthcare companies after Novo Nordisk's strong earnings was overshadowed by losses in automobiles and technology stocks.</p><p class=\"\">The pan-European STOXX 600 index  was down 0.1% as of 0930 GMT.</p><p class=\"\">Novo Nordisk jumped 3.8% after the drugmaker posted a better-than-expected fourth-quarter profit of $4.4 billion as sales for its blockbuster drug Wegovy more than doubled.</p><p class=\"\">GSK  rose 5.3% after the British drugmaker also beat fourth-quarter earning estimates and lifted its 2031 sales target. GSK and Novo helped lift the healthcare index (.SXDP) up 0.9%.</p><p class=\"\">The technology index (.SX8P), however, fell 0.8% as chip stocks came under pressure after Advanced Micro Devices's  quarterly earnings failed to impress investors and CEO Lisa Su said data centre sales this quarter would be 7% lower than the previous quarter.</p><p class=\"\">\"So again, that's tied into some concerns over the AI pace of development and the particular valuations attached and the growth expectations that are already baked in,\" said Russ Mould, investment director at AJ Bell.</p><p class=\"\">Chip equipment maker ASML  slipped 1.1%, while chipmaker Soitec  was down 1.9%.</p><p class=\"\">Automobile stocks (.SXAP) reversed 1.6%. Renault  fell about 3%, with traders attributing the decline to a report saying Japan's Nissan  will call off merger talks with rival Honda .</p><p class=\"\">The markets were also confounded by U.S. President Donald Trump's suggestion that the U.S. would take over the war-ravaged Gaza Strip, turning it around to a \"Riviera of the Middle East\" after resettling Palestinians elsewhere.</p><p class=\"\">The STOXX 600 and other global indexes started the week on a sour note after Trump's tariff threats but rebounded a day later as the President's one-month pause on levies on Mexico and Canada showed he was open to negotiations.</p><p class=\"\">Trump, however, followed through with tariffs on China, which retaliated in kind, although the fallout of that has been limited on global stocks.</p><p class=\"\">Among other stocks, Santander  soared 7.4% after the lender beat fourth-quarter profit estimates and announced a share buyback plan worth 10 billion euros ($10.39 billion).</p><p class=\"\">Munters  slid over 9% to the bottom of the STOXX after the Swedish maker of air treatment solutions reported what analysts say were \"mixed\" fourth-quarter results.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0UT:0-european-shares-dip-as-tech-auto-losses-outweigh-healthcare-advance/",
            "pub_date": "2025-02-05 18:10:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463935:0",
            "title": "DHL Partners With Neste to Make Logistics Chain More Sustainable",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Deutsche Post , d/b/a DHL Group, partnered with Finland's Neste  to cut emissions by evaluating its renewable solutions, according to a Wednesday release. </p><p class=\"\">The German logistics group has an interim target of electrifying two-thirds of last-mile delivery vehicles as DHL looks to shift to sustainable fuels for at least 30% of its transport needs by 2030. </p><p class=\"\">DHL will secure an annual supply of 300,000 tons of unblended sustainable aviation fuel from the Finnish oil refiner and renewable fuels producer by 2030 to support its goals.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463935:0/",
            "pub_date": "2025-02-05 18:10:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW02N:0",
            "title": "GTL Infrastructure Dec-Quarter Loss 2.1 Billion Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GTL Infrastructure Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GTL INFRASTRUCTURE DEC-QUARTER LOSS 2.1 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GTL INFRASTRUCTURE DEC-QUARTER REVENUE FROM OPERATIONS 3.38 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW02N:0-gtl-infrastructure-dec-quarter-loss-2-1-billion-rupees/",
            "pub_date": "2025-02-05 18:10:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309550:0",
            "title": "Equinor Q4 Adjusted Earnings Rise, Revenue Falls; Plans Up to $5 Billion Share Buybacks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equinor  reported Q4 adjusted earnings Wednesday of $0.63 per share, up from $0.62 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.74. </p><p class=\"\">Revenue and other income for the quarter was $27.65 billion, down from $29.05 billion a year earlier. Comparable analyst estimates weren't immediately available. </p><p class=\"\">The company said it is cutting investment outlook to renewables and low carbon solutions to around $5 billion in total after project financing for 2025-2027. It is also reducing expected capacity in renewables to 10 to 12 gigawatt by 2030. </p><p class=\"\">Equinor also announced share repurchases of up to $5 billion for 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309550:0/",
            "pub_date": "2025-02-05 18:01:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463896:0",
            "title": "China Extends Service-Sector Expansion in January: PMI Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's services economy started 2025 in growth territory, driven by new business, reported S&amp;P Global on Wednesday. </p><p class=\"\">The seasonally adjusted Caixin/S&amp;P Global China services purchasing managers index (PMI) posted at 51.0 in January, down from 52.2 in December 2024, but still above the 50-marker that separates growth from expansion, reported S&amp;P Global, citing its monthly survey. </p><p class=\"\">The positive performance in January \"extended the period of expansion that commenced in January 2023,\" added S&amp;P Global. </p><p class=\"\">\"Higher new business, underpinned by improvements in underlying demand and successful business development efforts, supported the rise in services activity at the start of 2025,\" said S&amp;P Global. \"This included foreign demand, with new export business returning to growth after falling at the end of 2024.\"</p><p class=\"\">China's service providers, however, cut payrolls in January, finding remaining workers were adequate to demand. \"The lack of capacity pressure therefore led to further job shedding in the service sector at the start of the year. Both resignations and redundancies contributed to the fastest decline in services employment in China since April last year,\" explained S&amp;P Global. </p><p class=\"\">China's service providers were optimistic regarding the year ahead. Sentiment \"in the Chinese service sector was positive at the start of 2025. Firms expressed hopes that business growth plans and supportive government policies can support sales in the next 12 months,\" said S&amp;P Global. </p><p class=\"\">The China PMI was compiled by S&amp;P Global from surveys sent to 650 private and state-owned services companies from January 9 through January 23. </p><p class=\"\">In addition, China's January composite PMI, a combination of the nation's manufacturing and services sectors, logged at 51.1 in January, down from 51.4 in December, but still above neutral. </p><p class=\"\">The China January composite PMI \"extended the period of continuous expansion to 15 months,\" said S&amp;P Global. </p><p class=\"\">China's enterprise managers were optimistic in January, but cautious on pricing. \"A broad-based improvement in business optimism was observed at the start of the year. That said, firms were unwilling to raise prices despite an increase in average input prices. Selling prices fell at the quickest pace in four months at the start of 2025,\" advised S&amp;P Global.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463896:0/",
            "pub_date": "2025-02-05 18:02:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002617_20250205003006:0",
            "title": "Santander Chair: Interest Rates Don't Matter as Much as People Think",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002617_20250205003006:0/",
            "pub_date": "2025-02-05 18:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0DV:0",
            "title": "South Korea's industry ministry temporarily bans access to DeepSeek on security concerns, official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    South Korea's industry ministry has temporarily banned employee access to Chinese artificial intelligence startup DeepSeek due to security concerns, a ministry official said on Wednesday, as the government urges caution on generative AI services. </p><p class=\"\">    The government issued a notice on Tuesday calling for ministries and agencies to exercise caution about using AI services including DeepSeek and ChatGPT at work, officials said.  </p><p class=\"\">        State-run Korea Hydro &amp; Nuclear Power said it had blocked use of AI services including DeepSeek earlier this month. </p><p class=\"\">Tech giant Kakao Corp has told its employees to refrain from using DeepSeek due to security concerns, a company spokesperson said on Wednesday.</p><p class=\"\">The temporary ban makes South Korea the latest government to warn about DeepSeek. </p><p class=\"\">Last month, Australian Treasurer Jim Chalmers called on Australians to be cautious when using the Chinese AI model while U.S. officials are also looking at DeepSeek's national security implications.</p><p class=\"\">South Korea's information privacy watchdog plans to ask DeepSeek about how the personal information of users is managed.</p><p class=\"\">Chinese startup DeepSeek's launch of its latest AI models sent shockwaves through the tech world. The company says its models are on a par or better than products developed in the United States at a fraction of the cost.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0DV:0-south-korea-s-industry-ministry-temporarily-bans-access-to-deepseek-on-security-concerns-official-says/",
            "pub_date": "2025-02-05 18:03:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX64hymG:0",
            "title": "Nextrope Secures Funding to Build an AI Model for Web3 Security",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX64hymG-0b1c92446f68f9966c13c15e524beba0-resized.webp\" type=\"images/webp\"/><img alt=\"photo_2025-02-05 15.06.08\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX64hymG-0b1c92446f68f9966c13c15e524beba0-resized.jpeg\" style=\"background-color:#343b2a\"/></picture></div></figure></span></p><p class=\"\">WARSAW, Poland, Feb.  05, 2025  (GLOBE NEWSWIRE) — Blockchain security is evolving, and Nextrope is leading the way with an AI-driven platform designed to audit and enhance smart contract security. With a <strong class=\"root-Tkn6WL2y\">project value of $1 million</strong>, this initiative is set to raise the standards of Web3 security. The development is <!-- -->co-financed by the Polish Agency for Enterprise Development (PARP) under the <strong class=\"root-Tkn6WL2y\">European Funds for a Modern Economy</strong> program.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AI-Powered Protection for Smart Contracts</strong></p><p class=\"\">As DeFi, DAOs, and Web3 applications continue to grow, smart contracts remain vulnerable to security flaws that have already led to billions in losses. Nextrope is tackling this challenge with an <!-- -->AI-driven model that identifies risks, optimizes gas fees, and enhances contract efficiency with unparalleled accuracy. Traditional audits rely on static analysis and manual reviews, while this platform integrates <!-- -->advanced machine learning, behavioral profiling, and methodologies inspired by physics and computational sciences to detect vulnerabilities before they become exploits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Academic-Backed Innovation</strong></p><p class=\"\">What sets this project apart is its <strong class=\"root-Tkn6WL2y\">scientific approach</strong>—bringing in <!-- -->researchers and experts in physics and computational modeling to refine AI-driven security techniques. By combining theoretical knowledge with real-world blockchain applications, the platform pushes the boundaries of what automated audits can achieve, making <!-- -->smart contract security more adaptive and proactive.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Redefining Security Standards for Web3</strong></p><p class=\"\">Most security tools struggle to detect complex contract vulnerabilities. Nextrope’s AI model not only <strong class=\"root-Tkn6WL2y\">analyzes threats in real-time</strong> but also <strong class=\"root-Tkn6WL2y\">adapts to emerging attack patterns</strong>, ensuring long-term resilience for blockchain applications. This makes it one of the most <!-- -->advanced security solutions for Ethereum, Polygon, and Solana-based contracts.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Backed by European Innovation Funding</strong></p><p class=\"\">This initiative, <!-- -->co-financed under the European Funds for a Modern Economy, underscores Nextrope’s commitment to advancing <strong class=\"root-Tkn6WL2y\">AI-driven blockchain security</strong>. By 2026, the company aims to <!-- -->establish a new benchmark for smart contract auditing, ensuring that <!-- -->Web3 projects can be built with confidence and security.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Nextrope</strong></p><p class=\"\">Nextrope is a <strong class=\"root-Tkn6WL2y\">blockchain development company</strong> specializing in <!-- -->DeFi, smart contract security, and AI-driven fintech solutions. With a strong track record in <strong class=\"root-Tkn6WL2y\">Web3 innovation</strong>, the company is focused on <strong class=\"root-Tkn6WL2y\">pioneering AI-powered blockchain security</strong>. Learn more at Nextrope.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\">Next Enterprises</p><p class=\"\">contact@nextrope.com</p><p class=\"\">Disclaimer: This content is provided by Nextrope. The statements, views and opinions expressed in this column are solely those of the content provider. The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities. Please conduct your own research and invest at your own risk.</p><p class=\"\">Photos accompanying this announcement are available at</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/ef57bb12-ecbb-48f1-a401-37d295ffcf7f</p><p class=\"\"> https://www.globenewswire.com/NewsRoom/AttachmentNg/f80d2d1c-57c1-4fbc-b90b-f9373a740c69</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nextrope</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Nextrope</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Backed by European Innovation Funding</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Backed by European Innovation Funding</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX64hymG:0-nextrope-secures-funding-to-build-an-ai-model-for-web3-security/",
            "pub_date": "2025-02-05 18:03:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}