{
    "data": [
        {
            "id": "DJN_DN20250204006432:0",
            "title": "Collegium Pharmaceutical Is Maintained at Neutral by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:33 GMT) </strong>Collegium Pharmaceutical Price Target Cut to $36.00/Share From $37.00 by Piper Sandler</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006432:0/",
            "pub_date": "2025-02-04 21:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308822:0",
            "title": "Evercore ISI Adjusts Synchrony Financial Price Target to $79 From $76, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Synchrony Financial  has an average rating of overweight and mean price target of $78.38, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308822:0/",
            "pub_date": "2025-02-04 21:33:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308817:0",
            "title": "McKesson Agrees to Acquire 80% Stake in PRISM Vision for $850 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">McKesson  said Tuesday it has agreed to acquire a controlling interest in PRISM Vision Holdings from Quad-C for $850 million</p><p class=\"\">McKesson will retain an 80% stake in the provider of ophthalmology and retina management services, while PRISM Vision physicians will hold the rest. </p><p class=\"\">Upon closing, PRISM Vision is anticipated to add about $0.20 to $0.30 to McKesson's adjusted earnings per diluted share in the first 12 months, and $0.65 to $0.75 by the end of the third year, the company said. </p><p class=\"\">The transaction will add 180 providers, 91 office locations, and seven ambulatory surgery centers to McKesson's platform.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308817:0/",
            "pub_date": "2025-02-04 21:33:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006346:0",
            "title": "Jabil Acquires Pharmaceutics International, Inc. (Pii)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:30 GMT) </strong>*Jabil Acquires Pharmaceutics International, Inc. (Pii) &gt;JBL<br/><strong class=\"root-Tkn6WL2y\">(13:34 GMT) </strong>Press Release: Jabil Acquires Pharmaceutics International, Inc. (Pii)</p><p class=\"\">Jabil Acquires Pharmaceutics International, Inc. (Pii)</p><p class=\"\">The acquisition of Pii, a science-driven contract development and manufacturing organization (CDMO), complements Jabil's existing pharmaceutical solutions, enabling comprehensive support for customers in drug development, clinical trials, and product commercialization at scale.</p><p class=\"\">ST. PETERSBURG, Fla.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Jabil Inc. , a global leader in engineering, manufacturing, and supply chain solutions, today announced the successful acquisition of Pharmaceutics International, Inc. (Pii), a contract development and manufacturing organization (CDMO) specializing in early stage, clinical, and commercial volume aseptic filling, lyophilization, and oral solid dose manufacturing, completed February 3, 2025.</p><p class=\"\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20250204436085/en/</p><p class=\"\">Pii's four state-of-the-art manufacturing facilities in Hunt Valley, Maryland, include dedicated space for aseptic filling, oral solid dose production, and handling high potency compounds and hormones. (Photo: Business Wire)</p><p class=\"\">\"As the pace of healthcare innovation accelerates, pharmaceutical companies need partners who can help them scale rapidly with a focus on quality and safety. Jabil and Pii's combined capabilities can provide end-to-end support for pharmaceutical customers, offering one safe, trusted pair of hands to simplify their entire supply chain,\" said Mike Mahaz, SVP, Global Business Units, Healthcare, at Jabil.</p><p class=\"\">Jabil is a leader in parenteral drug delivery, in support of markets like GLP-1s. This acquisition will significantly enhance Jabil's existing Pharmaceutical Solutions offering, which includes the development and commercial production of auto-injectors, pen injectors, inhalers, and on-body pumps. With the addition of Pii's leading scientific insights, depth of product knowledge, and capabilities across aseptic filling, lyophilization, and oral solid dose manufacturing, Jabil can meet the clinical and commercial drug manufacturing demands of healthcare customers.</p><p class=\"\">\"Jabil is very pleased to announce this acquisition. With our shared commitment to creating the best solutions possible for patients around the world, we believe the addition of Pii's capabilities, supported by over 300 team members, is a perfect fit for Jabil and our customers,\" said James O'Gorman, Vice President, Pharmaceutical Solutions, at Jabil. \"The convergence of Jabil's and Pii's complementary capabilities will bolster Jabil's customer offering and support business growth potential as we enter the CDMO market.\"</p><p class=\"\">Founded in 1994, Pii's footprint has grown to over 360,000 square feet across four sites on a single campus in Hunt Valley, Maryland. Pii's state-of-the-art Good Manufacturing Practice (GMP) facilities contain over 70 manufacturing rooms, including containment suites for handling high potency compounds and hormones, dedicated manufacturing suites for oral products (e.g., soft gels), an aseptic facility for injectables (e.g., vials, syringes, and cartridges), a formulation development center, and analytical and microbiology laboratories. This expertise will add a comprehensive portfolio of pharmaceutical development and manufacturing services to Jabil's current healthcare solutions.</p><p class=\"\">By joining Jabil, Pii gains access to an expanded global infrastructure, cutting-edge automation, and enhanced supply chain efficiencies, enabling even greater responsiveness and innovation for their pharmaceutical partners.</p><p class=\"\">\"This acquisition marks an exciting new chapter for Pii. We look forward to leveraging Jabil's extensive expertise to accelerate our mission of delivering best-in-class drug development and manufacturing solutions to our customers and ultimately the patients we serve,\" said John Fowler, President and CEO at Pii.</p><p class=\"\">\"On behalf of our board and fellow shareholders at Athyrium Capital Management, Hildred Capital and Pharmascience Inc., I want to thank our management and staff for their splendid work in building the Company over the past several years,\" said James Gale, Chairman of Pii and managing director of Signet Healthcare Partners. \"Jabil is the perfect owner to continue the momentum of the business. With their resources and capabilities, we believe our customers and employees will be well served going forward.\"</p><p class=\"\">For more information, please visit https://www.pharm-int.com/.</p><p class=\"\">About Jabil:</p><p class=\"\">At Jabil , we are proud to be a trusted partner for the world's top brands, offering comprehensive engineering, manufacturing, and supply chain solutions. With over 50 years of experience across industries and a vast network of over 100 sites worldwide, Jabil combines global reach with local expertise to deliver both scalable and customized solutions. Our commitment extends beyond business success as we strive to build sustainable processes that minimize environmental impact and foster vibrant and diverse communities around the globe. Discover more at www.jabil.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204436085/en/</p><p class=\"\">CONTACT:    Investor Contact</p><p class=\"\">Adam Berry</p><p class=\"\">Senior Vice President, Investor Relations and Communications</p><p class=\"\">adam_berry@jabil.com</p><p class=\"\">Media Contact</p><p class=\"\">Timur Aydin</p><p class=\"\">Senior Director, Enterprise Marketing and Communications</p><p class=\"\">publicrelations@jabil.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006346:0/",
            "pub_date": "2025-02-04 21:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006440:0",
            "title": "Diageo Starts 2025 on Back Foot, AJ Bell Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Diageo has had little to toast so far in 2025, AJ Bell's Russ Mould says in a note. First the calls from U.S. surgeon general for warnings about the health impacts of alcohol consumption and now it has withdrawn its medium-term guidance. The Guinness beer owner scrapped its midterm outlook of organic net sales growth of between 5% and 7%, citing uncertainty in key markets. The company said U.S. tariffs would affect the Mexican tequila and Canadian whisky it sells in the U.S. AJ Bell's investment director says the group will be relieved to see the imposition of tariffs for these two countries delayed for now, as imports from these countries account for a good chunk of Diageo's U.S. sales. Shares are down 0.7% at 23.49 pounds. (andrea.figueras@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006440:0/",
            "pub_date": "2025-02-04 21:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV191:0",
            "title": "Regeneron rises on new dividend program, Q4 results beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of drugmaker Regeneron Pharmaceuticals  rise ~2% to $680.40 premarket</p><p class=\"\">** REGN says its board approved a cash dividend program, paying 88 cents per share to shareholders on March 20</p><p class=\"\">** Co announces an additional $3 bln share repurchase program, bringing total current capacity to around $4.5 bln</p><p class=\"\">** Brokerage Evercore ISI says \"dividend should help attract new investors to the name\" without altering REGN's capital allocation priorities</p><p class=\"\">** Co also reports Q4 adj. profit of $12.07 per share, above analysts' est. of $11.28, according to LSEG data, driven by strong demand for its eczema drug, Dupixent</p><p class=\"\">** Co posts Q4 sales of $3.79 bln vs. analysts' expectations of $3.75 bln - LSEG</p><p class=\"\">** Dupixent sales came in at $3.70 bln, compared to $3.22 bln a year ago</p><p class=\"\">** REGN fell 21.3% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV191:0-regeneron-rises-on-new-dividend-program-q4-results-beat/",
            "pub_date": "2025-02-04 21:34:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV18O:0",
            "title": "Estee Lauder falls on gloomy quarterly profit forecast; announces job cuts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Cosmetics company Estee Lauder's  shares down nearly 7.45% at $76.60</p><p class=\"\">** Company forecasts third-quarter adjusted earnings per share between 24 cents and 34 cents, below analysts' estimates of 63 cents per share, according to data compiled by LSEG.</p><p class=\"\">** \"For the third quarter, we expect overall soft retail trends to persist in Asia travel retail, significantly pressuring our organic net sales\", CEO Stephane de La Faverie </p><p class=\"\">** Co, in its restructuring plan, estimates a net reduction of 5,800 to 7,000 jobs by the end of fiscal 2026 to return to sales growth</p><p class=\"\">** Co adds the plan aims to \"manage external volatility, such as potential tariff increases globally\"</p><p class=\"\">** Q2 sales fall 6% to $4 billion, compared with analysts' estimates of $3.97 billion</p><p class=\"\">** EL stock fell 71% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV18O:0-estee-lauder-falls-on-gloomy-quarterly-profit-forecast-announces-job-cuts/",
            "pub_date": "2025-02-04 21:34:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006468:0",
            "title": "Vacasa Gets $5.25/Share Buyout Bid From Davidson Kempner",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Colin Kellaher</p><p class=\"\">Vacasa has received an unsolicited, non-binding takeover proposal from investment firm Davidson Kempner Capital Management that could upend the vacation rental management platform's deal to be acquired by peer Casago.</p><p class=\"\">Vacasa on Tuesday said Davidson Kempner has proposed a purchase price of $5.25 a share, topping the $5.02 a share that Casago agreed to pay in a deal struck late last year.</p><p class=\"\">Vacasa said a special committee of its board will review the Davidson Kempner bid in consultation with its outside legal counsel and financial adviser to determine whether it could reasonably be expected to result in a superior proposal to the Casago deal.</p><p class=\"\">Shares of Vacasa rose 4.3% to $5.30 in premarket trading, an indication that investors may think a bidding war for the Portland, Ore., company may be in the offing.</p><p class=\"\">Write to Colin Kellaher at colin.kellaher@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006468:0/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXPcz9w:0",
            "title": "Exodus Movement, Inc. Announces Offer to Acquire Banxa Holdings Inc.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OMAHA, Neb., Feb.  04, 2025  (GLOBE NEWSWIRE) — Exodus Movement, Inc. (NYSE American: EXOD) (\"Exodus\"), a leading self-custodial cryptocurrency platform, today announced that it has submitted a proposal (the “Exodus Offer”) for the acquisition of all of the issued and outstanding common shares of Banxa Holdings Inc.  (\"Banxa\"), a globally recognized financial technology platform specializing in digital asset on-and-off ramp solutions. Banxa today announced that its Board of Directors, after consultation with its financial and legal advisors, and after consideration of a recommendation from its Special Committee of the Board of Directors, has unanimously determined that the Exodus Offer constitutes a “Superior Proposal” under the terms of the arrangement agreement between Banxa and 1493819 B.C. Ltd. (“1493819”). Banxa also announced that it provided notice of such determination to 1493819 and that, under its arrangement agreement with 1493819, 1493819 now has the right, until 5:00 p.m. (Vancouver time) on February 10, 2025, to propose to amend the terms of the arrangement agreement in order to make the Exodus Offer no longer a Superior Proposal.</p><p class=\"\">Pursuant to the terms of the Exodus Offer, Exodus has offered to acquire all of the issued and outstanding common shares of Banxa (“Banxa Shares”) for consideration per Banxa Share comprised of (i) CDN$1.10 in cash; and (ii) 0.0079 of class A common stock of Exodus (“Exodus Shares”). Based on the closing price of the Exodus Shares on NYSE American on February 3, 2025 of US$59.59 and the U.S./Canada daily exchange rate on February 3, 2025 of US$1.00/CDN$1.4603, the value of the share consideration to be paid to Banxa shareholders is US$0.47 or approximately CDN$0.69 per Banxa Share, bringing the total consideration to be received by Banxa shareholders to approximately CDN$1.79 per Banxa Share.</p><p class=\"\">At this time, there can be no assurance that the Exodus Offer will lead to a termination of the arrangement agreement between Banxa and 1493819 and the execution of a definitive arrangement agreement between Banxa and Exodus in respect of the Exodus Offer, or that the proposed transaction contemplated by the Exodus Offer will be consummated.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Exodus</strong></p><p class=\"\">Exodus is a financial technology leader empowering individuals and businesses with secure, user-friendly crypto software solutions. Since 2015, Exodus has made digital assets accessible to everyone through its multi-asset crypto wallets prioritizing design and ease of use.</p><p class=\"\">With self-custodial wallets, Exodus puts customers in full control of their funds, enabling them to swap, buy, and sell crypto. Its business solutions include Passkeys Wallet and XO Swap, industry-leading tools for embedded crypto wallets and swap aggregation.</p><p class=\"\">Exodus is committed to driving the future of accessible and secure finance. Learn more at exodus.com or follow us on X at x.com/exodus_io.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contact</strong></p><p class=\"\">investors@exodus.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains “forward-looking statements” as that term is defined by the federal securities laws. All forward-looking statements are based upon our current expectations and various assumptions and apply only as of the date made. Our expectations, beliefs, and projections are expressed in good faith, and we believe there is a reasonable basis for them. However, there can be no assurance that our expectations, beliefs and projections will be achieved. Forward-looking statements are generally identified by the words “may,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “anticipate,” “believe,” “estimate,” “predict,” “project,” “potential,” “continue,” “ongoing,” “forecast,” as well as variations of such words or similar expressions. Forward-looking statements in this document include, but are not limited to, statements regarding the Exodus Offer, including the consideration to be issued pursuant to the Exodus Offer, the possibility that 1493819 submits a revised offer during the matching period, the possibility that Banxa and 1493819 amend the terms of their arrangement agreement that results in the Exodus Offer no longer being a Superior Proposal and the ability of Exodus and Banxa to consummate the transaction on the terms and in the manner contemplated by the Exodus Offer. Such forward-looking statements involve a number of risks, uncertainties and other important factors that could cause our actual results to differ materially from those expressed or implied by our forward-looking statements. Such factors include the possible actions by or on behalf of 1493819; the possibility that Exodus withdraws the Exodus Offer; or the possibility of a third party submitting a proposal or a revised proposal which leads to a new Superior Proposal, as well as those set forth in “Item 1. Business” and “Item 1A. Risk Factors” of Amendment No. 6 to our Registration Statement on Form 10 filed with the Securities and Exchange Commission (the “SEC”) on November 27, 2024, as well as in our other reports filed with the SEC from time to time. All forward-looking statements are expressly qualified in their entirety by such cautionary statements. Readers are cautioned not to place undue reliance on such forward-looking statements. Except as required by law, we undertake no obligation to update or revise any forward-looking statements that have been made to reflect events or circumstances that arise after the date made or to reflect the occurrence of unanticipated events.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">No Offer or Solicitation</strong></p><p class=\"\">The Exodus Offer contemplates that the Exodus Shares will be issued in a transaction exempt from the registration requirements of the U.S. Securities Act of 1933, as amended (the “U.S. Securities Act”), pursuant to Section 3(a)(10) of the U.S. Securities Act. Consequently, the Exodus Shares will not be registered under the U.S. Securities Act or under any U.S. state securities laws. This press release does not constitute an offer to sell or a solicitation of an offer to buy Exodus Shares or any other securities, and shall not constitute an offer, solicitation or sale in any jurisdiction in which such an offer, solicitation or sale would be unlawful.</p><p class=\"\">Source: Exodus Movement, Inc.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXPcz9w:0-exodus-movement-inc-announces-offer-to-acquire-banxa-holdings-inc/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006456_20250204006456:0",
            "title": "Exodus Movement, Inc. Announces Offer To Acquire Banxa Holdings Inc. >EXOD",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006456_20250204006456:0/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbs4tBp:0",
            "title": "Clearmind Medicine Announces Publication of Patent for Binge Behavior Psychedelic Combination Treatment in Mexico",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vancouver, Canada, Feb.  04, 2025  (GLOBE NEWSWIRE) — Clearmind Medicine Inc. , (FSE: CWY0) (“Clearmind” or the \"Company\"), a clinical-stage biotech company focused on discovery and development of novel psychedelic-derived therapeutics to solve major under-treated health problems, announces today a patent publication by the Instituto Mexicano de la Propriedad Industrial (IMPI), the National Mexico Patent Office. The patent refers to the Company’s innovative combination therapy of MEAI and N-Acylethanolamines, addressing binge behavior, including alcohol consumption, eating, tobacco consumption, shopping and sexual conduct.</p><p class=\"\">The patent is part of Clearmind’s successful collaboration with SciSparc Ltd. , a clinical-stage specialty pharmaceutical company focused on treatments for central nervous system disorders. Together, the two companies are researching innovative combination therapies that integrate psychedelic compounds with the N-Acylethanolamines family, including Palmitoylethanolamide (PEA).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Clearmind Medicine Inc.</strong></p><p class=\"\">Clearmind is a clinical-stage psychedelic pharmaceutical biotech company focused on the discovery and development of novel psychedelic-derived therapeutics to solve widespread and underserved health problems, including alcohol use disorder. Its primary objective is to research and develop psychedelic-based compounds and attempt to commercialize them as regulated medicines, foods or supplements.</p><p class=\"\">The Company’s intellectual portfolio currently consists of nineteen patent families including 31 granted patents. The Company intends to seek additional patents for its compounds whenever warranted and will remain opportunistic regarding the acquisition of additional intellectual property to build its portfolio.</p><p class=\"\">Shares of Clearmind are listed for trading on Nasdaq under the symbol \"CMND\" and the Frankfurt Stock Exchange under the symbol “CWY0.”</p><p class=\"\">For further information visit: https://www.clearmindmedicine.com or contact:</p><p class=\"\">Investor Relations</p><p class=\"\"> invest@clearmindmedicine.com</p><p class=\"\">Telephone: (604) 260-1566</p><p class=\"\"> US: CMND@crescendo-ir.com</p><p class=\"\">General Inquiries</p><p class=\"\">Info@Clearmindmedicine.com</p><p class=\"\">www.Clearmindmedicine.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About SciSparc Ltd.</strong></p><p class=\"\">SciSparc Ltd. (SPRC) is a specialty clinical-stage pharmaceutical company led by an experienced team of senior executives and scientists. SciSparc’s focus is on creating and enhancing a portfolio of technologies and assets based on cannabinoid pharmaceuticals. With this focus, the Company is currently engaged in the following drug development programs based on THC and/or non-psychoactive cannabidiol: SCI-110 for the treatment of Tourette Syndrome, for the treatment of Alzheimer's disease and agitation; and SCI-210 for the treatment of autism and status epilepticus. The Company also owns a controlling interest in a subsidiary whose business focuses on the sale of hemp seeds’ oil-based products on the Amazon.com Marketplace.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements:</strong></p><p class=\"\">This press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act and other securities laws. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “estimates” and similar expressions or variations of such words are intended to identify forward-looking statements. The Company cannot assure that any patent will issue as a result of a pending patent application or, if issued, whether it will issue in a form that will be advantageous to the Company. Forward-looking statements are not historical facts, and are based upon management’s current expectations, beliefs and projections, many of which, by their nature, are inherently uncertain. Such expectations, beliefs and projections are expressed in good faith. However, there can be no assurance that management’s expectations, beliefs and projections will be achieved, and actual results may differ materially from what is expressed in or indicated by the forward-looking statements. Forward-looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in the forward-looking statements. For a more detailed description of the risks and uncertainties affecting the Company, reference is made to the Company’s reports filed from time to time with the Securities and Exchange Commission (“SEC”), including, but not limited to, the risks detailed in the Company’s annual report on Form 20-F for the fiscal year ended October 31, 2024 filed with the SEC. Forward-looking statements speak only as of the date the statements are made. The Company assumes no obligation to update forward-looking statements to reflect actual results, subsequent events or circumstances, changes in assumptions or changes in other factors affecting forward-looking information except to the extent required by applicable securities laws. If the Company does update one or more forward-looking statements, no inference should be drawn that the Company will make additional updates with respect thereto or with respect to other forward-looking statements. References and links to websites have been provided as a convenience, and the information contained on such websites is not incorporated by reference into this press release. Clearmind is not responsible for the contents of third-party websites.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbs4tBp:0-clearmind-medicine-announces-publication-of-patent-for-binge-behavior-psychedelic-combination-treatment-in-mexico/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1q1mT9:0",
            "title": "Aligned Data Centers Bolsters Leadership Team with Four Key Executive Appointments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DALLAS, Feb.  04, 2025  (GLOBE NEWSWIRE) — Aligned Data Centers, a leading technology infrastructure company offering innovative, sustainable and adaptive Scale Data Centers and Build-to-Scale solutions for global hyperscale and enterprise customers, today announced four new executive leadership appointments:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Michael Morris </strong>was promoted to Chief Development Officer (CDO)<strong class=\"root-Tkn6WL2y\"> </strong>from his previous role as Executive Vice President of Design and Construction, where he was responsible for overseeing data center campus development, ensuring alignment with best-in-industry design, efficiency, and operational objectives, as well as speed-to-market targets. In his new role, Mr. Morris will lead Aligned's strategic development initiatives, focusing on expanding the company's data center footprint to meet the increasing demand for scalable and adaptable infrastructure.With nearly 15 years of experience in leading high-impact data center development and construction projects, Mr. Morris has been instrumental in advancing Aligned's mission to provide innovative and sustainable data center solutions. Prior to joining Aligned, he held key positions at Equinix, serving as the company’s Regional Director of Construction Management, and at DPR Construction as a Senior Project Manager, where he managed large-scale data center projects and honed his expertise in delivering complex infrastructure. </li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Michael Welch</strong> was promoted to Chief Technology Officer (CTO) of Aligned Data Centers from his previous role as SVP, Procurement and Design. As CTO, he will lead the implementation of new technologies to keep the company at the forefront of the industry. Additionally, he will develop and implement strategies for sustainable and efficient power generation solutions; drive the go-to-market strategy for platform delivery, ensuring successful product launches and market penetration; and strategize and oversee Aligned’s advanced supply chain.Mr. Welch joined Aligned in August 2011 and has since held numerous leadership positions, including Senior Director of Preconstruction and Delivery, Director of Platform Procurement, and Product Development Engineer. He was also instrumental in the launch of the company’s proprietary and award-winning Delta3™ air-cooled and DeltaFlow~ liquid-cooled technologies. </li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Shelby Clark</strong>, previously Aligned’s VP, People and Culture, has assumed the role of Chief People Officer (CPO). As CPO, Ms. Clark is responsible for overseeing Aligned’s HR functions, including talent acquisition, employee engagement, leadership development, and company culture, with the primary goal of maximizing employee potential and aligning the workforce strategy with the company's strategic objectives. She joined the organization in December 2023, spearheading the development of innovative programs designed to empower leaders across Aligned and ODATA’S global operations. Under Ms. Clark’s leadership, her People and Culture team have rolled out several impactful initiatives including mentorship programs, multicultural training, and programs to increase female representation in the data center industry. Her strategic vision supports Aligned’s commitment to operational excellence, employee empowerment, and sustainability.Prior to joining Aligned, Ms. Clark was SVP, HR and Organizational Development and Financial Services Chief of Staff at First United Bank. Previously, as Global Human Resources Business Lead, Americas at Amdocs, she led the human capital strategy in 15 countries across North America, South America, Central America, the Caribbean, EMEA, and APAC.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Matthew Chambliss</strong>, formerly SVP, Finance at Aligned, has assumed the role of EVP, Commercial Strategy and Energy. As EVP, Commercial Strategy and Energy, Mr. Chambliss is responsible for driving Aligned’s continued growth and success by uniting the Sales, Finance, Legal, Project Development, and Energy teams, thereby ensuring seamless execution while balancing speed-to-market, risk mitigation, and financial performance. In his former role as SVP, Finance, he was responsible for Aligned's financial activities, plans and policies. He joined Aligned in May 2017 as Director of Finance.Prior to Aligned, Mr. Chambliss served as the Manager of Financial Planning and Analysis at Spirit Realty Capital, Inc. and Roofing Supply Group. He also held dual analytical roles at Energy Future Holdings, a Dallas-area based electric utility company, as well as an Associate position at PwC, where he began his career.</li></ul><p class=\"\">“Aligned is committed to fostering a culture of leadership excellence,” states Andrew Schaap, CEO of Aligned. “I am incredibly proud to see this talented group of leaders step into their expanded roles and, alongside their respective teams, continue to position Aligned as a leading data center builder and operator in the Americas. This is a pivotal time for our company. I am confident that with our exceptional team and the industry's top talent, Aligned is poised for continued success.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aligned Data Centers</strong></p><p class=\"\">Aligned Data Centers is a leading technology infrastructure company offering innovative, sustainable, and adaptive Scale Data Centers and Build-to-Scale solutions for global hyperscale and enterprise customers. Our intelligent infrastructure allows densification and vertical growth within the same footprint, enabling customers to scale up without disruption, all while maintaining industry-leading Power Usage Effectiveness (PUE). By reducing the energy, water and space needed to operate, our data center solutions, combined with our patented cooling technology, offer businesses a competitive advantage by improving sustainability, reliability, and their bottom line. For more information, visit www.aligneddc.com and connect with us on X, LinkedIn and Facebook.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Press and Analyst Inquiries</strong>Jennifer Handshew for Aligned Data Centers</p><p class=\"\">jennifer@180-mktg.com</p><p class=\"\">+1 (917) 359-8838</p><p class=\"\">A photo accompanying this announcement is available at: https://www.globenewswire.com/NewsRoom/AttachmentNg/9e341b44-f449-442c-9514-36ec064a151f</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aligned Bolsters Leadership Team with Key Executive Appointments</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Aligned Bolsters Leadership Team with Key Executive Appointments</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1q1mT9:0-aligned-data-centers-bolsters-leadership-team-with-four-key-executive-appointments/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV18A:0",
            "title": "Triumvirate Environmental valued at $1.8 billion after investment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Commercial waste management company Triumvirate Environmental said on Tuesday it was valued at $1.8 billion after an investment from private equity firm Berkshire Partners, alongside its CEO and founder, John McQuillan.</p><p class=\"\">The partnership will allow Massachusetts-based Triumvirate to expand into new regions, add new service lines and enhance its technology capabilities, it said.</p><p class=\"\">Founded in 1988, Triumvirate provides sustainable environmental solutions to companies in the life sciences, healthcare, education, and industrial markets. </p><p class=\"\">Raymond James advised Triumvirate on the deal, while Stifel consulted with Berkshire Partners.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV18A:0-triumvirate-environmental-valued-at-1-8-billion-after-investment/",
            "pub_date": "2025-02-04 21:35:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbGhT1M:0",
            "title": "FAVO Capital Inc. Partners with IBN to Strengthen Investor Communications and Market Visibility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AUSTIN, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — via IBN – FAVO Capital Inc. , a leading provider of alternative financing solutions in the private credit sector, has engaged IBN, a multifaceted financial media and publishing firm, to enhance its investor communications strategy, serve as its investor relations liaison, and expand market reach.</p><p class=\"\">FAVO Capital is transforming the private credit and alternative lending industry by expanding funding capacity, enhancing technology-driven underwriting models, and optimizing borrower acquisition strategies to drive market share growth and investor value.</p><p class=\"\">To meet the growing demand for non-bank financing solutions, FAVO Capital provides fast, flexible funding to underserved small and medium-sized businesses. By leveraging proprietary underwriting algorithms and a data-driven approach, the company streamlines access to working capital while mitigating risk, positioning itself as a key player in the $1.5 trillion alternative lending market.</p><p class=\"\">As part of its strategic roadmap to uplist to Nasdaq, FAVO Capital is optimizing its capital structure, strengthening regulatory compliance, and advancing institutional partnerships to support long-term growth. Additionally, the company is developing an advanced digital platform to enhance client engagement and streamline funding processes. This platform will enable businesses to apply for funding, track progress, and manage repayments with greater efficiency. A complementary mobile app is also in development to provide real-time financial insights and tailored funding recommendations, improving the overall borrower experience.</p><p class=\"\">As part of the Client Partner relationship, IBN will leverage its investor-focused distribution network, which includes over 5,000 key syndication outlets, various newsletters, social media channels, and wire services via InvestorWire, along with blogs and other outreach tools, to generate greater awareness for FAVO Capital.</p><p class=\"\">With over 19 years of experience assisting over 500 client partners and a sizable family of 70+ trusted brands, IBN has amassed a collective audience that includes millions of social media followers. This positions IBN to provide FAVO Capital the solutions needed to reach a wide audience of investors, journalists, and the general public.</p><p class=\"\">To learn more about FAVO Capital, please visit the company’s corporate newsroom at https://IBN.fm/FAVO</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About FAVO Capital Inc.</strong></p><p class=\"\">FAVO Capital Inc.  is a fast-growing alternative finance company specializing in flexible, technology-driven funding solutions for emerging, small, and medium-sized businesses. Headquartered in Fort Lauderdale, Florida, FAVO leverages advanced underwriting models and a client-centric approach to bridge gaps left by traditional lenders.</p><p class=\"\">With a commitment to efficiency, flexibility, and long-term growth, FAVO Capital is dedicated to providing scalable financial solutions that help businesses access the capital they need to succeed in an evolving market.</p><p class=\"\">For more information, visit www.FAVOCapital.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IBN</strong></p><p class=\"\">IBN consists of financial brands introduced to the investment public over the course of 19+ years. With IBN, we have amassed a collective audience of millions of social media followers. These distinctive investor brands aim to fulfill the unique needs of a growing base of client-partners. IBN will continue to expand our branded network of highly influential properties, leveraging the knowledge and energy of specialized teams of experts to serve our increasingly diversified list of clients.</p><p class=\"\">Through our Dynamic Brand Portfolio (DBP), IBN provides: (1) access to a network of wire solutions via InvestorWire to reach all target markets, industries and demographics in the most effective manner possible; (2) article and editorial syndication to 5,000+ news outlets; (3) Press Release Enhancement to ensure maximum impact; (4) full-scale distribution to a growing social media audience; (5) a full array of corporate communications solutions; and (6) total news coverage solutions.</p><p class=\"\">For more information, please visit https://www.InvestorBrandNetwork.com</p><p class=\"\">Please see full terms of use and disclaimers on the InvestorBrandNetwork website applicable to all content provided by IBN, wherever published or re-published: http://IBN.fm/Disclaimer</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. All forward-looking statements are inherently uncertain as they are based on current expectations and assumptions concerning future events or future performance of the company. Readers are cautioned not to place undue reliance on these forward-looking statements, which are only predictions and speak only as of the date hereof. In evaluating such statements, prospective investors should review carefully various risks and uncertainties identified in this release and matters set in the company's SEC filings. These risks and uncertainties could cause the company's actual results to differ materially from those indicated in the forward-looking statements.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Corporate Communications</strong></p><p class=\"\">IBN</p><p class=\"\">Austin, Texas</p><p class=\"\">www.InvestorBrandNetwork.com</p><p class=\"\">512.354.7000 Office</p><p class=\"\">Editor@InvestorBrandNetwork.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbGhT1M:0-favo-capital-inc-partners-with-ibn-to-strengthen-investor-communications-and-market-visibility/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX66ZY3f:0",
            "title": "EZCORP to Release First Quarter Fiscal 2025 Results After Market Close on Wednesday, February 5th, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AUSTIN, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — EZCORP, Inc. (“EZCORP” or the “Company”) , a leading provider of pawn transactions in the United States and Latin America, will issue first quarter fiscal 2025 results (period ended December 31, 2024) on Wednesday, February 5th, 2025, after the market close.</p><p class=\"\">The Company will host a webcast and conference call at 9:00 a.m. Eastern time on Thursday, February 6th, 2025, to discuss its results. The presentation slides will be posted to the Investor Relations section of its website after the market close on Wednesday, February 5th, 2025.</p><p class=\"\">Date Thursday, February 6th, 2025</p><p class=\"\">Time: 9:00 a.m. Eastern time</p><p class=\"\">Dial-in registration link: https://register.vevent.com/register/BI86f9072cf4c447ae86954e0a22daa957</p><p class=\"\">Live webcast registration link: https://edge.media-server.com/mmc/p/j568nkgu</p><p class=\"\">A replay of the conference call will be available online at http://investors.ezcorp.com shortly after the live call concludes. If you have any difficulty accessing the conference call, please contact Elevate IR at EZPW@elevate-ir.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About EZCORP</strong></p><p class=\"\">Formed in 1989, EZCORP has grown into a leading provider of pawn transactions in the United States and Latin America. We also sell pre-owned and recycled merchandise, primarily collateral forfeited from pawn lending operations and merchandise purchased from customers. We are dedicated to satisfying the short-term cash needs of consumers who are both cash and credit constrained, focusing on an industry-leading customer experience. EZCORP is traded on NASDAQ under the symbol EZPW and is a member of the S&amp;P 1000 Index and Nasdaq Composite Index.</p><p class=\"\">Follow EZCORP on social media:</p><p class=\"\">Facebook EZPAWN Official https://www.facebook.com/EZPAWN/</p><p class=\"\">EZCORP Instagram Official https://www.instagram.com/ezcorp_official/</p><p class=\"\">EZPAWN Instagram Official https://www.instagram.com/ezpawnofficial/</p><p class=\"\">EZCORP LinkedIn https://www.linkedin.com/company/ezcorp/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Sean Mansouri, CFA</p><p class=\"\">Elevate IR</p><p class=\"\">EZPW@elevate-ir.com</p><p class=\"\">(720) 330-2829</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX66ZY3f:0-ezcorp-to-release-first-quarter-fiscal-2025-results-after-market-close-on-wednesday-february-5th-2025/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006306_20250204006306:0",
            "title": "Data443 Acquires Breezemail.Ai, Accelerating AI-Powered Email Privacy Capabilities For Microsoft Office And Google GMail >ATDS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006306_20250204006306:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5xNM9m:0",
            "title": "Coquille Tribe Breaks Ground on New Distillery, Heritage Distilling-Branded Tasting Room & Expanded Entertainment Zone at Coos Bay Casino",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EUGENE, Ore., Feb.  04, 2025  (GLOBE NEWSWIRE) — Heritage Distilling Company, Inc. (\"HDC\" or \"Heritage\" or \"The Company\"), a leading craft distiller of innovative premium brands, and the Coquille Indian Tribe of Oregon announced the ground breaking of Oregon’s first Tribally-Owned distillery and tasting room, located at The Mill Casino-Hotel &amp; RV Park on Coos Bay, in North Bend, Oregon. The project broke ground this month and is expected to open to the public by the end of the year. Both Heritage and Coquille-branded spirits will be produced and bottled on Tribal land and sold at the casino’s several bars, restaurants and retail outlets.</p><p class=\"\">“After more than two years of planning, negotiating with the state of Oregon, and completing design work, we are thrilled to have broken ground on this historic project,” said Margaret Simpson, Chief Executive Officer of CEDCO, the Tribe’s venture arm that owns and operates The Mill Casino-Hotel &amp; RV Park. “All members of the team, including Heritage Distilling and fi architecture, have brought forth a design for a customer experience space that will be unparalleled for hundreds of miles in every direction. The completion of this project at The Mill further solidifies our casino and resort as the premier destination in the region.”</p><p class=\"\">The project will feature an updated Plank House restaurant, two indoor digital golf suites and a Heritage-branded tasting room. Spanning two levels and with panoramic views of Coos Bay, the tasting room includes two full-service bars, a cigar lounge, retail space, private event suites and Heritage’s proprietary Cask Club®.</p><p class=\"\">Led by Justin and Jennifer Stiefel since 2011, Heritage is the most-awarded craft distillery in North America by the American Distilling Institute for a decade and is recognized for its brand family of premium whiskies, gins, vodkas, rums and ready-to-drink cocktails. Beyond their mastery of distilling, the Stiefels saw both an injustice done to Native American indigenous communities and a mutually beneficial economic opportunity to create national distribution for Heritage’s portfolio of craft spirits. Together, they established the Tribal Beverage Network (TBN), a first-of-its-kind partnership with Native American Tribes to develop Heritage-branded distilleries, brands and tasting rooms to serve patrons of Tribal casinos and entertainment venues.</p><p class=\"\">Jennifer Stiefel, president and co-founder of Heritage Distilling, added: “We are honored to break ground on this historic project with the Coquille Tribe. This marks a significant milestone for the Tribe, the Tribal Beverage Network and Oregon’s craft spirits industry. The Tribe’s commitment to economic self-sufficiency and innovation aligns perfectly with Heritage Distilling’s mission, and we are proud to stand alongside them in bringing the state’s first Tribally-Owned distillery to life. This is more than a distillery—it’s a long-term economic resource that will support the Tribe for generations to come.”</p><p class=\"\">The distillery will be modeled after Heritage’s industry-leading operations derived from its five distilleries and tasting rooms across Washington and Oregon. As a TBN partner, the Coquille-owned and operated destination will also offer several amenities for patrons including a tasting room that features Heritage spirits like Cocoa Bomb Chocolate Whiskey, Heritage canned cocktails, Florescence Vodka, Stiefel’s Select Single Barrel and small batch whiskeys, and Heritage’s latest Salute Series which honors and supports military and first responder communities.</p><p class=\"\">In addition to on-site tastings, the Coquille distillery will also extend unique membership programs available to TBN partners: The Cask Club®, an annual membership-based program that allows members to create, customize and age spirits of their choice; and The Spirits Club®, a program that provides members quarterly shipments of Heritage’s award-winning spirits delivered directly to their door at a reduced rate, as well as priority access to new, limited and seasonal releases.</p><p class=\"\">The project designs were conceived by the team at fi architecture in Gig Harbor, Washington, the longtime design partner for all of Heritage Distilling’s retail and TBN locations. Detailed renderings of the project can be found on the fi architecture website here.</p><p class=\"\">TBN members can benefit from wholesale and retail margins and tax capture. In addition, Tribes entering this industry can generate funds to support social and economic initiatives, increase employment, diversify the skillsets of their members and work with Heritage to create their brands to celebrate the unique characteristics of a Tribe or region.</p><p class=\"\">The Coquille Tribe’s announcement follows on the heels of a recent announcement by the Tonto Apache Tribe in Payson, Arizona on its plans to open a Heritage Distilling branded location in partnership with Heritage at the Mazatzal Hotel and Casino’s newest development, Apache Corners. Until recently, an 1834 federal law prohibited anyone from setting up a distillery on Tribal land for manufacturing “ardent spirits.” In large part due to Heritage Distilling Company’s efforts, the antiquated Andrew Jackson-era law was finally repealed by Congress in 2018, paving the way for the Coquille Indian Tribe to pursue distillery operations on Tribal lands.</p><p class=\"\">Heritage has several other Tribes participating in TBN, with partnership announcements planned in line with each Tribe’s development timeline. For more information on Heritage Distilling Company and the Tribal Beverage Network, visit heritagedistilling.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the Coquille Indian Tribe</strong></p><p class=\"\">The Coquille Indian Tribe flourished in Oregon’s southwestern corner for thousands of years, cherishing the bountiful forests, rivers and beaches of a homeland encompassing more than 750,000 acres. In 1954, Congress declared the Coquille Tribe “terminated.” 35 years later the Tribe was formally restored to federal recognition in 1989. Today the Tribe numbers more than 1,100 members and it has regained more than 10,000 acres of ancestral homeland, proudly managing the bulk of it as sustainable forest. The Tribe provides education assistance, health care, elder services and (where needed) housing assistance to its people, while contributing substantially to the surrounding community’s economy. Its various enterprises employ approximately 600 people, and its community fund is the region’s leading local source of charitable grants.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Heritage Distilling Company, Inc.</strong></p><p class=\"\">Heritage is among the premier independent craft distilleries in the United States offering a variety of whiskeys, vodkas, gins, rums and ready-to-drink canned cocktails. Heritage has been North America's most awarded craft distillery by the American Distilling Institute for ten consecutive years out of the more than 2,600 craft producers. Beyond this remarkable achievement, Heritage has also garnered numerous Best of Class, Double Gold, and Gold medals at esteemed national and international spirits competitions. As one of the largest craft spirits producers on the West Coast by revenue, the company is expanding its presence nationwide through a diverse range of sales channels, including wholesale, on-premises venues, e-commerce, and the innovative Tribal Beverage Network (TBN). The TBN initiative, a groundbreaking collaboration with Native American Tribes, focuses on developing Heritage-branded distilleries, unique Tribal brands, and tasting rooms tailored to Tribal communities. By serving patrons of Tribal casinos and entertainment venues, the TBN creates meaningful economic and social benefits for participating Tribes, while providing an additional avenue for Tribes to exercise and strengthen their sovereignty. This unique partnership reflects Heritage’s commitment to innovation, community engagement, and sustainable growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements may be identified by words such as \"aims,\" \"anticipates,\" \"believes,\" \"could,\" \"estimates,\" \"expects,\" \"forecasts,\" \"goal,\" \"intends,\" \"may,\" \"plans,\" \"possible,\" \"potential,\" \"seeks,\" \"will,\" and variations of these words or similar expressions that are intended to identify forward-looking statements. Any such statements in this press release that are not statements of historical fact may be deemed to be forward-looking statements. These forward-looking statements include, without limitation, statements regarding anticipated results or benefits anticipated from the opening and operation of the TBN location mentioned in this press release or any other current or potential TBN location. Any forward-looking statements in this press release are based on Heritage’s current expectations, estimates and projections only as of the date of this release and are subject to a number of risks and uncertainties that could cause actual results to differ materially and adversely from those set forth in or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, the risks of expanding sales and revenue due to the addition of new members of the executive team or new directors to the board. These and other risks concerning Heritage’s programs and operations are described in additional detail in its registration statement on Form S-1, which is on file with the SEC. Heritage explicitly disclaims any obligation to update any forward-looking statements except to the extent required by law.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\">Contacts</td></tr><tr><td>The Mill CasinoMichael LaffeyMlaffey@themillcasino.com(541) 252-8251</td><td>Heritage Distilling Co.InvestorsScott EcksteinHeritage@kcsa.com(212) 896-1210</td></tr><tr><td> </td><td>Heritage Distilling Co.MediaFrancesca DeMauroHeritage@kcsa.com(917) 880-9771</td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5xNM9m:0-coquille-tribe-breaks-ground-on-new-distillery-heritage-distilling-branded-tasting-room-expanded-entertainment-zone-at-coos-bay-casino/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006353:0",
            "title": "Chubb Appoints Seth Gillston Head of Global Casualty for North America Major Accounts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chubb Appoints Seth Gillston Head of Global Casualty for North America Major Accounts</p><p class=\"\">PR Newswire</p><p class=\"\">NEW YORK, Feb. 4, 2025</p><p class=\"\">Lou Capparelli to serve as Chairman of Global Casualty</p><p class=\"\">NEW YORK, Feb. 4, 2025 /PRNewswire/ — Chubb today announced the appointment of Seth Gillston as Executive Vice President, Head of Global Casualty for Major Accounts in North America. Seth will oversee the day-to-day operations of the Chubb Global Casualty business unit, which provides domestic casualty insurance coverage offerings and service solutions to large national and multinational companies.</p><p class=\"\">In addition, he will lead all strategies around production, product development and management, and profit and loss performance. Seth will be based in New York City and report to Matt Merna, Senior Vice President, Chubb Group and Division President, North America Major Accounts. Seth succeeds Lou Capparelli, who will now serve as Chairman of Global Casualty.</p><p class=\"\">\"Seth's extensive experience and deep understanding of our clients' needs will be invaluable as he drives the strategic direction of the Global Casualty business,\" said Merna. \"Together, Seth and Lou will work closely to enhance our capabilities and service offerings, aligning our global casualty strategies with the needs of our distribution partners and clients, further strengthening our position as a leading provider of casualty solutions.\"</p><p class=\"\">Gillston has nearly 30 years of insurance industry experience. He joined Chubb in 2000 and has held leadership roles in M&amp;A and Private Equity, Global Casualty, Real Estate &amp; Hospitality Practice, Alternative Risk Solutions group and North America Industry Practices.</p><p class=\"\">Capparelli joined Chubb in 2002 and has led the Global Casualty business unit since 2017. Previously, he served as Executive Vice President of Chubb's Global Casualty Field Operations.</p><p class=\"\">About Chubb</p><p class=\"\">Chubb is a world leader in insurance. With operations in 54 countries and territories, Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance and life insurance to a diverse group of clients. The company is defined by its extensive product and service offerings, broad distribution capabilities, exceptional financial strength and local operations globally. Parent company Chubb Limited is listed on the New York Stock Exchange  and is a component of the S&amp;P 500 index. Chubb employs approximately 40,000 people worldwide. Additional information can be found at: www.chubb.com.</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/chubb-appoints-seth-gillston-head-of-global-casualty-for-north-america-major-accounts-302367464.html</p><p class=\"\">SOURCE Chubb</p><p class=\"\">/CONTACT: Media Contact: mediarelations@chubb.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006353:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006326_20250204006326:0",
            "title": "Catheter Precision, Inc. Announces The Closing Of Its Acquisition Of PeriKard, LLC >VTAK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006326_20250204006326:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5rLXyv:0",
            "title": "CVR Partners to Release Fourth Quarter and Full-Year 2024 Earnings Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SUGAR LAND, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — CVR Partners, LP , a manufacturer of ammonia and urea ammonium nitrate (UAN) solution fertilizer products, plans to release its fourth quarter and full-year 2024 earnings results on Tuesday, Feb. 18, after the close of trading on the New York Stock Exchange. The Partnership also will host a teleconference call on Wednesday, Feb. 19, at 11 a.m. Eastern to discuss these results.</p><p class=\"\">This call, which will contain forward-looking information, will be webcast live and can be accessed on the Investor Relations section of CVR Partners’ website at www.CVRPartners.com. For investors or analysts who want to participate during the call, the dial-in number is (877) 407-8029. The webcast will be archived and available for 14 days at https://edge.media-server.com/mmc/p/kcgnk2wr. A repeat of the call also can be accessed for 14 days by dialing (877) 660-6853, conference ID 13751233.</p><p class=\"\">CVR Partners’ fourth quarter and full-year 2024 earnings news release will be distributed via GlobeNewswire and posted at www.CVRPartners.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CVR Partners, LP</strong></p><p class=\"\">Headquartered in Sugar Land, Texas, CVR Partners, LP is a Delaware limited partnership focused on the production, marketing and distribution of nitrogen fertilizer products. It primarily produces urea ammonium nitrate (UAN) and ammonia, which are predominantly used by farmers to improve the yield and quality of their crops. CVR Partners’ Coffeyville, Kansas, nitrogen fertilizer manufacturing facility includes a 1,300 ton-per-day ammonia unit, a 3,100 ton-per-day UAN unit and a dual-train gasifier complex having a capacity of 89 million standard cubic feet per day of hydrogen. CVR Partners’ East Dubuque, Illinois, nitrogen fertilizer manufacturing facility includes a 1,075 ton-per-day ammonia unit and a 950 ton-per-day UAN unit.</p><p class=\"\">For further information, please contact:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations: </strong>                                </p><p class=\"\">Richard Roberts</p><p class=\"\">CVR Partners, LP                                         </p><p class=\"\">(281) 207-3205                                         </p><p class=\"\">InvestorRelations@CVRPartners.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Relations:</strong></p><p class=\"\">Brandee Stephens</p><p class=\"\">CVR Partners, LP</p><p class=\"\">(281) 207-3516</p><p class=\"\">MediaRelations@CVRPartners.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5rLXyv:0-cvr-partners-to-release-fourth-quarter-and-full-year-2024-earnings-results/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4y6h6y:0",
            "title": "CVR Energy to Release Fourth Quarter and Full-Year 2024 Earnings Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SUGAR LAND, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — CVR Energy, Inc.  plans to release its fourth quarter and full-year 2024 earnings results on Tuesday, Feb. 18, after the close of trading on the New York Stock Exchange. The Company also will host a teleconference call on Wednesday, Feb. 19, at 1 p.m. Eastern to discuss these results.</p><p class=\"\">This call, which will contain forward-looking information, will be webcast live and can be accessed on the Investor Relations section of CVR Energy’s website at www.CVREnergy.com. For investors or analysts who want to participate during the call, the dial-in number is (877) 407-8291. The webcast will be archived and available for 14 days at https://edge.media-server.com/mmc/p/4a2maqba. A repeat of the call also can be accessed for 14 days by dialing (877) 660-6853, conference ID 13751234.</p><p class=\"\">CVR Energy’s fourth quarter and full-year 2024 earnings news release will be distributed via GlobeNewswire and posted at www.CVREnergy.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CVR Energy, Inc.</strong></p><p class=\"\">Headquartered in Sugar Land, Texas, CVR Energy is a diversified holding company primarily engaged in the renewables, petroleum refining and marketing businesses as well as in the nitrogen fertilizer manufacturing business through its interest in CVR Partners, LP. CVR Energy subsidiaries serve as the general partner and own 37 percent of the common units of CVR Partners, LP.</p><p class=\"\">For further information, please contact: </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations:</strong> </p><p class=\"\">Richard Roberts</p><p class=\"\">CVR Energy, Inc. </p><p class=\"\">(281) 207-3205</p><p class=\"\">InvestorRelations@CVREnergy.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Relations:</strong> </p><p class=\"\">Brandee Stephens                        </p><p class=\"\">CVR Energy, Inc. </p><p class=\"\">(281) 207-3516</p><p class=\"\">MediaRelations@CVREnergy.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4y6h6y:0-cvr-energy-to-release-fourth-quarter-and-full-year-2024-earnings-results/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4gh7l6:0",
            "title": "AmpliTech Group's AmpliTech Inc. Division Secures Additional Purchase Orders Under 5-Year Basic Order Agreement With Fortune 1000 U.S. Company",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HAUPPAUGE, N.Y., Feb.  04, 2025  (GLOBE NEWSWIRE) — AmpliTech Group, Inc. (Nasdaq: AMPG, AMPGW), a designer, developer, and manufacturer of state-of-the-art signal processing components for satellite, Public and Private 5G, and other communications networks, including the design of complete 5G/6G systems and a global distributor of packages and lids for integrated circuits assembly, today announced receiving additional Purchase Orders, as part of the recently announced signing of a 5 Year Basic Order Agreement (BOA), with a US based Fortune 1000 Company. These purchase orders increase the cumulative PO’s received by the company in excess of US$1M in Q1 to date, all orders deliverable within Fiscal Year 2025.</p><p class=\"\">“We are thrilled to announce that our Q1 bookings have already exceeded the $1M milestone, and we eagerly anticipate the arrival of long-awaited orders for our 5G Division in the coming weeks,” said Fawad Maqbool, CEO of AmpliTech Group. “We’re equally delighted with the robust performance of orders generated by our BOA with the Fortune 1000 company, which we believe is a direct testament to our proprietary low noise technology driving superior performance in LNAs and LNBs. These additional purchase orders not only highlights our technological edge but also reinforces the strategic impact of our R&amp;D investments in new product lines—fueling both revenue growth and enhanced potential profitability for our shareholders.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About AmpliTech Group</strong></p><p class=\"\">AmpliTech Group, Inc., comprising five divisions—AmpliTech Inc., Specialty Microwave, Spectrum Semiconductors Materials, AmpliTech Group Microwave Design Center, and AmpliTech Group True G Speed Services—is a leading designer, developer, manufacturer, and distributor of cutting-edge radio frequency (RF) microwave components and 5G network solutions. Serving global markets including satellite communications, telecommunications (5G &amp; IoT), space exploration, defense, and quantum computing, AmpliTech Group is committed to advancing technology and innovation. For more information, please visit www.amplitechgroup.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor Statement</strong></p><p class=\"\">This release contains statements that constitute forward-looking statements. These statements appear in several places in this release and include all statements that are not statements of historical fact regarding the intent, belief or current expectations of the Company, its directors or its oﬃcers with respect to, among other things, that the receipt of these follow on orders will lead to further production orders, work for the customer, growth and profitablity. The words \"may\" \"would\" \"will\" \"expect\" \"estimate\" \"anticipate\" \"believe\" \"intend\" for 5G orders and similar expressions and variations thereof are intended to identify forward-looking statements. Investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, many of which are beyond the Company's ability to control, and that actual results may differ materially from those projected in the forward-looking statements because of various factors. Other risks are identiﬁed and described in more detail in the “Risk Factors” section of the Company’s ﬁlings with the SEC, which are available on our website and with the SEC at sec.gov. We undertake no obligation to update, and we do not have a policy of updating or revising these forward-looking statements, except as required by applicable law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Corporate Social Media</strong></p><p class=\"\">X:<strong class=\"root-Tkn6WL2y\"> </strong>@AmpliTechAMPG</p><p class=\"\">Instagram:<strong class=\"root-Tkn6WL2y\"> </strong>@AmpliTechAMPG</p><p class=\"\">Facebook: AmpliTechInc</p><p class=\"\">LinkedIn<strong class=\"root-Tkn6WL2y\">: </strong>AmpliTech Group Inc</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Social Media</strong></p><p class=\"\">X: @AMPG_IR</p><p class=\"\">StockTwits: @AMPG_IR</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Company Contact:</strong></p><p class=\"\">Jorge Flores</p><p class=\"\">Tel: 631-521-7831</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investors@amplitechgroup.com</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4gh7l6:0-amplitech-group-s-amplitech-inc-division-secures-additional-purchase-orders-under-5-year-basic-order-agreement-with-fortune-1000-u-s-company/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006375:0",
            "title": "Alpha Modus Sues Walgreens Over Alleged Patent Infringement of AI Tech",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Don Nico Forbes</p><p class=\"\">Alpha Modus filed a lawsuit against Walgreens for what it called patent infringement concerning its AI-driven retail technology.</p><p class=\"\">The technology company said a patent for its AI retail technology--which is designed to enhance in-store shopping through data-driven insights, interactive advertising and consumer engagement tools--is being infringed by Walgreens' Cooler Screens digital smart screens.</p><p class=\"\">\"We believe our technology is currently being used by scores of brands, retailers and technology providers. Our research demonstrates that, as a result, damages due Alpha Modus far exceed an estimated $500 million and could easily run into the billions over the life of our patents,\" Chief Executive William Alessi said.</p><p class=\"\">Alpha Modus shares were up nearly 25% in premarket trading at $2.61.</p><p class=\"\">Write to Don Nico Forbes at don.forbes@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006375:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1v8Pxh:0",
            "title": "Data443 Acquires Breezemail.ai, Accelerating AI-Powered Email Privacy Capabilities for Microsoft Office and Google GMail",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RESEARCH TRIANGLE PARK, N.C., Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\"><em>Data443 Risk Mitigation, Inc</em></strong>. (OTCPK: ATDS) (“Data443” or the “Company”), a data security and privacy software company for \"All Things Data Security,\" today announced the acquisition of intellectual property and operational assets of Breezemail.ai, an innovative provider of AI-powered email management technology. This acquisition marks a significant expansion of Data443's capabilities in intelligent threat detection and leverages its leadership at the forefront of the rapidly evolving AI security landscape.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:900.562851782364px;aspect-ratio:1.5009380863039399\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1v8Pxh-e3375cc8f84ea9694351fc5055aab853-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1v8Pxh-e3375cc8f84ea9694351fc5055aab853-resized.jpeg\" style=\"background-color:#d4d8da\"/></picture></div></figure></span></p><p class=\"\">Breezemail.ai leverages proprietary implementations of machine-learning algorithms that manage end-user mailboxes for both Microsoft Office365 and Google GSuite GMail. This capability is the industry's first implementation, giving end users direct management of their inboxes from outside the service provider - creating private implementations of email organization, detection, and visibility for important information. Managing this privately ensures that the mail provider does not have access to the rulesets that the end user designs, ensuring ongoing privacy of private rulesets for the customer. Email providers do not see the rules that the end user creates.</p><p class=\"\">\"AI privacy continues to be a major issue the industry continues to tackle. End users should be able to keep their mailbox organization rules private, change them at will, and have a simple interface for managing this. Breezemail.ai enables this capability in a few mouse clicks and gives the user ultimate control. Even more importantly, the users' private rules and decisions are not shared with any service provider,\" stated Jason Remillard, CEO and Founder of Data443.</p><p class=\"\">Integrating this technology into Data443's award-winning product suites increases the adoption of these capabilities in other segments, such as healthcare, national defense, and government organizations.</p><p class=\"\">The acquisition coincides with significant market validation of AI-powered email security solutions, evidenced by Abnormal Security's anticipated IPO and growing enterprise demand for intelligent security platforms. This strategic move positions Data443 to capture an expanding share of the email security market, which is experiencing rapid growth driven by the increasing sophistication of cyber threats.</p><p class=\"\">The integration of Breezemail.ai's technology will deliver immediate benefits to Data443's customers:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Seamless integration with existing Cyren by Data443 deployments</li><li class=\"listItem-bmN0_SHH\">Enhanced protection against sophisticated social engineering attacks</li><li class=\"listItem-bmN0_SHH\">Real-time threat intelligence sharing across the customer base</li><li class=\"listItem-bmN0_SHH\">A rich implementation for selective decision-making driven by the end-user without IT assistance</li><li class=\"listItem-bmN0_SHH\">Complete privacy on how the users' internal mindset works with data</li></ul><p class=\"\">\"Combining Breezemail.ai's innovative AI implementations with our existing security capabilities, we're building on our compounding advantages with our Cyren by Data443 email and threat intelligence product stack,\" added Remillard. \"This integration will provide our customers with unprecedented AI privacy enablement protection while significantly simplifying management tools for end users.\"</p><p class=\"\">\"This acquisition transcends mere technological expansion, marking a pivotal shift in email privacy protection. As artificial intelligence continues to automate more aspects of our digital lives, safeguarding user privacy has emerged as one of the industry's most pressing challenges. This enables millions of users to self-manage their data with complete privacy,\" concluded Mr.Remillard.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Data443 Risk Mitigation, Inc.</strong></p><p class=\"\">Data443 Risk Mitigation, Inc. (OTCPK: ATDS) provides software and services to enable secure data across devices and databases, at rest and in flight/in transit, locally, on a network or in the cloud. We are All Things Data Security™. With over 10,000 customers in over 100 countries, Data443 provides a modern approach to data governance and security by identifying and protecting all sensitive data regardless of location, platform or format. Data443’s framework helps customers prioritize risk, identify security gaps and implement effective data protection and privacy management strategies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements </strong></p><p class=\"\">This press release contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by use of terms such as \"expect,\" \"believe,\" \"anticipate,\" \"may,\" \"could,\" \"will,\" \"should,\" \"plan,\" \"project,\" \"intend,\" \"estimate,\" \"predict,\" \"potential,\" \"pursuant,\" \"target,\" \"continue\" or the negative of these words or other comparable terminology. Statements in this press release that are not historical statements, including statements regarding Data443's plans, objectives, future opportunities for Data443's services, future financial performance and operating results, and any other statements regarding Data443's future expectations, beliefs, plans, objectives, financial conditions, assumptions or future events or performance, or regarding the anticipated consummation of any transaction, are forward-looking statements. These statements are not guarantees of future performance and are subject to numerous risks, uncertainties and assumptions, many of which are difficult to predict or are beyond Data443's control. These risks, uncertainties and assumptions could cause actual results to differ materially from the results expressed or implied by the statements. They may relate to the outcome of litigation, settlements and investigations; actions by third parties, including governmental agencies; volatility in customer spending; global economic conditions; inability to hire and retain personnel; loss of, or reduction in business with, key customers; difficulty with growth and integration of acquisitions; product liability; cybersecurity risk; anti-takeover measures in the Company’s charter documents; and the uncertainties created by global health issues, such as the ongoing outbreak of COVID, and political unrest and conflict, such as the invasion of Ukraine by Russia. These and other important risk factors are described more fully in the Company’s reports and other documents filed with the Securities and Exchange Commission (\"the SEC\"), including in Part I, Item 1A of the Company’s Annual Report on Form 10-K filed with the SEC on April 17, 2024, and subsequent filings with the SEC. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the Company on the date hereof. Except as otherwise required by applicable law, Data443 undertakes no obligation to publicly update or revise any forward-looking statements, whether because of new information, future events or otherwise.</p><p class=\"\">“DATA443” is a registered trademark of Data443 Risk Mitigation, Inc.</p><p class=\"\">All product names, trademarks and registered trademarks are property of their respective owners. All company, product and service names used in this press release are for identification purposes only. Use of these names, trademarks and brands does not imply endorsement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information:</strong> </p><p class=\"\">Follow us on LinkedIn: https://www.linkedin.com/company/data443-risk-mitigation-inc/</p><p class=\"\">Follow us on YouTube: https://www.youtube.com/channel/UCZXDhJcx-XgMBhvE9aFHRdA </p><p class=\"\">Sign up for our Investor Newsletter: https://data443.com/investor-email-alerts/</p><p class=\"\">To learn more about Data443, please watch the Company’s video introduction on its YouTube channel: https://youtu.be/1Fp93jOxFSg</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Matthew Abenante</p><p class=\"\">ir@data443.com </p><p class=\"\">919.858.6542</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Data443 Risk Mitigation, Inc.      </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Data443 Risk Mitigation, Inc.</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Data443 Acquires Breezemail.ai, Accelerating AI-Powered Email Privacy Capabilities for Microsoft Office and Google GMail</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1v8Pxh:0-data443-acquires-breezemail-ai-accelerating-ai-powered-email-privacy-capabilities-for-microsoft-office-and-google-gmail/",
            "pub_date": "2025-02-04 21:30:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbtRgh9:0",
            "title": "Catheter Precision, Inc.  Announces The Closing of its Acquisition of PeriKard, LLC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FORT MILL, S.C., Feb.  04, 2025  (GLOBE NEWSWIRE) —  Catheter Precision, Inc. (NYSE American: VTAK), a U.S.-based innovative medical device company focused on electrophysiology products, today announces that it has closed the previously announced acquisition of PeriKard, LLC.</p><p class=\"\">David Jenkins, CEO of Catheter Precision, commented on the acquisition, “We are happy to have closed on this all-stock transaction within our anticipated timeline. The acquired technology will complement our emphasis on the ventricular therapeutic market and expectation for continuing growth in this market segment”.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Catheter Precision</strong></p><p class=\"\">Catheter Precision is an innovative U.S.-based medical device company bringing new solutions to market to improve the treatment of cardiac arrhythmias. It is focused on developing groundbreaking technology for electrophysiology procedures by collaborating with physicians and continuously advancing its products.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Additional Information</strong></p><p class=\"\">This release and all other releases from Catheter Precision, Inc. are limited in their entirety by other information filed with the SEC including, but not limited to, our latest 10-K, 10-Q’s, and 8-K’s, and should be read in conjunction with those filings.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward Looking Statements</strong></p><p class=\"\">This communication contains forward-looking statements. Forward-looking statements can be identified by words such as \"believe,\" \"anticipate,\" \"may,\" \"might,\" \"can,\" \"could,\" \"continue,\" \"depends,\" \"expect,\" \"expand,\" \"forecast,\" \"intend,\" \"predict,\" \"plan,\" \"rely,\" \"should,\" \"will,\" \"may,\" \"seek,\" or the negative of these terms and other similar expressions, although not all forward-looking statements contain these words. These forward-looking statements are subject to the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Forward-looking statements contained in this press release include, but are not limited to, statements regarding the following: that PeriKard’s kit of tools is designed to enable physicians to more easily gain access to the pericardial space of the heart and that it is intended that the kit will have both a better needle system and a better drainage system than current alternatives, Catheter’s ability to continue development of PeriKard’s products and gain the regulatory approvals needed to bring the products to market, that the anticipated PeriKard product offering will complement our emphasis on the ventricular therapeutic market and expectation for continuing growth in this market segment. The Company's expectations and beliefs regarding these matters may not materialize. Actual outcomes and results may differ materially from those contemplated by these forward-looking statements as a result of uncertainties, risks and changes in circumstances, including but not limited to risks and uncertainties included under the caption \"Risk Factors\" in the Company's 2023 Form 10-K filed with the SEC, and its Form 10-Q for the quarter ended June 30, 2024, and available at www.sec.gov. These risks and uncertainties include, but aren't limited to, with respect to statements regarding PeriKard, that regulatory approvals may not be obtained, that test results may prove disappointing, and that we may be unable to raise sufficient funding to further the development of PeriKard’s products. With respect to Catheter’s business, which will include PeriKard following closing of the transaction, and our growth expectations, these risks and uncertainties include that the results of anticipated trials may not turn out as we currently expect and future trials may not occur on the time tables we expect or may be more costly than anticipated, we do not have sufficient liquidity to fund our operations as currently proposed unless we are able to obtain additional financing or enter into a strategic transaction that would provide additional liquidity, we will not be able to reach profitability unless we are able to achieve our product expansion and growth goals, our research and development and commercialization efforts may depend on entering into agreements with corporate collaborators, we have entered into joint marketing agreements with respect to our products, and may enter into additional joint marketing agreements, that will reduce our revenues from product sales, royalty agreements with respect to our LockeT device will reduce any future profits from this product, if we experience significant disruptions in our information technology systems, our business may be adversely affected, litigation and other legal proceedings may adversely affect our business, if we make acquisitions or divestitures, we could encounter difficulties that harm our business, failure to attract and retain sufficient qualified personnel could also impede our growth, failure to maintain effective internal controls could cause our investors to lose confidence in us and adversely affect the market price of our common stock, we have determined that our internal controls and disclosure controls were not effective as of December 31, 2023 and September 30, 2024, and as a result, without effective remediation of the material weaknesses that we have identified, we may not be able to accurately report our financial results or prevent fraud, our revenues may depend on our customers' receipt of adequate reimbursement from private insurers and government sponsored healthcare programs, we may be unable to compete successfully with companies in our highly competitive industry, many of whom have substantially greater resources than we do, our future operating results depend upon our ability to obtain components in sufficient quantities on commercially reasonable terms or according to schedules, prices, quality and volumes that are acceptable to us, and suppliers may fail to deliver components, or we may be unable to manage these components effectively or obtain these components on such terms, if hospitals, physicians and patients do not accept our current and future products or if the market for indications for which any product candidate is approved is smaller than expected, we may be unable to generate significant revenue, if any, our medical device operations are subject to pervasive and continuing FDA regulatory requirements, our products may be subject to additional recalls, revocations or suspensions after receiving FDA or foreign approval or clearance, which could divert managerial and financial resources, harm our reputation, and adversely affect our business, changes in trade policies among the U.S. and other countries, in particular the imposition of new or higher tariffs, could place pressure on our average selling prices as our customers seek to offset the impact of increased tariffs on their own products, increased tariffs or the imposition of other barriers to international trade could have a material adverse effect on our revenues and operating results. The risks and uncertainties described above may be amplified by the COVID-19 pandemic, which has caused significant economic uncertainty, or other pandemics, supply chain disruptions from the Ukraine war or Israeli-Hamas conflict and otherwise, and ongoing volatility in the stock markets and the U.S. economy in general.</p><p class=\"\">The forward-looking statements included in this communication are made only as of the date hereof. The Company assumes no obligation and does not intend to update these forward-looking statements, except as required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CONTACTS:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">At the Company</strong></p><p class=\"\">David Jenkins</p><p class=\"\">973-691-2000</p><p class=\"\">IR@catheterprecision.com</p><p class=\"\"># # #</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbtRgh9:0-catheter-precision-inc-announces-the-closing-of-its-acquisition-of-perikard-llc/",
            "pub_date": "2025-02-04 21:30:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Tnw94DcQt:0",
            "title": "VSBLTY Expands Marketsquare Program to Measure Point of Sale Transactions Throughout Latin America",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\">VSBLTY Has Validated Model forIdentifying SKU’s (Stock Keeping Unit) at POS Tied to Sales andCustomer Demographic Data </p><p class=\"\">Philadelphia, PA – TheNewswire - February 4, 2025, 2025 –VSBLTY Groupe Technologies Corp.(OTCQB: VSBGF)  (Frankfurt 5VS) (“VSBLTY”), aglobal leader in AI software providing retail and security analyticstechnology, announced the expansion of theirMarketSquare program in Mexico and throughout Latin America. VSBLTYwill begin to bundle this data with data being collected on behalf ofWinkel Media for sale to major consumer package goods clients. </p><p class=\"\">\"This is no longer just aproof of concept. We are now scaling thisimportant program that helps brands know more precisely what theirtransaction and inventory data is in stores that traditionally havevery little POS data. The cost savings to brandsthat can more efficiently service stores that need restocking vs thosethat do not is significant.  Jay Hutton, CEO ofVSBLTY added “We are excited with the initial results that we havebeen able to achieve this past year in regard to accuracy, usingcomputer vision technology to train computers and cameras to “see”and identify specific products by brand and SKU. Accuracy levels areapproaching 90% and above. This capability, coupled with demographicdata about the actual shopper provides tremendous insights to CPGclients.”</p><p class=\"\">According to Grand View Research, the global Point ofSale (POS) marketplace surpassed $100 Billion in 2023 and has anongoing growth estimate of 8.3% CAGR. This innovation, a result of anintegrated co-development effort, with one of the largest consumerbrands in the world, is in direct response to a chronic commercialproblem for CPG’s aiming to fully digitize supply chain.</p><p class=\"\">Adding accurate computer vision-based sales trackingwith audience measurement allows brands, for the first time, to deriveinsights regarding brand preference based upon demographicinformation. The computer sees the product and, in a privacy compliantway, also sees the demographic profile of the consumer. </p><p class=\"\">This product offering uses computer vision to not onlydetect physical products at the point of sale but also to correlatesales with demographics in near real time. It will be made availableto brands on a monthly subscription basis to track sell out and salesmomentum in locations where there is little or no alternativemethodology. </p><p class=\"\">About VSBLTY (http://vsblty.net/)</p><p class=\"\">Headquartered in Philadelphia, VSBLTY(OTCQB: VSBGF)  (Frankfurt: 5VS) (“VSBLTY”) is the world leader in Artificial Intelligence and realtime interpretation of what a CCTV and other cameras see. By utilizingfacial recognition, age and gender, VSBLTY’s proprietary technologycan effectively enhance retail brand engagement and data analyticsmeasurement through customized ads on in-store digital displays atpoint of purchase in real time. This technology has been proven toincrease brand sales by over 25%. The firm is also recognized for itsleadership role in the growing “Store as a Medium” movement thatenables brands to reach customers with paid media ads when and wherebuying decisions are being made while producing a new revenue streamfor retailers. Most recently, VSBLTY has been building objectrecognition software to identify products by SKU, at the point ofcheckout, to integrate this capability into their retail media networkoffering to retailers and large CPG brands that lack customerinformation and transaction data at the point of sale. </p><p class=\"\">Using its proprietary AI software, andthe various data collected using their software, VSBLTY has alsodeveloped a range of security solutions that include not only facialrecognition but weaponrecognition utilizing modern surveillance cameras and legacy CCTVcameras. VSBLTY has the capability to create a proactive securitysystem rather than a reactive security system, providing early warningof threats that can save lives. Data collected through the platformcan inform large scale deployments for smart city, private state andfederal municipal security programs including bordercontrol.</p><p class=\"\">InvestorRelations</p><p class=\"\">HarborAccess</p><p class=\"\">Jonathan Paterson,475-477-9401</p><p class=\"\">Jonathan.Paterson@Harbor-Access.com</p><p class=\"\">CONTACT:Linda Rosanio,609-472-0877 </p><p class=\"\">lrosanio@vsblty.net</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Tnw94DcQt:0-vsblty-expands-marketsquare-program-to-measure-point-of-sale-transactions-throughout-latin-america/",
            "pub_date": "2025-02-04 21:30:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204007106:0",
            "title": "Pfizer stock climbs on Q4 revenue and earnings beat, reaffirmed guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pfizer Inc. (PFE) shares rose 1.7% in premarket trades Tuesday after the drug maker topped Wall Street's revenue and profit estimates in its fourth-quarter results and reaffirmed its full-year guidance.</p><p class=\"\">Pfizer's adjusted fourth-quarter profit of 63 cents a share beat the FactSet consensus estimate of 47 cents a share. Revenue rose to $17.76 billion from $14.57 billion, and beat the FactSet consensus of $17.35 billion.</p><p class=\"\">Pfizer also reaffirmed its full-year 2025 guidance, which includes revenue in a range of $61 billion to $64 billion and adjusted earnings between $2.80 and $3 a share.</p><p class=\"\">(This is a developing news story with updates to come.)</p><p class=\"\">-James Rogers</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204007106:0/",
            "pub_date": "2025-02-04 21:22:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV15Z:0",
            "title": "Dhanlaxmi Bank Dec-Quarter Net Profit 198.5 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dhanlaxmi Bank Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER NET PROFIT 198.5 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER GROSS NPA 3.53%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER INTEREST EARNED 3.35 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER PROVISIONS &amp; CONTINGENCIES 67 MILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV15Z:0-dhanlaxmi-bank-dec-quarter-net-profit-198-5-mln-rupees/",
            "pub_date": "2025-02-04 21:22:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006238:0",
            "title": "L3Harris Technologies Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006238:0/",
            "pub_date": "2025-02-04 21:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006241:0",
            "title": "American Woodmark Cut to Peer Perform From Outperform by Wolfe Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006241:0/",
            "pub_date": "2025-02-04 21:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}