{
    "data": [
        {
            "id": "beincrypto:ec6c44bcb094b:0",
            "title": "Arbitrum Price Under Pressure: 60 Million ARB Whale Sale Sparks ATL Fear",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Arbitrum price continues to weaken as ARB struggles to attract sustained investor demand. The token has failed to align with broader crypto market recoveries. Instead, it remains under pressure, extending a prolonged decline that has brought it dangerously close to its all-time low.</span></p><p class=\"\"><span>Investor support appears limited despite occasional short-lived rebounds. Broader market improvements have not translated into lasting gains for ARB. This divergence highlights fading conviction across multiple participant groups within the Arbitrum ecosystem.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Arbitrum Is Dominated By Volatile Holders</span></strong></p><p class=\"\"><span>The Chaikin Money Flow indicator has dropped below the zero line, signaling net capital outflows. This reading reflects sustained selling pressure rather than healthy accumulation. Weak inflows suggest buyers lack confidence at current price levels.</span></p><p class=\"\"><span>ARB briefly spiked after forming a new all-time high earlier in the cycle. That move was largely driven by bottom buying activity. However, short-term holders quickly sold into strength. Their rapid distribution capped upside momentum and reinforced downside volatility.</span></p><p class=\"\"><span>Want more token insights like this? Sign up for Editor Harsh Notariya’s Daily Crypto Newsletter here.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:584.5479452054794px;max-width:1200px;aspect-ratio:2.0528683914510686\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-13ad7467b69e3ead154924c561eda77d-resized.webp\" type=\"image/webp\"/><img alt=\"ARB CMF\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-13ad7467b69e3ead154924c561eda77d-resized.webp\" style=\"background-color:#fdfdfd\"/></picture></div></button></figure><p class=\"\"><span>The MVRV Long/Short Difference metric shows that short-term holders currently dominate realized profits. This imbalance creates vulnerability for Arbitrum’s price stability. Short-term holders often exit positions quickly once profitability appears.</span></p><p class=\"\"><span>This behavior increases the risk of abrupt corrections. Today’s 8% drop reflects that dynamic. When profit-taking from short-term participants intensifies, the price can fall sharply without warning. Until long-term conviction strengthens, ARB remains exposed to sudden declines.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:406.25px;max-width:1200px;aspect-ratio:2.9538461538461536\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-f9d9001e0d274a7b1224d8e2c6965602-resized.webp\" type=\"image/webp\"/><img alt=\"ARB MVRV Long/Short Difference\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-f9d9001e0d274a7b1224d8e2c6965602-resized.webp\" style=\"background-color:#fdf2f2\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ARB Whales Aren’t Holding Back Either</span></strong></p><p class=\"\"><span>Whale activity adds further pressure to the outlook. Addresses holding between 1 million and 10 million ARB have sold more than 60 million tokens over the past three weeks. This distribution has been gradual rather than panic-driven.</span></p><p class=\"\"><span>Slow and consistent whale selling often signals waning confidence. Unlike emotional capitulation, steady distribution can suppress recovery attempts. Persistent supply entering the market reduces the probability of a strong rebound in the near term.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:406.25px;max-width:1200px;aspect-ratio:2.9538461538461536\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-3259efebddd6a39ef6f59ee8a5cfcfa3-resized.webp\" type=\"image/webp\"/><img alt=\"ARB Whale Selling\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-3259efebddd6a39ef6f59ee8a5cfcfa3-resized.webp\" style=\"background-color:#fdfdfd\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ARB Price Faces New All-Time Low</span></strong></p><p class=\"\"><span>Arbitrum price is down 8% today, trading at $0.0921 at the time of writing. ARB failed to defend the $0.0994 support level. The breakdown triggered additional selling, accelerating downside momentum.</span></p><p class=\"\"><span>The next support lies at $0.0887, just above the all-time low of $0.0883. Given current indicators, a retest appears likely. A decisive break below this threshold could push ARB toward $0.0821, establishing a new cycle low.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:584.5479452054794px;max-width:1200px;aspect-ratio:2.0528683914510686\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-2da6772db6dcc6a858f6dda6b87809f4-resized.webp\" type=\"image/webp\"/><img alt=\"ARB Price Analysis\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:ec6c44bcb094b-2da6772db6dcc6a858f6dda6b87809f4-resized.webp\" style=\"background-color:#f5f1f1\"/></picture></div></button></figure><p class=\"\"><span>Invalidating this bearish thesis requires a structural shift in sentiment. Investors must slow distribution and restore inflows. ARB needs to reclaim $0.0947 to stabilize short-term momentum. Flipping $0.0994 back into support would open a path toward $0.1060, signaling recovery strength.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/beincrypto:ec6c44bcb094b:0-arbitrum-price-under-pressure-60-million-arb-whale-sale-sparks-atl-fear/",
            "pub_date": "2026-03-01 07:51:29",
            "source": "Beincrypto",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228001005:0",
            "title": "In California, About the Only Way to Get a House Is to Inherit One — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Nicole Friedman and Veronica Dagher | Photography by Michaela Vatcheva for WSJ</span></p><p class=\"\"><span>Inheritance is one of the last reliable ways for younger Californians to own their first home.</span></p><p class=\"\"><span>About 18% of all property transfers in the state last year, representing nearly 60,000 homes, were made through inheritance, according to a recent analysis by real-estate data firm Cotality.</span></p><p class=\"\"><span>That share is a record for California in data going back to 1995, up from 12% in 2019. It is also roughly double the national share of 8.8% last year.</span></p><p class=\"\"><span>Cheryl Norris, a 76-year-old who works as an independent antique dealer, has owned a pair of homes in Northern California for decades. Her two children in their 30s don't see a clear path toward buying a home there themselves. California's home prices rank among the highest in the U.S., reaching a median single-family sales price of nearly $900,000 last year.</span></p><p class=\"\"><span>When Norris dies, she plans to leave her Santa Rosa property, with its low-pitched roof and large picture window, and her more expansive three-bedroom retreat set on more than 2 acres in San Rafael to her daughter and son.</span></p><p class=\"\"><span>\"Even though my kids work as hard as I did, it's sad that inheritance is their best shot at homeownership here,\" she said.</span></p><p class=\"\"><span>The state's high rate of inherited homes reflects California's unique circumstances: years of skyrocketing home prices, and tax policies that encourage owners to avoid selling their houses before they die.</span></p><p class=\"\"><span>The people who inherit these houses enjoy tremendous benefits. They can move into homes that they otherwise might not be able to buy at current prices, or they can sell them and keep the proceeds without having to pay capital-gains taxes.</span></p><p class=\"\"><span>But the high rate of homes passed on after death is distorting the state's housing market, favoring longtime homeowners and their families over all other home buyers.</span></p><p class=\"\"><span>\"Homeownership has become a 'til-death-do-us-part scenario\" in California, said Jeff Fishman, a Los Angeles financial adviser.</span></p><p class=\"\"><span>That limits the state's supply of homes for sale, pushing prices higher and increasing the incentive not to sell, said Ken DeLeon, founder of DeLeon Realty in Palo Alto, Calif.</span></p><p class=\"\"><span>\"We're in this negative feedback loop,\" he said.</span></p><p class=\"\"><span>Homeowners are holding on to their homes for longer across the U.S., partly because many older people are still working or want to age in place. And the inheritance rate is rising nationally.</span></p><p class=\"\"><span>But these rates are even higher in California, where the typical homeowner stayed put for almost 17 years in 2024. The national median was about 12 years, according to Redfin.</span></p><p class=\"\"><span>The situation can be traced in part back to 1978, when voters passed Proposition 13, which generally caps property-tax increases at 2% a year based on the most recent purchase price. Longtime owners pay taxes based on decades-old valuations. New buyers are taxed at much higher current market valuations.</span></p><p class=\"\"><span>This disparity encourages many homeowners to stay put rather than move to a different home and take on a higher tax bill. A new buyer today can pay 10 times as much property tax as a neighbor who purchased in the 1970s.</span></p><p class=\"\"><span>California tightened its property-tax rules in 2021 to limit the circumstances in which heirs can keep a parent's low tax rate. So only one of Norris's homes will benefit from a low property-tax bill after her death.</span></p><p class=\"\"><span>This change has encouraged more heirs of vacation properties to sell, said Rachel Dodson, partner at the law firm Ayoub &amp; Dodson. But it doesn't meaningfully change the math that encourages homeowners to pass on the home to their heirs in the first place.</span></p><p class=\"\"><span>The specter of a huge capital-gains tax bill creates another major obstacle to selling. Federal law allows a $250,000 exclusion ($500,000 for couples) for homeowners selling their primary residences. With many California homes now worth millions, homeowners often have gains that far exceed these limits.</span></p><p class=\"\"><span>If the home is inherited, its value for tax purposes resets to its market price on the date of death. For a home that appreciated from $200,000 to $2 million, the heir could save more than $500,000 in federal and state taxes, said Miklos Ringbauer, an accountant in Los Angeles.</span></p><p class=\"\"><span>Darred Greenside, along with his brother and cousin, inherited a three-bedroom San Francisco home that his aunt and uncle purchased in 1964 for $41,000. Greenside and his brother bought out their cousin's share of the house, and Greenside moved from Seattle to live in the home.</span></p><p class=\"\"><span>At more than $18,000 a year, Greenside's property-tax bill is far higher than the $1,100 his aunt paid annually. But because he has no mortgage payment, Greenside is still saving money compared with paying rent for a smaller apartment in the city, he said.</span></p><p class=\"\"><span>\"I don't have any regrets,\" he said.</span></p><p class=\"\"><span>Some politicians and housing economists want to increase the capital-gains exclusion for home sales to encourage older people to sell their homes before death, especially large houses that could be desirable for younger families.</span></p><p class=\"\"><span>In many parts of the country, older people need to sell their homes to cover the cost of assisted living or other types of care. But in California, homeowners with mortgages have about $600,000 in equity on average, according to Cotality. They can take out home equity lines of credit or rent out their homes to fund their living expenses without selling.</span></p><p class=\"\"><span>For Jameson Norris, Cheryl Norris's 35-year-old son who works gig jobs like ride-share driving, the prospect of inheriting his mom's homes with his sister is both a relief and humbling.</span></p><p class=\"\"><span>In 1988, Cheryl and her late husband bought their Santa Rosa home for about $149,000. Decades later, the home has roughly quadrupled in value. And the San Rafael hilltop home, valued at about $281,500 in 1985, is now worth an estimated $1.8 million.</span></p><p class=\"\"><span>Jameson said he'd likely never be able to buy his own house in San Rafael, where the typical home costs about $1.2 million, according to Zillow.</span></p><p class=\"\"><span>\"It's a bit depressing knowing it's nearly impossible for me to buy my own place,\" he said, \"even though I'm so grateful.\"</span></p><p class=\"\"><span>Write to Nicole Friedman at nicole.friedman@wsj.com and Veronica Dagher at Veronica.Dagher@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228001005:0/",
            "pub_date": "2026-03-01 09:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:529250:0",
            "title": "South Korea Imports Grow Less than Expected",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>South Korea’s imports rose 7.5% yoy in February 2026, slowing from an 11.6% expansion in the previous month and falling short of market estimates  of 13%, a flash reading showed.</span></p><p class=\"\"><span>Still, the latest result marked the fourth successive month of purchases, lifted by sustained domestic demand ahead of the Lunar New Year festival.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:529250:0-south-korea-imports-grow-less-than-expected/",
            "pub_date": "2026-03-01 08:22:59",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:529248:0",
            "title": "South Korea Trade Surplus Hits Record High",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>South Korea's trade surplus surged to a record peak of USD 15.51 billion in February 2026 from USD 4.15 billion in the same month a year earlier, surpassing market expectations for a gain of USD 10 billion and marking the 13th straight month of surplus.</span></p><p class=\"\"><span>Year-on-year, exports increased 29%, topping the consensus of 24% and following a 33.8% jump in January.</span></p><p class=\"\"><span>It also pointed to the ninth consecutive month of growth in outbound shipments amid robust foreign demand.</span></p><p class=\"\"><span>Meanwhile, imports rose at a slower pace of 7.5%, missing forecasts of 13% and easing from January's 11.6% increase.</span></p><p class=\"\"><span>That said, the latest figure marked a fourth consecutive month of growth in inbound shipments, supported by sustained domestic demand ahead of the Lunar New Year festival.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:529248:0-south-korea-trade-surplus-hits-record-high/",
            "pub_date": "2026-03-01 08:14:28",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:529249:0",
            "title": "South Korea Export Growth Beats Estimates",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>South Korea’s exports grew 29.0% yoy to USD 65.8 billion in February 2026, topping market forecasts of 24% but slowing from a 33.8% surge in the previous month.</span></p><p class=\"\"><span>It marked  the ninth consecutive month of expansion in shipments.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:529249:0-south-korea-export-growth-beats-estimates/",
            "pub_date": "2026-03-01 08:18:27",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228001001:0",
            "title": "South Korea's Exports Grew 29% Year-on-Year in February — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Kwanwoo Jun</span></p><p class=\"\"><span>South Korea reported solid export growth in February despite fewer working days, with semiconductor shipments reaching a monthly record on strong demand.</span></p><p class=\"\"><span>Exports from Asia's fourth-largest economy rose 29% from a year earlier to $67.45 billion, following a 34% increase in January, according to preliminary data released Sunday by the Trade Ministry.</span></p><p class=\"\"><span>The Lunar New Year holiday in mid-February reduced the number of working days by three. Even so, the result beat the median forecast for a 26% increase in a Wall Street Journal survey of nine economists.</span></p><p class=\"\"><span>Imports rose 7.5% from a year earlier to $51.94 billion, resulting in a trade surplus of $15.51 billion. That followed a revised $8.72 billion surplus in January.</span></p><p class=\"\"><span>Most analysts expect the country — home to the world's leading memory chip makers, including Samsung Electronics and SK Hynix — to maintain solid, chip-driven export growth this year, supported by global demand linked to artificial intelligence.</span></p><p class=\"\"><span>Semiconductor shipments — accounting for over a quarter of total exports — more than doubled from a year earlier to a record $25.16 billion in February, outweighing declines in auto, petrochemical and steel shipments, the data showed.</span></p><p class=\"\"><span>Exports to the U.S. and China rose 30% and 34%, respectively, from a year earlier in February.</span></p><p class=\"\"><span>Write to Singapore Editors at singaporeeditors@dowjones.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228001001:0/",
            "pub_date": "2026-03-01 08:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "sharecast:0ede84fd3094b:0",
            "title": " Trump says Ayatollah Ali Khamenei killed in Iran airstrikes ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>“Khamenei, one of the most evil people in History, is dead,” Trump wrote in a social media post.</span></p><p class=\"\"><span>“He was unable to avoid our Intelligence and Highly Sophisticated Tracking Systems and, working closely with Israel, there was not a thing he, or the other leaders that have been killed along with him, could do.” Trump added that the aim of the attacks was regime change and bombing would continue.</span></p><p class=\"\"><span>The surprise war came after officials from Tehran and Washington met on Thursday to discuss Iran’s nuclear programme but failed to achieve a breakthrough.</span></p><p class=\"\"><span>In response, Iran launched missile and drone strikes against US bases, including the headquarters of the US navy’s fifth fleet in Bahrain, Israeli residential areas, and targets in other Gulf countries including Dubai, Saudi Arabia, Qatar and Kuwait.</span></p><p class=\"\"><span>“This is the single greatest chance for the Iranian people to take back their Country,” Trump added.</span></p><p class=\"\"><span>Israeli Prime Minister Benjamin Netanyahu earlier claimed there were “many signs” the 86-year-old Khamenei was “no longer alive” but provided no evidence.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Reporting by Frank Prenesti for Sharecast.com</span></strong></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/sharecast:0ede84fd3094b:0/",
            "pub_date": "2026-03-01 08:31:51",
            "source": "ShareCast",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:1aaa96f0a094b:0",
            "title": "Bitcoin At Historic RSI Lows — Is The Final Flush Already Behind Us?",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bitcoin is trading at weekly RSI levels historically seen near bear market bottoms, signaling that selling pressure may be easing. While confirmation is needed, the market is in a zone often marking late-stage capitulation. The key question: was the recent drop the final flush, or is one last shakeout still ahead?</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>RSI Compression Signals Downside Exhaustion</span></strong></strong></p><p class=\"\"><span>According to crypto analyst Batman, Bitcoin’s weekly RSI has fallen back into the same territory that historically marked prior bear market bottoms. This momentum zone has repeatedly appeared during late-stage capitulation phases, making it a critical signal that the market could be nearing another major turning point.</span></p><p class=\"\"><span>However, Batman is clear that this does not confirm the bottom is already in, stressing the importance of waiting for proper confirmation before declaring a reversal. Still, he notes that when RSI compresses to these levels on the weekly timeframe, Bitcoin has typically been much closer to a structural low than to the beginning of a fresh collapse.</span></p><p class=\"\"><span>Reflecting on the 2022 bear cycle, Batman points out that once RSI entered this extreme zone, price managed to print one final lower low. However, that move occurred very close to the ultimate bottom, indicating that most of the downside had already played out by the time momentum reached such depressed readings.</span></p><p class=\"\"><span>The analyst concludes that probabilities matter more than precision. From his perspective, when Bitcoin trades at these weekly RSI levels, it historically represents a zone where strategic accumulation becomes increasingly attractive.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin’s Six Consecutive Weekly Lower Highs — A Rare Signal</span></strong></strong></p><p class=\"\"><span>In a recent weekly Bitcoin analysis, SuperBro pointed out that BTC has now printed six consecutive weekly lower highs, a rare structural pattern. The last time this occurred was during the COVID crash in 2020, a period marked by extreme volatility and eventual macro reversal.</span></p><p class=\"\"><span>Price is currently slipping beneath the 200-week EMA and the volume Point of Control (POC), though the weekly candle has not yet closed. A reclaim of the POC before the close could trigger a sharp upside reaction and signal that the breakdown attempt is losing strength.</span></p><p class=\"\"><span>Just below current levels sits the rising 200-week SMA, adding another layer of higher-timeframe support. RSI remains at extreme levels, suggesting that momentum is already deeply stretched. When you combine oversold conditions with six straight lower highs pressing into major support, the case for sustained downside continuation becomes less convincing.</span></p><p class=\"\"><span>Beyond the near-term structure, the broader megaphone formation remains intact. If that macro pattern ultimately plays out, its upper trajectory projects potential targets north of $300,000, keeping the long-term expansion thesis firmly on the table despite current compression.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:1aaa96f0a094b:0-bitcoin-at-historic-rsi-lows-is-the-final-flush-already-behind-us/",
            "pub_date": "2026-03-01 08:00:46",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:e940a1a30267a:0",
            "title": "Key facts: Ethereum leads DeFi with 57% market share; Taker Sell Volume spikes",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Ethereum commands a 57% market share in total value locked (TVL) in DeFi, rising to 65% with layer-2 solutions. Major firms like JP Morgan and BlackRock are leveraging Ethereum.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/cointelegraph:058a4ef83094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>On February 27th, Ethereum's Taker Sell Volume spiked to 105 million ETH, reflecting increased selling pressure and contributing to a price decline.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:4694d842a094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Morgan Stanley's application aims to protect, trade, and offer staking for crypto assets, potentially boosting Ethereum's adoption among more investors.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/stocktwits:79ba10d7f094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:e940a1a30267a:0-key-facts-ethereum-leads-defi-with-57-market-share-taker-sell-volume-spikes/",
            "pub_date": "2026-03-01 08:02:59",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:2c9a0f61a3532:0",
            "title": "Key facts: Bitcoin sell-off triggers $128 billion loss; bearish trend deepens",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Bitcoin (BTCUSD) faced a major sell-off, with aggressive market orders shifting sentiment from positive to bearish, reflected by a drop in the derivatives pressure index from 30% to 18%.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/u_today:cbb3ed326094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Bitcoin has entered bearish territory after breaking below a long-term support level at $107,000, with projections suggesting a potential price decline to $35,000 by 2026.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:1f47eb39c094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Bitcoin's market value dropped significantly, leading to a total loss of about $128 billion in digital assets, as it was the only major market open over the weekend.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:8c33f1fcc094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:2c9a0f61a3532:0-key-facts-bitcoin-sell-off-triggers-128-billion-loss-bearish-trend-deepens/",
            "pub_date": "2026-03-01 08:02:59",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:4e091e5eb58bd:0",
            "title": "Key facts: Analyst maintains $15 target for XRP; large wallets accumulate; XRPL flaw reported",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Analyst Javon Marks remains bullish on XRP, keeping a long-term price target of $15 despite a recent dip below $1.3, viewing it as a temporary setback in a bullish trend.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:e2b3ef410094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Wallets with 10 to 100 million XRP are accumulating during price dips, while smaller wallets show a neutral stance, indicating low selling pressure in the market.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/coinpedia:e7b2b4a3f094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>The XRP Ledger Foundation reported a major flaw in the XRPL's signature-validation logic, found during voting but not activated on the mainnet, risking unauthorized fund transfers.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/u_today:cd1ceef18094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:4e091e5eb58bd:0-key-facts-analyst-maintains-15-target-for-xrp-large-wallets-accumulate-xrpl-flaw-reported/",
            "pub_date": "2026-03-01 08:02:59",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSbBPcla:0",
            "title": "Best Gold IRA Companies March 2026 Announced (Best Places to Buy Gold in US Ranked)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>IRAEmpire has announced its new and updated list of the best gold IRA companies of March 2026 to help Americans make better informed decisions in this sector.</span></p><p class=\"\"><span>LOS ANGELES, CALIFORNIA / ACCESS Newswire / February 28, 2026 / Retirement planning in March 2026 looks very different than it did just a few years ago. Persistent inflation, global economic shifts, and continued stock market volatility have forced investors to rethink traditional portfolio strategies. As a result, Gold IRAs continue gaining momentum as one of the most trusted ways to diversify retirement savings.</span></p><p class=\"\"><span>After in-depth evaluation and comparison, IRAEmpire has ranked the following companies as the best Gold IRA providers for March 2026:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Augusta Precious Metals - #1 Best Overall</span></strong></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Lear Capital - #2 Top Rated Provider</span></strong></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Goldencrest Metals - #3 Best Customer Service</span></strong></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Preserve Gold - #4 Best for New Investors</span></strong></p></li></ul><p class=\"\"><span>If you are considering opening a Gold IRA or rolling over an existing 401(k) or IRA, this guide will help you make a confident, informed decision.</span></p><p class=\"\"><span>Find The Best Gold IRA Company in Your State Here</span></p><p class=\"\"><span>Michael Hunt, Senior Writer at IRAEmpire, explains:</span></p><p class=\"\"><span>\"Our March 2026 rankings highlight the most reliable Gold IRA companies based on transparency, customer satisfaction, reputation, and overall investor value.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Gold IRAs Continue to Surge in March 2026</span></strong></p><p class=\"\"><span>Gold IRAs have steadily transitioned from a niche retirement strategy into a mainstream portfolio diversification tool. As we move further into 2026, several factors continue driving demand:</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>1. Inflation Protection</span></strong></p><p class=\"\"><span>Although inflation has moderated compared to previous peaks, it continues to erode purchasing power. Gold has historically served as a long-term hedge against inflation and currency depreciation.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>2. Market Uncertainty</span></strong></p><p class=\"\"><span>Interest rate changes, geopolitical developments, and unpredictable equity markets have increased investor caution. Gold often performs differently than stocks, helping balance volatility.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>3. Retirement Risk Management</span></strong></p><p class=\"\"><span>Many Americans nearing retirement are prioritizing capital preservation over aggressive growth. Physical gold provides tangible asset backing within a tax-advantaged account.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>4. Portfolio Diversification</span></strong></p><p class=\"\"><span>Financial professionals consistently recommend asset diversification. Adding precious metals reduces reliance on stock-heavy retirement accounts.</span></p><p class=\"\"><span>For these reasons, Gold IRAs remain one of the fastest-growing retirement strategies in March 2026.</span></p><p class=\"\"><span>Read the Free Gold IRA Guide on IRAEmpire</span></p><p class=\"\"><span>Best Gold IRA Companies March 2026 - Official Rankings</span></p><p class=\"\"><span>After reviewing dozens of providers, the following companies stood out for their performance across key evaluation categories including trustworthiness, fee transparency, rollover support, customer service, and buyback programs.</span></p><p class=\"\"><span>#1 - Augusta Precious Metals (Best Overall Gold IRA Company)</span></p><p class=\"\"><span>Augusta Precious Metals continues to hold the #1 position for March 2026.</span></p><p class=\"\"><span>The company has earned a strong national reputation for its education-first approach, transparent pricing model, and lifetime customer support.</span></p><p class=\"\"><span>Read Augusta Precious Metals Reviews, Fees and More</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Augusta Ranks #1</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exceptional industry credibility</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>No-pressure educational consultations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Clear and straightforward pricing</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Dedicated account specialists</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Strong buyback program</span></p></li></ul><p class=\"\"><span>Augusta is especially ideal for first-time Gold IRA investors who value clarity and support throughout the rollover process.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Best For</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Retirement savers seeking stability</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Investors who prioritize transparency</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Individuals wanting premium, long-term support</span></p></li></ul><p class=\"\"><span>For March 2026, Augusta Precious Metals remains the clear overall leader.</span></p><p class=\"\"><span>#2 - Lear Capital (Best for Longevity and Experience)</span></p><p class=\"\"><span>Lear Capital secures the #2 position in March 2026 thanks to its long-standing presence in the precious metals industry.</span></p><p class=\"\"><span>With decades of experience, Lear Capital has built a recognizable brand and helped thousands of investors diversify retirement portfolios.</span></p><p class=\"\"><span>Read Lear Capital Reviews, Fees and More</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Lear Capital Is Ranked #2</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Established industry history</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Competitive pricing options</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Broad selection of metals</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price match guarantee</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Streamlined account setup</span></p></li></ul><p class=\"\"><span>Lear is particularly attractive for investors who prefer working with a seasoned, nationally recognized company.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ideal For</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Experienced investors</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Those seeking brand longevity</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Investors wanting product variety</span></p></li></ul><p class=\"\"><span>#3 - Goldencrest Metals (Best for Personalized Service)</span></p><p class=\"\"><span>Goldencrest Metals continues to build strong momentum and ranks #3 for March 2026.</span></p><p class=\"\"><span>The company stands out for its client-focused service model and transparent pricing structure.</span></p><p class=\"\"><span>Read Goldencrest Metals Reviews, Fees and More</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Goldencrest Metals Is Ranked #3</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Growing positive client feedback</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Clear, upfront fee explanations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Strong rollover support</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Hands-on account guidance</span></p></li></ul><p class=\"\"><span>Goldencrest Metals emphasizes relationship-building rather than aggressive sales tactics.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Best For</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Investors seeking attentive support</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Clients wanting personalized guidance</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Individuals preferring a modern service experience</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>#4 - Preserve Gold (Best for Beginner Investors)</span></strong></p><p class=\"\"><span>Preserve Gold rounds out the March 2026 rankings at #4.</span></p><p class=\"\"><span>The company has gained popularity for making Gold IRAs accessible and easy to understand for newcomers.</span></p><p class=\"\"><span>Read Preserve Gold Reviews, Fees and More</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Preserve Gold Ranks #4</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Simple onboarding process</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Beginner-friendly education</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Helpful rollover specialists</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Competitive minimum investment levels</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Best Suited For</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>First-time precious metals investors</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Budget-conscious savers</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Individuals wanting straightforward guidance</span></p></li></ul><p class=\"\"><span>Find the Best Gold IRA Company of Your US State</span></p><p class=\"\"><span>How IRAEmpire Ranked the Best Gold IRA Companies for March 2026</span></p><p class=\"\"><span>Not all Gold IRA providers operate with the same standards. To determine our official March rankings, IRAEmpire evaluated companies based on:</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>1. Reputation and Industry Standing</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BBB ratings</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Years in operation</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Complaint resolution history</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>2. Customer Satisfaction</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Verified client testimonials</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Third-party review scores</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Transparency in feedback</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>3. Fee Transparency</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Clear disclosure of setup, storage, and annual fees</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>No hidden markups</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Honest commission structures</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>4. Buyback Policies</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Fair resale pricing</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Easy liquidation process</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>No-pressure exit options</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>5. Education and Support</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Availability of learning materials</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Access to dedicated account representatives</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Clear rollover guidance</span></p></li></ul><p class=\"\"><span>Only companies that performed strongly across all categories were included.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How to Choose the Best Gold IRA Company</span></strong></p><p class=\"\"><span>Choosing the best Gold IRA company is one of the most important steps in protecting your retirement savings. Not all providers operate with the same level of transparency, service quality, or pricing structure, so careful evaluation is essential.</span></p><p class=\"\"><span>Start by reviewing the company's reputation. Look at BBB ratings, third-party review platforms, and complaint history. A strong track record over several years typically indicates stability and reliability.</span></p><p class=\"\"><span>Next, evaluate fee transparency. The best Gold IRA companies clearly disclose setup fees, annual maintenance costs, storage fees, and any markups on precious metals. Avoid companies that are vague about pricing or reluctant to provide written documentation.</span></p><p class=\"\"><span>Customer support is another critical factor. A reputable provider should offer dedicated account representatives who guide you through the rollover process, explain IRS rules, and answer long-term questions without using high-pressure sales tactics.</span></p><p class=\"\"><span>Also review the company's buyback policy. A fair and simple liquidation process ensures flexibility if you need to sell your metals in the future.</span></p><p class=\"\"><span>Finally, confirm that the company works with trusted custodians and IRS-approved depositories for secure storage. By focusing on reputation, transparency, support, and security, investors can confidently select a Gold IRA company that aligns with their long-term retirement goals.</span></p><p class=\"\"><span>Read this Free Gold IRA Guide on IRAEmpire</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gold IRA vs 401(k) in 2026: Which Is Better?</span></strong></p><p class=\"\"><span>A 401(k) primarily invests in stocks, bonds, and mutual funds. While it may offer employer matching contributions and strong long-term growth potential during bull markets, it remains closely tied to overall market performance. When equities decline due to recessions, interest rate hikes, or geopolitical instability, 401(k) balances can experience significant short-term losses. For younger investors with long time horizons, this volatility may be manageable. However, for those nearing retirement, large swings in portfolio value can create serious financial stress.</span></p><p class=\"\"><span>A Gold IRA, by contrast, holds physical precious metals stored in IRS-approved depositories. Instead of relying on corporate earnings or bond yields, gold derives value from global supply and demand dynamics and its long-standing reputation as a store of wealth. Historically, gold has often performed differently than stocks, sometimes rising during periods of market turbulence. This makes it an effective hedge against inflation and systemic financial risk.</span></p><p class=\"\"><span>Another key difference lies in asset ownership. A 401(k) contains paper-based assets, while a Gold IRA holds tangible bullion that cannot be printed or digitally inflated. That physical backing provides psychological and financial reassurance to many conservative investors.</span></p><p class=\"\"><span>In 2026, many retirement planners recommend a diversified strategy. Rather than choosing one over the other, investors often combine both accounts-leveraging employer matching and growth potential in a 401(k) while allocating a portion to a Gold IRA for stability and downside protection. This balanced approach can help create a more resilient retirement portfolio.</span></p><p class=\"\"><span>&gt;&gt;Find The Best Gold Investment Company of Your State Here.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>What Is a Gold IRA?</span></strong></p><p class=\"\"><span>A Gold IRA is a self-directed retirement account that allows investors to hold IRS-approved precious metals such as gold, silver, platinum, and palladium. Unlike traditional IRAs that typically contain stocks, bonds, and mutual funds, a Gold IRA gives investors access to physical, tangible assets within a tax-advantaged structure.</span></p><p class=\"\"><span>It follows the same tax rules as traditional and Roth IRAs but requires:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Approved metal purity standards (gold must be at least 99.5% pure)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Storage in IRS-approved depositories</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Use of a qualified custodian</span></p></li></ul><p class=\"\"><span>Because it is self-directed, investors have greater control over asset selection. However, they must follow strict IRS regulations regarding eligible coins and bars. Popular options often include American Gold Eagles, Canadian Maple Leafs, and approved gold bullion bars that meet federal standards.</span></p><p class=\"\"><span>One important rule to understand is that investors cannot personally store Gold IRA assets at home. All metals must be securely held in insured, IRS-approved vault facilities to maintain the account's tax-advantaged status.</span></p><p class=\"\"><span>Most investors fund Gold IRAs through rollovers from existing retirement accounts such as 401(k)s, 403(b)s, or traditional IRAs. A properly executed rollover avoids taxes and penalties while transferring funds into the new self-directed account.</span></p><p class=\"\"><span>For individuals seeking portfolio diversification, inflation protection, and long-term wealth preservation, a Gold IRA offers a structured way to add physical precious metals to retirement planning in 2026 and beyond.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Summary - Best Gold IRA Companies March 2026</span></strong></p><p class=\"\"><span>After reviewing leading providers, IRAEmpire's official March 2026 rankings are:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Augusta Precious Metals - Best Overall</span></strong></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Lear Capital - Best for Experience</span></strong></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Goldencrest Metals - Best Customer Service</span></strong></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Preserve Gold - Best for Beginners</span></strong></p></li></ul><p class=\"\"><span>Each of these companies offers reliable pathways to diversifying retirement savings with physical gold.</span></p><p class=\"\"><span>For most investors, </span><strong class=\"root-Tkn6WL2y\"><span>Augusta Precious Metals remains the top choice</span></strong><span> due to its transparency, education-first model, and strong industry reputation.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About IRAEmpire.com</span></strong></p><p class=\"\"><span>IRAEmpire.com provides independent research, rankings, and educational resources on Gold IRAs and precious metals investing. The platform is dedicated to helping Americans make informed, data-driven retirement decisions through transparent analysis and expert insights.</span></p><p class=\"\"><span>CONTACT:</span></p><p class=\"\"><span>Ryan Paulson</span></p><p class=\"\"><span>ryan@iraempire.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> IRAEmpire LLC</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSbBPcla:0/",
            "pub_date": "2026-03-01 07:00:02",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO0E8:0",
            "title": "OpenAI details layered protections in US defense department pact",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>OpenAI's deal with Pentagon includes additional safeguards</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>OpenAI's contract enforces three red lines for AI use</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Agreement prohibits AI use for autonomous weapons systems</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>OpenAI says opposes labeling Anthropic as a supply chain risk</span></li></ul></span></div><span><p class=\"\"><span>    OpenAI said on Saturday that the agreement it struck a day ago with the Pentagon to deploy technology on the U.S. defense department's classified network includes additional safeguards to protect its use cases.</span></p><p class=\"\"><span>        U.S. President Donald Trump on Friday directed the government to stop working with Anthropic, and the Pentagon said it would declare the startup a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown about technology guardrails. Anthropic said it would challenge any risk designation in court.</span></p><p class=\"\"><span>Soon after, rival OpenAI, which is backed by Microsoft </span><span>, Amazon </span><span>, SoftBank </span><span> and others, announced its own deal late on Friday.</span></p><p class=\"\"><span>    \"We think our agreement has more guardrails than any previous agreement for classified AI deployments, including Anthropic's,\" OpenAI said on Saturday.  </span></p><p class=\"\"><span>        The AI firm said that the contract with the Department of Defense, which the Trump administration has renamed the Department of War, enforces three red lines: OpenAI technology cannot be used for mass domestic surveillance, to direct autonomous weapons systems, or for any high-stakes automated decisions.</span></p><p class=\"\"><span>\"In our agreement, we protect our red lines through a more expansive, multi-layered approach. We retain full discretion over our safety stack, we deploy via cloud, cleared OpenAI personnel are in the loop, and we have strong contractual protections,\" OpenAI said.</span></p><p class=\"\"><span>The Pentagon signed agreements worth up to $200 million each with major AI labs in the past year, including Anthropic, OpenAI and Google. The Pentagon is seeking to preserve all flexibility in defense and not be limited by warnings from the technology's creators against powering weapons with unreliable AI.</span></p><p class=\"\"><span>    OpenAI cautioned that any breach of its contract by the U.S. government could trigger a termination, though it added, \"We don't expect that to happen.\"  </span></p><p class=\"\"><span>    The company also said rival Anthropic should not be labeled a “supply-chain risk,” noting, \"We have made our position on this clear to the government.\"  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO0E8:0-openai-details-layered-protections-in-us-defense-department-pact/",
            "pub_date": "2026-03-01 07:03:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0HR:0",
            "title": "Olivia Dean's 'The Art Of Loving' wins album of the year at BRITs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Singer Olivia Dean's record \"The Art Of Loving\" won album of the year at the BRIT Awards, Britain's pop music honours, on Saturday.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0HR:0-olivia-dean-s-the-art-of-loving-wins-album-of-the-year-at-brits/",
            "pub_date": "2026-03-01 06:34:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM5q8PgTa:0",
            "title": "YBS SA - Raport kwartalny za III kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_233939_0000001421_0000065223.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM2tfysa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_233939_0000001421_0000065224.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM1rrY7Ma\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM5q8PgTa:0-ybs-sa-raport-kwartalny-za-iii-kwarta/",
            "pub_date": "2026-03-01 06:39:50",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228003046:0",
            "title": "Drone warfare could mean investors need a new guidebook for this Iran conflict",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Joy Wiltermuth</span></p><p class=\"\"><span>Use of 'shoot and scoot' drone warfare could prolong Iran conflict, warns Papic at BCA Research</span></p><p class=\"\"><span>Smoke from a missile strike in central Tel Aviv, Israel on Saturday after joint Israel-U.S. strikes on Iran.</span></p><p class=\"\"><span>Investors should brace for a U.S.-Israel conflict with Iran that could be complicated by drone warfare, according to Marko Papic, chief strategist at BCA Research.</span></p><p class=\"\"><span>\"At this point, we are laser focused on the fulcrum question going forward: how effective are Iran's drones?\" Papic wrote, in a Saturday client note. \"In particular, how effective drones are in impairing production and transportation of crude via the Strait of Hormuz.\"</span></p><p class=\"\"><span>This matters because few alternatives exist for the oil-rich Middle East region to keep crude flowing to global markets without safe passage through the crucial Strait of Hormuz.</span></p><p class=\"\"><span>\"The alternatives to the Strait of Hormuz are paltry and rely on infrastructure - such as the Saudi East-West Crude Oil Pipeline and the Abqaiq-Yanbu NGL pipeline - that themselves could be targeted with drones,\" Papic wrote.</span></p><p class=\"\"><span>Wall Street's immediate focus has been on the conflict's potential to sweep up other countries in the Middle East or disrupt crude flow from the region, fears of which could push global (BRN00) crude prices to $100 a barrel.</span></p><p class=\"\"><span>See: Iran conflict raises talk of a return to $100-a-barrel oil</span></p><p class=\"\"><span>On the flip side, the shale revolution granted the U.S. energy independence in 2019, and since January it has been exerting control over Venezuela's oil.</span></p><p class=\"\"><span>Complicating the matter, there's some risk that drones costing only about $2,000 each could be used in a \"shoot and scoot\" fashion, threatening shipping in the Persian Gulf and other infrastructure in the region, according to Papic.</span></p><p class=\"\"><span>These \"small, mobile, independent units\" are far cheaper than U.S. interceptor missiles at $2 million each, he said. They also could operate for weeks, if not months, in Iran's mountainous coastline, even if \"communication with Tehran frays.\"</span></p><p class=\"\"><span>Conversely, with U.S. midterm elections \"just eight months away, the safe bet is not to expect this worst-case scenario,\" he said, noting that President Trump also could \"declare victory shortly, perhaps as soon as this coming week.\"</span></p><p class=\"\"><span>Trump on Saturday, in a social media post, said Iran's Supreme Leader Ali Khamenei had been killed in the operation, while urging \"Iranian people to take back their Country.\" He also said \"heavy and pinpointed bombing\" will continue as long as necessary, to achieve an objective of \"PEACE THROUGHOUT THE MIDDLE EAST AND, INDEED, THE WORLD!\"</span></p><p class=\"\"><span>The uncertain backdrop has Papic staying long Brent and U.S. crude (CL.1), but also oil equipment and services IEZ. He's also watching the Breakwave Tanker Shipping ETF BWET, the haven status of the U.S. Dollar Index DXY and Treasurys BX:TMUBMUSD10Y, as well as industrials, materials, energy stocks, copper (HG00) and other commodities.</span></p><p class=\"\"><span>Should copper, an industrial metal, start selling off, it could signal a shift in recent concerns from a \"tech rotation\" and software implosion in the U.S. stock market SPX DJIA to an outright recession, he said.</span></p><p class=\"\"><span>Finally,  Papic thinks the \"rotation out of tech will not be arrested by the conflict in the Middle East. It will be accelerated.\"</span></p><p class=\"\"><span>Read: Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign.</span></p><p class=\"\"><span>-Joy Wiltermuth</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228003046:0/",
            "pub_date": "2026-03-01 06:31:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO0EY:0",
            "title": "Market analysts react to US-Israel strikes on Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    The United States and Israel launched strikes on Iran on Saturday that President Donald Trump said killed Supreme Leader Ali Khamenei and which plunged the Middle East into a new conflict. </span></p><p class=\"\"><span>The strikes put nearby oil-producing Gulf Arab countries on edge as fears of escalation grew, and Tehran responded by launching missiles towards Israel. </span></p><p class=\"\"><span>Some oil majors and top trading houses suspended crude oil and fuel shipments via the Strait of Hormuz because of the attacks, four trading sources said on Saturday.    </span></p><p class=\"\"><span>QUOTES:</span></p><p class=\"\"><span>JORGE LEON, SENIOR VICE PRESIDENT AND HEAD OF GEOPOLITICAL ANALYSIS AT RYSTAD ENERGY:  </span></p><p class=\"\"><span>    \"Alternative infrastructure in the Middle East can be used to bypass the Strait’s flows, but the net impact remains an effective loss of 8-10 million bpd of crude oil supply,\" in a global market that uses about 100 million bpd.   </span></p><p class=\"\"><span>    \"Nations with strategic petroleum reserves may take action and release volumes if the disruption of the Strait risks being extended. Unless de-escalation signals emerge swiftly, we expect a significant upward repricing of oil at the start of the week.”  </span></p><p class=\"\"><span>ENERGY ANALYSTS AT EURASIA GROUP:</span></p><p class=\"\"><span>\"Oil prices will rise sharply when markets open. Should the conflict continue into Sunday, oil prices are likely to respond by increasing by $5-10 above the current $73 baseline, based on Iran's claim to have closed the Strait of Hormuz and the disruption in tanker traffic.\"</span></p><p class=\"\"><span>ENERGY ANALYSTS AT BARCLAYS:</span></p><p class=\"\"><span>\"Oil markets might have to face their worst fears on Monday. As things stand right now, we think Brent could hit $100 (per barrel), as the market grapples with the threat of a potential supply disruption amid a spiralling security situation in the Middle East.\"</span></p><p class=\"\"><span>VISHNU VARATHAN, HEAD OF MACRO RESEARCH, ASIA EX-JAPAN, MIZUHO, SINGAPORE:</span></p><p class=\"\"><span>\"A broader state of spots of regional attacks/instability may be par for the course - in line with Iran’s warning. Oil prices are likely to remain elevated as production and passage remain prone to attacks and disruptions. OPEC may be under pressure to raise production to try and offset. But a 10-25% premium on oil is not outlandish - even without a blockade of the Strait of Hormuz, which is easily a 50% premium risk event.\"</span></p><p class=\"\"><span>CHRISTOPHER WONG, STRATEGIST, OCBC, SINGAPORE:</span></p><p class=\"\"><span>\"The strike raises geopolitical risk premia as markets head into Monday’s open. The immediate reaction function is fairly predictable: safe-haven assets such as gold are likely to see an upside gap, while oil prices may also firm on supply-disruption concerns. Risk assets and high-beta currencies … could face an initial bout of volatility, particularly if headlines suggest potential retaliation or regional spillovers.\"</span></p><p class=\"\"><span>NICK FERRES, CIO, VANTAGE POINT ASSET MANAGEMENT, SINGAPORE:</span></p><p class=\"\"><span>\"Energy is still inexpensive. That’s the obvious sector that rallies on Monday. And gold.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO0EY:0-market-analysts-react-to-us-israel-strikes-on-iran/",
            "pub_date": "2026-03-01 06:36:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "beincrypto:c1f292459094b:0",
            "title": "Ethereum Holder Retention Rebounds From a 4-Year Low",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Ethereum price continues to trade in a sideways structure that reflects a gradual decline rather than stability. ETH has struggled to generate sustained upside momentum. The exit of new participants has weighed on sentiment, even as some long-term metrics show early signs of improvement.</span></p><p class=\"\"><span>This divergence creates a mixed outlook for Ethereum. While network growth has weakened, improving holder retention offers a counterbalance.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ethereum New Holders Dip</span></strong></p><p class=\"\"><span>Ethereum has seen a sharp decline in new addresses over the past several days. Daily new addresses fell nearly 36% within 48 hours, dropping from 298,000 to 191,000. This contraction pushed Ethereum’s Network Growth metric to a two-month low.</span></p><p class=\"\"><span>The slowdown has persisted since the beginning of the month. Fewer new participants reduce organic demand. Weak onboarding also signals hesitation among retail investors. This trend has added pressure to ETH price performance and contributed to cautious market sentiment.</span></p><p class=\"\"><span>Want more token insights like this? Sign up for Editor Harsh Notariya’s Daily Crypto Newsletter here.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:406.25px;max-width:1200px;aspect-ratio:2.9538461538461536\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-d7411d604cb08d07166af789af9d4d3a-resized.webp\" type=\"image/webp\"/><img alt=\"Ethereum New Addresses\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-d7411d604cb08d07166af789af9d4d3a-resized.webp\" style=\"background-color:#fdfdfd\"/></picture></div></button></figure><p class=\"\"><span>The Ethereum Holder Retention Rate provides deeper context that even though new holders are declining, the ones that are staying are staying for good. This metric tracks the percentage of addresses maintaining a balance across consecutive 30-day periods. It measures whether holders continue to retain ETH rather than exit positions.</span></p><p class=\"\"><span>The retention rate recently fell to 92.4%, marking a 4.5-year low and the weakest reading since September 2021. This decline confirmed wavering conviction among newer holders.</span></p><p class=\"\"><span>However, the metric has begun to improve modestly, suggesting renewed stability among participants. Rising retention can strengthen structural support if sustained.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-44eab25e399548f3179bddb2a226c46d-resized.webp\" type=\"image/webp\"/><img alt=\"Ethereum Holder Retention Rate\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-44eab25e399548f3179bddb2a226c46d-resized.webp\" style=\"background-color:#f7f7f8\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ETH Price Shows Potential To Bounce Back</span></strong></p><p class=\"\"><span>Ethereum is trading at $1,904 at the time of writing, holding above the $1,816 support level. While price action appears flat, a descending resistance line indicates a slow downtrend. Without stronger demand, ETH remains vulnerable to continued weakness.</span></p><p class=\"\"><span>The Chaikin Money Flow indicator offers cautious optimism. CMF has shifted into positive territory after a gradual uptrend. This movement signals improving capital inflows. Transitioning from outflows to inflows is essential for any sustained Ethereum price recovery.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:584.5479452054794px;max-width:1200px;aspect-ratio:2.0528683914510686\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-7d1bb4ed30cdc5af2589d072941c7a38-resized.webp\" type=\"image/webp\"/><img alt=\"ETH CMF\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-7d1bb4ed30cdc5af2589d072941c7a38-resized.webp\" style=\"background-color:#fcfdfc\"/></picture></div></button></figure><p class=\"\"><span>If inflows continue and support holds, Ethereum could rebound from $1,816 and attempt a move toward $2,165. A breakout above this resistance would invalidate the current downtrend line. Such a shift would likely restore investor confidence and reinforce bullish momentum.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:584.5479452054794px;max-width:1200px;aspect-ratio:2.0528683914510686\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-9e5d204eb7bb360a2ff9d66f2e542881-resized.webp\" type=\"image/webp\"/><img alt=\"ETH Price Analysis. \" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/beincrypto:c1f292459094b-9e5d204eb7bb360a2ff9d66f2e542881-resized.webp\" style=\"background-color:#f7f6f6\"/></picture></div></button></figure><p class=\"\"><span>However, failure to maintain positive capital flow would undermine this outlook. A breakdown below $1,816 would invalidate the recovery thesis. In that scenario, Ethereum price could slide toward $1,600, increasing downside risk and reinforcing bearish control across the broader crypto market.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/beincrypto:c1f292459094b:0-ethereum-holder-retention-rebounds-from-a-4-year-low/",
            "pub_date": "2026-03-01 05:28:04",
            "source": "Beincrypto",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:6951008fe094b:0",
            "title": "TEXT of President Trump's Truth Social post that Iran Supreme Leader Ayatollah Ali Khamenei has been killed",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>\"Khamenei, one of the most evil people in History, is dead. This is not only Justice for the people of Iran, but for all Great Americans, and those people from many Countries throughout the World, that have been killed or mutilated by Khamenei and his gang of bloodthirsty THUGS. He was unable to avoid our Intelligence and Highly Sophisticated Tracking Systems and, working closely with Israel, there was not a thing he, or the other leaders that have been killed along with him, could do. This is the single greatest chance for the Iranian people to take back their Country. We are hearing that many of their IRGC, Military, and other Security and Police Forces, no longer want to fight, and are looking for Immunity from us. As I said last night, “Now they can have Immunity, later they only get Death!” Hopefully, the IRGC and Police will peacefully merge with the Iranian Patriots, and work together as a unit to bring back the Country to the Greatness it deserves. That process should soon be starting in that, not only the death of Khamenei but the Country has been, in only one day, very much destroyed and, even, obliterated. The heavy and pinpoint bombing, however, will continue, uninterrupted throughout the week or, as long as necessary to achieve our objective of PEACE THROUGHOUT THE MIDDLE EAST AND, INDEED, THE WORLD!</span></p><p class=\"\"><span>Thank you for your attention to this matter.</span></p><p class=\"\"><span>PRESIDENT DONALD J. TRUMP\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/macenews:6951008fe094b:0-text-of-president-trump-s-truth-social-post-that-iran-supreme-leader-ayatollah-ali-khamenei-has-been-killed/",
            "pub_date": "2026-03-01 05:59:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "marketindex:ca4e46056094b:0",
            "title": "Weekend Wrap: February Done and Dusted",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span> Hi there! This article is an excerpt from our weekend newsletter - which talks all things markets plus some interesting data insights and memes </span></p><p class=\"\"><span>Join 100,000+ readers receiving the Newsletter every Sunday morning - Register here. It's free. </span></p><p class=\"\"><span>Goodbye Reporting Season</span></p><p class=\"\"><span>Hi there!</span></p><p class=\"\"><span>Phew. Reporting season has finally come to an end. It’s certainly been a tough one, I wouldn’t be surprised if analysts call it the most volatile one on record when they’re done crunching the numbers.</span></p><p class=\"\"><span>But overall, its been a pretty good one – The Big Four Banks broadly beat expectations (decent growth, costs in-line, low impairments), Telstra rallied on a generous dividend and upsized buyback, BHP is running hot after copper grew to &gt;50% of earnings, Utilities (AGL and Origin) rallied like 9% over three days and are now within 3% of all-time highs, and Energy stocks (Woodside and Santos) are set to ramp up some pretty big projects (Scarborough, Barossa, Pikka etc). Of course, there were plenty of hiccups, mostly in Tech, Healthcare and Discretionary, but in aggregate, some very strong numbers. I guess that market's also relaying that feedback, with the ASX 200 recording three straight all-time highs.</span></p><p class=\"\"><span>Let’s dive in.</span></p><p class=\"\"><span>Investor sentiment survey</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:511.2px;max-width:1200px;aspect-ratio:2.347417840375587\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-4cd4f35b127c98cb3bcc550ff9afad4f-resized.webp\" type=\"image/webp\"/><img alt=\"Investor sentiment survey\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-4cd4f35b127c98cb3bcc550ff9afad4f-resized.webp\" style=\"background-color:#d9c7bd\"/></picture></div></button></figure><p class=\"\"><span>Bulls jumped to the highest since 2-Nov, and just in time for this week's streak of all-time highs.</span></p><p class=\"\"><span>Over the next three months, do you expect the Australian stock market to be:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Bullish</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Neutral</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Bearish</span></p></li></ul><p class=\"\"><span>Woolworths vs. Coles</span></p><p class=\"\"><span>Well, well, well. How the tables have turned. Woolies ripped 12.9% on results day (largest one-day rally on record), while Coles, which reported a few days later, tanked more than 7%.</span></p><p class=\"\"><span>For context, Woolworths has dramatically underperformed Coles in the past 2 years. From October 2023 to January 2026, Woolworths declined ~20% while Coles rallied ~45%.</span></p><p class=\"\"><span>Woolies reported a clean 1H26 beat and upgraded its full-year guidance towards the upper end of mid-to-high single digit growth. </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue up 3.4% to $37.14bn vs. $37.21bn ests (in-line)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NPAT ex-items up 16.4% to $859m vs. $798.3m ests (8% beat)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Interim dividend up 15.4% to 45 cps vs. 43 cps ests (4.6% beat)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY26 EBIT growth now expected at the upper end of the mid-to-high single digit range</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Australian Food sales tracking up 5.8% (7.2% ex-tobacco) in the first seven weeks of 2H26</span></p></li></ul><p class=\"\"><span>Coles’ result wasn’t disastrous, but given its outperformance relative to Woolies, an in-line result was simply not good enough.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue up 2.5% to $23.6bn vs. $23.7bn ests (0.4% miss)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NPAT up 12.5% to $676m ex-items vs. $678.6m ests (in-line)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Interim dividend of 41 cps vs. Morgans ests of 41 cps (in-line)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Supermarket sales revenue up 3.7% (5.3% ex-tobacco) in the first seven weeks of 2H26</span></p></li></ul><p class=\"\"><span>The other thing was the first seven weeks update – where Woolies was tracking well-ahead at 5.8% vs. Coles’ 3.7% (in previous reporting seasons, it was the opposite).</span></p><p class=\"\"><span>This leaves us at an interesting juncture. The below chart shows the Woolworths-to-Coles share price ratio (it’s basically Woolies divided by Coles). Since 2019, this ratio sat around the low 2s but spiraled to 1.1 by October of 2025. During this time, Woolies battled a broad range of challenges including poor performances from Big W and New Zealand supermarkets, a 17-day union strike in December 2024, the Petstock acquisition and more.</span></p><p class=\"\"><span>But perhaps nature is healing, with the ratio now V-shaping its way back towards a two handle.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:570px;max-width:1200px;aspect-ratio:2.1052631578947367\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-8d48cdfdbda0ae373f47bfa8997a9336-resized.webp\" type=\"image/webp\"/><img alt=\"Woolworths vs. Coles\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-8d48cdfdbda0ae373f47bfa8997a9336-resized.webp\" style=\"background-color:#ecf1fb\"/></picture></div></button></figure><p class=\"\"><span>Monadelphous whipsaw</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1043.4782608695652px;aspect-ratio:1.7391304347826089\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-e1a3857e67b6e4430ac1adc2e4ec5d68-resized.webp\" type=\"image/webp\"/><img alt=\"Monadelphous whipsaw\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-e1a3857e67b6e4430ac1adc2e4ec5d68-resized.webp\" style=\"background-color:#f7f8f8\"/></picture></div></button></figure><p class=\"\"><span>Monadelphous had one of the most wild price moves during reporting season – on results day (24-Feb), the stock opened 10.4% higher, rallied as much as 20.4% but finished the session up just 5.9%.</span></p><p class=\"\"><span>To set the scene – MND had already run ~88% in the twelve months prior to the results day and that move far outpaces earnings growth (FY24 and FY25 NPAT up 16% and 34.6%). The stock’s price-to-earnings has soared from 2024-25 levels of around 23x to 30x.</span></p><p class=\"\"><span>The price action had something for everyone – rewarding a truly strong result (NPAT and dividend beat ests by 15% and 8% respectively, also guided to above consensus growth), but punishing what became an overbought stock trading at an elevated multiple.</span></p><p class=\"\"><span>The next day, MND was swamped by downgrades from Morgans, Jarden, E&amp;P, Macquarie and more (pretty much all from Buy to Hold) but target price upgrades across the board. As such, the stock dipped 5.5%.</span></p><p class=\"\"><span>And in a funny turn of events, it rallied 5.7% the session after. Truly, a battle of bulls and bears.</span></p><p class=\"\"><span>Wow look at BHP go</span></p><p class=\"\"><span>BHP recorded seven straight all-time highs through to Friday. Seeing the market’s largest stock rally almost 15% in less than two weeks is truly extraordinary (and great for our Super accounts).</span></p><p class=\"\"><span>But during this time, both copper and iron ore prices have traded relatively flat. So what gives? There’s probably a few factors in play, so in no particular order:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Commodities and equities play risk on-and-off all the time. For example, the All Ords Gold Index hit a fresh all-time high on Friday, despite gold still trading around 4.2% (or ~$220/oz) away from its 28-Jan all-time high. Sometimes, its more about commodity prices showing that they’re not going lower/hold up – and that’s enough for equities to grind higher</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>To the above point, most analysts model miners with very conservative commodity price assumptions (e.g. Macquarie’s 18-Feb BHP note assumes FY27 iron ore prices of US$93/t and copper at US$4.77/lb). If prices just moved sideways, that’s probably enough for miners to grind higher</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The HALO trade (or commodity supercycle, whatever you’d like to call it). This acronym has started to make headlines, it stands for heavy assets, low obsolescence risk</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>We noted the below chart from BHP’s 1H26 results presentation last week. BHP is effectively trying to pitch for a higher valuation, with the argument that copper as a percentage of EBITDA has soared from ~20% to ~50% in the last three years</span></p></li></ul><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:810.134128166915px;aspect-ratio:1.3502235469448585\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-b6d4e1e212b139b04621ebefafe8961b-resized.webp\" type=\"image/webp\"/><img alt=\"Wow look at BHP go\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-b6d4e1e212b139b04621ebefafe8961b-resized.webp\" style=\"background-color:#fafafa\"/></picture></div></button></figure><p class=\"\"><span>What’s holding AI back?</span></p><p class=\"\"><span>US earnings season is also coming to an end, with Q4 earnings growth sitting at 14.2% vs. 8.3% consensus. I guess we're all eating good? </span></p><p class=\"\"><span>One of the more interesting conversations that have emerged is about AI bottlenecks, to which key executives have flagged:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Jensen Huang (Nvidia): power generation and grid capacity</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Lip-Bu Tan (Intel): memory shortage, specifically High Bandwidth Memory</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Lisa Su (AMD): scaling massive data centres within existing power limits</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Elon Musk (Tesla): the electrical grid growing too slowly</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Satya Nadella (Microsoft): fully permitted buildings with power already connected</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mark Zuckerberg (Meta): securing raw power before competitors do</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Andy Jassy (Amazon): decade-long wait times for grid connections</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Sundar Pichai (Alphabet): local building permits and a lack of electricians</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Michael Dell (Dell): customers lacking sufficient office power and liquid cooling</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Larry Ellison (Oracle): the need for gigawatt-scale power plants</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>C.C. Wei (TSMC): sold-out machines for advanced chip packaging</span></p></li></ul><p class=\"\"><span>Last laughs</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:423px;aspect-ratio:0.705\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-fed3d35ed20465db164f7c0ecafbb94f-resized.webp\" type=\"image/webp\"/><img alt=\"Last laughs\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/marketindex:ca4e46056094b-fed3d35ed20465db164f7c0ecafbb94f-resized.webp\" style=\"background-color:#edeee9\"/></picture></div></button></figure><p class=\"\"><span>AI is getting out of hand. Someone in the US is using it to send lowball offers on Zillow (and stressing out homeowners).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/marketindex:ca4e46056094b:0-weekend-wrap-february-done-and-dusted/",
            "pub_date": "2026-03-01 06:00:00",
            "source": "Market Index",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:f27b82130094b:0",
            "title": "PRESIDENT TRUMP POSTS THAT IRAN SUPREME LEADER AYATOLLAH ALI KHAMENEI AND OTHER TOP OFFICIALS HAVE BEEN CONFIRMED KILLED",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/macenews:f27b82130094b:0-president-trump-posts-that-iran-supreme-leader-ayatollah-ali-khamenei-and-other-top-officials-have-been-confirmed-killed/",
            "pub_date": "2026-03-01 05:52:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM7KVHnga:0",
            "title": "YBS SA - Raport kwartalny za II kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_224708_0000001420_0000065219.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM6zyNYNa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_224708_0000001420_0000065220.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM49xbFGa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM7KVHnga:0-ybs-sa-raport-kwartalny-za-ii-kwarta/",
            "pub_date": "2026-03-01 05:47:19",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:1d4bd486f094b:0",
            "title": "Anthropic CEO responds to Pentagon order prohibiting military use",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The CEO of AI company Anthropic, Dario Amodei, has responded to the United States Department of Defense and the White House, ordering military defense contractors that do business with the Department of Defense to stop using Anthropic’s products.</span></p><p class=\"\"><span>Anthropic objected to the use of its AI models for mass domestic surveillance and fully autonomous weapons that can fire without any human input, Amodei told CBS on Saturday. </span></p><p class=\"\"><span>He added that Anthropic was fine with all of the US government’s proposed use cases for its AI models, except for surveillance and fully autonomous weapons platforms. He said:</span></p><div class=\"blockquote-xrkxvh37\"><span>“These are things that are fundamental to Americans: the right, not to be spied on by the government, the right for our military officers to make decisions about war, themselves, and not turn it over completely to a machine.” </span></div><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:867.0520231213874px;aspect-ratio:1.4450867052023122\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:1d4bd486f094b-7e1a3de7f1ece664ddf8bfe5cf884a95-resized.webp\" type=\"image/webp\"/><img alt=\"US Government, United States\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:1d4bd486f094b-7e1a3de7f1ece664ddf8bfe5cf884a95-resized.webp\" style=\"background-color:#493323\"/></picture></div></button></figure><p class=\"\"><span>The decision by the Defense Department to label Anthropic as a “supply chain risk,” meaning that military contractors cannot use Anthropic’s products on defense contracting work, is “unprecedented” and “punitive,” he added. </span></p><p class=\"\"><span>Amodei later clarified that he is not against the development of fully automated weapons if foreign militaries begin using them in the future, but that AI is not yet reliable enough to function autonomously in a military setting.</span></p><p class=\"\"><span>The law has not caught up to the rapidly developing AI sector, Amodei said, calling on the United States Congress to pass “guardrails” to prevent the use of AI in domestic mass surveillance programs. </span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><em><strong class=\"root-Tkn6WL2y\"><span>Anthropic says it's been targeted in massive distillation attacks</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>OpenAI wins a defense contract after US officials label Anthropic a supply chain risk </span></strong></p><p class=\"\"><span>On Friday, US “Secretary of War” Pete Hegseth announced that Anthropic is a “Supply-Chain Risk to National Security.” </span></p><p class=\"\"><span>“Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic,” he said. </span></p><p class=\"\"><span>Hours later, rival AI company OpenAI accepted a contract with the US Defense Department to deploy its AI models across military networks.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:408.18181818181813px;aspect-ratio:0.6803030303030303\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:1d4bd486f094b-7f2881975e21b7fc68240e6b2fcf98dd-resized.webp\" type=\"image/webp\"/><img alt=\"US Government, United States\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:1d4bd486f094b-7f2881975e21b7fc68240e6b2fcf98dd-resized.webp\" style=\"background-color:#171717\"/></picture></div></button></figure><p class=\"\"><span>The announcement of the deal from OpenAI CEO Sam Altman drew online backlash from critics, who cited AI being used for mass domestic surveillance and undermining individual privacy as a red line. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:1d4bd486f094b:0-anthropic-ceo-responds-to-pentagon-order-prohibiting-military-use/",
            "pub_date": "2026-03-01 05:48:33",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000971:0",
            "title": "Berkshire Hathaway's CEO Suggests These 4 Companies Are Forever Stocks — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Andrew Bary</span></p><p class=\"\"><span>Charlie Munger ran the equity portfolio now worth about $500 million at Daily Journal, a public legal services company, for decades — and the company essentially decided to leave it alone after Munger's death in late 2023.</span></p><p class=\"\"><span>Berkshire Hathaway may be doing the same thing with most of its roughly $300 billion equity portfolio after Warren Buffett stepped down from the CEO role at the end of 2025. Munger was Berkshire's vice chairman and a longtime business partner of Berkshire CEO Warren Buffett, in addition to chairing Daily Journal for decades.</span></p><p class=\"\"><span>In his inaugural shareholder letter released Saturday morning, Berkshire CEO Greg Abel identified four large Berkshire equity investments — Apple, American Express, Coca Cola and Moody's — and suggested they are forever stocks, or close to it.</span></p><p class=\"\"><span>Referring to the four companies, Abel wrote they are businesses \"we understand well, have a high regard for their leaders, and expect will compound over decades. This concentrated approach will continue, with limited activity in these holdings, though we may significantly adjust a holding if we see fundamental changes in its long-term economic prospects.\"</span></p><p class=\"\"><span>These stocks make up more than half of Berkshire's equity portfolio, and Abel also put Berkshire's stakes in five Japanese trading companies worth $35 billion in the same bucket. Together, these nine stocks comprise two-thirds of the portfolio.</span></p><p class=\"\"><span>Abel added that Berkshire had \"meaningful positions in a small number of other companies\" where \"capital allocation has been more dynamic\" and that they could become part of Berkshire's \"core holdings.\"</span></p><p class=\"\"><span>It's notable that two of Berkshire's top five equity investments, Bank of America and Chevron, didn't make that core holdings list. Berkshire has cut its holding in Bank of America roughly in half to 517 million shares worth about $28 billion in the past 18 months. The Chevron stake totals about $20 billion.</span></p><p class=\"\"><span>Berkshire has held its Coke and American Express stake for 40 years or more, and its Moody's stake for more than 20 years. Those are widely viewed as forever stocks by Berkshire watchers, due in part to a super-low cost basis. Berkshire paid an average of $3 a share for Coke in the late 1980s, compared with the stock's $81, a record close, on Friday.</span></p><p class=\"\"><span>The Apple stake is about a decade old. Buffett has cut it by about 80% from its peak a few years ago to 227 million shares at year-end 2025.</span></p><p class=\"\"><span>Abel's statement suggests that the Apple stake will not be reduced further. Berkshire's cost basis in its Apple stake is about $27 a share, about a tenth of the current share price of $264. Berkshire's original cost basis on its stake of one billion shares was around $35 a share, but the company appears to have sold higher-cost basis stock to reduce its big tax bill from its Apple sales, mostly in 2024.</span></p><p class=\"\"><span>The day-to-day management of the Berkshire equity portfolio remains unclear based on Abel's comments in the letter.</span></p><p class=\"\"><span>Abel wrote that \"responsibility ultimately rests with me as CEO.\" Abel, however, has no experience as a portfolio manager, and has a full plate running Berkshire's 50-plus subsidiaries. Buffett has said that lack of formal investment experience doesn't matter, arguing that if a person can evaluate businesses as well as Abel can, he can pick stocks.</span></p><p class=\"\"><span>Abel wrote that Buffett would be in the office five days a week and \"be available\" to consult on capital allocation, including equity investments.</span></p><p class=\"\"><span>Ted Weschler, who is about 64, has been investment manager at Berkshire since 2012. He and Todd Combs, who left Berkshire in December for an investment position at J.P. Morgan, had each run an estimated 5% of the equity portfolio, with Buffett handling the rest.</span></p><p class=\"\"><span>It had been expected that Weschler would play a much greater role with the portfolio after Buffett's retirement as CEO. But Abel wrote that Weschler would manage 6% of the investments, including a part of what Combs had run — not much changed from what he ran before.</span></p><p class=\"\"><span>This is a different set-up than what Berkshire s tated when it hired Weschler in 2011. \"After Mr. Buffett no longer serves as CEO, Todd and Ted — possibly aided by one additional manager — will have responsibility for the entire equity and debt portfolio of Berkshire, subject to overall direction by the then-CEO and Board of Directors,\" according to the 2011 press release.</span></p><p class=\"\"><span>Abel wrote in his letter that \"equity investments are fundamental to our capital allocation activities.\" But it's not clear who will be making big stock-picking decisions. Some Berkshire watchers think that Abel will deemphasize equity investing as CEO.</span></p><p class=\"\"><span>That remains to be seen, but the lack of a day-to-day portfolio manager responsible for the entire portfolio — and Abel's suggestion about forever stocks — suggest that new equity investments may not be a big future source of value creation at Berkshire.</span></p><p class=\"\"><span>That would be notable, since Buffett built Berkshire in its early decades from successful stock investments.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000971:0/",
            "pub_date": "2026-03-01 05:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000008:0",
            "title": "Berkshire Hathaway Operating Earnings Fell 30% in Fourth Quarter. There Were No Stock Buybacks. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Andrew Bary</span></p><p class=\"\"><span>Berkshire Hathaway's operating profits after taxes fell 30% in the fourth quarter to $10.2 billion, depressed by a drop of more than 50% in insurance underwriting profits and lower insurance investment income.</span></p><p class=\"\"><span>The company bought back none of its own stock in the period, continuing a trend that began in May 2024.</span></p><p class=\"\"><span>Berkshire's cash and equivalents stood at $373 billion at the end of 2025, down from a peak of $381 billion at the end of September.</span></p><p class=\"\"><span>Adjusting for the timing of some Treasury bill purchases at the end of the third quarter, Berkshire's cash levels were higher at year-end than on Sept. 30.</span></p><p class=\"\"><span>Berkshire took a non-cash writedown of its equity stake in Kraft Heinz of $4.5 billion in the fourth quarter, capping a total of $8.3 billion of writedowns on that equity stake during 2025. Berkshire was carrying the 27% stake in Kraft Heinz at $8.6 billion at year-end 2025. That's close to the current market value of around $8 billion. The writedowns reflected the weakness in Kraft stock during 2025, when it fell about 20%.</span></p><p class=\"\"><span>Berkshire filed earlier this year to potentially sell some or all of that Kraft interest, but has not made any sales yet.</span></p><p class=\"\"><span>Berkshire's operating earnings after taxes per share fell 30% to about $7,093 per class A share in the fourth quarter relative to the year-earlier period. That fell well short of the FactSet consensus of $8,400 per A share.</span></p><p class=\"\"><span>The lack of stock buybacks in the fourth quarter is a mild disappointment to Berkshire investors, but not a surprise. Analysts hadn't expected the company to repurchase shares during Warren Buffett's final three months as CEO. He was succeeded at the start of 2026 by Greg Abel, while Buffett remains chairman.</span></p><p class=\"\"><span>Berkshire also wasn't a buyer of its stock during January, Barron's calculates, based on the share count on Jan. 31 disclosed in Berkshire's 10-K report released Saturday. There were about 1.438 million shares of class A equivalent shares outstanding at year-end with class B shares converted to an equivalent amount of class A stock. Only about 35% of Berkshire's stock is now in the original class A shares.</span></p><p class=\"\"><span>The lack of stock buybacks indicates that the company doesn't view the stock as cheaply valued; Berkshire will repurchase its shares when it views them trading as a discount to the stock's intrinsic value \"conservatively determined,\" Abel said in his shareholder letter released Saturday morning.</span></p><p class=\"\"><span>Berkshire's book value rose about 3% during the fourth quarter to about $499,000 per class A share, Barron's calculates. Berkshire stock now trades for about 1.5 times year-end 2025 book value, in line with its average price/book ratio in the past few years.</span></p><p class=\"\"><span>Berkshire's total after-tax earnings in the fourth quarter were down about 2% to $19.2 billion. That figure reflects both operating income of Berkshire's businesses, and investment gains, mostly unrealized.</span></p><p class=\"\"><span>Berkshire chairman Buffett tells investors to focus on the operating profits, due to variability of investment gains from quarter to quarter.</span></p><p class=\"\"><span>The drop in Berkshire's fourth-quarter operating profits is somewhat overstated, because the company includes in operating earnings non-cash currency swings mostly related to the company's yen-denominated debt that funds its equity ownership of five Japanese trading companies. Adjust for the currency swings, and the drop in earnings was about 28%. There were about $600 million of currency gains in the fourth quarter against $1.2 billion in the year-earlier period. Berkshire generates those non-cash gains when the dollar rises relative to the Japanese yen.</span></p><p class=\"\"><span>What Berkshire calls other income, which includes the currency swings, was down to $159 million in the fourth quarter from $1.8 billion in the prior period. Strip out the other incom, and operating profits after taxes would have been down about 20% year over year, Barron's calculates.</span></p><p class=\"\"><span>Insurance underwriting results fell 54% to $1.6 billion in the fourth quarter.</span></p><p class=\"\"><span>Insurance investment income was down 25% to $3.1 billion in the period. The decline in insurance investment income overstates the drop in Berkshire's total investment income, because the company has shifted a significant chunk of investments to the parent company from the insurance units.</span></p><p class=\"\"><span>The parent company had about $127 billion of cash and equivalents at year-end 2025, up from around $96 billion a year earlier. Having cash at the parent company gives Berkshire more financial flexibility, since insurance regulators can limit cash that can be upstreamed from insurance units.</span></p><p class=\"\"><span>Berkshire's parent-company investment income roughly doubled in the fourth quarter to $927 million.</span></p><p class=\"\"><span>Berkshire held a total of $321 billion of Treasury bills at year-end 2025, making it one of the largest holders in the world.</span></p><p class=\"\"><span>Earnings at the Burlington Northern Santa Fe railroad rose 7% to more than $1.3 billion in the period, while profits after taxes at Berkshire Hathaway Energy, the company's big utility unit, were down 5% in the fourth quarter to $691 million. Profits rose 3% to $3.4 billion at the company's diversified manufacturing service and retailing segment.</span></p><p class=\"\"><span>Insurance float stood at $176 billion at year-end, up $5 billion during 2025.</span></p><p class=\"\"><span>Berkshire was a net seller of stocks for the third straight year in 2025, as Buffett and his investment managers Ted Weschler and Todd Combs (Combs left Berkshire in December) found few major opportunities. The company was a net seller in the fourth quarter of about $3.5 billion of equities, selling $7 billion and buying $3.5 billion.</span></p><p class=\"\"><span>For the year, Berkshire was a net seller of about $14 billion of stocks in 2025, $134 billion in 2024 (when it unloaded much of its Apple equity stake) and $24 billion in 2023, Barron's calculates based on data in the 10-K released Saturday.</span></p><p class=\"\"><span>Berkshire's equity portfolio stood at about $298 billion at year-end, and more than $315 billion when including the company's equity interests in Kraft Heinz and Occidental Petroleum.</span></p><p class=\"\"><span>Berkshire's class A shares finished Friday at $757,000 and the class B stock at $504.95. The A shares are up 0.3% so far in 2026, slightly behind the S&amp;P 500 index's total return of about 0.6%.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000008:0/",
            "pub_date": "2026-03-01 05:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:59ff2e7b7094b:0",
            "title": "APEX Tech Acquisition Inc. Announces Closing of Initial Public Offering, Including Partial Exercise of Overallotment Option",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>New York, New York, Feb. 28, 2026 (GLOBE NEWSWIRE) -- </span></strong><span> APEX Tech Acquisition Inc., a blank check company incorporated in the Cayman Islands as an exempted company (the “Company”), today announced the closing of its initial public offering of 11,197,131 units, including partial exercise of an over-allotment option, at $10.00 per unit for aggregate gross proceeds to the Company of $111,971,310. The units began trading on The New York Stock Exchange (“NYSE”) on February 26, 2026 under the ticker symbol “TRADU.” Each unit consists of one ordinary share and one right to receive one-fourth (1/4) of one ordinary share upon the consummation of an initial business combination. Once the securities comprising the units begin separate trading, the ordinary shares and the rights are expected to be traded on NYSE under the symbols “TRAD” and “TRADR,” respectively.</span></p><p class=\"\"><span>A.G.P./Alliance Global Partners acted as the sole book-running manager for the offering.</span></p><p class=\"\"><span>Venture Bridge Legal served as the U.S. counsel to the Company and Robinson &amp; Cole LLP served as the U.S. counsel to the representative of the underwriters in this offering.</span></p><p class=\"\"><span>A registration statement on Form S-1 relating to the securities, as amended (File No. 333-291936) was previously filed with the Securities and Exchange Commission (\"SEC\") and declared effective on February 25, 2026. This offering was made only by means of a prospectus forming part of the effective registration statement. Copies of the final prospectus may be obtained on the SEC’s website at http://www.sec.gov. Electronic copies of the prospectus may be obtained from A.G.P./Alliance Global Partners, 590 Madison Avenue, 28th Floor, New York, NY 10022, or by telephone at (212) 624-2060, or by email at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=J_Q4Po7I2AMI6PbAKY017JwCpM9Pax0vggFUM-CCKK12Jtzcxd5tX8TjavjByZ2BSWi6ous0LH1yfY2rglPP2w1Y3CcR6dkOaoQf9fGUE4EHGw7dfyUkpymtEAM55its\" rel=\"nofollow\" target=\"_blank\">prospectus@allianceg.com</a><span>.</span></p><p class=\"\"><em><span>This press release shall not constitute an offer to sell or a solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction. No securities regulatory authority has either approved or disapproved of the contents of this press release.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About APEX Tech Acquisition Inc.</span></strong></p><p class=\"\"><span>The Company is a blank check company incorporated in the Cayman Islands as an exempted company with limited liability for the purpose of effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. The Company intends to conduct a search for target businesses without being limited to a particular industry.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Statements</span></strong></p><p class=\"\"><span>This press release contains statements that constitute “forward-looking statements,” including with respect to the initial public offering, the underwriters’ exercise of over-allotment option, the anticipated use of the net proceeds thereof and the Company’s search for an initial business combination. No assurance can be given that the offering discussed above will be completed on the terms described, or at all, or that the net proceeds of the offering will be used as indicated. Forward-looking statements are subject to numerous conditions, many of which are beyond the control of the Company, including those set forth in the Risk Factors section of the Company’s registration statement and preliminary prospectus for the IPO filed with the SEC. Copies are available on the SEC’s website, </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=9wo0ti-rOy8-V3lXuWwkRcy_5HtrwciGfC53AV7eUK9mxFEvM2zEe5o_uiAk6vDqvEw1PDn9_3EsR8mB4rg0KQ==\" rel=\"nofollow\" target=\"_blank\">www.sec.gov</a><span>.The Company undertakes no obligation to update these statements for revisions or changes after the date of this release, except as required by law.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact: </span></strong></p><p class=\"\"><span>APEX Tech Acquisition Inc.</span></p><p class=\"\"><span>Attn:S</span><span>haoren Liu</span></p><p class=\"\"><span>E-mail: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=nDj_uV-JLspdxI2DCGHevevN1g-26ZUol6EVhaVX4T4Ol8xeW3Vh9GeLxAKLi9104wELSQz0FN-mL37kujH9pF7aTPyg8IDadI0a3MOceN8wmnhs0kURdIbq4heEF5EN\" rel=\"nofollow\" target=\"_blank\">shaoren@apextech-inc.com</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:59ff2e7b7094b:0-apex-tech-acquisition-inc-announces-closing-of-initial-public-offering-including-partial-exercise-of-overallotment-option/",
            "pub_date": "2026-03-01 05:23:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000964:0",
            "title": "Iran Strikes Could Make Fed Rate Cuts Even Less Likely — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Nicole Goodkind</span></p><p class=\"\"><span>The U.S. and Israeli strikes on Iran Saturday may jolt oil markets on Sunday evening. They could also dim the odds of Federal Reserve rate cuts this year.</span></p><p class=\"\"><span>Crude settled at $72.87 a barrel before the attacks. When trading resumes, prices are expected to rise as investors assess the risk to global supply, particularly through the Strait of Hormuz, which carries roughly one-fifth of the world's oil and liquefied natural gas.</span></p><p class=\"\"><span>Oil is likely to move higher when Asian markets open, with investors likely shifting toward dollar-denominated assets in the early phase of the conflict, said Joe Brusuelas, chief economist at RSM. If crude climbs and stays elevated, gasoline prices will likely follow.</span></p><p class=\"\"><span>Patrick De Haan, head of petroleum analysis at GasBuddy, said the national average gasoline price, now around $3 per gallon, could rise to roughly $3.10 to $3.15 in the coming weeks if crude remains elevated. For the Fed, that increase arrives at a sensitive moment.</span></p><p class=\"\"><span>Inflation has run above the central bank's 2% target for nearly five years — and tariff-related costs are beginning to work their way to the consumer, increasing prices. Services inflation has proved sticky, and markets have steadily scaled back expectations for rate cuts in 2026 as progress toward a 2% inflation rate has slowed.</span></p><p class=\"\"><span>Energy is excluded from the core personal consumption expenditures index, the Fed's preferred gauge of inflation. Policymakers also often argue that monetary policy shouldn't respond to volatile swings in oil — but that approach is easier to defend when inflation is low and expectations are stable.</span></p><p class=\"\"><span>Today, expectations are more fragile and gasoline prices remain one of the most visible costs for households.</span></p><p class=\"\"><span>After years of elevated inflation, another price hike at the pump risks reinforcing the perception that price pressures are becoming entrenched. If inflation stays around 3%, the dovish argument for easing becomes harder to make.</span></p><p class=\"\"><span>That could strengthen the hand of more hawkish Fed officials, who have warned against cutting rates prematurely. A majority of policymakers have already signaled that they want clearer evidence that inflation is returning to the central bank's target rate before supporting any shift toward easier policy. A sustained rise in oil would give them additional cover to wait.</span></p><p class=\"\"><span>Investors have begun adjusting and have pared back expectations for rate cuts beginning in June, according to the CME FedWatch tool.</span></p><p class=\"\"><span>Still, there's an argument to be made as higher oil prices tend to weigh on economic growth by squeezing household budgets and raising business costs. Energy functions like a tax, reducing discretionary spending and compressing margins. A large enough move could slow activity and cool demand-driven inflation.</span></p><p class=\"\"><span>Pressure on inflation, plus a potential drag on growth, complicate the Fed's calculus. Responding too quickly to higher energy costs could cause too much tightening. Ignoring them could mean that inflation expectations drift higher.</span></p><p class=\"\"><span>Policymakers may not reference Iran directly in their March statement, but they may acknowledge heightened geopolitical uncertainty and risks tied to energy prices.</span></p><p class=\"\"><span>The situation differs from 2022, when Russia's invasion of Ukraine triggered a historic surge in oil prices. At that time, global demand was rebounding from pandemic lows and capacity was constrained. Iran is a smaller exporter than Russia, and current global supply-demand conditions are less strained.</span></p><p class=\"\"><span>Still, another supply-driven price shock, layered on top of tariffs and persistent services inflation, could increase the likelihood that rates remain higher for longer.</span></p><p class=\"\"><span>Write to Nicole Goodkind at nicole.goodkind@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000964:0/",
            "pub_date": "2026-03-01 05:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:058a4ef83094b:0",
            "title": "Ether’s 60% down from its 2025 high, but TradFi keeps betting on ETH: Here’s why",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Key takeaways:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Institutional adoption of the Ethereum network accelerates despite Ether disappointing price action. Ethereum and its layer-2s hold 65% of TVL market share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Vitalik Buterin is shifting focus toward base layer scalability and ZK-EVM to ensure long-term onchain efficiency and security.</span></p></li></ul><p class=\"\"><span>Ether (ETH) has declined 36% in 2026, sparking frustration as the $3,000 level feels increasingly out of reach. Despite a retreat toward $1,900, Ethereum fundamentals appear resilient. Development continues at a rapid pace, specifically targeting base layer scalability, privacy, and quantum resistance. </span></p><p class=\"\"><span>Critics claiming Ether is poorly positioned may be surprised if the market sentiment shifts back toward cryptocurrencies. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:437.12121212121207px;max-width:1200px;aspect-ratio:2.74523396880416\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-7826497cd8190951052618742aacb121-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-7826497cd8190951052618742aacb121-resized.webp\" style=\"background-color:#fbf0e0\"/></picture></div></button></figure><p class=\"\"><span>Ether has underperformed the broader crypto market by 9% during the first two months of 2026, challenging the theory that external factors are the sole drivers of this correction. Decentralized exchange (DEX) volumes on the Ethereum network fell 55% over the past six months, while competitor Solana saw a more modest 21% decline during that same timeframe. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:417.71117166212537px;max-width:1200px;aspect-ratio:2.87279843444227\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-71ae28a9c39b643c7525ca2f6b64cf02-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-71ae28a9c39b643c7525ca2f6b64cf02-resized.webp\" style=\"background-color:#eed1e4\"/></picture></div></button></figure><p class=\"\"><span>Ethereum DEX volumes dropped to $56.5 billion in February 2026, down significantly from a peak of $128.5 billion in August 2025. During the same period, monthly Solana volumes reached $95.5 billion, down from $120.6 billion in August. This contraction in activity has weighed on network fees and decentralized application (DApp) revenue, effectively reducing the immediate incentives for holding Ether.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Institutions choose Ethereum over other blockchains</span></strong></p><p class=\"\"><span>The narrow focus on volume ignores the fact that Ethereum maintains a 57% market share in total value locked (TVL), totaling $52.4 billion. When including layer-2 solutions such as Base, Arbitrum, Polygon, and Optimism, Ethereum’s dominance rises to 65%. For comparison, Solana’s TVL sits at $6.4 billion, while BNB Chain holds an aggregate $5.5 billion locked in smart contracts.</span></p><p class=\"\"><span>Major institutions, including JP Morgan Asset Management, Citi, Deutsche Bank, and BlackRock, have recently launched onchain projects using Ethereum. From tokenized funds to dedicated layer-2 rollups and bank-issued stablecoins, Ethereum remains the primary venue for decentralized finance (DeFi) innovation, commanding a 68% market share in Real World Assets (RWA). </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:380.24691358024694px;max-width:1200px;aspect-ratio:3.155844155844156\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-2db0729df1e8706ad0da8b507e7b8af3-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-2db0729df1e8706ad0da8b507e7b8af3-resized.webp\" style=\"background-color:#ebecef\"/></picture></div></button></figure><p class=\"\"><span>Ethereum’s strategic decision to prioritize layer-2 scalability via rollups has been partially labeled a failure, as competing chains like Tron and Solana currently lead in network fees. Regardless of how critics judge the decision to subsidize rollup costs, no \"Ethereum killer\" has managed to match its monetary value. Even the highly successful Hyperliquid maintains a relatively modest $1.5 billion in TVL. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:486.85199098422237px;max-width:1200px;aspect-ratio:2.464814814814815\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-61684f5e0741fe589f7a287d444be624-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:058a4ef83094b-61684f5e0741fe589f7a287d444be624-resized.webp\" style=\"background-color:#efeeef\"/></picture></div></button></figure><p class=\"\"><span>Vitalik Buterin, Ethereum’s co-founder and lead architect, recently expressed intentions to reduce dependence on rollups by targeting base layer scalability. According to Buterin, the proposed changes include parallel block verification, aligning gas costs with actual execution time, and the implementation of a zero-knowledge Ethereum Virtual Machine (ZK-EVM).</span></p><p class=\"\"><span>These updates will be implemented gradually. Buterin recommends that a minority of the network participate initially before moving toward mandatory block confirmation systems that rely on ZK-EVM. Additionally, Ethereum maintains a clear roadmap to navigate the quantum computing era, which includes consensus-layer signatures based on privacy-focused proof systems.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><em><strong class=\"root-Tkn6WL2y\"><span>Why institutions still prefer Ethereum despite faster blockchains</span></strong></em></p><p class=\"\"><span>Buterin has admitted that quantum-resistant signatures are significantly larger and more difficult to verify, noting that lattice-based solutions are currently inefficient. Consequently, the proposed solution involves fixing protocol-layer recursive signature and proof aggregation while developing vectorized math precompiles to reduce gas costs. While the Ethereum network is not yet perfect, a viable path for scalability exists.</span></p><p class=\"\"><span>Before dismissing ETH as a failure, it is necessary to analyze what has made the network successful relative to competing DApp-focused blockchains. Decentralization and trust require years, if not decades, to establish. ETH maintains a significant first-mover advantage and appears well-positioned to capture a future surge in demand for institutional-grade onchain activity.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:058a4ef83094b:0-ether-s-60-down-from-its-2025-high-but-tradfi-keeps-betting-on-eth-here-s-why/",
            "pub_date": "2026-03-01 05:30:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:e2b3ef410094b:0",
            "title": "Analyst Says XRP’s $15 Target Has Still Not Changed – Here’s Why",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Crypto analyst Javon Marks remains bullish on XRP even after its recent price crash below $1.3. The analyst argued that the cryptocurrency’s long-term technical picture points to a potential surge well into the double-digit territory. According to Marks, XRP’s bullish roadmap toward $15 remains unchanged, underscoring his strong confidence in the altcoin’s ability to push past prevailing bearish trends.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>XRP Double-Digit Price Target Remains Unchanged</span></strong></strong></p><p class=\"\"><span>Sharing his outlook on X, Marks told followers that XRP’s measured move target about $15 remains firmly intact, dismissing recent price weakness as a temporary setback within a much larger bullish structure. His accompanying chart spans over a decade of XRP’s price history, stretching from roughly 2014 through a projected timeline extending well into 2026. </span></p><p class=\"\"><span>Marks’ analysis highlights a recurring pattern that has played out across multiple market cycles. In each instance, XRP formed a descending triangle or wedge formation and then experienced a downturn below a key support level, which the analyst labeled a “false breakdown.” Following this, XRP launched into a powerful parabolic rally to new all-time highs. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:474.609375px;max-width:1200px;aspect-ratio:2.528395061728395\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:e2b3ef410094b-a48999a8e39e2d37b0785563879ee677-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:e2b3ef410094b-a48999a8e39e2d37b0785563879ee677-resized.webp\" style=\"background-color:#f9f9f9\"/></picture></div></button></figure><p class=\"\"><span>This sequence of wedge formation and a subsequent false breakdown occurred notably in 2017 and again heading into 2021, each time producing extraordinary gains in the price of XRP. According to Marks, the breakout that materialized in late 2024, when XRP rose from around $0.55 to over $2.2, mirrors the jump in 2017 that preceded a final bull rally to $3.84 in 2018. </span></p><p class=\"\"><span>He argues that this development hints at another tenfold move in this cycle, representing a more than 900% increase in the XRP price. The chart also projects a peak target somewhere between $15 and $18, with a vertical measurement bar illustrating a potential surge of approximately 2,872.31%. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Analysts Stay Bullish On XRP As Whales Go Long</span></strong></strong></p><p class=\"\"><span>Analysts’ confidence in the XRP price remains strong despite broader market volatility and recent price dips. Notably, market expert Steph is Crypto has identified a multi-year Cup and Handle pattern on its chart that could trigger a historic surge in XRP’s price. </span></p><p class=\"\"><span>According to the analyst, the upward trendline above the pattern points to a projected rally to the $4 level. This price zone is highlighted as a key resistance area, and a decisive move above it could push XRP to its next target above $30. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:574.21875px;max-width:1200px;aspect-ratio:2.089795918367347\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:e2b3ef410094b-11c94ab22e9dbb0b6baa536e9b7d0a3b-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:e2b3ef410094b-11c94ab22e9dbb0b6baa536e9b7d0a3b-resized.webp\" style=\"background-color:#f5f4f4\"/></picture></div></button></figure><p class=\"\"><span>Interestingly, Steph’s bullish outlook for XRP comes as whales continue to go long on the cryptocurrency. Recent reports from market expert Xaif Crypto reveal that a whale opened a massive $3.34 million long position on XRP. He noted that the whale held $193,000 equity with a 104% margin, essentially going all in with no safety net. </span></p><p class=\"\"><span>This move underscores the whale’s strong confidence in XRP’s bullish potential. However, Xaif Crypto has cautioned that if XRP drops to $1.37, then the whale could lose everything. It’s important to note that the XRP price has already declined below $1.3 and now sits near $1.28 at the time of writing. </span></p><p class=\"\"><em><span>Featured image from Vecteezy, chart from TradingView</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:e2b3ef410094b:0-analyst-says-xrp-s-15-target-has-still-not-changed-here-s-why/",
            "pub_date": "2026-03-01 05:30:13",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:dbf5086ab094b:0",
            "title": "Developer embeds image on Bitcoin as a single transaction, challenging BIP-110’s core claims",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Martin Habovštiak, a Slovak Bitcoin developer who maintains the Rust Bitcoin library, has embedded a 66-kilobyte image file directly in the Bitcoin blockchain as a single contiguous transaction, challenging several foundational claims made by proponents of the \"anti-spam\" BIP-110 proposal and the Bitcoin Knots node implementation.</span></p><p class=\"\"><span>The transaction, which is publicly verifiable on the blockchain, can be decoded from its raw hex into a valid TIFF image file viewable by standard image software. The image depicts Knots developer Lucas Dashjr, a central proponent of BIP-110 (formerly BIP-444), crying. Habovštiak announced the project on X on Thursday, linking to a detailed write-up that includes step-by-step instructions for independent verification using any Bitcoin full node.</span></p><p class=\"\"><span>The demonstration is notable for what it did not use: the transaction contains no OP_RETURN opcodes, does not rely on Taproot (using SegWit v0 instead), and contains no OP_IF instructions. These are among the primary vectors that BIP-110 targets for restriction, and Habovštiak argues their absence proves that the proposal's restrictions can be circumvented without relying on any of them.</span></p><p class=\"\"><span>The proof-of-concept arrives amid an ongoing and at times bitter dispute between Bitcoin Core and Bitcoin Knots camps over what types of data should be permitted on the Bitcoin network. BIP-110, originally introduced as BIP-444 in October 2025, proposes a temporary one-year soft fork that would cap OP_RETURN outputs at 83 bytes, limit individual data pushes to 256 bytes, and restrict other scripting features that enable large data storage. It was introduced after Bitcoin Core's v30 release effectively uncapped OP_RETURN data limits earlier that year.</span></p><p class=\"\"><span>Luke Dashjr, the Bitcoin Core developer who maintains Bitcoin Knots and serves as CTO of Ocean mining pool, has been a vocal proponent of limiting arbitrary data on Bitcoin, calling inscriptions \"spam\" since 2023. BIP-110 proponents have argued that contiguous data storage creates legal risks for node operators and diverts Bitcoin from its core purpose as money.</span></p><p class=\"\"><span>In his own posts on X, Dashjr contested the characterization of Habovštiak's transaction as \"contiguous,\" writing in one such post, \"His spam isn't and doesn't contain contiguous images.\" </span></p><p class=\"\"><span>As of late January 2026, about 583 nodes, or 2.38% of the network, were signaling BIP-110 support, according to data published by Dashjr. The proposal is implemented exclusively through Bitcoin Knots, which has seen its node count grow roughly tenfold since the start of 2025.</span></p><p class=\"\"><span>Habovštiak, a prolific open-source contributor, also produced a BIP-110-compliant version of the image transaction, tested against Bitcoin Knots' own regtest environment. The compliant version was reportedly larger than the original, which he argued demonstrates that BIP-110's restrictions would actually increase the total amount of data stored on the blockchain rather than reduce it.</span></p><p class=\"\"><span>Habovštiak said the project was a one-time effort and that he would not be publishing his code, explicitly to avoid enabling a new wave of NFT-like activity on Bitcoin. He described himself as an opponent of blockchain spam who was motivated by what he considered \"untruths\" from the Knots camp.</span></p><p class=\"\"><span>\"There's something I hate much more than spam: Untruths,\" Habovštiak wrote. \"I tried arguing about this in the past, showed a contiguous image encoded to fit into witness, and yet, the Knots supporters are still saying the same stuff over and over.\" The Block could not reach Habovštiak or Dashjr for comment. </span></p><p class=\"\"><span>Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</span></p><p class=\"\"><span>© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/the_block:dbf5086ab094b:0-developer-embeds-image-on-bitcoin-as-a-single-transaction-challenging-bip-110-s-core-claims/",
            "pub_date": "2026-03-01 05:17:03",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        }
    ]
}