{
    "data": [
        {
            "id": "forexlive:15826a27d094b:0",
            "title": "Japan January services PMI 53.0 (prior 50.9)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan January services PMI 53.0</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">prior 50.9</li><li class=\"listItem-bmN0_SHH\">flash was 52.7</li><li class=\"listItem-bmN0_SHH\">grew for the third consecutive month</li></ul><p class=\"\"> Composite PMI 51.1 in January</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">flash 51.1</li><li class=\"listItem-bmN0_SHH\">strongest growth since September</li><li class=\"listItem-bmN0_SHH\">prior 50.5</li><li class=\"listItem-bmN0_SHH\">includes both manufacturing and services</li></ul><p class=\"\">Japan's service sector grew, driven by strong Asian demand for exports, according to the Jibun Bank Service PMI. </p><p class=\"\">Growth in the service sector helped support Japan's overall private sector, with businesses optimistic about future prospects due to expected recoveries in manufacturing and the broader economy. New business increased for the seventh month in a row, supported by new clients and store openings. Export demand also rebounded, with new export business reaching its highest level since August.</p><p class=\"\">Employment rose for the 16th straight month, while rising wages and higher fuel and raw material costs pushed input prices up. As a result, companies raised prices to offset these costs, marking the highest price increases since last May.</p><p class=\"\">Earlier:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Japan Manufacturing PMI January (final) 48.7 (prior 49.6)</li></ul><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1065.0887573964496px;aspect-ratio:1.7751479289940828\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:15826a27d094b-ef2e6af832b42a3c5cf8c54c11eb0270-resized.webp\" type=\"images/webp\"/><img alt=\"Japan 2\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:15826a27d094b-ef2e6af832b42a3c5cf8c54c11eb0270-resized.jpeg\" style=\"background-color:#474444\"/></picture></div></figure></span></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:15826a27d094b:0-japan-january-services-pmi-53-0-prior-50-9/",
            "pub_date": "2025-02-05 08:45:07",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446641:0",
            "title": "Singapore Private Sector Contracts for 1st Time in 2 Years",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Singapore PMI fell to 49.9 in January  2025, down from 51.5 in December, and although marginal it signaled the first private sector deterioration in nearly two years.</p><p class=\"\">The spread of COVID-19 in Singapore negatively impacted output and new orders, which both declined for the first time in just over two years.</p><p class=\"\">Purchasing activity also declined for the third straight month, causing inventories to drop at the fastest pace since December 2022, while employment dipped for the second month, with part-time workers most affected.</p><p class=\"\">Meanwhile, supplier delivery times lengthened for the 18th consecutive month, despite lower demand.</p><p class=\"\">On prices, input costs rose sharply, but inflation eased to a 4-month low, driven by higher shipping, transport, and staff costs.</p><p class=\"\">Selling prices also increased, though at a slower pace.</p><p class=\"\">Looking ahead, business confidence hit a two-year low, but firms remained optimistic about future output growth amid hopes of better demand conditions.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446641:0-singapore-private-sector-contracts-for-1st-time-in-2-years/",
            "pub_date": "2025-02-05 08:45:34",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446642:0",
            "title": "Australian Shares Rise on Wall Street Gains",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P/ASX 200 Index climbed 0.5% to surpass 8,420 on Wednesday, recovering some losses from earlier in the week, fueled by a strong performance on Wall Street where US technology stocks led the rally.</p><p class=\"\">Sentiment around global trade tensions also improved, as the US and its trading partners have largely taken a cautious approach to tariffs.</p><p class=\"\">In Australia, investors are awaiting December trade figures, set for release on Thursday, to assess the health of the nation’s export-driven economy.</p><p class=\"\">Mining and energy stocks saw the biggest gains, with BHP Group rising 1.7%, Fortescue up 3.4%, and Woodside Energy gaining 1.8%.</p><p class=\"\">In corporate news, Insignia Financial jumped 6.5% after the financial services firm received a A$3.07 billion takeover offer from Brookfield.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446642:0-australian-shares-rise-on-wall-street-gains/",
            "pub_date": "2025-02-05 08:46:38",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463596:0",
            "title": "Cleanaway's New South Wales Liquid Waste Facility Hit by Fire",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cleanaway Waste Management  said a \"significant\" fire has disrupted operations at its liquid waste processing facility in St Marys, New South Wales, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">All employees and contractors are safe, and the facility is temporarily closed, the filing said. </p><p class=\"\">Emergency authorities are managing the situation, and Cleanaway will start an investigation once control is returned, the filing added. </p><p class=\"\">The company said it is coordinating with regulators for cleanup and arranging alternative facilities for affected customers. </p><p class=\"\">Shares of the company fell past 2% in recent Wednesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463596:0/",
            "pub_date": "2025-02-05 08:46:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463595:0",
            "title": "Fujitsu's Nine-Month Profit Surges 248%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fujitsu  reported a 248.2% year-on-year jump in attributable profit to nearly 88.1 billion yen in the fiscal nine months ended Dec. 31, 2024, from 25.3 billion yen a year ago mainly due to a pullback from the previous year's structural reform expenses. </p><p class=\"\">The company said earnings per share rose to 48.07 yen from 13.40 yen a year ago, according to a Tokyo Stock Exchange filing on Jan. 31. </p><p class=\"\">Revenue declined 0.8% to 2.621 trillion yen from 2.643 trillion yen a year earlier. </p><p class=\"\">Fujitsu forecasted attributable profit to fall 16.7% to 212 billion yen, or 115.92 yen per share, and flat net sales of 3.47 trillion yen for the fiscal year ending March 31. </p><p class=\"\">The company expects to pay a final dividend of 14 yen per share for the current fiscal year.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463595:0/",
            "pub_date": "2025-02-05 08:47:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014037:0",
            "title": "Gold Edges Higher; Demand for Safe-Haven Assets Persist — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gold edges higher in early Asian trade. Demand for haven assets like gold, which is testing record highs, is being boosted by uncertainty in a challenging global economic environment dominated by trade and tariff tensions between the U.S. and multiple nations, Quasar Elizundia, research strategist at Pepperstone, says in a note. U.S. job openings at the end of 2024 unexpectedly resumed their downward trend, which raises questions about the labor market's strength and its ability to withstand global economic risks, raising uncertainty for investors, Elizundia adds. Spot gold is 0.2% higher at $2,846.13/oz, and has gained 8.5% so far this year. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014037:0/",
            "pub_date": "2025-02-05 08:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Tnw2BcHvQ:0",
            "title": "Lexston Mining Corporation Announces Private Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><p class=\"\">Vancouver, British Columbia, February 4, 2025. -TheNewswire - LexstonMining Corporation (the “Company” or “Lexston”)  (OTC: LEXTF) (Frankfurt: W5G) is pleased to announce anon-brokered private placement to raise gross proceeds of up to$196,000 through theissuance of up to 2,450,000 units at a price of $0.08 per unit (the “Private Placement”).  Each unit will consist of one common share and onecommon share purchase warrant.  Each common share purchase warrantwill entitle the holder to purchase one common share at a price of$0.10 for five years from the date of issuance.</p><p class=\"\">The Company plans to use the proceeds of the PrivatePlacement for general working capital.  Certain directors andofficers of the Company may participate in the Private Placement.</p><p class=\"\">The securities to be issued in connection with thePrivate Placement are subject to the Company’s filing requirementswith the Canadian Securities Exchange. All securities will be subjectto a four-month statutory hold period after closing.</p><p class=\"\">About Lexston MiningCorporation</p><p class=\"\">The Company is a Canadian mineral exploration company,focused on the acquisition and development of mineral projects, withthe objective to enhance value to all its stakeholders. The Companyhas mineral exploration projects in British Columbia and Nunavut,Canada. </p><p class=\"\">The Company (OTCQB: LEXTF) trades on the OTCQB VentureMarket for early stage and developing U.S. and internationalcompanies. Companies are current in their reporting and undergo anannual verification and management certification process. Investorscan find RealTime quotes and market information for the company onwww.otcmarkets.com.</p><p class=\"\">On Behalf of the Board ofDirectors</p><p class=\"\">LEXSTON MINING CORPORATION </p><p class=\"\">Jagdip Bal</p><p class=\"\">Chief Executive Officer</p><p class=\"\">Telephone: (604) 928-8913</p><p class=\"\">Email: info@lexston.ca </p><p class=\"\">The Canadian Securities Exchange hasnot reviewed and does not accept responsibility for the adequacy oraccuracy of the content of this news release.</p><p class=\"\">Forward-looking statements</p><p class=\"\">This news release contains\"forward-looking information\" under applicable Canadiansecurities legislation. Such forward-looking information reflectsmanagement's current beliefs and are based on a number of estimatesand/or assumptions made by and information currently available to theCompany that, while considered reasonable, are subject to known andunknown risks, uncertainties, and other factors that may cause theactual results and future events to differ materially from thoseexpressed or implied by suchforward-looking information. Readers are cautioned that suchforward-looking information are neither promises nor guarantees andare subject to known and unknown risks and uncertainties including,but not limited to, general business, economic, competitive, politicaland social uncertainties, uncertain and volatile equity and capitalmarkets, lack of available capital, actual results of explorationactivities, environmental risks, future prices of base and othermetals, operating risks, accidents, labour issues, objections byaboriginal people, delays in obtaining governmental approvals andpermits, obtaining consents of aboriginal people and other risks inthe mining industry.</p><p class=\"\">These statements include but are notlimited to obtaining financing, exploration permits, exploration ofproperties for minerals, liquidity of the common shares of the Companyand future financings of the Company. These statements reflectmanagement's current estimates, beliefs, intentions, and expectations.They are not guarantees of future performance. The Company cautionsthat all forward-looking statements are inherently uncertain and thatactual performance may be affected by many material factors, many ofwhich are beyond the Company’s control. Such factors include, amongother things: risks and uncertainties relating to the acquisition ofnew properties, liquidity of the common shares of the Company,financings, the market valuing the Company in a manner not anticipatedby management of the Company.  Accordingly, actual and future events,conditions and results may differ materially from the estimates,beliefs, intentions and expectations expressed or implied in theforward-looking information. Except as required under applicablesecurities legislation, the Company does not undertake to publiclyupdate or revise forward-looking information.</p><p class=\"\">The Company is presently anexploration stage company. Exploration is highly speculative innature, involves many risks, requires substantial expenditures, andmay not result in the discovery of mineral deposits that can be minedprofitably. Furthermore, the Company currently has no reserves on itsproperties. As a result, there can be no assurance that suchforward-looking statements will prove to be accurate, and actualresults and future events could differ materially from thoseanticipated in such statements.</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Tnw2BcHvQ:0-lexston-mining-corporation-announces-private-placement/",
            "pub_date": "2025-02-05 08:48:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:9293c7a7c10d7:0",
            "title": "Rush Street Interactive COO Sells 30,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Stetz Mattias</td></tr><tr><td>Relationship</td><td>Chief Operating Officer</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$435,112</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1835040/000179365925000028/xslF345X05/wk-form4_1738716330.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Mattias Stetz, Chief Operating Officer of Rush Street Interactive, sold 30,000 shares of Class A Common Stock on February 3 and 4, 2025, for a total sale amount of $435,112. The sales were executed at weighted average prices of $14.4028 and $15.0085 per share, respectively, under a 10b5-1 Plan dated August 16, 2024. Following these transactions, Stetz directly owns 556,089 shares and indirectly owns 205,448 shares through his spouse.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1835040/000179365925000028/xslF345X05/wk-form4_1738716330.xml\" rel=\"nofollow\" target=\"_blank\">Rush Street Interactive, Inc. [ RSI ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:9293c7a7c10d7:0-rush-street-interactive-coo-sells-30-000-shares/",
            "pub_date": "2025-02-05 08:50:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463599:0",
            "title": "Correction: Market Chatter: Xiaomi's Market Value Hits HK$1 Trillion; Shares Up 5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Corrects the headline and first paragraph to say that Xiaomi's market value has reached HK$1 trillion)</p><p class=\"\">Xiaomi's  stock price on Monday hit a record high of HK$39.85, with market value reaching HK$1 trillion, Pandaily reported Monday. </p><p class=\"\">The smartphone maker achieved third-quarter 2024 profit of 53.5 billion yuan, according to the report. This was 44% higher than the year-ago figure and the estimated profit of 47.3 billion yuan. </p><p class=\"\">Shares of Xiaomi rose over 5% in recent trade. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463599:0/",
            "pub_date": "2025-02-05 08:50:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446640:0",
            "title": "Japan Composite PMI Confirmed at 4-Month High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The au Jibun Bank Japan Composite PMI was at 51.1 in January 2025, in line with flash data.</p><p class=\"\">It marked the third consecutive month of growth in private sector activity and indicating the fastest pace since September.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446640:0-japan-composite-pmi-confirmed-at-4-month-high/",
            "pub_date": "2025-02-05 08:41:27",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013994_20250204014018:0",
            "title": "Callan JMB Prices IPO of 1.28M Shares at $4.00 Each >CJMB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013994_20250204014018:0/",
            "pub_date": "2025-02-05 08:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013994_20250204014017:0",
            "title": "Callan JMB Announces Pricing of $5.12 Million Initial Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013994_20250204014017:0/",
            "pub_date": "2025-02-05 08:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW02U:0",
            "title": "Australian gold stocks extend climb as gold prices hit record high",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Australian gold stocks  up 1%, set for a second consecutive session of gains</p><p class=\"\">** Stock hits highest level since Oct 24, 2024</p><p class=\"\">** Gold prices hit an all-time high, as investors moved to the safe-haven asset after China retaliated with tariffs on the U.S. in response to President Donald Trump's tariffs </p><p class=\"\">** Gold miners Evolution Mining  and Northern Star Resources  gain as much as 1% and 1.3%, respectively</p><p class=\"\">** Sub-index up 16% this year, as of last close</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW02U:0-australian-gold-stocks-extend-climb-as-gold-prices-hit-record-high/",
            "pub_date": "2025-02-05 08:42:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463594:0",
            "title": "Neometals Starts Drilling at Western Australia Gold Project; Shares Up 14%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Neometals  started an exploration drill program at its Barrambie project in Western Australia, marking the first gold drilling in the area in two decades, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">The drilling program, covering 12 holes for 1,000 meters, focuses on the Ironclad prospect and is designed to verify the location, tenor, geometry, and trends of gold mineralization intersected in historic drilling, the filing said. </p><p class=\"\">The next steps include the drilling of historic mining centers, including the Barrambie Ranges underground mine, subject to board approval and heritage clearances, per the filing. </p><p class=\"\">Shares were up 14% on morning trade Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463594:0/",
            "pub_date": "2025-02-05 08:43:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW02P:0",
            "title": "JGB yields hit fresh multi-year highs as wages rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Japanese government bond (JGB) yields hit new multi-year highs in early trade on Wednesday after government data showed a rise in wages, bolstering chances of further interest rate hikes.</p><p class=\"\">The 10-year JGB yield (JP10YTN=JBTC) rose 2 basis points (bps) to 1.295%, its highest since April 2011.</p><p class=\"\">The two-year JGB yield (JP2YTN=JBTC), sensitive to the Bank of Japan's monetary policy, rose 2 bps to 0.76%, its highest since October 2008.</p><p class=\"\">Japan's December inflation-adjusted real wages rose 0.6% year-on-year thanks to a wintertime bonus bump, preliminary government data showed, with government officials expressing optimism that wage hike momentum ahead is growing.</p><p class=\"\">Wage increases are seen as a key factor for the BOJ to raise interest rates further. The market is divided about how far the BOJ policy rate will rise, making it hard for investors to buy JGBs, strategists said.</p><p class=\"\">The five-year yield (JP5YTN=JBTC) rose 2.5 bps to 0.95%, its highest since November 2008.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW02P:0-jgb-yields-hit-fresh-multi-year-highs-as-wages-rise/",
            "pub_date": "2025-02-05 08:43:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014021:0",
            "title": "Fed Vice Chair Jefferson Calls for Caution on Further Rate Cuts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Matt Grossman</p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said the central bank should continue to be cautious about further adjustments to interest rates as long as the economy and labor markets remain strong.</p><p class=\"\">In a lecture at Lafayette College in Easton, Pa., Jefferson said that the economy and the labor market came into 2025 with momentum after a solid 2024, supporting the Fed's move last month to hold rates steady after three straight meetings of cuts.</p><p class=\"\">Jefferson noted that inflation remains above the central bank's target, and that its path down from multi-decade highs in 2022 has been \"bumpy,\" which he said he expects to continue.</p><p class=\"\">\"I do not think we need to be in a hurry to change our stance,\" Jefferson said Tuesday night, according to a published text of his remarks.</p><p class=\"\">Even after the Fed reduced interest rates by a percentage point between September and December, its policy stance still seems to be working to cool off the economy, although not as forcefully as earlier last year, Jefferson said. Echoing remarks by many of his colleagues on the Fed's monetary-policy committee in recent months, Jefferson said he thinks that risks to the Fed's two goals--controlling inflation, and maintaining a thriving labor market--are now roughly balanced.</p><p class=\"\">That has set the stage for what many on Wall Street think will be a pause in further rate cuts perhaps until May or June at the soonest, as reflected in traders' bets in interest-rate futures markets.</p><p class=\"\">Questions about Trump administration economic policy, including on immigration and trade, have clouded the picture of how inflation and the labor market will evolve in the next few months.</p><p class=\"\">Jefferson said that \"currently we face additional uncertainties about the exact shape of government policies, as well as their economic implications.\"</p><p class=\"\">Separately, Jefferson said he expects slower economic growth this year than in 2024, in part because households and businesses \"face an uncertain environment.\" Jefferson said growth could surpass his expectations if consumer spending proves more resilient than he has forecast.</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014021:0-fed-vice-chair-jefferson-calls-for-caution-on-further-rate-cuts/",
            "pub_date": "2025-02-05 08:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW039:0",
            "title": "Artisan Partners Asset Management Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Artisan Partners Asset Management Inc  reported quarterly adjusted earnings of $1.05​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 78 cents.  The mean expectation of four analysts for the quarter was for earnings of 96 cents per share. Wall Street expected results to range from 91 cents to 98 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 19.3% to $297.00 million from a year ago; analysts expected $292.70 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $69.7 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Artisan Partners Asset Management Inc shares had risen by 1.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 1.5% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, three analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy,\" 2 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the investment management &amp; fund operators peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Artisan Partners Asset Management Inc is $41.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 12:43 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.96</p></td><td><p class=\"\">1.05</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.90</p></td><td><p class=\"\">0.92</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.85</p></td><td><p class=\"\">0.82</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.77</p></td><td><p class=\"\">0.76</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW039:0-artisan-partners-asset-management-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 08:44:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Tnw8jHZG7:0",
            "title": "Cloud3 Ventures Inc. Announces Private Placement and Expands Presence in Decentralized Infrastructure and Decentralized Finance (DeFi) with Lif3 Ecosystem",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><p class=\"\">Toronto, Ontario – February 4, 2025 – TheNewswire- Cloud3 Ventures Inc. (“Cloud3” or the “Company”) (CSE: CLDV) (OTC Pink: CLDVF)(FSE: WQ4) ispleased to announce a non-brokered private placement to raise upCAD$500,000 at CAD$0.30 per Subordinate Voting Share (the“Financing”) in conjunction with its strategic capital deployment.Cloud3 Ventures is dedicated to the operation of Blockchain andDecentralized Physical Infrastructure Network (dePIN) nodes as well asDecentralized Finance (DeFi). This move marks a significant milestonein Cloud3’s commitment to decentralized technology andinfrastructure innovation.</p><p class=\"\">Strategic Investment andLaunch</p><p class=\"\">Cloud3 Venture’s first strategic capital deploymentwill be focusing on the Lif3 Ecosystem. Within the Lif3 Ecosystem,Cloud3 ventures will be operating nodes on the Lif3 Chain AlphaMainnet and Autumn Mainnet. Other activities will include staking andsupporting projects such as Tomb and FTM which are connected with theLif3 ecosystem.</p><p class=\"\">“LIF3 represents a groundbreaking force in the DeFispace, offering unparalleled liquidity solutions and a comprehensivesuite of decentralized applications,” stated David Nikzad, CEO of Cloud3 VenturesInc. “By becoming a major node operator, weaim to contribute meaningfully to the network’s decentralization andgrowth, while also capturing the immense value that LIF3 is poised todeliver across the blockchain landscape.”</p><p class=\"\">“Cloud3’s decision to invest and support the Lif3Ecosystem by becoming one of the first major node operators on thenetwork shows the commitment of Decentralization by the Lif3ecosystem. Having invested in the Lif3 Ecosystem from Day 1, bringingon additional partners into the ecosystem to support the vision ofbringing DeFi to the consumer has been key for the organic growth ofthe project,” says ManagingDirector of Quantum Fintech Group, Harry Yeh.“David’s team and experience in growing technology companies inSilicon Valley and experience in the blockchain and crypto space makethem the perfect partner to grow with.”</p><p class=\"\">This strategic partnership combines a public entityvehicle and a decentralized full stack solution which includes curatedLayer-1 blockchain infrastructure, DeFi swaps, stable assets,collateralized lending and a consumer mobile wallet. This partnershippioneers public market access to Decentralized Finance. (DeFi).</p><p class=\"\">Financing</p><p class=\"\">Pursuant to the Financing, the Company proposes to issue up to1,666,667 SVS Shares for gross proceeds of up to CAD$500,000. TheCompany retains the right to vary the size of the Financing. TheCompany has received commitments for up to 80% of the Financing, andanticipates to close the Financing in two tranches. Thesecurities issued under the Financing will be subject to a hold periodunder applicable Canadian securities laws expiring four months and oneday from the closing date of the Financing.</p><p class=\"\">The Company plans to use the proceeds of the Financing for generalworking capital purposes and for deployment into strategicinvestments. The closing of the Financing is subject to certainconditions including, but not limited to, the submission of allrequired forms to the Canadian Securities Exchange.</p><p class=\"\">Certain directors of the Company are expected to participate in theFinancing. Such participation will be considered to be a \"relatedparty transaction\" as defined under Multilateral Instrument61-101 (\"MI 61-101\"). The Company anticipates relying on exemptions fromthe minority shareholder approval and formal valuation requirementsapplicable to the related-party transactions under sections 5.5(a) and5.7(1)(a) of MI 61-101, as neither the fair market value of thesecurities to be issued to, nor the consideration to be paid by, suchpersons is anticipated to exceed 25% of the Company's marketcapitalization.</p><p class=\"\">This news release does not constitute an offer to sell or asolicitation of an offer to buy nor shall there be any sale of anysecurities in any jurisdiction in which such offer, solicitation, orsale would be unlawful. The securities of the Company have not beenand will not be registered under the United States Securities Act of1933, as amended (the “1933Act”), or any state securities laws and may not be offered orsold in the “United States” or to “U.S. persons” (as suchterms are defined in Regulation S under the 1933 Act) unlessregistered under the 1933 Act and applicable state securities laws, oran exemption from such registration requirements is available. </p><p class=\"\">About Lif3</p><p class=\"\">Lif3.com is revolutionizing the blockchainindustry with its omni-chain DeFi ecosystem and curated Layer-1blockchain. The self-custody Lif3 Wallet, available on the App Store and GoogleStore, empowers users byunlocking the full potential of Web3, transforming consumer DeFi,Gaming, iGaming, music, entertainment, and more. $LIF3 is currentlylisted on Bitfinex, Bitmart, and MEXC. </p><p class=\"\">To learn more about lIF3, visit lif3.com.</p><p class=\"\">For more information, users can contact: media@lif3.com</p><p class=\"\">Social Media</p><p class=\"\">X | Telegram | Discord |News and Updates</p><p class=\"\">About Quantum Fintech Group</p><p class=\"\">Quantum Fintech Group is a private investment groupfounded in 2020, and is focused on providing superior returns in thealternative asset space focusing specifically on blockchaininvestments.</p><p class=\"\">Social Media X</p><p class=\"\">About Cloud3 Ventures Inc.</p><p class=\"\">Cloud3 Ventures is dedicated to advancing the capabilities andadoption of decentralized technologies through strategic investmentsand operational excellence. Cloud3 Ventures Inc., is committed tobuilding and maintaining critical decentralized infrastructure acrossmultiple blockchain networks.</p><p class=\"\">For further information pleasecontact:</p><p class=\"\">David Nikzad</p><p class=\"\">CEO and Co-Founder</p><p class=\"\">Telephone: 1-866-395-6989</p><p class=\"\">Email: admin@cloud3.ventures</p><p class=\"\">Website: https://cloud3.ventures/</p><p class=\"\">Social Media X </p><p class=\"\">Cautionary Note RegardingForward-Looking Statements </p><p class=\"\">Certain information set forth inthis news release may contain forward-looking statements that involvesubstantial known and unknown risks and uncertainties, certain ofwhich are beyond the control of the Company. Forward-lookingstatements are frequently characterized by words such as “plan”,“continue”, “expect”, “project”, “intend”,“believe”, “anticipate”, “estimate”, “may”,“will”, “potential”, “proposed” and other similar words,or statements that certain events or conditions “may” or“will” occur or beachieved and other similar expressions. Forward-looking statements arebased on the estimates and opinions of management on the date thestatements are made. In the news release, such forward-lookingstatements include, but are not limited to, statements regarding theCompany’s performance, business objectives, milestones and thepotential outcomes from its development contained therein. </p><p class=\"\">In making the forward-lookingstatements in this news release, the Company has applied severalmaterial assumptions, including without limitation: the Company’sability to comply with all applicable regulations and laws, includingenvironmental, health and safety laws; the success of 4worlds as a metaverse universe and a DAOon the Bitcoin blockchain; the experience of Orthogonal’s advisoryboard to oversee the project;the Company has sufficient working capital for future operatingactivities; the ability of the Company to achieve its businessobjectives and milestones and the anticipated timing of execution; theCompany’s ability to continue as a going concern; the Company’sability to achieve profitability in the 2025 fiscal year; theCompany’s ability to obtain additional financing for continuedoperations on terms acceptable to the Company outlined herein. </p><p class=\"\">The above lists of forward-lookingstatements and assumptions are not exhaustive. Since forward-lookingstatements address future events and conditions, by their very nature,they involve inherent risks and uncertainties. Actual results maydiffer materially from those currently anticipated or implied by suchforward-looking statements due to a number of factors and risks. Theseinclude: changes in general economic, business and politicalconditions, including changes in the financial markets; consents orauthorizations required; changes in laws, regulations and policiesaffecting the Company’s operations; currency fluctuations;environmental issues and liabilities; the inability of the Company toobtain additional financing for continued operations on termsacceptable to the Company; the lack of control over the Company’sinvestees; risks relating to investing in the SVS; volatility in themarket price of the Company’s SVS; dilution of shareholders’holdings; negative operating cash flow; the negative effects ofinterest rate and exchange rate changes; risks relating to theCompany’s reliance on key employees; limitations in the liquidity ofthe SVS; litigation risks; risks with the integration of newbusinesses and acquisitions; risks related to the Company’s statusas an “emerging growth company” under the U.S. securities laws;the Company’s inability to expand into new business areas andgeographic markets; management of growth; the risk of defaulting onexisting debt; the Company’s inability to continue as a goingconcern; and the Company’s inability to achieve profitability in2025. </p><p class=\"\">NOT FOR DISSEMINATION IN THE UNITEDSTATES OR FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES AND DOES NOTCONSTITUTE AN OFFER OF THE SECURITIES DESCRIBED HEREIN</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Tnw8jHZG7:0-cloud3-ventures-inc-announces-private-placement-and-expands-presence-in-decentralized-infrastructure-and-decentralized-finance-defi-with-lif3-ecosystem/",
            "pub_date": "2025-02-05 08:45:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXbpKvc0:0",
            "title": "Constellation Software Inc. and Topicus.com Inc. announce execution of Treasury Shares Purchase Agreement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TORONTO, Feb.  04, 2025  (GLOBE NEWSWIRE) — Constellation Software Inc.  and Topicus.com Inc. (TOI.V) today announced that Topicus’ subsidiary, Yukon Niebieski Kapital B.V. (\"Yukon\"), has entered into a share purchase agreement with Asseco Poland S.A. (the “Company”) and the Adam Góral Family Foundation (\"AG\") for Yukon’s acquisition of 12,318,863 treasury shares held by the Company. These shares represent 14.84% of the Company’s share capital and will be purchased at a price of PLN 85 per share (the “Treasury Shares Purchase Agreement“). The completion of the Treasury Shares Purchase Agreement remains subject to obtaining relevant regulatory and antitrust approvals.</p><p class=\"\">This transaction follows Topicus.com Inc.'s announcement on January 31, 2025, regarding its purchase of 9.99% of the issued shares in the Company from Cyfrowy Polsat S.A. at the same price per share. Additionally, on February 3, 2025, Topicus.com Inc. disclosed that Yukon and TSS Europe B.V. (\"TSS\") had signed a shareholders' agreement with the AG, governing their cooperation as shareholders in the Company. The effectiveness of this shareholders' agreement is contingent upon the completion of Treasury Shares Purchase Agreement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Asseco Poland S.A.</strong></p><p class=\"\">Asseco Group is a federation of companies engaged in information technology and operates in 62 countries worldwide. Asseco Group companies are listed on the Warsaw Stock Exchange, Tel-Aviv Stock Exchange as well as on the American NASDAQ Global Markets. Asseco Group offers comprehensive, proprietary IT solutions for all sectors of the economy. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Adam Góral Foundation</strong></p><p class=\"\">The Adam Góral Family Foundation is a family foundation established by Adam Góral, CEO of Asseco Poland. It operates in accordance with the Polish Family Foundation Act and is registered in Rzeszów, Poland.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Topicus.com</strong></p><p class=\"\">Topicus.com Inc. is a leading pan-European provider of vertical market software and vertical market platforms to clients in public and private sector markets. Operating and investing in countries and markets across Europe with long-term growth potential, Topicus.com Inc. acquires, builds and manages leading software companies providing specialized, mission-critical and high-impact software solutions that address the particular needs of customers.</p><p class=\"\">For further information, contact:</p><p class=\"\">Topicus.com Inc.</p><p class=\"\">Jamal Baksh, Chief Financial Officer</p><p class=\"\">416-861-9677</p><p class=\"\">Email: jbaksh@csisoftware.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Constellation Software Inc.</strong></p><p class=\"\">Constellation acquires, manages and builds vertical market software businesses that provide mission-critical software solutions.</p><p class=\"\">For further information, contact:</p><p class=\"\">Constellation Software Inc.</p><p class=\"\">Jamal Baksh, Chief Financial Officer</p><p class=\"\">416-861-9677</p><p class=\"\">Email: jbaksh@csisoftware.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXbpKvc0:0-constellation-software-inc-and-topicus-com-inc-announce-execution-of-treasury-shares-purchase-agreement/",
            "pub_date": "2025-02-05 08:45:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446637:0",
            "title": "Japan Services PMI Revised Upward",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The au Jibun Bank Japan Services PMI was revised higher to 53.0 in January 2025 from 52.7 in the preliminary reading of 52.7, after a final 50.9 in the prior month.</p><p class=\"\">It marked the third consecutive month of expansion in the service sector and the strongest pace since September.</p><p class=\"\">New orders increased for the seventh month in a row, with its growth rate accelerating.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446637:0-japan-services-pmi-revised-upward/",
            "pub_date": "2025-02-05 08:35:40",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446638:0",
            "title": "US Futures Drop After Disappointing Alphabet Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US stock futures declined on Wednesday following a weak earnings report from Alphabet, the parent company of Google.</p><p class=\"\">In extended trading, Alphabet's stock dropped more than 7% after it missed revenue expectations for its cloud business, while its artificial intelligence investments weighed on cash flow.</p><p class=\"\">Chipotle also fell 5% due to lower-than-expected same-store sales, while Snap rose 6% following strong quarterly results.</p><p class=\"\">Investors are now looking ahead to earnings reports on Wednesday from companies including Uber, Walt Disney, Novo Nordisk, Ford, and Qualcomm.</p><p class=\"\">On Tuesday, the Dow gained 0.3%, the S&amp;P 500 rose 0.72%, and the Nasdaq Composite climbed 1.35%.</p><p class=\"\">Notably, Palantir surged 24% after surpassing revenue forecasts and issuing optimistic guidance.</p><p class=\"\">Meanwhile, investors continue to monitor shifting global trade dynamics as the US and its international partners have so far taken a cautious stance on tariffs.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446638:0-us-futures-drop-after-disappointing-alphabet-earnings/",
            "pub_date": "2025-02-05 08:36:01",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446639:0",
            "title": "Hong Kong Private Sector Grows for 4th Month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Hong Kong SAR PMI stood at 51.0 in January 2025, little changed from 51.1 in December.</p><p class=\"\">It was the fourth straight month of positive reading, supported by marginal rises in output, new work and<br/>employment</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446639:0-hong-kong-private-sector-grows-for-4th-month/",
            "pub_date": "2025-02-05 08:36:26",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014005:0",
            "title": "South Korea's Kospi 0.9% Higher; Battery, Chip, Auto Stocks Advance — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1937 ET - South Korea's benchmark Kospi rises 0.9% to 2503.94 in early trade, as battery, semiconductor and auto stocks advance. Foreign and retail investors are net buyers amid easing fears over U.S. tariffs. Battery makers LG Energy Solution and Samsung SDI rise 2.0% and 2.9%, respectively, recovering from recent losses. Memory-chip maker SK Hynix gains 2.6%. Carmaker Kia is up 1.1%. Meanwhile, LG CNS, an IT service affiliate of LG Group, is down 2.9% on its stock exchange debut. USD/KRW is 0.5% lower at 1,454.90, compared with the prior session's Seoul onshore trading close. South Korea's 10-year government bond yield is up 0.9 bp at 2.844%. (kwanwoo.jun@wsj.com)</p><p class=\"\">1930 ET - The economy remains on solid footing but its health is uneven across sectors, Fed Vice Chair Philip Jefferson said Tuesday. In a lecture at Pennsylvania's Lafayette College, Jefferson notes strength in household spending, retail sales and activity in the services sector. \"The consumer spending data we have received recently have surprised me to the upside,\" Jefferson said, per his published remarks. On the other hand, some sectors have been notably weak. Residential investment has been flattish over the past three quarters, he notes, and production from the domestic manufacturing sector was about flat last year too. \"Much of the equipment investment that did take place came from imports,\" Jefferson says. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1913 ET - Japanese stocks are higher in early trade as fears about U.S. tariffs subside for now. Electronics stocks are leading the gains. Renesas Electronics is up 3.4% and Hitachi Ltd. is 2.9% higher. USD/JPY is at 154.31, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are closely watching U.S. trade talks as well as domestic earnings. Toyota Motor is scheduled to report its quarterly results later in the day. The Nikkei Stock Average is up 0.7% at 39070.87. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1850 ET - Japanese stocks may rise as fears about U.S. tariffs subside for now. Nikkei futures are up 0.4% at 38975 on the SGX. USD/JPY is at 154.17, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are focusing on U.S. trade talks as well as domestic earnings. Toyota Motor is set to announce its quarterly results later in the day. The Nikkei Stock Average rose 0.7% to 38798.37 on Tuesday. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1825 ET - BlackRock, the world's largest asset manager, last year announced a series of acquisitions of private market-focused firms that \"lay a foundation for an increased integration of public and private\" assets, Apollo's CEO Marc Rowan says during an earnings call. \"I continue to believe this convergence of public and private will be a very important source of demand for private assets,\" Rowan says. BlackRock last year acquired infrastructure-focused Global Infrastructure Partners and agreed to buy credit specialist HPS Investment Partners as well as Preqin, a provider of private-market research. \"We envision that traditional asset managers will evolve their businesses to include products that are public and private,\" Rowan adds. \"Our industry and our firm will be a supplier of products to [them].\" (luis.garcia@wsj.com; @lhvgarcia)</p><p class=\"\">1551 ET - Treasury yields lose steam as the trade war cools down a little and both factory orders and job openings in the U.S. fall. Economists surveyed by The Wall Street Journal expect the ADP private-sector jobs report tomorrow to show an increase to 150,000 from December's 122,000, while December trade deficit is forecast to widen to $96.8 billion from $78.19 billion. Jobless claims on Thursday are expected to accelerate and Friday's payrolls increases are expected to slow. Analysts show increasing concerns over stickier inflation and weaker growth potentially resulting from trade wars. The 10-year yield loses 0.031 percentage point to 4.511% and the two-year falls 0.051 p.p. to 4.213%. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1443 ET - The news in the Job Openings and Labor Turnover Survey wasn't stellar, but it probably won't be enough to get the Fed leaning toward an interest-rate cut in March, economists at Barclays writes in a note. Hiring and job-quit rates both fell throughout 2024, but leveled off somewhat in the final few months of the year. For now, there is \"little in today's data to alter the course of Fed policy,\" the Barclays team says. But they add that with a lower ratio of job openings to unemployed workers, it's becoming more likely that any further decline in labor demand would push up the unemployment rate in the months ahead. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1439 ET - Worker remittances to Mexico rose 2.3% in 2024 to a record $64.75 billion, while showing signs of a slowdown, according to data released by the Bank of Mexico. Remittances in December fell 4.9% from the year-earlier month to $5.23 billion. The outlook is patchy for 2025, even without considering possible impact of an anti-immigrant policy under the Trump administration, BBVA's Juan José Li Ng says in a note. BBVA's base case is that remittances will grow 3% this year, \"but with a downward bias given signs of less absorption of Mexican labor in the U.S. over the past year,\" he says. (anthony.harrup@wsj.com)</p><p class=\"\">1434 ET - New research by economists at the St. Louis Fed suggest that wages become more flexible during times of elevated inflation. Studying data over the pandemic and postpandemic period, Maximiliano Dvorkin and Cassie Marks find that during the stretch of high inflation and low unemployment during 2022, wage increases became more likely and larger in scale. Then, they cooled again as the labor market started to normalize in 2023. In 2022, for example, they find that workers had a 55% probability of a positive wage increase, up from 43% in the years before the pandemic. Wage increases fell in likelihood to 53% in 2023, they find. Economists closely study the interconnection between inflation and wages in part to better understand how likely inflation is to become self perpetuating. (matt.grossman@wsj.com, @mattgrossman)</p><p class=\"\">1352 ET - Economists polled in January by the Bank of Mexico lowered their economic growth estimate for this year to 1% from 1.1% in December, while inflation expectations were virtually unchanged at 3.83% and 3.74% for core CPI. GDP slowed to 1.5% in 2024 from 3.3% the previous year, according to statistics institute Inegi. While public security remained the top perceived obstacle to growth, the percentage of analysts citing foreign trade policy rose to 13% from 7% in the previous survey. On Monday, Mexico reached agreement with President Trump to hold off imposing 25% tariffs on Mexican goods for a month while Mexico takes action to curb migration and fentanyl trafficking. (anthony.harrup@wsj.com)</p><p class=\"\">1313 ET - A few days after its quarterly launch, the Atlanta Fed's real-time estimate of 1Q GDP shows the U.S. economy growing at a 3.9% annualized pace over the three months through March. That would be a sharp step up from the 2.3% annualized rate recorded in 4Q 2024 and is well above most Wall Street analysts' forecasts. The model hasn't ingested much 1Q data yet, but recent construction-spending data and ISM manufacturing indexes have pushed the forecast in a positive direction. The first official estimates of 1Q GDP from the Commerce Department are expected to land in late April. (matt.grossman@wsj.com, @mattgrossman)</p><p class=\"\">1154 ET - Economist and market strategist David Rosenberg says he believes Canada and Mexico should have called President Trump's bluff on a 25% tariff. \"That may end up having been a mistake,\" says the head of Rosenberg Research. In a note to clients after the tariff reprieve, Rosenberg says he believes trade uncertainty overhanging Canada and Mexico will dissipate. \"The 30-day reprieve is a joke. Trump is not raising tariffs and probably was never going to,\" Rosenberg says. Canada now avoids a deep recession, Rosenberg says. The Canadian dollar has strengthened, with USDCAD at C$1.4318, or down 3.2% from a Sunday night peak. Still, Rosenberg sticks to his call for USDCAD at C$1.62, with Canada's economy set to underperform the U.S. and require more rate relief. (Paul.Vieira@wsj.com, @paulvieira)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014005:0/",
            "pub_date": "2025-02-05 08:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "marketindex:dfa3d1927094b:0",
            "title": "Pinnacle crushed earnings expectations – But why did the stock give up its gains?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Pinnacle Investment Management posted a strong first-half FY25 result, including a 151% surge in net profit and a 41.1% rise in funds under management</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Despite stellar earnings, Pinnacle shares quickly lost early gains due to its lofty valuation, recent capital raise and dampened investor appetite for equities</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Analysts are cautiously optimistic, with Macquarie and UBS both raising their target prices, but citing valuation concerns</li></ul></span></div><span><p class=\"\">Pinnacle Investment Management  shares rallied 6.0% at Wednesday’s open following a stellar first-half FY25 result but quickly lost all gains within the first 30 minutes of trade.</p><p class=\"\">This sharp reversal came despite the company delivering a clean sweep of better-than-expected numbers, including:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Net profit after tax up 151% to $75.7 million (20% beat vs. consensus)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Diluted earnings per share up 140% to 36.7 cents</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Interim dividend up 112% to 33 cents per share</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Aggregate funds under management to $155.4 billion, up 41.1% compared to the prior half</p></li></ul><p class=\"\">So why did the stock erase its early gains despite these strong results? Let’s break down the key factors behind the fade.</p><p class=\"\">Lofty Valuation</p><p class=\"\">Pinnacle has been one of the best-performing stocks on the S&amp;P/ASX 200, soaring 137% over the past year. This rally has been driven by accretive M&amp;A, net inflows, performance fees, and operating leverage.</p><p class=\"\">However, the share price surge has pushed Pinnacle’s price-to-earnings (P/E) ratio from 25x a year ago to 55x today. UBS notes that the stock is trading at 34x FY27 forecasted earnings, representing a 189% premium to the market, well above its five-year historical premium of 148%.</p><p class=\"\">Put simply, Pinnacle is expensive.</p><p class=\"\">For context, back in February 2024, Pinnacle also posted an earnings beat. But at the time, the stock had been trading sideways for two years at a more reasonable valuation. On its reporting day (2-Feb-24), Pinnacle shares opened 2.5% higher and closed the session up 8.6%—a stark contrast to today’s price action.</p><p class=\"\">Recent Raise</p><p class=\"\">On 21 November 2024, Pinnacle raised $400 million at $20.30 per share, a 5.3% discount to its previous close. The raise accounted for 9.7% of existing shares and was used to fund strategic investments in VSS Capital and Pacific Asset Management, as well as seed new strategies for its affiliates.</p><p class=\"\">Heading into this result, those newly issued shares were already up around 24%, creating a potential liquidity event for investors to lock in profits.</p><p class=\"\">Appetite for Equities </p><p class=\"\">One notable comment from Pinnacle’s earnings release pointed to ongoing investor caution toward equities:</p><p class=\"\">\"We have still not seen a significant improvement in appetite for equities amongst institutional clients or the increasingly sophisticated wholesale market, with our flows remaining dominated by fixed income, credit and other private markets assets (tailwinds for these asset classes are in fact strengthening).\"</p><p class=\"\">With Pinnacle’s flows skewed toward non-equity assets, the broader market’s tepid sentiment toward stocks may also be weighing on the share price reaction.</p><p class=\"\">Cautiously Optimistic Analysts</p><p class=\"\">Despite the stock’s pullback, analysts remain cautiously optimistic.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Macquarie reiterated an Outperform rating, lifting its price target from $26.70 to $27.37</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">UBS maintained a Neutral rating, raising its target from $22.50 to $25.20</p></li></ul><p class=\"\">\"With PNI trading at 34x FY26 consensus estimates, it is delivering on high expectations, and we remain Neutral on valuation grounds,\" UBS analysts said in a note on Wednesday.</p><p class=\"\">The Bottom Line</p><p class=\"\">Pinnacle delivered a strong earnings beat, but with its lofty valuation, recent capital raise, and cautious market sentiment toward equities, investors saw an opportunity to take profits rather than chase the rally.</p></span></div>",
            "link": "https://www.tradingview.com/news/marketindex:dfa3d1927094b:0-pinnacle-crushed-earnings-expectations-but-why-did-the-stock-give-up-its-gains/",
            "pub_date": "2025-02-05 08:37:51",
            "source": "Market Index",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW01A:0",
            "title": "USD/JPY off leg on lower US rates, as trade concerns ease?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">USD weaker on a broad front overnight, leads to leg down in USD/JPY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Unsure whether easing concerns over US trade tariffs warranted</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">US yields also easier, Treasury 2s @4.227%, 10s @4.526%, JGB yields firmer</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">More narrowing of Japan-US interest rate differentials, in 10s @322 bps now</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">USD/JPY from 155.52 to 154.18 yesterday, Asia 154.04-45 EBS so far</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Recent dips have seen support sub-154.00, multiple lows to 153.72 Jan 27</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Daily Ichimoku cloud between 153.37-155.20 providing cushion of sorts</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">200-DMA below at 152.80, 100-DMA at 152.74</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Decent demand eyed at today's Gotobi Tokyo fix, mix of importers, others</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Option expiries supportive too, 153.15-25 total $2.2 bln, 154.00 $1.3 bln</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Topside expiries today 155.00-20 total $613 mln, 155.60-62 $930 mln</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Plenty of US-Trump news again for market to digest</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Related comments , , , </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Also , Fed-speak , on US economic data </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">US markets , , , </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Trump news , ,  and </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">For more click on </p></li></ul><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:695.4545454545454px;aspect-ratio:1.159090909090909\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01A-8741c7c13f9cffcdde0ebf25a537f024-resized.webp\" type=\"images/webp\"/><img alt=\"Off a leg, back in cloud, cloud to support?\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01A-8741c7c13f9cffcdde0ebf25a537f024-resized.jpeg\" style=\"background-color:#e2e0df\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">USD/JPY</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:592.8104575163399px;aspect-ratio:0.9880174291938998\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01A-2b411ae52b97ae5f19bb6a741e1503bf-resized.webp\" type=\"images/webp\"/><img alt=\"Massive expiries below today likely supportive\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01A-2b411ae52b97ae5f19bb6a741e1503bf-resized.jpeg\" style=\"background-color:#232120\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">USD/JPY nearby option expiries this week</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:695.4545454545454px;aspect-ratio:1.159090909090909\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01A-0b307204469032842e1f57355eaf547f-resized.webp\" type=\"images/webp\"/><img alt=\"Narrowing trend continuing\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW01A-0b307204469032842e1f57355eaf547f-resized.jpeg\" style=\"background-color:#e3e0e0\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">JGB-US Treasury 10-year interest rate differential</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW01A:0-usd-jpy-off-leg-on-lower-us-rates-as-trade-concerns-ease/",
            "pub_date": "2025-02-05 08:40:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463593:0",
            "title": "NZX Midday Sector Update: Process Industry Soars, Electronic Tech Struggles",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Process industry stocks gained the most on the New Zealand exchange, rising 1% at midday Wednesday. </p><p class=\"\">Bremworth  rose past 5% to become the biggest gainer on the New Zealand benchmark index. </p><p class=\"\">On the other hand, electronic technology shares dropped over 2.5%. </p><p class=\"\">Smartpay Holdings  fell past 6% to be among the midday biggest losers.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463593:0-nzx-midday-sector-update-process-industry-soars-electronic-tech-struggles/",
            "pub_date": "2025-02-05 08:40:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463584:0",
            "title": "G.R.Cables Changes Company Name to Clenon Enterprises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">G.R.Cables  has changed the company's name to Clenon Enterprises, effective Tuesday, according to a same-day disclosure to the BSE. </p><p class=\"\">The name change took effect after receiving a fresh Certificate of Incorporation from India's Ministry of Corporate Affairs.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463584:0/",
            "pub_date": "2025-02-05 08:32:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW00P:0",
            "title": "Aussie, New Zealand dollars get respite ahead of China's reopen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Australian and New Zealand dollars clung to gains on Wednesday ahead of the resumption of trade in Chinese markets, where eyes are on Beijing's fixing of the yuan midpoint rate following the outbreak of Donald Trump's trade war.</p><p class=\"\">The dollar was on the back foot in the early Asian session, giving some respite to heavily battered currencies like the euro , which bounced back above the $1.02 level and last bought $1.0374.</p><p class=\"\">Volatility in currency markets eased a little on Wednesday after a turbulent start of the week following Trump's imposition of steep tariffs on top U.S. trading partners, with those on Mexico and Canada having since been delayed following negotiations.</p><p class=\"\">But China on Tuesday slapped tariffs on U.S. imports in a swift response to new U.S. duties on Chinese goods, and Trump said the same day he is in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the world's two largest economies.</p><p class=\"\">China returns from the extended Lunar New Year break on Wednesday and traders are closely watching the fixing of the yuan midpoint rate by the People's Bank of China (PBOC) - within which it allows the yuan to trade on any given day, for a sense of whether Chinese authorities will allow for a weaker currency to blunt the impact of tariffs.</p><p class=\"\">The offshore yuan  had tumbled to a record low of 7.3765 per dollar at the start of the week, though it has since recovered some of those losses.</p><p class=\"\">The Australian and New Zealand dollars, often used as liquid proxies for the yuan, were clinging to overnight gains, with the Aussie  last at $0.6251 after rising 0.47% on Tuesday.</p><p class=\"\">The kiwi  last fetched $0.5648, having gained 0.44% overnight.</p><p class=\"\">\"What the PBOC does to the fixing today would tell us a lot about the PBOC's stance on how to deal with the trade war with the U.S.,\" said Carol Kong, a currency strategist at Commonwealth Bank of Australia (CBA).</p><p class=\"\">\"Our base case is that China will increase its tolerance for currency's weakness in response to the U.S. tariffs. Whether or not the PBOC does that as soon as today remains in question.\"</p><p class=\"\">Elsewhere, the Canadian dollar  extended its rebound from Monday's 22-year low and last stood at C$1.4333.</p><p class=\"\">The Mexican peso  was steady at 20.4910 per dollar, away from a trough of 21.2882 hit on Monday, its weakest level in nearly three years.</p><p class=\"\">Sterling  was similarly little changed at $1.2479.</p><p class=\"\">\"I am actually quite surprised at the resilience of markets. Risk sentiment...has been quite positive despite all the tariff headlines and the resumption of the U.S.-China trade war,\" said CBA's Kong.</p><p class=\"\">\"I think part of the optimism stems from the fact that the U.S. was willing to delay tariffs as long as the other countries gave Trump what he wanted.\"</p><p class=\"\">In Japan, the yen  was a touch higher and last stood at 154.30 per dollar. The dollar index  was flat at 108.04.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW00P:0-aussie-new-zealand-dollars-get-respite-ahead-of-china-s-reopen/",
            "pub_date": "2025-02-05 08:33:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463588:0",
            "title": "Tamilnadu Petroproducts Appoints CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tamilnadu Petroproducts  has appointed C. Parthiban as chief financial officer of the company, with effect from Feb. 12, according to a Tuesday filing to the Indian stock exchanges. </p><p class=\"\">Parthiban will take over from K T Vijayagopal, whose tenure as whole-time director (finance) and chief financial officer will expire on Feb. 11.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463588:0/",
            "pub_date": "2025-02-05 08:34:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463590:0",
            "title": "Rio Tinto Faces Fresh Shipping Delays as Cyclones Hit Pilbara Ports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rio Tinto Group  is grappling with further iron ore shipment delays after Cyclones Taliah and Vince caused high seas off its Western Australian ports, according to multiple media reports released Tuesday, citing a company spokesperson. </p><p class=\"\">The company moved iron ore ships from Cape Lambert and Dampier ports to avoid dangerous wave conditions, the reports said. </p><p class=\"\">The disruption follows damage from Tropical Cyclone Sean in January, which flooded rail infrastructure and impacted operations, the reports added. </p><p class=\"\">The ongoing repairs on the East Intercourse Island dumper are further compounding the challenges. </p><p class=\"\">If repairs take longer than three to four weeks, Rio could struggle to make up for the delay in the second half, posing a risk to its production guidance, Reuters quoted Capital Markets analyst Kaan Peker as saying. </p><p class=\"\">Shares of the company rose nearly 2% in recent Wednesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463590:0/",
            "pub_date": "2025-02-05 08:34:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}