{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2FC:0",
            "title": "Apator Reaches Settlement Over Product Claims With Estimated Max. 20.8 Mln Zloty Impact",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Apator SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DISCLOSES DELAYED CONFIDENTIAL INFORMATION REGARDING FOREIGN MARKET COMPLAINT CLAIM</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SUBSIDIARY RECEIVED COMPLAINT CLAIM FROM FOREIGN CLIENT REGARDING ELECTRICITY SEGMENT DEVICES DELIVERED 2021-2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>REACHES SETTLEMENT WITH CLIENT ON FEBRUARY 27, 2026, AGREEING TO REPLACE DEVICES AND COVER REPLACEMENT COST</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ESTIMATES ONE-OFF IMPACT ON FINANCIAL RESULTS WILL NOT EXCEED ABOUT 20.8 MILLION ZLOTYS, ASSUMING INSURANCE COVERAGE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2FC:0-apator-reaches-settlement-over-product-claims-with-estimated-max-20-8-mln-zloty-impact/",
            "pub_date": "2026-02-28 00:36:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2947351:0",
            "title": "CBAV: Revenue and net profit rose double digits, with strong expansion and improved financial position",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew 12% and net profit 15% year-over-year, driven by expansion and operational improvements. Eleven new clinics opened, ROI exceeded 35%, and the net financial position strengthened by 39%.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2947351-67f4c32d2db6e4c858f77b519bbc7b08\" target=\"_blank\">Clinica Baviera SA [CBAV] Slides Release — Mar. 5 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2947351:0-cbav-revenue-and-net-profit-rose-double-digits-with-strong-expansion-and-improved-financial-position/",
            "pub_date": "2026-02-28 00:36:26",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Eduz4kHka:0",
            "title": "REG - Euronext Dublin - Notice of Delisting (CVC CORDATUS LOAN FUND XXXI DESIGNATED ACTIVITY CO) [89319]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89319</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Eduz4kHka:0-reg-euronext-dublin-notice-of-delisting-cvc-cordatus-loan-fund-xxxi-designated-activity-co-89319/",
            "pub_date": "2026-02-28 00:36:59",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007604:0",
            "title": "Heico Stock: Buy The Dip, Wall Street Says — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Al Root</span></p><p class=\"\"><span>Sometimes the market gives investors a gift. They should take it.</span></p><p class=\"\"><span>That's the view of Vertical Research Partners analyst Rob Stallard, who urged investors to buy the post-earnings dip in shares of Heico.</span></p><p class=\"\"><span>On Wednesday evening, the aerospace parts manufacturer reported fiscal first-quarter earnings per share of $1.35, about seven cents ahead of Wall Street estimates.</span></p><p class=\"\"><span>The company's flight support division, which makes replacement parts for commercial aircraft, grew sales year over year by about 12% on a comparable basis.</span></p><p class=\"\"><span>Heico doesn't provide formal guidance, but management expects \"continued sales momentum\" in that and other business segments.</span></p><p class=\"\"><span>It all seemed fine. Shares, however, dropped more than 9% on Thursday.</span></p><p class=\"\"><span>\"When you are a stock that has done as well as Heico, with the highest valuation in the Aerospace &amp; Defense space, there is always the risk of expectations getting ahead of reality,\" wrote Stallard on Friday. \"We think investors have reacted negatively to the free cash flow miss and the soft [segment] margin, even though both have been impacted by short-term issues. We would thus be using this sell-off as an opportune entry point for what has been a proven, successful compounder business model over the last 30-plus years.\"</span></p><p class=\"\"><span>A \"compounder\" is a Wall Street term for a company that has a history of successful capital deployment, typically with bolt-on acquisition, leading to consistent, strong earnings growth.</span></p><p class=\"\"><span>Stallard rates shares Buy and has a $403 price target for the stock.</span></p><p class=\"\"><span>He isn't alone. On Friday, Citi analyst John Godyn put a \"upside 90-day catalyst watch\" on Heico stock. That means he expects shares to rise over the coming three months.</span></p><p class=\"\"><span>\"We believe recent weakness represents an attractive entry point into what we've described as a Best of Breed Megatrend Compounder, given the company's unusually long history of compounding value in Aerospace &amp; Defense,\" wrote Godyn. The megatrend he sees is strong, lasting demand growth for commercial air travel. \"Big picture, our constructive fundamental view on Heico is based on its dominant niche aftermarket position, robust M&amp;A pipeline, cash generation, and diversified growth.\"</span></p><p class=\"\"><span>His price target for shares is $400.</span></p><p class=\"\"><span>Overall, Heico is a relatively popular stock on Wall Street, with 61% of analysts covering shares rating it Buy, according to FactSet. The average Buy-rating ratio for stocks in the S&amp;P 500 is about 55%. The average analyst price target for Heico stock is about $375.</span></p><p class=\"\"><span>The biggest complaint about Heico might be its valuation. Shares trade for about 55 times earnings expected over the next 12 months. That's just about the same valuation as the stock had five years ago. Through midday trading, shares were up about 150% over that span. Earnings per share have risen from $2.29 to $4.90.</span></p><p class=\"\"><span>Heico stock was up 1.6% in midday trading on Friday, while the S&amp;P 500 and Dow Jones Industrial Average were down 0.6% and 1.2%, respectively.</span></p><p class=\"\"><span>Write to Al Root at allen.root@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007604:0/",
            "pub_date": "2026-02-28 00:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007605:0",
            "title": "How Shang Chou Went From Selling Software to Advisors to Running a Wealth Management Firm — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Steve Garmhausen</span></p><p class=\"\"><span>Shang Chou and company take pride in offering sophisticated investment solutions to their wealthy clients. But Chou's new firm, Pasadena, Calif.-based Dishmi Capital, has also built what he calls tax-aware borrowing, long used by hedge funds and institutional investors. And there's more to come, says the veteran of Pimco, Goldman Sachs, and JPMorgan Chase. \"There's an opportunity to create what we envision as a tax-aware private banking platform,\" he says, \"where clients can do cash management, borrowing, investing, accessing deals, along with the advisory services that are table stakes for wealth management.\"</span></p><p class=\"\"><span>Speaking with Barron's Advisor, Chou, who is co-founder and managing partner of Dishmi, which manages $220 million in assets, describes a vision of using the \"unsexy parts of the business\" to give clients an edge. He points to risks to the industry posed by private equity and by \"these compelling, great-pedigree\" asset managers looking to sell opaque products through the wealth channel. And he argues that wealth management is starting to become cool to the smart college students who previously might have limited their ambitions to law or investment banking.</span></p><p class=\"\"><span>Where are you from, and how did you get started in the industry? I was born in Taiwan, and my family came to the United States in the mid-80s and settled in Southern California like many other Taiwanese-American families. MIT accepted me on a merit scholarship and offered me a spot on their Division III water polo team, and my first job after college was at a long-short equity hedge fund in New York City. I landed at Pimco in the early 2010s, and that's where a lot of my formative experiences happened. Most of my professional opportunities can be tied back, either directly or one degree of separation, to Pimco.</span></p><p class=\"\"><span>In 2014 you had left Pimco, where you'd been on a team serving retirement plan sponsors, to get your M.B.A. Why was that period decisive for your career? At the time, my mom was dealing with her second bout of breast cancer. And my fiancée's biotech company had gone public and then been acquired for something like $15 billion by Gilead. Those two experiences pulled me into the world of wealth management. I remember going with my mom to see her financial advisor. This guy was pitching her structured products, and I knew for a fact my mom did not know what that was. She also had a terminal illness, and these things didn't feel like a good fit. It felt opaque, product-centric, and with no focus on education.</span></p><p class=\"\"><span>When my fiancée had her liquidity event, I remember we woke up one day, her phone was going crazy with text messages, and she opened her E-Trade account with her company stock. We literally went from two broke kids with tons of grad-school debt to being high net worth. We didn't know what to do; we were caught off guard. That led me to found my first business, which was basically me sitting in my apartment hacking together a piece of software to manage my family's investments and assets.</span></p><p class=\"\"><span>You ended up pitching that software to wealth management firms. But you ultimately went into business for yourself. Why? Yes, I was running all over the West Coast trying to sell my software to wealth management businesses. My college roommate and I were pitching ourselves as two MIT kids who could help advisors digitize and scale their practice. But I felt a little bit like a poser, because I was telling these registered investment advisors how I could help them with their practice management, but I'd never been an advisor myself. So I decided I should learn the business.</span></p><p class=\"\"><span>You then spent three years at J.P. Morgan's private bank and then at Goldman Sachs. But you had the entrepreneurial itch, correct? I eventually got to a point during Covid where I just got bored sitting at home and working for a bank. At the time, a group of my friends from Pimco was starting a company called Simplify Asset Management. There had been some SEC rule changes that allowed the use of derivatives within an ETF wrapper. All of a sudden ETF providers could do sophisticated hedge-fund-like strategies. We could have things like listed OTC derivatives in an ETF wrapper accessible to anyone with, say, $25 or $30 to buy a share of an ETF. So I joined my friends for about three years and helped build the company. Today, the company's north of $12 billion in AUM. I'm still a passive shareholder, and they're still close friends. But it was at Simplify where I saw that a lot of the value creation in our world happens in the unsexy parts of the business, especially in things like equities.</span></p><p class=\"\"><span>What do you mean? The U.S. equity market is so liquid and efficient. You really have to be thoughtful and creative to identify ways to find alpha. One thing that stuck with me from Pimco was the concept of structural alpha. Pimco would express S&amp;P 500 exposure with futures, and then we're going to be active with the collateral that's left over. You might take some maturity risk, some credit risk, maybe some complexity risk in the fixed-income world, but that way you're going to get the S&amp;P 500 returns, but you're also going to get a little bit of outperformance from our bond exposure. I saw this firsthand when I was launching those ETFs with my team at Simplify. For example we did a handful of transactions that are popular in the ETF world today called Section 351 transactions. Basically we can take a basket of somewhat concentrated, low-cost-basis stocks and rebalance them without incurring any capital gains for the investor using the ETF wrapper.</span></p><p class=\"\"><span>You founded Dishmi just a few months ago. Can you describe the firm's strengths? We've been iterating. When we started, our initial thought was, OK, we can do two things really well. I bucket them in my head as offense and defense. On the defensive side were things like core equities, fixed income, maybe some liquid diversifiers. We can be really thoughtful and be very tax aware, using some of these structural concepts, things like leveraging an equity portfolio 200 long, 100 short, to run the tax-loss harvesting.</span></p><p class=\"\"><span>We're very thoughtful on the income-tax front, whether it's dividends, income from investing or employment income. A lot of our clients are high-income earners, so we want to be very thoughtful. I draw on my experience in the world of derivatives. We discovered things like trader hedge funds very early. These funds use things called notion-of-principal contracts. They produce ordinary losses, which have the potential to help mitigate taxes on income. The other thing we were very strong at had to do with our connectivity to the world of Wall Street.</span></p><p class=\"\"><span>A lot of folks we work with are partners at private-equity firms and venture capital firms, they're senior executives on Wall Street. We tend to see deal flow earlier than most multifamily offices or RIAs, so we were helping facilitate direct access into some of these start-ups — companies like OpenAI, SpaceX, Stripe; a lot of folks we were working with were coming to us and saying, \"All we're seeing in the marketplace right now are deals with fees on fees on fees.\" So we started working our network to source direct access to some of these companies for our clients. So the two sides were the tax office side and the private-markets access side. That's where we started. And today we're set up a little differently.</span></p><p class=\"\"><span>What's an example of how your expertise has broadened? Over the past year we've built out what I call tax-aware borrowing. A mortgage is maybe 6.5%. Credit cards are 15%-plus. We're helping our clients borrow at near-risk-free rates. We're using strategies traditionally used by hedge funds and market makers, institutional investors. There's an opportunity to create what we envision as a tax-aware private banking platform, where clients can do cash management, borrowing, investing, accessing deals, along with the advisory services that are table stakes for wealth management — things like trust and estate planning, philanthropic planning, financial planning, etc.</span></p><p class=\"\"><span>What are your growth goals? Where would you like to be in two, three, five years? It feels like we've been drinking from a fire hydrant: Thus far, we have not done any outbound sales marketing. Everything has come to us through word of mouth. When I think about growth going forward, where I land is that as long as we consistently do a great job for clients, we're going to get all the growth we could ever want. Are our clients happy with us? That's qualitative, but I break it down into what we're sharing in terms of knowledge and education. How do we align that with quantifiable goals? A few that I track are, are we delivering great pretax alpha? Are we sourcing the right managers? Are we getting folks in the right deals? Are we leaning into our relationships and trying to negotiate lower fees for clients? That all flows into pretax performance. We also care a lot about after-tax returns, so we look at that very closely. The tax losses our strategies have realized and how those have been impactful for our clients is another important key performance indicator for us. So I tend not to orient myself too much on numbers. I find it backwards looking. As long as you do the right things, lots of good stuff is going to happen.</span></p><p class=\"\"><span>What is the biggest business challenge on your plate right now? AI has really started to grab hold in the industry. We are trying to understand what it means for our business, and what it will look like five, 10, 15 years down the line. We're generally going to be more conservative in our approach, but we also know this is something important. So the challenge is how do we integrate AI into our practice in a way that helps us streamline operations. There are all sorts of risks. So how do we safely and thoughtfully integrate AI to bring our business to the next level?</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007605:0/",
            "pub_date": "2026-02-28 00:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947355:0",
            "title": "PPL: Record annual volumes and major project progress offset lower Q4 earnings; 2026 is a peak investment year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw lower earnings and EBITDA year-over-year, but record annual volumes and strong project execution. Major expansions and LNG initiatives progressed, with 2026 set as a peak investment year before leverage declines. Growth in pipelines, facilities, and export capacity remains robust.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947355:0-ppl-record-annual-volumes-and-major-project-progress-offset-lower-q4-earnings-2026-is-a-peak-investment-year/",
            "pub_date": "2026-02-28 00:38:12",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN269:0",
            "title": "Ftai Infrastructure Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ftai Infrastructure Inc </span><span> reported a quarterly adjusted loss of $1.08​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of -57 cents.  The mean expectation of three analysts for the quarter was for a loss of 43 cents per share. Wall Street expected results to range from -50 cents to -30 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 77.7% to $143.52 million from a year ago; analysts expected $169.07 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ftai Infrastructure Inc's reported EPS for the quarter was a loss of $1.08​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $125.48 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ftai Infrastructure Inc shares had risen by 39.7% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"strong buy\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" no \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the ground freight &amp; logistics peer group is  \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Ftai Infrastructure Inc is $12.00, about 46.3% above its last closing price of $6.44</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 04:38 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>-0.43</span></p></td><td><p class=\"\"><span>-1.08</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-0.59</span></p></td><td><p class=\"\"><span>-1.37</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>-0.37</span></p></td><td><p class=\"\"><span>-0.65</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>-0.29</span></p></td><td><p class=\"\"><span>0.89</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN269:0-ftai-infrastructure-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-28 00:38:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN29J:0",
            "title": "Celon Pharma Names Justyna Rejmak As CFO Following Resignation Of Bartosz Szalek",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Celon Pharma SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BARTOSZ SZALEK RESIGNS AS BOARD MEMBER AND CFO DUE TO PERSONAL REASONS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>JUSTYNA REJMAK TO ASSUME ROLE OF CFO</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN29J:0-celon-pharma-names-justyna-rejmak-as-cfo-following-resignation-of-bartosz-szalek/",
            "pub_date": "2026-02-28 00:38:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947360:0",
            "title": "MTZ: Record revenue, margin expansion, and backlog growth set up strong multi-year outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record revenue and EBITDA growth in 2025, with strong backlog expansion and robust performance across all segments. 2026 guidance calls for 19% revenue growth, margin expansion, and continued investment in data centers, renewables, and water infrastructure.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947360:0-mtz-record-revenue-margin-expansion-and-backlog-growth-set-up-strong-multi-year-outlook/",
            "pub_date": "2026-02-28 00:39:15",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007618:0",
            "title": "Xenon Pharmaceuticals Is Maintained at Overweight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(16:40 GMT) </span></strong><span>Xenon Pharmaceuticals Price Target Raised to $49.00/Share From $48.00 by Wells Fargo</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007618:0/",
            "pub_date": "2026-02-28 00:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7865Ua:0",
            "title": "REG - Experian plc - Notification of issuance of equity securities",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7865U  Experian plc  27 February 2026   </span><p class=\"\"><span>Experian plc</span></p><p class=\"\"><span>Notification of issuance of equity securities</span></p><p class=\"\"><span>27 February 2026 - Experian plc, the global data and technology company (the \"Company\"), hereby notifies the market, in conformity with UKLR6.4.4 and PRM 1.6.4, and for PRM 1.6.4 purposes covers the period 19 January 2026 to 31 January 2026 and 1 February 2026 to 27 February 2026.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>1</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the issuer</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Name</span></p></td><td><p class=\"\"><span>Experian plc</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>LEI</span></p></td><td><p class=\"\"><span>635400RXXHHYT1JTSZ26</span></p></td></tr><tr><td><p class=\"\"><span>2</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the transferable securities issued and admitted to trading</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Name, type and identification code</span></p></td><td><p class=\"\"><span>Experian plc</span></p><p class=\"\"><span>ordinary shares of 10 US cents GB00B19NLV48</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>Regulated market</span></p></td><td><p class=\"\"><span>London Stock Exchange - Main Market</span></p></td></tr><tr><td><p class=\"\"><span>c)</span></p></td><td><p class=\"\"><span>Number of further securities issued and admitted</span></p></td><td><p class=\"\"><span>10,112 ordinary shares (19-31 January 2026) and</span></p><p class=\"\"><span>34,593 ordinary shares (1-27 February 2026)</span></p></td></tr><tr><td><p class=\"\"><span>d)</span></p></td><td><p class=\"\"><span>Total number of securities admitted following issuance</span></p></td><td><p class=\"\"><span>966,855,945 ordinary shares</span></p></td></tr><tr><td><p class=\"\"><span>e)</span></p></td><td><p class=\"\"><span>Fungibility</span></p></td><td><p class=\"\"><span>Fully fungible with existing ordinary shares</span></p></td></tr><tr><td><p class=\"\"><span>3</span></p></td><td colspan=\"2\"><p class=\"\"><span>Issue and admission details</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Dates of issuance and admission</span></p></td><td><p class=\"\"><span>From 19 January 2026 to 30 January 2026,</span></p><p class=\"\"><span>and from 1 February 2026 to 27 February 2026 (each admitted under block admissions dated before 19 January 2026).</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>Prospectus information</span></p></td><td><p class=\"\"><span>Prospectus: N/A</span></p><p class=\"\"><span>Supplementary: N/A</span></p><p class=\"\"><span>Company's website: https://www.experianplc.com</span></p></td></tr></tbody></table></div><p class=\"\"><span>Contact:</span></p><p class=\"\"><span>Experian</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Claire Murphy</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Deputy Company Secretary</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>+353 (0) 87 118 4397</span></p></li></ul><p class=\"\"><span>About Experian</span></p><p class=\"\"><span>Experian is a global data and technology company, powering opportunities for people and businesses around the world. We help to redefine lending practices, uncover and prevent fraud, simplify healthcare, deliver digital marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics and software. We also assist millions of people to realise their financial goals and help them to save time and money.</span></p><p class=\"\"><span>We operate across a range of markets, from financial services to healthcare, automotive, agrifinance, insurance, and many more industry segments.</span></p><p class=\"\"><span>We invest in talented people and new advanced technologies to unlock the power of data and to innovate. A FTSE 100 Index company listed on the London Stock Exchange (EXPN), we have a team of 25,200 people across 33 countries. Our corporate headquarters are in Dublin, Ireland. Learn more at experianplc.com.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  MSCFZGZZVNZGVZM</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7865Ua:0-reg-experian-plc-notification-of-issuance-of-equity-securities/",
            "pub_date": "2026-02-28 00:40:00",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7871Ua:0",
            "title": "REG - HANetf II ICAV HANetf RexCryptoEIG£ HANetf RexCryptoEIG$ HANetf Regan TR Inc$ HANetf Regan TR Inc£ - Net Asset Value(s)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7871U  HANetf II ICAV  27 February 2026   </span><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Funds</span></p></td><td><p class=\"\"><span>ISIN</span></p></td><td><p class=\"\"><span>Date</span></p></td><td><p class=\"\"><span>Currency</span></p></td><td><p class=\"\"><span>Shares In Issue</span></p></td><td><p class=\"\"><span>Net Asset Value</span></p></td><td><p class=\"\"><span>NAV Per Share</span></p></td></tr><tr><td><p class=\"\"><span>Regan Total Return Income Fund UCITS ETF</span></p></td><td><p class=\"\"><span>IE000TD32PU3</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td><td><p class=\"\"><span>USD</span></p></td><td><p class=\"\"><span>100,000</span></p></td><td><p class=\"\"><span>$1,046,403.55</span></p></td><td><p class=\"\"><span>10.4640</span></p></td></tr><tr><td><p class=\"\"><span>REX Crypto Equity Income &amp; Growth UCITS ETF</span></p></td><td><p class=\"\"><span>IE0008BA4TY1</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td><td><p class=\"\"><span>USD</span></p></td><td><p class=\"\"><span>476,000</span></p></td><td><p class=\"\"><span>$12,569,719.60</span></p></td><td><p class=\"\"><span>26.4070</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  NAVAKOBNABKDOBB</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7871Ua:0-reg-hanetf-ii-icav-hanetf-rexcryptoeig-hanetf-rexcryptoeig-hanetf-regan-tr-inc-hanetf-regan-tr-inc-net-asset-value-s/",
            "pub_date": "2026-02-28 00:40:06",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7870Ua:0",
            "title": "REG - VertiGIS Ltd 1Spatial Plc - Update on LOIs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7870U  VertiGIS Ltd  27 February 2026   </span><p class=\"\"><span>DISCLOSURE UNDER RULE 2.10(c)(ii) OF THE CITY CODE ON TAKEOVERS AND MERGERS (THE \"CODE\")</span></p><p class=\"\"><span>NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN, INTO OR FROM ANY JURISDICTION WHERE TO DO SO WOULD CONSTITUTE A VIOLATION OF THE RELEVANT LAWS OR REGULATIONS OF SUCH JURISDICTION</span></p><p class=\"\"><span>FOR IMMEDIATE RELEASE</span></p><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>RECOMMENDED CASH OFFER</span></p><p class=\"\"><span>by</span></p><p class=\"\"><span>VERTIGIS LTD</span></p><p class=\"\"><span>for</span></p><p class=\"\"><span>1SPATIAL PLC</span></p><p class=\"\"><span>to be effected by means of a Scheme of Arrangement</span></p><p class=\"\"><span>under Part 26 of the Companies Act 2006</span></p><p class=\"\"><span>UPDATE ON THE LETTERS OF INTENT</span></p><p class=\"\"><span>On 21 January 2026, the boards of directors of VertiGIS Ltd (\"VertiGIS\") and 1Spatial plc (\"1Spatial\") announced that they had reached agreement on the terms and conditions of a recommended cash offer pursuant to which VertiGIS will acquire the entire issued and to be issued ordinary share capital of 1Spatial pursuant to Rule 2.7 of the Code (the \"2.7 Announcement\").</span></p><p class=\"\"><span>Capitalised terms used in this announcement, unless otherwise defined, shall have the meanings given to them in the 2.7 Announcement.</span></p><p class=\"\"><span>As set out in Appendix III to the 2.7 Announcement, VertiGIS had received irrevocable undertakings and non-binding letters of intent from certain 1Spatial Shareholders to vote in favour (or, where applicable, procure voting) of the Scheme at the Court Meeting and the Resolution to be proposed at the General Meeting (or, in the event that the Acquisition is implemented by way of a Takeover Offer, to accept or procure the acceptance of the Takeover Offer), in respect of a total of 58,676,393 1Spatial Shares, representing approximately 52.45 per cent. of the existing issued ordinary share capital of 1Spatial as at 20 January 2026, being the last Business Day prior to the date of the 2.7 Announcement.</span></p><p class=\"\"><span>These included non-binding letters of intent from:</span></p><p class=\"\"><span>·     Canaccord Genuity Asset Management Limited (\"Canaccord Genuity\"), in respect of 18,028,859 1Spatial Shares, representing approximately 16.12 per cent. of the existing issued ordinary share capital of 1Spatial (the \"Canaccord Genuity Letter of Intent\");</span></p><p class=\"\"><span>·    J O Hambro Capital Management Limited (\"J O Hambro\") in respect of 3,185,000 1Spatial Shares, representing approximately 2.85 per cent. of the existing issued ordinary share capital of 1Spatial (the \"J O Hambro Letter of Intent\");</span></p><p class=\"\"><span>·    Lombard Odier Asset Management (Europe) Limited (\"Lombard Odier\") in respect of 7,252,120 1Spatial Shares, representing approximately 6.48 per cent. of the existing issued ordinary share capital of 1Spatial (the \"Lombard Odier Letter of Intent\"); and</span></p><p class=\"\"><span>·      Downing LLP (\"Downing\") in respect of 6,921,688 1Spatial Shares, representing approximately 6.19 per cent. of the existing issued ordinary share capital of 1Spatial (the \"Downing Letter of Intent\").</span></p><p class=\"\"><span>Since the Rule 2.7 Announcement:</span></p><p class=\"\"><span>·      On 22 January 2026, Canaccord Genuity announced it had sold 3,000,000 1Spatial Shares;</span></p><p class=\"\"><span>·      On 12 February 2026, J O Hambro announced it had sold 1,185,000 1Spatial Shares;</span></p><p class=\"\"><span>·      On 16 February 2026, Lombard Odier notified VertiGIS it had sold 499,471 1Spatial Shares; and</span></p><p class=\"\"><span>·    Between 27 January 2026 and 25 February 2026, Downing announced it had sold, in aggregate, 164,125 1Spatial Shares.</span></p><p class=\"\"><span>Therefore:</span></p><p class=\"\"><span>·      the total number of 1Spatial Shares which are subject to the Canaccord Genuity Letter of Intent has reduced to 15,028,859 1Spatial Shares, representing approximately 13.44 per cent. of the existing issued share capital of 1Spatial as at close of business on 26 February 2026, being the last Business Day prior to the date of this announcement;</span></p><p class=\"\"><span>·    the total number of 1Spatial Shares which are subject to the J O Hambro Letter of Intent has reduced to 2,000,000 1Spatial Shares, representing approximately 1.79 per cent. of the existing issued share capital of 1Spatial as at close of business on 26 February 2026, being the last Business Day prior to the date of this announcement;</span></p><p class=\"\"><span>·     the total number of 1Spatial Shares which are subject to the Lombard Odier Letter of Intent has reduced to 6,752,649 1Spatial Shares, representing approximately 6.04 per cent. of the existing issued share capital of 1Spatial as at close of business on 26 February 2026, being the last Business Day prior to the date of this announcement;</span></p><p class=\"\"><span>·     the total number of 1Spatial Shares which are subject to the Downing Letter of Intent has reduced to 6,757,563 1Spatial Shares, representing approximately 6.04 per cent. of the existing issued share capital of 1Spatial as at close of business on 26 February 2026, being the last Business Day prior to the date of this announcement; and</span></p><p class=\"\"><span>·    the total number of 1Spatial Shares which are subject to irrevocable undertakings and non-binding letters of intent has, in aggregate, decreased from 58,676,393 to 53,827,797 1Spatial Shares, representing approximately 48.12 per cent. of the issued share capital of 1Spatial as at close of business on 26 February 2026, being the last Business Day prior to the date of this announcement.</span></p><p class=\"\"><span>Enquiries:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>VertiGIS</span></p></td><td><p class=\"\"><span>via Raymond James</span></p></td></tr><tr><td><p class=\"\"><span>Andy Berry, Chief Executive Officer</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Jens Schmidt, Chief Financial Officer</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Richard Smith, Chairman</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Raymond James (Financial Adviser to VertiGIS)</span></p></td><td><p class=\"\"><span>+44 (0) 20 3798 5700</span></p></td></tr><tr><td><p class=\"\"><span>Junya Iwamoto</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Alexander Lawless</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Important Notices</span></p><p class=\"\"><span>Raymond James Financial International Limited (\"Raymond James\"), which is authorised and regulated in the United Kingdom by the FCA, is acting exclusively for VertiGIS and no-one else in connection with the matters described in this announcement and will not be responsible to anyone other than VertiGIS for providing the protections afforded to clients of Raymond James nor for providing advice in connection with the matters referred to herein. Neither Raymond James nor any of its affiliates (nor any of its respective directors, officers, employees, representatives or agents) owes or accepts any duty, liability or responsibility whatsoever (whether direct or indirect, whether in contract, in tort, under statute or otherwise) to any person who is not a client of Raymond James in connection with this announcement, any statement contained herein or otherwise.</span></p><p class=\"\"><span>Further Information</span></p><p class=\"\"><span>This announcement is for information purposes only and is not intended to and does not constitute, or form any part of, an offer to sell or subscribe for or any invitation to purchase or subscribe for any securities or the solicitation of any vote or approval in any jurisdiction pursuant to the Acquisition or otherwise. The Acquisition will be made solely through and on the terms set out in the Scheme Document (or, in the event that the Acquisition is to be implemented by means of a Takeover Offer, the offer document) and the accompanying Forms of Proxy, which will contain the full terms and conditions of the Acquisition, including details of how to vote in respect of the Acquisition. Any approval, decision or other response to the Acquisition should be made only on the basis of the information in the Scheme Document. Scheme Shareholders are strongly advised to read the formal documentation in relation to the Acquisition once it has been despatched.</span></p><p class=\"\"><span>The statements contained in this announcement are made as at the date of this announcement, unless some other time is specified in relation to them, and service of this announcement shall not give rise to any implication that there has been no change in the facts set forth in this announcement since such date.</span></p><p class=\"\"><span>Overseas Shareholders</span></p><p class=\"\"><span>This announcement has been prepared for the purpose of complying with English law, the AIM Rules and the Code and the information disclosed may not be the same as that which would have been disclosed if this announcement had been prepared in accordance with the laws of jurisdictions outside the United Kingdom.</span></p><p class=\"\"><span>The laws of the relevant jurisdictions may affect the availability of the Acquisition to persons who are not resident in the United Kingdom. Persons who are not resident in the United Kingdom, or who are subject to laws of any jurisdiction other than the United Kingdom, should inform themselves about, and observe any applicable requirements. Any person (including, without limitation, nominees, trustees and custodians) who would, or otherwise intends to, forward this announcement or, when published, the Scheme Document or any accompanying document to any jurisdiction outside the United Kingdom should refrain from doing so and seek appropriate professional advice before taking any action. In particular, the ability of persons who are not resident in the United Kingdom to vote their 1Spatial Shares at the Court Meeting or the General Meeting, or to execute and deliver Forms of Proxy appointing another to vote their 1Spatial Shares in respect of the Court Meeting or the General Meeting on their behalf, may be affected by the laws of the relevant jurisdiction in which they are located.</span></p><p class=\"\"><span>Any failure to comply with the applicable legal or regulatory requirements may constitute a violation of the laws and/or regulations of any such jurisdiction. To the fullest extent permitted by applicable law, the companies and persons involved in the Acquisition disclaim any responsibility and liability for the violation of such restrictions by any person.</span></p><p class=\"\"><span>The Acquisition will not be made, directly or indirectly, in or into or by use of the mails or any other means or instrumentality (including, without limitation, telephonic or electronic) of interstate or foreign commerce of, or any facility of a national, state or other securities exchange of, a Restricted Jurisdiction, and the Acquisition will not be capable of acceptance by any such use, means, instrumentality or facility or from within a Restricted Jurisdiction. Accordingly, copies of this announcement and formal documentation relating to the Acquisition are not being, and must not be, directly or indirectly, mailed or otherwise forwarded or distributed in, into or from a Restricted Jurisdiction and persons receiving this announcement (including custodians, nominees and trustees) must not distribute or send it into or from a Restricted Jurisdiction. In the event that the Acquisition is implemented by way of a Takeover Offer and extended into the US, VertiGIS will do so in satisfaction of the procedural and filing requirements of US securities laws at that time, to the extent applicable thereto. The Acquisition relates to the shares of a company incorporated in England and it is proposed to be made by means of a scheme of arrangement provided for under English law. The Scheme will relate to the shares of a UK company that is a \"foreign private issuer\" as defined under Rule 3b-4 under the US Exchange Act. A transaction effected by means of a scheme of arrangement is not subject to any shareholder vote, proxy solicitation and tender offer rules under the US Exchange Act.</span></p><p class=\"\"><span>Accordingly, the Scheme is subject to the disclosure requirements and practices applicable in the UK to schemes of arrangement, which differ from the disclosure requirements and practices of US shareholder vote, proxy solicitation or tender offer rules. Financial information included in the relevant documentation will have been prepared in accordance with accounting standards applicable in the UK and may not be comparable to the financial information of, or the accounting standards applicable to, US companies. However, if VertiGIS were to elect to implement the Acquisition by means of a Takeover Offer, such Takeover Offer shall be made in compliance with all applicable laws and regulations, including section 14(e) of the US Exchange Act and Regulation 14E thereunder, if applicable. Such Takeover Offer would be made in the US by VertiGIS and no one else. In addition to any such Takeover Offer, VertiGIS, certain affiliated companies and the nominees or brokers (acting as agents) may make certain purchases of, or arrangements to purchase, shares in 1Spatial outside such Takeover Offer during the period in which such Takeover Offer would remain open for acceptance. If such purchases or arrangements to purchase are made they would be made outside the United States in compliance with applicable law, including the US Exchange Act. It may be difficult for a US-based investor to enforce his or her rights and any claim he or she may have arising under US securities laws, since the Scheme relates to the shares of a company located in the UK, and some or all of its officers and directors may be residents of non-US jurisdictions. A US-based investor may not be able to sue a company located in the UK, or its officers or directors, in a foreign court for alleged violations of US securities laws, and it may be difficult to compel a foreign company and its affiliates to subject themselves to a US court's judgment.</span></p><p class=\"\"><span>Forward-looking statements</span></p><p class=\"\"><span>This announcement, oral statements made regarding the Acquisition, and other information published by 1Spatial and VertiGIS may contain certain \"forward-looking statements\" with respect to 1Spatial and VertiGIS. These forward-looking statements can be identified by the fact that they do not relate only to historical or current facts. Forward-looking statements often use words such as \"anticipate\", \"target\", \"expect\", \"estimate\", \"intend\", \"plan\", \"goal\", \"believe\", \"will\", \"may\", \"should\", \"would\", \"could\" or other words or terms of similar meaning or the negative thereof. Forward-looking statements include statements relating to, for example, the following: (i) future capital expenditures, expenses, revenues, earnings, synergies, economic performance, indebtedness, financial condition, dividend policy, losses and future prospects; (ii) business and management strategies of VertiGIS and the expansion and growth of 1Spatial and potential synergies resulting from the Acquisition; and (iii) the effects of government regulation on the business of 1Spatial.</span></p><p class=\"\"><span>These forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or developments to differ materially from those expressed in or implied by such forward-looking statements. These forward-looking statements are based on numerous assumptions regarding present and future strategies and environments. None of VertiGIS, or 1Spatial, nor any of their respective associates, directors, officers, employees or advisers, provides any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements in this announcement will actually occur. You are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. All subsequent oral or written forward-looking statements attributable to VertiGIS or 1Spatial or any person acting on their behalf are expressly qualified in their entirety by the cautionary statement above. Should one or more of these risks or uncertainties materialise, or should underlying assumptions prove incorrect, actual results may vary materially from those described in this announcement. None of VertiGIS or 1Spatial assume any obligation to update publicly or revise forward-looking or other statements contained in this announcement, whether as a result of new information, future events or otherwise, except to the extent legally required.</span></p><p class=\"\"><span>No profit forecasts or estimates</span></p><p class=\"\"><span>No statement in this announcement is intended as a profit forecast or estimate for VertiGIS or 1Spatial in respect of any period and no statement in this announcement should be interpreted to mean that earnings or earnings per 1Spatial Share for the current or future financial years would necessarily match or exceed the historical published earnings or earnings per 1Spatial Share.</span></p><p class=\"\"><span>Publication on website</span></p><p class=\"\"><span>In accordance with Rule 26.1 of the Code, a copy of this announcement will be made available (subject to certain restrictions relating to persons resident in Restricted Jurisdictions), free of charge, on 1Spatial's website at https://1spatial.com/investors/possible-offer/and on VertiGIS's website at https://www.vertigis.com/1spatial-plc/ by no later than 12:00 noon on the Business Day following this announcement. Neither the contents of these websites nor the content of any other website accessible from hyperlinks on such websites is incorporated into, or forms part of, this announcement.</span></p><p class=\"\"><span>Requesting hard copies</span></p><p class=\"\"><span>In accordance with Rule 30.3 of the Code, a person so entitled may request a hard copy of this announcement, free of charge, by contacting 1Spatial's registrar, MUFG Corporate Markets on 0371 664 0321 (from within the UK) or +44 371 664 0321 (from outside the UK). Calls are charged at the standard geographic rate and will vary by provider. Calls outside the United Kingdom will be charged at the applicable international rate. The helpline is open between 9:00 a.m. and 5:30 p.m., Monday to Friday excluding public holidays in England and Wales. Please note that MUFG Corporate Markets cannot provide any financial, legal or tax advice and calls may be recorded and monitored for security and training purposes. For persons who receive a copy of this announcement in electronic form or via a website notification, a hard copy of this announcement will not be sent unless so requested. In accordance with Rule 30.3 of the Code, a person so entitled may also request that all future documents, announcements and information to be sent to them in relation to the Acquisition should be in hard copy form.</span></p><p class=\"\"><span>Electronic communications - information for 1Spatial Shareholders</span></p><p class=\"\"><span>Please be aware that addresses, electronic addresses and certain information provided by 1Spatial Shareholders, persons with information rights and other relevant persons for the receipt of communications from 1Spatial may be provided to VertiGIS during the Offer Period as required under section 4 of Appendix 4 of the Code to comply with Rule 2.11(c) of the Code.</span></p><p class=\"\"><span>Rounding</span></p><p class=\"\"><span>Certain figures included in this announcement have been subjected to rounding adjustments. Accordingly, figures shown for the same category presented in different tables may vary slightly and figures shown as totals in certain tables may not be an arithmetic aggregation of the figures that precede them.</span></p><p class=\"\"><span>Disclosure requirements of the Code</span></p><p class=\"\"><span>Under Rule 8.3(a) of the Code, any person who is interested in 1% or more of any class of relevant securities of an offeree company or of any securities exchange offeror (being any offeror other than an offeror in respect of which it has been announced that its offer is, or is likely to be, solely in cash) must make an Opening Position Disclosure following the commencement of the offer period and, if later, following the announcement in which any securities exchange offeror is first identified. An Opening Position Disclosure must contain details of the person's interests and short positions in, and rights to subscribe for, any relevant securities of each of (i) the offeree company and (ii) any securities exchange offeror(s). An Opening Position Disclosure by a person to whom Rule 8.3(a) applies must be made by no later than 3:30 p.m. (London time) on the 10th business day following the commencement of the offer period and, if appropriate, by no later than 3:30 p.m. (London time) on the 10th business day following the announcement in which any securities exchange offeror is first identified. Relevant persons who deal in the relevant securities of the offeree company or of a securities exchange offeror prior to the deadline for making an Opening Position Disclosure must instead make a Dealing Disclosure.</span></p><p class=\"\"><span>Under Rule 8.3(b) of the Code, any person who is, or becomes, interested in 1% or more of any class of relevant securities of the offeree company or of any securities exchange offeror must make a Dealing Disclosure if the person deals in any relevant securities of the offeree company or of any securities exchange offeror. A Dealing Disclosure must contain details of the dealing concerned and of the person's interests and short positions in, and rights to subscribe for, any relevant securities of each of (i) the offeree company and (ii) any securities exchange offeror(s), save to the extent that these details have previously been disclosed under Rule 8. A Dealing Disclosure by a person to whom Rule 8.3(b) applies must be made by no later than 3:30 p.m. (London time) on the business day following the date of the relevant dealing.</span></p><p class=\"\"><span>If two or more persons act together pursuant to an agreement or understanding, whether formal or informal, to acquire or control an interest in relevant securities of an offeree company or a securities exchange offeror, they will be deemed to be a single person for the purpose of Rule 8.3.</span></p><p class=\"\"><span>Opening Position Disclosures must also be made by the offeree company and by any offeror and Dealing Disclosures must also be made by the offeree company, by any offeror and by any persons acting in concert with any of them (see Rules 8.1, 8.2 and 8.4).</span></p><p class=\"\"><span>Details of the offeree and offeror companies in respect of whose relevant securities Opening Position Disclosures and Dealing Disclosures must be made can be found in the Disclosure Table on the Takeover Panel's website at www.thetakeoverpanel.org.uk, including details of the number of relevant securities in issue, when the offer period commenced and when any offeror was first identified. You should contact the Panel's Market Surveillance Unit on +44 (0)20 7638 0129 if you are in any doubt as to whether you are required to make an Opening Position Disclosure or a Dealing Disclosure.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  LOIFZGZZVNVGVZM</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7870Ua:0-reg-vertigis-ltd-1spatial-plc-update-on-lois/",
            "pub_date": "2026-02-28 00:40:34",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0VH:0",
            "title": "Russia's January car production down 13.2% year on year, Rosstat says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Russian production of passenger cars fell by 13.2% year on year in January 2025 to 47,200 vehicles, federal statistics service Rosstat said on Friday.</span></p><p class=\"\"><span>Sales of cars dropped by 9.5% year-on-year in January to 80,604 units, Russian analytical agency Autostat said earlier this month.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0VH:0-russia-s-january-car-production-down-13-2-year-on-year-rosstat-says/",
            "pub_date": "2026-02-28 00:31:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7853Ua:0",
            "title": "REG - Medpal AI PLC - Final Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7853U  Medpal AI PLC  27 February 2026   </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>27 February 2026</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>MedPal AI plc</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(\"MedPal AI\" or the \"Company\")</span></strong></p><p class=\"\"><span>Final Results for the year ended 31 August 2025</span></p><p class=\"\"><span>MedPal AI plc (AIM: MPAL, Frankfurt: Z1N), the vertically integrated AI-powered digital health and pharmacy services company, announces its results for the year ended 31 August 2025.</span></p><p class=\"\"><span>Highlights</span></p><p class=\"\"><span>Admission to AIM in August 2025 as a pre-revenue company, raising gross proceeds of approximately £2 million from an oversubscribed Placing and Retail Offer of new shares.</span></p><p class=\"\"><span>Loss before tax for the year was £4m (2024:£13,587)</span></p><p class=\"\"><span>Since Year End - Pharmacy</span></p><p class=\"\"><span>·    Acquired key assets from Universal Pharmacy Limited (in administration) for £45,000 in cash, including leasehold property, goodwill, equipment, stock and an NHS Distance Selling Pharmacy (DSP) licence.</span></p><p class=\"\"><span>·    Received formal approval from Norfolk and Waveney Integrated Care Board (ICB) for the change of ownership of the pharmacy licence.</span></p><p class=\"\"><span>·    Opened the 24/7 AI-powered National Distribution Centre at Ecotech Business Park, Swaffham, Norfolk in October 2025.</span></p><p class=\"\"><span>·    Launched the retail pharmacy website MedPal.clinic. Achieved a 30-fold increase in dispensing efficiency through server technology upgrades.</span></p><p class=\"\"><span>·    Secured approval as an authorised purchaser of Eli Lilly pharmaceutical products in the UK. Dispensed 70,384 items across December 2025 and January 2026 at an average item value of £9.70, delivering pharmacy revenue in excess of £350,000 per month.</span></p><p class=\"\"><span>·    In February 2026, the vertically integrated UK platform became fully operational, merging AI-powered digital health with human-validated prescribing, robotic dispensing and nationwide delivery.</span></p><p class=\"\"><span>Since Year End - MedPal Wellness App and Vertical Integration</span></p><p class=\"\"><span>·    Entered a strategic partnership with Independent Gyms, providing free access to the MedPal AI app for members of over 2,000 independent gyms.</span></p><p class=\"\"><span>·    Completed a major upgrade to the MedPal AI wellness app on iOS and Android in December 2025 and commenced rollout across Epassi UK's network, which provides access to over 11 million employees at major firms including Siemens and Volvo.</span></p><p class=\"\"><span>·    Launched a UK-first direct AI integration between the wellness app and MedPal.clinic.</span></p><p class=\"\"><span>·    Reached 7,791 installs of the MedPal AI wellness app, all paid for or on the Epassi acquisition pathway.</span></p><p class=\"\"><span>Since Year End - Corporate</span></p><p class=\"\"><span>·    Raised a further £2.54 million through a Placing, WRAP Retail Offer and At-The-Market (ATM) facility.</span></p><p class=\"\"><span>·    Obtained a secondary listing and admission to trading on the Open Market of the Frankfurt Stock Exchange (Frankfurt: Z1N).</span></p><p class=\"\"><span>The Annual Report and Accounts will be available on the Company's website www.medpalplc.com</span></p><p class=\"\"><span>Jason Drummond, CEO of MedPal AI, commented:</span></p><p class=\"\"><span>\"In just six months since our AIM admission we have transformed MedPal from a pre-revenue company into a fully vertically integrated digital health platform already generating more than £350,000 in monthly pharmacy revenue. The speed of execution has been exceptional - from acquiring and opening our 24/7 national distribution centre, to launching MedPal.clinic, to delivering a 30-fold improvement in dispensing efficiency.</span></p><p class=\"\"><span>\"What truly sets us apart is our closed-loop model: the AI wellness app identifies health needs, our proprietary triage system connects users with qualified prescribers, and our robotic pharmacy delivers same-day or next-day medication. Every app user is now a potential pharmacy patient, and every pharmacy patient can benefit from ongoing AI-powered wellness support. With nearly 8,000 app installs, over 70,000 items dispensed, an Eli Lilly direct supply agreement secured and our Frankfurt listing now live, we have built strong momentum and multiple clear pathways for accelerated growth. The Board views the future with considerable confidence.\"</span></p><p class=\"\"><span>This announcement contains inside information for the purposes of Article 7 of EU Regulation 596/2014 (which forms part of domestic UK law pursuant to the European Union (Withdrawal) Act 2018). The Directors of the Company are responsible for the contents of this announcement.</span></p><p class=\"\"><span>Enquiries:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>MedPal AI plc</span></p><p class=\"\"><span>Jason Drummond, Chief Executive Officer</span></p></td><td><p class=\"\"><span>Via Square1 Consulting</span></p></td></tr><tr><td><p class=\"\"><span>Cairn Financial Advisers LLP       </span></p><p class=\"\"><span>Louise O'Driscoll/Jo Turner</span></p></td><td><p class=\"\"><span>+44 (0) 20 7213 0880</span></p></td></tr><tr><td><p class=\"\"><span>Clear Capital Markets Limited</span></p><p class=\"\"><span>Bob Roberts</span></p></td><td><p class=\"\"><span>+44 (0) 20 3869 6080</span></p></td></tr><tr><td><p class=\"\"><span>Square1 Consulting</span></p><p class=\"\"><span>David Bick</span></p></td><td><p class=\"\"><span>+44 (0) 20 7929 5599</span></p><p class=\"\"><span>+44 (0) 7831 381201</span></p></td></tr></tbody></table></div><p class=\"\"><span>About MedPal AI</span></p><p class=\"\"><span>MedPal AI is a UK-based digital health company specialising in AI-driven wellness management. Its core app aggregates data from over 100 wearables and health apps (e.g. Apple Health, Fitbit, Garmin) into a unified profile, offering non-clinical, personalised lifestyle guidance through its AI wellness coach. The Company is also developing conversational AI to provide voice-based, real-time health insights, alerts, and recommendations.</span></p><p class=\"\"><span>Through its wholly owned subsidiary MedPal Limited, the Company operates a 24/7 AI-powered automated pharmacy distribution centre, providing nationwide NHS and private prescription services. The facility leverages advanced robotic dispensing technology integrated with AI triage to deliver rapid, cost-effective medication fulfilment with same-day and next-day delivery capabilities.</span></p><p class=\"\"><span>MedPal AI has a partnership agreement with Epassi UK Limited, which will, for a limited time, grant exclusive, zero-cost access to the MedPal AI app across Epassi's network of 11M+ employees at major firms like Siemens and Volvo. Beyond consumers, MedPal AI plans to expand via B2B licensing to healthcare providers, businesses, and insurers, with potential use in insurance-linked wellness programs to reduce premiums and drive new revenue through institutional partnerships. The Company also has a partnership agreement with Independent Gyms Ltd.</span></p><p class=\"\"><span>CEO'S STATEMENT</span></p><p class=\"\"><span>FOR THE YEAR ENDED 31 AUGUST 2025</span></p><p class=\"\"><span>I am pleased to present the financial statements of MedPal AI plc for the year ended 31 August 2025, a period that marked the most significant milestone to date in our Company's history.</span></p><p class=\"\"><span>In August 2025, MedPal AI was admitted to trading on AIM, raising gross proceeds of approximately £2 million through an oversubscribed placing and retail offer. At the time of admission, the Company was pre-revenue, with our entire focus directed towards building a vertically integrated, AI-powered digital health platform capable of serving the UK market at scale.</span></p><p class=\"\"><span>The pace of execution since admission has been exceptional. In just six months, MedPal AI has transitioned from a pre-revenue business into a fully operational, revenue-generating digital health company underpinned by a live, vertically integrated digital health and pharmacy platform. I am immensely proud of what our team has achieved.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Our Strategy and Business Model</span></strong></p><p class=\"\"><span>At the heart of MedPal AI is a closed-loop healthcare ecosystem that integrates our AI wellness app and its proprietary clinical triage engine. We provide human-validated prescribing, robotic pharmacy dispensing and nationwide delivery infrastructure via a single, seamless platform.</span></p><p class=\"\"><span>This end-to-end integration enables the app to identify health needs, connect users instantly with qualified prescribers, and fulfil prescriptions entirely through our own licensed operations. We believe this model is a genuine differentiator in the UK market: it drives deeper user engagement, accelerates conversion from wellness users to pharmacy patients and vice versa, and unlocks multiple scalable revenue streams across both consumer services and B2B partnerships.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Operational Review</span></strong></p><p class=\"\"><span>Shortly after year end, we completed the acquisition of key assets from Universal Pharmacy Limited (in administration) for £45,000 in cash, securing leasehold property, equipment, goodwill, stock and, critically, an NHS Distance Selling Pharmacy licence. Formal approval for the change of ownership of this licence was received from the Norfolk and Waveney Integrated Care Board on 13 February 2026.</span></p><p class=\"\"><span>In October 2025, we opened our state-of-the-art 24/7 AI-powered National Distribution Centre at Ecotech Business Park, Swaffham, Norfolk. The facility is equipped with advanced BD Rowa and Omnicell robotic dispensing systems, providing the automated infrastructure needed to support high-volume, accurate and efficient fulfilment nationwide.</span></p><p class=\"\"><span>The launch of MedPal.clinic, fully integrated with our wellness app, was accompanied by technology upgrades that delivered a remarkable 30-fold increase in dispensing efficiency compared to the existing system. The impact was immediate: between December 2025 and January 2026, our pharmacy dispensed 70,384 items at an average value of £9.70, generating revenue in excess of £350,000 per month for the Company. By February 2026, our vertically integrated platform was fully operational, completing the closed loop between AI wellness insights, clinical prescribing and robotic fulfilment.</span></p><p class=\"\"><span>On the wellness side, we completed a major upgrade to the MedPal AI app and commenced rollout through two significant strategic partnerships: Independent Gyms, providing access to over 2,000 gym locations, and Epassi UK, connecting us with more than 11 million employees at major firms including Siemens and Volvo. The app has now reached 7,791 installs and continues to grow. We have also secured approval as an authorised purchaser of Eli Lilly pharmaceutical products in the UK, positioning MedPal AI to serve the rapidly expanding GLP-1 weight management market.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Review</span></strong></p><p class=\"\"><span>For the year ended 31 August 2025, the loss before tax was £4,001,912. These results are consistent with our expectations and reflect the planned investment phase during which we built our infrastructure, technology platform and public company governance framework ahead of revenue generation. Cash resources at 31 August 2025 stood at £1,537,124, providing the runway to execute our post-admission growth strategy.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Post Year End Corporate Activity</span></strong></p><p class=\"\"><span>Following year end, we continued to strengthen the balance sheet and broaden our international investor base. In addition to a placing and WRAP retail offer, our 'At-The-Market' equity issuance facility, announced on 4 December 2025, raised total gross proceeds of £1,993,100 (net proceeds of approximately £1,843,617) before closing on 25 February 2026. The proceeds have been directed towards working capital for our recently established online pharmaceutical subsidiary, MedPal Limited, including increased stockholding, product line expansion and marketing campaigns to grow MedPal Pharmacy and MedPal.clinic. We also secured a secondary listing on the Frankfurt Stock Exchange (Z1N), extending the Company's visibility to European institutional and retail investors.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Outlook</span></strong></p><p class=\"\"><span>In just six months since AIM admission, we have built and activated a fully operational, vertically integrated platform that is already generating substantial and growing monthly pharmacy revenue. With a national robotic distribution centre, direct AI-to-pharmacy integration, nearly 8,000 app installs, established pharmaceutical supply relationships and major distribution partnerships in place, the Company has created an outstanding foundation for scalable, capital-efficient growth.</span></p><p class=\"\"><span>We are in an exciting early-stage growth phase and will continue to invest in scaling operations, expanding our user base and deepening our pharmacy capabilities. The momentum we have achieved, combined with the strength of our unique closed-loop model, gives me and the Board considerable confidence in the significant opportunity ahead. We remain fully focused on disciplined execution, regulatory excellence and delivering long-term value for our shareholders.</span></p><p class=\"\"><span>Jason Drummond</span></p><p class=\"\"><span>Chief Executive Officer</span></p><p class=\"\"><span>MedPal AI plc</span></p><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Strategic Report</span></p><p class=\"\"><span>For the year ended 31 August 2025</span></p><p class=\"\"><span>Fair review of the business</span></p><p class=\"\"><span>Medpal AI plc (the \"Company\" or the \"Company\") is a UK-based digital health and artificial intelligence company focused on the development and commercialisation of AI-enabled healthcare platforms. The Company's strategy is to combine artificial intelligence, data analytics and regulated healthcare services to support patient engagement, clinical pathways and pharmacy services.</span></p><p class=\"\"><span>The year ended 31 August 2025 represented a formative period for the Company, during which it completed its admission to trading on the AIM Market of the London Stock Exchange on 26 August 2025. Admission provided the Company with access to public market capital, increased corporate profile and an enhanced platform from which to pursue its development and commercialisation strategy.</span></p><p class=\"\"><span>During the financial year, the Company's activities were primarily focused on technology development, corporate structuring, regulatory preparation and establishing the operational foundations required to support future revenue generation. The Company continued to develop its proprietary Medpal AI platform, with development efforts concentrated on enhancing the performance, scalability and usability of its AI-driven wellness application. This included refinement of machine learning models, improvements to data architecture and user experience design, and preparation for integration with regulated clinical and pharmacy services.</span></p><p class=\"\"><span>Revenues during the period were limited, reflecting the Company's early stage of development and its focus on platform build, regulatory readiness and strategic positioning rather than near-term monetisation. Costs incurred during the year principally related to research and development, professional fees associated with admission to AIM, and general administrative expenditure required to support the Company's transition to a listed company.</span></p><p class=\"\"><span>The Company managed its financial resources carefully throughout the year, balancing continued investment in product development and operational readiness with prudent cost control. Funds raised in connection with admission were applied in accordance with the Company's stated strategy, including technology development, working capital and the strengthening of governance, compliance and internal control frameworks.</span></p><p class=\"\"><span>Post year-end developments</span></p><p class=\"\"><span>Subsequent to the year end, the Company made significant progress in executing its strategy to expand into regulated healthcare services.</span></p><p class=\"\"><span>In October 2025, the Company announced the acquisition of certain assets from Universal Pharmacy Limited (in administration), including a Distance Selling Pharmacy (\"DSP\") contract, subject to regulatory approvals. On 4 November 2025, Medpal AI's wholly owned subsidiary, Medpal Limited, received formal approval from the Norfolk and Waveney Integrated Care Board for the change of ownership of the DSP contract. This approval enables the Company to dispense NHS prescriptions on a nationwide basis and represents the Company's first NHS contract.</span></p><p class=\"\"><span>The approval is considered a significant milestone, particularly in the context of the General Pharmaceutical Council's cessation of issuing new DSP licences in June 2025. Following approval, Medpal Limited commenced pharmacy operations and, in the period immediately after commencement, dispensed a material volume of NHS prescriptions, providing early evidence of operational capability and demand. These activities occurred after the financial year end and therefore did not contribute to revenue for the year ended 31 August 2025.</span></p><p class=\"\"><span>Subsequent to the year end, the Company launched MedPal.clinic, an AI-enabled digital pharmacy and telehealth platform designed to complement the Company's wellness application and support both NHS and private healthcare services.</span></p><p class=\"\"><span>The Directors believe that these post year-end developments materially enhance the Company's commercial prospects and provide a platform for the generation of revenues in future periods.</span></p><p class=\"\"><span>Looking forward, the Company's strategy remains focused on the continued development and commercialisation of its AI platform, the scaling of regulated pharmacy and clinical services, and the selective pursuit of strategic partnerships. The Directors consider that the Company is appropriately positioned to pursue its growth strategy while managing the risks inherent in operating within regulated healthcare and technology markets.</span></p><p class=\"\"><span>Refer to note 21 for further information.</span></p><p class=\"\"><span>Going concern</span></p><p class=\"\"><span>The Company financial statements have been prepared on the going concern basis, which contemplates that the Company will be able to realise its assets and discharge liabilities in the normal course of business. Despite this, there can be no assurance that the will either achieve or maintain profitability in the future and financial returns arising therefrom may be adversely affected by factors outside the control of the Company.</span></p><p class=\"\"><span>The independent auditors' opinion indicates that a material uncertainty exists with regard to going concern. Whilst acknowledging this uncertainty, the directors consider it appropriate to prepare the accounts on a going concern basis. The business is at a stage where it requires the maintenance of elevated working capital levels, principally to finance stock holdings necessary to support the rapidly growing customer demand that the pharmacy operation is experiencing.  As a new business, the Company has not yet secured extended credit terms with all of its pharmaceutical suppliers and is therefore currently funding a proportion of stock purchases on shorter settlement cycles. The Directors are actively engaged with suppliers and are confident that appropriate credit arrangements will be agreed in the near term, which will improve the Company's working capital efficiency. In the interim, the directors consider it appropriate to prepare the consolidated financial statements on a going concern basis for the following reasons:</span></p><p class=\"\"><span>·      during the year the Company raised £2,404,000 after fees from various equity raises including its IPO;</span></p><p class=\"\"><span>·      as disclosed in the post balance sheet events note 21, the Company completed various fundraise rounds post year end raising a total of £1,993,000 via its at the market (ATM) facility;</span></p><p class=\"\"><span>·      the Company has a further ability to implement another ATM facility if required;</span></p><p class=\"\"><span>·      the Company's Board of Directors have significant experience in the debt and equity capital markets and specifically have a successful track record in funding operations and are further considered capable of securing ongoing debt and equity capital financing for the Company; and</span></p><p class=\"\"><span>·      the Directors have the ability to slow the rate of growth of the business in order to preserve working capital.</span></p><p class=\"\"><span>In addition, the Directors are satisfied that the Company has appropriate financial controls and cash flow oversight in place to manage its cash requirements prudently and to support the continuation of its planned growth trajectory.</span></p><p class=\"\"><span>The independent auditor's report is set out in full as Note 22 to the accounts.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>CONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME</span></p><p class=\"\"><span>FOR THE YEAR ENDED 31 AUGUST 2025</span></p></td><td></td><td><p class=\"\"><span>31</span></p><p class=\"\"><span>August</span></p><p class=\"\"><span> 2025</span></p></td><td><p class=\"\"><span>31</span></p><p class=\"\"><span>August</span></p><p class=\"\"><span> 2024</span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>Audited</span></p></td><td><p class=\"\"><span>Unaudited</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Note</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Administrative expenses</span></p></td><td><p class=\"\"><span>3</span></p></td><td><p class=\"\"><span> (2,158,714)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Costs associated with the listing</span></p></td><td></td><td><p class=\"\"><span> (1,843,198)</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Operating loss</span></p></td><td></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Loss before taxation</span></p></td><td></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Taxation on profit on ordinary activities</span></p></td><td><p class=\"\"><span>6</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Loss for the period</span></p></td><td></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Other comprehensive income</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Total comprehensive loss for the period attributable to shareholders of the Company</span></p></td><td></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Earnings per share (basic and diluted) attributable to the equity holders (pence)</span></p></td><td><p class=\"\"><span>7</span></p></td><td><p class=\"\"><span>(2.29)</span></p></td><td><p class=\"\"><span>(0.03)</span></p></td></tr></tbody></table></div><p class=\"\"><span>The Company has taken advantage of the exemption available under section 408 of the Companies Act 2006 and has not presented its own profit and loss account in these financial statements. The Company's loss for the financial year was £4,001,912 (2024: £13,587).</span></p><p class=\"\"><span>The accompanying notes form an integral part of these consolidated financial statements.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>CONSOLIDATED STATEMENT OF FINANCIAL POSITION</span></p><p class=\"\"><span>AS AT 31 AUGUST 2025</span></p></td><td></td><td><p class=\"\"><span>As at 31 August 2025</span></p></td><td><p class=\"\"><span>As at 31 August 2024</span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>Audited</span></p></td><td><p class=\"\"><span>Unaudited</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Note</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>NON-CURRENT ASSETS</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Intangibles</span></p></td><td><p class=\"\"><span>9</span></p></td><td><p class=\"\"><span>257,318</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL NON-CURRENT ASSETS</span></p></td><td></td><td><p class=\"\"><span> 257,318</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>CURRENT ASSETS</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Trade and other receivables</span></p></td><td><p class=\"\"><span>10</span></p></td><td><p class=\"\"><span>254,751</span></p></td><td><p class=\"\"><span>32,500</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents</span></p></td><td><p class=\"\"><span>11</span></p></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL CURRENT ASSETS</span></p></td><td></td><td><p class=\"\"><span> 1,791,875</span></p></td><td><p class=\"\"><span>32,753</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL ASSETS</span></p></td><td></td><td><p class=\"\"><span> 2,049,193</span></p></td><td><p class=\"\"><span>32,753</span></p></td></tr><tr><td><p class=\"\"><span>EQUITY</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Share capital</span></p></td><td><p class=\"\"><span>13</span></p></td><td><p class=\"\"><span> 82,616</span></p></td><td><p class=\"\"><span>4,620</span></p></td></tr><tr><td><p class=\"\"><span>Share premium</span></p></td><td><p class=\"\"><span>13</span></p></td><td><p class=\"\"><span> 1,957,900</span></p></td><td><p class=\"\"><span>66,330</span></p></td></tr><tr><td><p class=\"\"><span>Share based payments reserve</span></p></td><td><p class=\"\"><span>14</span></p></td><td><p class=\"\"><span> 3,433,078</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Retained earnings</span></p></td><td></td><td><p class=\"\"><span> (4,084,843)</span></p></td><td><p class=\"\"><span>(82,931)</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL EQUITY/RETAINED DEFICIT</span></p></td><td></td><td><p class=\"\"><span> 1,388,751</span></p></td><td><p class=\"\"><span>(11,981)</span></p></td></tr><tr><td><p class=\"\"><span>CURRENT LIABILITIES</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Trade and other payables</span></p></td><td><p class=\"\"><span>12</span></p></td><td><p class=\"\"><span> 660,442</span></p></td><td><p class=\"\"><span>44,734</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL CURRENT LIABILITIES</span></p></td><td></td><td><p class=\"\"><span> 660,442</span></p></td><td><p class=\"\"><span>44,734</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL LIABILITIES</span></p></td><td></td><td><p class=\"\"><span> 660,442</span></p></td><td><p class=\"\"><span>44,734</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL EQUITY AND LIABILITIES</span></p></td><td></td><td><p class=\"\"><span> 2,049,193</span></p></td><td><p class=\"\"><span>32,753</span></p></td></tr></tbody></table></div><p class=\"\"><span>The accompanying notes form an integral part of these consolidated financial statements.</span></p><p class=\"\"><span>The financial statements were approved by the board on 27 February 2026 and were signed on its behalf by</span></p><p class=\"\"><span>Jason Drummond, CEO.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>PARENT STATEMENT OF FINANCIAL POSITION</span></p><p class=\"\"><span>AS AT 31 AUGUST 2025</span></p></td><td></td><td><p class=\"\"><span>As at 31 August 2025</span></p></td><td><p class=\"\"><span>As at 31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Notes</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>Audited</span></p></td><td><p class=\"\"><span>Unaudited</span></p></td></tr><tr><td><p class=\"\"><span>NON-CURRENT ASSETS</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Investments in subsidiaries</span></p></td><td><p class=\"\"><span>8</span></p></td><td><p class=\"\"><span>1</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Intangibles</span></p></td><td><p class=\"\"><span>9</span></p></td><td><p class=\"\"><span> 257,318</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL NON-CURRENT ASSETS</span></p></td><td></td><td><p class=\"\"><span> 257,319</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>CURRENT ASSETS</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Trade and other receivables</span></p></td><td><p class=\"\"><span>10</span></p></td><td><p class=\"\"><span>254,751</span></p></td><td><p class=\"\"><span>32,500</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents</span></p></td><td><p class=\"\"><span>11</span></p></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL CURRENT ASSETS</span></p></td><td></td><td><p class=\"\"><span> 1,791,875</span></p></td><td><p class=\"\"><span>32,753</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL ASSETS</span></p></td><td></td><td><p class=\"\"><span> 2,049,194</span></p></td><td><p class=\"\"><span>32,753</span></p></td></tr><tr><td><p class=\"\"><span>EQUITY</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Share capital</span></p></td><td><p class=\"\"><span>13</span></p></td><td><p class=\"\"><span> 82,616</span></p></td><td><p class=\"\"><span>4,620</span></p></td></tr><tr><td><p class=\"\"><span>Share premium</span></p></td><td><p class=\"\"><span>13</span></p></td><td><p class=\"\"><span> 1,957,900</span></p></td><td><p class=\"\"><span>66,330</span></p></td></tr><tr><td><p class=\"\"><span>Share based payments reserve</span></p></td><td><p class=\"\"><span>15</span></p></td><td><p class=\"\"><span> 3,433,078</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Retained earnings</span></p></td><td></td><td><p class=\"\"><span> (4,084,843)</span></p></td><td><p class=\"\"><span>(82,931)</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL EQUITY/RETAINED DEFICIT</span></p></td><td></td><td><p class=\"\"><span> 1,388,751</span></p></td><td><p class=\"\"><span>(11,981)</span></p></td></tr><tr><td><p class=\"\"><span>CURRENT LIABILITIES</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Intercompany payable</span></p></td><td></td><td><p class=\"\"><span>1</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Trade and other payables</span></p></td><td><p class=\"\"><span>12</span></p></td><td><p class=\"\"><span> 660,442</span></p></td><td><p class=\"\"><span>44,734</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL CURRENT LIABILITIES</span></p></td><td></td><td><p class=\"\"><span> 660,443</span></p></td><td><p class=\"\"><span>44,734</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL LIABILITIES</span></p></td><td></td><td><p class=\"\"><span> 660,443</span></p></td><td><p class=\"\"><span>44,734</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL EQUITY AND LIABILITIES</span></p></td><td></td><td><p class=\"\"><span> 2,049,194</span></p></td><td><p class=\"\"><span>32,753</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>CONSOLIDATED COMPANY STATEMENT OF CHANGES IN EQUITY</span></p><p class=\"\"><span>FOR THE YEAR ENDED 31 AUGUST 2025</span></p></td><td><p class=\"\"><span>Share capital</span></p></td><td><p class=\"\"><span>Share premium</span></p></td><td><p class=\"\"><span>Share based payments reserve</span></p></td><td><p class=\"\"><span>Retained earnings</span></p></td><td><p class=\"\"><span>Total equity</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2023</span></p></td><td><p class=\"\"><span>4,550</span></p></td><td><p class=\"\"><span>59,400</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(69,344)</span></p></td><td><p class=\"\"><span>(5,394)</span></p></td></tr><tr><td><p class=\"\"><span>Loss for the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Total comprehensive income for the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Ordinary Shares issued in the year</span></p></td><td><p class=\"\"><span>70</span></p></td><td><p class=\"\"><span>6,930</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>7,000</span></p></td></tr><tr><td><p class=\"\"><span>Share issue costs</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td><p class=\"\"><span>70</span></p></td><td><p class=\"\"><span>6,930</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>7,000</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2024</span></p></td><td><p class=\"\"><span>4,620</span></p></td><td><p class=\"\"><span>66,330</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(82,931)</span></p></td><td><p class=\"\"><span>(11,981)</span></p></td></tr><tr><td><p class=\"\"><span>  Loss for the year</span></p></td><td><p class=\"\"><span>- </span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td></tr><tr><td><p class=\"\"><span>Total comprehensive income for the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>  Ordinary Shares issued in the year</span></p></td><td><p class=\"\"><span>         77,996</span></p></td><td><p class=\"\"><span>      3,135,694</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>         3,213,690</span></p></td></tr><tr><td><p class=\"\"><span>  Share issue costs</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>     (1,244,124)</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>        (1,244,124)</span></p></td></tr><tr><td><p class=\"\"><span>  Warrants and options issued in the current year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>3,433,078</span></p></td><td></td><td><p class=\"\"><span>3,433,078</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td><p class=\"\"><span>         77,996</span></p></td><td><p class=\"\"><span>      1,891,570</span></p></td><td><p class=\"\"><span>3,433,078</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>5,402,644</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2025</span></p></td><td><p class=\"\"><span>82,616</span></p></td><td><p class=\"\"><span>1,957,900</span></p></td><td><p class=\"\"><span>3,433,078</span></p></td><td><p class=\"\"><span>(4,084,843)</span></p></td><td><p class=\"\"><span>1,388,751</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>PARENT COMPANY STATEMENT OF CHANGES IN EQUITY</span></p><p class=\"\"><span>FOR THE YEAR ENDED 31 AUGUST 2025</span></p></td><td><p class=\"\"><span>Share capital</span></p></td><td><p class=\"\"><span>Share premium</span></p></td><td><p class=\"\"><span>Share based payments reserve</span></p></td><td><p class=\"\"><span>Retained earnings</span></p></td><td><p class=\"\"><span>Total equity</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2023</span></p></td><td><p class=\"\"><span>4,550</span></p></td><td><p class=\"\"><span>59,400</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(69,344)</span></p></td><td><p class=\"\"><span>(5,394)</span></p></td></tr><tr><td><p class=\"\"><span>Loss for the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Total comprehensive income for the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Ordinary Shares issued in the year</span></p></td><td><p class=\"\"><span>70</span></p></td><td><p class=\"\"><span>6,930</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>7,000</span></p></td></tr><tr><td><p class=\"\"><span>Share issue costs</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td><p class=\"\"><span>70</span></p></td><td><p class=\"\"><span>6,930</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>7,000</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2024</span></p></td><td><p class=\"\"><span>4,620</span></p></td><td><p class=\"\"><span>66,330</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(82,931)</span></p></td><td><p class=\"\"><span>(11,981)</span></p></td></tr><tr><td><p class=\"\"><span>  Loss for the year</span></p></td><td><p class=\"\"><span>- </span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td></tr><tr><td><p class=\"\"><span>Total comprehensive income for the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td><td><p class=\"\"><span> (4,001,912)</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>  Ordinary Shares issued in the year</span></p></td><td><p class=\"\"><span>         77,996</span></p></td><td><p class=\"\"><span>      3,135,694</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>         3,213,690</span></p></td></tr><tr><td><p class=\"\"><span>  Share issue costs</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>     (1,244,124)</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>        (1,244,124)</span></p></td></tr><tr><td><p class=\"\"><span>  Warrants and options issued in the current year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>3,433,078</span></p></td><td></td><td><p class=\"\"><span>3,433,078</span></p></td></tr><tr><td><p class=\"\"><span>Transactions with owners in own capacity</span></p></td><td><p class=\"\"><span>         77,996</span></p></td><td><p class=\"\"><span>      1,891,570</span></p></td><td><p class=\"\"><span>3,433,078</span></p></td><td><p class=\"\"><span>(4,084,843)</span></p></td><td><p class=\"\"><span>1,388,751</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2025</span></p></td><td><p class=\"\"><span>82,616</span></p></td><td><p class=\"\"><span>1,957,900</span></p></td><td><p class=\"\"><span>3,433,078</span></p></td><td><p class=\"\"><span>(4,084,843)</span></p></td><td><p class=\"\"><span>1,388,751</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>CONSOLIDATED STATEMENT OF CASHFLOWS</span></p><p class=\"\"><span>FOR THE YEAR ENDED 31 AUGUST 2025</span></p></td><td><p class=\"\"><span>Notes</span></p></td><td><p class=\"\"><span>As at 31 August 2025    </span></p></td><td><p class=\"\"><span>As at 31 August 2024   </span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>Audited</span></p></td><td><p class=\"\"><span>Unaudited</span></p></td></tr><tr><td><p class=\"\"><span>Cash from operating activities</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Loss for the year</span></p></td><td></td><td><p class=\"\"><span>(4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Adjustments for:</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Share-based payments</span></p></td><td></td><td><p class=\"\"><span>2,385,347</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Operating cashflow before working capital movements</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Decrease / (Increase) in trade and other receivables</span></p></td><td></td><td><p class=\"\"><span>-222,251</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>(Decrease) / Increase in trade and other payables</span></p></td><td></td><td><p class=\"\"><span>1,035,710</span></p></td><td><p class=\"\"><span>9,839</span></p></td></tr><tr><td><p class=\"\"><span>Net cash outflow from operating activities</span></p></td><td></td><td><p class=\"\"><span>(803,106)</span></p></td><td><p class=\"\"><span>(3,748)</span></p></td></tr><tr><td><p class=\"\"><span>Cash from investing activities</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>   Development of intangible asset</span></p></td><td></td><td><p class=\"\"><span>(64,818)</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Net cash outflow from investing activities</span></p></td><td></td><td><p class=\"\"><span>(64,818)</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Cash from financing activities</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Proceeds on the issue of shares, net of issue costs</span></p></td><td><p class=\"\"><span>13</span></p></td><td><p class=\"\"><span>2,404,795</span></p></td><td><p class=\"\"><span>3,920</span></p></td></tr><tr><td><p class=\"\"><span>Net cash from financing activities</span></p></td><td></td><td><p class=\"\"><span>2,404,795</span></p></td><td><p class=\"\"><span>3,920</span></p></td></tr><tr><td><p class=\"\"><span>Net  (decrease) / increase in cash and cash equivalents</span></p></td><td></td><td><p class=\"\"><span>1,536,871</span></p></td><td><p class=\"\"><span>172</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents at beginning of year</span></p></td><td></td><td><p class=\"\"><span>253</span></p></td><td><p class=\"\"><span>81</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents at end of period</span></p></td><td><p class=\"\"><span>11</span></p></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr></tbody></table></div><p class=\"\"><span>The following were material non-cash transactions during the year:</span></p><p class=\"\"><span>·        £3,433,078 of options and warrants were issued to directors and advisers of the Company for assistance with the IPO.</span></p><p class=\"\"><span>The accompanying notes on pages 36 to 55 form an integral part of these financial statements.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>PARENT STATEMENT OF CASHFLOWS</span></p><p class=\"\"><span>FOR THE YEAR ENDED 31 AUGUST 2025</span></p></td><td><p class=\"\"><span>Notes</span></p></td><td><p class=\"\"><span>As at 31 August 2025</span></p></td><td><p class=\"\"><span>As at 31 August 2024    </span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>Audited</span></p></td><td><p class=\"\"><span>Unaudited</span></p></td></tr><tr><td><p class=\"\"><span>Cash from operating activities</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Loss for the year</span></p></td><td></td><td><p class=\"\"><span>(4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Adjustments for:</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Share-based payments</span></p></td><td></td><td><p class=\"\"><span>2,385,347</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Operating cashflow before working capital movements</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Decrease / (Increase) in trade and other receivables</span></p></td><td></td><td><p class=\"\"><span>-222,251</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>(Decrease) / Increase in trade and other payables</span></p></td><td></td><td><p class=\"\"><span>1,035,710</span></p></td><td><p class=\"\"><span>9,839</span></p></td></tr><tr><td><p class=\"\"><span>Net cash outflow from operating activities</span></p></td><td></td><td><p class=\"\"><span>(803,106)</span></p></td><td><p class=\"\"><span>(3,748)</span></p></td></tr><tr><td><p class=\"\"><span>Cash from investing activities</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>   Development of intangible asset</span></p></td><td></td><td><p class=\"\"><span>(64,818)</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Net cash outflow from investing activities</span></p></td><td></td><td><p class=\"\"><span>(64,818)</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Cash from financing activities</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Proceeds on the issue of shares, net of issue costs</span></p></td><td><p class=\"\"><span>13</span></p></td><td><p class=\"\"><span>2,404,795</span></p></td><td><p class=\"\"><span>3,920</span></p></td></tr><tr><td><p class=\"\"><span>Net cash from financing activities</span></p></td><td></td><td><p class=\"\"><span>2,404,795</span></p></td><td><p class=\"\"><span>3,920</span></p></td></tr><tr><td><p class=\"\"><span>Net  (decrease) / increase in cash and cash equivalents</span></p></td><td></td><td><p class=\"\"><span>1,536,871</span></p></td><td><p class=\"\"><span>172</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents at beginning of year</span></p></td><td></td><td><p class=\"\"><span>253</span></p></td><td><p class=\"\"><span>81</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents at end of period</span></p></td><td><p class=\"\"><span>11</span></p></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr></tbody></table></div><p class=\"\"><span>The following were material non-cash transactions during the year:</span></p><p class=\"\"><span>·        £3,433,078 of options and warrants were issued to directors and advisers of the Company for assistance with the IPO.</span></p><p class=\"\"><span>The accompanying notes below form an integral part of these financial statements.</span></p><p class=\"\"><span>1.       General Information</span></p><p class=\"\"><span>The Company was incorporated in England and Wales on 23 August 2021 under the Companies Act 2006 as a private limited company. The Company subsequently re-registered as a public limited company and changed its name to Medpal AI plc in advance of its admission to trading on the AIM market of the London Stock Exchange.</span></p><p class=\"\"><span>The Company was admitted to trading on AIM on 26 August 2025 as part of its initial public offering (\"IPO\"), raising capital to support the development and commercialisation of its technology platform. The Company is registered in England and Wales and operates in accordance with the Companies Act 2006.</span></p><p class=\"\"><span>The registered office of the Company is 8th Floor The Broadgate Tower, 20 Primrose Street, London, United Kingdom, EC2A 2EW.</span></p><p class=\"\"><span>The principal activity of the Company is the development and commercialisation of artificial intelligence-enabled digital health and healthcare technology products and service.</span></p><p class=\"\"><span>1.1.    Basis of preparation</span></p><p class=\"\"><span>The financial statements for the period ended 31 August 2025 have been prepared by Medpal AI Plc in accordance with UK adopted International Accounting Standards (\"UK-IAS\") and with the requirements of the Companies Act 2006. The financial statements have been prepared under the historical cost convention.</span></p><p class=\"\"><span>1.2.     Basis of consolidation</span></p><p class=\"\"><span>The consolidated financial statements incorporate the financial statements of the Company and entities controlled by the Company (its subsidiaries) made up to 31 August each year. Per IFRS 10, control is achieved when the Company:</span></p><p class=\"\"><span>·      has the power over the investee;</span></p><p class=\"\"><span>·      is exposed, or has rights, to variable returns from its involvement with the investee; and</span></p><p class=\"\"><span>·      has the ability to use its power to affects its returns.</span></p><p class=\"\"><span>The Company reassesses whether or not it controls an investee if facts and circumstances indicate that there are changes to one or more of the three elements of control listed above.  When the Company has less than a majority of the voting rights of an investee, it considers that it has power over the investee when the voting rights are sufficient to give it the practical ability to direct the relevant activities of the investee unilaterally. The Company considers all relevant facts and circumstances in assessing whether or not the Company's voting rights in an investee are sufficient to give it power, including:</span></p><p class=\"\"><span>·    the size of the Company's holding of voting rights relative to the size and dispersion of holdings of the other vote holders;</span></p><p class=\"\"><span>·     potential voting rights held by the Company, other vote holders or other parties;</span></p><p class=\"\"><span>·     rights arising from other contractual arrangements; and</span></p><p class=\"\"><span>·    any additional facts and circumstances that indicate that the Company has, or does not have,      the current ability to direct the relevant activities at the time that decisions need to be made, including voting patterns at previous shareholders' meetings.</span></p><p class=\"\"><span>Consolidation of a subsidiary begins when the Company obtains control over the subsidiary and ceases when the Company loses control of the subsidiary. Specifically, the results of subsidiaries acquired or disposed of during the year are included in profit or loss from the date the Company gains control until the date when the Company ceases to control the subsidiary.  Where necessary, adjustments are made to the financial statements of subsidiaries to bring the accounting policies used into line with the Group's accounting policies.</span></p><p class=\"\"><span>All intragroup assets and liabilities, equity, income, expenses and cash flows relating to transactions between the members of the Group are eliminated on consolidation.</span></p><p class=\"\"><span>The Group recognises any non-controlling interest in the acquired entity at the non-controlling interest's proportionate share of the acquired entity's net identifiable assets.  Subsequent to acquisition, the carrying amount of non-controlling interests is the amount of those interests at initial recognition plus the non-controlling interests' share of subsequent changes in equity.</span></p><p class=\"\"><span>Profit or loss and each component of other comprehensive income are attributed to the owners of the Company and to the non-controlling interests. Total comprehensive income of the subsidiaries is attributed to the owners of the Company and to the non-controlling interests even if this results in the non-controlling interests having a deficit balance.</span></p><p class=\"\"><span>1.3.  Investment in subsidiary</span></p><p class=\"\"><span>The consolidated financial statements incorporate the results of subsidiaries using the acquisition method. In the statement of financial position, the acquiree's identifiable assets, liabilities and contingent liabilities are initially recognised at their fair values at the acquisition date. The results of acquired operations are included in the consolidated statement of comprehensive income from the date on which control is obtained. They are deconsolidated from the date on which control ceases.</span></p><p class=\"\"><span>1.4.  Going concern</span></p><p class=\"\"><span>The Company financial statements have been prepared on the going concern basis, which contemplates that the Company will be able to realise its assets and discharge liabilities in the normal course of business. Despite this, there can be no assurance that the will either achieve or maintain profitability in the future and financial returns arising therefrom may be adversely affected by factors outside the control of the Company.</span></p><p class=\"\"><span>The independent auditors' opinion indicates that a material uncertainty exists with regard to going concern. Whilst acknowledging this uncertainty, the directors consider it appropriate to prepare the accounts on a going concern basis. The business is at a stage where it requires the maintenance of elevated working capital levels, principally to finance stock holdings necessary to support the rapidly growing customer demand that the pharmacy operation is experiencing.  As a new business, the Company has not yet secured extended credit terms with all of its pharmaceutical suppliers and is therefore currently funding a proportion of stock purchases on shorter settlement cycles. The Directors are actively engaged with suppliers and are confident that appropriate credit arrangements will be agreed in the near term, which will improve the Company's working capital efficiency. In the interim, the directors consider it appropriate to prepare the consolidated financial statements on a going concern basis for the following reasons:</span></p><p class=\"\"><span>·      during the year the Company raised £2,404,000 after fees from various equity raises including its IPO;</span></p><p class=\"\"><span>·      as disclosed in the post balance sheet events note 21, the Company completed various fundraise rounds post year end raising a total of £1,993,000 via its at the market (ATM) facility;</span></p><p class=\"\"><span>·      the Company has a further ability to implement another ATM facility if required;</span></p><p class=\"\"><span>·      the Company's Board of Directors have significant experience in the debt and equity capital markets and specifically have a successful track record in funding operations and are further considered capable of securing ongoing debt and equity capital financing for the Company; and</span></p><p class=\"\"><span>·      the Directors have the ability to slow the rate of growth of the business in order to preserve working capital.</span></p><p class=\"\"><span>In addition, the Directors are satisfied that the Company has appropriate financial controls and cash flow oversight in place to manage its cash requirements prudently and to support the continuation of its planned growth trajectory.</span></p><p class=\"\"><span>1.5.    Cash and cash equivalents</span></p><p class=\"\"><span>Cash and cash equivalents comprise cash at bank and in hand, and demand deposits with banks and other financial institutions. A material amount of cash and cash equivalents is held with alternative financial institutions. These funds are fully unrestricted.</span></p><p class=\"\"><span>1.6.    Foreign currency translation</span></p><p class=\"\"><span>The financial statements are presented in Sterling which is the Company's functional and presentational currency.</span></p><p class=\"\"><span>Transactions in currencies other than the functional currency are recognised at the rates of exchange on the dates of the transactions.  At each balance sheet date, monetary assets and liabilities are retranslated at the rates prevailing at the balance sheet date with differences recognised in the Statement of comprehensive income in the period in which they arise.</span></p><p class=\"\"><span>1.7.    Trade and other receivables</span></p><p class=\"\"><span>Trade and other receivables are measured at amortised cost, using the effective interest method, less any impairment loss. An allowance for impairment of trade and other receivables is established based on the twelve month expected credit losses unless the credit quality has deteriorated since inception, in which case it is based on lifetime losses.</span></p><p class=\"\"><span>1.8.    Intangible asset- Internally generated development costs</span></p><p class=\"\"><span>Internally generated intangible assets relate to development expenditure incurred in respect of the Company's AI platform.</span></p><p class=\"\"><span>Expenditure on research activities is recognised as an expense in the period in which it is incurred. Development expenditure is capitalised only when the Directors can demonstrate all of the following in accordance with IAS 38 </span><em><span>Intangible Assets</span></em><span>: the technical feasibility of completing the asset so that it will be available for use; the intention to complete and use the asset; the ability to use the asset; the manner in which the asset is expected to generate probable future economic benefits; the availability of adequate technical, financial and other resources to complete the development; and the ability to reliably measure the expenditure attributable to the asset.</span></p><p class=\"\"><span>Capitalised development costs are initially measured at cost. As at 31 August 2025, the Group's AI platform remained under development was not yet available for use. Accordingly, the related development expenditure has been classified as an intangible asset under development and has not been amortised.</span></p><p class=\"\"><span>Amortisation will commence when the asset is available for use, being when it is in the location and condition necessary for it to operate as intended by management, and will be charged on a straight-line basis over the asset's estimated useful economic life. The asset is assessed annually for indicators of impairment and tested for impairment when such indicators exist, in accordance with IAS 36 </span><em><span>Impairment of Assets</span></em><span>.</span></p><p class=\"\"><span>1.9.    Financial instruments</span></p><p class=\"\"><span>IFRS 9 requires an entity to address the classification, measurement and recognition of financial assets and liabilities.</span></p><p class=\"\"><span>a)   Classification</span></p><p class=\"\"><span>The Company classifies its financial assets in the following measurement categories:</span></p><p class=\"\"><span>·        those to be measured subsequently at fair value (either through OCI or through profit or loss);</span></p><p class=\"\"><span>·        those to be measured at amortised cost; and</span></p><p class=\"\"><span>·        those to be measured subsequently at fair value through profit or loss.</span></p><p class=\"\"><span>The classification depends on the Company's business model for managing the financial assets and the contractual terms of the cashflows.</span></p><p class=\"\"><span>For assets measured at fair value, gains and losses will be recorded either in profit or loss or in OCI. For investments in equity instruments that are not held for trading, this will depend on whether the Company has made an irrevocable election at the time of initial recognition to account for the equity investment at fair value through other comprehensive income (FVOCI).</span></p><p class=\"\"><span>b)   Recognition</span></p><p class=\"\"><span>Purchases and sales of financial assets are recognised on trade date (that is, the date on which the Company commits to purchase or sell the asset). Financial assets are derecognised when the rights to receive cashflows from the financial assets have expired or have been transferred and the Company has transferred substantially all the risks and rewards of ownership.</span></p><p class=\"\"><span>c)   Measurement</span></p><p class=\"\"><span>At initial recognition, the Company measures a financial asset at its fair value plus, in the case of a financial asset not at fair value through profit or loss (FVPL), transaction costs that are directly attributable to the acquisition of the financial asset.</span></p><p class=\"\"><span>Transaction costs of financial assets carried at FVPL are expensed in profit or loss.</span></p><p class=\"\"><span>Debt instruments</span></p><p class=\"\"><span>Amortised cost: Assets that are held for collection of contractual cashflows, where those cashflows represent solely payments of principal and interest, are measured at amortised cost. Interest income from these financial assets is included in finance income using the effective interest rate method. Any gain or loss arising on derecognition is recognised directly in profit or loss and presented in other gains/(losses) together with foreign exchange gains and losses. Impairment losses are presented as a separate line item in the statement of profit or loss.</span></p><p class=\"\"><span>Equity instruments</span></p><p class=\"\"><span>The Company subsequently measures all equity investments at fair value. Dividends from such investments continue to be recognised in profit or loss as other income when the Company's right to receive payments is established. Changes in the fair value of financial assets at FVPL are recognised in other gains/(losses) in the statement of profit or loss as applicable.</span></p><p class=\"\"><span>d)   Impairment</span></p><p class=\"\"><span>The Company assesses, on a forward-looking basis, the expected credit losses associated with any debt instruments carried at amortised cost. The impairment methodology applied depends on whether there has been a significant increase in credit risk. For trade receivables, the Company applies the simplified approach permitted by IFRS 9, which requires expected lifetime losses to be recognised from initial recognition of the receivables.</span></p><p class=\"\"><span>1.10.  Equity</span></p><p class=\"\"><span>Share capital is determined using the nominal value of shares that have been issued.</span></p><p class=\"\"><span>The Share premium account includes any premiums received on the initial issuing of the share capital. Any transaction costs associated with the issuing of shares are deducted from the Share premium account, net of any related income tax benefits.</span></p><p class=\"\"><span>Equity-settled share-based payments are credited to a share-based payment reserve as a component of equity until related options or warrants are exercised or lapse.</span></p><p class=\"\"><span>Based on IFRS 2, for equity-settled share-based payment transactions, the entity shall measure the goods or services received, and the corresponding increase in equity, directly, at the fair value of the goods or services received, unless that fair value cannot be estimated reliably. The fair value of the service received in exchange for the grant of options and warrants is recognised as an expense, other than those warrants that were issued in relation to the listing which have been recorded against share premium in equity. If the entity cannot estimate reliably the fair value of the goods or services received, the entity shall measure their value, and the corresponding increase in equity, indirectly, by reference to the fair value of the equity instruments granted.  The seed warrants issued to the investors and directors in raising private equity funds is not within the scope of IFRS 2 and accounting policy mentioned doesn't apply.</span></p><p class=\"\"><span>Share capital to be issued refers to shares that are expected to be settled through the issuance of the Company's equity instruments as of the year-end. In accordance with IAS 32, since these meet the definition of equity, they are classified within equity as 'shares to be issued' and are measured at fair value.\"</span></p><p class=\"\"><span>Retained earnings includes all current and prior period results as disclosed in the income statement.</span></p><p class=\"\"><span>1.11.  Segment reporting</span></p><p class=\"\"><span>Operating segments are reported in a manner consistent with the internal reporting provided to the chief operating decision makers. The chief operating decision maker, being responsible for allocating resources and assessing performance of the operating segments, has been identified as the executive Board of Directors.</span></p><p class=\"\"><span>1.12.  Taxation</span></p><p class=\"\"><span>Tax currently payable is based on taxable profit for the period. Taxable profit differs from profit as reported in the income statement because it excludes items of income and expense that are taxable or deductible in other years and it further excludes items that are never taxable or deductible. The liability for current tax is calculated using tax rates that have been enacted or substantively enacted by the balance sheet date.</span></p><p class=\"\"><span>Deferred tax is recognised on differences between the carrying amounts of assets and liabilities in the financial statements and the corresponding tax bases used in the computation of taxable profit, and is accounted for using the balance sheet liability method. Deferred tax liabilities are generally recognised for all taxable temporary differences and deferred tax assets are recognised to the extent that it is probable that taxable profits will be available against which deductible temporary differences can be utilised. Such assets and liabilities are not recognised if the temporary difference arises from initial recognition of goodwill or from the initial recognition (other than in a business combination) of other assets and liabilities in a transaction that affects neither the taxable profit nor the accounting profit.</span></p><p class=\"\"><span>Deferred tax liabilities are recognised for taxable temporary differences arising on investments in subsidiaries and associates, and interests in joint ventures, except where the Company is able to control the reversal of the temporary difference and it is probable that the temporary difference will not reverse in the foreseeable future.</span></p><p class=\"\"><span>The carrying amount of deferred tax assets is reviewed at each balance sheet date and reduced to the extent that it is no longer probable that sufficient taxable profits will be available to allow all or part of the asset to be recovered.</span></p><p class=\"\"><span>Deferred tax is calculated at the tax rates that are expected to apply in the period when the liability is settled or the asset realised. Deferred tax is charged or credited to profit or loss, except when it relates to items charged or credited directly to equity, in which case the deferred tax is also dealt with in equity.</span></p><p class=\"\"><span>Deferred tax assets and liabilities are offset when there is a legally enforceable right to set off current tax assets against current tax liabilities and when they relate to income taxes levied by the same taxation authority and the Company intends to settle its current tax assets and liabilities on a net basis.</span></p><p class=\"\"><span>1.13.  Critical accounting judgements and key sources of estimation uncertainty</span></p><p class=\"\"><span>The preparation of the financial statements requires management to make judgements, estimates and assumptions that affect the amounts reported for revenues and expenses during the period and the amounts reported for assets and liabilities at the balance sheet date. However, the nature of estimation means that the actual outcomes could differ from those estimates.</span></p><p class=\"\"><span>Estimates and underlying assumptions are reviewed on an ongoing basis. Revisions to accounting estimates are recognised in the period in which the estimates are revised and in any future periods affected. The significant accounting judgements and key sources of estimation uncertainty affecting the Company are disclosed below.</span></p><p class=\"\"><span>Capitalisation of internally generated intangible assets</span></p><p class=\"\"><span>The Company has capitalised development expenditure in respect of its AI platform, which is classified as an intangible asset under development at 31 August 2025. In determining whether development costs meet the recognition criteria set out in IAS 38 Intangible Assets, the Directors have exercised judgement in assessing whether the platform is technically feasible, whether there is an intention and ability to complete and use the asset, whether adequate resources are available, and whether the platform is expected to generate probable future economic benefits.</span></p><p class=\"\"><span>The Directors also apply judgement in determining the point at which development expenditure should be capitalised and in distinguishing between research and development activities. Development costs continue to be classified as work in progress and are not amortised until the asset is available for use.</span></p><p class=\"\"><span>Impairment of intangible assets under development</span></p><p class=\"\"><span>Intangible assets under development are not amortised but are tested for impairment annually, or more frequently if there are indicators of impairment, in accordance with IAS 36 Impairment of Assets. The Directors have exercised judgement in assessing whether any such indicators exist at the reporting date.</span></p><p class=\"\"><span>The impairment assessment requires the estimation of the recoverable amount of the asset, being the higher of its value in use and fair value less costs of disposal. This involves significant judgement, including assumptions relating to the timing of commercialisation, expected future cash flows, growth rates and discount rates. Actual outcomes may differ from these estimates and could result in a material adjustment to the carrying value of the intangible asset in future periods.</span></p><p class=\"\"><span>New standards and interpretations not yet adopted</span></p><p class=\"\"><span>The Company has adopted the below standards, amendments or interpretations for the first time for its annual reporting period commencing 1 January 2024 which do not have a material impact on the Company:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Standard</span></p></td><td><p class=\"\"><span>Effective Date</span></p></td></tr><tr><td><p class=\"\"><span>IFRS S1 General Requirements for Disclosure of Sustainability-related Financial Information</span></p></td><td><p class=\"\"><span>1 January 2024*</span></p></td></tr><tr><td><p class=\"\"><span>IFRS S2 Climate-related Disclosures</span></p></td><td><p class=\"\"><span>1 January 2024*</span></p></td></tr><tr><td><p class=\"\"><span>Amendments to IAS 21 - Lack of Exchangeability</span></p></td><td><p class=\"\"><span>1 January 2025</span></p></td></tr></tbody></table></div><p class=\"\"><span>At the date of approval of these financial statements, the following standards and interpretations which have not been applied in these financial statements were in issue but not yet effective (and in some cases have not yet been adopted by the UK): </span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Standard</span></p></td><td><p class=\"\"><span>Effective Date</span></p></td></tr><tr><td><p class=\"\"><span>Annual Improvements to IFRS standards - Volume 11</span></p></td><td><p class=\"\"><span>1 January 2026</span></p></td></tr><tr><td><p class=\"\"><span>Amendments to IFRS 9 Financial Instruments and IFRS 7 Financial Instruments: Disclosures: Classification and Measurement of Financial Instruments</span></p></td><td><p class=\"\"><span>1 January 2026 *</span></p></td></tr><tr><td><p class=\"\"><span>IFRS 18 Presentation and Disclosure in Financial Statements</span></p></td><td><p class=\"\"><span>1 January 2027 *</span></p></td></tr></tbody></table></div><p class=\"\"><span>*-Not yet endorsed in the UK</span></p><p class=\"\"><span>The effect of these new and amended Standards and Interpretations which are in issue but not yet mandatorily effective is not expected to be material.</span></p><p class=\"\"><span>2.       Segmental analysis</span></p><p class=\"\"><span>The Company has two reportable segments, Software and Corporate, which are the Company's strategic divisions. For each of the strategic divisions, the Board reviews internal management reports on a regular basis. .</span></p><p class=\"\"><span>The Company generated no revenue during the year ended 31 August 2025 (2024: £0).</span></p><p class=\"\"><span>Segmental results are detailed below for the year ended 31 August 2025:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Corporate</span></p></td><td><p class=\"\"><span>Software</span></p></td><td><p class=\"\"><span>        Total</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Operating loss from continued operations per reportable segment</span></p></td><td><p class=\"\"><span>(4,001,912)</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(4,001,912)</span></p></td></tr><tr><td><p class=\"\"><span>Reportable segment assets</span></p></td><td><p class=\"\"><span>1,791,875</span></p></td><td><p class=\"\"><span>257,318</span></p></td><td><p class=\"\"><span>2,049,193</span></p></td></tr><tr><td><p class=\"\"><span>Reportable segment liabilities</span></p></td><td><p class=\"\"><span>(660,442)</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(660,442)</span></p></td></tr><tr><td><p class=\"\"><span>Net assets</span></p></td><td><p class=\"\"><span>1,131,433</span></p></td><td><p class=\"\"><span>257,318</span></p></td><td><p class=\"\"><span>1,388,751</span></p></td></tr></tbody></table></div><p class=\"\"><span>And at 31 August 2024:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Corporate</span></p></td><td><p class=\"\"><span>Software</span></p></td><td><p class=\"\"><span>        Total</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Operating loss from continued operations per reportable segment</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Reportable segment assets</span></p></td><td><p class=\"\"><span>32,753</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>32,753</span></p></td></tr><tr><td><p class=\"\"><span>Reportable segment liabilities</span></p></td><td><p class=\"\"><span>(44,734)</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(44,734)</span></p></td></tr><tr><td><p class=\"\"><span>Net liabilities</span></p></td><td><p class=\"\"><span>(11,981)</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(11,981)</span></p></td></tr></tbody></table></div><p class=\"\"><span>3.       ADMINISTRATIVE eXPENSES</span></p><p class=\"\"><span>This is stated after charging:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>2025</span></p><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>2024</span></p><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Advertising &amp; Marketing</span></p></td><td><p class=\"\"><span>445,601</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Audit &amp; Accountancy fees</span></p></td><td><p class=\"\"><span> 27,800</span></p></td><td><p class=\"\"><span>6000</span></p></td></tr><tr><td><p class=\"\"><span>Bank charges</span></p></td><td><p class=\"\"><span>(251)</span></p></td><td><p class=\"\"><span>228</span></p></td></tr><tr><td><p class=\"\"><span>Insurance</span></p></td><td><p class=\"\"><span> 3,360</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>IT costs</span></p></td><td><p class=\"\"><span> 17,667</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Legal</span></p></td><td><p class=\"\"><span> 21,999</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Office costs</span></p></td><td><p class=\"\"><span> 33,000</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Other expenses</span></p></td><td><p class=\"\"><span> 23</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Professional fees</span></p></td><td><p class=\"\"><span> 161,000</span></p></td><td><p class=\"\"><span>7,359</span></p></td></tr><tr><td><p class=\"\"><span>Salary &amp; Wages</span></p></td><td><p class=\"\"><span>304,946</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Share based payments (Employment)</span></p></td><td><p class=\"\"><span>1,110,518</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Travel &amp; Entertainment</span></p></td><td><p class=\"\"><span>33,051</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td></td><td><p class=\"\"><span>2,158,714</span></p></td><td><p class=\"\"><span> 13,587</span></p></td></tr></tbody></table></div><p class=\"\"><span>4.       DIRECTORS AND Employees</span></p><p class=\"\"><span>The average number of persons employed by the Company (including directors) during year ended 31 August 2025:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>31 August 2025         </span></p></td><td><p class=\"\"><span>31 August 2024       </span></p></td></tr><tr><td></td><td><p class=\"\"><span>No</span></p></td><td><p class=\"\"><span>No</span></p></td></tr><tr><td><p class=\"\"><span>Directors</span></p></td><td><p class=\"\"><span>5</span></p></td><td><p class=\"\"><span>2</span></p></td></tr><tr><td><p class=\"\"><span>Employees</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td></td><td><p class=\"\"><span>5</span></p></td><td><p class=\"\"><span>2</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>2025</span></p></td><td><p class=\"\"><span>2024</span></p></td></tr><tr><td><p class=\"\"><span>The aggregate payroll costs of these persons were as follows:</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Wages and salaries</span></p></td><td><p class=\"\"><span>304,946</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Share-based payments</span></p></td><td><p class=\"\"><span>1,110,518</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td></td><td><p class=\"\"><span>1,415,464</span></p></td><td><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><p class=\"\"><span>The highest paid director, being the CEO, received fees of £154,250 (2024: £nil). The directors are considered key management personnel of the Company.</span></p><p class=\"\"><span>5.       AUDITORS' REMUNERATION</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>2025</span></p></td><td><p class=\"\"><span>2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Fees payable to the Company's auditor for the audit of parent company and consolidated Company financial statements:</span></p></td><td><p class=\"\"><span>30,000</span></p></td><td><p class=\"\"><span>5,000</span></p></td></tr><tr><td><p class=\"\"><span>Reporting accountant fee for IPO of the Company</span></p></td><td><p class=\"\"><span>85,000</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td></td><td><p class=\"\"><span>115,000</span></p></td><td><p class=\"\"><span>5,000</span></p></td></tr></tbody></table></div><p class=\"\"><span>6.       taxation.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Year ending 31 August 2025</span></p></td><td><p class=\"\"><span>Year ending 31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>The charge / credit for the year is made up as follows:</span></p></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Loss for the year</span></p></td><td><p class=\"\"><span>(4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Taxation charge / credit for the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>A reconciliation of the tax charge / credit appearing in the income statement to the tax that would result from applying the standard rate of tax to the results for the year is:</span></p></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Loss before tax</span></p></td><td><p class=\"\"><span>(4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Tax credit at the applicable rate of 19%</span></p></td><td><p class=\"\"><span>(760,363)</span></p></td><td><p class=\"\"><span>(2,582)</span></p></td></tr><tr><td><p class=\"\"><span>Expenditure disallowable for taxation</span></p></td><td><p class=\"\"><span>652,285</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Tax losses on which no deferred tax asset has been recognised</span></p></td><td><p class=\"\"><span>108,078</span></p></td><td><p class=\"\"><span>3,396</span></p></td></tr><tr><td><p class=\"\"><span>Total tax (charge)/credit</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><p class=\"\"><span>The Company has total carried forward losses of £4,015,499 (2024: £82,931. The taxable value of the unrecognised deferred tax asset is £762,944 (2024: £347,421) and these losses do not expire. No deferred tax assets in respect of tax losses have not been recognised in the accounts because there is currently insufficient evidence of the timing of suitable future taxable profits against which they can be recovered.</span></p><p class=\"\"><span>7.   EARNINGS per share</span></p><p class=\"\"><span>The calculation of the basic and diluted earnings per share is calculated by dividing the profit or loss for the year by the weighted average number of ordinary shares in issue during the year.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>2025   </span></p></td><td><p class=\"\"><span>2024   </span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Loss for the year from continuing operations attributable to the owners of the Company</span></p></td><td><p class=\"\"><span>(4,001,912)</span></p></td><td><p class=\"\"><span>(13,587)</span></p></td></tr><tr><td><p class=\"\"><span>Weighted number of ordinary shares in issue </span></p></td><td><p class=\"\"><span>174,861,264</span></p></td><td><p class=\"\"><span>45,930,328</span></p></td></tr><tr><td><p class=\"\"><span>Basic &amp; diluted earnings per share from continuing operations - pence</span></p></td><td><p class=\"\"><span>(2.29)</span></p></td><td><p class=\"\"><span>(0.03)</span></p></td></tr></tbody></table></div><p class=\"\"><span>8.   INVESTMENT IN SUBSIDIARIES</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>31 August 2025</span></p></td><td><p class=\"\"><span>31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Company</span></p></td><td><p class=\"\"><span>Company</span></p></td></tr><tr><td><p class=\"\"><span>Medpal Limited</span></p></td><td><p class=\"\"><span>1</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td></td><td><p class=\"\"><span>1</span></p></td><td><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Name</span></p></td><td><p class=\"\"><span>Medpal Limited</span></p></td></tr><tr><td><p class=\"\"><span>Incorporation date</span></p></td><td><p class=\"\"><span>28 August 2025</span></p></td></tr><tr><td><p class=\"\"><span>Holding</span></p></td><td><p class=\"\"><span>100% Medpal Ai PLC</span></p></td></tr><tr><td><p class=\"\"><span>Class of shares held</span></p></td><td><p class=\"\"><span>Ordinary shares</span></p></td></tr><tr><td><p class=\"\"><span>Business activity</span></p></td><td><p class=\"\"><span>Dormant</span></p></td></tr><tr><td><p class=\"\"><span>Registered address</span></p></td><td><p class=\"\"><span>20 Primrose Street, London, United Kingdom, EC2A 2EW</span></p></td></tr></tbody></table></div><p class=\"\"><span>Medpal Limited was incorporated on 28 August 2025 as a wholly owned subsidiary of the Company. The subsidiary was dormant at 31 August 2025 and had no material transactions during the period. Accordingly, its inclusion in the consolidated financial statements has had no material effect on the Group's financial statements.</span></p><p class=\"\"><span>9.   INTANGIBLE ASSET-Work in progress</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Group and Company</span></p></td><td><p class=\"\"><span>31 August</span></p><p class=\"\"><span>2025</span></p></td><td><p class=\"\"><span>31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td></td><td><p class=\"\"><span>257,318</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Opening balance</span></p></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Purchase of IP</span></p></td><td><p class=\"\"><span>192,500</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Additions</span></p></td><td><p class=\"\"><span>64,818</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>As at 31 August</span></p></td><td><p class=\"\"><span>257,318</span></p></td><td><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><p class=\"\"><span> During the year, the Company acquired the Medpal intellectual property from the founder Jason Drummond under an Asset Purchase Agreement. The total consideration of £192,500 was satisfied through the issue of 192,500,000 ordinary shares, with no liabilities assumed as part of the transaction.</span></p><p class=\"\"><span>As at 31 August 2025, the Company's intellectual property, comprising the Medpal AI application and supporting software, was still under active development and had not yet reached the condition necessary to be capable of operating as intended by management. Accordingly, the IP was recognised as an intangible asset under development (work in progress), with no amortisation recognised and no indicators of impairment identified at the reporting date.</span></p><p class=\"\"><span>10.  TRADE AND OTHER RECEIVABLES</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Group and Company</span></p></td><td><p class=\"\"><span>31 August 2025</span></p></td><td><p class=\"\"><span>31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Prepayments</span></p></td><td><p class=\"\"><span> 140,743</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>VAT</span></p></td><td><p class=\"\"><span> 114,008</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Share capital to be issued</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>32,500</span></p></td></tr><tr><td></td><td><p class=\"\"><span>254,751</span></p></td><td><p class=\"\"><span> 32,500</span></p></td></tr></tbody></table></div><p class=\"\"><span>11.   Cash and cash equivalents</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Group and Company</span></p></td><td><p class=\"\"><span>31 August 2025</span></p></td><td><p class=\"\"><span>31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Cash at bank</span></p></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr><tr><td></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr></tbody></table></div><p class=\"\"><span>The majority of the Company's cash at bank is held with alternative financial institutions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The carrying amounts of the Company's and Company's cash and cash equivalents are denominated in the following currencies:</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>31 August 2025</span></p></td><td><p class=\"\"><span>31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>UK Pounds</span></p></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr><tr><td></td><td><p class=\"\"><span>1,537,124</span></p></td><td><p class=\"\"><span>253</span></p></td></tr></tbody></table></div><p class=\"\"><span>12.  TRADE AND OTHER PAYABLES</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Group and Company</span></p></td><td><p class=\"\"><span>31 August 2025</span></p></td><td><p class=\"\"><span>31 August 2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Accounts Payable</span></p></td><td><p class=\"\"><span>        611,807</span></p></td><td><p class=\"\"><span>2,859</span></p></td></tr><tr><td><p class=\"\"><span>Accruals</span></p></td><td><p class=\"\"><span>          48,635</span></p></td><td><p class=\"\"><span>18,000</span></p></td></tr><tr><td><p class=\"\"><span>Director loan   </span></p></td><td><p class=\"\"><span>                 -  </span></p></td><td><p class=\"\"><span>8,875</span></p></td></tr><tr><td><p class=\"\"><span>Other creditors</span></p></td><td><p class=\"\"><span>                 - </span></p></td><td><p class=\"\"><span>15,000</span></p></td></tr><tr><td></td><td><p class=\"\"><span>660,442</span></p></td><td><p class=\"\"><span>44,734</span></p></td></tr></tbody></table></div><p class=\"\"><span>13.  Share capital and share premium </span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Number of shares</span></p></td><td><p class=\"\"><span>Ordinary shares</span></p></td><td><p class=\"\"><span>Share premium</span></p></td><td><p class=\"\"><span>Total</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2023</span></p></td><td><p class=\"\"><span>45,500,000</span></p></td><td><p class=\"\"><span>4,550</span></p></td><td><p class=\"\"><span>59,400</span></p></td><td><p class=\"\"><span>63,950</span></p></td></tr><tr><td><p class=\"\"><span>Ordinary shares issued1</span></p></td><td><p class=\"\"><span>700,000</span></p></td><td><p class=\"\"><span>70</span></p></td><td><p class=\"\"><span>6,930</span></p></td><td><p class=\"\"><span>7,000</span></p></td></tr><tr><td><p class=\"\"><span>Share issue costs</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Balance at 31 August 2024</span></p></td><td><p class=\"\"><span>46,200,000</span></p></td><td><p class=\"\"><span>4,620</span></p></td><td><p class=\"\"><span>66,330</span></p></td><td><p class=\"\"><span>70,950</span></p></td></tr><tr><td><p class=\"\"><span>Founder round  2</span></p></td><td><p class=\"\"><span>56,900,000</span></p></td><td><p class=\"\"><span>5,690</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>5,690</span></p></td></tr><tr><td><p class=\"\"><span>Series A Capital Raise 3</span></p></td><td><p class=\"\"><span>43,450,000</span></p></td><td><p class=\"\"><span>4,345</span></p></td><td><p class=\"\"><span>430,155</span></p></td><td><p class=\"\"><span>434,500</span></p></td></tr><tr><td><p class=\"\"><span>Consideration 4</span></p></td><td><p class=\"\"><span>192,500,000</span></p></td><td><p class=\"\"><span>19,250</span></p></td><td><p class=\"\"><span>173,250</span></p></td><td><p class=\"\"><span>192,500</span></p></td></tr><tr><td><p class=\"\"><span>Pre IPO 5</span></p></td><td><p class=\"\"><span>5,033,334</span></p></td><td><p class=\"\"><span>503</span></p></td><td><p class=\"\"><span>150,497</span></p></td><td><p class=\"\"><span>151,000</span></p></td></tr><tr><td><p class=\"\"><span>Fee shares 6</span></p></td><td><p class=\"\"><span>2,000,000</span></p></td><td><p class=\"\"><span>200</span></p></td><td><p class=\"\"><span>19,800</span></p></td><td><p class=\"\"><span>20,000</span></p></td></tr><tr><td><p class=\"\"><span>Share consolidation 7</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>34,608</span></p></td><td><p class=\"\"><span>(34,608)</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Pre-IPO share issue 8</span></p></td><td><p class=\"\"><span>17,000,001</span></p></td><td><p class=\"\"><span>3,400</span></p></td><td><p class=\"\"><span>406,600</span></p></td><td><p class=\"\"><span>410,000</span></p></td></tr><tr><td><p class=\"\"><span>IPO raise  9</span></p></td><td><p class=\"\"><span>50,000,000</span></p></td><td><p class=\"\"><span>10,000</span></p></td><td><p class=\"\"><span>1,990,000</span></p></td><td><p class=\"\"><span>2,000,000</span></p></td></tr><tr><td><p class=\"\"><span>Share issue costs</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(1,244,124)</span></p></td><td><p class=\"\"><span>(1,244,124)</span></p></td></tr><tr><td><p class=\"\"><span>As at 31 August 2025</span></p></td><td><p class=\"\"><span>413,083,335</span></p></td><td><p class=\"\"><span>82,616</span></p></td><td><p class=\"\"><span>1,957,900</span></p></td><td><p class=\"\"><span>2,040,516</span></p></td></tr></tbody></table></div><p class=\"\"><span>1-         700,000 shares at £0.01 were issued on 19 January 2024 for total proceeds of £7,000</span></p><p class=\"\"><span>2-         Issue of 56,900,000 shares at nominal value for total proceeds £5,690</span></p><p class=\"\"><span>3-         Issue of 43,450,000 shares at £0.01 per share for total proceeds of £434,500</span></p><p class=\"\"><span>4-         Issue of 192,500,000 shares to founder Jason Drummond for the purchase of the Medpal IP</span></p><p class=\"\"><span>5-         Issue of 5,033,334 shares at £0.03 per share for total proceeds of £151,000</span></p><p class=\"\"><span>6-         Issue of 2,000,000 fee shares for £0.01 per share in leu of fees</span></p><p class=\"\"><span>7-         On 1 August 2025, the Company consolidated its ordinary shares on a 2-for-1 basis. The issued share capital was reduced from 692,166,668 ordinary shares of £0.0001 each to 346,083,334 ordinary shares of £0.0002 each. The consolidation did not affect the aggregate nominal value of the issued share capital, which remained £69,216.67.Issue of 12,000,001 and 5,000,000 shares at £0.03 and £0.01 per share raising £410,000</span></p><p class=\"\"><span>8-         Issue of 50,000,000 shares at £0.04p per share as part of the Company's IPO</span></p><p class=\"\"><span>The share premium represents the difference between the nominal value of the shares issued and the actual amount subscribed less; the cost of issue of the shares, the value of the bonus share issue, or any bonus warrant issue.</span></p><p class=\"\"><span>Ordinary shares entitle the holder to participate in dividends and the proceeds on the winding up of the company in proportion to the number of and amounts paid on the shares held. The fully paid ordinary shares have a par value of £0.0002 and the company does not have a limited amount of authorised capital.</span></p><p class=\"\"><span>On a show of hands every member present at a meeting in person or by proxy shall have one vote and upon a poll each share shall have one vote.</span></p><p class=\"\"><span>All issued shares are fully paid.</span></p><p class=\"\"><span>14.  OPTIONS &amp; WARRANTS</span></p><p class=\"\"><span>Options</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><p class=\"\"><span>2025</span></p></td><td></td><td colspan=\"2\"><p class=\"\"><span>2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Weighted average exercise price</span></p></td><td><p class=\"\"><span>Number of options</span></p></td><td></td><td><p class=\"\"><span>Weighted average exercise price</span></p></td><td><p class=\"\"><span>Number of options</span></p></td></tr><tr><td><p class=\"\"><span>Opening balance</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Options issued during the year</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>40,308,331</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Outstanding at the end of the year</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>40,308,331</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Exercisable at the end of the year</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><p class=\"\"><span>Warrants</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><p class=\"\"><span>2025</span></p></td><td></td><td colspan=\"2\"><p class=\"\"><span>2024</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Weighted average exercise price</span></p></td><td><p class=\"\"><span>Number of warrants</span></p></td><td></td><td><p class=\"\"><span>Weighted average exercise price</span></p></td><td><p class=\"\"><span>Number of warrants</span></p></td></tr><tr><td><p class=\"\"><span>Opening balance</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Issued during the year</span></p></td><td><p class=\"\"><span>2p</span></p></td><td><p class=\"\"><span>135,746,667</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Outstanding at the end of the year</span></p></td><td><p class=\"\"><span>2p</span></p></td><td><p class=\"\"><span>135,746,667</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Exercisable at the end of the year</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>60,746,667</span></p></td><td></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><p class=\"\"><span>The fair value of the services received in return for the options and warrants granted are measured by reference to the fair value of the instrument granted. The estimate of the fair value of the instrument granted is measured based on the Black-Scholes valuations model and Barrier valuations model. Measurement inputs and assumptions are shown below in note 15.</span></p><p class=\"\"><span>15.  SHARE-BASED PAYMENTS RESERVE</span></p><p class=\"\"><span>During the year, the Company operated a Medpal AI Long Term Incentive Plan (LTIP)  Share Option Plan (Share Option Scheme) as well as awarding warrants to various third parties.</span></p><p class=\"\"><span>Under IFRS 2, an expense is recognised in the statement of comprehensive income for share based payments, to recognise their fair value at the date of grant. The application of IFRS 2 gave rise to a charge of £2,385,347 for the year ended 31 August 2025 (the  equivalent charges for the year ended 31 August 2024 was £nil). The Company recognised total expenses (all of which related to equity settled share-based payment transactions) under the current plans of:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>2025</span></p><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>2024</span></p><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>As at 1 September</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Director warrants</span></p></td><td><p class=\"\"><span> 1,081,011</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Director warrants</span></p></td><td><p class=\"\"><span>29,507</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Introduction warrants</span></p></td><td><p class=\"\"><span>681,659</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Dalheim warrants</span></p></td><td><p class=\"\"><span>351,629</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Adviser warrants</span></p></td><td><p class=\"\"><span>1,153,329</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Adviser warrants</span></p></td><td><p class=\"\"><span>135,943</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>As at 31 August</span></p></td><td><p class=\"\"><span>3,433,078</span></p></td><td><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><p class=\"\"><span>The estimated fair values of these share warrants, and the inputs used in the Black-Scholes model to calculate those fair values are as follows:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Issue date</span></p></td><td><p class=\"\"><span>Time to expiry (years)</span></p></td><td><p class=\"\"><span>Share price at date of issue of warrants</span></p></td><td><p class=\"\"><span>Exercise price</span></p></td><td><p class=\"\"><span>Expected volatility</span></p></td><td><p class=\"\"><span>Risk free interest rate</span></p></td><td><p class=\"\"><span>Fair value per warrant (pence)</span></p></td></tr><tr><td><p class=\"\"><span>Director 1</span></p></td><td><p class=\"\"><span>11 Aug 2025</span></p></td><td><p class=\"\"><span>10</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>95%</span></p></td><td><p class=\"\"><span>3.9%</span></p></td><td><p class=\"\"><span>£0.036</span></p></td></tr><tr><td><p class=\"\"><span>Director 2</span></p></td><td><p class=\"\"><span>11 Aug 2025</span></p></td><td><p class=\"\"><span>10</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>95%</span></p></td><td><p class=\"\"><span>3.9%</span></p></td><td><p class=\"\"><span>£0.036</span></p></td></tr><tr><td><p class=\"\"><span>Introduction 3</span></p></td><td><p class=\"\"><span>11 Aug 2025</span></p></td><td><p class=\"\"><span>5</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>1p</span></p></td><td><p class=\"\"><span>75%</span></p></td><td><p class=\"\"><span>3.9%</span></p></td><td><p class=\"\"><span>£0.025</span></p></td></tr><tr><td><p class=\"\"><span>Dalheim 4</span></p></td><td><p class=\"\"><span>11 Aug 2025</span></p></td><td><p class=\"\"><span>5</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>3p</span></p></td><td><p class=\"\"><span>75%</span></p></td><td><p class=\"\"><span>3.9%</span></p></td><td><p class=\"\"><span>£0.026</span></p></td></tr><tr><td><p class=\"\"><span>Adviser </span></p></td><td><p class=\"\"><span>11 Aug 2025</span></p></td><td><p class=\"\"><span>5</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>75%</span></p></td><td><p class=\"\"><span>3.9%</span></p></td><td><p class=\"\"><span>£0.025</span></p></td></tr><tr><td><p class=\"\"><span>Adviser</span></p></td><td><p class=\"\"><span>11 Aug 2025</span></p></td><td><p class=\"\"><span>7</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>4p</span></p></td><td><p class=\"\"><span>95%</span></p></td><td><p class=\"\"><span>3.9%</span></p></td><td><p class=\"\"><span>£0.033</span></p></td></tr></tbody></table></div><p class=\"\"><span>As at 31 August 2025 the weighted average time until expiry is 6.14 years (2024: nil years).</span></p><p class=\"\"><span>16.     Risk Management</span></p><p class=\"\"><span>General objectives and policies</span></p><p class=\"\"><span>The overall objective of the Board is to set policies that seek to reduce as far as practical without unduly affecting the Company's competitiveness and flexibility. Further details regarding these policies are:</span></p><p class=\"\"><span>Policy on financial risk management</span></p><p class=\"\"><span>The Company's principal financial instruments comprise cash and cash equivalents, trade and other receivables and trade and other payables. The Company's accounting policies and methods adopted, including the criteria for recognition, the basis on which income and expenses are recognised in respect of each class of financial asset, financial liability and equity instrument are set out in note 1 - \"Accounting Policies\".</span></p><p class=\"\"><span>The Company does not use financial instruments for speculative purposes. The carrying value of all financial assets and liabilities approximates to their fair value.</span></p><p class=\"\"><span>Derivatives, financial instruments and risk management</span></p><p class=\"\"><span>The Company does not use derivative instruments or other financial instruments to manage its exposure to fluctuations in foreign currency exchange rates, interest rates and commodity prices.</span></p><p class=\"\"><span>Foreign currency risk management</span></p><p class=\"\"><span>In the current period the impact of foreign currency movement is limited to the impact it has on the relatively small denominations of currency that the Company holds in foreign currencies.</span></p><p class=\"\"><span>Credit risk</span></p><p class=\"\"><span>Credit risk refers to the risk that a counterparty will default on its contractual obligations resulting in financial loss to the Company. The Company has adopted a policy of only dealing with creditworthy counterparties. The Company's exposure and the credit ratings of its counterparties are monitored by the board of directors to ensure that the aggregate value of transactions is spread amongst approved counterparties.</span></p><p class=\"\"><span>The Company applies IFRS 9 to measure expected credit losses for receivables, these are regularly monitored and assessed. Receivables are subject to an expected credit loss provision when it is probable that amounts outstanding are not recoverable as set out in the accounting policy. The impact of expected credit losses was immaterial.</span></p><p class=\"\"><span>The Company's principal financial assets are cash and cash equivalents, loan notes and trade and other receivables. Cash equivalents include amounts held on deposit with financial institutions.</span></p><p class=\"\"><span>The credit risk on liquid funds held in current accounts and available on demand is limited because the Company's counterparties are banks with high credit-ratings assigned by international credit-rating agencies.</span></p><p class=\"\"><span>No financial assets have indicators of impairment.</span></p><p class=\"\"><span>The Company's maximum exposure to credit risk is limited to the carrying amount of financial assets recorded in the financial statements.</span></p><p class=\"\"><span>Borrowings and interest rate risk</span></p><p class=\"\"><span>The Company has no borrowings. The Company's principal financial assets are cash and cash equivalents and trade and other receivables. Cash equivalents include amounts held on deposit with financial institutions. The effect of variable interest rates is not significant.</span></p><p class=\"\"><span>Liquidity risk</span></p><p class=\"\"><span>During the year ended 31 August 2025 and year ended 31 August 2024, the Company was financed by cash raised through equity funding. Funds raised surplus to immediate requirements are held as short-term cash deposits in Sterling.</span></p><p class=\"\"><span>The maturities of the cash deposits are selected to maximise the investment return whilst ensuring that funds will be available as required to maintain the Company's operations.</span></p><p class=\"\"><span>In managing liquidity risk, the main objective of the Company is to ensure that it has the ability to pay all of its liabilities as they fall due. The Company monitors its levels of working capital to ensure that it can meet its liabilities as they fall due. The table below shows the undiscounted cashflows on the Company's financial liabilities on the basis of their earliest possible contractual maturity.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\"><p class=\"\"><span>Group and Company</span></p></td><td><p class=\"\"><span>Total              </span></p></td><td colspan=\"3\"><p class=\"\"><span>Within 2 months         </span></p></td><td colspan=\"2\"><p class=\"\"><span>Within 2-6 months        </span></p></td><td colspan=\"2\"><p class=\"\"><span>Within</span></p><p class=\"\"><span>6-12 months        </span></p></td><td colspan=\"2\"><p class=\"\"><span>Within 1- 2 years</span></p></td><td><p class=\"\"><span>Greater than 2 years</span></p></td></tr><tr><td colspan=\"2\"></td><td><p class=\"\"><span>£</span></p></td><td colspan=\"3\"><p class=\"\"><span>£</span></p></td><td colspan=\"2\"><p class=\"\"><span>£</span></p></td><td colspan=\"2\"><p class=\"\"><span>£</span></p></td><td colspan=\"2\"><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>At 31 August 2025</span></p></td><td></td><td colspan=\"3\"></td><td colspan=\"2\"></td><td colspan=\"2\"></td><td colspan=\"2\"></td><td></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>Trade payables</span></p></td><td><p class=\"\"><span>611,807</span></p></td><td colspan=\"3\"><p class=\"\"><span>611,807</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>Other payable and accruals</span></p></td><td><p class=\"\"><span>48,635</span></p></td><td colspan=\"3\"><p class=\"\"><span>48,635</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td colspan=\"2\"></td><td><p class=\"\"><span>660,442</span></p></td><td colspan=\"3\"><p class=\"\"><span>660,442</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Group and Company</span></p></td><td colspan=\"3\"><p class=\"\"><span>Total              </span></p></td><td><p class=\"\"><span>Within 2 months         </span></p></td><td colspan=\"2\"><p class=\"\"><span>Within 2-6 months        </span></p></td><td colspan=\"2\"><p class=\"\"><span>Within</span></p><p class=\"\"><span>6-12 months        </span></p></td><td colspan=\"2\"><p class=\"\"><span>Within 1- 2 years</span></p></td><td colspan=\"2\"><p class=\"\"><span>Greater than 2 years</span></p></td></tr><tr><td></td><td colspan=\"3\"><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td colspan=\"2\"><p class=\"\"><span>£</span></p></td><td colspan=\"2\"><p class=\"\"><span>£</span></p></td><td colspan=\"2\"><p class=\"\"><span>£</span></p></td><td colspan=\"2\"><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>At 31 August 2024                                                                 </span></p></td><td colspan=\"3\"></td><td></td><td colspan=\"2\"></td><td colspan=\"2\"></td><td colspan=\"2\"></td><td colspan=\"2\"></td></tr><tr><td><p class=\"\"><span>Trade payables</span></p></td><td colspan=\"3\"><p class=\"\"><span>2,859</span></p></td><td><p class=\"\"><span>2,859</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Director loan</span></p></td><td colspan=\"3\"><p class=\"\"><span>8,875</span></p></td><td><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>8,875</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td></tr><tr><td><p class=\"\"><span>Other creditors</span></p></td><td colspan=\"3\"><p class=\"\"><span>15,000</span></p></td><td><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>15,000</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td></tr><tr><td></td><td colspan=\"3\"><p class=\"\"><span>26,734</span></p></td><td><p class=\"\"><span>2,859</span></p></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td><td colspan=\"2\"><p class=\"\"><span>23,875</span></p></td><td colspan=\"2\"></td><td colspan=\"2\"><p class=\"\"><span>-</span></p></td></tr></tbody></table></div><p class=\"\"><span>Capital management</span></p><p class=\"\"><span>The Company manages its capital to ensure that it will be able to continue as a going concern while maximising the return to stakeholders. The overall strategy of the Company is to minimise costs and liquidity risk.</span></p><p class=\"\"><span>The capital structure of the Company consists of equity attributable to equity holders of the Company, comprising issued share capital, reserves and retained earnings as disclosed in the consolidated statement of changes of equity.</span></p><p class=\"\"><span>The Company is exposed to a number of risks through its normal operations, the most significant of which are interest, credit, foreign exchange, commodity and liquidity risks. The management of these risks is vested to the board of directors.</span></p><p class=\"\"><span>17.        FINANCiaL ASSETS AND FINANCIAL LIABILITIES</span></p><p class=\"\"><span>Group and Company</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>2025</span></p></td><td><p class=\"\"><span>Financial assets at amortised cost</span></p></td><td><p class=\"\"><span>Financial liabilities at amortised cost</span></p></td><td><p class=\"\"><span>Total</span></p></td></tr><tr><td><p class=\"\"><span>Financial assets / liabilities</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents</span></p></td><td><p class=\"\"><span>           1,537,124</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span> 1,537,124</span></p></td></tr><tr><td><p class=\"\"><span>Other current assets</span></p></td><td><p class=\"\"><span>             114,008</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>    114,008</span></p></td></tr><tr><td><p class=\"\"><span>Trade and other payables</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(611,807)</span></p></td><td><p class=\"\"><span>(611,807)</span></p></td></tr><tr><td></td><td><p class=\"\"><span>           1,651,132</span></p></td><td><p class=\"\"><span>(611,807)</span></p></td><td><p class=\"\"><span> 1,039,325</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>2024</span></p></td><td><p class=\"\"><span>Financial assets at amortised cost</span></p></td><td><p class=\"\"><span>Financial liabilities at amortised cost</span></p></td><td><p class=\"\"><span>Total</span></p></td></tr><tr><td><p class=\"\"><span>Financial assets / liabilities</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td><td><p class=\"\"><span>£</span></p></td></tr><tr><td><p class=\"\"><span>Cash and cash equivalents</span></p></td><td><p class=\"\"><span>253</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>253</span></p></td></tr><tr><td><p class=\"\"><span>Other current assets</span></p></td><td><p class=\"\"><span>32,500</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>32,500</span></p></td></tr><tr><td><p class=\"\"><span>Trade and other payables</span></p></td><td><p class=\"\"><span>-</span></p></td><td><p class=\"\"><span>(44,734)</span></p></td><td><p class=\"\"><span>(44,734)</span></p></td></tr><tr><td></td><td><p class=\"\"><span>32,753</span></p></td><td><p class=\"\"><span>(44,734)</span></p></td><td><p class=\"\"><span>(11,981)</span></p></td></tr></tbody></table></div><p class=\"\"><span>18.        Related party transactions</span></p><p class=\"\"><span>Issue of director options</span></p><p class=\"\"><span>During the year, the Company granted equity-settled options and warrants to Directors and to an entity connected with a Director as part of their remuneration and incentive arrangements in connection with Admission. The options and warrants were granted in consideration for services provided to the Group and are accounted for in accordance with IFRS 2 Share-based Payment.</span></p><p class=\"\"><span>The options and warrants granted were as follows:</span></p><p class=\"\"><span>·      Jason Drummond (Chief Executive Officer) - options over 20,154,166 ordinary shares.</span></p><p class=\"\"><span>·      Justin Drummond (Director) - options over 6,092,499 ordinary shares.</span></p><p class=\"\"><span>·      Karl Karlsson (Non-executive Chairman) - options over 6,000,000 ordinary shares.</span></p><p class=\"\"><span>·      Kevin O'Neill (Non-executive Director) - options over 4,030,833 ordinary shares.</span></p><p class=\"\"><span>·      Adam Monaco (Finance Director) - options over 4,030,833 ordinary shares.</span></p><p class=\"\"><span>·      Dalheim Limited (entity connected with Karl Karlsson) - warrants over 11,500,001 ordinary shares, with an exercise price of £0.03 per share and an exercise period of five years commencing six months after Admission.</span></p><p class=\"\"><span>In aggregate, options and warrants over 51,808,332 ordinary shares were granted to Directors and their connected parties during the period. The Directors' option have exercise prices and expiry dates ranging between £0.03 and £0.04 per share and five to seven years from the date of grant.</span></p><p class=\"\"><span>No cash consideration was paid by the Company in respect of the issue of these warrants.</span></p><p class=\"\"><span>The fair value of the warrants at the grant date is recognised as an expense over the relevant vesting periods, with a corresponding increase in equity. Further details of the warrants, including vesting conditions and valuation assumptions, are disclosed in note 14 to the financial statements.</span></p><p class=\"\"><span>Purchase of IP</span></p><p class=\"\"><span>On 4 April 2025, the group acquired business assets and intellectual property relating to the Medpal AI platform from Jason Drummond, a director of the company, and his nominated recipients.</span></p><p class=\"\"><span>The total consideration for the acquisition was £192,500, satisfied in full through the issue of 192,500,000 ordinary shares at a price of £0.001 per share. No cash consideration was paid.</span></p><p class=\"\"><span>19.     CONTINGENT assets &amp; LIABILITIES</span></p><p class=\"\"><span>Other than those listed above there were no further contingent liabilities at 31 August 2025.</span></p><p class=\"\"><span>20.  ultimate controlling party</span></p><p class=\"\"><span>The Directors consider that there is no controlling or ultimate controlling party of the Company.</span></p><p class=\"\"><span>21.     Events subsequent to year end</span></p><p class=\"\"><span>The following events occurred after the reporting date of 31 August 2025.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Acquisition of assets from Universal Pharmacy Ltd</span></strong></p><p class=\"\"><span>On 1 October 2025 the Company announced the conditional acquisition of certain assets from Universal Pharmacy Ltd (in administration). The acquisition was undertaken to support the Group's strategic objectives and expand the functionality and reach of the MedPal AI platform. The assets acquired relate to pharmacy and healthcare services and are in the course of being integrated into the Group's existing operations. The acquisition was completed on 13 February 2026, following receipt of NHS approval in respect of aspects of its pharmacy licence application,  The approval represents a significant operational milestone for the Group and is expected to support future commercial adoption of the MedPal AI platform.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Issue of equity - placing</span></strong></p><p class=\"\"><span>On 1 October 2025, the Company completed a placing of new ordinary shares to institutional and other investors at an issue price of 8 pence per share to raise gross proceeds of £400,000. The Company also raised £145,304 via the issue of 1,806,300 shares at 8p per share via a WRAP retail offer. The Placing and WRAP shares were admitted to trading on AIM on 8 October 2025.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Issue of equity - ATM facility</span></strong></p><p class=\"\"><span>On 4 December 2025 the Company announced that it had entered into an At-The-Market (\"ATM\") equity issuance facility to raise up to £2,000,000 via the issue of new ordinary shares at a price no lower than 5p per share. The Company announced the closure of the ATM facility on 25 February 2026 and the tranches of funds raised via the facility are shown in the table below. Net proceeds of the ATM were approximately £1,843,617.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Number of ATM Shares</span></p></td><td><p class=\"\"><span>Average Price per share</span></p></td><td><p class=\"\"><span>Approximate Gross Proceeds</span></p></td><td><p class=\"\"><span>Admission date</span></p></td></tr><tr><td><p class=\"\"><span>7,500,000</span></p></td><td><p class=\"\"><span>6.64p</span></p></td><td><p class=\"\"><span>£498,225</span></p></td><td><p class=\"\"><span>19 December 2025</span></p></td></tr><tr><td><p class=\"\"><span>6,200,000</span></p></td><td><p class=\"\"><span>6.11p</span></p></td><td><p class=\"\"><span>£378,870</span></p></td><td><p class=\"\"><span>22 January 2026</span></p></td></tr><tr><td><p class=\"\"><span>6,500,000</span></p></td><td><p class=\"\"><span>5.22p</span></p></td><td><p class=\"\"><span>£339,560</span></p></td><td><p class=\"\"><span>30 January 2026</span></p></td></tr><tr><td><p class=\"\"><span>9,000,000</span></p></td><td><p class=\"\"><span>5.20p</span></p></td><td><p class=\"\"><span>£467,640</span></p></td><td><p class=\"\"><span>17 February 2026</span></p></td></tr><tr><td><p class=\"\"><span>6,055,000</span></p></td><td><p class=\"\"><span>5.10p</span></p></td><td><p class=\"\"><span>£308,805</span></p></td><td><p class=\"\"><span>3 March 2026</span></p></td></tr><tr><td><p class=\"\"><span>35,255,000</span></p></td><td><p class=\"\"><span>5.65p</span></p></td><td><p class=\"\"><span>£1,993,100</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Secondary listing on the Frankfurt Stock Exchange</span></strong></p><p class=\"\"><span>On 3 February 2026, the Company announced the completion of a secondary listing of its ordinary shares on the Frankfurt Stock Exchange. The secondary listing is intended to broaden the Company's investor base and increase market visibility.</span></p><p class=\"\"><span>22.  Independent Auditor's Report to the members of MedPal AI plc</span></p><p class=\"\"><span>Opinion</span></p><p class=\"\"><span>We have audited the financial statements of Medpal AI plc (the 'parent company') and its subsidiary (the 'group') for the year ended 31 August 2025 which comprise the Consolidated statement of Comprehensive income, the Consolidated and Parent Company Statements of financial position, the Consolidated and Parent Company Statements of Changes in Equity, the Consolidated and Parent Company Statement of Cashflows and notes to the financial statements, including material accounting policy information. The financial reporting framework that has been applied in their preparation is applicable law and UK adopted international accounting standards.</span></p><p class=\"\"><span>In our opinion, the financial statements:</span></p><p class=\"\"><span>·      give a true and fair view of the state of the group's and of the parent company's affairs as at 31 August 2025 and of the group's loss for the year then ended;</span></p><p class=\"\"><span>·      the group financial statements have been properly prepared in accordance with UK adopted international accounting standards;</span></p><p class=\"\"><span>·      the parent company financial statements have been properly prepared in accordance with UK adopted international accounting standards; and</span></p><p class=\"\"><span>the financial statements have been prepared in accordance with the requirements of the Companies Act 2006.</span></p><p class=\"\"><span>Basis for opinion</span></p><p class=\"\"><span>We conducted our audit in accordance with International Standards on Auditing (UK) (ISAs (UK)) and applicable law. Our responsibilities under those standards are further described in the Auditor responsibilities for the audit of the financial statements section of our report.</span></p><p class=\"\"><span>We are independent of the group and parent company in accordance with the ethical requirements that are relevant to our audit of the financial statements in the UK, including the FRC's Ethical Standard, and we have fulfilled our other ethical responsibilities in accordance with these requirements.  We believe that the audit evidence we have obtained is sufficient and appropriate to provide a basis for our opinion.</span></p><p class=\"\"><span>Material uncertainty related to going concern</span></p><p class=\"\"><span>We draw attention to the Going Concern section within the accounting policies, which describes the Directors' assessment of the Group's ability to continue as a going concern. As disclosed in Note 1.2, the Group incurred a pre-tax loss of £4,009,912 (2024: £13,587 loss) during the year. The group is unlikely to generate positive cash flow from operations for the near future and so will continue to be reliant on financing from equity injections and / or the raising of cash through bank loans, or other debt instruments. As stated in Note 1.2, these events or conditions, along with the others matters as set forth in note 1.2, indicate that a material uncertainty exists that may cast significant doubt on the Company's ability to continue as a going concern. Our opinion is not modified in respect of this matter.</span></p><p class=\"\"><span>We recognised going concern as a key audit matter, see the relevant section of this report.</span></p><p class=\"\"><span>In auditing the financial statements, we have concluded that the Directors' use of the going concern basis of accounting in the preparation of the financial statements is appropriate. Our evaluation of the Directors' assessment of the company's ability to continue to adopt the going concern basis of accounting included (but not limited to):</span></p><p class=\"\"><span>·      Discussions with management regarding the future funding plans of the Group and obtained an update of the status of such activities.</span></p><p class=\"\"><span>·      Reviewed managements budgets and forecasts for the group - including future forecast cashflows and budgets.</span></p><p class=\"\"><span>·      Discussing with management the assumptions used in the above-mentioned forecasts and budgets and obtaining details to support these key assumptions.</span></p><p class=\"\"><span>·      Subjected budgets and forecasts to sensitivity analysis.</span></p><p class=\"\"><span>·      Reviewed minutes of board meetings held during the year and any subsequent to the year end.</span></p><p class=\"\"><span>·      Reviewed post year-end financial statements for each entity and comparing actual performance to managements assessments.</span></p><p class=\"\"><span>·      Reviewed evidence of upcoming plans to fundraise through brokers including Tennyson.</span></p><p class=\"\"><span>·      Reviewed any additional financial and nonfinancial subsequent events which may be identified post the year end in relation to going concern.</span></p><p class=\"\"><span>Our responsibilities and the responsibilities of the directors with respect to going concern are described in the relevant sections of this report.</span></p><p class=\"\"><span>Key audit matters</span></p><p class=\"\"><span>Key audit matters are those that, in our professional judgement, were of most significance in our audit of the Financial Statements of the current period and include the most significant assessed risks of material misstatement (whether or not due to fraud) we identified, including those which had the greatest effect on: the overall audit strategy, the allocation of resources in the audit and directing the efforts of the engagement team. These matters were addressed in the context of our audit of the financial statements as a whole, and in forming our opinion thereon, and we do not provide a separate opinion on these matters.</span></p><p class=\"\"><span>In addition to the matter described in the Material uncertainty related to going concern section, we have determined the matters described below to be the key audit matters to be communicated in our report.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Key audit matter</span></p></td><td><p class=\"\"><span>How our work addressed this matter</span></p></td></tr><tr><td><p class=\"\"><span>Going Concern (see note 1.2)</span></p><p class=\"\"><span>At the year end the Group was not revenue generating and has incurred a loss in the year. Accordingly the Group is reliant on further equity financing to continue operating.</span></p><p class=\"\"><span>The company incurred substantial losses in the year under audit and there is no expectation to move to profitability within the next 12 months. We have therefore recognised a material uncertainty and a key audit matter in respect of Going Concern.</span></p></td><td><p class=\"\"><span>·      Analysing management's and the Directors' cash flow forecast which forms the basis of their assessment that the going concern basis of preparation remains appropriate for the preparation of the Company financial statements for a period of at least twelve months from the date of approval of these financial statements;</span></p><p class=\"\"><span>·      Testing the integrity of the cash flow model;</span></p><p class=\"\"><span>·      Sensitising the cash flows for changes in key assumptions and considering impact on headroom;</span></p><p class=\"\"><span>·      Reviewing and considering the adequacy of the disclosure within the financial statements relating to the Directors' assessment of the going concern basis of preparation;</span></p><p class=\"\"><span>·      Verifying any funds raised post year end; and</span></p><p class=\"\"><span>·      Reviewing activities undertaken to engage in further fundraising rounds over the next 12 months.</span></p></td></tr></tbody></table></div><p class=\"\"><span>Our application of materiality</span></p><p class=\"\"><span>We apply the concept of materiality both in planning and performing our audit, and in evaluating the effect of misstatements. We consider materiality to be the magnitude by which misstatements, including omissions, could influence the economic decisions of reasonable users that are taken on the basis of the financial statements.</span></p><p class=\"\"><span>In order to reduce to an appropriately low level the probability that any misstatements exceed materiality, we use a lower materiality level, performance materiality, to determine the extent of testing needed. Importantly, misstatements below these levels will not necessarily be evaluated as immaterial as we also take account of the nature of identified misstatements, and the particular circumstances of their occurrence, when evaluating their effect on the financial statements as a whole.</span></p><p class=\"\"><span>Based on our professional judgement, we determined materiality for the financial statements as a whole and performance materiality as follows:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Group financial statements</span></p></td><td><p class=\"\"><span>Parent company financial statements</span></p></td></tr><tr><td><p class=\"\"><span>Materiality</span></p></td><td><p class=\"\"><span>£82,800 (2024: unaudited)</span></p></td><td><p class=\"\"><span>£82,800 (2024 : unaudited)</span></p></td></tr><tr><td><p class=\"\"><span>Basis for determining materiality</span></p></td><td><p class=\"\"><span>5% on net assets</span></p></td><td><p class=\"\"><span>5% on net assets</span></p></td></tr><tr><td><p class=\"\"><span>Rationale for the benchmark applied</span></p></td><td><p class=\"\"><span>The company is in a growth stage so the readers of the financial statements will be focused on the assets and liabilities of the Group.</span></p></td><td><p class=\"\"><span>The company is in a growth stage so the readers of the financial statements will be focused on the assets and liabilities of the Company.</span></p></td></tr><tr><td><p class=\"\"><span>Performance materiality</span></p></td><td><p class=\"\"><span>£62,100</span></p></td><td><p class=\"\"><span>£62,100</span></p></td></tr><tr><td><p class=\"\"><span>Basis for determining performance materiality</span></p></td><td><p class=\"\"><span>75% of overall group materiality</span></p></td><td><p class=\"\"><span>75% of overall parent company materiality</span></p></td></tr><tr><td><p class=\"\"><span>Rationale for the percentage applied for performance materiality</span></p></td><td colspan=\"2\"><p class=\"\"><span>In determining the performance materiality, we have considered the following factors :</span></p><p class=\"\"><span>·      The level of significant judgements and estimates;</span></p><p class=\"\"><span>·      The risk assessment and aggregation of risk and the effectiveness of controls;</span></p><p class=\"\"><span>·      The control environment and the group's financial reporting controls and processes; and</span></p></td></tr></tbody></table></div><p class=\"\"><span>We agreed with the Audit Committee that we would report on all differences in excess of £4,100 for both group and parent company reporting. We also report to the Audit Committee on financial statement disclosure matters identified when assessing the overall consistency and presentation of the financial statements.</span></p><p class=\"\"><span>An overview of the scope of our audit</span></p><p class=\"\"><span>In designing our audit approach, we determined materiality and assessed risk of material misstatement in the financial statements. In particular, we looked at areas involving significant accounting estimates and judgements by the directors, including the carrying value and recoverability of intangible assets and going concern. Procedures were then performed to address the risk identified and for the most significant assessed risks of misstatement, the procedures performed are outlined below in the key audit matters section of this report. We re-assessed the risks throughout the audit process and concluded that the scope remained in line with that determined at the planning stage of the audit.</span></p><p class=\"\"><span>The group includes the listed parent company and a UK-based subsidiary, Medpal AI Limited, of which only Medpal AI plc was considered to be the only component in scope. We tailored the scope of our audit to ensure that we performed enough work to be able to give an opinion on the financial statements as a whole, taking into account the structure of the group and the company, the accounting processes and controls, and the industry in which they operate.</span></p><p class=\"\"><span>No component auditors have been used and as group auditors we audited the sole component in scope. This gave us sufficient audit evidence for our audit opinion on the group financial statements.</span></p><p class=\"\"><span>Other information</span></p><p class=\"\"><span>The other information comprises the information included in the annual report, other than the financial statements and our auditor's report thereon. The directors are responsible for the other information contained within the annual report. Our opinion on the financial statements does not cover the other information and, except to the extent otherwise explicitly stated in our report, we do not express any form of assurance conclusion thereon. Our responsibility is to read the other information and, in doing so, consider whether the other information is materially inconsistent with the financial statements or our knowledge obtained in the course of the audit or otherwise appears to be materially misstated. If we identify such material inconsistencies or apparent material misstatements, we are required to determine whether this gives rise to a material misstatement in the financial statements themselves. If, based on the work we have performed, we conclude that there is a material misstatement of this other information, we are required to report that fact.</span></p><p class=\"\"><span>We have nothing to report in this regard.</span></p><p class=\"\"><span>Opinions on other matters prescribed by the Companies Act 2006</span></p><p class=\"\"><span>In our opinion, based on the work undertaken in the course of the audit:</span></p><p class=\"\"><span>·      the information given in the strategic report and the directors' report for the financial period for which the financial statements are prepared is consistent with the financial statements; and</span></p><p class=\"\"><span>·      the strategic report and the directors' report have been prepared in accordance with applicable legal requirements.</span></p><p class=\"\"><span>Other matters - prior year unaudited</span></p><p class=\"\"><span>The financial statements of the Company for the year ended 31 August 2024 were not audited. Accordingly, the corresponding figures presented for that period are unaudited. Our opinion on the current year's financial statements is not modified in respect of this matter. In accordance with ISA (UK) 710, we have obtained sufficient appropriate audit evidence to satisfy ourselves that the opening balances do not contain misstatements that materially affect the current year's financial statements.</span></p><p class=\"\"><span>Matters on which we are required to report by exception</span></p><p class=\"\"><span>In the light of the knowledge and understanding of the group and the parent company and their environment obtained in the course of the audit, we have not identified material misstatements in the strategic report and the directors' report.</span></p><p class=\"\"><span>We have nothing to report in respect of the following matters in relation to which the Companies Act 2006 requires us to report to you if, in our opinion:</span></p><p class=\"\"><span>·      adequate accounting records have not been kept by the parent company, or returns adequate for our audit have not been received from branches not visited by us; or</span></p><p class=\"\"><span>·      the parent company financial statements and the part of the directors remuneration report to be audited are not in agreement with the accounting records and returns; or</span></p><p class=\"\"><span>·      certain disclosures of directors' remuneration specified by law are not made; or</span></p><p class=\"\"><span>·      we have not received all the information and explanations we require for our audit.</span></p><p class=\"\"><span>Responsibilities of directors</span></p><p class=\"\"><span>As explained more fully in the directors' responsibilities statement the directors are responsible for the preparation of the financial statements and for being satisfied that they give a true and fair view, and for such internal control as the directors determine is necessary to enable the preparation of financial statements that are free from material misstatement, whether due to fraud or error.</span></p><p class=\"\"><span>In preparing the financial statements, the directors are responsible for assessing the group and the parent company's ability to continue as a going concern, disclosing, as applicable, matters related to going concern and using the going concern basis of accounting unless the directors either intend to liquidate the group or the parent company or to cease operations, or have no realistic alternative but to do so.</span></p><p class=\"\"><span>Auditor responsibilities for the audit of the financial statements</span></p><p class=\"\"><span>Our objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor's report that includes our opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with ISAs (UK) will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of these financial statements.</span></p><p class=\"\"><span>Irregularities, including fraud, are instances of non-compliance with laws and regulations. We design procedures in line with our responsibilities, outlined above, to detect material misstatements in respect of irregularities, including fraud. The extent to which our procedures are capable of detecting irregularities, including fraud is detailed below:</span></p><p class=\"\"><span>·      We obtained an understanding of the legal and regulatory frameworks within which the Company operates focusing on those laws and regulations that have a direct effect on the determination of material amounts and disclosures in the financial statements. The laws and regulations we considered in this context were the Companies Act 2006 and relevant taxation legislation.</span></p><p class=\"\"><span>·      We identified the greatest risk of material impact on the financial statements from irregularities, including fraud, to be the override of controls by management. Our audit procedures to respond to these risks included enquiries of management about their own identification and assessment of the risks of irregularities, sample testing on the posting of journals and reviewing accounting estimates for biases.</span></p><p class=\"\"><span>·      We designed our audit procedures to ensure the audit team considered whether there were any indications of non-compliance by the group and parent company with those laws and regulations. These procedures included, but were not limited to :</span></p><p class=\"\"><span>o  Enquiries of management;</span></p><p class=\"\"><span>o  Review of Board meeting minutes; and</span></p><p class=\"\"><span>o  Review of legal correspondence.</span></p><p class=\"\"><span>Because of the inherent limitations of an audit, there is a risk that we will not detect all irregularities, including those leading to a material misstatement in the financial statements or non-compliance with regulation.  This risk increases the more that compliance with a law or regulation is removed from the events and transactions reflected in the financial statements, as we will be less likely to become aware of instances of non-compliance. The risk is also greater regarding irregularities occurring due to fraud rather than error, as fraud involves intentional concealment, forgery, collusion, omission or misrepresentation.</span></p><p class=\"\"><span>A further description of our responsibilities is available on the Financial Reporting Council's website at: www.frc.org.uk/auditorsresponsibilities. This description forms part of our auditor's report.</span></p><p class=\"\"><span>Other matters that we are required to address</span></p><p class=\"\"><span>We were appointed on 20 November 2025 and this is the first period of our engagement as auditors for the Group.</span></p><p class=\"\"><span>The non-audit services prohibited by the FRC's Ethical Standard were not provided to the group or the parent company and we remain independent of the group and the parent company in conducting our audit.</span></p><p class=\"\"><span>Our audit opinion is consistent with the additional report to the audit committee.</span></p><p class=\"\"><span>Use of our report</span></p><p class=\"\"><span>This report is made solely to the company's members, as a body, in accordance with our engagement letter. Our audit work has been undertaken so that we might state to the company's members those matters we are required to state to them in an auditor's report and for no other purpose. To the fullest extent permitted by law, we do not accept or assume responsibility to anyone other than the company and the company's members as a body, for our audit work, for this report, or for the opinions we have formed.</span></p><p class=\"\"><span>Steven Johnson FCCA (Senior Statutory Auditor)</span></p><p class=\"\"><span>For and on behalf of RPG Crouch Chapman LLP</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  FR BLGDDLDDDGLR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7853Ua:0-reg-medpal-ai-plc-final-results/",
            "pub_date": "2026-02-28 00:32:40",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947346:0",
            "title": "M. Dias Branco: Revenue up 8%, record cash generation, and market share gains despite cost pressures",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net revenue grew 8% to BRL 10.4 billion in 2025, with strong cash generation and market share gains in key categories. Margin pressures from higher costs were partly offset by operational efficiencies and growth in food service and healthy products.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947346:0-m-dias-branco-revenue-up-8-record-cash-generation-and-market-share-gains-despite-cost-pressures/",
            "pub_date": "2026-02-28 00:32:53",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007570:0",
            "title": "U.S. Corporations' Outlook Still Upbeat Despite Widening Spreads — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This month's widening of U.S. credit spreads reflects a normalization from historically tight levels, Comerica's Bill Adams says. He compares the move with equity markets' poor performance this month. \"Credit markets have normalized a little bit over the last month as the stock market has treaded water,\" he says. \"But they still point to a generally upbeat view for the outlook for business financial health.\" An ICE BofA index tracked by the St. Louis Fed puts the spread at 0.8 percentage point as of Feb. 23, up from 0.73 p.p. a month ago. (paulo.trevisani@wsj.com; @ptrevisani)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007570:0/",
            "pub_date": "2026-02-28 00:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007574:0",
            "title": "Kansas City Fed Services Activity Index Rises in February",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Colin Kellaher</span></p><p class=\"\"><span>Services activity in the middle of the U.S. rose again in February, and expectations for future activity stayed positive, according to a monthly survey by the Federal Reserve Bank of Kansas City released Friday.</span></p><p class=\"\"><span>The Tenth District Services Survey's composite index, a weighted average of indexes covering revenue/sales, employment and inventory, came in at 6 in February following readings of 2 in January and 1 in December. Readings above zero indicate expansion, while those below zero indicate contraction.</span></p><p class=\"\"><span>The Kansas City Fed said regional services activity continued to rise this month, as revenue growth reached its highest reading since June 2023.</span></p><p class=\"\"><span>The bank said its index of expectations for future services activity slipped to 13 in February from 15 in January.</span></p><p class=\"\"><span>The Kansas City Fed's survey includes participants from such service industries as retail and wholesale trade, automobile dealers, real estate and restaurants. The survey provides information on current services activity in the Tenth District, which includes Colorado, Oklahoma, Wyoming, Nebraska, Kansas, the northern half of New Mexico and the western third of Missouri.</span></p><p class=\"\"><span>The bank's monthly manufacturing survey, released Thursday, showed that activity at factories in the central U.S. rose in February.</span></p><p class=\"\"><span>Write to Colin Kellaher at colin.kellaher@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007574:0/",
            "pub_date": "2026-02-28 00:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007567:0",
            "title": "JM Smucker Is Maintained at Market Perform by Bernstein",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(16:33 GMT) </span></strong><span>JM Smucker Price Target Raised to $121.00/Share From $113.00 by Bernstein</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007567:0/",
            "pub_date": "2026-02-28 00:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7839Ua:0",
            "title": "REG - Odyssean Inv. Trust - Issue of Equity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7839U  Odyssean Investment Trust PLC  27 February 2026   </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Issue of Ordinary Shares </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>On 27 February 2026 Odyssean Investment Trust plc (the \"Company\") issued 1,100,000 new ordinary shares of 1p each at a price of 191.75 pence per share from its blocklisting, pursuant to the Company's premium management strategy.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>These shares rank pari passu with the existing ordinary shares in issue and they were issued at a premium to the estimated net asset value per share at the time of the transaction.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Following this issue, the Company has a block listing for 5,938,921 ordinary shares.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>As a result of this issuance, the total number of ordinary shares in issue is 138,752,791 and the total number of voting rights in the Company is 138,752,791. There are no shares held in treasury.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The above figure may be used by shareholders as the denominator for the calculation by which they may determine if they are required to notify their interest in, or change to their interest in, the Company under the FCA's Disclosure Guidance and Transparency Rules. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Enquiries: </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NSM Funds (UK) Limited</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company Secretary  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OIT@nsm.group </span></p></li></ul><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  IOEFLFVRFIIDFIR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7839Ua:0-reg-odyssean-inv-trust-issue-of-equity/",
            "pub_date": "2026-02-28 00:33:23",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947347:0",
            "title": "NHI: Normalized FFO per share rose 8.9% in Q4, with SHOP NOI up 125% year-over-year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Normalized FFO per share grew 8.9% in Q4 and 10.6% for 2025, driven by strong SHOP segment performance and record investment activity. 2026 guidance anticipates continued SHOP growth, $230M in new investments, and a focus on capital recycling and margin expansion.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947347:0-nhi-normalized-ffo-per-share-rose-8-9-in-q4-with-shop-noi-up-125-year-over-year/",
            "pub_date": "2026-02-28 00:33:53",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947348:0",
            "title": "NEXA: Record zinc output and improved margins drive strong 2025 results, with leverage down to 1.7x",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strong Q4 and full-year 2025 results were driven by higher zinc production, disciplined cost management, and favorable pricing. Net leverage improved to 1.7x, with robust liquidity and a focus on deleveraging and growth in copper. Aripuanã and Cerro Pasco projects remain key near-term catalysts.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947348:0-nexa-record-zinc-output-and-improved-margins-drive-strong-2025-results-with-leverage-down-to-1-7x/",
            "pub_date": "2026-02-28 00:33:53",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007578:0",
            "title": "Teleflex Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(16:34 GMT) </span></strong><span>Teleflex Price Target Raised to $130.00/Share From $116.00 by Wells Fargo</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007578:0/",
            "pub_date": "2026-02-28 00:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7863Ua:0",
            "title": "REG - HANetf II ICAV HANetf PTTRBACC $ HANetf PTTRBACC £ HANetf Yieldmax Big$ HANetf Yieldmax Big£ - Net Asset Value(s)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7863U  HANetf II ICAV  27 February 2026   </span><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Funds</span></p></td><td><p class=\"\"><span>ISIN</span></p></td><td><p class=\"\"><span>Date</span></p></td><td><p class=\"\"><span>Currency</span></p></td><td><p class=\"\"><span>Shares In Issue</span></p></td><td><p class=\"\"><span>Net Asset Value</span></p></td><td><p class=\"\"><span>NAV Per Share</span></p></td></tr><tr><td><p class=\"\"><span>Performance Trust Total Return Bond UCITS ETF</span></p></td><td><p class=\"\"><span>IE000X5OD4M3</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td><td><p class=\"\"><span>USD</span></p></td><td><p class=\"\"><span>520,000</span></p></td><td><p class=\"\"><span>$4,389,041.58</span></p></td><td><p class=\"\"><span>8.4405</span></p></td></tr><tr><td><p class=\"\"><span>YieldMax Big Tech Option Income UCITS ETF</span></p></td><td><p class=\"\"><span>IE000MMRLY96</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td><td><p class=\"\"><span>USD</span></p></td><td><p class=\"\"><span>1,180,000</span></p></td><td><p class=\"\"><span>$50,462,551.91</span></p></td><td><p class=\"\"><span>42.7649</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  NAVAKOBNABKDBBB</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7863Ua:0-reg-hanetf-ii-icav-hanetf-pttrbacc-hanetf-pttrbacc-hanetf-yieldmax-big-hanetf-yieldmax-big-net-asset-value-s/",
            "pub_date": "2026-02-28 00:34:01",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7866Ua:0",
            "title": "REG - Vanquis Banking Grp Schroders PLC - Holding(s) in Company",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7866U  Vanquis Banking Group PLC  27 February 2026   </span><p class=\"\"><span>TR-1: Standard form for notification of major holdings</span></p><p class=\"\"><span>1. Issuer Details</span></p><p class=\"\"><span>ISIN</span></p><p class=\"\"><span>GB00B1Z4ST84</span></p><p class=\"\"><span>Issuer Name</span></p><p class=\"\"><span>VANQUIS BANKING GROUP PLC</span></p><p class=\"\"><span>UK or Non-UK Issuer</span></p><p class=\"\"><span>UK</span></p><p class=\"\"><span>2. Reason for Notification</span></p><p class=\"\"><span>An acquisition or disposal of voting rights</span></p><p class=\"\"><span>3. Details of person subject to the notification obligation</span></p><p class=\"\"><span>Name</span></p><p class=\"\"><span>Schroders Plc</span></p><p class=\"\"><span>City of registered office (if applicable)</span></p><p class=\"\"><span>London Wall, Barbican</span></p><p class=\"\"><span>Country of registered office (if applicable)</span></p><p class=\"\"><span>England</span></p><p class=\"\"><span>4. Details of the shareholder</span></p><p class=\"\"><span>Full name of shareholder(s) if different from the person(s) subject to the notification obligation, above</span></p><p class=\"\"><span>City of registered office (if applicable)</span></p><p class=\"\"><span>Country of registered office (if applicable)</span></p><p class=\"\"><span>5. Date on which the threshold was crossed or reached</span></p><p class=\"\"><span>26-Feb-2026</span></p><p class=\"\"><span>6. Date on which Issuer notified</span></p><p class=\"\"><span>27-Feb-2026</span></p><p class=\"\"><span>7. Total positions of person(s) subject to the notification obligation</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>% of voting rights attached to shares (total of 8.A)</span></p></td><td><p class=\"\"><span>% of voting rights through financial instruments (total of 8.B 1 + 8.B 2)</span></p></td><td><p class=\"\"><span>Total of both in % (8.A + 8.B)</span></p></td><td><p class=\"\"><span>Total number of voting rights held in issuer</span></p></td></tr><tr><td><p class=\"\"><span>Resulting situation on the date on which threshold was crossed or reached</span></p></td><td><p class=\"\"><span>11.663716</span></p></td><td><p class=\"\"><span>0.000000</span></p></td><td><p class=\"\"><span>11.663716</span></p></td><td><p class=\"\"><span>29916704</span></p></td></tr><tr><td><p class=\"\"><span>Position of previous notification (if applicable)</span></p></td><td><p class=\"\"><span>12.833335</span></p></td><td><p class=\"\"><span>0.000000</span></p></td><td><p class=\"\"><span>12.833335</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>8. Notified details of the resulting situation on the date on which the threshold was crossed or reached</span></p><p class=\"\"><span>8A. Voting rights attached to shares</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class/Type of shares ISIN code(if possible)</span></p></td><td><p class=\"\"><span>Number of direct voting rights (DTR5.1)</span></p></td><td><p class=\"\"><span>Number of indirect voting rights (DTR5.2.1)</span></p></td><td><p class=\"\"><span>% of direct voting rights (DTR5.1)</span></p></td><td><p class=\"\"><span>% of indirect voting rights (DTR5.2.1)</span></p></td></tr><tr><td><p class=\"\"><span>GB00B1Z4ST84</span></p></td><td></td><td><p class=\"\"><span>29916704</span></p></td><td></td><td><p class=\"\"><span>11.663716</span></p></td></tr><tr><td><p class=\"\"><span>Sub Total 8.A</span></p></td><td colspan=\"2\"><p class=\"\"><span>29916704</span></p></td><td colspan=\"2\"><p class=\"\"><span>11.663716%</span></p></td></tr></tbody></table></div><p class=\"\"><span>8B1. Financial Instruments according to (DTR5.3.1R.(1) (a))</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Type of financial instrument</span></p></td><td><p class=\"\"><span>Sub Total 8.B1</span></p></td></tr><tr><td><p class=\"\"><span>Expiration date</span></p></td><td colspan=\"2\"></td></tr><tr><td><p class=\"\"><span>Exercise/conversion period</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Number of voting rights that may be acquired if the instrument is exercised/converted</span></p></td><td></td></tr><tr><td><p class=\"\"><span>% of voting rights</span></p></td></tr></tbody></table></div><p class=\"\"><span>8B2. Financial Instruments with similar economic effect according to (DTR5.3.1R.(1) (b))</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Type of financial instrument</span></p></td><td><p class=\"\"><span>Sub Total 8.B2</span></p></td></tr><tr><td><p class=\"\"><span>Expiration date</span></p></td><td colspan=\"3\"></td></tr><tr><td><p class=\"\"><span>Exercise/conversion period</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Physical or cash settlement</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Number of voting rights</span></p></td></tr><tr><td><p class=\"\"><span>% of voting rights</span></p></td></tr></tbody></table></div><p class=\"\"><span>9. Information in relation to the person subject to the notification obligation</span></p><p class=\"\"><span>2. Full chain of controlled undertakings through which the voting rights and/or the financial instruments are effectively held starting with the ultimate controlling natural person or legal entities (please add additional rows as necessary)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Ultimate controlling person</span></p></td><td><p class=\"\"><span>Name of controlled undertaking</span></p></td><td><p class=\"\"><span>% of voting rights if it equals or is higher than the notifiable threshold</span></p></td><td><p class=\"\"><span>% of voting rights through financial instruments if it equals or is higher than the notifiable threshold</span></p></td><td><p class=\"\"><span>Total of both if it equals or is higher than the notifiable threshold</span></p></td></tr><tr><td><p class=\"\"><span>Schroders PLC</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Schroders PLC</span></p></td><td><p class=\"\"><span>Schroder Administration Limited</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Schroders PLC</span></p></td><td><p class=\"\"><span>Schroder International Holdings Limited</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Schroders PLC</span></p></td><td><p class=\"\"><span>Schroder Investment Management Limited</span></p></td><td><p class=\"\"><span>11.663716</span></p></td><td></td><td><p class=\"\"><span>11.663716%</span></p></td></tr></tbody></table></div><p class=\"\"><span>10. In case of proxy voting</span></p><p class=\"\"><span>Name of the proxy holder</span></p><p class=\"\"><span>The number and % of voting rights held</span></p><p class=\"\"><span>The date until which the voting rights will be held</span></p><p class=\"\"><span>11. Additional Information</span></p><p class=\"\"><span>12. Date of Completion</span></p><p class=\"\"><span>27-Feb-2026</span></p><p class=\"\"><span>13. Place Of Completion</span></p><p class=\"\"><span>London</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  HOLTRMFTMTJTBJF</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7866Ua:0-reg-vanquis-banking-grp-schroders-plc-holding-s-in-company/",
            "pub_date": "2026-02-28 00:34:50",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007583:0",
            "title": "FTC Release: FTC Issues Second Report to Congress on its Work to Fight Ransomware and other Cyberattacks",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The Federal Trade Commission issued a second report to Congress detailing the agency's efforts to fight against ransomware and other cyberattacks.</span></p><p class=\"\"><span>View Press Release: https://www.ftc.gov/news-events/news/press-releases/2026/02/ftc-issues-second-report-congress-its-work-fight-ransomware-other-cyberattacks</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007583:0/",
            "pub_date": "2026-02-28 00:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947339:0",
            "title": "Compañía de Minas Buenaventura: San Gabriel nears completion as gold output guidance is lowered and dividend payout rises",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Copper and silver output remained stable, while gold production declined due to operational constraints. San Gabriel reached 99% completion and began ramp-up, with lower 2026 gold guidance due to ventilation and permitting delays. Dividend payout increased to 40% of net income.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947339:0-compa-a-de-minas-buenaventura-san-gabriel-nears-completion-as-gold-output-guidance-is-lowered-and-dividend-payout-rises/",
            "pub_date": "2026-02-28 00:28:22",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2CM:0",
            "title": "UK's Ofcom Provisionally Finds Suicide Forum In Breach Of Online Safety Act",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>UK'S OFCOM: PROVISIONALLY FINDS SUICIDE FORUM IN BREACH OF ONLINE SAFETY ACT</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2CM:0-uk-s-ofcom-provisionally-finds-suicide-forum-in-breach-of-online-safety-act/",
            "pub_date": "2026-02-28 00:28:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007523:0",
            "title": "Week Ahead for FX, Bonds: U.S. Jobs Data in Focus",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Dow Jones Newswires staff</span></p><p class=\"\"><span>Below are the most important global events likely to affect FX and bond markets in the week starting March 2.</span></p><p class=\"\"><span>U.S. jobs data will mark the highlight of the coming week as investors remain uncertain about when the Federal Reserve is next likely to cut interest rates.</span></p><p class=\"\"><span>In Europe, attention will center on eurozone inflation data and the spring statement by the U.K.'s treasury chief. In Asia, the Bank of Japan's policy outlook, Australia's growth figures and China's annual parliamentary sessions are in focus.</span></p><p class=\"\"><span>U.S.</span></p><p class=\"\"><span>U.S. jobs data are back in focus in the coming week, with monthly nonfarm payrolls data for February due on Friday.</span></p><p class=\"\"><span>Investors will be looking to see whether January's surprisingly strong payrolls numbers were a one-off. This comes amid uncertainty over whether the U.S. Federal Reserve will cut interest rates in the coming months, although analysts say it would likely take a particularly weak number to move the dial much on rate expectations.</span></p><p class=\"\"><span>\"Our view is that it would take quite a lot to get the Fed thinking about an imminent rate cut,\" ING economists said in a note.</span></p><p class=\"\"><span>U.S. money markets aren't pricing in a rate cut until July at the earliest, LSEG data show. ING doesn't expect another reduction until June.</span></p><p class=\"\"><span>Ahead of Friday's key data, ADP private payrolls figures for February will be released Wednesday, followed by weekly jobless claims Thursday.</span></p><p class=\"\"><span>The latest ISM surveys for February for manufacturing and services activity will be released on Monday and Wednesday, respectively. These will be keenly watched for indications of the overall performance of the U.S. economy, particularly amid uncertainty over U.S. tariff policy and tensions between the U.S. and Iran. U.S. January retail sales data are also released Friday.</span></p><p class=\"\"><span>Eurozone</span></p><p class=\"\"><span>The eurozone data calendar thins out after the usual end-of-month avalanche.</span></p><p class=\"\"><span>Spanish, Italian, French, German and eurozone manufacturing and services PMI data are due on Monday and Wednesday, respectively.</span></p><p class=\"\"><span>Italy will release yearly GDP data on Monday and flash estimate CPI data for February on Tuesday, when the same data is also scheduled from the eurozone as a whole.</span></p><p class=\"\"><span>Eurozone unemployment figures for January are scheduled for Wednesday and retail sales data for the same month on Thursday. Germany will publish manufacturing orders data for January on Friday.</span></p><p class=\"\"><span>Final fourth-quarter GDP and employment data from the eurozone are due on Friday.</span></p><p class=\"\"><span>\"For now, the economy still looks to be 'in a good place', albeit one that the European Central Bank thinks requires vigilance and agility,\" Investec analyst Sandra Horsfield says in a note.</span></p><p class=\"\"><span>The Netherlands will launch a new 10-year bond via a Dutch Direct Auction on Tuesday, aiming to issue between 6 billion euros and 7 billion euros. Germany will auction April 2031 bonds on Tuesday and a February 2033 green Bund on Wednesday. Spain and France will hold bond auctions on Thursday. Italy will issue a new series of retail-only BTP Valore, with subscriptions running between Monday and Friday.</span></p><p class=\"\"><span>U.K.</span></p><p class=\"\"><span>Focus in the U.K. will be on Tuesday's spring statement, a twice-yearly report on U.K. public finances which Treasury chief Rachel Reeves will present before lawmakers. This will be followed by an announcement on gilt issuance by the Debt Management Office.</span></p><p class=\"\"><span>Markets expect Reeves to announce an improved fiscal position, including solid fiscal headroom. Gilt investors also expect government debt issuance to fall in the fiscal year to April 2027. Analysts said this could help push yields on U.K. government bonds lower.</span></p><p class=\"\"><span>Economic data include final purchasing managers' data for February on manufacturing on Monday, then on services Wednesday. Data on consumer credit and mortgage lending for January are released on Monday, as well as the latest Nationwide house price index for February. The BRC's shop price index for February is released Tuesday.</span></p><p class=\"\"><span>Poland</span></p><p class=\"\"><span>Poland's central bank announces an interest-rate decision on Wednesday, where it could announce a 25 basis-point reduction in its key policy rate to 3.75%.</span></p><p class=\"\"><span>HSBC economists expect a rate cut due to evidence of declining inflation.</span></p><p class=\"\"><span>\"We continue to expect that during the March meeting the rate-setters will have a new inflation forecast that will show a downward revision to the Polish central bank's 2026 inflation forecast, to or even below the 2.5% target,\" they said in a note. This should be enough to warrant a rate cut, they said.</span></p><p class=\"\"><span>Japan</span></p><p class=\"\"><span>Investors will look for clues on the timing of the Bank of Japan's next rate increase in speeches by BOJ officials. Deputy Gov. Ryozo Himino will meet local leaders in Wakayama, Japan, on Monday. Governor Kazuo Ueda is scheduled to appear at the  \"FIN/SUM 2026\" event in Tokyo on Tuesday.</span></p><p class=\"\"><span>Japan's Ministry of Finance will auction about 2.6 trillion yen of 10-year government bonds on Tuesday and around 700 billion yen of 30-year bonds on Thursday. The 30-year sale may draw strong demand from pension funds and insurers seeking higher yields.</span></p><p class=\"\"><span>Auto sales figures for February are also scheduled for release on Monday.</span></p><p class=\"\"><span>Australia</span></p><p class=\"\"><span>Bond traders will focus on Australia's fourth-quarter 2025 growth data due Wednesday.</span></p><p class=\"\"><span>The economy is expected to have grown 2.1% in calendar 2025 while operating near full capacity, adding to inflation pressures.</span></p><p class=\"\"><span>The week will therefore be dominated once again by a discussion about a decade of weak productivity growth, excessive government spending and the potential for the Reserve Bank of Australia to raise interest rates in the coming months, perhaps as early as mid-March.</span></p><p class=\"\"><span>The release on Thursday of the household spending indicator for January will also be closely watched by the central bank, given that strong consumer spending will add to the case for higher interest rates.</span></p><p class=\"\"><span>RBA Governor Michele Bullock will deliver a speech on Tuesday. Bullock has been indicating that the central bank is closely monitoring data, including quarterly inflation numbers in late April that are likely to be critical in setting the scene for an interest rate increase in May.</span></p><p class=\"\"><span>For the RBA, the data will point to whether aggregate capacity constraints are more or less worrisome than before. January's household spending data should show consumer activity starting 2026 at a subdued pace, while house price data is likely to confirm another strong monthly increase.</span></p><p class=\"\"><span>China</span></p><p class=\"\"><span>China returns from the Lunar New Year holiday to a busy week of data and policy announcements, including the annual meetings of its top legislature and advisory body.</span></p><p class=\"\"><span>The National People's Congress, part of the \"Two Sessions,\" will open on Thursday. Beijing is expected to announce key economic targets for 2026, including GDP growth.</span></p><p class=\"\"><span>ING economists forecast the growth target will be lowered to \"above 4.5%\" from \"around 5.0%\" in recent years. Fiscal targets, including the deficit-to-GDP ratio and bond issuance, are also expected.</span></p><p class=\"\"><span>A reduced growth target would mark the first in four years. Citi economists said such a move would signal measured stimulus. They anticipate 1 trillion yuan in fiscal support, a possible 10-basis-point rate cut and a 50-basis-point reserve requirement ratio cut this year.</span></p><p class=\"\"><span>Further measures could focus on stabilizing the labor market, boosting household income and domestic demand as well as advancing AI adoption.</span></p><p class=\"\"><span>Official PMIs due Wednesday are likely to reflect disruption from February's extended holidays. ANZ economist Krystal Tan expects the manufacturing PMI to fall to 49.0 from 49.3, and the non-manufacturing PMI to edge down to 49.3 from 49.4. Small and midsize firms may show particular weakness, with tourism gains offset by softness in construction and finance.</span></p><p class=\"\"><span>Private PMIs compiled by RatingDog are also due Wednesday. Foreign-exchange reserves data will be released Saturday.</span></p><p class=\"\"><span>Asian PMIs</span></p><p class=\"\"><span>Monday brings February manufacturing PMIs for Taiwan, Japan, India, Vietnam and other economies.</span></p><p class=\"\"><span>Investors will look for signs that renewed U.S. tariff uncertainty has affected business sentiment, especially after The Supreme Court struck down Trump's global tariffs as illegal.</span></p><p class=\"\"><span>The ruling may offer temporary relief for some exporters, but trade policy remains uncertain. Momentum is likely to remain supported by a strong tech-led export cycle, which remains largely insulated from the tariff shifts, ANZ added.</span></p><p class=\"\"><span>Malaysia</span></p><p class=\"\"><span>Malaysia's central bank will announce its rate decision Thursday afternoon.</span></p><p class=\"\"><span>With inflation contained and labor-cost growth moderate, Citi expects Bank Negara to keep its policy rate unchanged at 2.75% through 2026. Policymakers are likely to favor a gradual appreciation of the ringgit to tighten monetary conditions.</span></p><p class=\"\"><span>South Korea</span></p><p class=\"\"><span>South Korea is expected to report solid February exports on Mar. 1, driven by robust semiconductor demand despite fewer working days in the month.</span></p><p class=\"\"><span>A Wall Street Journal poll of nine economists forecast exports rose 25.6% from a year earlier, after a revised 33.8% increase in January. Early February trade data suggest chip exports are on track for a monthly record. Imports likely rose 13.6%, resulting in a $10.10 billion trade surplus--wider than January's revised $8.72 billion surplus.</span></p><p class=\"\"><span>February inflation data are due Friday. Headline inflation is expected to remain near the central bank's 2% target after easing to a five-month low of 2.0% in January from 2.3% in December.</span></p><p class=\"\"><span>Indonesia</span></p><p class=\"\"><span>Indonesia will release January trade and February inflation data Monday afternoon.</span></p><p class=\"\"><span>Headline inflation likely rose in February due to base effects and stronger demand during Ramadan, Kenanga Investment Bank said.</span></p><p class=\"\"><span>January export growth may moderate as base effects fade after a temporary rise in late 2025, RHB said in a note. However, exports should maintain moderate growth over 2026, driven by ongoing efforts to diversify markets, RHB added.</span></p><p class=\"\"><span>Philippines, Thailand</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007523:0/",
            "pub_date": "2026-02-28 00:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7844Ua:0",
            "title": "REG - Triple Point Venture - Total Voting Rights",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7844U  Triple Point Venture VCT PLC  27 February 2026   </span><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Triple Point Venture VCT Plc</span></p><p class=\"\"><span>(the \"Company\")</span></p><p class=\"\"><span>TOTAL VOTING RIGHTS</span></p><p class=\"\"><span>The following notification is made in accordance with the UK Financial Conduct Authority Disclosure Guidance and Transparency Rule 5.6.1.</span></p><p class=\"\"><span>On 27 February 2026, the issued share capital of the Company was 119,889,748 Venture Shares. The Company does not hold any shares in Treasury. Therefore, the total number of voting rights in the Company is 119,889,748.</span></p><p class=\"\"><span>The above figure may be used by shareholders as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change to their interest in, the Company under the FCA's Disclosure Guidance and Transparency Rules.</span></p><p class=\"\"><span>FOR FURTHER INFORMATION ON THE COMPANY, PLEASE CONTACT</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span> Triple Point Investment Management LLP</span></p><p class=\"\"><span> (Investment Manager)</span></p></td><td><p class=\"\"><span>Tel: 020 7201 8989</span></p></td></tr><tr><td><p class=\"\"><span> Seb Wallace</span></p><p class=\"\"><span> Jack Rose</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>The Company's LEI is 213800AOOAQA5XQDEA89</span></p><p class=\"\"><span>Further information on the Company can be found on its website </span></p><p class=\"\"><span>https://www.triplepoint.co.uk/current-vcts/triple-point-venture-vct-plc/s2539/</span></p><p class=\"\"><span>NOTES:</span></p><p class=\"\"><span>The Company is a Venture Capital Trust incorporated in July 2010 and was established to fund small and medium sized enterprises. The Investment Manager is Triple Point Investment Management LLP.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  TVREAKAXAAXKEFA</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7844Ua:0-reg-triple-point-venture-total-voting-rights/",
            "pub_date": "2026-02-28 00:29:20",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        }
    ]
}