{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463758:0",
            "title": "Market Chatter: US Weighs Adding Shein, Temu to Forced Labor Watchlist",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The US is considering whether to place Chinese e-commerce giants Shein and Temu on the Department of Homeland Security's forced labor list, Reuters reported Wednesday, citing sources familiar with the matter. </p><p class=\"\">However, no final decision has been made, according to the report. </p><p class=\"\">Both Shein and Temu deny any involvement in forced labor. Shein told Reuters it fully complies with the Uyghur Forced Labor Prevention Act, while Temu said it has strict policies against involuntary labor. </p><p class=\"\">China recently imposed tariffs of up to 15% on US coal and LNG in response to the 10% tariffs levied by the Trump administration on Chinese imports. </p><p class=\"\">Separately on Tuesday, the US Postal Service said it would temporarily suspend parcels from China and Hong Kong after US President Trump this week shut a trade loophole that Shein and Temu use to ship packages duty-free to the US. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463758:0/",
            "pub_date": "2025-02-05 14:20:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:fb0cae15d094b:0",
            "title": "Bitcoin miner Bitdeer acquires Canadian power project for $21.7 million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bitcoin mining firm Bitdeer has completed a $21.7 million deal to acquire a 101-megawatt power project in Alberta, Canada, as the company continues to scale up its mining operations.</p><p class=\"\">The Nasdaq-listed firm announced on Tuesday that it acquired the site, with permits and licenses, on 19 acres of land near Fox Creek, Alberta. The project has the potential to scale to 1 GW of power, the company said.</p><p class=\"\">Bitdeer noted that it intends to further construct and develop the Alberta power plant, which it aims to energize by the fourth quarter of 2026. It also plans to build 99 MW of data center capacity for bitcoin mining on the site. </p><p class=\"\">“This newly acquired site and power generation project provides the Company a unique opportunity to become the world’s first fully-vertically integrated Bitcoin miner at scale and potentially achieve some of the lowest Bitcoin mining production costs in the industry,” Bitdeer said in the statement.</p><p class=\"\">“It marks a significant step in our strategy to become the first fully vertically integrated bitcoin miner, giving us unmatched control over costs, energy efficiency, and scalability,” said Haris Basit, chief strategy officer of Bitdeer. </p><p class=\"\">Headquartered in Singapore, Bitdeer currently has mining operations in the U.S., Norway and Bhutan. As of December, Bitdeer has about 21.6 EH/s of hashing power under management, according to its latest operational update.</p><p class=\"\">Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</p><p class=\"\">© 2024 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p></span></div>",
            "link": "https://www.tradingview.com/news/the_block:fb0cae15d094b:0-bitcoin-miner-bitdeer-acquires-canadian-power-project-for-21-7-million/",
            "pub_date": "2025-02-05 14:21:24",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0M8:0",
            "title": "India's Global Health eyes best day in nearly 2 yrs on Q3 profit rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Global Health  rise 7.6% to 1,120 rupees, eyes best one-day pct gain since March 31, 2023</p><p class=\"\">** The healthcare facilities and services provider posted a 16% Y/Y rise in Q3 consolidated net profit to 1.43 bln rupees ($16.40 mln); rev from ops up 13%</p><p class=\"\">** Co aided by higher patient volumes and strong contributions from its developing hospitals</p><p class=\"\">** Co saw 10.5% Y/Y rise in average occupied bed days, aiding an occupancy of 63.6% on increased bed capacity</p><p class=\"\">** More than 578,000 shares change hands, 1.9x its 30-day avg</p><p class=\"\">** 11 analysts covering the stock on avg have a \"hold\"; median PT is 1,200 rupees - LSEG data</p><p class=\"\">($1 = 87.2025 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0M8:0-india-s-global-health-eyes-best-day-in-nearly-2-yrs-on-q3-profit-rise/",
            "pub_date": "2025-02-05 14:22:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463768:0",
            "title": "Market Chatter: Panama Looking to Cancel CK Hutchinson's Port Contract",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Panama government is looking to revoke its contract with Hong Kong conglomerate CK Hutchison , which operates ports near the Panama Canal, Bloomberg News reported Tuesday, citing people with knowledge of the situation. </p><p class=\"\">Should Panamanian President Jose Raul Mulino's threat go through, it would appease US President Donald Trump's threats against Panama over China's influence around the canal, the report said. </p><p class=\"\">Hutchison Ports operates two out of five ports surrounding the canal, one on each side, the report said. </p><p class=\"\">The US completed construction of the canal in 1914 and ceded control over the canal to Panama in 1999 under a treaty signed decades ago by President Jimmy Carter. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463768:0/",
            "pub_date": "2025-02-05 14:23:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0D4:0",
            "title": "Santander books Q4 record profit, unveils 10 bln euro buyback over 2 years",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Santander  on Wednesday said its net profit rose 11% in the fourth quarter thanks to a solid performance at its main retail businesses in Spain and Brazil which offset the cost of extraordinary provisions on its consumer lending unit.</p><p class=\"\">     One of the euro zone's three biggest banks by market value booked a record quarterly net profit of 3.27 billion euros ($3.39 billion), more than the 2.93 billion euros expected by analysts in a Reuters poll.</p><p class=\"\">The lender also said it expected to return 10 billion euros through share buybacks with the proceeds of 2025 and 2026 earnings and anticipated excess capital, in addition to its standard cash dividend distribution.</p><p class=\"\">Santander, like other banks, has benefited from higher interest rates, but growth in its key Latin American markets has given it an edge over more European-dependent rivals that have scaled back their presence in the Americas. </p><p class=\"\">For the whole of 2024, Santander reported a record net profit of 12.57 billion euros, a rise of 14% compared to 2023, thanks to the bank's geographical diversification. Analysts expected a full-year net profit of 12.2 billion euros. </p><p class=\"\">    ($1 = 0.9638 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0D4:0-santander-books-q4-record-profit-unveils-10-bln-euro-buyback-over-2-years/",
            "pub_date": "2025-02-05 14:23:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV036:0",
            "title": "China has delayed or redirected 600,000 tons of wheat imports, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China's wheat cargoes being resold to buyers in Southeast Asia</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Lower demand in China after bumper wheat, corn harvests</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Around 10 wheat cargoes to China delayed or redirected</li></ul></span></div><span><p class=\"\">    China has delayed imports of up to 600,000 metric tons of mostly Australian wheat and offered some of these cargoes to other buyers as ample domestic supplies reduce demand in the world's top buyer of the grain, two trade sources with direct knowledge of the matter said. </p><p class=\"\">China accounted for 6% of global wheat imports in the year to June 2024, according to U.S. Department of Agriculture data. With its outsized role in the market, the country's lower intake may pressure benchmark Chicago wheat prices, which remain below $6 a bushel after falling to a four-year low of $5.14 in July. </p><p class=\"\">The country is well-stocked after plentiful corn and wheat harvests and to support local prices that have fallen as a result it does not want new wheat to arrive until as late as April, the sources said. </p><p class=\"\">One of the sources, a Singapore-based trader at an international company that sells U.S. and Australian wheat into Asia, said he had direct knowledge of four shipments carrying around 240,000 metric tons, three from Australia and one from Canada, that Chinese buyers were trying to resell in Southeast Asia.</p><p class=\"\">The trader said he had heard from other traders that around 10 ships in total from Australia and Canada were being delayed  resold, each carrying around 60,000 tons of wheat.</p><p class=\"\">\"China has postponed the delivery time of several wheat cargoes that were to be shipped from Australia and Canada,\" he said. </p><p class=\"\">    \"There are ample supplies in the Chinese market and their local prices have fallen.\"  </p><p class=\"\">A source at a major grain trader in Australia said he had direct knowledge of two wheat shipments booked for delivery to China in February, one of which has been delayed to April. </p><p class=\"\">\"The other is sailing, but the buyer plans to divert a chunk (of the grain onboard) to Thailand.\" </p><p class=\"\">China has delayed or redirected a total of eight to 10 Australian shipments that were booked for delivery in January or February and has booked no shipments for March, he said.</p><p class=\"\">\"China just doesn't want anything showing up until April,\" he said.</p><p class=\"\">Early last year, Chinese wheat importers cancelled or postponed about 1 million metric tons of Australian wheat cargoes as growing world stockpiles dragged down prices.</p><p class=\"\">Still, in the first three months of 2024, China imported 1.7 million tons of wheat from Australia, down from 2.5 million tons in the same period a year earlier, and 923,000 tons from Canada, up from 783,000 tons a year earlier, according to Chinese trade data accessed using Trade Data Monitor.</p><p class=\"\">Australia begins each year with freshly harvested wheat and has been China's main first-quarter supplier in recent years.</p><p class=\"\">China's state-run COFCO, which is the importer of most of these delayed or redirected cargoes, is paying the costs of delaying shipments, including charges to hold back grain, and will take any gain or loss from reselling grain, the source in Australia said.</p><p class=\"\">COFCO did not immediately reply to an email from Reuters requesting comment.   </p><p class=\"\">\"China wants to protect its farmers. After a good corn crop, they have more than enough corn for feed. So now all of a sudden the wheat they were importing for feed and flour has been wound back to just flour,\" the trader in Australia said.</p><p class=\"\">China's state stockpiler Sinograin said on Monday it plans to add new stockpiling sites in northeast China to expand purchases of domestic corn harvested in 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV036:0-china-has-delayed-or-redirected-600-000-tons-of-wheat-imports-sources-say/",
            "pub_date": "2025-02-05 14:23:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000183:0",
            "title": "Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(05:48 GMT) </strong>*Santander Expects to Return EUR10B to Shareholders Through Buybacks from 2025 and 2026<br/><strong class=\"root-Tkn6WL2y\">(05:49 GMT) </strong>*Santander Sees 2025 Rev EUR62B<br/><strong class=\"root-Tkn6WL2y\">(05:49 GMT) </strong>*Santander Targeting Mid-High Single Digit Growth in 2025 Net Fee Income<br/><strong class=\"root-Tkn6WL2y\">(05:50 GMT) </strong>*Santander Targets 2025 Return on Tangible Equity of More Than 17%<br/><strong class=\"root-Tkn6WL2y\">(05:51 GMT) </strong>*Santander Previously Targeted 2025 Return on Tangible Equity of 15%-17%<br/><strong class=\"root-Tkn6WL2y\">(05:52 GMT) </strong>*Santander 4Q Rev EUR16.03B<br/><strong class=\"root-Tkn6WL2y\">(05:52 GMT) </strong>*Santander 4Q Net Pft EUR3.265B<br/><strong class=\"root-Tkn6WL2y\">(05:53 GMT) </strong>*Analysts Saw Santander 4Q Net Profit at EUR2.95B<br/><strong class=\"root-Tkn6WL2y\">(05:53 GMT) </strong>*Analysts Saw Santander 4Q Revenue at EUR15.39B<br/><strong class=\"root-Tkn6WL2y\">(05:53 GMT) </strong>*Santander 4Q Net Interest Income EUR11.99B<br/><strong class=\"root-Tkn6WL2y\">(05:53 GMT) </strong>*Santander 4Q Net Fee Income EUR3.34B<br/><strong class=\"root-Tkn6WL2y\">(05:55 GMT) </strong>*Santander 4Q-End Fully-Loaded CET1 Ratio 12.8%<br/><strong class=\"root-Tkn6WL2y\">(05:58 GMT) </strong>*Santander: Regulatory Authorization for New Buyback Program Has Already Been Obtained<br/><strong class=\"root-Tkn6WL2y\">(05:59 GMT) </strong>*Santander: Buyback to Run From Feb. 6 to June 27<br/><strong class=\"root-Tkn6WL2y\">(06:00 GMT) </strong>*Santander Names Juan Franco as New Global CEO of Getnet Payments Business<br/><strong class=\"root-Tkn6WL2y\">(06:01 GMT) </strong>*Santander: Getnet's Current CEO, Kush Saxena, Has Decided to Resign<br/><strong class=\"root-Tkn6WL2y\">(06:01 GMT) </strong>*Santander: Franco Joins Getnet From Canadian Fintech Company Nuvei<br/><strong class=\"root-Tkn6WL2y\">(06:24 GMT) </strong>Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations</p><p class=\"\">By Adria Calatayud</p><p class=\"\">Banco Santander plans to buy back 10 billion euros ($10.38 billion) of its own stock and reported fourth-quarter results that exceeded expectations both at the top and bottom lines.</p><p class=\"\">The Spanish bank said Wednesday that it expects to return 10 billion euros to shareholders through stock repurchases from its earnings this year and next on top of its dividend. It also raised a key 2025 profitability target but projected broadly stable revenue for the year.</p><p class=\"\">Net profit for the fourth quarter was 3.265 billion euros, up 11% on year, Santander said.</p><p class=\"\">Total income for the quarter rose 10% to 16.03 billion euros, mainly driven by higher net fee income. Net interest income--the difference between what a bank earns on loans and what it pays clients for deposits--came to 11.99 billion euros, up 6.8% on the prior quarter.</p><p class=\"\">Analysts had expected Santander to post a net profit of 2.95 billion euros on revenue of 15.39 billion euros, according to consensus estimates provided by Visible Alpha.</p><p class=\"\">For 2025, Santander expects revenue of about 62 billion euros, mid-high single digit growth in net fee income, lower costs and a return on tangible equity--a key profitability metric for banks--of more than 17%. It had previously targeted a 2025 return on tangible equity of 15% to 17%.</p><p class=\"\">Write to Adria Calatayud at adria.calatayud@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000183:0/",
            "pub_date": "2025-02-05 14:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN5h4bsQ:0",
            "title": "Carnegie Access: Norsk Titanium: All targets confirmed – Q4 operational update review",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new commissioned research report on Norsk Titanium.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/norsk-titanium/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN5h4bsQ:0-carnegie-access-norsk-titanium-all-targets-confirmed-q4-operational-update-review/",
            "pub_date": "2025-02-05 14:24:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr9Mzqpz:0",
            "title": "Lundbeck reached record revenue of DKK 22 billion in 2024 with accelerated growth for strategic brands (+21% CER)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>H. Lundbeck A/S<p class=\"\">Key highlights</p><p class=\"\">Lundbeck’s total revenue grew by +14% CER[1] (+11% DKK) to DKK 22,004 million in 2024, with all regions contributing to growth</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">United States: DKK 11,325 million (+16% CER; +15% DKK)</li><li class=\"listItem-bmN0_SHH\">Europe: DKK 5,146 million (+13% CER; +11% DKK)</li><li class=\"listItem-bmN0_SHH\">International Operations: DKK 5,219 million (+10% CER; +5% DKK)</li></ul><p class=\"\">The revenue of Lundbeck’s strategic brands increased by +21% CER (+20% DKK), reaching DKK 16,462 million, representing 75% of total revenue and with all four products showing double-digit growth rates both CER and reported</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Rexulti®: DKK 5,202 million (+16% CER; +15% DKK)</li><li class=\"listItem-bmN0_SHH\">Brintellix®/Trintellix®: DKK 4,847 million (+14% CER; +12% DKK)</li><li class=\"listItem-bmN0_SHH\">Abilify LAI franchise[2]: DKK 3,504 million (+10% CER; +10% DKK)</li><li class=\"listItem-bmN0_SHH\">Vyepti®: DKK 2,909 million (+72% CER; +71% DKK)</li></ul><p class=\"\">Adjusted EBITDA[3] increased to DKK 6,347 million (+20% CER; +12% DKK) reflecting the strong revenue growth across all strategic brands. Adjusted EBITDA margin (DKK) reached 28.8% equivalent to an increase of 0.4 percentage points benefiting from the revenue growth offset by increased R&amp;D investments in the maturing pipeline. EBITDA decreased to DKK 5,146 million (+7% CER; -1% DKK), impacted by the transaction and integration costs amounting to DKK 420 million of Longboard as well as an impairment loss of DKK 547 million from one of the MAGLi projects affecting R&amp;D costs, while 2023 included a Vyepti® obsolescence provision.</p><p class=\"\">For 2025, revenue growth is expected to be +7% to +10% at CER when compared to revenue of the prior year. The growth reflects especially the strong contribution from Vyepti, Rexulti in the U.S. and Brintellix in Europe. Lundbeck expects adjusted EBITDA growth to be 5% to 11% at CER when compared to adjusted EBITDA of the prior year, driven by the growth in revenue, partially offset by higher R&amp;D investments. The significant increase in R&amp;D costs driven by the phase III investment for bexicaserin and the further maturing of Lundbeck’s R&amp;D pipeline are fully absorbed by disciplined capital reallocation initiatives.</p><p class=\"\">In line with our dividend policy, it is proposed to pay-out a dividend of DKK 0.95 per share or DKK 946 million which is an increase of +36% compared to 2023.</p><p class=\"\">Lundbeck’s President and CEO, Charl van Zyl said:</p><p class=\"\">“<!-- -->I am very pleased to present a strong performance for 2024, with record revenue driven by accelerated growth in all strategic brands and with a strong outlook into 2025. Combined with disciplined capital reallocation, the growth in strategic brands is fueling additional investments in our pipeline, where we now expect to have four projects in phase III by 2026, including the potential best-in-class asset, bexicaserin, acquired through the completion of the Longboard transaction during the fourth quarter of 2024. We are strongly positioned to continue executing on our Focused Innovator strategy and delivering long-term growth”.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key figures</strong></p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>DKK million</td><td>FY 2024</td><td>FY 2023</td><td>Change(CER)1</td><td>Change(DKK)</td><td>Q4 2024</td><td>Q4 2023</td><td>Change(CER)1</td><td>Change(DKK)</td></tr><tr><td>Revenue</td><td>22,004</td><td>19,912</td><td>14%</td><td>11%</td><td>5,541</td><td>4,978</td><td>16%</td><td>11%</td></tr><tr><td>EBITDA</td><td>5,146</td><td>5,207</td><td>7%</td><td>(1%)</td><td>651</td><td>744</td><td>12%</td><td>(13%)</td></tr><tr><td>Adjusted EBITDA</td><td>6,347</td><td>5,652</td><td>20%</td><td>12%</td><td>1,151</td><td>793</td><td>75%</td><td>45%</td></tr><tr><td>EPS (DKK)</td><td>3.17</td><td>2.31</td><td></td><td>37%</td><td>0.60</td><td>0.14</td><td></td><td>329%</td></tr><tr><td>Adjusted EPS (DKK)</td><td>5.31</td><td>4.22</td><td></td><td>26%</td><td>1.36</td><td>0.58</td><td></td><td>134%</td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">Recent events</strong></p><p class=\"\">On 30 January 2025, Lundbeck announced positive results from the 12-month open-label extension of the Phase 1b/2a <em>PACIFIC</em> trial, evaluating bexicaserin in participants aged 12-65 with Developmental and Epileptic Encephalopathies (DEEs). Bexicaserin achieved an overall median seizure reduction of 59.3 percent in countable motor seizures over a 12-month open-label extension (OLE) treatment period. The treatment with bexicaserin demonstrated favorable safety and tolerability, with majority of participants completing the full 12-months OLE period.</p><p class=\"\">On 9 January 2025, Lundbeck announced that the U.S. Food and Drug Administration (FDA) plans to host a Psychopharmacologic Drugs Advisory Committee (PDAC) meeting to seek input on issues related to the Supplemental New Drug Application (sNDA) for brexpiprazole in combination with sertraline for the treatment of adults with post-traumatic stress disorder (PTSD). The FDA’s decision to host a PDAC meeting does not reflect a final decision on the approvability. A final date for the meeting has yet to be set by the FDA, but it is currently anticipated to occur during the first half of 2025. This decision means that the FDA anticipates missing the Prescription Drug User Fee Act (PDUFA) target action date of 8 February 2025.</p><p class=\"\">Lundbeck presented scientific data in multiple poster presentations showcasing the potential of bexicaserin in Developmental and Epileptic Encephalopathies (DEEs) at the American Epilepsy Society (AES) Annual Meeting in Los Angeles, U.S. as announced on 5 December 2024.</p><p class=\"\">On 3 December 2024, Lundbeck announced positive results from the <em>RESOLUTION</em> trial. This trial randomized 608 patients with a dual diagnosis of chronic migraine (CM) and medication-overuse headache (MOH) to receive an infusion of either Vyepti 100 mg or placebo. The <em>RESOLUTION</em> trial evaluated the efficacy of Vyepti® versus placebo as add-on to a brief educational intervention for the prevention of migraine.</p><p class=\"\">On 2 December 2024, Lundbeck announced the successful completion of the previously announced transaction to acquire all of the outstanding shares of Longboard Pharmaceuticals, Inc. (Longboard). With the completion of the acquisition, Longboard shares have ceased trading on the NASDAQ Global Market and Longboard is now a wholly owned subsidiary of Lundbeck. The acquisition of Longboard marks a strategic milestone for Lundbeck, enhancing and complementing our Focused Innovator strategy and advancing our goal of building a neuro-rare disease franchise.</p><p class=\"\">On 27 November 2024, Lundbeck announced the advancement of the clinical development of amlenetug (Lu AF82422) for the treatment of Multiple System Atrophy (MSA) with the initiation of <em>MASCOT</em>, a randomized, double-blind, phase III trial. The trial builds on the encouraging results of the <em>AMULET</em> phase II trial showing consistent trend towards amlenetug slowing clinical progression in MSA patients despite the primary endpoint not meeting statistical significance and follows discussions with health authorities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Conference call</strong></p><p class=\"\">Today at 12.00 CET, Lundbeck will be hosting a conference call for the financial community. You can find dial-ins and a link for webcast online at www.lundbeck.com under the Investor section.</p><p class=\"\">​​​​​​​</p><p class=\"\">[1] Change at CER (Constant Exchange Rates) does not include effects from hedging.</p><p class=\"\">[2] Abilify long-acting injectable (LAI) franchise comprises following products: Abilify Maintena®, Abilify Maintena® 960 mg and Abilify Asimtufii®</p><p class=\"\">[3] EBITDA refers to Earnings Before Interest, Taxes, Depreciation and Amortization, including impairment losses. Adjusted EBITDA is defined as EBITDA adjusted by certain items, for details see note 4.1 Adjusted EBITDA.</p><p class=\"\">H. Lundbeck A/S</p><p class=\"\">Ottiliavej 9, 2500 Valby, Denmark</p><p class=\"\">+45 3630 1311</p><p class=\"\">info@lundbeck.com</p><p class=\"\">https://news.cision.com/h--lundbeck-a-s/r/lundbeck-reached-record-revenue-of-dkk-22-billion-in-2024-with-accelerated-growth-for-strategic-bran%2Cc4100725</p><p class=\"\">Corporate Release FY2024 Final</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr9Mzqpz:0-lundbeck-reached-record-revenue-of-dkk-22-billion-in-2024-with-accelerated-growth-for-strategic-brands-21-cer/",
            "pub_date": "2025-02-05 14:24:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW07U:0",
            "title": "Chinese miners gain as gold hits record high amid Sino-US tension",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Chinese gold miners rise as bullion hits record high on safe-haven demand amid Sino-U.S. trade tension</p><p class=\"\">** Zijin Mining  gains as much as 3% to 16.73 yuan, highest since Nov. 11, 2024</p><p class=\"\">** Western Region Gold  jumps 5.3%, Shandong Gold Mining  surges 5.8% and Zhongjin Gold  soars 5.2%</p><p class=\"\">** \"China may be more encouraged to keep buying gold for reserves if the trade war escalates,\" Ilya Spivak, head of global macro at Tastylive, says</p><p class=\"\">** Gold prices hit record high of $2,858.12 per ounce on Wednesday, bolstered by fears of a new trade war between the U.S. and China after Beijing slapped tariffs on U.S. imports in response to new U.S. duties on Chinese goods</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW07U:0-chinese-miners-gain-as-gold-hits-record-high-amid-sino-us-tension/",
            "pub_date": "2025-02-05 14:25:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0ME:0",
            "title": "Betolar Targets Positive Cash Flow From Operating Activities By End Of 2026",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Betolar Oyj :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BETOLAR UPDATES ITS FINANCIAL TARGETS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACHIEVING POSITIVE CASH FLOW FROM OPERATING ACTIVITIES BY END OF 2026</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">TARGET: ACHIEVING POSITIVE CASH FLOW FROM OPERATING ACTIVITIES BY END OF 2026</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0ME:0-betolar-targets-positive-cash-flow-from-operating-activities-by-end-of-2026/",
            "pub_date": "2025-02-05 14:15:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX3jPD03:0",
            "title": "AppSecure Security Partners with Jazzee AI to Bolster US Market Expansion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SINGAPORE, Feb.  05, 2025  (GLOBE NEWSWIRE) — In a strategic move to strengthen its presence in the US market, AppSecure Security, a global offensive Pentest and Red teaming company, has announced a partnership with Jazzee AI, an innovative SaaS and Cloud app marketplace. This collaboration aims to boost AppSecure's customer acquisition in the United States while complementing Jazzee's security offerings.</p><p class=\"\">Securing the Future of SaaS with Offensive Security Expertise</p><p class=\"\">AppSecure Security, renowned for its hacker-focused Pentesting and Red Teaming services, has earned a reputation for identifying and mitigating critical vulnerabilities in APIs and applications. With a clientele of over 300 global enterprises and startups, AppSecure, is a trusted partner in safeguarding digital ecosystems.</p><p class=\"\">Sandeep Hodkasia, Founder of AppSecure Security, shared his enthusiasm: \"Partnering with Jazzee AI allows us to combine our offensive security expertise with Jazzee’s AI-driven innovation. Together, we’re not just enhancing cybersecurity; we’re enabling businesses to securely harness the power of the best SaaS tools available.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Agentic AI: Revolutionizing the Buying Experience</strong></p><p class=\"\">At the heart of this partnership is Jazzee AI’s extensive use of Agentic AI. Jazzee’s revolutionary AI capabilities are encapsulated in its \"mother agent,\" a sophisticated chatbot that consolidates powerful tools such as the Buyer Assist Agent, Price Discovery Agent and Contract Analyzer Agent. This AI powerhouse empowers consumers to:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Identify the best product fit tailored to their needs.</li><li class=\"listItem-bmN0_SHH\">Optimize budgets with intelligent negotiation guidance.</li><li class=\"listItem-bmN0_SHH\">Access genuine, crowd-sourced reviews from real users across the internet.</li></ul><p class=\"\">Rajat Dhariwal, Chief AI Officer and Co-founder of Jazzee, explained the vision: \"Jazzee AI is redefining how businesses and consumers navigate the SaaS and Cloud app landscape. Our mother agent doesn’t just assist—it transforms decision-making, ensuring enterprise customers find the right tools, negotiate the best deals, and make informed, confident choices.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Driving Growth in a Booming Market</strong></p><p class=\"\">The global application security market is expected to grow from USD 9.95 billion in 2023 to USD 25.30 billion by 2030, with a CAGR of 14.3%. This partnership positions both companies to capitalize on this surge, addressing the growing sophistication of cyber threats and the increasing demand for AI-driven solutions. Jazzee’s platform, powered by Agentic AI, ensures clients can trust the SaaS solutions they choose while benefiting from robust cybersecurity measures provided by AppSecure.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Transformative Synergy for US Enterprises</strong></p><p class=\"\">AppSecure's approach to security, which involves simulating real-world attack scenarios on APIs and applications, complements Jazzee's AI-powered SaaS curation and optimization services. This synergy is expected to provide US enterprises with a comprehensive solution that not only secures their digital assets but also ensures they are utilizing the promising and trusted SaaS tools available.</p><p class=\"\">As both companies look to expand their footprint in the US market, this partnership represents a significant step towards creating a more secure and efficient digital ecosystem for businesses. With the combined strengths of AppSecure's offensive security expertise and Jazzee's AI-driven marketplace, US enterprises can look forward to a new era of cybersecurity and SaaS optimization.</p><p class=\"\">About Appsecure.security</p><p class=\"\">AppSecure Security is a CREST-accredited offensive cybersecurity company that provides comprehensive security solutions to protect businesses worldwide. With a team of skilled white hat hackers, including top bug bounty hunters from Fortune 500 companies like PayPal, LinkedIn, and Reddit, AppSecure offers a unique and robust approach to identifying and addressing critical security vulnerabilities.</p><p class=\"\">The company's core philosophy revolves around an offensive security stance, which involves simulating real-world attacks to uncover concealed vulnerabilities from a hacker's perspective. This proactive approach allows organizations to anticipate and prevent sophisticated system attacks before they occur.</p><p class=\"\">AppSecure's services encompass a wide range of security solutions, including:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Web Application Penetration Testing: Utilizing advanced red teaming techniques to identify and address potential weaknesses within web applications.</li><li class=\"listItem-bmN0_SHH\">API Security: Offering comprehensive testing of API endpoints to ensure airtight data flow and protection against common vulnerabilities.</li><li class=\"listItem-bmN0_SHH\">Network Penetration Testing: Conducting thorough assessments to uncover exposed internal pathways and blind spots in network security.</li><li class=\"listItem-bmN0_SHH\">Red Teaming Exercises: Simulating real-world attack scenarios to evaluate an organization's security posture and response capabilities.</li></ul><p class=\"\">The company's methodology aligns with industry standards such as the OWASP Top 10 and the Penetration Testing Execution Standard (PTES). This ensures that their assessments are thorough, accurate, and up-to-date with the latest security threats and best practices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact:</strong></p><p class=\"\">Name: Vrinda</p><p class=\"\">Website: https://appsecure.security</p><p class=\"\">Email: marketing@appsecure.security</p><p class=\"\">Ph.no.: +917018971376</p><p class=\"\">Disclaimer: This content is provided by the AppSecure Security. The statements, views, and opinions expressed in this column are solely those of the content provider. The information shared in this press release is not a solicitation for investment, nor is it intended as investment, financial, or trading advice. It is strongly recommended that you conduct thorough research and consult with a professional financial advisor before making any investment or trading decisions. Please conduct your own research and invest at your own risk.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/9b52f376-8ce2-4634-922e-9b96072f9030</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Appsecure security and Jazzee</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Appsecure Security and Jazzee AI</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX3jPD03:0-appsecure-security-partners-with-jazzee-ai-to-bolster-us-market-expansion/",
            "pub_date": "2025-02-05 14:15:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0EF:0",
            "title": "Semiconductor firm Melexis forecasts lower sales and margins for Q1",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Melexis , Belgium's largest semiconductor supplier, said on Wednesday that it expected lower margins and sales for the first quarter of 2025, compared with a year earlier.</p><p class=\"\">The company expects its operating margin to reach 16% in the first three months of the year, down from the 26.4% it posted in the same quarter in 2024.</p><p class=\"\">It also sees lower sales in a range of 190 million to 200 million euros ($197.1 million to $207.5 million), versus 228.6 million euros in the prior year.</p><p class=\"\">($1 = 0.9639 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0EF:0-semiconductor-firm-melexis-forecasts-lower-sales-and-margins-for-q1/",
            "pub_date": "2025-02-05 14:16:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463773:0",
            "title": "Valneva Obtains UK Approval for Chikungunya Vaccine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Valneva  received marketing authorization from the UK's Medicines and Healthcare products Regulatory Agency for its chikungunya vaccine, IXCHIQ. </p><p class=\"\">The approval covers the use of the single-use vaccine on people aged at least 18 years. The French specialty vaccine company said the decision was based on the results of a phase 3 trial, according to a Thursday release. </p><p class=\"\">In addition to the UK, the vaccine is approved in the US, Europe and Canada. Brazil is expected to issue marketing approval for IXCHIQ within the first quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463773:0/",
            "pub_date": "2025-02-05 14:17:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN7xgQy:0",
            "title": "The Board of Directors of Stillfront has resolved to exercise its authorisation to acquire own shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Board of Directors of Stillfront AB (publ) (“Stillfront”) has resolved, pursuant to the authorisation granted by the Annual General Meeting held on 14 May 2024, to acquire own shares on Nasdaq Stockholm. The purpose of the repurchase is to enable payment with Stillfront’s own shares of certain future earn-out payments relating to acquisitions.</p><p class=\"\">The repurchase programme is subject to the following terms and conditions:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Acquisitions shall be effected on Nasdaq Stockholm in accordance with the Nordic Main Market Rulebook for Issuers of Shares.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may be made on one or several occasions from 6 February 2025 up until the 2025 Annual General Meeting. No acquisitions will be made during 30 days before the publication of Stillfront’s interim financial or year-end reports.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may be made up to a total amount of SEK 50 million. Stillfront’s holding of own shares may, however, not at any time exceed one-tenth of all shares in Stillfront.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may only be effected at a price within the registered price interval on Nasdaq Stockholm at any given time, which refers to the interval between the highest purchase price and the lowest selling price.</li><li class=\"listItem-bmN0_SHH\">Acquisitions may also be made by way of block trades in accordance with applicable rules.</li><li class=\"listItem-bmN0_SHH\">Payment of acquired shares shall be made in cash.</li></ul><p class=\"\">The repurchases will be administered by Carnegie Investment Bank AB (publ), that will act in accordance with instructions from Stillfront.</p><p class=\"\">The purpose of the repurchase programme is to enable payment with Stillfront’s own shares in certain future earn-out considerations relating to acquisitions. Assuming no material changes in the historical trading volumes in Stillfront’s shares and/or current market conditions, the board of directors’ intention is that Stillfront shall complete the repurchase programme prior to the closed period that commences 30 days prior to the release of Stillfront’s interim report for the period January – March 2025.</p><p class=\"\">The total number of shares in Stillfront is 517,968,480. At the time of this press release, Stillfront holds 15,699,698 own shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN7xgQy:0-the-board-of-directors-of-stillfront-has-resolved-to-exercise-its-authorisation-to-acquire-own-shares/",
            "pub_date": "2025-02-05 14:18:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463769:0",
            "title": "Amak Resumes Operations at Copper, Zinc Concentrate Plants Following Maintenance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Almasane Alkobra Mining (SASE:1322), d/b/a Amak, restarted operations at its copper and zinc concentrate processing plants on Tuesday after scheduled periodic maintenance. </p><p class=\"\">The Saudi miner said Wednesday the Al Masane and the Moyeath mine processing plants were shut down for five weeks for maintenance work, which is expected to boost their efficiency and reliability.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463769:0/",
            "pub_date": "2025-02-05 14:18:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000624:0",
            "title": "Gold Hits String of Record Highs in Tension-Fueled Bullish Rally — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gold is mounting a notable bullish rally, fueled by market uncertainty, says Ahmad Assiri, research strategist at Pepperstone. Trade tensions following the U.S.'s imposition of a 10% tariff on Chinese imports, and delayed but looming tariffs on Canadian and Mexican products, have fueled a shift toward safe haven assets, he writes in a note. Although the USD index initially strengthened earlier in the week, posing a headwind for gold, its retracement helped revive buying interest in the precious metal. From a technical perspective, gold is testing resistance that could trigger some profit-taking but the broader trend remains supported by hedging activities amid an uncertainty, Assiri adds. He sees scope for new record peaks if the risk landscape persists. Gold has hit a series of record highs in recent days and was last around $2,857/oz. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000624:0/",
            "pub_date": "2025-02-05 14:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463767:0",
            "title": "Equinor Posts Lower FY24 Attributable Net Income, Revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equinor  said Wednesday net income and revenue for 2024 fell year over year. </p><p class=\"\">Net income attributable to equity holders for the 12 months ended Dec. 31, 2024, was $8.81 billion, compared with $11.89 billion earlier. EPS moved to $3.11 from $3.93. </p><p class=\"\">The oil and gas giant's revenue was $102.50 billion, compared with $106.85 billion a year ago. </p><p class=\"\">Meanwhile, the board proposed a dividend of $0.37 per share for the fourth quarter of 2024, payable May 28 to shareholders on record May 16. It paid $0.35 per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463767:0/",
            "pub_date": "2025-02-05 14:19:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr6HhbLn:0",
            "title": "UPM updates its Disclosure Policy and changes its method of issuing profit guidance and outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>UPM-Kymmene Oyj<p class=\"\">UPM-Kymmene Corporation Stock Exchange Release (Other information disclosed according to the rules of the Exchange)              5 February 2025 at 08:20 EET</p><p class=\"\">UPM updates its Disclosure Policy and changes its method of issuing profit guidance and outlook</p><p class=\"\">The Board of Directors of UPM-Kymmene Corporation has today approved the updated Disclosure Policy for UPM. According to the renewed Disclosure Policy, UPM may present a numerical assessment of the development of profitability and earnings for a selected time period (profit guidance) in its financial statements release, half-year report and quarterly reports. In addition, UPM may issue a verbal description of the events and circumstances effecting the profit guidance (outlook). The updated Disclosure Policy will enter into force immediately and will be available at UPM's website at www.upm.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UPM, Media Relations</strong></p><p class=\"\">Mon-Fri 9:00-16:00 EET</p><p class=\"\">tel. +358 40 588 3284</p><p class=\"\">media@upm.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UPM</strong></p><p class=\"\">We deliver renewable and responsible solutions and innovate for a future beyond fossils across six business areas: UPM Fibres, UPM Energy, UPM Raflatac, UPM Specialty Papers, UPM Communication Papers and UPM Plywood. As the industry leader in responsibility, we are committed to the UN Business Ambition for 1.5°C and the science-based targets to mitigate climate change. We employ 16,600 people worldwide and our annual sales are approximately EUR 10.5 billion. Our shares are listed on Nasdaq Helsinki Ltd. UPM Biofore - Beyond fossils. www.upm.com</p><p class=\"\">Follow UPM on X | LinkedIn | Facebook | YouTube | Instagram | #UPM #biofore #beyondfossils</p><p class=\"\">https://news.cision.com/upm-kymmene-oyj/r/upm-updates-its-disclosure-policy-and-changes-its-method-of-issuing-profit-guidance-and-outlook%2Cc4100718</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr6HhbLn:0-upm-updates-its-disclosure-policy-and-changes-its-method-of-issuing-profit-guidance-and-outlook/",
            "pub_date": "2025-02-05 14:20:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463771:0",
            "title": "Maggie Beer Holdings To Restructure Operations After Strategic Review",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Maggie Beer Holdings  said it will restructure and simplify its operations as a result of a strategic review, according to a Wednesday Australian bourse filing. </p><p class=\"\">In line with the restructuring, each of the e-commerce and Maggie Beer products businesses will be operated as a profit center with a divisional head to help focus and drive the strategic objectives of each business unit, the filing said. </p><p class=\"\">Joint Interim Group Chief Operating Officer and Chief Financial Officer Penny Diamantakiou is set to leave the company to explore career opportunities and the roles will be discontinued, per the filing. </p><p class=\"\">The firm's chairperson Sue Thomas said the board held that the cost of business was too high and new structure would allow it to focus on costs, core products, and customers, while being reflective</p><p class=\"\">of its current market capitalization. </p><p class=\"\">The firm added that the sale of Paris Creek Farms is progressing. </p><p class=\"\">The firm's current group finance managers will jointly lead the finance team.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463771:0/",
            "pub_date": "2025-02-05 14:20:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463774:0",
            "title": "Saudi Awwal Bank Ups H2 2024 Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The board of Saudi Awwal Bank (SASE:1060) will pay a cash dividend of 1 Saudi riyal per share for the second half of 2024. </p><p class=\"\">The Saudi Arabian lender will disclose the dividend's eligibility and distribution dates at a later date, according to a Wednesday release. It paid 0.98 riyal per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463774:0/",
            "pub_date": "2025-02-05 14:20:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000584:0",
            "title": "Gold Demand Rose to Fresh High in 2024, Report Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Hoppe</p><p class=\"\">Gold demand hit a new record in 2024 driven by central banks and investors, according to a new report.</p><p class=\"\">Total gold demand rose 1% on-year to an all-time high of 4,974.5 metric tons, the World Gold Council said Wednesday in a new report on gold-demand trends. The value of that demand soared to a record $382 billion, driven by record-high prices on geopolitical and economic uncertainty and investors seeking out safe-haven assets.</p><p class=\"\">Gold demand was a record $111 billion in the fourth quarter. The healthy demand has persisted into the new year, helping continuous gold future prices hit a fresh record in late European trading on Tuesday of $2,877.10 a troy ounce. New York Mercantile Exchange gold futures are up around 8.9% in the year to date.</p><p class=\"\">\"Geopolitical uncertainty remains very high and that's always going to be a supportive element for investment--whether it's shifting from concerns of military conflict to uncertainties around trade conflicts,\" said Louise Street, senior markets analyst at the WGC.</p><p class=\"\">Central-bank demand--and emerging-market-bank demand in particular--was the greatest driver behind the increase, with buying exceeding 1,000 metric tons of the precious metal for the third year in a row. On an annual basis, central-bank demand declined 1%, but purchases rocketed 54% on-year in the fourth quarter, to 332.9 tons.</p><p class=\"\">Poland's central bank led purchases, adding 90 tons to its reserves, and central-bank demand is expected to stay high going into the new year, Street said.</p><p class=\"\">\"Geopolitical and economic uncertainty remains high in 2025 and it seems as likely as ever that central banks will once again turn to gold as a stable strategic asset,\" the report said.</p><p class=\"\">Gold investment also drove up demand, rising 25% on-year, to a four year high of 1,180 tons. Gold ETFs marked their first year since 2020 to avoid sizeable outflows, and in the fourth quarter, global gold-backed ETFs posted a second consecutive quarter of inflows--primarily driven by China and India in particular, Street said.</p><p class=\"\">Investment in gold was concentrated in the second half of the year as falling interest rates, geopolitical uncertainty and gold's continued strong price performance attracted inflows. Asian-listed funds led the charge, adding 78 tons of holdings over the year. North American funds added just 8 tons--though this was the first annual increase since 2020--while European funds saw outflows, albeit at a lower level on-year.</p><p class=\"\">Looking ahead, tailwinds for gold ETFs, over-the-counter purchases and futures-based investment are likely given expectations for lower global interest rates, high-valued equities, a weaker U.S. dollar and geopolitical risks through trade conflicts, the WGC said.</p><p class=\"\">On the other hand, gold demand for jewelry has fallen on year, driven by higher prices. Weakness was seen in every major region, with global demand falling 11%, driven by China and--to a lesser extent--India. Stripping out a coronavirus-pandemic-driven slump in 2020, gold-jewelry demand fell to its lowest level since 2009, the WGC said.</p><p class=\"\">\"If the gold price remains at current or higher levels, it could further erode jewelry demand, particularly as growth is also weak or slowing in all four major gold regions,\" the WGC said.</p><p class=\"\">Elsewhere, technology demand also rose 7%, to 326 tons, mostly driven by strong demand in AI-related applications and some recovery in the consumer-electronic markets.</p><p class=\"\">Write to Joe Hoppe at joseph.hoppe@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000584:0-gold-demand-rose-to-fresh-high-in-2024-report-says/",
            "pub_date": "2025-02-05 14:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463764:0",
            "title": "Agility Global Issues EUR76 Million Guarantees for DSV Hedge",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Agility Global (ADX:AGILITY) issued 75.6 million euros in corporate guarantees to secure hedging deals with banks for some of its DSV  shares. </p><p class=\"\">The Abu Dhabi-listed investment and assets management company said Wednesday the guarantees are part of a hedging optimization and do not change the number of hedged shares or require additional funding.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463764:0/",
            "pub_date": "2025-02-05 14:14:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1F2:0",
            "title": "Melexis Expects Q1 Sales At 190 To 200 Million EUR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Melexis NV :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK: EXPECTS SALES IN THE FIRST QUARTER OF 2025 TO BE IN THE RANGE OF 190 TO 200 MILLION EUR</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK: EXPECTS Q1 A GROSS PROFIT MARGIN AROUND 40% AND AN OPERATING MARGIN AROUND 16%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FOR THE FULL YEAR 2025, EXPECTS CAPEX TO BE AROUND 50 MILLION EUR</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SALES IN THE SECOND HALF OF 2025 ARE EXPECTED TO GROW SIGNIFICANTLY COMPARED TO THE FIRST HALF OF 2025</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q424 SALES EUR 197.4 MILLION -21% YOY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q424 EBIT EUR 27.6 MILLION -55% YOY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q424 NET RESULT EUR 18.3 MILLION -63% YOY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1F2:0-melexis-expects-q1-sales-at-190-to-200-million-eur/",
            "pub_date": "2025-02-05 14:14:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000587_20250205000587:0",
            "title": "Strong launch for Cresemba in Japan triggers first sales milestone payment from AKP to Basilea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000587_20250205000587:0/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX3h9JBj:0",
            "title": "Strong launch for Cresemba in Japan triggers first sales milestone payment from AKP to Basilea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Allschwil, Switzerland, February 05, 2025</strong></p><p class=\"\">Basilea Pharmaceutica Ltd, Allschwil , a commercial-stage biopharmaceutical company committed to meeting the needs of patients with severe bacterial and fungal infections, reported today that the sales of the antifungal Cresemba® (isavuconazole) in Japan exceeded the threshold triggering the first sales milestone payment from its partner Asahi Kasei Pharma (AKP), amounting to approximately CHF 1.2 million. </p><p class=\"\">David Veitch, Chief Executive Officer of Basilea, said: “Japan is a key market with significant growth potential for Cresemba. The achievement of the first sales milestone already in the second year of commercialization is a testament of the commercial capability of our partner AKP in this important market. The strong sales ramp-up in the early stage of its life cycle in Japan underscores that Cresemba is meeting critical medical needs of patients with life-threatening fungal infections.”</p><p class=\"\">By year-end 2024, Cresemba was marketed in more than 70 countries. According to the latest available market data, total global in-market sales of Cresemba in the twelve-month period between October 2023 and September 2024 amounted to USD 533 million, a 20 percent growth year-on-year, making it the largest branded antifungal for invasive fungal infections worldwide.1</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cresemba</strong><strong class=\"root-Tkn6WL2y\">®</strong> <strong class=\"root-Tkn6WL2y\">(isavuconazole)</strong></p><p class=\"\">Isavuconazole is an intravenous (i.v.) and oral azole antifungal, commercialized under the trade name Cresemba. In Japan, the oral and intravenous formulations are approved for the treatment of adult patients with aspergillosis, mucormycosis, and cryptococcosis.2 Isavuconazole is also approved in the United States (US),3 China, the EU4 and several additional countries in Europe and beyond.5</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Basilea</strong></p><p class=\"\">Basilea is a commercial-stage biopharmaceutical company founded in 2000 and headquartered in Switzerland. We are committed to discovering, developing and commercializing innovative drugs to meet the needs of patients with severe bacterial and fungal infections. We have successfully launched two hospital brands, Cresemba for the treatment of invasive fungal infections and Zevtera for the treatment of bacterial infections. In addition, we have preclinical and clinical anti-infective assets in our portfolio. Basilea is listed on the SIX Swiss Exchange . Please visit basilea.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disclaimer</strong></p><p class=\"\">This communication expressly or implicitly contains certain forward-looking statements, such as \"believe\", \"assume\", \"expect\", \"forecast\", \"project\", \"may\", \"could\", \"might\", \"will\" or similar expressions concerning Basilea Pharmaceutica Ltd, Allschwil and its business, including with respect to the progress, timing and completion of research, development and clinical studies for product candidates. Such statements involve certain known and unknown risks, uncertainties and other factors, which could cause the actual results, financial condition, performance or achievements of Basilea Pharmaceutica Ltd, Allschwil to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Basilea Pharmaceutica Ltd, Allschwil is providing this communication as of this date and does not undertake to update any forward-looking statements contained herein as a result of new information, future events or otherwise.</p><p class=\"\">For further information, please contact:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\">  Peer Nils Schröder, PhD    Head of Corporate Communications &amp; Investor RelationsBasilea Pharmaceutica International Ltd, Allschwil Hegenheimermattweg 167b4123 AllschwilSwitzerland                  </td></tr><tr><td>  Phone  </td><td>  +41 61 606 1102  </td></tr><tr><td>  E-mail  </td><td>  media_relations@basilea.cominvestor_relations@basilea.com      </td></tr></tbody></table></div><p class=\"\">This press release can be downloaded from www.basilea.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">References</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">IQVIA Analytics Link, September 2024. In-market sales reported as moving annual total (MAT) in US dollar.</li><li class=\"listItem-bmN0_SHH\">PMDA List of Approved Drugs April 2022 to March 2023: https://www.pmda.go.jp/files/000267877.pdf [Accessed: February 04, 2025]</li><li class=\"listItem-bmN0_SHH\">Full US prescribing information: https://www.astellas.us/docs/cresemba.pdf [Accessed: February 04, 2025]</li><li class=\"listItem-bmN0_SHH\">European Public Assessment Report (EPAR): https://www.ema.europa.eu/en/medicines/human/EPAR/cresemba [Accessed: February 04, 2025]</li><li class=\"listItem-bmN0_SHH\">The registration status and approved indications may vary from country to country.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Press release (PDF)</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX3h9JBj:0-strong-launch-for-cresemba-in-japan-triggers-first-sales-milestone-payment-from-akp-to-basilea/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000596:0",
            "title": "News Highlights: Top Global Markets News of the Day - Wednesday at 1 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Recover Despite China Tariff Fears</strong></p><p class=\"\">A call between Trump and Xi Jinping hasn't happened Tuesday, but might come Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Eggs Are Through the Roof. What's Up With Food Prices?</strong></p><p class=\"\">Bird flu is making eggs costly, and looming tariffs could cause price hikes in certain items like avocados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How U.S. Agriculture Market Is Approaching Tariffs and a Potential Trade War</strong></p><p class=\"\">Traders and farmers hope that the Trump administration is using tariff threats as leverage in trade negotiations, as opposed to following through with a major disruption to agricultural trade.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Keeps Hitting Record Highs. Here's Why-and Which Stocks Could Benefit.</strong></p><p class=\"\">The yellow metal is trading just below $2,900 an ounce. Miner stocks are rallying too. Geopolitical turmoil is boosting gold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000596:0-news-highlights-top-global-markets-news-of-the-day-wednesday-at-1-am-et/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000595:0",
            "title": "News Highlights: Top Company News of the Day - Wednesday at 1 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Toyota Raises Earnings Guidance After Profit Jumps</strong></p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda's Merger Terms, Putting Deal in Peril</strong></p><p class=\"\">The Japanese automakers had announced a plan to combine in December.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Earnings Must Show GLP-1 Market Still Set for Big Growth</strong></p><p class=\"\">Novo's Wegovy and Ozempic are among the most closely watched new medications in recent history, but face serious competition from Eli Lilly's Zepbound and Mounjaro.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Australia Bans DeepSeek From Government Devices</strong></p><p class=\"\">Australia directed all government entities to prevent the use of DeepSeek products, applications and web services on government systems and mobile devices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LG CNS Makes Weak Debut in South Korea After IPO</strong></p><p class=\"\">The information-technology services affiliate of conglomerate LG Group raised around $826 million in South Korea's biggest listing in three years.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Match Group Replaces CEO as Growth Eludes Dating Apps</strong></p><p class=\"\">The owner of Tinder, Hinge and OkCupid apps said CEO Bernard Kim would step down and be succeeded by board member Spencer Rascoff, a co-founder and former CEO of home-listings portal Zillow Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000595:0-news-highlights-top-company-news-of-the-day-wednesday-at-1-am-et/",
            "pub_date": "2025-02-05 14:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Obi0NrJca:0",
            "title": "NOD: Share Buyback Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Board of Directors of Nordic Semiconductor ASA has in a board meeting heldon February 4, 2025, authorized the Company to commence a share repurchaseprogram.</p><p class=\"\">The share repurchase program will be carried out in accordance with applicablelaws and regulations.</p><p class=\"\">The purpose of the program is to have available shares to settle the company'sobligations under the Employee long-term equity linked incentive programs. Keyterms of the share repurchase program include:</p><p class=\"\">* The maximum number of shares that the Company may purchase under the programis up to 9.96% of the outstanding shares, however limited to a total purchaseofNOK 240 million.</p><p class=\"\">* In accordance with the authorization from the AGM, the maximum price thatcanbe paid per share is NOK 350.</p><p class=\"\">* The share repurchase program period runs from February 5, 2025, and ends onthe latest on the Annual General Meeting in 2025.</p><p class=\"\">* No shares may be bought at a price higher than the greater of the sharepriceof the latest independent trade or the highest current independent offer priceat Oslo Børs at the time of the trade.</p><p class=\"\">* The maximum number of shares in the Company which may be purchased on eachtrading day corresponds to maximum 20% of the average daily trading volume ofthe Company for that day.</p><p class=\"\">Transactions will be conducted in accordance with the Market Abuse Regulation(EU) No 596/2014 (\"MAR\") and Commission Delegated Regulation (EU) No 2016/1052(\"Safe Harbour Regulation\") as further set out i.a. in the NorwegianSecuritiesTrading Act of 2007 and the Oslo Stock Exchange's Guidelines for buy-backprograms and price stabilization dated February 2021.</p><p class=\"\">For questions: Pål Elstad, Chief Financial Officer Mobile: (+47) 99 166 293</p><p class=\"\">This information is subject to the disclosure requirements pursuant to Section5-12 of the Norwegian Securities Trading Act and the Market Abuse Regulation.</p><p class=\"\">This stock exchange announcement was published by Kine-Elena Reigstad, VPInternational Finance, on February 5, 2025 at 07.15 CET.</p><p class=\"\">https://newsweb.oslobors.no/message/637721</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Obi0NrJca:0-nod-share-buyback-program/",
            "pub_date": "2025-02-05 14:15:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN1NDcqd:0",
            "title": "Carnegie Access: Björn Borg: Set to grow at double-digits in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new commissioned research report on Björn Borg.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/bjornborg/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN1NDcqd:0-carnegie-access-bj-rn-borg-set-to-grow-at-double-digits-in-2024/",
            "pub_date": "2025-02-05 14:15:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}