{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463664:0",
            "title": "Yokogawa Electric's Nine-Month Profit Falls 26%; Shares Down 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Yokogawa Electric  reported a 25.7% year-on-year decline in profits, reaching 38.7 billion yen in the fiscal nine months ended Dec. 31, 2024, from 52.1 billion yen a year earlier due to the absence of the previous year's extraordinary income from selling investment securities. </p><p class=\"\">Basic earnings per share fell to 148.74 yen from 197.81 yen a year ago, according to a Tokyo Stock Exchange filing on Tuesday. </p><p class=\"\">Net sales increased 4.0% to 408.9 billion yen from 393.1 billion yen a year earlier. </p><p class=\"\">The company projected attributable profit to fall 17.3% to 51 billion yen, with net sales expected to increase 4.2% to 563 billion yen. </p><p class=\"\">Yokogawa Electric expects to pay a final dividend of 29 yen per share for the fiscal year ending March 31. </p><p class=\"\">Shares of Yokogawa Electric lost nearly 6% recently.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463664:0/",
            "pub_date": "2025-02-05 11:42:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014528_20250204014528:0",
            "title": "India's Sensex Opens 0.2% Higher at 78704.60, Led by Tech Stocks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014528_20250204014528:0/",
            "pub_date": "2025-02-05 11:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463665:0",
            "title": "Hong Kong Sees Marginal Improvements in Private Sector But Expectations Remain Downbeat, S&P Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong's private sector recorded continued but marginal improvement in its business conditions in January, despite business expectations staying downbeat, according to a Wednesday press release by S&amp;P. </p><p class=\"\">The S&amp;P Global Hong Kong SAR Purchasing Manager's Index slipped to 51.0 in January from 51.1 in December 2024, staying in expansionary territory but at the lowest since September 2024. </p><p class=\"\">New orders grew but at the softest pace since the 18-month peak last seen in October due to weak consumer spending and a slump in business, according to S&amp;P. </p><p class=\"\">New business from mainland China fell the greatest since April 2022 while exports slipped for the third month, the debt watcher said. </p><p class=\"\">Employment in Hong Kong's private sector increased the second time in the past nine months due to higher recruitment in the services and wholesale/retail sectors, S&amp;P said. </p><p class=\"\">Purchasing activity expansion was the slowest during the month, while supplier performance fell for the sixth straight month due to shipping delays and insufficient spare capacity, and input price inflation was the highest in three months. </p><p class=\"\">Business expectations also stayed downbeat, but confidence continues to rise from the 13-month low seen in November, S&amp;P said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463665:0/",
            "pub_date": "2025-02-05 11:43:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446661:0",
            "title": "New Zealand Dollar Extends Gains",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The New Zealand dollar rose to around $0.566 on Wednesday, extending gains from the previous session, as the US dollar weakened amid tariff tensions.</p><p class=\"\">A 10% US tariff on Chinese goods took effect on Tuesday, prompting Beijing to announce retaliatory tariffs on selected US products.</p><p class=\"\">While a meeting between US President Donald Trump and Chinese President Xi Jinping remains uncertain, such discussions are seen as pivotal for potentially easing or delaying tariffs, like how last-minute talks resulted in one-month reprieves on levies against Canada and Mexico.</p><p class=\"\">Domestically, the Kiwi shrugged off weak labor market data, which reinforced expectations of a 50bps rate cut by the Reserve Bank of New Zealand later this month.</p><p class=\"\">The country’s unemployment rate rose to 5.1% in Q4, the highest since Q3 2020, underscoring the extent of the economic slowdown.</p><p class=\"\">Additionally, weaker-than-expected services activity data from China, New Zealand’s largest trading partner, weighed on the currency.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446661:0-new-zealand-dollar-extends-gains/",
            "pub_date": "2025-02-05 11:43:58",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463669:0",
            "title": "Hillgrove Resources Increases Production From South Australia Copper-Gold Mine; Shares Rise 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hillgrove Resources  increased copper production in January from the Kanmantoo copper-gold mine in South Australia, according to an Australian bourse filing on Wednesday. </p><p class=\"\">The company reported copper production of 903 tonnes in January, compared with a monthly average production of 879 tonnes in the December 2024 quarter. </p><p class=\"\">It processed 99,000 tonnes of ore in the month, compared with a monthly average of 110,000 tonnes in the December 2024 quarter. However, it mined 115,000 tonnes of ore in January, compared with 104,000 tonnes on average each month in the December 2024 quarter. </p><p class=\"\">The firm's shares rose almost 8% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463669:0/",
            "pub_date": "2025-02-05 11:45:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW05F:0",
            "title": "Shares of China tungsten producers rally on Beijing's latest export curbs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Shares of major Chinese tungsten producers rallied on Wednesday as markets reacted to Beijing's latest critical mineral export controls on the first day of trading after the week-long Lunar New Year holiday.</p><p class=\"\">Soon after fresh U.S. tariffs on Chinese goods took effect on Tuesday, China said it would restrict exports of five critical minerals — tungsten, indium, bismuth, tellurium, and molybdenum — used in defence, clean energy and other industries to \"safeguard national security interests.\"</p><p class=\"\">Xiamen Tungsten , China Tungsten and High-tech Materials  and Chongyi Zhangyuan Tungsten  climbed over 3%,while CMOC  jumped by over 1% as of 0206 GMT.</p><p class=\"\">In past cases where China has imposed export curbs on other critical minerals, as in August 2023, prices jumped to the signal the metals newfound importance. Some Chinese exporters will also be able to take advantage of the expected rally in prices overseas once they secure export licenses.</p><p class=\"\">Tungsten is an ultra-hard metal, in terms of strength outdone only by diamonds, and is primarily used in the production of goods including artillery shells, armour plating and cutting tools.</p><p class=\"\">China produced over 80% of global tungsten supply in 2023, according to data from the United States Geological Survey (USGS).</p><p class=\"\">While tungsten resources exist outside China, analysts and traders say certain specialised tungsten products used by the aerospace and defence industries have few non-Chinese alternatives. </p><p class=\"\">        \"The export controls on APT and tungsten carbide could be the worst affected as there are few alternatives for tungsten in aerospace and defence applications,\" said Sian Morris, non-ferrous metals analyst at information provider Argus. APT is a compound used in production of various tungsten products.</p><p class=\"\">\"Russia was previously a major supplier of tungsten products, but China has grown its share of the global tungsten market since the start of Russia's war in Ukraine.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW05F:0-shares-of-china-tungsten-producers-rally-on-beijing-s-latest-export-curbs/",
            "pub_date": "2025-02-05 11:35:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014514:0",
            "title": "Inari Amertron Likely to Face Earnings Pressure — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Inari Amertron's FY 2025-FY 2026 earnings my be pressured by weaker radio frequency revenue as handset sales slow down, CGS International analysts Shafiq Kadir and Dharmini Thuraisingam say in a note. Margin dilution from new packaging ventures could add pressure on earnings, they write, as CGS cuts its forecast for Inari's FY 2025-FY 2026 EPS by 19%-20%. However, margins may recover by FY 2026-FY 2027 with new businesses scaling up production, they add. CGS International lowers Inari's target price to MYR2.60 from MYR2.90, while maintaining a hold rating, citing near-term risks from a subdued automotive market and policy uncertainties under the Trump administration. Shares are 0.4% lower at MYR2.44. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014514:0/",
            "pub_date": "2025-02-05 11:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463666:0",
            "title": "RBNZ on Track to Cut Rate by 50 Basis Points in February in Wake of Q4 2024 Labor Data, Says ANZ Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand's latest unemployment data cement the projected 50-basis-point cut at the Reserve Bank's (RBNZ) upcoming meeting on Feb. 19, as the labor market heads towards stabilization in the first half, ANZ Research said in a Wednesday note. </p><p class=\"\">The unemployment rate rose to 5.1% in the fourth quarter of 2024, in line with expectations, from 4.8% in the prior three-month period. </p><p class=\"\">\"The underlying details of the release highlight that the labor market is operating with a large degree of excess capacity, and measures of wage growth remain on a path to levels consistent with inflation near the RBNZ's 2% target midpoint,\" ANZ Research wrote. </p><p class=\"\">Analysts at ANZ Research continue to expect a 25-basis-point cut in April.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463666:0/",
            "pub_date": "2025-02-05 11:37:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014515:0",
            "title": "Philippines Higher-Than-Expected January Inflation Supports Rate Cut — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Philippines' higher-than-expected January inflation print has cleared the way for a rate cut from the BSP next week, Barclays economist Shreya Sodhani says in a note. Although headline CPI rose 2.9% on year, it remained at the midpoint of BSP's 2.5%-3.3% forecast range, she writes. Inflation was driven by food prices, which usually rise in January, she says. The latest inflation print and slower-than-expected 4Q GDP growth suggest that a rate cut is the most likely outcome, she adds. However, there are risks that the BSP could delay rate cuts, as officials have suggested that the central bank may ease only once in 1H and another time in 2H, she says. Barclays continues to expect three rate cuts this year. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014515:0/",
            "pub_date": "2025-02-05 11:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0CP:0",
            "title": "Vietnam govt says January CPI up 3.63% y/y",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vietnam's consumer price index rose 3.63% in January from a year earlier while industrial production rose a modest 0.6% due to the Lunar New Year holidays late in the month, the government said on Wednesday.</p><p class=\"\">The figures were published on the government's portal one day before the statistics office was due to release January data for a range of macroeconomic indicators.</p><p class=\"\">Retails sales rose 9.5% in January from a year earlier, the government said in a statement. </p><p class=\"\">It said the trade surplus for January came in at $1.23 billion. </p><p class=\"\">The government said foreign investment inflows rose 2% in January from a year earlier to more than $1.5 billion, and foreign investment pledges rose an annual 48.6% to $4.3 billion. </p><p class=\"\">\"The banking system operated safely and stably\", it said. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0CP:0-vietnam-govt-says-january-cpi-up-3-63-y-y/",
            "pub_date": "2025-02-05 11:38:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014520:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0339 GMT - The Bank of Korea may cut its policy rate later this month despite January's pickup in domestic inflation, Barclays economist Bum Ki Son writes in a note. Headline inflation accelerated to 2.2% from 1.9% in December, but the BOK may focus on soft core inflation and weak domestic demand, Son says. Core inflation, which strips out volatile food and energy prices, ticked up to 1.9% from 1.8% in December. BOK policymakers see forex-related pressures as limited and oil prices as a one-off shock, he notes. \"As such, we believe inflation is unlikely to stop the BOK from cutting rates 25bp at its February meeting,\" he says. (kwanwoo.jun@wsj.com)</p><p class=\"\">0338 GMT - The Philippines' higher-than-expected January inflation print has cleared the way for a rate cut from the BSP next week, Barclays economist Shreya Sodhani says in a note. Although headline CPI rose 2.9% on year, it remained at the midpoint of BSP's 2.5%-3.3% forecast range, she writes. Inflation was driven by food prices, which usually rise in January, she says. The latest inflation print and slower-than-expected 4Q GDP growth suggest that a rate cut is the most likely outcome, she adds. However, there are risks that the BSP could delay rate cuts, as officials have suggested that the central bank may ease only once in 1H and another time in 2H, she says. Barclays continues to expect three rate cuts this year. (amanda.lee@wsj.com)</p><p class=\"\">0323 GMT - China's target measures unveiled on Tuesday leave room for potential talks with the U.S., say two economists at BofA Global Research in a research report. \"These announcements mark a measured and comprehensive retaliation that seeks to target U.S. business interests, while minimizing the impact on China's economy,\" the economists say. China seems to be carefully targeting energy products which the country has the potential to purchase more of, they say. \"In potential negotiations in the future, reaching a deal where China pledges to buy more oil and gas from the U.S. may be more desirable than China reducing such imports on higher tariffs,\" the economists add. (ronnie.harui@wsj.com)</p><p class=\"\">0314 GMT - The U.S. Treasury 10-year yield still faces downside risk, based on daily charts, says Quek Ser Leang of UOB's Global Economics &amp; Markets Research in a research report. There's a possibility the 10-year yield will fall into the daily Ichimoku cloud, which is currently between 4.318% and 4.447%, the markets strategist says. Going forward, a break of the 10-year yield below the bottom of the daily Ichimoku cloud might potentially trigger sharp declines, the strategist says. On the other hand, if the 10-year yield rises above 4.690%, this would suggest that the 10-year yield is likely to trade in a range, the strategist adds. Treasury 10-year yield is steady at 4.5167%. (ronnie.harui@wsj.com)</p><p class=\"\">0257 GMT - Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0254 GMT - The future path of the U.S.-China trade conflict remains highly uncertain, say Goldman Sachs analysts in a note. China's retaliatory tariffs appear much less than proportional compared to the U.S.'s 10% across-the-board additional tariff on $525 billion worth of Chinese goods, they write. However, the combination of retaliatory tariffs with export bans, entity list additions, and antitrust probe into Google, suggests a \"more coordinated and comprehensive approach by [Chinese] policymakers\" than during the 2018-2019 U.S.-China trade war, they say. In the coming days, the U.S.'s reactions to China's retaliation will be among key events to watch, they add. (amanda.lee@wsj.com)</p><p class=\"\">0230 GMT - Unemployment in New Zealand is still rising despite rapid interest-rate cuts since mid-2024, leaving consumers and business owners still searching to see the light of an economic recovery. Mark Smith, senior economist at ASB Bank expects demand for labor will continue to weaken until a modest economic recovery finally shows up in the second half of 2025. Firms will have to carefully manage employee headcount in that time, he adds. With inflation close to the target midpoint and monetary settings still slowing the economy, further swift monetary easing looks appropriate to limit economic and labor market scarring, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0225 GMT - Japan's services sector is off to a strong start in 2025, the au Jibun Bank PMI compiled by S&amp;P Global suggests. January data point to a solid upturn in business activity across the sector, accompanied by a steeper, solid rise in new business inflows. The survey signaled a sharp jump in average prices charged by service providers, while exports rose for the first time in four months. Firms are upbeat on their prospects over the coming 12 months and have boosted staffing levels, says Usamah Bhatti, economist at S&amp;P Global Market Intelligence. Services continue to underpin growth in Japan's private sector, contrasting the weakness in manufacturing. Still, companies are confident that private-sector activity will rise over 2025, expecting a rebound in manufacturing output and a broad-based economic recovery, Bhatti says. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0226 GMT - The yen strengthens against other G-10 and Asian currencies in the morning session. Japanese data released earlier showed the economy's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases. A solid rise in Japanese labor cash earnings will reinforce the current market pricing in at least one more rate hike by the BOJ this year, CBA's Joseph Capurso says in a note. In addition, with the 'tariff war' between the U.S. and other countries seemingly ongoing, the AUD/JPY is likely to retest support at 94.69, the head of International and Sustainable Economics adds. USD/JPY falls 0.6% to 153.36; AUD/JPY drops 0.7% to 95.88. (ronnie.harui@wsj.com)</p><p class=\"\">0213 GMT - There are reasons to be hopeful that a recovery in New Zealand's economy in the second half of this year will help businesses avoid more cuts to headcount, says Mary Jo Vergara, an economist at Kiwibank. But should the required rate relief not come from the Reserve Bank of New Zealand, the risk of further ​job losses only grows, she says. The RBNZ's current forecasts suggest the OCR will get to 3.5% this year and no lower until deep in 2027. That will leave monetary conditions too restrictive, Vergara says. RBNZ will need to get the OCR down to 3% this year. Holding out longer will only cause unnecessary and indeed avoidable damage to the labor market, she adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0144 GMT - There are no signs yet that aggressive interest rate cuts by the Reserve Bank of New Zealand since mid-2024 are gaining traction and lifting the economy, says Ben Jarman, chief economist at JP Morgan. To be sure, recent GDP revisions show a more worrying economic trajectory, he adds. The data have yet to turn up meaningfully because policy traction is still being blunted by earlier OCR hikes, he adds. This has slowed the lowering of new mortgage rates, and any improvement in disposable incomes, Jarman says. A number of households will still be rolling their mortgages into higher rates than previous, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">0146 GMT - JGBs fall in price terms during the morning Tokyo session. Data released earlier show Japan's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases and adding to the case for another BOJ rate hike. The sharp rise in the BOJ's core CPI inflation forecasts in the January outlook report, together with Gov. Ueda's recent comment that there's \"still a significant distance to the neutral rate of interest,\" has sparked worries over an acceleration of rate hikes and an increase in the terminal rate for this cycle, Mitsubishi UFJ Morgan Stanley Securities' fixed income strategists say in a recent report. The JGB 10-year yield is 1.5 bps higher at 1.290%. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014520:0/",
            "pub_date": "2025-02-05 11:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014518:0",
            "title": "Bank of Korea May Cut Rate This Month Despite Inflation Pickup — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bank of Korea may cut its policy rate later this month despite January's pickup in domestic inflation, Barclays economist Bum Ki Son writes in a note. Headline inflation accelerated to 2.2% from 1.9% in December, but the BOK may focus on soft core inflation and weak domestic demand, Son says. Core inflation, which strips out volatile food and energy prices, ticked up to 1.9% from 1.8% in December. BOK policymakers see forex-related pressures as limited and oil prices as a one-off shock, he notes. \"As such, we believe inflation is unlikely to stop the BOK from cutting rates 25bp at its February meeting,\" he says. (kwanwoo.jun@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014518:0/",
            "pub_date": "2025-02-05 11:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463662:0",
            "title": "Macro Metals Unit Forms Indigenous Joint Venture With Robe River Kuruma Aboriginal Corporation; Shares Up 7%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Macro Metals  unit Macro Mining Services has formed an Indigenous joint venture with Robe River Kuruma Aboriginal Corporation's unit, Robe River Services, the company said in an Australian bourse filing on Wednesday. </p><p class=\"\">Robe River Services holds 51% of the issued share capital of the joint venture named Robe River Kuruma Macro Mining and Macro Mining Services the other 49%, the filing said. </p><p class=\"\">The joint venture will enjoy 'preferred' status in the award of works on mining projects as a local Indigenous contracting business, particularly on Robe River Kuruma Country, the filing added. </p><p class=\"\">Macro Metals shares were up 7% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463662:0/",
            "pub_date": "2025-02-05 11:32:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014510:0",
            "title": "China PMI Gauge Signals Softer Services Sector Growth — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A private gauge of China's service activity expanded at a slower clip in January, pointing in the same direction as official data as both demand and supply cooled at the start of the year.</p><p class=\"\">The Caixin services purchasing managers index fell to 51.0 in January from 52.2 in December, said Caixin Media Co. and S&amp;P Global on Wednesday.</p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\">New business growth eased to a four-month low in January, but export orders returned to growth after falling at the end of 2024, Caixin said.</p><p class=\"\">The sustainability of strong external demand is uncertain amid rising trade tensions between Beijing and Washington. On Tuesday, China announced a series of retaliatory measures in response to President Trump's 10% tariff hike on all Chinese exports to the U.S.</p><p class=\"\">Concerns about how trade uncertainty could hurt demand for services from China was reflected in the Caixin survey data.</p><p class=\"\">While firms expressed hope that business growth plans and government policy can support sales in the next 12 months, confidence levels remained below average amid worries over rising competition and trade risks.</p><p class=\"\">\"Rising uncertainty on the international stage could worsen China's export environment, posing significant challenges for its economy,\" said Wang Zhe, senior economist at Caixin Insight Group.</p><p class=\"\">With the economy also dealing with weak demand and sluggish consumer spending, \"macroeconomic policies must be well-prepared and adjusted promptly to adapt to evolving circumstances,\" Wang said.</p><p class=\"\">The Caixin services PMI subindex of employment tumbled to its lowest since April 2024, falling for a second consecutive month as companies continued to cut headcount and increase efficiency.</p><p class=\"\">The lower headline Caixin reading was in line with the official gauge, which dropped to 50.3 in January from 52.0 in December as business operations were disrupted by the Lunar New Year holiday.</p><p class=\"\">Softer services activity countered quicker manufacturing output growth to push the Caixin composite index down in January, with the pace of expansion decelerating to the lowest in four months and employment recording the fastest fall in 26 months.</p><p class=\"\">\"The Caixin services and composite PMIs released today add to growing evidence that China's economy lost momentum last month,\" said Zichun Huang, an economist at Capital Economics.</p><p class=\"\">Focus now turns to travel and spending data for the just-concluded Lunar New Year holiday, which will shed light into consumer appetite in China. The figures, potentially due Wednesday, come as the government recently expanded trade-in programs to encourage more spending on home appliances, electronic devices and cars this year.</p><p class=\"\">According to the latest numbers from the China Film Administration, box office revenue reached 9.51 billion yuan, or about $1.32 billion, during the holiday as more than 187 million moviegoers went to the cinemas, both at historic highs.</p><p class=\"\">Write to Singapore editors at singaporeeditors@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014510:0/",
            "pub_date": "2025-02-05 11:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463663:0",
            "title": "LG Electronics to Showcase New Products at ISE 2025 in Barcelona",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LG Electronics  will showcase digital signage products at the Integrated Systems Europe (ISE) 2025 in Barcelona this week. </p><p class=\"\">The products include an AI-powered kinetic LED display, upgraded LG MAGNIT micro LEDs, and high-brightness outdoor signage featuring anti-discoloration technology, LG Electronics said Tuesday. </p><p class=\"\">The exhibition will also present LG's advanced retail kiosks, fire-safe digital signages, and the LG CreateBoard lineup for education and corporate sectors, along with the LG Business Cloud platform for display management. </p><p class=\"\">Shares of LG Electronics rose more than 2% in recent trade on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463663:0/",
            "pub_date": "2025-02-05 11:33:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3NS042:0",
            "title": "Marubeni CEO: Will Continue To Increase Our Offshore Wind Assets Prudently",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marubeni Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">MARUBENI CEO:  ADVISED OFFSHORE WIND POWER TEAM TO DEVELOP CALMLY AND AVOID EXCESSIVE COMPETITION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MARUBENI CEO:  TRUMP ADMINISTRATION'S POLICIES WILL LIKELY ENABLE US TO CAPITALIZE ON GROWTH POTENTIAL OF OUR BUSINESSES TARGETING U.S. DOMESTIC DEMAND</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MARUBENI CEO:  WE ARE VERY INTERESTED IN THE U.S. SHALE GAS AND OTHER RESOURCE BUSINESSES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MARUBENI CEO:  ENTERING ENERGY DEVELOPMENT PROJECT FROM SCRATCH IS CHALLENGING DUE TO HIGH RISKS INVOLVED</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MARUBENI CEO:  WILL CONTINUE TO INCREASE OUR OFFSHORE WIND ASSETS PRUDENTLY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3NS042:0-marubeni-ceo-will-continue-to-increase-our-offshore-wind-assets-prudently/",
            "pub_date": "2025-02-05 11:33:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW025:0",
            "title": "Gold rises to all-time high on Sino-US tariff war",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits all-time high at $2,853.97</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Next major inflection point is probably $3,000 - analyst</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump says he is no hurry to speak to Chinese President</li></ul></span></div><span><p class=\"\">    Gold prices hit a record high on Wednesday, bolstered by fears of a new trade war between the United States and China after Beijing slapped tariffs on U.S. imports in a response to new U.S. duties on Chinese goods.</p><p class=\"\">Spot gold  was up 0.2% at $2,848.69 per ounce, as of 0253 GMT, after hitting a record high of $2,853.97 earlier in the session. U.S. gold futures  gained 0.2% to $2,879.70.</p><p class=\"\">U.S. President Donald Trump said on Tuesday he is in no hurry to speak to Chinese President Xi Jinping to try to defuse the trade tensions between the world's two largest economies.</p><p class=\"\">China imposed targeted tariffs on U.S. imports on Tuesday and put several companies, including Google, on notice for possible sanctions, in a measured response to Trump's tariffs.</p><p class=\"\">\"The next major inflection point for gold is probably the $3,000 figure... China may be more encouraged to keep buying gold for reserves if the trade war escalates,\" said Ilya Spivak, head of global macro at Tastylive.</p><p class=\"\">Meanwhile, the Trump administration's plans for trade tariffs come with inflation risks, three Federal Reserve officials warned on Monday, with one arguing that uncertainty over the price outlook calls for slower interest rate cuts than otherwise.</p><p class=\"\">While gold is considered an inflation hedge, higher interest rates could dampen its appeal among investors.</p><p class=\"\">Key economic data on investors' radar this week includes the ADP employment report due at 1315 GMT and the payrolls report on Friday, which could shed more light on the health of the U.S. economy.</p><p class=\"\">\"Gold demand ought to be partially supportive for other precious metals but their sensitivity to risk appetite has seen them underperform,\" said Spivak.</p><p class=\"\">Spot silver  rose 0.2% to $32.15 per ounce, platinum  edged 0.3% higher to $966.95, and palladium  fell 0.9% to $981.75. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW025:0-gold-rises-to-all-time-high-on-sino-us-tariff-war/",
            "pub_date": "2025-02-05 11:33:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014511:0",
            "title": "Nissan to Reject Honda's Merger Terms, Putting Deal in Peril — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sean McLain and Megumi Fujikawa</p><p class=\"\">Nissan's board is planning to reject Honda's terms for a combination of the two automakers, putting in danger a merger plan announced less than two months ago, people familiar with the matter said Wednesday.</p><p class=\"\">Nissan's board was scheduled to meet later Wednesday, and the people cautioned that no final decision to kill the deal has been made.</p><p class=\"\">The two Japanese automakers said on Dec. 23 that they planned to combine under a structure in which Honda and Nissan would both be subsidiaries of a single holding company.</p><p class=\"\">In recent days, Honda presented a new proposal that would have made Nissan a subsidiary of Honda instead of the more equal structure originally planned, according to a person familiar with the negotiations. The person said Nissan found the new proposal unacceptable and planned to reject it.</p><p class=\"\">The person said Nissan and Honda would continue other cooperation that predates the merger talks, including collaboration on software and electric vehicles.</p><p class=\"\">If the plan to combine with Honda falls apart, it would raise pressure on Nissan to reassure lenders, employees and customers that it can survive amid stiff competition in the U.S. and China. Nissan has lost ground in both markets.</p><p class=\"\">Nissan said in November that it would lay off 9,000 workers and slash its factory capacity by one-fifth to cut costs.</p><p class=\"\">Write to Sean McLain at sean.mclain@wsj.com and Megumi Fujikawa at megumi.fujikawa@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014511:0/",
            "pub_date": "2025-02-05 11:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014511_20250204014511:0",
            "title": "Nissan Plans to Reject Honda's Terms for Combination, Sources Say — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014511_20250204014511:0/",
            "pub_date": "2025-02-05 11:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014511_20250204014512:0",
            "title": "Nissan Board to Meet Wednesday to Discuss Honda Merger Plan, Sources Say — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014511_20250204014512:0/",
            "pub_date": "2025-02-05 11:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW08O:0",
            "title": "Iron ore falters on Sino-US tariff war concerns, sluggish China growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Iron ore futures declined on Wednesday amid worries of heightened trade tensions between the U.S. and top consumer China, while slowing Chinese growth dampened market sentiment.</p><p class=\"\">The most-traded May iron ore contract on China's Dalian Commodity Exchange (DCE)  eased 0.62% to 804 yuan ($110.37) a metric ton as of 0316 GMT.</p><p class=\"\">The benchmark March iron ore (SZZFH5) on the Singapore Exchange declined 0.85% to $104.15 a ton.</p><p class=\"\">\"Sentiment is likely to suffer as Chinese markets reopen and react to the barrage of tariffs on commodities,\" ANZ analysts said.</p><p class=\"\">U.S. President Donald Trump's additional 10% tariff on all Chinese imports kicked in on Tuesday.</p><p class=\"\">China responded with tariffs on U.S. imports in a rapid response to the new U.S. duties, renewing a trade war between the world's top two economies.</p><p class=\"\">\"Steelmaking raw materials will also be in focus... Chinese iron ore markets are likely to come under pressure amid concerns of weaker export driven demand,\" ANZ added.</p><p class=\"\">Beijing's new measures include a 15% levy on U.S. coal, a key steelmaking ingredient.</p><p class=\"\">Meanwhile, China's services activity expanded at a slower pace in January, though business sentiment improved, a private sector business survey showed.</p><p class=\"\">The country's factory activity growth similarly slowed, a separate survey showed.</p><p class=\"\">On the supply side, Rio Tinto ,  said on Tuesday it had begun clearing iron ore ships from two Western Australian ports as two tropical cyclones offshore complicate its efforts to repair infrastructure damaged by a cyclone last month.</p><p class=\"\">In January, Rio warned that its first-quarter shipments could be affected by disruptions to rail operations following record rainfall.</p><p class=\"\">Other steelmaking ingredients on the DCE lost ground, with coking coal <!-- -->NYMEX:ACT1!<!-- --> and coke (DCJcv1) losing 2.42% and 3.35%, respectively.</p><p class=\"\">Most steel benchmarks on the Shanghai Futures Exchange fell. Rebar  slid 1.36%, hot-rolled coil  declined 1.7%, wire rod (SWRcv1) dipped 0.84%, while stainless steel  gained nearly 1%.</p><p class=\"\">($1 = 7.2844 Chinese yuan)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW08O:0-iron-ore-falters-on-sino-us-tariff-war-concerns-sluggish-china-growth/",
            "pub_date": "2025-02-05 11:35:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014487_20250204014487:0",
            "title": "Pro Medicus Target Price Raised 8.9% to A$310.00/Share by Goldman Sachs>PME.AU",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014487_20250204014487:0/",
            "pub_date": "2025-02-05 11:26:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW02K:0",
            "title": "China's markets return from holiday to US trade war, DeepSeek rally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Mainland markets return to tariffs after week-long break</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">HK-listed Chinese shares have surged this week</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Firm yuan fixing shows Beijing's resolve to minimise volatility</li></ul></span></div><span><p class=\"\">    China's stocks and currency came under pressure as markets returning from a week-long break were greeted by a fresh trade dispute with the United States and ructions in the global artificial intelligence sector.</p><p class=\"\">Tariffs so far have been less than what the Trump administration had initially indicated and relief was evident in Hong Kong, where Chinese stocks rallied this week.</p><p class=\"\">Meanwhile, enthusiasm around China's artificial intelligence company DeepSeek bolstered AI stocks.</p><p class=\"\">While investors were taking money off the table, declines have so far been limited with both the bluechip CSI300 (.CSI) and the Shanghai Composite Indexes  slipping roughly 0.2%. Investors are now mostly focused on what Beijing might do to bolster confidence.</p><p class=\"\">Kaiyuan Securities analyst Wei Jixing said President Donald Trump's 10% tariffs on Chinese goods had largely been priced in.</p><p class=\"\">\"China's market will likely overlook the tariff disruptions, as DeepSeek is repairing risk appetite, while investors look forward to more proactive domestic policies,\" Wei said, referring to the new low-cost Chinese AI model that stunned markets last week.</p><p class=\"\">China's central bank on Wednesday set the yuan midpoint  at 7.1693 per dollar, the strongest level since Nov. 8, 2024, which investors read as a sign of Beijing's reluctance to immediately resort to currency depreciation in response to U.S. tariffs.</p><p class=\"\">Yuan weakness helped blunt the impact of tariffs in U.S. Trump's first term as president, and the fix is widely followed for clues to China's negotiating stance on tariffs.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:799.2895204262877px;aspect-ratio:1.3321492007104796\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW02K-2186c634d6d65c12b7251a4d0f4ccfbc-resized.webp\" type=\"images/webp\"/><img alt=\"China markets in 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW02K-2186c634d6d65c12b7251a4d0f4ccfbc-resized.jpeg\" style=\"background-color:#ececeb\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China markets in 2025</span></figcaption></figure></span></p><p class=\"\">Mainland stock markets ,  took their cue from Hong Kong, which opened two days earlier. Chinese stocks there rose strongly on Tuesday, despite a move by the Trump administration to impose 10% tariffs on Chinese imports.</p><p class=\"\">Much has happened during China's week-long Lunar New Year holiday. Over the weekend, Trump imposed levies on goods from China, a move that prompted Beijing to announce targeted tariffs on U.S. imports and put several companies, including Google, on notice for possible sanctions. </p><p class=\"\">Trump's actions, which also included duties on Mexico and Canada, jolted global markets. The tariffs came as the world of artificial intelligence — another major driver for global stocks over the past year — was roiled when China’s DeepSeek unveiled a cheaper AI model just a day before China went on break. That triggered a selloff across technology stocks as investors reassessed the sector's value.</p><p class=\"\">Even so, there was some relief for markets, as the initial tranche of tariffs on China was lower than what Trump has threatened in the past. And the president also gave reprieve to two other trading partners – Canada and Mexico – leading investors to believe that China could strike a deal as well. </p><p class=\"\">Trump and Chinese leader Xi Jinping are expected to speak soon, although the timing of the conversation is not clear.   </p><p class=\"\">\"Any sign that Xi and Trump have a 'good talk' or both countries expressed commitment to work on a deal should qualify as a temporary truce and be supportive of sentiments,\" said Christopher Wong, a currency strategist at OCBC Bank. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:542.4657534246576px;aspect-ratio:0.904109589041096\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW02K-f54affadaa82f22afcf04110560c7e6d-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to Sept. 15, 2024) and the exchange rate of USD/CNY during the trade war between Sept. 15, 2024 and Feb. 4, 2025.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW02K-f54affadaa82f22afcf04110560c7e6d-resized.jpeg\" style=\"background-color:#f8f7f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets as trade frictions rise in 2025</span></figcaption></figure></span></p><p class=\"\">Expectations Beijing will do more to support its economy in the face of U.S. tariffs, relief that the tariffs were lower than what Trump had initially threatened and bullishness on the AI and electric vehicle sectors drove gains in Hong Kong.</p><p class=\"\">Chinese companies listed in Hong Kong  rallied more than 4% this week to a three-month high, and tech heavyweights  rallied nearly 7%. On Wednesday, the Hang Seng Index  lost 1.2% in early trade, likely on profit-taking.</p><p class=\"\">Both the offshore and onshore yuan weakened too. The offshore yuan  has shed 0.6% against the dollar since Jan 27, when mainland markets closed for the holiday, and hit a lifetime low this week. </p><p class=\"\">Investors will see any attempts by China to weaken the currency as a hint Beijing expects a protracted war and is using the yuan to counter the effect of tariffs, as it did during Trump's first term in 2018.</p><p class=\"\">\"On the whole, having a trade war is not what the market wants... but investors are less likely to panic this time,\" said Elizabeth Kwik, investment director of Asian equities at abrdn, referring to how markets had been positioning for trade tensions for months.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:550px;aspect-ratio:0.9166666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW02K-a07d774660d5652f1ffb5e51b7709949-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to March 1, 2018) and the exchange rate of USD/CNY during the trade war between March 2018 and June 2019.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW02K-a07d774660d5652f1ffb5e51b7709949-resized.jpeg\" style=\"background-color:#f4f6f8\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets during 2018 trade war</span></figcaption></figure></span></p><p class=\"\">Artificial intelligence-related stocks jumped on the mainland as they played catch-up to stocks in Hong Kong, riding on bullishness on local technology firms spurred by DeepSeek.</p><p class=\"\">An index tracking Chinese AI stocks surged 3%, while shares of robot makers (.CSIH30590) rose nearly 4%. China's tech-heavy STAR 50 Index (.STAR50) gained 3%.     </p><p class=\"\">China's benchmark blue chip index fell 3% in January as investors fretted over the increasingly volatile macro outlook and Beijing's tepid policy response.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW02K:0-china-s-markets-return-from-holiday-to-us-trade-war-deepseek-rally/",
            "pub_date": "2025-02-05 11:26:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463661:0",
            "title": "Market Chatter: China's Box Office Sales Jump 18% in Lunar New Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's box office sales jumped 18% year on year to 9.48 billion yuan during the Lunar New Year holiday period, Bloomberg News reported Wednesday, citing data from ticketing website Maoyan. </p><p class=\"\">Box office sales in the same period a year ago was 8.02 billion yuan, the media outlet said. </p><p class=\"\">Imax China also beat its previous record in the previous year, as sales climbed 57% in dollar terms to $53 million, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463661:0/",
            "pub_date": "2025-02-05 11:27:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0CJ:0",
            "title": "Australian coal miners gain after China imposes tariffs on US coal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Australian coal miners help prop up the domestic mining sub-index </p><p class=\"\">** China, top consumer of coal, hit back at the U.S. with retaliatory tariffs, which includes a 15% levy on U.S. coal </p><p class=\"\">** Coal duty is expected to increase the commodity's price</p><p class=\"\">** Shares of Whitehaven Coal , Australia's largest independent coal miner, rise 2.9% to A$6.275, jumping the most since Jan. 14</p><p class=\"\">** Stanmore Resources  jumps 2.4% to A$2.765, most since Jan. 14, while Coronado Global Resources  is up 3.4%</p><p class=\"\">** Aussie mining index  is up 1.8%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0CJ:0-australian-coal-miners-gain-after-china-imposes-tariffs-on-us-coal/",
            "pub_date": "2025-02-05 11:27:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:9aae0d667094b:0",
            "title": " Ripple says XRP Ledger back online after hourlong network halt ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ripple’s XRP Ledger has recovered from a network halt that prevented validations from being published for over an hour, Ripple’s chief technology officer confirmed.</p><p class=\"\">Network activity froze at block height 93927174 for 64 minutes before the blockchain was rebooted on Feb. 4 at 10:58 am UTC, XRPL’s explorer page shows.</p><p class=\"\">“It looked like consensus was running but validations were not being published, causing the network to drift apart,” Ripple technology chief David Schwartz said in a Feb. 4 X post.</p><p class=\"\">He added validator operators had to manually intervene to “choose a sane starting point” to build enough consensus to pull the network over to a coordinated ledger stream. Schwartz said that his observations were only preliminary and that Ripple was still investigating the root cause.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:738.6454183266932px;aspect-ratio:1.2310756972111554\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:9aae0d667094b-fda88dae0e9bb84842d6f286af66665a-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:9aae0d667094b-fda88dae0e9bb84842d6f286af66665a-resized.jpeg\" style=\"background-color:#eaebeb\"/></picture></div></figure></span></p><p class=\"\">Schwartz noted that very few Unique Node List validators were forced to make changes to reboot the network, “so it’s possible the network spontaneously recovered.”</p><p class=\"\">RippleX’s X account noted that customer funds remained safe throughout the incident.</p><div class=\"container-n2KCMK3i\" data-name=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">David \"JoelKatz\" Schwartz</div><div class=\"username-n2KCMK3i\">@JoelKatz</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\">pic.twitter.com/mHHR7i4Xrx</p></div><span class=\"date-n2KCMK3i\">Feb 04, 2025</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/JoelKatz/status/1886906597928263686\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\">Around 2 million transactions are executed from anywhere between 30,000 to 60,000 unique senders each day, XRPSCAN data shows.</p><p class=\"\">Consequently, around 88,000 transactions may have been delayed as a result of the network halt.</p><p class=\"\">The network halt sparked chatter about Ripple’s centralized setup after Daniel Keller, chief technology officer of XRPL node operator Eminence, pointed out that “all 35 nodes” were back validating transactions.</p><p class=\"\">XRP Ledger’s centralization concerns have been a common source of criticism given competitor blockchains like Ethereum continue to decentralize with more than 1 million daily active validators securing that network.</p><p class=\"\">XRP  hit a 24-hour low of $2.45 at the time of XRP Ledger’s network halt but has since rebounded 3.2% to $2.53 at the time of publication, CoinGecko data shows.</p><p class=\"\">The token has been one of the industry’s best performers since Donald Trump won the US election, increasing 396% since Nov. 5.</p><p class=\"\">XRP Ledger’s network halt comes as Ripple CEO Brad Garlinghouse is pushing for XRP to be included as a US reserve asset, which Trump’s crypto czar David Sacks will explore.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:9aae0d667094b:0-ripple-says-xrp-ledger-back-online-after-hourlong-network-halt/",
            "pub_date": "2025-02-05 11:27:52",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463654:0",
            "title": "RichTech Digital's IPO Gets Oversubscribed By 245.42 Times",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RichTech Digital received 24,237 applications for 2.49 billion shares worth 623.6 million ringgit from the Malaysian public, resulting in an oversubscription rate of 245.42 times. </p><p class=\"\">The electronic reloads distributor and bill payment service provider said 10.1 million shares made available for application by the Malaysian public have been oversubscribed. </p><p class=\"\">For the Bumiputera portion, the company received 12,601 applications for 1.06 billion shares, showing an oversubscription rate of 208.57 times. </p><p class=\"\">For the public portion, 11,636 applications for 1.43 billion shares were received, translating into an oversubscription rate of 282.28 times. </p><p class=\"\">Meanwhile, 1.6 million shares made available for application by the eligible persons have also been fully subscribed. </p><p class=\"\">Moreover, the placement agent confirmed that the 43 million new shares and 25.3 million existing shares issued via private placement to selected investors were fully subscribed.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463654:0/",
            "pub_date": "2025-02-05 11:27:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463660:0",
            "title": "SAIC Motor Sees 8% Rise in January Vehicle Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SAIC Motor  posted a 7.9% rise in vehicle sales to 264,166 units in January from 244,916 units the previous year. </p><p class=\"\">Production rose 33% year over year to 325,356 units from 243,883 units, according to a Wednesday filing with the Shanghai bourse.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463660:0/",
            "pub_date": "2025-02-05 11:28:21",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014488:0",
            "title": "Pro Medicus Bulls Lift Forecasts on Contract Wins — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pro Medicus's bulls at Goldman Sachs lift their earnings forecasts for the next two full fiscal years following the Australian imaging-tech provider's latest contract wins. The GS analysts make no change to their forecast of 38% earnings growth in the current 2025 fiscal year, but lift expectations by 2% for fiscal 2026 and by 4% for fiscal 2027. They tell clients in a note that they don't anticipate any guidance to be provided with the company's first-half result announcement, but do expect positive commentary on the strength of its contract pipeline. GS lifts its target price by 8.9% to A$310.00 and keeps a buy rating on the stock. Shares are up 1.25% at A$287.48. (stuart.condie@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014488:0/",
            "pub_date": "2025-02-05 11:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Obih3j9ha:0",
            "title": "Pembroke Olive Downs Pty Ltd - Pricing of USD550 million bond issue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pembroke Olive Downs Pty Ltd (ACN 611 674 376) (\"Pembroke\") has todaysuccessfully priced USD 550 million of senior secured bonds in the Nordic bondmarket. The bonds will mature in February 2030 and bear interest of 11.5% perannum. The bond issue attracted significant interest from credit investorsglobally.</p><p class=\"\">The company intends to use the proceeds from the bond issue towards i) therefinancing of existing debt and ii) general corporate purposes, including thefunding of the Olive Downs Expansion.</p><p class=\"\">The outstanding bond with ticker PEMBR01 and ISIN NO0011173536, with a nominalamount of approximately USD 90.5 million, will be redeemed at the current callprice of 105% of par.</p><p class=\"\">An application will be made for the bonds to be listed on the Oslo AlternativeBond Market.</p><p class=\"\">Clarksons Securities AS acted as manager in connection with the bond issue.</p><p class=\"\">https://newsweb.oslobors.no/message/637706</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Obih3j9ha:0-pembroke-olive-downs-pty-ltd-pricing-of-usd550-million-bond-issue/",
            "pub_date": "2025-02-05 11:29:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}