{
    "data": [
        {
            "id": "DJN_DN20260227008930:0",
            "title": "Caris Life Sciences Climbs After Swing to 4Q Profit, Revenue Tops Expectations",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Amira McKee</span></p><p class=\"\"><span>Shares of Caris Life Sciences rose after the biotechnology company swung to a profit and tripled revenue in the fourth quarter.</span></p><p class=\"\"><span>The stock climbed 5.6%, to $20.32, in Friday afternoon trading. The shares have tumbled about 25% so far this year.</span></p><p class=\"\"><span>The company recorded a fourth-quarter net income of $82 million, or 28 cents a share, compared with a loss of $36.9 million, or $1.73 a share, a year earlier.</span></p><p class=\"\"><span>The results topped Wall Street's forecast for earnings of 12 cents a share, according to FactSet.</span></p><p class=\"\"><span>Revenue more than doubled, to $292.9 million, beating the $240.4 million that analysts polled by FactSet were expecting.</span></p><p class=\"\"><span>The top-line gains were driven by molecular-profiling-services revenue, which nearly tripled, to $282.1 million, on higher total clinical-case volume and pricing improvements across therapy-selection solutions.</span></p><p class=\"\"><span>For 2026, the Irving, Texas, company expects revenue in the range of $1 billion to $1.02 billion, representing growth of about 23% to 26% compared with the prior year. Wall Street is modeling for full-year revenue of $1.01 billion, according to FactSet.</span></p><p class=\"\"><span>Write to Amira McKee at amira.mckee@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008930:0/",
            "pub_date": "2026-02-28 02:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008948:0",
            "title": "Viridian Therapeutics Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:24 GMT) </span></strong><span>Viridian Therapeutics Price Target Cut to $42.00/Share From $45.00 by RBC Capital</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008948:0/",
            "pub_date": "2026-02-28 02:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN14L:0",
            "title": "US drillers cut oil and gas rigs for first time in six weeks, says Baker Hughes",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Scott DiSavino</span></p><p class=\"\"><span>    U.S. energy firms this week cut the number of oil and natural gas rigs operating for the first time in six weeks, energy services firm Baker Hughes </span><span> said in its closely followed report on Friday.</span></p><p class=\"\"><span>The oil and gas rig count, an early indicator of future output, fell by one to 550 in the week to February 27, the lowest since late January. (BHGUSWTT), (BHGUSOILDRLW), (BHGUSGASDRLW)</span></p><p class=\"\"><span>        Baker Hughes said this week's decline puts the total rig count down 43 rigs, or 7% below this time last year. </span></p><p class=\"\"><span>Baker Hughes said oil rigs fell by two to 407 this week, their lowest since December, while gas rigs rose by one to 134, their highest since July 2023.</span></p><p class=\"\"><span>        The oil and gas rig count declined by about 7% in 2025, 5% in 2024, and 20% in 2023 as lower U.S. oil </span><span> prices prompted energy firms to focus more on boosting shareholder returns and paying down debt rather than increasing output.</span></p><p class=\"\"><span>Financial services firm TD Cowen said 17 of the 21 exploration and production companies it tracks said they planned to spend about 1% less in capital expenditures in 2026 than in 2025.</span></p><p class=\"\"><span>That compares with a decline of around 4% in 2025, roughly flat year-on-year spending in 2024, and increases of 27% in 2023, 40% in 2022, and 4% in 2021.</span></p><p class=\"\"><span>With U.S. spot crude prices expected to fall for the fourth year in a row in 2026, the U.S. Energy Information Administration projected crude output would hold at 13.6 million barrels per day in 2026, matching 2025's record high.</span></p><p class=\"\"><span>On the gas side, EIA projected output would rise from a record 107.6 billion cubic feet per day (bcfd) in 2025 to 110.0 bcfd in 2026 with spot prices at the Henry Hub benchmark in Louisiana forecast to jump by about 22% in 2026. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN14L:0-us-drillers-cut-oil-and-gas-rigs-for-first-time-in-six-weeks-says-baker-hughes/",
            "pub_date": "2026-02-28 02:24:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:10dfcbbdb094b:0",
            "title": "Archer Aviation Partners With Starlink Ahead of FAA Approval",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Archer Aviation </span><span> is taking a strategic step that could shape how investors think about its competitive positioning in the emerging eVTOL market. The company said Friday it is partnering with Elon Musk's Starlink, owned by SpaceX, to integrate high-speed satellite internet into its Midnight aircraft once it receives regulatory approval to begin commercial operations. Under the agreement, Archer plans to install Starlink's system onboard and conduct testing, suggesting management is building out infrastructure ahead of a potential service launch.</span></p><p class=\"\"><span>The collaboration appears to extend beyond passenger connectivity. Archer said Starlink will also support communications between its four-passenger Midnight aircraft, pilots and engineering teams on the ground. In addition, both companies intend to work together on a connectivity solution that could help power Archer's future development of autonomous aircraft. If executed as outlined, that capability could become an important layer in scaling operations, particularly as autonomy remains a longer-term objective for the sector.</span></p><p class=\"\"><span>All of this unfolds as Archer continues to await approval from the US Federal Aviation Administration to begin commercial passenger flights. The company has stated that its Midnight aircraft is designed to carry passengers across cities in 5 to 15 minutes, potentially reducing travel times compared with ground transportation such as cars. For investors, the Starlink partnership may represent an effort to strengthen the platform before certification, while the timing of revenue generation will likely depend on when the FAA grants the green light.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:10dfcbbdb094b:0-archer-aviation-partners-with-starlink-ahead-of-faa-approval/",
            "pub_date": "2026-02-28 02:24:16",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0ZL:0",
            "title": "TSA officers get fraction of pay as government shutdown drags",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>TSA officers face financial strain due to partial government shutdown</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Union officials expect rise in TSA resignations amid financial pressures</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>TSA plans staffing surge for upcoming travel season despite challenges</span></li></ul></span></div><span><p class=\"\"><span>By Doyinsola Oladipo and David Shepardson</span></p><p class=\"\"><span>    Airport security screeners across the U.S. received a fraction of their usual pay on Friday as the partial government shutdown drags on, increasing the risk that more officers will call in sick to take second jobs, or even quit.</span></p><p class=\"\"><span>Funding for the U.S. Department of Homeland Security lapsed on February 13 after Congress failed to reach a deal on immigration enforcement reforms demanded by Democrats. That halted funding for the operation of several government agencies, including the Transportation Security Administration.</span></p><p class=\"\"><span>This shutdown is more limited than the record 43-day October-November event that closed numerous departments of government. But with TSA agents facing the possibility of losing even more pay if this one drags on further, the ripple effects could emerge again: absences, departures, and bottlenecked security lines at the nation's airports.</span></p><p class=\"\"><span>\"People are going to get discouraged a lot quicker this time,\" said Philip Glover, national vice president of District 3 of the American Federation of Government Employees, who represents TSA workers at 19 airports in Delaware and Pennsylvania.</span></p><p class=\"\"><span>EXPECTING MORE RESIGNATIONS</span></p><p class=\"\"><span>Local AFGE officials said they are expecting TSA resignations to rise, while other TSA workers, some of whom are still repaying debts from the last shutdown, again tighten their finances.  </span></p><p class=\"\"><span>Ha Nguyen McNeill, the top official at the TSA, told Congress this month that around 1,110 transportation security officers (TSOs) left the TSA in October and November 2025, a more than 25% increase from the same time period in 2024.</span></p><p class=\"\"><span>\"We heard reports of officers sleeping in their cars at airports to save money on gas, selling their blood and plasma and taking on second jobs to make ends meet,\" McNeill said of last year's shutdown, adding that the TSA is working to surge staffing in March, April, and May to be prepared for spring break, summer, and World Cup travel.</span></p><p class=\"\"><span>A TSA officer at Harry Reid International Airport in Las Vegas who asked to remain anonymous told Reuters the back-to-back shutdowns are making her reconsider the future of her nine-year career at the agency. \"I want to keep this job at least for the medical benefits, but sometimes I think I would be better off to abandon ship to reinvest myself elsewhere,\" the 34-year-old said.</span></p><p class=\"\"><span>Airline CEOs recently met with McNeill and Homeland Security Secretary Kristi Noem to talk about the shutdown and the effect on TSA, American Airlines </span><span> CEO Robert Isom said in a social media post.</span></p><p class=\"\"><span>Airlines raised concerns about the recent suspension of the Global Entry program - which was not affected during last year's shutdown - while lawmakers have urged DHS to restore the program, used to expedite U.S. customs and immigration clearance.</span></p><p class=\"\"><span>Senator Jacky Rosen of Nevada said in a Friday letter to Noem the government is using the program \"to maximize the administration’s political leverage and create uncertainty.\"   </span></p><p class=\"\"><span>MAKING ENDS MEET</span></p><p class=\"\"><span>Workers for a second time in four months have to find a way to make ends meet without pay as the agency's management is pressing workers more on absences, as some call in sick to take on odd jobs to pay bills and fill their gas tanks, local AFGE officials said. </span></p><p class=\"\"><span>\"Officers are looking at other alternatives just to maintain some kind of stability,\" said Darrell English, president of AFGE Local 777, which represents TSA workers in Illinois and Wisconsin. \"That's the backlash that's coming down the line from these continuous shutdowns.\"</span></p><p class=\"\"><span>Neal Gosman, treasurer of the AFGE Local 899 in Minnesota, said that several of his colleagues with high seniority decided to retire shortly after this shutdown started.</span></p><p class=\"\"><span>\"Maybe it's just coincidence and these are older people who've been there a while, but somehow they decided to pull the trigger this week,\" he said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0ZL:0-tsa-officers-get-fraction-of-pay-as-government-shutdown-drags/",
            "pub_date": "2026-02-28 02:24:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008954:0",
            "title": "The Amount Brokers Can Spend on Gifts to Vendors, Institutional Clients Is About to Triple — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Kenneth Corbin</span></p><p class=\"\"><span>In an industry where tens of thousands of dollars can be chalked up as a rounding error, $200 doesn't seem like much to get worked up about. But that number represents a tripling of the limit on gifts that brokers can give their institutional clients or professional associates, and it will soon be a reality.</span></p><p class=\"\"><span>Finra, the brokerage industry's self-regulatory organization, is increasing the gift limit for brokers from $100 to $300. The Securities and Exchange Commission, which oversees Finra, approved the proposal earlier this month. On Friday, Finra said the rule will take effect on March 30.</span></p><p class=\"\"><span>Finra has argued that the update makes sense to keep pace with inflation. The $100 threshold has stood for more than three decades, with various proposals to increase the cap stalling over the years.</span></p><p class=\"\"><span>The first version of the proposed rule change was posted in the Federal Register on June 17, opening a period of public comment. In that version, the new proposed gift cap was $250.</span></p><p class=\"\"><span>Commenters were supportive of the increase, but some said it didn't go far enough. Robinhood and the Financial Services Institute, a trade group representing independent broker-dealers, argued in their comment letters that the new threshold should be $500, both to account for inflation and in acknowledgment that the rule might not be updated again for many years.</span></p><p class=\"\"><span>FSI noted in its comment letter that a $100 gift in 1992, the last time the gift cap was raised, would have cost more than $220 in 2025, when it submitted its comment letter. The group argued that a blanket increase to $500 would help \"mitigate cost-of-living inequities and account for differences in purchasing power across parts of the country.\"</span></p><p class=\"\"><span>Finra says that the increase from $250 to $300 in its newest proposal, unveiled Sept. 11, aims to \"account for future inflation for approximately 10 years.\" Finra also committed to reviewing the cap periodically if the SEC approved its latest proposal.</span></p><p class=\"\"><span>The rule requires brokerage firms to update their supervisory systems that report, review, and store gits in the firm's records to account for the new cap.</span></p><p class=\"\"><span>Finra says that the rule aims to \"avoid improprieties\" that could arise with gifts given to employees of an institutional customer or vendor, and that it doesn't apply to retail clients. \"Finra noted, however, that members may have policies and procedures that restrict or prohibit gifts to individual retail customers,\" the SEC said in its Federal Register notice approving the proposal.</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008954:0/",
            "pub_date": "2026-02-28 02:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008952:0",
            "title": "Norwegian's 2H Will Be Better Than Its 1H — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Norwegian Cruise Line is likely to have a better second half of 2026 than first half, say Melius analysts Conor Cunningham and Patrick Coleman. The company is currently shifting inventory to the Caribbean but is not fully monetizing its additional families as it's waiting for its private destination there to ramp up in the summer. That monetization will improve in the second half as amenities at the private destination come online. Additionally, the worse the company's first half is, the more likely it becomes that changes are made, \"making the near-term earnings results and outlook a win-win regardless of the outcome,\" the analysts say. (nicholas.miller@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008952:0/",
            "pub_date": "2026-02-28 02:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008950:0",
            "title": "$28 Toothpaste? $14 Dental Floss? Dental Products Get the Luxury Treatment — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Nora Knoepflmacher</span></p><p class=\"\"><span>Antiaging face serums now go for over $500, and grocery aisles are lined with $15 glass bottles of oat milk. So it's hardly a shock that pearly whites are getting the luxury treatment, too. In the past few years, mouthwash in shapely perfume-like bottles and dental floss in gleaming canisters have hit shelves. \"When patients are already investing in premium skin care, supplements and wellness routines, it feels natural for oral care to follow,\" said Dr. Michael J. Wei, a cosmetic and restorative dentist in Manhattan. This crop of design-forward oral-care brands often features clean formulas and aims to elevate brushing and flossing from a tedious chore to an indulgent ritual.</span></p><p class=\"\"><span>Here, five luxe finds to try — with expert insight into the ingredients behind them.</span></p><p class=\"\"><span>A Pricey Toothpaste</span></p><p class=\"\"><span>Founded in 2016 by dentist Dr. Gerry Curatola, Revitin specializes in all-natural toothpaste. The $17 toothpaste comes in citrus or mint; some ingredients (like cranberry seed oil) sound like they've been ripped from the menu of an artisanal frozen-yogurt shop. Dr. Vanessa Peterson, an orthodontist in Rancho Cucamonga, Calif., appreciates that the toothpaste skips sodium lauryl sulfate, an ingredient that she said \"can contribute to irritation or allergies in some patients.\" She recommends Revitin to patients — and her children use it.</span></p><p class=\"\"><span>A Pricier Toothpaste</span></p><p class=\"\"><span>After starting out with clean, natural deodorant, Agent Nateur founder Jena Covello expanded into other hygiene products, including oral care. Packaged in the sort of sleek white tube you'd expect to find squirting premium hand cream, the Los Angeles brand's $28 toothpaste features ingredients such as Manuka honey and coconut oil. Plus: pearl powder, made by grinding real pearls, for gentle brightening. Wei highlighted the paste's \"clean formulation,\" but he cautioned patients with sensitive teeth or enamel erosion against using whitening toothpaste in general. The \"cinna-mint\" flavor reminds us of (say it quietly) a fancier version of Fireball's cinnamon whisky shots.</span></p><p class=\"\"><span>Mouthwash With Bite</span></p><p class=\"\"><span>Think of these mouthwash tablets as a TSA-friendly alternative to fluorescent liquid rinses. In flavors including a particularly strong citrus-mint, the tablets are activated by saliva — no water needed. How it works: Chew a tablet to create a foamy mouthwash; swish; spit. It feels a little strange, but it leaves the mouth refreshed. Wei noted the tablets' lack of alcohol — a common ingredient in mouthwash that can dry out the mouth and disrupt the oral microbiome balance, he said.</span></p><p class=\"\"><span>Eau de Mouthwash</span></p><p class=\"\"><span>Alas, this gorgeous bottle does not contain French perfume, but mouthwash. Kristoffer Vural founded the Stockholm-based luxury oral hygiene brand after a stroke left him partially paralyzed and hypersensitive to taste and smell. During his rehabilitation, finding existing dental products harsh and synthetic, he set out to \"reimagine oral care as a meaningful self-care ritual.\" Roughly $33, this fresh mouthwash has notes of licorice, lime and peppermint, and contains chamomile extract.</span></p><p class=\"\"><span>Fancy Floss</span></p><p class=\"\"><span>Housed in a metallic dispenser embellished with French text, this is the sophisticated Parisian cousin to drugstore dental floss. The work of famously stylish apothecary Officine Universelle Buly, the mint-flavored floss feels sturdy but slips easily between teeth. Most strikingly, it's black. Designed for daily use, it's intended for post-brushing and pre-mouthwash. \"If patients floss more regularly, that is a positive outcome,\" said Wei.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008950:0/",
            "pub_date": "2026-02-28 02:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:352538ad0094b:0",
            "title": "Trump Says Decision On Iran Not Final, Adds But ‘Sometimes You Have To’ Attack: Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>U.S. President Donald Trump reportedly said on Friday that a final decision on whether or not to attack Iran is yet to be made.</span></p><p class=\"\"><span>According to a report from CNBC, the president said to reporters outside the White House that while he would prefer to not attack Iran, “but sometimes you have to.”</span></p><p class=\"\"><span>“We’re not thrilled with the way they’re negotiating,” Trump reportedly said, expressing his opinion on Iran’s leadership refusing to curb its nuclear program. “They cannot have nuclear weapons,” he added.</span></p><p class=\"\"><em><span>Get updates to this developing story directly on Stocktwits.</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:352538ad0094b:0/",
            "pub_date": "2026-02-28 02:25:13",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN14I:0",
            "title": "Trump's Fed chief nominee faces hurdles as clock ticks on Powell's term",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US Senate will decide whether to confirm Warsh as next Fed chief</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Powell's term as head of US central bank ends on May 15</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Department of Justice investigation into Powell complicates Warsh nomination</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Trump wants a Fed chief who will deliver big interest rate cuts</span></li></ul></span></div><span><p class=\"\"><span>By Ann Saphir</span></p><p class=\"\"><span>    President Donald Trump has yet to formally nominate Kevin Warsh to succeed Jerome Powell as head of the Federal Reserve, a delay that while not unprecedented is also not typical and adds to uncertainty in a process clouded by concerns about political pressure on the U.S. central bank.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:636.7713004484306px;aspect-ratio:1.0612855007473843\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZN14I-e6d94bf71930d55079174cddfa95f9e6-resized.webp\" type=\"image/webp\"/><img alt=\"A bar chart showing the number of days between nomination announcement and official nomination to the senate of the Fed's governors since 2010.\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZN14I-e6d94bf71930d55079174cddfa95f9e6-resized.webp\" style=\"background-color:#f3e4db\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Federal Reserve nominees</span></figcaption></figure><p class=\"\"><span>Trump named Warsh, a former Fed governor, as his nominee four weeks ago. Since 2010 only two nominees for the Fed chief job and other seats on the central bank's Board of Governors have experienced a gap longer than four weeks between the White House announcement and the filing of paperwork to the Senate that kicks off the official confirmation process.</span></p><p class=\"\"><span>     The reason for the extended wait in Warsh's case is unclear, though Republican Senator Thom Tillis has promised to block any Fed nomination as long as a Department of Justice investigation into Powell regarding his testimony to Congress about central bank building renovations in Washington remains open.</span></p><p class=\"\"><span>Tillis says the probe is frivolous and a form of intimidation by the Trump administration, which has made no secret of its frustration with Powell for not cutting interest rates as quickly or deeply as it would like.</span></p><p class=\"\"><span>\"It does strike me as odd that there's been no forward movement on the Warsh nomination,\" said Derek Tang, an analyst with forecasting firm LH Meyer. \"The White House seems no closer to overcoming the Tillis block: that the senator won't let any nominee for the Fed get past the Senate Banking Committee unless and until the Powell probe goes away.\"</span></p><p class=\"\"><span>     \"The White House continues to work with the Senate to swiftly confirm Kevin Warsh as our next Federal Reserve chairman,\" White House spokesman Kush Desai said, adding that Warsh is \"eminently qualified to restore competence and confidence in Fed decision-making.\"  </span></p><p class=\"\"><span>The Fed's insulation from short-term political considerations and the ability to set interest rates without regard to the preferences of a given president is widely considered essential to its ability to keep inflation under control and steer the economy to a healthy footing.</span></p><p class=\"\"><span>Treasury Secretary Scott Bessent has said the Republican-controlled Senate Banking Committee has agreed to move forward with a confirmation hearing once Warsh is formally nominated. The panel's Republican members, including Tillis, have said they see Warsh as well qualified and a good pick for the job.</span></p><p class=\"\"><span>But without Tillis' vote to advance Warsh's nomination to consideration by the full Senate, the committee's slim Republican majority does not have the power to override unified Democratic opposition.</span></p><p class=\"\"><span>     Warsh and Fed spokespersons declined to comment.</span></p><p class=\"\"><span>THE POWELL PROBE</span></p><p class=\"\"><span>Powell disclosed the DOJ's probe in January, describing it as part of the Trump administration's \"threats and ongoing pressure\" on the Fed to cut rates.</span></p><p class=\"\"><span>The central bank has asked a judge to quash the government's subpoenas in the probe, the Wall Street Journal reported on Thursday. The Fed declined to comment on the report.</span></p><p class=\"\"><span>The probe is not the only hurdle to Trump's long-held goal of installing a rate-cut-friendly Fed chief in place of Powell.</span></p><p class=\"\"><span>TICKING CLOCK</span></p><p class=\"\"><span>     The 11 weeks until the end of Powell's term on May 15 is less time than it took for most of the Fed's current governors to go from their nominations to Senate confirmation.</span></p><p class=\"\"><span>The timing is by no means overly tight, as the Senate showed last fall when it moved to confirm then-Trump economic adviser Stephen Miran as a Fed governor less than two weeks after the president nominated him.</span></p><p class=\"\"><span>But a long delay on the Warsh confirmation would leave the nominee - and the central bank - in uncomfortable limbo as the clock ticks toward the central bank's June 16-17 meeting, the earliest expected time for a serious debate on, if not delivery of, a rate cut.</span></p><p class=\"\"><span>MUSICAL CHAIRS AT THE FED?</span></p><p class=\"\"><span>Trump is expected to nominate Warsh to fill a seat currently occupied by Miran, whose term expired on January 31 but who may remain in his role until his successor is confirmed by the Senate. The switch would replace one rate-cut advocate with another, leaving Trump-appointees one seat short of a majority on the seven-member Fed board.</span></p><p class=\"\"><span>The president has made an unprecedented effort to fire Fed Governor Lisa Cook for what he says were misrepresentations on her mortgage applications. Cook, who was appointed by former President Joe Biden, denies wrongdoing and is fighting her removal in a case that is before the Supreme Court. Powell attended oral arguments in January, calling it \"the most important ⁠legal case in the Fed's ‍113-year history\" because of its implications for the central bank's independence.</span></p><p class=\"\"><span>COULD POWELL STAY PUT?</span></p><p class=\"\"><span>     Powell could, if he chooses, stay on as a Fed governor at least until January 31, 2028. He has declined to say if he will leave the board when his term as head of the central bank ends, as nearly all his predecessors have done.</span></p><p class=\"\"><span>Bucking that precedent would be an extraordinary move that would signal Powell's abiding concern about the Fed's ability to continue to operate independently from the administration.</span></p><p class=\"\"><span>Reasons for such concern range from the fact that Trump made support for rate cuts an explicit condition for anyone he nominated to replace Powell, and the unprecedented means by which the president's administration has sought to pressure central bank leaders, including through the DOJ probe.</span></p><p class=\"\"><span>But staying on would almost certainly draw criticism from the Trump administration and others as a partisan bid to thwart the president's prerogative to name a new Fed governor.</span></p><p class=\"\"><span>LEADERSHIP QUESTIONS</span></p><p class=\"\"><span>Even if Powell did remain as a governor, there's little doubt that the central bank's Federal Open Market Committee would stick with institutional norms and elect Warsh to lead the policy-setting panel.</span></p><p class=\"\"><span>But it would leave Warsh, who already faces the daunting task of convincing a divided committee to support the rate cuts he says he wants - contending with the complications of sharing the policymaking table with the person who used to have his job.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN14I:0-trump-s-fed-chief-nominee-faces-hurdles-as-clock-ticks-on-powell-s-term/",
            "pub_date": "2026-02-28 02:25:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_EM3j6CFVa:0",
            "title": "UniCredit S.p.A. - Shareholders' meeting documentation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>KOMISJA NADZORU FINANSOWEGO</span></p><p class=\"\"><span>Raport bieżący nr 25 / 2026</span></p><p class=\"\"><span>Data sporządzenia: 2026-02-27</span></p><p class=\"\"><span>Skrócona nazwa emitenta</span></p><p class=\"\"><span>UniCredit</span></p><p class=\"\"><span>Temat</span></p><p class=\"\"><span>Shareholders' meeting documentation</span></p><p class=\"\"><span>Podstawa prawna</span></p><p class=\"\"><span>Inne uregulowania</span></p><p class=\"\"><span>Treść raportu:</span></p><p class=\"\"><span>Following the press releases issued today, UniCredit S.p.A. informs that it has made available to</span></p><p class=\"\"><span>the public, at the Company's Registered Office, on the website of the authorized storage mechanism</span></p><p class=\"\"><span>eMarket STORAGE\" managed by Teleborsa S.r.l. (www.emarketstorage.it/en), as well as on UniCredit</span></p><p class=\"\"><span>website (www.unicreditgroup.eu/agm31march2026), the documentation concerning all the items on the</span></p><p class=\"\"><span>Agenda of the Shareholders' Meeting convened on 31 March 2026.</span></p><p class=\"\"><span>Milan, 27 February 2026</span></p><p class=\"\"><span>Enquiries</span></p><p class=\"\"><span>Investor Relations</span></p><p class=\"\"><span>e mail: investorrelations@unicredit.eu</span></p><p class=\"\"><span>Media Relations</span></p><p class=\"\"><span>e mail: mediarelations@unicredit.eu</span></p><p class=\"\"><span>Załączniki</span></p><p class=\"\"><span>Plik Opis</span></p><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260227_192511_1584664666_PR_UniCredit_AGM_documentation_27022026.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEM3Gwfsha\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_EM3j6CFVa:0-unicredit-s-p-a-shareholders-meeting-documentation/",
            "pub_date": "2026-02-28 02:25:19",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:9ed02102c094b:0",
            "title": "Trump Media Weighs Truth Social Spin-Off After $6 Billion Fusion Deal",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Trump Media &amp; Technology Group </span><span> is exploring yet another structural shift, this time opening discussions to separate its Truth Social platform into an independent company, even as it continues pursuing its previously announced $6 billion merger with nuclear fusion developer TAE Technologies. In a statement released Friday, the company said it and TAE are evaluating a framework under which existing shareholders would receive new shares in the spun-off social media business, which would then merge with Texas Ventures Acquisition III Corp., a Nasdaq-listed special purpose acquisition company. The proposal suggests management is actively reassessing how its assets could be organized to potentially unlock different sources of value.</span></p><p class=\"\"><span>Importantly, TAE Technologies' fusion operations part of a company founded in 1998 along with certain other Trump Media assets, would remain within the parent entity under the contemplated structure. That follows December's announcement of a transaction valued at more than $6 billion, pairing the Truth Social operator with the closely held fusion developer. While the combination initially signaled a push into advanced energy technology, the latest discussions indicate the group could be refining how that exposure sits alongside its social media operations.</span></p><p class=\"\"><span>There is no definitive agreement at this stage, and the discussions remain ongoing, underscoring that terms could still evolve. The potential spin-off would mark another pivot for President Donald Trump's namesake media company, which over the past year has introduced initiatives including cryptocurrency accumulation, financial products, and sports wagering markets. For investors, the outcome could reshape how the market evaluates the social platform relative to the fusion-focused business, depending on whether the talks translate into a completed transaction.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:9ed02102c094b:0-trump-media-weighs-truth-social-spin-off-after-6-billion-fusion-deal/",
            "pub_date": "2026-02-28 02:25:28",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN21D:0",
            "title": "EU wheat breaks above 200 euros on Iran conflict fears",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Benchmark wheat futures prices on Euronext climbed on Friday above the psychological 200 euro mark for the first time since November as investor worries about the potential for U.S.-Iran conflict spurred short-covering before the weekend.</span></p><p class=\"\"><span>Demand from importers this week, including a Saudi tender that closed on Friday, and a further decline in French cereal crop conditions following heavy rain also supported prices, traders said.</span></p><p class=\"\"><span>May milling wheat (BL2K6), the most active position on Paris-based Euronext, settled 1.9% up at 201.50 euros ($238.13)a metric ton. It earlier rose to 201.75 euros, its highest since November 6, after breaching the 200 euro resistance level.</span></p><p class=\"\"><span>Inconclusive talks on Thursday between Washington and Tehran, followed by security warnings from some states to their citizens regarding Iran and other Middle Eastern countries increased investor jitters over potential military clashes.</span></p><p class=\"\"><span>Grains took impetus from crude oil, which rose more than 2%. </span></p><p class=\"\"><span>“There is some worry in markets today about possible fighting between Iran and the United States, while the export picture has been positive this week with big tenders from Algeria and Saudi Arabia,” a German trader said.</span></p><p class=\"\"><span>Saudi Arabia announced a tender to purchase 655,000 tons of wheat, with results expected on Monday. That followed an Algerian tender on Tuesday, in which the importer was thought to have booked several hundred thousand tons, traders said. </span></p><p class=\"\"><span>Talk that Algeria failed to book additional volume in a second day of talks on Wednesday has raised expectations that it might issue another tender soon. </span></p><p class=\"\"><span>The Algerian tender had also boosted export sentiment in Europe by suggesting that cheaper Argentine supplies may longer be widely available for later in the season.</span></p><p class=\"\"><span>Moroccan buyers were seeking about 30,000 tons of feed wheat at around $250 a ton cost and freight included (c&amp;f) for prompt shipment. Egyptian buyers were seeking about 25,000 tons of 11.5% wheat at around $251 a ton c&amp;f for March/April shipment.</span></p><p class=\"\"><span>Ratings of French soft wheat crops showed 84% were in good or excellent condition by February 23, down from 88% a week earlier and 91% two weeks earlier, farm office FranceAgriMer said in a cereal report.</span></p><p class=\"\"><span>However, a dry, mild spell in France this week should help improve field conditions, traders said.</span></p><p class=\"\"><span>($1 = 0.8462 euros)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN21D:0-eu-wheat-breaks-above-200-euros-on-iran-conflict-fears/",
            "pub_date": "2026-02-28 02:25:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947547:0",
            "title": "DKL: Record EBITDA, rising distributions, and strong third-party growth position for 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record 2025 Adjusted EBITDA of $536M was driven by strong execution and asset integration, with 2026 EBITDA guidance set at $520M-$560M. Distribution increased for the 52nd consecutive quarter, and 80% of 2026 EBITDA is expected from third-party business.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947547:0-dkl-record-ebitda-rising-distributions-and-strong-third-party-growth-position-for-2026/",
            "pub_date": "2026-02-28 02:16:37",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947548:0",
            "title": "TCPC: NAV fell 19% on portfolio markdowns; strategy shifts to first lien loans and diversification",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Adjusted NII and NAV declined year-over-year due to significant markdowns in six portfolio companies, with a focus on improving credit quality and portfolio diversification. Liquidity remains strong, and leverage is being actively managed.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947548:0-tcpc-nav-fell-19-on-portfolio-markdowns-strategy-shifts-to-first-lien-loans-and-diversification/",
            "pub_date": "2026-02-28 02:16:39",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008853:0",
            "title": "Teleflex Is Maintained at Sector Perform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008853:0/",
            "pub_date": "2026-02-28 02:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008851:0",
            "title": "OUTFRONT Media Is Maintained at Overweight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:17 GMT) </span></strong><span>OUTFRONT Media Price Target Raised to $30.00/Share From $27.00 by Wells Fargo</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008851:0/",
            "pub_date": "2026-02-28 02:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008856:0",
            "title": "Baldwin Insurance Group Raised to Strong Buy From Outperform by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:17 GMT) </span></strong><span>Baldwin Insurance Group Price Target Raised to $30.00/Share From $20.00 by Raymond James</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008856:0/",
            "pub_date": "2026-02-28 02:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008877:0",
            "title": "Shift4 Payments Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:18 GMT) </span></strong><span>Shift4 Payments Price Target Cut to $55.00/Share From $77.00 by Wells Fargo</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008877:0/",
            "pub_date": "2026-02-28 02:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008871:0",
            "title": "Magnite Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:18 GMT) </span></strong><span>Magnite Price Target Cut to $13.00/Share From $20.00 by Wells Fargo</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008871:0/",
            "pub_date": "2026-02-28 02:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008873:0",
            "title": "Carlyle Group Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008873:0/",
            "pub_date": "2026-02-28 02:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0VG:0",
            "title": "NASA shakes up moon program with new test mission before astronaut lunar landing",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>New Artemis mission scoots moon landing back in program timeline</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>NASA scraps plan to upgrade SLS rocket to improve current version</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Many technical steps remain before U.S. moon landing can happen</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>U.S. is racing with China, which plans 2030 moon landing</span></li></ul></span></div><span><p class=\"\"><span>By Joey Roulette</span></p><p class=\"\"><span>    NASA is adding a spacecraft docking test to its Artemis moon program before landing its first astronauts on the moon in over half a century, overhauling the flagship U.S. moon effort amid mounting delays and competitive pressure from China.</span></p><p class=\"\"><span>The new Artemis mission in Earth's orbit, planned for 2027 and involving lunar landers from Elon Musk's SpaceX and Jeff Bezos' Blue Origin, was one of many moon program changes announced by NASA chief and billionaire entrepreneur Jared Isaacman on Friday. </span></p><p class=\"\"><span>It comes as China inches closer to its own 2030 crewed moon landing goal, and U.S. safety experts warn more testing is needed before NASA makes its crewed attempt to land on the moon, now planned as Artemis IV in 2028.</span></p><p class=\"\"><span>\"We all have arrived at the point that this is really the only pathway in order to achieve success with a lunar landing within the timeframes that we are targeting,\" Isaacman told reporters on Friday, stressing a need to move faster and minimize delays with various spacecraft involved in the program.</span></p><p class=\"\"><span>As part of the updated Artemis III mission, NASA's Orion astronaut capsule will demonstrate its ability to dock with one or both of the lunar landers in low-Earth orbit. The process is a crucial juncture in the agency's path to the moon.</span></p><p class=\"\"><span>The space agency also canceled an effort to upgrade its Space Launch System rocket to instead focus on increasing that rocket's production and flight rate, which has been slow relative to newer rockets. The move impacts Boeing's roughly $2 billion contract to build a more powerful SLS upper stage, current plans for which have been canceled.</span></p><p class=\"\"><span>Those moves, Isaacman said, would help SLS achieve a flight rate of at least one launch per year and enable yearly missions to the moon, speeding up a launch cadence that currently stands at one launch every two or three years.</span></p><p class=\"\"><span>The decisions amount to NASA's most significant reshuffling of its Artemis program since its inception in 2017, as the U.S. aims to establish regular lunar missions as a long-awaited follow-up to its first moon missions in the Apollo program that ended in 1972. </span></p><p class=\"\"><span>Isaacman said the agency's many contractors, from Boeing to SpaceX, are on board with the new goals. Lockheed Martin, which builds the Orion capsule, lauded the announcement. Boeing said its workforce and extensive SLS supply chain are prepared to increase the rocket's production and flight rate. </span></p><p class=\"\"><span>    SECOND ARTEMIS MISSION STRUGGLES TO LAUNCH</span></p><p class=\"\"><span>SpaceX and Blue Origin are each developing an astronaut lunar lander for the program, dueling to be the first to achieve the moon landing for NASA. Boeing and Northrop Grumman build SLS, which carries the Lockheed Martin-built Orion astronaut capsule that will taxi the astronauts to one of the lunar landers in space before landing on the moon.</span></p><p class=\"\"><span>The new mission allows more practice for NASA before its more ambitious step of landing on the moon, which had long been planned for Artemis III. The agency launched an uncrewed test of SLS and Orion in 2022 and is targeting an April launch of Artemis II, taking four astronauts around the moon and back.</span></p><p class=\"\"><span>NASA since earlier this month has attempted to launch its second Artemis mission, the program's first flight carrying a crew of astronauts. Three U.S. astronauts and a Canadian astronaut will fly Orion around the moon and back over ten days.</span></p><p class=\"\"><span>But a leak of hydrogen, a key propellant that fuels SLS, occurred during a launch rehearsal this month, followed by an issue involving the rocket's upper stage that forced NASA to roll the rocket back for repairs.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0VG:0-nasa-shakes-up-moon-program-with-new-test-mission-before-astronaut-lunar-landing/",
            "pub_date": "2026-02-28 02:18:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008898:0",
            "title": "Elastic Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:19 GMT) </span></strong><span>Elastic Price Target Cut to $60.00/Share From $75.00 by Wells Fargo</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008898:0/",
            "pub_date": "2026-02-28 02:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN142:0",
            "title": "US wheat climbs to one-year peak as US-Iran tensions spook funds",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Risk of Iran conflict spurs short covering</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Soybeans still supported by demand expectations</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Wheat hits 1-year high, corn at 7-week top</span></li></ul></span></div><span><p class=\"\"><span>By Karl Plume</span></p><p class=\"\"><span>    U.S. wheat futures rallied to a one-year high on Friday as worries about a U.S.-Iran military conflict sparked short covering by funds that hold large short positions in the market.</span></p><p class=\"\"><span>Corn scaled a seven-week top, fuelled by technical buying and spillover support from wheat. Soybeans held firm near a 20-month peak as investors weighed likely strong demand from biofuels makers against uncertainty about purchases by top importer China and a likely record harvest in Brazil.</span></p><p class=\"\"><span>Commodities markets have been unsettled as investors fret about inconclusive talks on Thursday between Washington and Tehran, despite mediator Oman's talk of progress. Other markets are taking cues from crude oil, which rose 2%. </span></p><p class=\"\"><span>\"People remember the Russian-Ukraine invasion when wheat took off to ten dollars. The funds are caught short and I think this is one of those 'seller beware' situations going into a weekend where anything could happen,\" said Don Roose, president of U.S. Commodities.</span></p><p class=\"\"><span>Chicago Board of Trade May wheat futures (WK26) were up 18-1/4 cents at $5.92-3/4 a bushel at 11:45 a.m. CST (1745 GMT) after touching the highest point for a most-active contract </span><span> since February 2025. Buying accelerated as the contract topped a high posted on Monday.</span></p><p class=\"\"><span>CBOT May corn was up 5 cents at $4.48-1/2 a bushel after breaking through technical chart resistance at its 100- and 200-day moving averages. May soybeans (SK26) rose 3-1/2 cents to $11.67 a bushel, just below a 20-month high posted a day earlier.</span></p><p class=\"\"><span>Soybeans remained underpinned by recent bullish biofuels news and hopes that China would book more U.S. shipments, although a record harvest in rival supplier Brazil capped gains.</span></p><p class=\"\"><span>A Reuters report on Thursday, which said the U.S. administration plans to require big oil refineries to make up for at least half of the biofuel blending exemptions, reinforced expectations that upcoming revisions to U.S. biofuel policy will boost demand for feedstocks like soyoil.</span></p><p class=\"\"><span>     But Chinese demand for U.S. soy remained unclear after a Supreme Court ruling against some U.S. tariffs prompted President Donald Trump to introduce other levies.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN142:0-us-wheat-climbs-to-one-year-peak-as-us-iran-tensions-spook-funds/",
            "pub_date": "2026-02-28 02:19:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:0e7432415094b:0",
            "title": "OpenAI Closes Up to $110 Billion Round at $730 Billion Valuation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>OpenAI has closed a funding round that could raise as much as $110 billion, valuing the ChatGPT maker at $730 billion. The deal surpasses the $41 billion OpenAI raised in 2025, which at the time was the largest startup investment ever. </span></p><p class=\"\"><span>According to the Financial Times, Nvidia </span><span> and SoftBank have each committed $30 billion, payable in three instalments. Amazon </span><span> will invest $15 billion upfront with up to $35 billion more, contingent on either an IPO or OpenAI achieving artificial general intelligence. A further $10 billion in primary equity is expected from sovereign wealth funds and investment firms over the coming month. Despite Microsoft </span><span> remaining OpenAI's largest existing backer, it did not participate in the new round.</span></p><p class=\"\"><span>The Amazon investment comes alongside a broader commercial partnership in which OpenAI will spend $100 billion on Amazon's computing power and chips over eight years, in addition to an existing $38 billion contract. Amazon Web Services will become the exclusive third-party cloud partner supporting distribution of OpenAI's recently launched enterprise platform, Frontier. The new capital adds to roughly $40 billion OpenAI already holds on its balance sheet, giving the company runway through a period of continued losses that it expects to sustain until 2030, when executives forecast turning free cash flow positive for the first time.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:0e7432415094b:0-openai-closes-up-to-110-billion-round-at-730-billion-valuation/",
            "pub_date": "2026-02-28 02:19:47",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN1SD:0",
            "title": "Measles cases in South Carolina rise by 6 to 985",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Measles cases in South Carolina rose to 985 on Friday, state health data showed, including six additional infections since Tuesday.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Officials have warned that the widening outbreak could last weeks or months amid lagging vaccine uptake.      </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>At least 61 people are in quarantine after being exposed to the virus, and two in isolation to keep them from spreading the disease.      </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Of those infected, 919 were unvaccinated, 19 were partially vaccinated with one of the recommended two-dose measles-mumps-rubella vaccines, 26 were fully vaccinated and 21 had unknown vaccination status.      </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>South Carolina has         reported a drop         in measles cases over the past two weeks, an encouraging sign that the outbreak may be easing earlier than anticipated, a state health official said in a briefing on Wednesday.      </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The outbreak, which began in October, has been centered in the northwest part of the state, which includes Greenville and Spartanburg, according to the South Carolina Department of Public Health.      </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>As of February 26, 1,136 confirmed measles cases were reported in the U.S. in 2026, according to CDC's latest data.   </span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN1SD:0-measles-cases-in-south-carolina-rise-by-6-to-985/",
            "pub_date": "2026-02-28 02:20:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN11A:0",
            "title": "US lifts sanctions on top Malian officials as ties improve ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    The U.S. has lifted sanctions targeting three senior Malian officials for their relationship with Russia's mercenary group Wagner, according to a notification from the Treasury Department, as bilateral relations improve.</span></p><p class=\"\"><span>The Trump administration has brushed aside concerns about dealing with military-led governments in Africa's Sahel region, aiming instead to focus on shared interests like the growing potency of jihadist groups. </span></p><p class=\"\"><span>The Malian officials delisted on Friday included Defense Minister Sadio Camara and senior military officials Alou Boi Diarra and Adama Bagayoko. All had been sanctioned for their connections to the now largely defunct Wagner mercenary group, which Russia has since folded into its Africa Corps.  </span></p><p class=\"\"><span>There was no immediate response from the Malian government. </span></p><p class=\"\"><span>The top U.S. envoy to Africa, Nick Checker, visited Mali last month to discuss the next steps for building closer ties, according to the State Department. Last year, Washington moved to resume intelligence sharing with Mali to support counterterrorism efforts.</span></p><p class=\"\"><span>Cameron Hudson, a former U.S. official who worked on Africa at the Central Intelligence Agency and State Department, said the move appeared to be part of a broader effort to re-engage with the Sahel.</span></p><p class=\"\"><span>     \"The U.S. in recent months has substantially increased its engagement with Malian authorities in an effort to restart counterterrorism cooperation and to further underline the message that the U.S. will no longer be hamstrung in its foreign policy by disengaging in countries run by military juntas,\" he told Reuters.</span></p><p class=\"\"><span>Under the Biden administration, the U.S. lost its main spy base in the region, in neighbouring Niger, and was banned from carrying out intelligence-gathering flights, severely hobbling its ability to monitor and counter jihadists there. </span></p><p class=\"\"><span>Mali, along with its Sahel neighbours Burkina Faso and Niger, has struggled to beat back an expanding, decade-long jihadist insurgency led by local groups allied to al Qaeda and Islamic State. The violence has spread to coastal nations and is causing a growing number of casualties.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN11A:0-us-lifts-sanctions-on-top-malian-officials-as-ties-improve/",
            "pub_date": "2026-02-28 02:12:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:2b7a40ee6888d:0",
            "title": "UFP Technologies updates investor presentation, lays out 3–5yr targets including 12–18% revenue growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>UFP Technologies released updated investor presentation highlighting strategic focus on MedTech and 3–5 year financial targets.</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Key Highlights:</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Filed Exhibit 99.1: updated presentation for investor meetings and public presentations; disclosure not \"filed\" under Section 18.</span></li><li class=\"listItem-bmN0_SHH\"><span>Company emphasizes MedTech focus: ~92% of $603M revenue comes from medical device customers and 26 of top 30 OEMs are clients.</span></li><li class=\"listItem-bmN0_SHH\"><span>3–5 year targets: 12–18% revenue growth, 28–31% gross margin, and 17–20% adjusted operating margin.</span></li><li class=\"listItem-bmN0_SHH\"><span>Growth strategy: organic focus on high-growth MedTech niches plus strategic, accretive acquisitions (22 completed historically).</span></li><li class=\"listItem-bmN0_SHH\"><span>Highlights market opportunity in robotic surgery and CDMO segments; cites global medical device market growth and scale advantages.</span></li></ul><p class=\"\"><span>Original SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/914156/000162828026012667/ufpt-20260227.htm\" rel=\"nofollow\" target=\"_blank\">UFP TECHNOLOGIES INC [ UFPT ] - 8-K - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:2b7a40ee6888d:0-ufp-technologies-updates-investor-presentation-lays-out-3-5yr-targets-including-12-18-revenue-growth/",
            "pub_date": "2026-02-28 02:13:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:a13201c382853:0",
            "title": "Caliber completes sale of Holiday Inn Ocotillo for $13.0M, positions Hospitality Trust for 2026 expansion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Caliber sold the Holiday Inn Ocotillo for $13.0 million and will recycle proceeds to expand Caliber Hospitality Trust in 2026.</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Key Highlights:</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Sold Holiday Inn Ocotillo in Phoenix–Chandler submarket for $13.0 million; asset was owned by Caliber Hospitality Trust.</span></li><li class=\"listItem-bmN0_SHH\"><span>Proceeds will be recycled and combined with new equity from in-house capital markets and institutional partners to grow CHT.</span></li><li class=\"listItem-bmN0_SHH\"><span>CHT will pursue branded, cash-flowing hotels via tax-efficient contributions, value-add acquisitions, select development, and partnerships.</span></li><li class=\"listItem-bmN0_SHH\"><span>Caliber expects growth of CHT to drive recurring asset management fees, performance incentives, and potential balance sheet participation.</span></li><li class=\"listItem-bmN0_SHH\"><span>CHT may evaluate liquidity options as it scales, including a non-traded REIT and a longer-term public listing objective.</span></li></ul><p class=\"\"><span>Original SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1627282/000162728226000004/cwd-20260227.htm\" rel=\"nofollow\" target=\"_blank\">CaliberCos Inc. [ CWD ] - 8-K - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:a13201c382853:0-caliber-completes-sale-of-holiday-inn-ocotillo-for-13-0m-positions-hospitality-trust-for-2026-expansion/",
            "pub_date": "2026-02-28 02:13:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008816:0",
            "title": "Sweetgreen Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:14 GMT) </span></strong><span>Sweetgreen Price Target Cut to $7.00/Share From $8.00 by RBC Capital</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008816:0/",
            "pub_date": "2026-02-28 02:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}