{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_S8N3NC06X:0",
            "title": "Russia's net forex sales rise to equivalent of 5.6 bln roubles per day",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Russia's finance ministry said on Wednesday it would cut its purchases of foreign currency and gold in the month ahead, a move that will increase the state's overall forex sales, providing support for the rouble.</p><p class=\"\">The finance ministry said its purchases of foreign currencies and gold for the period from Feb. 7 to March 6 would amount to the equivalent of 66.5 billion roubles, or 3.3 billion roubles a day. </p><p class=\"\">In the previous period from Jan. 15 to Feb. 6 the purchases amounted to the equivalent of 70.2 billion roubles, or 4.1 billion roubles a day.</p><p class=\"\">The move implies that the overall net forex sales by the government and the central bank will rise to 5.56 billion roubles per day from Feb. 7 from 4.76 billion roubles previously. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_S8N3NC06X:0-russia-s-net-forex-sales-rise-to-equivalent-of-5-6-bln-roubles-per-day/",
            "pub_date": "2025-02-05 17:00:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_WkrbRcs2v:0",
            "title": "ZINZINO AB (PUBL.): PRELIMINARY SALES REPORT JANUARY 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Zinzino<p class=\"\">Zinzino group revenue increased with a total of 57 %, compared with the previous year.</p><p class=\"\">The revenue in January for Zinzino's sales markets increased by 62% and amounted to SEK 228.7 (140.9) million. Faun Pharma's external sales decreased and amounted to SEK 4.7 (8.1) million. Overall, the Group increased revenues by 57% to SEK 233.4 (149.0) million compared with the previous year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenues were distributed as follows:</strong></p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Regions, mSEK</td><td>25-Jan</td><td>24-Jan</td><td>Change</td></tr><tr><td>The Nordics</td><td>25.5</td><td>22.8</td><td>12%</td></tr><tr><td>Central Europe</td><td>69.5</td><td>40.9</td><td>70%</td></tr><tr><td>East Europe</td><td>34.2</td><td>31.8</td><td>8%</td></tr><tr><td>South &amp; West Europe</td><td>44.6</td><td>22.0</td><td>101%</td></tr><tr><td>The Baltics</td><td>10.3</td><td>8.0</td><td>29%</td></tr><tr><td>North America</td><td>22.2</td><td>10.4</td><td>113%</td></tr><tr><td>Asia-Pacific</td><td>20.8</td><td>4.0</td><td>420%</td></tr><tr><td>Africa</td><td>1.6</td><td>1.0</td><td>60%</td></tr><tr><td>Zinzino</td><td>228.7</td><td>140.9</td><td>62%</td></tr><tr><td>Faun Pharma</td><td>4.7</td><td>8.1</td><td>-42%</td></tr><tr><td>Zinzino Group</td><td>233.4</td><td>149.0</td><td>57%</td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">Countries in regions:</strong></p><p class=\"\">-The Nordics: Denmark, Faroe Island, Finland, Iceland, Norway, Sweden</p><p class=\"\">-Central Europe: Austria, Germany, Switzerland</p><p class=\"\">-East Europe: Czech Republic, Slovakia, Hungary, Poland, Romania</p><p class=\"\">-South &amp; West Europe: Cyprus, France, Greece, Italy, Luxembourg, Malta, Netherlands, Slovenia, Spain, United Kingdom, Belgium, Ireland, Serbia, Turkey, Canary Islands</p><p class=\"\">-The Baltics: Estonia, Latvia, Lithuania</p><p class=\"\">-North America: Canada, USA, Mexico</p><p class=\"\">-Asia-Pacific: Australia, Hong Kong, India, Malaysia, Singapore, Taiwan, Thailand</p><p class=\"\">-Africa: South Africa</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information: </strong></p><p class=\"\">Dag Bergheim Pettersen CEO Zinzino +47 (0) 932 25 700, www.zinzino.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pictures for publication free of charge:</strong> marketing@zinzino.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Certified Adviser:</strong> Carnegie Investment Bank AB (publ.)</p><p class=\"\">Zinzino is a global direct sales company from Scandinavia specializing in test-based, personalized nutrition and scientific skincare. It is a public limited company with its shares listed on Nasdaq First North Premier Growth Market. Their scientifically proven nutritional supplements are available on more than 100 markets across the world. Zinzino owns the Swiss, biotech skincare brand HANZZ+HEIDII, as well as the Norwegian research and production units BioActive Foods AS and Faun Pharma AS. The company headquarters is in Gothenburg, Sweden with additional offices in Europe, Asia and Australia.</p><p class=\"\">https://news.cision.com/zinzino/r/zinzino-ab--publ--preliminary-sales-report-january-2025%2Cc4100794</p><p class=\"\">2501 Pressrelease Salesreport EN</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_WkrbRcs2v:0-zinzino-ab-publ-preliminary-sales-report-january-2025/",
            "pub_date": "2025-02-05 17:00:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463890:0",
            "title": "Banco Santander to Launch EUR1.6 Billion Share Buyback",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Banco Santander  will on Thursday start its 1.59 billion-euro share buyback program, which is scheduled to run until June 27. </p><p class=\"\">The Spanish lender plans to repurchase up to 1,413,743,296 shares as part of its share capital reduction plan, according to a Wednesday filing. </p><p class=\"\">The program will take place on the Spanish Automated Quotation System, Turquoise Europe, DXE Europe, and Aquis Exchange Europe.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463890:0/",
            "pub_date": "2025-02-05 17:00:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002524_20250205002585:0",
            "title": "KB Financial Group 2024 Net KRW5.029T, Up 11% >105560.SE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002524_20250205002585:0/",
            "pub_date": "2025-02-05 17:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN31vkYs:0",
            "title": "Carlsquare/Vontobel weekly trading note: Investor uncertainty over Trumps tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Orange juice prices have been at record highs since 2022 but have been falling since September 2024. Two regions, Sao Paolo in Brazil and Florida in the US, dominate global production and supply. Here, bad weather, a strong US dollar and Brazilian real, and citrus greening disease have contributed to the price trend. We recommend going long when the price has fallen a little further from current levels. Since Friday 31 January, global equity markets have been negatively affected by President Trump's tariffs on Canada, Mexico and China.</p><p class=\"\">Uncertain demand, coupled with production problems in both Florida and Brazil, halted the previous linear price increase for frozen concentrated orange juice (FCOJ). In 2024, Hurricane Milton was devastating to Florida citrus production. In Brazil, excessive drought and high temperatures, combined with citrus greening, have significantly affected production. If demand remains weak, it is possible that prices will follow seasonal patterns and remain subdued in the coming months. On the other hand, Trump tariffs and a strong USD and BRL could artificially boost prices in both directions. A potential investor could enter a long position when the orange juice price touches one of the lower barriers discussed in the article.</p><p class=\"\">US President Trumps proposed tariffs on Canada, Mexico and China made the equity markets tumble on Friday 31 January in the US, followed by a similar reaction on the Asian and European stock markets on Monday 3 February.</p><p class=\"\">Please find out more in our weekly letter on certificates Vontobel.com: <strong class=\"root-Tkn6WL2y\">Read the weekly newsletter here</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Link to the Swedish-translated version</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read more</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN31vkYs:0-carlsquare-vontobel-weekly-trading-note-investor-uncertainty-over-trumps-tariffs/",
            "pub_date": "2025-02-05 17:03:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX4gnj6Q:0",
            "title": "MEXC Fuels DeFi Innovation and Liquidity Security with the Berachain (BERA) Listing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1029.490616621984px;aspect-ratio:1.7158176943699732\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX4gnj6Q-1cfb00db2f8ab0619eab1398fb543652-resized.webp\" type=\"images/webp\"/><img alt=\"photo_2025-02-05 14.22.05\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX4gnj6Q-1cfb00db2f8ab0619eab1398fb543652-resized.jpeg\" style=\"background-color:#a24526\"/></picture></div></figure></span></p><p class=\"\">VICTORIA, Seychelles, Feb.  05, 2025  (GLOBE NEWSWIRE) — MEXC, the world's leading cryptocurrency trading platform, announced the listing of the <strong class=\"root-Tkn6WL2y\">Berachain (BERA), </strong>scheduled for February 6, 2025, at 13:00 (UTC). The launch on MEXC will be accompanied by Airdrop+ rewards of 19,100 BERA and 50,000 USDT.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Berachain: From Meme to EVM-Identical Layer 1</strong>Berachain began as a meme, inspired by bear-themed JPEGs, and has since evolved into the creation of an innovative blockchain. It is a Layer 1 network that is both EVM-compatible and powered by a unique Proof of Liquidity (PoL) consensus mechanism. With this mechanism, validators not only stake tokens but also provide liquidity. Through its Proof of Liquidity (PoL) model, Berachain leverages active liquidity providers to secure the network, effectively turning capital into a core security resource.</p><p class=\"\">This groundbreaking approach has attracted significant financial backing, with the project raising $142 million in its latest funding round. As of January 2, the Berachain official website reports that 234 protocols are actively participating in its bArtio Testnet. BERA is a gas token, used for transactions and staking within its ecosystem.</p><p class=\"\">Berachain, powered by the BeaconKit modular consensus layer and built on the Cosmos SDK, offers flexibility for Ethereum-based blockchains. It enables developers to create both Layer-1 and Layer-2 solutions without needing to rewrite programming languages. Recently, Berachain launched Boyco, a pre-launch liquidity platform in collaboration with Enso and LayerZero, designed to address the cold start issue for new decentralized applications. Boyco's pre-deposit vaults have already reached $2.2 billion.</p><p class=\"\">Celebrate the BERA Launch with a prize pool of 19,100 BERA &amp; 50,000 USDTIn a significant show of support for Berachain and its expansive ecosystem, MEXC is set to list the new BERA token. This move not only underscores MEXC's commitment to pioneering blockchain projects but also connects users with a dynamic network that fuels cutting-edge initiatives.</p><p class=\"\">MEXC, known for quickly listing trending tokens, expands its offerings with Berachain (BERA). The BERA/USDT trading market officially launched in the Innovation Zone on February 6, 2025, at 13:00 (UTC), followed by the introduction of the BERA USDT perpetual futures at 13:10 (UTC), offering adjustable leverage from 1x to 50x with both cross and isolated margin modes.</p><p class=\"\">To celebrate the listing of Berachain (BERA) on MEXC Spot and Futures on February 6, MEXC is launching a series of exclusive activities starting on February 5, 2025, at 05:00 (UTC). Participants will have the chance to win BERA tokens, USDT bonuses, and other exciting rewards, with opportunities available for both new and experienced users.</p><p class=\"\">These activities include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Event 1: Deposit and Share 14,000 BERA (New User Exclusive)</li></ul><p class=\"\">Deposit at least 15 BERA or 100 USDT to qualify. </p><p class=\"\">Trade BERA Spot ($100) or trade BERA Perpetual Futures ($500) to earn 2 BERA each, limited to 3,500 users per activity, on a first-come, first-served basis.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Event 2: Spot Challenge — Trade to Share 1,000 BERA (Open to All Users). </li><li class=\"listItem-bmN0_SHH\">Event 3: Futures Challenge — Trade to Share 50,000 USDT in Futures Bonuses (Open to All Users). </li></ul><p class=\"\">The top 2,000 users with trading volumes over 20,000 USDT will share the reward pool, with individual rewards of up to 5,000 USDT.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Event 4: Invite New Users and Share 4,000 BERA. </strong></li><li class=\"listItem-bmN0_SHH\">Event 5: Spread the Word and Win 1,00 BERA Rewards </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Your Easiest Way to Trending Tokens</strong>MEXC aims to become the go-to platform offering the widest range of valuable crypto assets. The platform has grown its user base to 30 million by providing a diverse selection of tokens, high-frequency airdrops, and simple participation processes. In 2024, MEXC launched a total of 2,376 new tokens, including 1,716 initial listings and 605 memecoins, with total airdrop rewards exceeding $136 million.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About MEXC</strong>Founded in 2018, MEXC is committed to being \"Your Easiest Way to Crypto\". Serving over 30 million users across 170+ countries, MEXC is known for its broad selection of trending tokens, frequent airdrop opportunities, and low trading fees. Our user-friendly platform is designed to support both new traders and experienced investors, offering secure and efficient access to digital assets. MEXC prioritizes simplicity and innovation, making crypto trading more accessible and rewarding.</p><p class=\"\">MEXC Official Website｜ X ｜ Telegram ｜How to Sign Up on MEXC</p><p class=\"\">Contact:</p><p class=\"\">Lucia Hu</p><p class=\"\">PR Manager</p><p class=\"\">lucia.hu@mexc.com</p><p class=\"\">Disclaimer: This content is provided by MEXC. The statements, views and opinions expressed in this column are solely those of the content provider. The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities. Please conduct your own research and invest at your own risk.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/7423d696-0d03-4630-a1e9-69d0a78c2b2d</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">MEXC</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">MEXC</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX4gnj6Q:0-mexc-fuels-defi-innovation-and-liquidity-security-with-the-berachain-bera-listing/",
            "pub_date": "2025-02-05 17:03:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0UY:0",
            "title": "UK's Aptitude Software Group rises on \"good start to 2025\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Aptitude Software Group  jumps as much as 6.3% to 337.5p; among top pct gainer across London</p><p class=\"\">** Finance software solutions provider says recent weeks saw \"renewed momentum\" after challenging macroeconomic conditions slowed customer decision-making in 2024</p><p class=\"\">** Says annual recurring rev from its AI autonomous finance solutions up 12% y/y on a constant currency basis</p><p class=\"\">** Adds co had good start to 2025 after winning a 5.7 mln pound ($7.1 mln) contract last month from top U.S. health insurer</p><p class=\"\">** Stock gained 21% in 2024</p><p class=\"\">($1 = 0.7997 pounds)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0UY:0-uk-s-aptitude-software-group-rises-on-good-start-to-2025/",
            "pub_date": "2025-02-05 17:03:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463897:0",
            "title": "China Sees Growing Number of Private Pension Funds Sales Agencies by End-2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The number of fund sales institutions for private pensions in China rose to 52 as of the end of 2024, up from 37 as of the end of 2022, Xinhua News reported Monday. </p><p class=\"\">Data from the Asset Management Association of China showed that 19 commercial banks comprised the total, with the remainder consisting of 25 securities companies and eight independent sales institutions, according to the report.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463897:0/",
            "pub_date": "2025-02-05 17:03:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463728:0",
            "title": "Italian Private Sector Contraction Continues in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Italy's private sector activity remains in the contraction territory in January amid a slowdown in service expansion and a further decline in manufacturing output. </p><p class=\"\">The HCOB Italy Composite PMI Output Index was unchanged month over month at 49.7, Hamburg Commercial Bank and S&amp;P Global said Wednesday. </p><p class=\"\">On the services side, the PMI was 50.4, below the prior 50.7 and the consensus estimate of 50.5.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463728:0/",
            "pub_date": "2025-02-05 17:03:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0W6:0",
            "title": "India's Symphony slumps nearly 9% after swinging to quarterly loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Symphony Ltd  slump 8.6% to 1,305.45 rupees</p><p class=\"\">** Air cooler manufacturer swings to loss in Q3 on lower revenue and slightly higher costs</p><p class=\"\">** SYMP posts first loss in at least 4 years - LSEG data</p><p class=\"\">** Stock was down 2.6% before results</p><p class=\"\">** Around 1 mln shares traded in stock's busiest session in about 4 months vs 30-day avg volume of 101,000 shares</p><p class=\"\">** Analysts tracking SYMP rate it \"hold\" on avg - data compiled by LSEG</p><p class=\"\">** Stock swings to YTD loss of 3%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0W6:0-india-s-symphony-slumps-nearly-9-after-swinging-to-quarterly-loss/",
            "pub_date": "2025-02-05 17:04:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0W3:0",
            "title": "Ugandan shilling flat, to firm due to commercial bank dollar sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Ugandan shilling UGX=&gt; was unchanged on Wednesday and was seen firming, helped by commercial banks trimming their long dollar positions, traders said.</p><p class=\"\">At 0834 GMT, commercial banks quoted the shilling at 3,675/3,685, the same level as Tuesday's close. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0W3:0-ugandan-shilling-flat-to-firm-due-to-commercial-bank-dollar-sales/",
            "pub_date": "2025-02-05 17:05:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463733:0",
            "title": "Final PMI: French Private Sector Slump Eases in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">France's private sector output further declined in January, albeit at a slower pace from a month ago, final data from S&amp;P Global and Hamburg Commercial Bank showed Wednesday. </p><p class=\"\">The HCOB France Composite PMI Output Index came in at 47.6, up from 47.5 but below the flash estimate of 48.3. </p><p class=\"\">On the other hand, the services PMI tumbled to 48.2 from 49.3, against the initial reading of 48.9.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463733:0/",
            "pub_date": "2025-02-05 17:05:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463895:0",
            "title": "USPACE Technology Group's Unit to Co-Host Satellite Exhibition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">USPACE Technology Group  said its subsidiary Aspace Satellite Technology has agreed to co-host an exhibition event of its 100 satellites in different countries with the International Astronautical Federation, a Tuesday Hong Kong bourse filing said. </p><p class=\"\">The exhibition is aimed at the promotion, popularization, and awareness of innovative achievements in industrialized satellite manufacturing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463895:0/",
            "pub_date": "2025-02-05 17:05:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0C4:0",
            "title": "Czech retail sales growth strongest since 2022",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Czech retail sales climbed by 6.2% year-on-year in December, posting the strongest rise in almost three years, statistics office data showed on Wednesday.</p><p class=\"\">The pace of growth picked up from 4.2% year-on-year in November and was more than 2 percentage points above a Reuters poll forecast.</p><p class=\"\">Revived consumer demand has been the main growth driver for the Czech economy, as for other central European countries, as soft demand from euro zone trade partners weighs on the region's manufacturers.</p><p class=\"\">\"(The data) confirms the combination of low inflation and solid nominal wage growth... creates a favourable environment for the revival of retail sales and household consumption in general,\" Radomir Jac, chief economist at Generali Investments CEE, said.</p><p class=\"\">Czech retail sales have climbed each month since December 2023 after falling for around a year-and-a-half before that as high inflation crushed demand. The rise in December was the biggest since January 2022.</p><p class=\"\">In month-on-month terms, retail sales increased by 1.2% in December, the statistics office said, giving a rise for the full-year 2024 of 4.6%.</p><p class=\"\">The Czech National Bank meets on Thursday and analysts expect it to renew interest rate cuts after it paused the easing cycle in December due to lingering inflation pressures, especially in the services sector. </p><p class=\"\">The bank has cut its main rate to 4.00% from 7.00% since late 2023.</p><p class=\"\">Inflation in December accelerated less than expected, to 3.0% year-on-year, which helped increase bets on another rate cut. Preliminary price data for January will be published on Thursday morning, before the central bank's rate decision.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0C4:0-czech-retail-sales-growth-strongest-since-2022/",
            "pub_date": "2025-02-05 16:47:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0BM:0",
            "title": "Major Gulf markets ease as Trump's Gaza remarks spark concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Major stock markets in the Gulf were subdued in early trade on Wednesday, reacting to U.S. President Donald Trump's stunning statement about taking control of the war-ravaged Gaza Strip and revamping its economy once Palestinians are relocated elsewhere.</p><p class=\"\">The announcement followed Trump's shock proposal for the permanent resettlement of the more than two million Palestinians from Gaza to neighboring countries, calling the enclave - where the first phase of a fragile Israel-Hamas ceasefire and hostage release deal is in effect - a \"demolition site.\"</p><p class=\"\">Saudi Arabia's benchmark index  eased 0.1% in choppy trade, with SABIC Agri-Nutrients Company  losing 2.6%.</p><p class=\"\">The kingdom rejects any attempts to displace the Palestinians from their land and would not establish ties with Israel without the creation of a Palestinian state, Saudi Arabia's foreign ministry said.</p><p class=\"\">The United States had led months of diplomacy to get Saudi Arabia, one of the most powerful and influential Arab states, to normalise ties with Israel and recognise the country. </p><p class=\"\">Dubai's main share index  lost 0.2%, hit by a 1.1% fall in blue-chip developer Emaar Properties .</p><p class=\"\">In Abu Dhabi, the index  fell 0.1%, with the country's biggest lender First Abu Dhabi Bank  ahead of its earnings announcement.</p><p class=\"\">The United Arab Emirates' foreign trade touched 3 trillion dirhams ($817 billion) for the first time by the end of 2024, Prime Minister and Dubai ruler Sheikh Mohammed bin Rashid Al Maktoum said in a post on X on Wednesday.</p><p class=\"\">Meanwhile, the UAE's non-oil private sector continued to expand robustly at the start of 2025, although capacity pressures and competitive challenges posed headwinds, a survey showed on Wednesday.</p><p class=\"\">The Qatari benchmark  lost 0.3%, with the Gulf's biggest lender Qatar National Bank  dropping 0.5%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0BM:0-major-gulf-markets-ease-as-trump-s-gaza-remarks-spark-concerns/",
            "pub_date": "2025-02-05 16:47:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002486:0",
            "title": "MotorK Announces Lower-Than-Expected Q4 and FY 2024 CARR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MotorK Announces Lower-Than-Expected Q4 and FY 2024 CARR</p><p class=\"\">LONDON--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Regulatory News:</p><p class=\"\">MotorK PLC (AMS: MTRK) (\"MotorK\", the \"Group\" or the \"Company\"), a leading SaaS provider to the automotive retail industry in the EMEA region, today announced that its Committed Annual Recurring Revenues(1) (CARR) for the fourth quarter 2024 and the full financial year 2024 are lower than previously expected.</p><p class=\"\">European automotive uncertainty and macroeconomics have influenced decision-making among large retailers and manufacturers, impacting MotorK's CARR in two key ways:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Several high-value deals originally expected to close by year-end 2024   have been deferred into 2025 and remain under negotiation.     </li><li class=\"listItem-bmN0_SHH\">Client-signed and yet-to-be-delivered deals have experienced delays or   have been subject to renegotiation.   </li></ul><p class=\"\">In response, MotorK has adopted a more conservative criteria of CARR to better reflect the evolving business environment. This adjustment has resulted in a reduction in reported CARR, with deals that no longer meet the revised criteria being reclassified into the company's pipeline. As a result:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">MotorK's CARR for the fiscal year ending 31 December 2024 are expected   to be approximately 15% below the guidance of EUR 45-50 million, as   previously communicated.     </li><li class=\"listItem-bmN0_SHH\">MotorK's sales pipeline exceeded EUR24 million on 31 December 2024,   reinforcing the company's strong commercial momentum and future revenue   potential.   </li></ul><p class=\"\">MotorK remains confident in its long-term growth strategy and continues to execute on its commitment to driving innovation and delivering value to its customers and shareholders.</p><p class=\"\">Forward-looking information and disclaimer</p><p class=\"\">This press release may include forward-looking statements. Other than reported financial results and historical information, all statements included in this press release, including, without limitation, those regarding our financial position, business strategy and management plans and objectives for future operations, may be deemed to be forward-looking statements. Without limitation, any statements preceded or followed by or that include the words \"targets\", \"plans\", \"believes\", \"expects\", \"aims\", \"intends\", \"anticipates\", \"estimates\", \"projects\", \"will\", \"may\", \"would\", \"could\" or \"should\", or words or terms of similar substance or the negative thereof, are forward-looking statements. These forward-looking statements are based on our current expectations, projections and key assumptions about future events and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements. Many of these risks and uncertainties relate to factors that are beyond MotorK's ability to control or estimate precisely, such as future market conditions, the behavior of other market participants and the actions of governmental regulators. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release and are subject to change without notice. Other than as required by applicable law or the applicable rules of any exchange on which our securities may be traded, we expressly disclaim any obligation or undertaking to update or revise publicly any forward-looking statements, whether because of new information, future events or otherwise.</p><p class=\"\">Important information</p><p class=\"\">This press release contains information within the meaning of Article 7(1) of the Market Abuse Regulation (596/2014).</p><p class=\"\">ABOUT MOTORK PLC</p><p class=\"\">MotorK (AMS: MTRK) is a leading software as a service (\"SaaS\") provider for the automotive retail industry in the EMEA region, with approximately 400 employees and ten offices in seven countries (Italy, Spain, France, Germany, Belgium, the UK, and Israel). MotorK empowers car manufacturers and dealers to improve their customer experience through a broad suite of fully integrated digital products and services. MotorK provides its customers with an innovative combination of digital solutions, SaaS cloud products and the largest R&amp;D department in the automotive digital sales and marketing industry in Europe. MotorK is a company registered in England and Wales. Registered office: 5th Floor One New Change, London, England, EC4M 9AF - Company Registration: 9259000. For more information: www.motork.io or investors.motork.io.</p><p class=\"\">(1) Committed ARR (\"CARR\") includes ARR and Committed Recurring Revenues (\"CRR\"). CRR refers to signed contracts to be delivered and billed. Annual Recurring Revenues (\"ARR\") are defined as the yearly subscription value of the customer base at the end of the reporting period.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205207682/en/</p><p class=\"\">CONTACT:    FOR FURTHER INFORMATION</p><p class=\"\">MotorK Investor Relations</p><p class=\"\">Boaz Zilberman</p><p class=\"\">boaz.zilberman@motork.io</p><p class=\"\">+972 532 819 810</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002486:0/",
            "pub_date": "2025-02-05 16:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463886:0",
            "title": "Kingkey Financial International Extends the Completion Date for Completing Proposed Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kingkey Financial International (Holdings)  extended the completion date to Feb. 11 to allow for the completion of its proposed acquisition of the target company's sale shares, according to a Tuesday filing with the Hong Kong bourse. </p><p class=\"\">Initially, four business days were needed after fulfilling conditions on Jan. 24 to allow more time for administrative procedures. All other terms of the agreement remain unchanged.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463886:0/",
            "pub_date": "2025-02-05 16:48:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0TZ:0",
            "title": "Vestas slides after 2025 profit guidance misses expectation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Vestas  slip around 3% after the Danish wind turbine maker guided for a lower than expected profit in 2025, despite Q4 results coming in above</p><p class=\"\">** It sees operating profit margin before special items of 4-7% in 2025, which Jefferies says is around 130 basis points below expectations at mid-point</p><p class=\"\">** J.P.Morgan also notes that the guidance for service-adjusted EBIT of 700 mln euros came in below the estimate of 737 million</p><p class=\"\">** \"This may bring some disappointment to bulls who were hoping for a positive surprise given it was not that long ago Vestas was aiming for a 10% margin in 2025,\" it says</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0TZ:0-vestas-slides-after-2025-profit-guidance-misses-expectation/",
            "pub_date": "2025-02-05 16:48:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463883:0",
            "title": "Kyushu Railway Records 8% Lower Attributable Net Income for Nine Months to December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kyushu Railway  recorded a net income attributable to owners of the parent of 37.4 billion yen for the nine months ended Dec. 31, 2024, 8.2% lower than 40.7 billion yen logged for the same period a year ago. </p><p class=\"\">The company's basic net income per share for the reporting period decreased to 238.81 yen from 259.19 yen per share a year ago, according to a Tuesday filing with the Tokyo Exchange. </p><p class=\"\">Operating revenue of the rail services company came in at 321.9 billion yen, 9.9% higher than 292.9 billion yen a year earlier. </p><p class=\"\">It forecasted an attributable net income of 42.2 billion yen, net income per share of 269.46 yen, operating revenue of 441.1 billion yen, and a final dividend of 46.50 yen per share for the fiscal year ending March. 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463883:0/",
            "pub_date": "2025-02-05 16:48:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0RS:0",
            "title": "OpenAI's Altman meets with India IT minister to discuss country's AI plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    OpenAI Chief Executive Sam Altman met with India's IT Minister Ashwini Vaishnaw on Wednesday and discussed India's plan of creating a low-cost AI ecosystem.</p><p class=\"\">Vaishnaw said in a post on X that he had a \"super cool discussion\" with Altman on India's \"strategy of creating the entire AI stack - GPUs, model, and apps\" and that OpenAI was willing to collaborate on all three.</p><p class=\"\">Altman's India visit, his first since 2023, comes at a time when the company faces legal challenges in the country, its second-largest market by number of users.</p><p class=\"\">Vaishnaw last week praised Chinese startup DeepSeek for shaking up the sector with its low-cost AI assistant, likening its frugal approach to his government's efforts to build a localised AI model.</p><p class=\"\">\"Our country sent a mission to the moon at a friction of the cost that many other countries did right, why can't we do a model that will be a fraction of the cost that many others do?\" Vaishnaw said in a video of part of the discussion with Altman that he posted.</p><p class=\"\">Altman's trip to India follows visits to Japan and Korea. He clinched deals with SoftBank Group  and Kakao . In Seoul, he also held talks with SoftBank and Samsung about the Stargate AI data centre project that has been backed by U.S. President Donald Trump.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0RS:0-openai-s-altman-meets-with-india-it-minister-to-discuss-country-s-ai-plans/",
            "pub_date": "2025-02-05 16:48:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW024:0",
            "title": "Spain's Competition Watchdog Fines Endesa, Naturgy For Omitting Relevant Information In Bills",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SPAIN'S COMPETITION WATCHDOG CNMC: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FINES ENDESA  AND NATURGY  1.2 MILLION EUROS FOR OMITTING RELEVANT INFORMATION FOR CONSUMERS IN THEIR BILLS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ENDESA ENERGIA AND NATURGY IBERIA WERE FINED 600,000 EUROS EACH</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW024:0-spain-s-competition-watchdog-fines-endesa-naturgy-for-omitting-relevant-information-in-bills/",
            "pub_date": "2025-02-05 16:48:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0BS:0",
            "title": "Huawei chairman says 2024 revenue exceeded $118 bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Huawei's chairman said on Wednesday that the tech company's annual revenue exceeded 860 billion yuan ($118.27 billion) last year, as it continued to shake off the impact of U.S. sanctions and its consumer business returned to growth. </p><p class=\"\">Liang Hua made the remarks at a forum in Guangzhou, according to a report by the Shenzhen Business Daily, which was confirmed by a Huawei spokesperson.</p><p class=\"\">Annual revenue of 860 billion yuan would mark 22% year-on-year-growth from 2023, when Huawei reported 704.2 billion yuan in revenue. The company also reported its fastest growth in four years that year. </p><p class=\"\">\"In 2024, Huawei's overall operations will meet expectations, ICT infrastructure will remain stable, consumer business will return to growth, and the smart car solution business will develop rapidly, with annual sales revenue exceeding 860 billion yuan,\" Liang was quoted as saying. </p><p class=\"\">Huawei's consumer business has made a strong comeback since August 2023, when it launched new phones with locally-made chipsets that defied U.S. sanctions. Last year, it grabbed a 16% share of the Chinese smartphone market, overtaking Apple , according to data from Canalys. </p><p class=\"\">($1 = 7.2715 Chinese yuan renminbi)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0BS:0-huawei-chairman-says-2024-revenue-exceeded-118-bln/",
            "pub_date": "2025-02-05 16:49:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002500:0",
            "title": "Pandora's Results Are a Mixed Bag — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pandora's results are broadly mixed, with 4Q performance in line with expectations but guidance softer than anticipated, RBC Capital Markets analyst Piral Dadhania says in a note. The Danish jeweler reported revenue of 11.97 billion Danish kroner ($1.67 billion) for the final quarter of 2024, up 11% organically on year. Analysts had forecast revenue of 11.85 billion kroner, according to company-compiled consensus. However, the group's guidance of organic revenue growth between 7% and 8% in 2025 is slightly softer than expected, which could prompt low-single-digit earnings revisions, the analyst says. The company expects the EBIT margin target by 2026 at the lower end of the 26% to 27% range, which will likely be received with some caution, Dadhania says. Shares are down 1.3% at 1,356.50 kroner. (andrea.figueras@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002500:0/",
            "pub_date": "2025-02-05 16:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0UH:0",
            "title": "Bechtle jumps as Q4 profitability surprises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Bechtle  jump 4% after the German IT service provider posts a 'positive surprise' in terms of Q4 profitability, citing a slight uptick in momentum, particularly in December</p><p class=\"\">** \"We want to highlight the pick-up of the business volume momentum that increased by approximately 4% yoy,\" Baader Helvea says</p><p class=\"\">** \"Profitability surprises positively,\" Jefferies says</p><p class=\"\">** The broker says the results suggest the worst is likely behind, adding though the first half of 2025 will remain tough due to snap elections in Germany</p><p class=\"\">** The stock sits at the top of the German mid-cap index , with shares on track for the best day in a year</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0UH:0-bechtle-jumps-as-q4-profitability-surprises/",
            "pub_date": "2025-02-05 16:50:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWT0:0",
            "title": "French service sector downturn deepens in January, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    France's service sector contracted faster than first estimated in January, with business activity declining for the fifth consecutive month amid persistent demand weakness and political uncertainty, a survey reported on Wednesday.</p><p class=\"\">The HCOB France Services Purchasing Managers' Index (PMI), compiled by S&amp;P Global, fell to 48.2 in January from 49.3 in December, moving further below the 50.0 threshold that separates growth from contraction. January's flash services PMI had come in at 48.9 points.</p><p class=\"\">Weaker client demand and political uncertainty were cited as factors weighing on output.</p><p class=\"\">\"Political uncertainty dampened activity, according to some panel members, while others attributed the slowdown to weaker customer demand and reduced confidence in the economic outlook,\" said Tariq Kamal Chaudhry, economist at Hamburg Commercial Bank.</p><p class=\"\">France has been mired in political instability since President Emmanuel Macron called a snap election last June that delivered a hung parliament just as an unexpected hole in the public finances emerged.</p><p class=\"\">Employment in the services sector in January fell at the fastest rate since October 2020, with companies citing the non-replacement of voluntary leavers and expiration of temporary contracts as reasons for job cuts. </p><p class=\"\">Business confidence sank to a 56-month low, reflecting uncertainty over the domestic political climate.</p><p class=\"\">Despite intensifying cost pressures, with input prices rising at the quickest pace in five months, service providers cut their prices for the first time since April 2021, driven by lower interest rates and efforts to remain competitive.</p><p class=\"\">The survey also highlighted a modest decline in new business, with export orders showing signs of stabilisation.</p><p class=\"\">However, firms remained cautious about the outlook, with expectations for future activity at their weakest since May 2020.</p><p class=\"\">The French government faces pressure to create political stability to prevent further disruptions in the labour market, as noted by Chaudhry.</p><p class=\"\">The final composite PMI figure for January - which comprises both the services and manufacturing sectors - was also several notches lower than first thought, at 47.6 points from 47.5 points in December and 48.3 points initially estimated. It is also below the 50-threshold for a fifth month in a row.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWT0:0-french-service-sector-downturn-deepens-in-january-pmi-shows/",
            "pub_date": "2025-02-05 16:50:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0YJ:0",
            "title": "Trump vows to take over Gaza",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    President Donald Trump said the United States would take over war-ravaged Gaza and create a \"Riviera of the Middle East\" after resettling Palestinians elsewhere, shattering decades of U.S. policy on the Israeli-Palestinian conflict.</p><p class=\"\">The shock move drew swift condemnation from regional heavyweight Saudi Arabia which Trump hopes will establish ties with Israel.</p><p class=\"\">Israel's shekel currency was largely flat against the dollar on Wednesday, trading at 3.56 versus the dollar . Israeli and Lebanese sovereign bonds were flat to higher, while those of Jordan and Egypt were flat to lower.</p><p class=\"\">COMMENTS:</p><p class=\"\">MODI SHAFRIR, CHIEF STRATEGIST FOR FINANCIAL MARKETS, BANK HAPOALIM, TEL AVIV:</p><p class=\"\">    \"The risks to Israel will decline in the short term and that’s good for the shekel and local markets and also since it appears the coalition will not fall apart.\"  </p><p class=\"\">ALEX ZABEZHINSKY, CHIEF ECONOMIST, MEITAV DASH BROKERAGE, TEL AVIV:</p><p class=\"\">\"The markets are reacting in a subdued manner. The gap between the announced plans and their implementation is too great to react to the news in a meaningful way.\"</p><p class=\"\">PAUL DONOVAN, CHIEF ECONOMIST, UBS GLOBAL WEALTH MANAGEMENT, LONDON:</p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area.\"</p><p class=\"\">YONIE FANNING, CHIEF STRATEGIST, MIZRAHI TEFAHOT BANK, TEL AVIV:</p><p class=\"\">\"We're seeing a positive market response to the initiative, this morning in the shekel, and also and at the opening of the TASE (Tel Aviv stock exchange). The equity response being primarily centred around banks gives a good example on how such a geopolitical improvement could tame local risks and support the local economy.\"</p><p class=\"\">DAVID MAKOVSKY, DIRECTOR OF THE PROGRAM ON ARAN-ISRAEL RELATIONS, WASHINGTON INSTITUTE OF NEAR EAST POLICY (ON X):</p><p class=\"\">\"Until the WH (White House) press conference, (Trump's)</p><p class=\"\">call for moving Gazans was seen largely as a negotiating ploy: maximalist opening position before reaching a deal--standard operating approach. </p><p class=\"\">\"Is this still the case? If no longer true, there will be a clamour for the WH to provide more of a blueprint of his proposal on a variety of levels so it is not dismissed. Yet, in immediate sense, Trumps remarks seems to shift media focus away from question of Phase Two of Ceasefire that is supposed to begin later this month. Overlooked, with focus on Trump, is that PM @netanyahu made clear at the press conference Israel would resume the fight against Hamas.\"</p><p class=\"\">FRANCESCO PESOLE, FX STRATEGIST, ING, LONDON:</p><p class=\"\">\"Markets are treating Trump’s announced intention to take over the Gaza Strip and evacuate Palestinians to neighbouring countries with scepticism. Should we see hints that the U.S. is planning to deploy troops in the Middle East, the market implications can be risk-off, oil-positive and dollar-positive, as Arab nations should firmly oppose the move.\"</p><p class=\"\">ALVIN TAN, HEAD OF ASIA FX STRATEGY, RBC CAPITAL MARKETS, SINGAPORE:</p><p class=\"\">\"There’s no discernible reaction. I think in general people are quite skeptical. Number one, those comments came out of nowhere. It upends long standing US policy. In general people are thinking he was just making comments off the cuff and this is not likely to be followed up as genuine U.S. foreign policy.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0YJ:0-trump-vows-to-take-over-gaza/",
            "pub_date": "2025-02-05 16:50:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0VR:0",
            "title": "Iceland's central bank cuts policy interest rate to 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Iceland's central bank cut its key policy interest rate to 8.0% from 8.5% on Wednesday and said inflation has continued to fall.</p><p class=\"\">\"Underlying inflation has eased ... and is at its lowest in three years. The outlook is for continued disinflation in coming months,\" the bank's monetary policy committee said in a statement.</p><p class=\"\">    Wednesday's cut was the third     since October    , when the central bank began an easing cycle from a high of 9.25%.  </p><p class=\"\">    The bank had been raising the cost of borrowing since mid-2021 to tackle inflation, lifting the main rate from a low of 0.75%.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0VR:0-iceland-s-central-bank-cuts-policy-interest-rate-to-8/",
            "pub_date": "2025-02-05 16:41:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0FU:0",
            "title": "Weak macro, less contracts to hit 'volatile' Worldline, JPM says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** J.P. Morgan sees Worldline  entering H1 this year burdened by weak consumer market growth in Europe and contract losses, expecting lower earnings across the board</p><p class=\"\">** It urges the French payments group to finalise its decision on company leadership, with a new strategic plan following</p><p class=\"\">** \"Till that strategic plan is announced, the stock is going to remain volatile and is unlikely to substantially break out of its range,\" JPM says</p><p class=\"\">** Only a turnaround in consumer markets or major contract wins for Worldline can change the sentiment, it adds</p><p class=\"\">** Broker sharply cuts its TP by 40% to 8.10 euros ($8.41) from 13.50 euros to adjust to its updated near-term result forecasts</p><p class=\"\">** Out of 21 analysts that cover Worldline, five rate the stock \"strong buy\" or \"buy,\"​ 14 \"hold\" and two​ rate the stock \"strong sell\" or \"sell\"</p><p class=\"\">($1 = 0.9627 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0FU:0-weak-macro-less-contracts-to-hit-volatile-worldline-jpm-says/",
            "pub_date": "2025-02-05 16:42:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002453:0",
            "title": "LG CNS Makes Weak Debut in South Korea — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">LG CNS, an information-technology services affiliate of conglomerate LG Group, made a weak debut in South Korea after the country's biggest initial public offering in three years.</p><p class=\"\">The lackluster listing reflects South Korea's sluggish IPO market and the gloom in the wider equities market. The stock benchmark Kospi has been down more than 3% over the past 12 months.</p><p class=\"\">Shares of LG CNS fell 9.9% to close at 55,800 won, equivalent to $38.44, after opening at 60,500 won in their first day of trading on the Kospi stock exchange Wednesday. The Kospi ended 1.1% higher.</p><p class=\"\">Throughout the session, the shares remained below their IPO price of 61,900 won, the top end of their marketed price rage.</p><p class=\"\">The company, through an oversubscribed share sale in January, raised around $825 million. That marked the largest IPO in South Korea since 2022, when battery maker LG Energy Solution raised more than $10 billion.</p><p class=\"\">LG CNS's estimated market value shrank to $3.72 billion from $4.13 billion over the course of the day after the stock's poor performance.</p><p class=\"\">The IPO market has been sluggish since the second half of 2024 in South Korea, Seoul-based Samsung Securities analyst Changhe Lee said in a recent note.</p><p class=\"\">Most of the country's newly listed companies in January set their IPO prices at the bottom of marketed ranges, and their shares opened below their IPO price, he said.</p><p class=\"\">LG CNS said it plans to use the offering's proceeds for facility investments, acquisitions of other IT firms and debt repayment.</p><p class=\"\">Revenue at the company rose 13% to 5.605 trillion won in 2023, while operating profit was up 12% at 464.05 billion won.</p><p class=\"\">LG Corp., the holding company for LG Group, has a 45% stake in LG CNS.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002453:0/",
            "pub_date": "2025-02-05 16:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463866:0",
            "title": "Hanwha Ocean Delivers Wind Turbine Vessel to Denmark-based Cadeler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hanwha Ocean  delivered Wind Maker, an offshore wind turbine installation vessel (WTIV) to Denmark-based construction engineering company Cadeler on Jan. 31, a month ahead of schedule, Hanwha Ocean said in a LinkedIn post on Tuesday. </p><p class=\"\">The Wind Maker, a 148-meter-long vessel with a lifting capacity of 2,600 metric tons, can install five 15-megawatt turbines in waters up to 65 meters deep. The vessel will begin its initial operations at Taiwan's Changhua country offshore windfarm, according to the post. </p><p class=\"\">Shares of Hanwha Ocean fell more than 1% at market close on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463866:0/",
            "pub_date": "2025-02-05 16:43:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}