{
    "data": [
        {
            "id": "DJN_DN20250204012935_20250204012935:0",
            "title": "News On Horizon Space Acquisition II Corp. (HSPTU) Now Under HSPT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012935_20250204012935:0/",
            "pub_date": "2025-02-05 06:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012928_20250204012928:0",
            "title": "News On Brightcove Inc. (BCOV) Now Under BDGS.YY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012928_20250204012928:0/",
            "pub_date": "2025-02-05 06:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012927:0",
            "title": "IPC Indice de Precios Y Cotizaciones Ends 1.33% Higher at 51889.75 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The IPC Indice de Precios Y Cotizaciones is up 680.22 points or 1.33% today to 51889.75</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one-day point gain since Monday, Dec. 9, 2024</li><li class=\"listItem-bmN0_SHH\">Largest one-day percentage gain since Tuesday, Dec. 31, 2024</li><li class=\"listItem-bmN0_SHH\">Up nine of the past 11 trading days</li><li class=\"listItem-bmN0_SHH\">Off 11.62% from its record close of 58711.87 hit Wednesday, Feb. 7, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the second highest this year</li><li class=\"listItem-bmN0_SHH\">Off 11.62% from its 52-week high of 58711.87 hit Wednesday, Feb. 7, 2024</li><li class=\"listItem-bmN0_SHH\">Up 6.25% from its 52-week low of 48837.72 hit Monday, Dec 30, 2024</li><li class=\"listItem-bmN0_SHH\">Down 11.57% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.31% from its 2025 closing high of 52050.25 hit Thursday, Jan 30, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.99% from its 2025 closing low of 48957.24 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 2376.48 points or 4.80%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012927:0/",
            "pub_date": "2025-02-05 06:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012934:0",
            "title": "Goodyear Tire Reaches Deal With Union to Cut 850 Jobs Amid Turnaround",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Goodyear Tire &amp; Rubber is cutting 850 positions at its tire manufacturing facility in Danville, Va. as part of a wider plan to reduce production capacity and costs per tire in the Americas.</p><p class=\"\">The Akron, Ohio-based tire-maker on Tuesday said that the reduction in the workforce, which affects associates and contracted workers, follows an agreement with the United Steelworkers union.</p><p class=\"\">The Danville plant will continue to produce aviation tires and conduct mixing operations, the company said in a Securities and Exchange Commission filing.</p><p class=\"\">Overall, Goodyear Tire &amp; Rubber expects the cuts to be substantially completed by the end of the year. It also forecasts total pre-tax costs associated with the plan in the range of $130 million to $140 million.</p><p class=\"\">The company expects to record about $100 million of these charges in the first quarter, and $40 million throughout the reminder of 2025.</p><p class=\"\">Goodyear Tire &amp; Rubber is expected to post fourth-quarter earnings on Thursday. In the latest quarter, the company posted a 6.2% drop in sales to $4.82 billion after seeing its tire unit volumes down around 8%, and raised its expectations for cost savings under a turnaround plan.</p><p class=\"\">The company then said it was targeting gross run-rate gains from its Goodyear Forward program, announced in November 2023, of $1.5 billion by the end of 2025. The company's original target was $1.3 billion in run-rate benefits.</p><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012934:0/",
            "pub_date": "2025-02-05 06:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012929:0",
            "title": "Bovespa Index Ends 0.65% Lower at 125147.42 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bovespa Index is down 823.04 points or 0.65% today to 125147.42</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one-day point and percentage decline since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Down for three consecutive trading days</li><li class=\"listItem-bmN0_SHH\">Down 1765.36 points or 1.39% over the last three trading days</li><li class=\"listItem-bmN0_SHH\">Largest three-day point and percentage decline since Friday, Jan. 10, 2025</li><li class=\"listItem-bmN0_SHH\">Down eight of the past 10 trading days</li><li class=\"listItem-bmN0_SHH\">Off 8.88% from its record close of 137343.96 hit Wednesday, Aug. 28, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 8.88% from its 52-week high of 137343.96 hit Wednesday, Aug. 28, 2024</li><li class=\"listItem-bmN0_SHH\">Up 5.58% from its 52-week low of 118532.68 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Down 4.04% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.39% from its 2025 closing high of 126912.78 hit Thursday, Jan 30, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.58% from its 2025 closing low of 118532.68 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 4864.02 points or 4.04%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012929:0/",
            "pub_date": "2025-02-05 06:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:d0b197cc7e59f:0",
            "title": "HAMMER FIBER OPTICS HOLDINGS CORP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hammer Fiber Optics Holdings Corp, a company focused on financial services technology and wireless telecommunications infrastructure, has released its annual 10-K report. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces as it transitions towards a fintech-centric business model.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenues:</strong> $3.28 million, an increase of approximately $23,335 or 0.7% from the previous year, primarily due to the expansion of the Company's Over-the-Top ('OTT') business segment.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Margin:</strong> $881,279, reflecting an improvement from the previous year due to cost management and revenue growth.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Loss from Operations:</strong> $(1.39) million, indicating an increase in operating expenses due to diversification into financial services and expansion of telecommunications.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Loss:</strong> $(1.23) million, a decrease from the previous year's loss of $(2.58) million, attributed to reduced other expenses and selling, general, and administrative expenses.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Basic and Diluted Loss Per Share:</strong> $(0.02), showing an improvement from the previous year's $(0.04) per share.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Corporate History and Background:</strong> Hammer Technology Holdings Corp, originally incorporated as Recursos Montana S.A. in 2010, has undergone several transformations, including mergers and acquisitions, to focus on financial services technology and wireless telecommunications infrastructure.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Current Operations:</strong> The company is now focused on sustainable shareholder value through investments in financial services technology and wireless telecommunications infrastructure. Its financial technologies business is centered around the HammerPay mobile payments platform, which facilitates digital commerce in developing markets.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Telecommunications Strategy:</strong> Hammer's telecommunications strategy, branded as 'Everything Wireless', includes the development of high-speed fixed wireless services for various client segments using its Hammer Wireless AIR® platform, along with mobility networks and Over-the-Top services.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Discontinued Operations:</strong> The company has discontinued operations of Hammer Wireless (SL) Limited in Sierra Leone and Open Data Centers LLC, reflecting a strategic shift away from certain telecommunications operations.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Divestiture of Telecommunications Assets:</strong> In 2024, Hammer Technology Holdings Corp sold its telecommunications assets, including 1st Point Communications LLC and its subsidiaries, to Viper Networks, Inc., to focus on fintech initiatives.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> With the divestiture of telecommunications assets, the company is concentrating on its fintech initiatives, particularly the HammerPay platform, which is designed for global deployment in both developed and emerging markets.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Employee Structure:</strong> The company currently employs ten individuals, with six full-time and four part-time employees, indicating a lean operational structure.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments:</strong> The company's revenue growth is attributed to the expansion of its Over-the-Top business segment, which includes SMS messaging and hosting services.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Management's Discussion and Analysis:</strong> The management has highlighted the company's diversification into financial services markets and the expansion of its telecommunications business segment as key drivers of increased operating expenses.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives:</strong> Hammer Technology Holdings Corp. has focused on divesting its telecommunications assets to Viper Networks, Inc., which includes 1st Point Communications LLC and its subsidiaries, Endstream Communications LLC, American Networks Inc., and a 10% ownership in Wikibuli Inc. This strategic move allows the company to concentrate its efforts on its fintech initiatives, particularly the HammerPay platform, which is designed for global deployment in both developed and emerging markets.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Capital Management:</strong> The company has been actively managing its capital through various financing activities. It has relied on convertible notes and related party loans to finance operations. Notably, the company entered into a loan agreement with a board member for $791,546 to pay off a promissory note to Mast Hill Fund L.P. Additionally, the company has issued shares as part of its financing strategy, including 475,000 shares related to the Mast Note amendment. The company has not paid any dividends and does not plan to in the foreseeable future, opting instead to reinvest earnings into business operations.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> Looking ahead, Hammer Technology Holdings Corp. plans to continue focusing on its fintech initiatives, leveraging the HammerPay platform to drive growth. The company intends to rely on equity sales to fund operations and development activities, acknowledging the potential for shareholder dilution. The company also aims to address its going concern status by seeking additional capital through debt and equity financing until it achieves sustainable revenue generation.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges and Risks</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Market Risks:</strong> The rapidly changing technology landscape and evolving industry standards could adversely affect the company's ability to compete and succeed. Economic downturns and market declines could also harm the business.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Risks:</strong> The company is dependent on its ability to develop new products and secure adequate spectrum for service deployment. Additionally, the violation of labor laws by manufacturers and suppliers could disrupt operations and damage the company's reputation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Regulatory Risks:</strong> Compliance with changing regulations related to corporate governance and public disclosure increases operational costs and the risk of noncompliance.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Financial Risks:</strong> There is substantial doubt about the company's ability to continue as a going concern due to consistent losses and reliance on external financing.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Security Risks:</strong> The company is vulnerable to IT system disruptions and data breaches, which could lead to competitive harm and legal liabilities.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Management's Discussion and Analysis:</strong> The company has identified several challenges in its financial condition and results of operations, including the need for additional financing to address the working capital deficit and accumulated losses, highlighting the risk of remaining a going concern.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1539680/000106299325001652/form10k.htm\" rel=\"nofollow\" target=\"_blank\">HAMMER FIBER OPTICS HOLDINGS CORP [ HMMR ] - 10-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:d0b197cc7e59f:0-hammer-fiber-optics-holdings-corp-sec-10-k-report/",
            "pub_date": "2025-02-05 06:08:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV1FA:0",
            "title": "Colombia central bank revises up 2025 inflation outlook to 4.1%, from previous 3.1%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The technical team of Colombia's central bank hiked its inflation forecast for this year to 4.1%, from a previous estimate of 3.1%, it said in a quarterly report published on Tuesday.</p><p class=\"\">The new estimate - greater than the central bank's long-term inflation goal of 3% - comes amid greater pressure on prices due to expectations the Colombian peso will depreciate against the dollar, as well as a sharp 9.54% increase to the Colombian minimum wage this year.</p><p class=\"\">The technical team - whose considerations are taken into account by the central bank's board members ahead of monetary policy decisions - forecast inflation to close 2026 at 3%.   </p><p class=\"\">\"In 2025 and 2026 total inflation will continue its process of converging toward the target, though more slowly that predicted in (the previous report) in October,\" the report said, adding slower convergence would be due to increases in the minimum wage, external fiscal context pushing the exchange rate upward, among other factors.</p><p class=\"\">According to the median of a recent Reuters poll, the central bank could lower its benchmark rate to close 2025 at 7%, before making further cuts in 2026 to bring it to 6%.</p><p class=\"\">Uncertainty about inflation and the country's fiscal outlook led the monetary policy authority to hold the rate stable at 9.50% last week, the first pause in its cycle of cuts that began in December 2023.</p><p class=\"\">During that meeting, bank board chief Leonardo Villar said the technical team had cut its economic growth forecast for 2024 to 1.8%, from a previous 1.9%, and revised its estimate for this year to 2.6%, compared to a previous estimate of 2.9%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV1FA:0-colombia-central-bank-revises-up-2025-inflation-outlook-to-4-1-from-previous-3-1/",
            "pub_date": "2025-02-05 06:08:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309421:0",
            "title": "Voya Financial Q4 Adjusted Operating Earnings Fall, Revenue Increases",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Voya Financial  reported Q4 adjusted operating earnings Tuesday of $1.40 per diluted share, down from $1.63 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.72. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $2.01 billion, up from $1.82 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $1.89 billion. </p><p class=\"\">Shares of Voya Financial surged nearly 7% in after-hours trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309421:0/",
            "pub_date": "2025-02-05 06:08:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309442:0",
            "title": "Groupe Dynamite Brief: Announcing comparable store sales growth of 9.5% For Q4 2024 and comparable store sales growth of 12.3% for the full fiscal year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309442:0/",
            "pub_date": "2025-02-05 06:08:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309430:0",
            "title": "FMC Q4 Adjusted Earnings, Revenue Rise; 2025 Outlook Issued -- Shares Tumble After Hours",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FMC  reported Q4 adjusted earnings late Tuesday of $1.79 per diluted share, up from $1.07 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.60. </p><p class=\"\">Revenue for the quarter ended Dec.31 was $1.22 billion, up from $1.15 billion a year earlier. Analysts surveyed by FactSet expected $1.32 billion. </p><p class=\"\">The company expects Q1 adjusted EPS of $0.05 to $0.15 on revenue of $750 million to $800 million. Analysts expect EPS of $0.77 on revenue of $957.4 million. </p><p class=\"\">FMC also said that it expects full-year 2025 adjusted EPS of $3.26 to $3.70 on revenue between $4.15 billion and $4.35 billion. Analysts expect EPS of $4.35 on revenue of $4.39 billion. </p><p class=\"\">Shares of the company tumbled about 16% in recent after-hours trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309430:0/",
            "pub_date": "2025-02-05 06:08:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446626:0",
            "title": "Australia's Private Sector Continues Modest Expansion for Fourth Straight Month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Flash Australia PMI Composite Output Index increased to 51.1 in January from 50.2 in December, indicating modest growth in Australia's private sector activity.</p><p class=\"\">Both manufacturing and services sectors experienced output growth for the first time since late 2022, with manufacturing returning to expansion.</p><p class=\"\">New order growth remained strong in the services sector, although manufacturing saw a decline in new orders.</p><p class=\"\">Employment rose again, and inflationary pressures also picked up during the month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446626:0-australia-s-private-sector-continues-modest-expansion-for-fourth-straight-month/",
            "pub_date": "2025-02-05 06:10:18",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV26T:0",
            "title": "FMC Corp forecasts first-quarter revenue below estimates, shares dive",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Agrichemicals producer FMC Corp  forecast first-quarter revenue below Wall Street estimates on Tuesday, owing to weak demand, sending its shares down over 20% in after-market trading.</p><p class=\"\">The company's sales volume is expected to be lower as customers in various countries continue to reduce inventory and purchases are made cautiously by retailers and growers amid lower commodity prices, the company said.</p><p class=\"\">High inventory levels of crop chemicals in multiple regions have been putting pressure on the earnings of insecticide and fungicide producers such as FMC.</p><p class=\"\">FMC is one of the largest crop-protection product makers in the United States and competes with industry giants such as Syngenta, as well as German firms BASF  and Bayer  in the agricultural chemicals sector.</p><p class=\"\">The company, however, beat Wall Street's fourth-quarter profit expectations, helped by higher sales volumes, especially in the United States, and lower costs.</p><p class=\"\">\"While we saw a good increase in volume, the growth was below our expectations as we learned during the quarter that customers in many countries sought to hold significantly less inventory than they have historically. This dynamic, along with more pronounced FX impacts, acted as a headwind to further growth,\" CEO Pierre Brondeau said in a statement.</p><p class=\"\">The herbicide maker forecast first-quarter 2025 revenue in the range of $750 million to $800 million. Analysts' expectations were of $963.7 million.</p><p class=\"\">First-quarter adjusted earnings are expected to be in the range of $0.05 to $0.15 per share, compared to estimates of $0.83 per share.    </p><p class=\"\">The Philadelphia-based company posted an adjusted profit of $1.79 cents per share for the three months ended Dec. 31, compared with analysts' average estimate of $1.6 cents per share, according to data compiled by LSEG.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV26T:0-fmc-corp-forecasts-first-quarter-revenue-below-estimates-shares-dive/",
            "pub_date": "2025-02-05 06:10:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463561:0",
            "title": "Market Chatter: Westpac Banking Invests AU$10 Million in Lawpath to Grow Small Business Lending",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Westpac Banking  has made an AU$10 million investment in legal services provider Lawpath to give its customers basic legal services for a year as part of its strategy to grow its small business lending, the Australian Financial Review reported Tuesday. </p><p class=\"\">The deal will provide customers with a year-long subscription to access an archive of legal documents and business registration services, the report added. Lawpath will direct its customers to Westpac when they register. </p><p class=\"\">Westpac Banking and Lawpath did not immediately respond to MT Newswires' request for comment. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463561:0/",
            "pub_date": "2025-02-05 06:10:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV27H:0",
            "title": "New Zealand jobless rate rises to 5.1% in fourth quarter",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand's jobless rate rose to 5.1% in the fourth quarter, while employment fell 0.1% from the previous quarter, according to data released by Statistics New Zealand on Wednesday.</p><p class=\"\">Economists polled by Reuters had forecast an unemployment rate of 5.1% and for employment to fall 0.2%. The central bank had also expected the unemployment rate to be 5.1%.</p><p class=\"\">The participation rate was 71.0% in the fourth quarter. It was slightly lower than a forecast 71.1% participation rate.</p><p class=\"\">“Unemployment has been increasing since late 2022. The unemployment rate in the December 2024 quarter was the highest it’s been since the September 2020 quarter,” said Statistics New Zealand labour market spokesperson Deb Brunning.</p><p class=\"\">Wage growth remained unchanged in the quarter, with the private sector labour cost index (LCI) excluding overtime recording a 0.6% lift on the previous quarter, inline with forecasts.</p><p class=\"\">An easing in tight labour market conditions and rising unemployment will firm the case for the central bank to cut the cash rate by 50 basis points when it meets in the middle of the month.</p><p class=\"\">The central bank has cut the cash rate by 125 basis points since August and said in November that a further 50 basis point hike was likely in February amid cooling inflation pressures and a slowing economy.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV27H:0-new-zealand-jobless-rate-rises-to-5-1-in-fourth-quarter/",
            "pub_date": "2025-02-05 06:03:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309417:0",
            "title": "H&R Block Fiscal Q2 Adjusted Loss Widens, Revenue Unchanged; 2025 Outlook Reaffirmed",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">H&amp;R Block  reported a fiscal Q2 adjusted loss late Tuesday of $1.73 per diluted share, wider than a loss of $1.27 a year earlier. </p><p class=\"\">Four analysts polled by FactSet expected a loss of $1.67. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was virtually unchanged at $179.1 million. </p><p class=\"\">Three analysts surveyed by FactSet expected $182.1 million. </p><p class=\"\">The company continues to expect fiscal year 2025 adjusted diluted earnings of $5.15 to $5.35. Four analysts surveyed by FactSet expect $5.29. </p><p class=\"\">H&amp;R Block also reaffirmed its revenue guidance for the year of $3.69 billion to $3.75 billion. Three analysts polled by FactSet expect $3.72 billion. </p><p class=\"\">Shares of H&amp;R Block were down 4.5% in recent after-hours activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309417:0/",
            "pub_date": "2025-02-05 06:03:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309435:0",
            "title": "Andlauer Healthcare Brief: Caccaro will be responsible for leading the Co's specialty solutions operations moving forward",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309435:0/",
            "pub_date": "2025-02-05 06:03:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012663_20250204012847:0",
            "title": "Douglas Emmett 4Q Rev $245M >DEI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012663_20250204012847:0/",
            "pub_date": "2025-02-05 06:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012663_20250204012852:0",
            "title": "Douglas Emmett 4Q FFO 38c/Shr >DEI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012663_20250204012852:0/",
            "pub_date": "2025-02-05 06:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012818_20250204012846:0",
            "title": "Brandywine Realty Sees 2025 Loss/Shr 48c-Loss 60c >BDN",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012818_20250204012846:0/",
            "pub_date": "2025-02-05 06:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012818_20250204012850:0",
            "title": "Brandywine Realty Sees 2025 FFO 60c/Shr-FFO 72c/Shr >BDN",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012818_20250204012850:0/",
            "pub_date": "2025-02-05 06:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309436:0",
            "title": "Payfare Brief: Independent Proxy Advisor Glass Lewis Recommends Payfare Shareholders Vote \"FOR\" Arrangement with Fiserv; Comes After ISS Did the Same",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309436:0/",
            "pub_date": "2025-02-05 06:04:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309422:0",
            "title": "Zurn Elkay Water Solutions Q4 Non-GAAP EPS, Revenue Climb",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zurn Elkay Water Solutions  reported Q4 non-GAAP net income Tuesday of $0.32 per diluted share, up from $0.26 a year ago. </p><p class=\"\">Analysts polled by FactSet expected $0.28. </p><p class=\"\">Revenue in the quarter ended Dec. 31 was $370.7 million compared with $356.8 million a year ago. </p><p class=\"\">Analysts expected $366.6 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309422:0/",
            "pub_date": "2025-02-05 06:04:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012876:0",
            "title": "Key Tronic Cutting Jobs After Swinging to 2Q Loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">Key Tronic plans to cut jobs to increase efficiency after swinging to a loss in its second quarter.</p><p class=\"\">The Spokane Valley, Wash.-based contract manufacturer didn't specify how many employees it would cut, but said the planned reductions are part of an effort to streamline operations.</p><p class=\"\">Key Tronic posted a loss of $4.9 million, or 46 cents a share, for the quarter ended Dec. 28, compared with a profit of $1.1 million, or 10 cents a share, during the prior-year period.</p><p class=\"\">Revenue slid 23% to $113.9 million, primarily due to unexpected shortages for components managed by a large customer, lower holiday-season production and reduced demand from certain customers, the company said.</p><p class=\"\">The company declined to share an outlook for 2025 due to uncertainty related to tariffs. It's planning to increase production capacity in Arkansas and Vietnam to mitigate potentially negative effects from tariffs on China and Mexico, Chief Executive Brett Larsen said.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012876:0/",
            "pub_date": "2025-02-05 06:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012663_20250204012886:0",
            "title": "Douglas Emmett 4Q Loss/Shr 1c >DEI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012663_20250204012886:0/",
            "pub_date": "2025-02-05 06:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXc5JGzd:0",
            "title": "Diversified Royalty Corp. Announces February 2025 Cash Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VANCOUVER, British Columbia, Feb.  04, 2025  (GLOBE NEWSWIRE) — Diversified Royalty Corp. (TSX: DIV and DIV.DB.A) (the “Corporation” or “DIV”) is pleased to announce that its board of directors has approved a cash dividend of $0.02083 per common share for the period of February 1, 2025 to February 28, 2025, which is equal to $0.25 per common share on an annualized basis. The dividend will be paid on February 28, 2025 to shareholders of record as of the close of business on February 14, 2025.</p><p class=\"\">About Diversified Royalty Corp.</p><p class=\"\">DIV is a multi-royalty corporation, engaged in the business of acquiring top-line royalties from well-managed multi-location businesses and franchisors in North America. DIV’s objective is to acquire predictable, growing royalty streams from a diverse group of multi-location businesses and franchisors. </p><p class=\"\">DIV currently owns the Mr. Lube + Tires, AIR MILES®, Sutton, Mr. Mikes, Nurse Next Door, Oxford Learning Centres, Stratus Building Solutions and BarBurrito trademarks. Mr. Lube + Tires is the leading quick lube service business in Canada, with locations across Canada. AIR MILES® is Canada’s largest coalition loyalty program. Sutton is among the leading residential real estate brokerage franchisor businesses in Canada. Mr. Mikes operates casual steakhouse restaurants primarily in western Canadian communities. Nurse Next Door is a home care provider with locations across Canada and the United States as well as in Australia. Oxford Learning Centres is one of Canada’s leading franchisee supplemental education services. Stratus Building Solutions is a leading commercial cleaning service franchise company providing comprehensive janitorial, building cleaning, and office cleaning services primarily in the United States. BarBurrito is the largest quick service Mexican restaurant food chain in Canada.</p><p class=\"\">DIV’s objective is to increase cash flow per share by making accretive royalty purchases and through the growth of purchased royalties. DIV intends to continue to pay a predictable and stable monthly dividend to shareholders and increase the dividend over time, in each case as cash flow per share allows. </p><p class=\"\">Forward Looking Statements</p><p class=\"\">Certain statements contained in this news release may constitute “forward-looking information” within the meaning of applicable securities laws that involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information. The use of any of the words “anticipate”, “continue”, “estimate”, “expect”, “intend”, “may”, “will”, ”project”, “should”, “believe”, “confident”, “plan” and “intends” and similar expressions are intended to identify forward-looking information, although not all forward-looking information contains these identifying words. Specifically, forward-looking information in this news release includes, but is not limited to, statements made in relation to: the amount and timing of the February 2025 dividend to be paid to DIV’s shareholders; DIV’s objective to continue to pay predictable and stable monthly dividends to shareholders; and DIV’s corporate objectives. These statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events, performance, or achievements of DIV to differ materially from those anticipated or implied by such forward-looking information. DIV believes that the expectations reflected in the forward-looking information included in this news release are reasonable but no assurance can be given that these expectations will prove to be correct. In particular there can be no assurance that: DIV will be able to make monthly dividend payments to the holders of its common shares; or DIV will achieve any of its corporate objectives. Given these uncertainties, readers are cautioned that forward-looking information included in this news release are not guarantees of future performance, and such forward-looking information should not be unduly relied upon. More information about the risks and uncertainties affecting DIV’s business and the businesses of its royalty partners can be found in the “Risk Factors” section of its Annual Information Form dated March 21, 2024 and in its most recent Management’s Discussion and Analysis, copies of each of which are available under DIV’s profile on SEDAR+ at <em>www.sedarplus.com</em><em>.</em></p><p class=\"\">In formulating the forward-looking information contained herein, management has assumed that, among other things, DIV will generate sufficient cash flows from its royalties to service its debt and pay dividends to shareholders; the business and economic conditions affecting DIV and its royalty partners will continue substantially in the ordinary course, including without limitation with respect to general industry conditions, general levels of economic activity and regulations. These assumptions, although considered reasonable by management at the time of preparation, may prove to be incorrect.</p><p class=\"\">All of the forward-looking statements made in this news release are qualified by these cautionary statements and other cautionary statements or factors contained herein, and there can be no assurance that the actual results or developments will be realized or, even if substantially realized, that they will have the expected consequences to, or effects on, DIV. The forward-looking information included in this news release is presented as of the date of this news release and DIV assumes no obligation to publicly update or revise such information to reflect new events or circumstances, except as may be required by applicable law.</p><p class=\"\">THE TORONTO STOCK EXCHANGE HAS NOT REVIEWED AND DOES NOT ACCEPT RESPONSIBILITY FOR THE ADEQUACY OR THE ACCURACY OF THIS RELEASE.</p><p class=\"\">Additional Information</p><p class=\"\">Additional information relating to the Corporation and other public filings, is available on SEDAR+ at www.sedarplus.com.</p><p class=\"\">Contact:</p><p class=\"\">Sean Morrison, President and Chief Executive Officer</p><p class=\"\">Diversified Royalty Corp. </p><p class=\"\">(236) 521-8470</p><p class=\"\">Greg Gutmanis, Chief Financial Officer and VP Acquisitions </p><p class=\"\">Diversified Royalty Corp. </p><p class=\"\">(236) 521-8471</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXc5JGzd:0-diversified-royalty-corp-announces-february-2025-cash-dividend/",
            "pub_date": "2025-02-05 06:05:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV283:0",
            "title": "Match forecasts annual revenue below estimates, names new CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Match Group  forecast its annual revenue below Wall Street estimates on Tuesday, a sign users are dialing back spending on its dating apps, sending the Tinder parent's shares down 9.5% after the bell.</p><p class=\"\">Online dating apps have been seeing a slowdown in demand and user engagement over the past few years as economic uncertainty and a lack of new features kept subscribers on the sidelines.</p><p class=\"\">Match also said it has appointed Spencer Rascoff as its chief executive officer, effective immediately, succeeding Bernard Kim.</p><p class=\"\">The company expects its revenue in the range of $3.38 billion to $3.50 billion for the full year 2025, compared with analysts' average estimate of $3.50 billion, according to data compiled by LSEG.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV283:0-match-forecasts-annual-revenue-below-estimates-names-new-ceo/",
            "pub_date": "2025-02-05 06:05:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012729_20250204012731:0",
            "title": "American Fincl Group 4Q Rev $2.15B >AFG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012729_20250204012731:0/",
            "pub_date": "2025-02-05 06:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012729_20250204012730:0",
            "title": "American Fincl Group 4Q Net $255M >AFG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012729_20250204012730:0/",
            "pub_date": "2025-02-05 06:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012729_20250204012729:0",
            "title": "American Fincl Group 4Q EPS $3.03 >AFG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012729_20250204012729:0/",
            "pub_date": "2025-02-05 06:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012729:0",
            "title": "American Financial Group, Inc. Announces Fourth Quarter and Full Year Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(22:00 GMT) </strong>*American Fincl Group 4Q EPS $3.03 &gt;AFG<br/><strong class=\"root-Tkn6WL2y\">(22:00 GMT) </strong>*American Fincl Group 4Q Net $255M &gt;AFG<br/><strong class=\"root-Tkn6WL2y\">(22:00 GMT) </strong>*American Fincl Group 4Q Rev $2.15B &gt;AFG<br/><strong class=\"root-Tkn6WL2y\">(22:00 GMT) </strong>Press Release: American Financial Group, Inc. Announces Fourth Quarter and Full Year Results</p><p class=\"\">American Financial Group, Inc. Announces Fourth Quarter and Full Year Results</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net earnings per share of $3.03 in the fourth quarter; full year net   earnings per share of $10.57     </li><li class=\"listItem-bmN0_SHH\">Core net operating earnings per share of $3.12 in the fourth quarter;   full year core net operating earnings per share of $10.75     </li><li class=\"listItem-bmN0_SHH\">Full year 2024 ROE of 19.0%; 2024 core operating ROE of 19.3%     </li><li class=\"listItem-bmN0_SHH\">Overall average renewal rate increases excluding workers' compensation   of 8%     </li><li class=\"listItem-bmN0_SHH\">Full year total capital returned to shareholders approximately $791   million, includes $545 million ($6.50 per share) in special dividends   </li></ul><p class=\"\">CINCINNATI--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">American Financial Group, Inc.  today reported 2024 fourth quarter net earnings of $255 million ($3.03 per share) compared to $263 million ($3.13 per share) in the 2023 fourth quarter. Net earnings for the 2024 fourth quarter included net after-tax non-core realized losses of $7 million ($0.09 per share loss). By comparison, net earnings for the 2023 fourth quarter included net after-tax non-core realized gains of $25 million ($0.29 per share). Net earnings for the full year of 2024 were $10.57 per share, compared to $10.05 per share in 2023. Return on equity was 19.0% and 18.8% for the full years of 2024 and 2023, respectively, and is calculated excluding accumulated other comprehensive income (AOCI). Other details may be found in the table on the following page.</p><p class=\"\">Core net operating earnings were $262 million ($3.12 per share) for the 2024 fourth quarter, compared to $238 million ($2.84 per share) in the 2023 fourth quarter. The year-over-year increase reflects higher P&amp;C net investment income, including improved returns on alternative investments, partially offset by lower P&amp;C underwriting profit. Additional details for the 2024 and 2023 fourth quarters may be found in the table below. Core net operating earnings generated returns on equity of 19.3% and 19.8% for the full years of 2024 and 2023, respectively, calculated excluding AOCI.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                          Three Months Ended December 31, <br/>                 ------------------------------------------------- <br/> Components of <br/> Pretax Core <br/> Operating <br/> Earnings         2024    2023       2024   2023   2024    2023 <br/>---------------   ----    ----       ----   ----   ----    ---- <br/> In millions, <br/> except per      Before Impact                        Core Net <br/> share amounts         of          Alternative       Operating <br/>                  Alternative                       Earnings, as <br/>                  Investments      Investments        reported <br/>                 --------------  ---------------  ---------------- <br/> <br/> P&amp;C Pretax <br/>  Core <br/>  Operating <br/>  Earnings       $ 345   $ 352    $    33  $   5  $ 378   $ 357 <br/> Other expenses    (29)    (34)         -      -    (29)    (34) <br/> Holding <br/>  company <br/>  interest <br/>  expense          (19)    (19)         -      -    (19)    (19) <br/>                  ----    ----       ----   ----   ----    ---- <br/> Pretax Core <br/>  Operating <br/>  Earnings         297     299         33      5    330     304 <br/>     Related <br/>      provision <br/>      for <br/>      income <br/>      taxes         61      65          7      1     68      66 <br/>                  ----    ----       ----   ----   ----    ---- <br/> Core Net <br/>  Operating <br/>  Earnings       $ 236   $ 234    $    26  $   4  $ 262   $ 238 <br/>                  ====    ====       ====   ====   ====    ==== <br/> <br/> Core Operating <br/>  Earnings Per <br/>  Share          $2.81   $2.79    $  0.31  $0.05  $3.12   $2.84 <br/> <br/> Weighted Avg <br/>  Diluted <br/>  Shares <br/>  Outstanding     84.0    83.8       84.0   83.8   84.0    83.8 <br/> </pre><p class=\"\">AFG's book value per share was $53.18 at December 31, 2024. AFG paid cash dividends of $4.80 per share during the fourth quarter, which included a $4.00 per share special dividend paid in November. For the three and twelve months ended December 31, 2024, AFG's growth in book value per share plus dividends was 3.4% and 23.0%, respectively.</p><p class=\"\">Book value per share excluding AOCI was $56.03 at December 31, 2024. For the three and twelve months ended December 31, 2024, AFG's growth in book value per share excluding AOCI plus dividends was 5.4% and 19.6%, respectively.</p><p class=\"\">AFG's net earnings, determined in accordance with U.S. generally accepted accounting principles (GAAP), include certain items that may not be indicative of its ongoing core operations. The table below identifies such items and reconciles net earnings to core net operating earnings, a non-GAAP financial measure. AFG believes that its core net operating earnings provides management, financial analysts, ratings agencies, and investors with an understanding of the results from the ongoing operations of the Company by excluding the impact of net realized gains and losses and other items that are not necessarily indicative of operating trends. AFG's management uses core net operating earnings to evaluate financial performance against historical results because it believes this provides a more comparable measure of its continuing business. Core net operating earnings is also used by AFG's management as a basis for strategic planning and forecasting.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>   In millions, <br/> except per share    Three months ended        Twelve months ended <br/>     amounts            December 31,               December 31, <br/>                   ----------------------  --------------------------- <br/>                         2024       2023        2024          2023 <br/>                       --------    ------      -------       ------ <br/> Components of <br/> net earnings: <br/>   Core operating <br/>    earnings <br/>    before income <br/>    taxes           $       330   $   304   $    1,138      $ 1,127 <br/>   Pretax <br/>   non-core <br/>   items: <br/>----------------- <br/>     Realized <br/>      gains <br/>      (losses)              (10)       31            -          (40) <br/>     Gain on <br/>      retirement <br/>      of debt                 -         -            -            1 <br/>     Special A&amp;E <br/>      charges                 -         -          (14)         (15) <br/>                       --------    ------      -------       ------ <br/>       Earnings <br/>        before <br/>        income <br/>        taxes               320       335        1,124        1,073 <br/>   Provision <br/>   (credit) for <br/>   income taxes: <br/>     Core <br/>      operating <br/>      earnings               68        66          236          232 <br/>     Non-core <br/>      items                  (3)        6            1          (11) <br/>                       --------    ------      -------       ------ <br/>       Total <br/>        provision <br/>        for <br/>        income <br/>        taxes                65        72          237          221 <br/>                       --------    ------      -------       ------ <br/> Net earnings       $       255   $   263   $      887      $   852 <br/>                       ========    ======      =======       ====== <br/> <br/> Net earnings: <br/>   Core net <br/>    operating <br/>    earnings(a)     $       262   $   238   $      902      $   895 <br/> Non-core items: <br/>----------------- <br/>   Realized gains <br/>    (losses)                 (7)       25           (4)         (32) <br/>   Gain on <br/>    retirement of <br/>    debt                      -         -            -            1 <br/>   Special A&amp;E <br/>    charges                   -         -          (11)         (12) <br/>                       --------    ------      -------       ------ <br/> Net earnings       $       255   $   263   $      887      $   852 <br/>                       ========    ======      =======       ====== <br/> <br/> <br/> Components of <br/>  earnings per <br/>  share: <br/>   Core net <br/>    operating <br/>    earnings(a)     $      3.12   $  2.84   $    10.75      $ 10.56 <br/>   Non-core <br/>   Items: <br/>----------------- <br/>     Realized <br/>      gains <br/>      (losses)            (0.09)     0.29        (0.05)       (0.37) <br/>     Gain on <br/>      retirement <br/>      of debt                 -         -            -         0.01 <br/>     Special A&amp;E <br/>      Charges                 -         -        (0.13)       (0.15) <br/>                       --------    ------      -------       ------ <br/> Diluted net <br/>  earnings per <br/>  share             $      3.03   $  3.13   $    10.57      $ 10.05 <br/>                       ========    ======      =======       ====== <br/> <br/> <br/>Footnote (a) is contained in the accompanying Notes to Financial Schedules at <br/>the end of this release. <br/> </pre><p class=\"\">Carl H. Lindner III and S. Craig Lindner, AFG's Co-Chief Executive Officers, issued this statement: \"We are very pleased with AFG's performance in the 2024 fourth quarter and full year. In addition to producing an annual core operating return on equity in excess of 19%, net written premiums grew by 7% during the year. Excellent underwriting results, record P&amp;C net investment income and effective capital management enable us to continue to create long-term value for our shareholders. We are thankful for our talented insurance and investment professionals, who have positioned us well as we enter 2025. Our thoughts and prayers continue to include those who have been impacted by the devastation caused by the wildfires in Southern California. We are grateful to our claims professionals and insurance specialists who are helping our policyholders recover, restore their businesses and rebuild their communities.\"</p><p class=\"\">Messrs. Lindner continued: \"AFG continued to have significant excess capital at December 31, 2024. Returning capital to shareholders in the form of regular and special cash dividends and through opportunistic share repurchases is an important and effective component of our capital management strategy. In addition, our capital will be deployed into AFG's core businesses as we identify potential for healthy, profitable organic growth, and opportunities to expand our specialty niche businesses through acquisitions and start-ups that meet our target return thresholds. Over the past year, we increased our quarterly dividend by 12.7% and paid special dividends of $6.50 per share. Growth in book value per share (excluding AOCI) plus dividends was a very strong 20% during 2024.\" While AFG does not provide earnings guidance, for 2025 we expect that performance in line with the assumptions underlying our 2025 business plan would result in core operating earnings per share of approximately $10.50 and generate a very strong core operating return on equity excluding AOCI of approximately 18%. These assumptions include 5% growth in net written premiums compared to 2024, a 92.5% calendar year combined ratio, a reinvestment rate of approximately 5.75%, and a return of approximately 8% on our $2.7 billion portfolio of alternative investments. Our current estimate for losses related to the Southern California wildfires is $60 to $70 million, acknowledging that this remains a developing situation. This range is embedded in our 2025 assumptions.</p><p class=\"\">Specialty Property and Casualty Insurance Operations</p><p class=\"\">The Specialty P&amp;C insurance operations generated a strong 89.0% combined ratio in the fourth quarter of 2024, 1.3 points higher than the 87.7% reported in the prior year quarter. Fourth quarter results include 1.1 points related to catastrophe losses (primarily the result of Hurricane Milton), compared to 1.4 points in the 2023 fourth quarter. Fourth quarter 2024 results include 1.8 points of adverse prior year reserve development, compared to 3.3 points of favorable prior year reserve development in the fourth quarter of 2023. Underwriting profit was $204 million for the 2024 fourth quarter compared to $212 million in the fourth quarter of 2023. Higher underwriting profit in our Property and Transportation and Specialty Financial Groups was more than offset by lower year-over-year underwriting profit in our Specialty Casualty Group, which was impacted by adverse prior year reserve development in certain social inflation-exposed businesses.</p><p class=\"\">Fourth quarter 2024 gross and net written premiums were up 3% and 1%, respectively, when compared to the same period in 2023. Gross and net written premiums increased 9% and 7%, respectively, for the full year in 2024 and established new records for premium production for AFG. We continue to achieve year-over-year premium growth as a result of a combination of new business opportunities, a good renewal rate environment, and increased exposures in many of our businesses.</p><p class=\"\">Average renewal pricing across our P&amp;C Group, excluding workers' compensation, was up approximately 8% for the quarter. Including workers' compensation, renewal rates were up approximately 7% overall; both measures were in line with renewal rates in the previous quarter. We believe we are achieving overall renewal rate increases in excess of prospective loss ratio trends to meet or exceed targeted returns.</p><p class=\"\">The Property and Transportation Group reported an underwriting profit of $82 million in the fourth quarter of 2024, compared to $67 million in the comparable prior year period. The improvement was attributable to higher year-over-year underwriting profitability in our crop insurance operations. Catastrophe losses in this group were $10 million in the fourth quarter of 2024, compared to $5 million in the prior year period. The businesses in the Property and Transportation Group achieved a strong 89.2% calendar year combined ratio overall in the fourth quarter, an improvement of 1.1 points over the 90.3% achieved in the comparable period in 2023.</p><p class=\"\">Fourth quarter 2024 gross and net written premiums in this group were both down 6% from the comparable prior year period. The decrease was primarily due to the impact of lower year-over-year commodity pricing on winter wheat premiums, coupled with elevated pricing competition and the non-renewal of certain under-performing accounts in our transportation businesses. Overall renewal rates in this group increased 7% on average for the fourth quarter of 2024, in line with pricing the previous quarter. Pricing for the full year for this group was up 8% overall.</p><p class=\"\">The Specialty Casualty Group reported an underwriting profit of $82 million in the 2024 fourth quarter compared to $114 million in the comparable 2023 period. Higher year-over-year underwriting profits in our targeted markets businesses were more than offset by lower underwriting profit in our excess liability, workers' compensation, and executive liability businesses. Underwriting profitability in our workers' compensation and executive liability businesses continues to be excellent despite the lower year-over-year profitability in these businesses. Catastrophe losses for this group, including the impact of lower than previously anticipated estimated losses from Hurricane Helene, had a favorable impact of $5 million in the fourth quarter of 2024, compared to catastrophe losses of $8 million in the fourth quarter of 2023. The businesses in the Specialty Casualty Group achieved a very strong 89.0% calendar year combined ratio overall in the fourth quarter, 4.4 points higher than the excellent 84.6% reported in the comparable period in 2023.</p><p class=\"\">Fourth quarter 2024 gross and net written premiums in this group increased 5% and 4%, respectively, when compared to the same prior year period. The primary drivers of growth were new business opportunities and favorable renewal pricing in several of our targeted markets businesses and in our excess &amp; surplus lines business. Our mergers &amp; acquisitions business also benefited from an increase in M&amp;A activity. This growth was tempered by lower year-over-year workers' compensation premiums. Excluding workers' compensation, fourth quarter gross and net written premiums in this group both grew 8% year over year. Excluding workers' compensation, renewal pricing for this group was up 11% in the fourth quarter, an improvement of about a point from the previous quarter. Pricing in this group, including workers' compensation, was up 8%, in line with the third quarter. For the full year, pricing in this group excluding workers' compensation was 9%.</p><p class=\"\">The Specialty Financial Group reported an underwriting profit of $54 million in the fourth quarter of 2024, compared to $45 million in the fourth quarter of 2023, primarily as a result of higher underwriting profit in our financial institutions business. Catastrophe losses for this group were $17 million in the fourth quarter of 2024, compared to $4 million in the fourth quarter of 2023. This group continued to achieve excellent underwriting margins and reported an outstanding 80.7% combined ratio for the fourth quarter of 2024, an improvement of 0.6 points over the prior year period.</p><p class=\"\">Gross and net written premiums in this group increased by 11% and 12%, respectively, in the 2024 fourth quarter when compared to the same 2023 period, primarily due to growth in our financial institutions business. Renewal pricing in this group was up 3% in the fourth quarter and up 6% for the full year of 2024.</p><p class=\"\">Carl Lindner III stated, \"We closed 2024 on a strong note, with each of our Specialty P&amp;C businesses reporting fourth quarter calendar year combined ratios less than 90%. In addition to these strong underwriting margins, we are finding opportunities to grow through new business opportunities, a continued favorable pricing environment and increased exposures. Nearly all the businesses in our diversified Specialty P&amp;C portfolio continue to meet or exceed targeted returns, and we set new records for premium production in 2024. We continue to feel confident about the strength of our reserves, and I am especially pleased that we achieved a fourth quarter average renewal rate increase of 11% in our Specialty Casualty Group, excluding workers' compensation, which is our most social inflation-exposed group of businesses.\"</p><p class=\"\">Further details about AFG's Specialty P&amp;C operations may be found in the accompanying schedules and in our Quarterly Investor Supplement, which is posted on our website.</p><p class=\"\">Investments</p><p class=\"\">Net Investment Income — For the quarter ended December 31, 2024, property and casualty net investment income was approximately 21% higher than the comparable 2023 period as a result of improved returns on alternative investments and the impact of rising interest rates and higher balances of invested assets. The annualized return on alternative investments was approximately 4.9% for the 2024 fourth quarter compared to 0.8% for the prior year quarter. Earnings from alternative investments may vary from quarter to quarter based on the reported results of the underlying investments and generally are reported on a quarter lag.</p><p class=\"\">For the twelve months ended December 31, 2024, P&amp;C net investment income was approximately 8% higher than the comparable 2023 period due primarily to the impact of rising interest rates and higher balances of invested assets. The return on alternative investments was 6.1% for 2024 compared to 7.0% earned on P&amp;C alternative investments in 2023. The average annual return on alternative investments over the five calendar years ended December 31, 2024, was approximately 12%.</p><p class=\"\">Non-Core Net Realized Gains (Losses) — AFG recorded fourth quarter 2024 net realized losses of $7 million ($0.09 per share) after tax, which included less than $1 million ($0.01 per share) in after-tax net losses to adjust equity securities that the Company continued to own at December 31, 2024, to fair value. AFG recorded net realized gains of $25 million ($0.29 per share) after tax in the comparable 2023 period.</p><p class=\"\">After-tax unrealized losses related to fixed maturities were $212 million at December 31, 2024. Our portfolio continues to be high quality, with 94% of our fixed maturity portfolio rated investment grade and 96% of our P&amp;C fixed maturity portfolio with a National Association of Insurance Commissioners' designation of NAIC 1 or 2, its highest two categories.</p><p class=\"\">More information about the components of our investment portfolio may be found in our Quarterly Investor Supplement, which is posted on our website.</p><p class=\"\">About American Financial Group, Inc.</p><p class=\"\">American Financial Group is an insurance holding company, based in Cincinnati, Ohio. Through the operations of Great American Insurance Group, AFG is engaged primarily in property and casualty insurance, focusing on specialized commercial products for businesses. Great American Insurance Group's roots go back to 1872 with the founding of its flagship company, Great American Insurance Company.</p><p class=\"\">Forward Looking Statements</p><p class=\"\">This press release, and any related oral statements, contains certain statements that may be deemed to be \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements in this press release not dealing with historical results are forward-looking and are based on estimates, assumptions, and projections. Examples of such forward-looking statements include statements relating to: the Company's expectations concerning market and other conditions and their effect on future premiums, revenues, earnings, investment activities and the amount and timing of share repurchases or special dividends; recoverability of asset values; expected losses and the adequacy of reserves for asbestos, environmental pollution and mass tort claims; rate changes; and improved loss experience.</p><p class=\"\">Actual results and/or financial condition could differ materially from those contained in or implied by such forward-looking statements for a variety of reasons including, but not limited to: the risks and uncertainties AFG describes in the \"Risk Factors\" section of its most recent Annual Report on Form 10-K, as updated by its other reports filed with the Securities and Exchange Commission; changes in financial, political and economic conditions, including changes in interest and inflation rates, currency fluctuations and extended economic recessions or expansions in the U.S. and/or abroad; performance of securities markets; new legislation or declines in credit quality or credit ratings that could have a material impact on the valuation of securities in AFG's investment portfolio; the availability of capital; changes in insurance law or regulation, including changes in statutory accounting rules, including modifications to capital requirements; changes in the legal environment affecting AFG or its customers; tax law and accounting changes; levels of natural catastrophes and severe weather, terrorist activities (including any nuclear, biological, chemical or radiological events), incidents of war or losses resulting from pandemics, civil unrest and other major losses; disruption caused by cyber-attacks or other technology breaches or failures by AFG or its business partners and service providers, which could negatively impact AFG's business and/or expose AFG to litigation; development of insurance loss reserves and establishment of other reserves, particularly with respect to amounts associated with asbestos and environmental claims; availability of reinsurance and ability of reinsurers to pay their obligations; competitive pressures; the ability to obtain adequate rates and policy terms; changes in AFG's credit ratings or the financial strength ratings assigned by major ratings agencies to AFG's operating subsidiaries; the impact of the conditions in the international financial markets and the global economy relating to AFG's international operations; and effects on AFG's reputation, including as a result of environmental, social and governance matters.</p><p class=\"\">The forward-looking statements herein are made only as of the date of this press release. The Company assumes no obligation to publicly update any forward-looking statements.</p><p class=\"\">Conference Call</p><p class=\"\">The Company will hold a conference call to discuss 2024 fourth quarter and full year results at 11:30 a.m. (ET) tomorrow, Wednesday, February 5, 2025. There are two ways to access the call.</p><p class=\"\">Participants should register for the call here now, or any time up to and during the time of the call, and will immediately receive the dial-in number and a unique pin to access the call. While you may register at any time up to and during the time of the call, you are encouraged to join the call 10 minutes prior to the start of the event.</p><p class=\"\">The conference call and accompanying webcast slides will also be broadcast live over the internet. To access the event, click the following link: https://www.afginc.com/news-and-events/event-calendar. Alternatively, you can choose Events from the Investor Relations page at www.AFGinc.com.</p><p class=\"\">A replay of the webcast will be available via the same link on our website approximately two hours after the completion of the call.</p><p class=\"\">Websites:</p><p class=\"\">www.AFGinc.com</p><p class=\"\">www.GreatAmericanInsuranceGroup.com</p><p class=\"\">(Financial summaries follow)</p><p class=\"\">This earnings release and AFG's Quarterly Investor Supplement are available in the Investor Relations section of AFG's website: www.AFGinc.com.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>           AMERICAN FINANCIAL GROUP, INC., AND SUBSIDIARIES <br/>         SUMMARY OF EARNINGS AND SELECTED BALANCE SHEET DATA <br/>                 (In Millions, Except Per Share Data) <br/> <br/>                           Three months ended     Twelve months ended <br/>                              December 31,            December 31, <br/>                         ----------------------  --------------------- <br/>                             2024         2023       2024     2023 <br/>                             -----       ------      -----   ------ <br/>Revenues <br/>  P&amp;C insurance net <br/>   earned premiums        $  1,850      $ 1,732   $  7,036  $ 6,531 <br/>  Net investment income        194          159        780      742 <br/>  Realized gains <br/>  (losses) on: <br/>    Securities                 (10)          31          -      (36) <br/>    Subsidiaries                 -            -          -       (4) <br/>  Income of managed <br/>  investment entities: <br/>    Investment income           84          100        380      421 <br/>    Gain (loss) on <br/>    change in fair <br/>    value of <br/>    assets/liabilities          (1)          15          4       27 <br/>  Other income                  32           46        124      146 <br/>                             -----       ------      -----   ------ <br/>      Total revenues         2,149        2,083      8,324    7,827 <br/> <br/>Costs and expenses <br/>  P&amp;C insurance losses <br/>   &amp; expenses                1,661        1,549      6,467    5,968 <br/>  Interest charges on <br/>   borrowed money               19           19         76       76 <br/>  Expenses of managed <br/>   investment entities          71          102        338      405 <br/>  Other expenses                78           78        319      305 <br/>                             -----       ------      -----   ------ <br/>      Total costs and <br/>       expenses              1,829        1,748      7,200    6,754 <br/>                             -----       ------      -----   ------ <br/> <br/>Earnings before income <br/> taxes                         320          335      1,124    1,073 <br/>Provision for income <br/> taxes                          65           72        237      221 <br/>                             -----       ------      -----   ------ <br/> <br/>Net earnings              $    255      $   263   $    887  $   852 <br/>                             =====       ======      =====   ====== <br/> <br/>Diluted earnings per <br/> common share             $   3.03      $  3.13   $  10.57  $ 10.05 <br/>                             =====       ======      =====   ====== <br/> <br/>Average number of <br/> diluted shares               84.0         83.8       83.9     84.8 <br/> <br/> <br/> <br/>Selected Balance Sheet Data:       December 31, 2024     December 31, 2023 <br/>--------------------------------  -------------------  --------------------- <br/>  Total cash and investments        $          15,852    $          15,263 <br/>  Long-term debt                    $           1,475    $           1,475 <br/> <br/>  Shareholders' equity(b)           $           4,466    $           4,258 <br/>  Shareholders' equity <br/>   (excluding AOCI)                 $           4,706    $           4,577 <br/> <br/>  Book value per share(b)           $           53.18    $           50.91 <br/>  Book value per share <br/>   (excluding AOCI)                 $           56.03    $           54.72 <br/> <br/>Common Shares Outstanding                        84.0                 83.6 <br/> <br/> <br/>Footnote (b) is contained in the accompanying Notes to Financial Schedules at <br/>the end of this release. <br/> <br/> <br/>                            AMERICAN FINANCIAL GROUP, INC. <br/>                               SPECIALTY P&amp;C OPERATIONS <br/>                                 (Dollars in Millions) <br/> <br/>                     Three months ended      Pct.      Twelve months ended      Pct. <br/>                        December 31,        Change         December 31,        Change <br/>                   ----------------------  --------  -----------------------  -------- <br/>                    2024        2023                   2024        2023 <br/>                    -----       -----      --------   ------       -----      -------- <br/> <br/>Gross written <br/> premiums          $2,043      $1,992         3%     $10,533      $9,656        9% <br/>                    =====       =====                 ======       ===== <br/> <br/> <br/>Net written <br/> premiums          $1,460      $1,445         1%     $ 7,139      $6,692        7% <br/>                    =====       =====                 ======       ===== <br/> <br/>Ratios (GAAP): <br/>  Loss &amp; LAE <br/>   ratio             63.7%       60.7%                  63.3%       61.5% <br/>  Underwriting <br/>   expense ratio     25.3%       27.0%                  27.9%       28.8% <br/>                    -----       -----                 ------       ----- <br/> <br/>  Specialty <br/>   Combined <br/>   Ratio             89.0%       87.7%                  91.2%       90.3% <br/>                    =====       =====                 ======       ===== <br/> <br/>  Combined Ratio <br/></pre><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">P&amp;C   Segment 89.1% 87.8% 91.2% 90.4%   ===== ===== ====== =====   </li></ul><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Supplemental <br/>Information:(c) <br/>----------------- <br/>Gross Written <br/>Premiums: <br/>  Property &amp; <br/>   Transportation  $  585      $  623        (6%)    $ 4,735      $4,146       14% <br/>  Specialty <br/>   Casualty         1,126       1,069         5%       4,543       4,368        4% <br/>  Specialty <br/>   Financial          332         300        11%       1,255       1,142       10% <br/>                    -----       -----                 ------       ----- <br/>                   $2,043      $1,992         3%     $10,533      $9,656        9% <br/>                    =====       =====                 ======       ===== <br/> <br/>Net Written <br/>Premiums: <br/>  Property &amp; <br/>   Transportation  $  399      $  426        (6%)    $ 2,811      $2,551       10% <br/>  Specialty <br/>   Casualty           725         700         4%       3,043       2,944        3% <br/>  Specialty <br/>   Financial          279         250        12%       1,045         935       12% <br/>  Other                57          69       (17%)        240         262       (8%) <br/>                    -----       -----                 ------       ----- <br/>                   $1,460      $1,445         1%     $ 7,139      $6,692        7% <br/>                    =====       =====                 ======       ===== <br/> <br/>Combined Ratio <br/>(GAAP): <br/>  Property &amp; <br/>   Transportation    89.2%       90.3%                  92.4%       92.8% <br/>  Specialty <br/>   Casualty          89.0%       84.6%                  88.5%       87.0% <br/>  Specialty <br/>   Financial         80.7%       81.3%                  87.1%       87.3% <br/> <br/>  Aggregate <br/>   Specialty <br/>   Group             89.0%       87.7%                  91.2%       90.3% <br/> <br/> <br/> <br/>                          Three months <br/>                         ended December     Twelve months ended <br/>                               31,              December 31, <br/>                        -----------------  --------------------- <br/>                            2024    2023       2024       2023 <br/>                            ----    ----       ----       ----- <br/> Reserve Development <br/> (Favorable)/Adverse: <br/>   Property &amp; <br/>    Transportation       $    (3)  $ (12)   $   (94)     $  (84) <br/>   Specialty Casualty         36     (37)       (10)       (110) <br/>   Specialty Financial        (8)     (8)       (11)        (32) <br/>   Other Specialty             9       -         45           - <br/>                            ----    ----       ----       ----- <br/>     Specialty Group          34     (57)       (70)       (226) <br/>   Other                       2       1          6           2 <br/>                            ----    ----       ----       ----- <br/> Total Reserve <br/>  Development            $    36   $ (56)   $   (64)     $ (224) <br/>                            ====    ====       ====       ===== <br/> <br/> Points on Combined <br/> Ratio: <br/>   Property &amp; <br/>    Transportation          (0.5)   (1.8)      (3.4)       (3.3) <br/>   Specialty Casualty        4.8    (5.0)      (0.4)       (3.8) <br/>   Specialty Financial      (2.9)   (3.4)      (1.1)       (3.7) <br/> <br/>   Aggregate Specialty <br/>    Group                    1.8    (3.3)      (1.0)       (3.4) <br/> Total P&amp;C Segment           1.9    (3.2)      (0.9)       (3.4) <br/> <br/> <br/>Footnote (c) is contained in the accompanying Notes to Financial Schedules at <br/>the end of this release. <br/> <br/> <br/>                   AMERICAN FINANCIAL GROUP, INC. <br/>                    Notes to Financial Schedules <br/> <br/> <br/>a)   Components of core net operating earnings (dollars in millions): <br/> <br/> <br/>                     Three months ended        Twelve months ended <br/>                        December 31,               December 31, <br/>                   ----------------------  --------------------------- <br/>                        2024       2023         2024          2023 <br/>                       -------    ------       -------       ------ <br/> Core Operating <br/> Earnings before <br/> Income Taxes: <br/>----------------- <br/> P&amp;C insurance <br/>  segment           $      378   $   357    $    1,328      $ 1,304 <br/> Interest and <br/>  other corporate <br/>  expenses                 (48)      (53)         (190)        (177) <br/>                       -------    ------       -------       ------ <br/> <br/> Core operating <br/>  earnings before <br/>  income taxes             330       304         1,138        1,127 <br/> Related income <br/>  taxes                     68        66           236          232 <br/>                       -------    ------       -------       ------ <br/> <br/> Core net <br/>  operating <br/>  earnings          $      262   $   238    $      902      $   895 <br/>                       =======    ======       =======       ====== <br/> <br/> <br/>b)   Shareholders' Equity at December 31, 2024, includes ($240 million) ($2.85 <br/>     per share loss) in Accumulated Other Comprehensive Income (Loss) compared <br/>     to ($319 million) ($3.81 per share loss) at December 31, 2023. <br/> <br/>c)   Supplemental Notes: <br/>    -------------------------------------------------------------------------- <br/>    Property &amp; Transportation includes primarily physical damage and liability <br/>    coverage for buses and trucks and other specialty transportation niches, <br/>    inland and ocean marine, agricultural-related products, and other <br/>    commercial property coverages. Specialty Casualty includes primarily <br/>    excess and surplus, general liability, executive liability, professional <br/>    liability, umbrella and excess liability, specialty coverages in targeted <br/>    markets, customized programs for small to mid-sized businesses and <br/>    workers' compensation insurance. Specialty Financial includes risk <br/>    management insurance programs for lending and leasing institutions <br/>    (including equipment leasing and collateral and lender-placed mortgage <br/>    property insurance), surety and fidelity products and trade credit <br/>    insurance. Other includes an internal reinsurance facility. <br/> </pre><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204126591/en/</p><p class=\"\">CONTACT:    Diane P. Weidner, IRC, CPA (inactive)</p><p class=\"\">Vice President - Investor &amp; Media Relations</p><p class=\"\">513-369-5713</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(22:01 GMT) </strong>*American Fincl Group 4Q Adj EPS $3.12 &gt;AFG</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012729:0/",
            "pub_date": "2025-02-05 06:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}