{
    "data": [
        {
            "id": "cnbctv:37d785827094b:0",
            "title": "FM Nirmala Sitharaman says she will look into Fino Bank CEO's arrest under GST Act",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Finance Minister Nirmala Sitharaman on Saturday assured that she would examine the matter concerning the arrest of Rishi Gupta, managing director of Fino Payment Bank, who was detained in a case related to Goods and Services Tax (GST) evasion.</span></p><p class=\"\"><span> \"Thanks for sharing this. Will check,\" she wrote on social media X, responding to concerns raised by industry veteran Mohandas Pai, who questioned whether authorities overstepped in arresting a bank chief executive under GST laws.</span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">Nirmala Sitharaman</div><div class=\"username-n2KCMK3i\">@nsitharaman</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>Thanks for sharing this. Will check. </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/G9YN14EUKn\" rel=\"nofollow\" target=\"_blank\">https://t.co/G9YN14EUKn</a></p></div><span class=\"date-n2KCMK3i\">Feb 28, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/nsitharaman/status/2027654487226421693\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span> Pai asked how a CEO of a regulated bank could be arrested over an issue involving a business partner, suggesting that the authorities might have exceeded their powers under GST rules. He also raised questions about what safeguards exist to protect citizens from misuse of these powers.</span></p><p class=\"\"><span> \"Madame ⁦Nirmala Sitharaman, please see this. How can a CEO of a regulated bank be arrested for an issue with a business partner? Is this not overreach?\" he wrote.</span></p><p class=\"\"><span> \"The Finance Ministry has given vast powers for GST. What is the safeguard for citizens against misuse? Please intervene,\" he added.</span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">Mohandas Pai</div><div class=\"username-n2KCMK3i\">@TVMohandasPai</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>Madame ⁦</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://twitter.com/nsitharaman?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">@nsitharaman</a><span>⁩ please see this. How can a ceo of a regulated bank be arrested for an issue with a business partner? Is this not overreach. ⁦</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://twitter.com/FinMinIndia?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">@FinMinIndia</a><span>⁩ has given vast powers for GST. What is the safeguard for citizens against misuse?please intervene </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/yob4aYeH7J\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/yob4aYeH7J</a></p></div><span class=\"date-n2KCMK3i\">Feb 28, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/TVMohandasPai/status/2027627406253768798\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span> On Saturday, Fino Payments Bank informed the stock exchange that its MD and CEO, Rishi Gupta, has been arrested under specific sections of the CGST and SGST Act, 2017. \"The issue relates to a GST investigation concerning our business partner(s),\" the bank said in its statement.</span></p><p class=\"\"><span> The bank also held a special board meeting on the same day to ensure smooth operations and appointed Ketan Merchant, the bank's CFO, as the temporary head of the organization to manage day-to-day work during Gupta's absence.</span></p><p class=\"\"><span> \"As a regulated entity, we are compliant with all the laws, including GST. We have full faith in the country's judiciary and will continue to extend full cooperation and assistance to the authorities in the ongoing process,\" the bank added.</span></p><p class=\"\"><span> \"We stand committed to deliver on our customer centricity,\" it continued.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:37d785827094b:0/",
            "pub_date": "2026-02-28 21:23:20",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "chainwire:5f407bb23094b:0",
            "title": "/C O R R E C T I O N -- Unicity Labs/",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>In the news release, PadUp Ventures and Unicity Labs Partner to Bring Agentic Commerce Infrastructure to India, issued Feb. 27, 2026 by Unicity Labs over PR Newswire, there was a typo in the original headline, as incorrectly transmitted by PR Newswire. The complete, corrected release follows: </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>PadUp Ventures and Unicity Labs Partner to Bring Agentic Commerce Infrastructure to India</span></strong></p><p class=\"\"><span>Agentic AI startup program will enable Indian startups to build AI agent-powered commerce applications on the Unicity Protocol</span></p><p class=\"\"><span>ZUG, Switzerland, Feb. 27, 2026 /PRNewswire/ -- Unicity Labs, the company pioneering autonomous agentic marketplaces, and PadUp Ventures, one of India's leading startup incubators, today announced a strategic partnership to accelerate the development of agentic commerce infrastructure across the Indian startup ecosystem.</span></p><p class=\"\"><span>The partnership will identify, mentor, and fund Indian startups building applications where AI agents can discover, negotiate, and transact autonomously: from SMB sales automation to supply chain coordination to cross-border payments.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Agentic Commerce Opportunity</span></strong></p><p class=\"\"><span>As AI agents become capable of acting on behalf of businesses and consumers, they need infrastructure purpose-built for machine-speed commerce. Today's payment rails and marketplaces were designed for humans, not millions of agents negotiating and settling transactions simultaneously. Traditional blockchains create consensus bottlenecks. Centralized platforms sacrifice trustlessness. Neither scales to the demands of the autonomous economy.</span></p><p class=\"\"><span>The Unicity Protocol solves this: a novel peer-to-peer blockchain architecture that eliminates the shared ledger entirely, enabling private negotiation, atomic settlement, and throughput exceeding 300 million transactions per second with 1-second finality and fixed microcent fees.</span></p><p class=\"\"><span>\"India has 63 million SMBs, most of them bandwidth-constrained,\" said Pankaj Thakar, Partner at PadUp Ventures. \"They can't afford sales teams or 24/7 customer support. AI agents change that equation entirely; but only if the infrastructure exists for agents to transact at scale. That's what Unicity provides.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>What the Program Includes</span></strong></p><p class=\"\"><span>PadUp is launching a dedicated Agentic Commerce Track within its acceleration program PrepUp, focused on startups building on the Unicity Protocol. The partnership will drive joint go-to-market efforts targeting Indian SMBs and enterprises, with qualified startups gaining access to investment from both PadUp's network and Unicity's ecosystem fund.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Dedicated Agentic Commerce Track:</span></strong><span> PadUp will launch a focused acceleration track for startups building on the Unicity Protocol</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Go-to-Market in India:</span></strong><span> Joint efforts to bring agentic commerce solutions to Indian SMBs and enterprises</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Funding: </span></strong><span>Qualified startups will have access to investment from both PadUp's network and Unicity's ecosystem fund</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why India</span></strong></p><p class=\"\"><span>India's startup ecosystem, now the world's third-largest with over 112,000 recognized startups — is uniquely positioned for agentic commerce adoption. A massive, underserved SMB market, deep developer talent across AI and blockchain, rapidly expanding digital payments infrastructure, and established cross-border trade corridors to the UAE, Southeast Asia, and beyond make it one of the highest-potential markets for the autonomous economy.</span></p><p class=\"\"><span>\"India doesn't just adopt technology, it scales it,\" said Mike Gault, CEO of Unicity Labs. \"UPI proved that. We believe Indian founders will build some of the most important agentic commerce applications in the world, and PadUp is exactly the right partner to find and support them.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Unicity Labs</span></strong></p><p class=\"\"><span>Unicity Labs is building the infrastructure for the autonomous agentic internet. The Unicity Protocol replaces shared ledgers with peer-to-peer cryptographic objects, enabling AI agents to discover, transact, and settle autonomously. Founded by veterans of blockchain and cryptography, Unicity Labs has raised $3M in seed funding led by Blockchange Ventures with participation from Outlier Ventures and Tawasal. The company is headquartered in Abu Dhabi. The Unicity Foundation, established in Switzerland, oversees protocol development and community governance.</span></p><p class=\"\"><span>Learn more unicity.ai | https://x.com/unicity_labs | https://sphere.unicity.network</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About PadUp Ventures</span></strong></p><p class=\"\"><span>Founded in 2015 and headquartered in Gurugram, PadUp Ventures is a Virtual Accelerator providing Programmatic Mentoring and Assured Funding that Ensures 500% higher chances of success for Early Stage Technology Startups/ entrepreneurs. PadUp's structured \"programmatic\" mentoring and acceleration programs have helped hundreds of startups achieve success and growth. PadUp has helped over 350 tech companies in India and UAE that have generated value of $200 million USD for their stakeholders. Portfolio companies include IntelleWings, TruScholar, and Olbrain.</span></p><p class=\"\"><span>Learn more: PadUp.in</span></p><p class=\"\"><span>SOURCE Unicity Labs</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/chainwire:5f407bb23094b:0-c-o-r-r-e-c-t-i-o-n-unicity-labs/",
            "pub_date": "2026-02-28 21:25:32",
            "source": "Chainwire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:fa3d8b9db5c45:0",
            "title": "Berkshire Hathaway Q4 Profit Down",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>OMAHA (dpa-AFX) - Warren Buffett's Berkshire Hathaway Inc. (BRK-A, BRK-B) reported on Saturday that its fourth quarter net earnings attributable to shareholders declined to $19.199 billion or $13,349 per Class A Share from $19.694 billion or $13,695 per Class A Share last year.</span></p><p class=\"\"><span>Temporary impairments of investments in Kraft Heinz and Occidental reduced earnings by $4.495 billion in the latest quarter, whereas no such impairments were recorded in the prior year.</span></p><p class=\"\"><span>Operating earnings for the fourth quarter were $10.200 billion down from $14.527 billion in the prior year.</span></p><p class=\"\"><span>Berkshire Hathaway's Class A shares closed at $757,000 on February 27, 2026, up 0.50% during regular trading, before slipping slightly by 0.04% in after-hours trading.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:fa3d8b9db5c45:0-berkshire-hathaway-q4-profit-down/",
            "pub_date": "2026-02-28 21:36:59",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "chainwire:269e1133b094b:0",
            "title": "KuCoin Ranks Among Top Three Exchanges in Animoca Brands Research 2025 Listing Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>PROVIDENCIALES, Turks and Caicos Islands, Feb. 28, 2026 /PRNewswire/ -- KuCoin has been ranked among the top three cryptocurrency exchanges by total token listings in the Animoca Brands Research's 2025 Listing Report, reflecting continued activity in primary-market listings.</span></p><p class=\"\"><span>https://mma.prnewswire.com/media/2785613/KuCoin_new_Logo.html</span></p><p class=\"\"><span>According to the report, KuCoin recorded a 31% year-over-year increase in token listings in 2025. The report highlights the exchange's strong participation in primary token listings, indicating sustained engagement in early-stage project onboarding.</span></p><p class=\"\"><span>The data also shows that KuCoin maintains a measurable presence across the $30M–$500M+ fully diluted valuation (FDV) range. The report notes that top-tier exchanges account for approximately 25% of listings within the $500M+ FDV category, suggesting increasing selectivity in higher-capitalization segments.</span></p><p class=\"\"><span>Liquidity trends in the report point to a broader market shift. Projects with FDV above $100M recorded first-day trading volumes between 1.44x and 1.78x the 2024 average. On a 30-day basis, the $100M–$500M FDV segment posted the fastest growth, reaching 2.12x the prior-year average.</span></p><p class=\"\"><span>In addition, KuCoin ranked fifth in tokenized gold trading volume, reflecting participation in the growing real-world asset (RWA) sector, particularly in on-chain representations of traditional defensive assets.</span></p><p class=\"\"><span>The report suggests that exchange competition in 2025 is increasingly shaped by listing composition, liquidity distribution, and asset structure diversification rather than listing volume alone. Learn more in the full report.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About KuCoin</span></strong></p><p class=\"\"><span>Founded in 2017, KuCoin is a leading global crypto platform trusted by over 40 million users across 200+ countries and regions. The platform delivers innovative and compliant digital asset services, offering access to 1,000+ listed tokens, spot and futures trading, institutional wealth management, and a Web3 wallet.</span></p><p class=\"\"><span>Recognized by Forbes and Hurun, KuCoin holds SOC 2 Type II and ISO 27001:2022 certifications, underscoring its commitment to top-tier security. With AUSTRAC registration in Australia and a MiCA license in Austria, KuCoin continues expanding its regulated footprint under CEO BC Wong, building a reliable and trusted digital-asset ecosystem.</span></p><p class=\"\"><span>Learn more:</span><strong class=\"root-Tkn6WL2y\"><span> www.kucoin.com</span></strong></p></span></div></div>",
            "link": "https://www.tradingview.com/news/chainwire:269e1133b094b:0-kucoin-ranks-among-top-three-exchanges-in-animoca-brands-research-2025-listing-report/",
            "pub_date": "2026-02-28 21:24:19",
            "source": "Chainwire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZG1KN:0",
            "title": "How US-Iran tensions could shape world markets",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Dhara Ranasinghe and Hadeel Al Sayegh</span></p><p class=\"\"><span>    The United States and Israel launched strikes on Iran on Saturday, targeting its leadership and plunging the Middle East into a new conflict that President Donald Trump said would end a security threat and give Iranians a chance to topple their rulers.</span></p><p class=\"\"><span>The strikes put nearby oil-producing Gulf Arab countries on edge as fears of escalation grew, and Tehran responded by launching missiles towards Israel. </span></p><p class=\"\"><span>Here's how the conflict could play out across world markets.     </span></p><p class=\"\"><span>OIL SPIKE</span></p><p class=\"\"><span>Oil is the main barometer of Middle East tension.</span></p><p class=\"\"><span>Iran is a major producer and lies opposite the oil-rich Arabian Peninsula across the Strait of Hormuz, through which about 20% of global oil supply passes. Conflict could limit oil entering the global market and push up prices.</span></p><p class=\"\"><span>Brent crude </span><span> traded on Friday around $73 a barrel, already up by a fifth this year.</span></p><p class=\"\"><span>Some oil majors and top trading houses suspended crude oil and fuel shipments via the Strait of Hormuz because of the  attacks, four trading sources said on Saturday.</span></p><p class=\"\"><span>William Jackson, chief emerging markets economist at Capital Economics, said that even if the conflict was contained, Brent might rise to about $80, which was the peak during the 12-day war in Iran last June. </span></p><p class=\"\"><span>A prolonged conflict affecting supply could cause oil prices to jump to around $100, potentially adding 0.6-0.7 percentage points to global inflation, he said in a note. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:942.4778761061947px;aspect-ratio:1.570796460176991\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-bfcf90742d8bb4f36276cb31df65980c-resized.webp\" type=\"image/webp\"/><img alt=\"Brent crude oil on the rise as geopolitics flares\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-bfcf90742d8bb4f36276cb31df65980c-resized.webp\" style=\"background-color:#fbf9f7\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Brent crude oil on the rise as geopolitics flares</span></figcaption></figure><p class=\"\"><span>WILD SWINGS, EVERYWHERE</span></p><p class=\"\"><span>The conflict is likely to exacerbate volatility across global markets, which have already swung wildly this year owing to Trump's tariffs and a sharp tech selloff.</span></p><p class=\"\"><span>The VIX volatility index </span><span> has risen by a third this year, and implied U.S. bond volatility </span><span> is up 15%. </span></p><p class=\"\"><span>Currency markets are unlikely to be immune, analysts say. </span></p><p class=\"\"><span>The dollar index fell by around 1% during the June war, CBA notes. But that fall was short-lived and unwound after three or four days.  </span></p><p class=\"\"><span>\"In current circumstances, the size of the fall will depend on how large and how long-lasting the conflict is expected to be,\" CBA analysts said in a note a week ago.  </span></p><p class=\"\"><span>\"If the conflict was long-lasting and disrupted oil supplies, we expect the U.S. dollar would lift against most currencies except Japanese yen and Swiss franc. The U.S. is a net energy exporter and so benefits from higher oil and gas prices that would result from disrupted oil supply.\"</span></p><p class=\"\"><span>Israel's shekel </span><span> will almost certainly be another mover - Iran quickly retaliated against Israel on Saturday.</span></p><p class=\"\"><span>It dropped 5% at the start of the June war and also reacted after Israel struck Iran's Damascus consulate in April 2024 and when Iran launched missiles at Israel that October.</span></p><p class=\"\"><span>All episodes were short-lived and followed by quick shekel rebounds. However, JPMorgan said it could be different this time if the conflict and a rise in market risk premia proved more persistent.     </span></p><p class=\"\"><span>\"This would especially be the case if confrontation with Iran also triggers more intensive operations against Iran’s proxies,\" the Wall Street bank said.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:979.3103448275863px;aspect-ratio:1.632183908045977\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-a5c7ef04b636f04b1983b9c77d8701e0-resized.webp\" type=\"image/webp\"/><img alt=\"Wall Street's fear gauge, the VIX Index, is contained for now\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-a5c7ef04b636f04b1983b9c77d8701e0-resized.webp\" style=\"background-color:#faf7f3\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Wall Street's fear gauge, the VIX Index, is contained for now</span></figcaption></figure><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:932.1663019693653px;aspect-ratio:1.5536105032822756\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-a8b7c68130dd075dca7a8506b6e53df6-resized.webp\" type=\"image/webp\"/><img alt=\"Israel's shekel has strengthened against the dollar\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-a8b7c68130dd075dca7a8506b6e53df6-resized.webp\" style=\"background-color:#fbf8f5\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Israel's shekel has strengthened against the dollar</span></figcaption></figure><p class=\"\"><span>SAFE-HAVENS DO THEIR THING</span></p><p class=\"\"><span>The Swiss franc </span><span>, widely regarded as a safe haven in times of turmoil, is expected to face further upward pressure, creating a headache for the Swiss National Bank. It is up 3% this year against the U.S. dollar.</span></p><p class=\"\"><span>Investors could also make another dash for gold </span><span>, which has had a record run and is up 22% so far in 2026, and into silver </span><span>, which has also been on a roll.</span></p><p class=\"\"><span>The conflict could also add to demand for U.S. Treasuries </span><span> whose yields have been falling in the past few weeks. </span></p><p class=\"\"><span>The outlier has been bitcoin </span><span>, no longer seen as a haven. It fell 2% on Saturday and has shed more than a quarter of its value in two months.</span></p><p class=\"\"><span>WATCH MIDDLE EAST MARKETS</span></p><p class=\"\"><span>Trading in bourses in the Middle East on Sunday, including Saudi Arabia and Qatar, will provide an initial indicator of investor sentiment. While these markets are highly correlated to oil prices, an escalating conflict could ripple through the economies. </span></p><p class=\"\"><span>\"I suspect markets will be down if these hostilities continue through the day,” said Ryan Lemand, chief executive officer and co-founder of Neovision Wealth Management. Depending on the scale of the conflict, Gulf equities could drop by 3-5%, he said. </span></p><p class=\"\"><span>Saudi Arabia's benchmark stock index </span><span> dropped 1.3% in five days through Thursday, its second consecutive week of declines. Dubai's main market </span><span>, which reopens on Monday, fell in the last two weeks.     </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:768.9530685920578px;aspect-ratio:1.2815884476534296\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-e98e5f64d1c974e7386697f16434ccf5-resized.webp\" type=\"image/webp\"/><img alt=\"The chart shows monthly average shipping trade volumes through Strait of Hormuz fell to record low in January after US military buildup\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L8N3ZG1KN-e98e5f64d1c974e7386697f16434ccf5-resized.webp\" style=\"background-color:#f9f9f9\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Maritime trade near Iran fell after US military buildup</span></figcaption></figure><p class=\"\"><span>AIRLINE &amp; DEFENCE STOCKS   </span></p><p class=\"\"><span>Global airlines cancelled flights across the Middle East on Saturday, and their stocks could be under pressure if the conflict spreads and forces more airspace closures.</span></p><p class=\"\"><span>European weapons makers (.SXPARO), up 10% this year, could see more demand.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZG1KN:0-how-us-iran-tensions-could-shape-world-markets/",
            "pub_date": "2026-02-28 21:28:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO06C:0",
            "title": "Berlin puts Rosneft units into trusteeship to control German assets",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    The German government has placed the German units of Russia's Rosneft </span><span> under a trusteeship, the economy ministry said on Saturday, as Berlin seeks to establish long-term control over the German assets of the Russian oil group.</span></p><p class=\"\"><span>The assets, which include a stake in the PCK Schwedt refinery, were placed in the German government's trusteeship in 2022 after Moscow's invasion of Ukraine shook Germany's decades-long energy ties with Russia.</span></p><p class=\"\"><span>However, that trusteeship has to be renewed every six months on grounds of preserving energy security, creating uncertainty mainly over the PCK Schwedt refinery, which supplies most of the fuel to Berlin.</span></p><p class=\"\"><span>In its attempt to find a structural solution, the latest move puts Rosneft Deutschland (RDG) and RN Refining &amp; Marketing (RNRM) under the control of Germany's Bundesnetzagentur energy regulator, said the ministry.</span></p><p class=\"\"><span>The regulator will assume authority over the companies’ stakes in the PCK Schwedt, MiRO Karlsruhe and Bayernoil refineries.</span></p><p class=\"\"><span>The European Commission had earlier this month approved the new trusteeship structure.</span></p><p class=\"\"><span>Rosneft Deutschland accounts for around 13% of Germany’s oil-processing capacity and is one of the country’s largest refining companies.</span></p><p class=\"\"><span>\"Ensuring security of supply remains the primary objective for all measures taken by the German government in relation to Rosneft Deutschland,\" said the ministry in a statement.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO06C:0-berlin-puts-rosneft-units-into-trusteeship-to-control-german-assets/",
            "pub_date": "2026-02-28 21:31:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0AF:0",
            "title": "Berkshire Hathaway profit falls on writedowns, lower insurance income",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Berkshire Hathaway </span><span> on Saturday said operating profit fell in the fourth quarter, as it wrote down investments in Kraft Heinz </span><span> and Occidental Petroleum </span><span> while income from its insurance businesses declined.</span></p><p class=\"\"><span>The quarter was Warren Buffett's last as the conglomerate's chief executive, a job now held by Greg Abel. Buffett remains chairman.</span></p><p class=\"\"><span>Berkshire also reported ending 2025 with $373.3 billion of cash, giving Abel the firepower to make the kind of major acquisitions that eluded Buffett over the last decade.</span></p><p class=\"\"><span>Quarterly operating profit fell 30% to $10.2 billion, or about $7,092 per Class A share, from $14.53 billion a year earlier.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0AF:0-berkshire-hathaway-profit-falls-on-writedowns-lower-insurance-income/",
            "pub_date": "2026-02-28 21:25:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0DW:0",
            "title": "Berkshire Hathaway Says Q4 Net Earnings Per Average Equivalent Class A Share Is $13,349",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Berkshire Hathaway Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BERKSHIRE HATHAWAY: Q4 NET EARNINGS PER AVERAGE EQUIVALENT CLASS A SHARE IS $13,349</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BERKSHIRE HATHAWAY : BERKSHIRE HATHAWAY: Q4 NET EARNINGS ATTRIBUTABLE TO BERKSHIRE SHAREHOLDERS IS $19,199 MILLION VERSUS $19,694 MILLION YEAR-EARLIER</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BERKSHIRE HATHAWAY Q4 OPERATING INCOME USD 10,200 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BERKSHIRE HATHAWAY: Q4 NET GAIN  FROM INVESTMENTS $13,494 MILLION VERSUS YEAR-EARLIER $5,167 MILLION GAIN</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BERKSHIRE HATHAWAY: AT DECEMBER 31, 2025, INSURANCE FLOAT WAS APPROXIMATELY $176 BILLION AN INCREASE OF $5 BILLION SINCE YEAR END 2024</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0DW:0-berkshire-hathaway-says-q4-net-earnings-per-average-equivalent-class-a-share-is-13-349/",
            "pub_date": "2026-02-28 21:13:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:7bd875e47094b:0",
            "title": "ZachXBT Exposes Axiom Insider Trading On Solana: Here’s What To Know",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>ZachXBT, a crypto investigator, claimed that an Axiom employee accessed internal systems to link user accounts to private wallet addresses and monitor their trading activity.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>A recorded February 2026 call allegedly discussed a $200,000 profit plan, with claims that similar activity may date back to early 2025.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The controversy unfolded amid a lawsuit by Jane Street and nearly $39 million in Polymarket bets speculating on the firm named in the exposé.</span></li></ul></span></div><span><p class=\"\"><span>Crypto investigator ZachXBT alleged on Wednesday that an employee at the Solana-based trading platform Axiom misused internal tools to access private wallet data, raising concerns about insider trading.</span></p><p class=\"\"><span>In a detailed thread on X, Zach, an on-chain investigator and advisor at Paradigm, accused Broox Bauer, a business development employee at Axiom, of using an internal dashboard to link user accounts to specific wallet addresses. While blockchain transactions on Solana are publicly visible, the identities behind those wallets typically are not. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:638.0530973451328px;aspect-ratio:1.0634218289085546\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:7bd875e47094b-200e5d5ad9b37f7b0874a5339149f2d7-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-02-28 at 8.03.51 AM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:7bd875e47094b-200e5d5ad9b37f7b0874a5339149f2d7-resized.webp\" style=\"background-color:#9d9e9f\"/></picture></div></button></figure><p class=\"\"><span>Axiom is a privately held Solana-based trading platform started in 2024. </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/solana\" rel=\"nofollow\" target=\"_blank\">Solana (SOL)</a><span> was trading at $78, down 5.0% in the last 24 hours. On Stocktwits, retail sentiment around SOL remained in ‘bearish’ territory, with chatter levels dropping from ‘normal’ to ‘low’ over the past days. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Axiom Internal Tools Exposed User Wallet Clusters</span></strong></p><p class=\"\"><span>According to the investigation, Axiom’s internal systems allegedly displayed registration wallets, connected addresses, referral codes, and related account identifiers. Screenshots shared in the thread showed wallet clusters tied to individual users. Zach claimed there were limited monitoring safeguards governing how those internal tools were accessed.</span></p><p class=\"\"><span>The crypto investigator talked about a recorded call in which Bauer allegedly stated he could identify users through referral codes, wallet linkages, or user IDs. Zach further alleged that wallet information was compiled into shared spreadsheets to monitor trading activity linked to key opinion leaders (KOLs). He noted that conclusively proving insider trading would require access to Axiom’s internal logs to determine whether wallet lookups occurred before specific trades.</span></p><p class=\"\"><span>Zach alleged that during a February 2026 recorded call, Bauer outlined a plan to help an associate generate $200,000 quickly by leveraging his access to Axiom’s internal systems. He further claimed the conduct was consistent with similar activity dating back to early 2025.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:582.1693907875186px;aspect-ratio:0.9702823179791977\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:7bd875e47094b-6e28f3f739f23ace8b698291664150ba-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-02-28 at 8.06.46 AM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:7bd875e47094b-6e28f3f739f23ace8b698291664150ba-resized.webp\" style=\"background-color:#818386\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Private Wallet Mapping At The Center Of Allegations</span></strong></p><p class=\"\"><span>At the center of the controversy was wallet attribution. Although on-chain transactions are transparent, mapping wallets to specific users provided a significant informational advantage, particularly in fast-moving memecoin markets where tracking large traders often influences price action.</span></p><p class=\"\"><span>Zach claimed that he had been retained to independently investigate alleged misconduct at Axiom and that the findings were the result of that review. He also stated that given Bauer’s location in New York, the matter could potentially fall within the jurisdiction of federal prosecutors, though no charges have been filed.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Growing Insider Trading Concerns</span></strong></p><p class=\"\"><span>The Axiom allegations came amidst heightened scrutiny around insider activity in crypto markets.</span></p><p class=\"\"><span>Earlier this week, the administrator overseeing Terraform Labs’ wind-down filed a lawsuit </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/cryptocurrency/analysts-are-calling-jane-street-am-bitcoin-dump-theory-fake-news/cZTdZNBRIcR\" rel=\"nofollow\" target=\"_blank\">against trading firm Jane Street</a><span>, alleging that the firm used nonpublic information to profit during Terraform’s collapse. Jane Street has not admitted wrongdoing, but the case renewed debate about how informational asymmetries operate in digital asset markets.</span></p><p class=\"\"><span>At the same time, lawmakers in the United States have pushed for tighter oversight of prediction markets last month. Several Democratic politicians co-sponsored the Public Integrity in Financial Prediction Markets Act of 2026, a bill that would prohibit elected officials from trading contracts tied to policies under their control.</span></p><p class=\"\"><span>ZachXBT’s investigation also triggered significant activity on Polymarket after he teased an insider trading exposé days before naming Axiom. Participants speculated on which crypto firm would be targeted, driving nearly $39 million in volume across related contracts. Wallets linked to major market participants, including President Trump’s World Liberty Financial, were observed taking positions as probabilities swung sharply before details were publicly disclosed.</span></p><p class=\"\"><span>Axiom said it removed access to the internal tools referenced in the allegations and is investigating the matter. The company has not publicly disclosed the outcome of that review.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:7bd875e47094b:0/",
            "pub_date": "2026-02-28 21:13:58",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000008:0",
            "title": "Berkshire Hathaway Operating Earnings Fell 30% in Fourth Quarter. There Were No Stock Buybacks. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Andrew Bary</span></p><p class=\"\"><span>The inaugural shareholder letter from  Berkshire Hathaway CEO Greg Abel is due on Saturday, along with Berkshire's annual report and fourth-quarter earnings. Wall Street will be on alert for Abel's insights on key issues such as dividends and stock repurchases.</span></p><p class=\"\"><span>Abel, 63, became CEO at year-end when Warren Buffett retired from the job after 60 years at the helm. Abel was Buffett's handpicked successor and had overseen the company's vast non-insurance operating units for nearly eight years before becoming CEO.</span></p><p class=\"\"><span>Buffett, 95, remains chairman, is the company's controlling shareholder and has said he plans to be at Berkshire's Omaha offices daily this year.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000008:0/",
            "pub_date": "2026-02-28 21:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:70749b60c094b:0",
            "title": "SONORO ANNOUNCES UPDATED MINERAL RESOURCE ESTIMATE AND ROBUST UPDATED PEA FOR CERRO CALICHE GOLD PROJECT: AFTER-TAX NPV OF USD $224 MILLION AND AFTER-TAX IRR OF 50%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>VANCOUVER, Canada, Feb. 28, 2026 (GLOBE NEWSWIRE) -- </span><strong class=\"root-Tkn6WL2y\"><span>Sonoro Gold Corp. </span></strong><span> | </span><span>OTCQB:SMOFF</span><span> | </span><span>FRA:23SP</span><span> (“Sonoro” or the “Company”) is pleased to announce the results of an independent updated Mineral Resource Estimate (“MRE”) and updated Preliminary Economic Assessment (“PEA”) on the Company’s Cerro Caliche gold project located in Sonora State, Mexico. The PEA demonstrates the potential viability for a ten-year life of mine (“LOM”), open pit, heap leach mining operation with an initial one-year ramp up production rate of 12,000 tonnes per day (“tpd”) and an increase to 16,000 tpd for the remaining LOM. All currency is stated as USD.</span></p><p class=\"\"><span>The updated MRE and PEA have been prepared in accordance with the requirements of National Instrument 43-101 (“NI 43-101”) by P&amp;E Mining Consultants Inc., of Brampton, Ontario (“P&amp;E”).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Updated PEA Highlights</span></strong><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Base Case Prices of $3,500/oz gold and $48/oz silver</span></li><li class=\"listItem-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Pre-Tax net present value discounted at 8% (“NPV8”) of $360 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Pre-Tax Internal Rate of Return (“IRR”) of 65%</span></li><li class=\"listItem-bmN0_SHH\"><span>After-Tax NPV8” of $224 million</span></li><li class=\"listItem-bmN0_SHH\"><span>After-Tax IRR of 50%</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><span>Spot Prices of $5,186/oz gold and $88/oz silver</span></li><li class=\"listItem-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Pre-Tax NPV8 of $846 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Pre-Tax IRR of 121%</span></li><li class=\"listItem-bmN0_SHH\"><span>After-Tax NPV8” of $525 million</span></li><li class=\"listItem-bmN0_SHH\"><span>After-Tax IRR of 91%</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><span>Gold recovery of 72% and silver recovery of 27% </span></li><li class=\"listItem-bmN0_SHH\"><span>10-year LOM with 459 k ounces (“oz”) of gold equivalent (“AuEq”) </span></li><li class=\"listItem-bmN0_SHH\"><span>LOM annual average production of 46 k oz AuEq at 0.38 g/t AuEq</span></li><li class=\"listItem-bmN0_SHH\"><span>Initial CAPEX costs of $83 million, including $11 million in contingency</span></li><li class=\"listItem-bmN0_SHH\"><span>Sustaining capital costs of $26 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Cash(1) operating costs of $1,842/oz AuEq</span></li><li class=\"listItem-bmN0_SHH\"><span>AISC(2) of $1,902/oz AuEq </span></li><li class=\"listItem-bmN0_SHH\"><span>Payback period of 1.7 years </span></li></ul><p class=\"\"><em><span>Note:A</span><span>ll currencies are reported in U.S. dollars. Base case parameters assume $3,500/oz gold and $48/oz silver.</span></em></p><p class=\"\"><em><span>(1) Cash operating costs include mining, crushing, processing, assaying, administration and royalties.</span></em></p><p class=\"\"><em><span>(2) All-in-Sustaining Costs include cash costs plus sustaining capital and reclamation costs</span></em><em><span>.</span></em></p><p class=\"\"><em><span>“This updated PEA and MRE clearly illustrates a significant increase in value of the Cerro Caliche project as a result of higher gold prices and a revised mine plan with increased production rates,”</span></em><span> said Kenneth MacLeod, President and CEO of Sonoro Gold. </span><em><span>“With less than 30% of the known mineralized zones at the original Cerro Caliche concession drilled and assayed to date and the recent near-tripling of the concession size to the north and south, the potential for future expansion of the proposed mine, both in capacity and LOM, are considered to be favourable.”</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong><span>Updated Mineral Resource Estimate</span></strong></p><p class=\"\"><span>Mineral Resources are estimated using a three-dimensional block model with a block size of 5 x 5 x 5 m. Drill holes, collared from surface, penetrate the steeply dipping mineralized zones to depths of generally within 125 m below surface, however, several drill holes have intersected gold mineralization to depths approaching 200 m below surface. </span></p><p class=\"\"><span>The Mineral Resource Estimate was generated using drill hole sample assay results and the interpretation of a geological model which relates to the spatial distribution of gold and silver. Interpolation characteristics are defined based on the geology, drill hole spacing, and geostatistical analysis of the data. The effects of outlying high-grade sample data, composited to 1.52 m intervals, were controlled by traditional capping of the composites. </span></p><p class=\"\"><span>Block grades were estimated using Inverse Distance Cubed (“ID3”) and have been validated using a combination of visual and statistical methods. Estimated blocks within 30 m of three or more drill holes were classified as Measured Mineral Resources, and blocks within 60 m of two or more drill holes were classified as Indicated Mineral Resources. Blocks within 120 m of a drill hole were classified as Inferred Mineral Resources. </span></p><p class=\"\"><span>Subsequent to the initial classification, blocks were re-classified using a maximum a-posteriori selection pass that corrected isolated classification artifacts and consolidated areas of similar classification into continuous shapes. The Mineral Resource Estimate has an effective date of December 4, 2025.</span></p><p class=\"\"><span>The updated PEA utilizes the pit-constrained updated Mineral Resource Estimate prepared by P&amp;E.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"8\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>Mineral Resource Estimate</span></strong><strong class=\"root-Tkn6WL2y\"><span>(1-7)</span></strong><span> </span></td></tr><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Classification</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Tonnes </span></strong><strong class=\"root-Tkn6WL2y\"><span>k</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Au</span></strong><strong class=\"root-Tkn6WL2y\"><span>g/t</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Au</span></strong><strong class=\"root-Tkn6WL2y\"><span>koz</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Ag</span></strong><strong class=\"root-Tkn6WL2y\"><span>g/t</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Ag</span></strong><strong class=\"root-Tkn6WL2y\"><span>koz</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>AuEq</span></strong><strong class=\"root-Tkn6WL2y\"><span>g/t</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>AuEq</span></strong><strong class=\"root-Tkn6WL2y\"><span>koz</span></strong><span> </span></td></tr><tr><td><span> Measured </span></td><td><span> 9,683 </span></td><td><span> 0.41 </span></td><td><span> 129 </span></td><td><span> 3.5 </span></td><td><span> 1,086 </span></td><td><span> 0.43 </span></td><td><span> 133 </span></td></tr><tr><td><span> Indicated </span></td><td><span> 42,070 </span></td><td><span> 0.36 </span></td><td><span> 489 </span></td><td><span> 3.8 </span></td><td><span> 5,144 </span></td><td><span> 0.38 </span></td><td><span> 511 </span></td></tr><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Meas + Ind</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>51,752</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>0.37</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>617</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>3.7</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>6,230</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>0.39</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>644</span></strong><span> </span></td></tr><tr><td><span> Inferred </span></td><td><span> 8,801 </span></td><td><span> 0.33 </span></td><td><span> 93 </span></td><td><span> 3.7 </span></td><td><span> 1,040 </span></td><td><span> 0.34 </span></td><td><span> 97 </span></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Mineral Resources have been estimated in accordance with Canadian Institute of Mining and Metallurgy and Petroleum (\"CIM\") definitions, as required under National Instrument 43-101 (\"NI43-101\").</span></li><li class=\"listItem-bmN0_SHH\"><span>Mineral Resources have been reported using a cut-off of 0.13 g/t AuEq.</span></li><li class=\"listItem-bmN0_SHH\"><span>Mineral Resources are contained within an optimized pit shell.</span></li><li class=\"listItem-bmN0_SHH\"><span>Silver and Gold Equivalents were calculated from the interpolated block values using process recoveries and prices between the component metals to determine final AuEq values. </span></li><li class=\"listItem-bmN0_SHH\"><span>Mineral Resources are not Mineral Reserves until they have demonstrated economic viability. Mineral Resource Estimates do not account for a Mineral Resource's mineability, selectivity, mining loss, or dilution.</span></li><li class=\"listItem-bmN0_SHH\"><span>An Inferred Mineral Resource has a lower level of confidence than that applying to an Indicated Mineral Resource and must not be converted to a Mineral Reserve. It is reasonably expected that the majority of Inferred Mineral Resources could be upgraded to Indicated Mineral Resources with continued exploration. </span></li><li class=\"listItem-bmN0_SHH\"><span>All figures are rounded to reflect the relative accuracy of the estimate and therefore numbers may not appear to sum precisely.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Updated PEA Summary</span></strong></p><p class=\"\"><span>The updated PEA is preliminary in nature and includes Inferred Mineral Resources that are considered too speculative to have the economic considerations applied to them that would enable them to be categorized as Mineral Reserves and there is no certainty the estimates presented in the updated PEA will be realized. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em><span>Table 1: Key Economic Parameters</span></em></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Assumption / Results</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>PEA Value</span></strong><span> </span></td></tr><tr><td><span> Pre-Tax NPV(8) ($ million) </span></td><td><span> $360M </span></td></tr><tr><td><span> Pre-Tax IRR (%) </span></td><td><span> 65% </span></td></tr><tr><td><span> After- Tax NPV(8) ($ million) </span></td><td><span> $224M </span></td></tr><tr><td><span> After- Tax IRR (%) </span></td><td><span> 50% </span></td></tr><tr><td><span> Revenues ($ million) </span></td><td><span> $1,602M </span></td></tr><tr><td><span> Total Tonnes Processed (million) </span></td><td><span> 52.8M </span></td></tr><tr><td><span> Total Tonnes Waste Mined (million) </span></td><td><span> 82.1M </span></td></tr><tr><td><span> Mine Life (years) </span></td><td><span> 10 </span></td></tr><tr><td><span> Strip Ratio (waste: mineralization) </span></td><td><span> 1.6 </span></td></tr><tr><td><span> Gold Recovery (%) </span></td><td><span> 72% </span></td></tr><tr><td><span> Silver Recovery (%) </span></td><td><span> 27% </span></td></tr><tr><td><span> Gold Price ($/Au oz) </span></td><td><span> $3,500 </span></td></tr><tr><td><span> Silver Price ($/Ag oz) </span></td><td><span> $48 </span></td></tr><tr><td><span> Gold Grade (g/t Au) </span></td><td><span> 0.36 </span></td></tr><tr><td><span> Gold Equivalent Grade (g/t AuEq) </span></td><td><span> 0.38 </span></td></tr><tr><td><span> Silver Grade (g/t Ag) </span></td><td><span> 3.7 </span></td></tr><tr><td><span> Total Gold Equivalent Recovered (koz) </span></td><td><span> 459 k </span></td></tr><tr><td><span> Initial CAPEX Costs ($ million) </span></td><td><span> $83M </span></td></tr><tr><td><span> Sustaining Capital Costs ($ million) </span></td><td><span> $26M </span></td></tr><tr><td><span> LOM Operating Costs ($ million) </span></td><td><span> $820M </span></td></tr><tr><td><span> LOM Operating Cost ($/tonne processed) </span></td><td><span> $15.54 </span></td></tr><tr><td><span> Cash Operating Cost ($/AuEq oz) </span></td><td><span> $1,842 </span></td></tr><tr><td><span> AISC ($/AuEq oz) </span></td><td><span> $1,902 </span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em><span>Table 2: Gold &amp; Silver Price Sensitivity</span></em></strong><strong class=\"root-Tkn6WL2y\"><em><span> Analysis </span></em></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Sensitivity</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>-20%</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>-10%</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Base Case</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>+10%</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>+20%</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Spot</span></strong><span> </span></td></tr><tr><td><span> Gold Price ($/oz) </span></td><td><span> $2,800 </span></td><td><span> $3,150 </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$3,500</span></strong><span> </span></td><td><span> $3,850 </span></td><td><span> $4,200 </span></td><td><span> $5,186 </span></td></tr><tr><td><span> Silver Price ($/oz) </span></td><td><span> $38 </span></td><td><span> $43 </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$48</span></strong><span> </span></td><td><span> $53 </span></td><td><span> $58 </span></td><td><span> $88 </span></td></tr><tr><td><span> Pre-Tax NPV(8) ($ million) </span></td><td><span> $166M </span></td><td><span> $263M </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$360M</span></strong><span> </span></td><td><span> $457M </span></td><td><span> $555M </span></td><td><span> $846M </span></td></tr><tr><td><span> Pre-Tax IRR (%) </span></td><td><span> 37% </span></td><td><span> 52% </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>65%</span></strong><span> </span></td><td><span> 78% </span></td><td><span> 89% </span></td><td><span> 121% </span></td></tr><tr><td><span> After-Tax NPV(8) ($ million) </span></td><td><span> $102M </span></td><td><span> $163M </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$224M</span></strong><span> </span></td><td><span> $284M </span></td><td><span> $344M </span></td><td><span> $525M </span></td></tr><tr><td><span> After-Tax IRR (%) </span></td><td><span> 29% </span></td><td><span> 40% </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>50%</span></strong><span> </span></td><td><span> 59% </span></td><td><span> 68% </span></td><td><span> 91% </span></td></tr><tr><td><span> After-Tax Payback (years) </span></td><td><span> 2.6 </span></td><td><span> 2.0 </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>1.7</span></strong><span> </span></td><td><span> 1.4 </span></td><td><span> 1.3 </span></td><td><span> 1.0 </span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em><span>Table 3: Operating &amp; Capital Sensitivity Analysis </span></em></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Sensitivity</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>-20%</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>-10%</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Base Case</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>+10%</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>+20%</span></strong><span> </span></td></tr><tr><td><span> Operating Costs – After-Tax NPV(8) ($ million) </span></td><td><span> $287 </span></td><td><span> $256M </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$224M</span></strong><span> </span></td><td><span> $192M </span></td><td><span> $160M </span></td></tr><tr><td><span> Operating Costs – IRR (%) </span></td><td><span> 61% </span></td><td><span> 56% </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>50%</span></strong><span> </span></td><td><span> 45% </span></td><td><span> 39% </span></td></tr><tr><td><span> Capital Costs – After-Tax NPV(8) ($ million) </span></td><td><span> $237 </span></td><td><span> $230M </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$224M</span></strong><span> </span></td><td><span> $217M </span></td><td><span> $210M </span></td></tr><tr><td><span> Capital Costs – IRR (%) </span></td><td><span> 60% </span></td><td><span> 55% </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>50%</span></strong><span> </span></td><td><span> 46% </span></td><td><span> 43% </span></td></tr></tbody></table></div><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>Capital Costs </span></strong></p><p class=\"\"><span>The estimated capital costs for the Cerro Caliche Gold Project are based on an open pit, heap leach operation with contract mining. Initial capital expenditures of $83 million, including 15% contingency, contemplates an initial one-year production rate of 12,000 tpd with an increase to 16,000 tpd in the second year of production. Costs include direct facility costs such as processing facilities and leach pad impoundment as well as infrastructure, site preparation and indirect costs such as EPCM, freight, spares, office equipment and light vehicles. Initial capital costs also include $19 million for a crushing/conveying circuit and $9 million for open pit pre-stripping.</span></p><p class=\"\"><span>An additional $26 million is estimated for sustaining capital, including heap leach pad expansion costs. Reclamation and closure costs are estimated at $4 million. </span></p><p class=\"\"><span>Capital cost estimates are based on industry standards and were developed using quotes provided by mining contractors and specialists experienced in mining development in Mexico.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><em><span>Table 4: Initial Capital Costs</span></em></strong></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Initial Capital Costs</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Costs (USD)</span></strong><span> </span></td></tr><tr><td><span> Site and General </span></td><td><span> $2M </span></td></tr><tr><td><span> Utilities and Services </span></td><td><span> $4M </span></td></tr><tr><td><span> Process Plant </span></td><td><span> $47M </span></td></tr><tr><td><span> Owners Costs </span></td><td><span> $9M </span></td></tr><tr><td><span> Pre-Stripping and Mine Development </span></td><td><span> $10M </span></td></tr><tr><td><span> Contingency </span></td><td><span> $11M </span></td></tr><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Total </span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$83M</span></strong><span> </span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><em><span>Table 5: Sustaining Capital Costs </span></em></strong></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Sustaining Costs</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Costs (USD)</span></strong><span> </span></td></tr><tr><td><span> Process Plant </span></td><td><span> $20M </span></td></tr><tr><td><span> Mining </span></td><td><span> $1M </span></td></tr><tr><td><span> Owners Costs </span></td><td><span> $2M </span></td></tr><tr><td><span> Contingency </span></td><td><span> $3M </span></td></tr><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Total </span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$26M</span></strong><span> </span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Operating Costs </span></strong></p><p class=\"\"><span>Cash operating costs for Cerro Caliche’s LOM are estimated at $820 million and average $15.54 per tonne processed and includes mining, crushing and processing, as well as maintenance and administration costs. All-in Sustaining Costs (“AISC”) for LOM are estimated at $873 million or $1,902 per gold equivalent ounce and include operating costs, sustaining capital, reclamation, royalties, and refining charges. </span></p><p class=\"\"><span>Royalties include a 2% Net Smelter Return (“NSR”) to certain landholders and a 1% NSR payment to the Mexican government for mining duty taxes. The two landholder royalties are assumed to be bought out at the first opportunity for payments of $2 million each. Refining costs include carbon processing and production and treatment of doré bars.</span></p><p class=\"\"><span>Open pit mining will be undertaken by a contractor and carried out by drill and blast, conventional loading and truck haulage to the crushing or waste rock storage facility. An estimated mining cost of $3.15 per tonne mined includes drilling, blasting, loading, and hauling mineralized feed to the primary crusher or waste rock to either an ex-pit storage facility or in-pit facilities once there is space available. </span></p><p class=\"\"><span>The processing facilities at Cerro Caliche will be comprised of a crushing circuit where mineralized material is processed through a three-stage crushing plant to produce material that is P80 of ½” (80% passing). The material is then conveyed and stacked in a conventional heap leach pad and irrigated with a low concentrate cyanide solution. An estimated crushing cost of $1.52 per tonne includes the cost of crushing and conveying. </span></p><p class=\"\"><span>Solution collected from the leach pad is then directed through a system of channels to the processing ponds where it passes through a series of carbon columns. Gold and silver impregnated carbon is collected periodically from the columns and then dried and stripped for doré bar production. An estimated LOM average processing cost of $7.13 per tonne includes crushing, leaching, assaying, labour and production of doré bars.</span></p><p class=\"\"><span>Operating cost estimates are based on industry standards and were developed using quotes provided by mining contractors and specialists experienced in mining development in Mexico.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><em><span>Table 6: Operating Costs</span></em></strong></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Operating Costs</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>LOM (USD)</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$/t Processed</span></strong><span> </span></td></tr><tr><td><span> Mining </span></td><td><span> $416M </span></td><td><span> $7.88 </span></td></tr><tr><td><span> Processing </span></td><td><span> $376M </span></td><td><span> $7.13 </span></td></tr><tr><td><span> Administration </span></td><td><span> $28M </span></td><td><span> $0.53 </span></td></tr><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Total </span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$820M</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$15.54</span></strong><span> </span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><em><span>Table 7: All-in-Sustaining Costs</span></em></strong></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>AISC Costs</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>LOM (USD)</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$/oz AuEq</span></strong><span> </span></td></tr><tr><td><span> Operating Costs </span></td><td><span> $820M </span></td><td><span> $1,786 </span></td></tr><tr><td><span> Royalties </span></td><td><span> $25M </span></td><td><span> $55 </span></td></tr><tr><td><span> Sustaining </span></td><td><span> $26M </span></td><td><span> $57 </span></td></tr><tr><td><span> Mill Salvage Value (10% of equipment) </span></td><td><span> $(3)M </span></td><td><span> $(6) </span></td></tr><tr><td><span> Closure </span></td><td><span> $4M </span></td><td><span> $ 9 </span></td></tr><tr><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>Total </span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$873M</span></strong><span> </span></td><td><span> </span><strong class=\"root-Tkn6WL2y\"><span>$ 1,902 </span></strong><span> </span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Qualified Person Statement</span></strong></p><p class=\"\"><span>Eugene Puritch, P.Eng, FEC, CET, Andrew Bradfield, P.Eng., William Stone, PhD, P.Geo., Fred Brown, P.Geo., Jarita Barry, P.Geo., David Burga, P.Geo., and D. Grant Feasby, P.Eng all of P&amp;E Mining Consultants Inc. are independent of the Company and are Qualified Persons as defined in NI 43-101. </span></p><p class=\"\"><span>Eugene Puritch, P.Eng., FEC, CET and Stephen Kenwood, P.Geo., of Sonoro Gold, both Qualified Persons within the context of NI 43-101 and have read and approved this news release. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About P&amp;E Mining Consultants Inc.</span></strong></p><p class=\"\"><span>P&amp;E, established in 2004, provides geological and mine engineering consulting reports, Mineral Resources Estimate technical reports, Preliminary Economic Assessments and Pre-Feasibility Studies. In addition, P&amp;E is affiliated with major consulting firms for the purposes of joint venturing on Feasibility Studies. Our experience covers over 480 technical reports on diamonds, most metallic deposits including gold, silver, base metals, PGM and iron for both open pit and underground deposits. Software packages utilized include Gemcom, Leapfrog, Whittle, NPV Scheduler, Vulcan, Ventsim, AutoCAD and Deswik. P&amp;E’s 22 associates have experience in geological interpretation, 3D geological modelling, technical report writing, Mineral Resources and Mineral Reserves Estimates, property evaluations, mine design, production scheduling, operating and capital cost estimates, and metallurgical engineering.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Sonoro Gold Corp.</span></strong></p><p class=\"\"><span>Sonoro Gold Corp. is a publicly listed exploration and development Company holding the near-development-stage Cerro Caliche project and the exploration-stage San Marcial project in Sonora State, Mexico. The Company has highly experienced operational and management teams with proven track records for the discovery and development of natural resource deposits.</span></p><p class=\"\"><span>On behalf of the Board of Sonoro Gold Corp.</span></p><p class=\"\"><span>Per:</span><em><span>“Kenneth MacLeod”</span></em></p><p class=\"\"><span> Kenneth MacLeod</span></p><p class=\"\"><span> President &amp; CEO</span></p><p class=\"\"><span>For further information, please contact: </span></p><p class=\"\"><span>Sonoro Gold Corp. - Tel: (604) 632-1764 </span></p><p class=\"\"><span>Email: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=ZsGdYeOMxHrliqge_5rUBku6blRfsWG_sm2RESyY5LOq-Ee7RU93CSptDCy376WmyyRISXMnAYoLzbzMX4sDQV5Avfr-FLIR4odDvzAkLgM=\" rel=\"nofollow\" target=\"_blank\">info@sonorogold.com</a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em><span>Forward-Looking Statement Cautions:</span></em></strong></p><p class=\"\"><em><span>This press release may contain \"forward-looking information\" as defined in applicable Canadian securities legislation. All statements other than statements of historical fact, included in this release, including, without limitation, statements regarding the Cerro Caliche project, and future plans and objectives of the Company, constitute forward looking information that involve various risks and uncertainties, including statements regarding completion of an updated preliminary economic assessment of the Cerro Caliche Gold project.. Although the Company believes that such statements are reasonable based on current circumstances, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"aims\", \"potential\", \"goal\", \"objective\", \"prospective\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"can”, \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made and they involve a number of risks and uncertainties, including the possibility of unfavorable exploration and test results, the lack of sufficient future financing to carry out exploration and development plans and unanticipated changes in the legal, regulatory and permitting requirements for the Company’s exploration programs. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law or the policies of the TSX Venture Exchange. Readers are encouraged to review the Company’s complete public disclosure record on SEDAR at www.sedar.com.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em><span>This press release does not constitute or form a part of any offer or solicitation to purchase or subscribe for securities in the United States. The securities referred to herein have not been and will not be registered under the Securities Act of 1933, as amended (the “Securities Act”), or with any securities regulatory authority of any state or other jurisdiction in the United States, and may not be offered or sold, directly or indirectly, within the United States or to, or for the account or benefit of, U.S. persons, as such term is defined in Regulation S under the Securities Act (“Regulation S”), except pursuant to an exemption from or in a transaction not subject to the registration requirements of the Securities Act”</span></em></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.</span></em></strong></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:70749b60c094b:0-sonoro-announces-updated-mineral-resource-estimate-and-robust-updated-pea-for-cerro-caliche-gold-project-after-tax-npv-of-usd-224-million-and-after-tax-irr-of-50/",
            "pub_date": "2026-02-28 21:00:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:69ebf507b094b:0",
            "title": "Why institutions still prefer Ethereum despite faster blockchains",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Ethereum continues to host the largest concentration of stablecoins and decentralized finance (DeFi) capital, even as successive waves of faster networks emerge.</span></p><p class=\"\"><span>Newer blockchains have promised higher throughput and lower costs, raising questions about whether institutional capital could eventually migrate away from Ethereum.</span></p><p class=\"\"><span>Kevin Lepsoe, founder of ETHGas and a former Morgan Stanley derivatives executive in Asia, said he expects Ethereum’s lead to endure, as institutions tend to prioritize capital depth over flashy performance.</span></p><p class=\"\"><span>“[Transactions per second] is the metric that gets engineers excited, but is that what drives capital to the blockchain?” Lepsoe asked in an interview with Cointelegraph.</span></p><p class=\"\"><span>“The capital is on Ethereum; the stablecoins are there. TradFi is looking at where the liquidity is,” he said.</span></p><p class=\"\"><span>Institutional capital brings scale and stability to a blockchain’s ecosystem. Large asset managers and tokenized fund issuers move capital in volumes that deepen liquidity and anchor stablecoin supply. Their presence can establish a network’s position beyond hype-driven retail activity that surges in bull markets and fades in downturns. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:798.1900452488688px;aspect-ratio:1.3303167420814481\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:69ebf507b094b-f51903e652dbba407b07647e6f0a71cf-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:69ebf507b094b-f51903e652dbba407b07647e6f0a71cf-resized.webp\" style=\"background-color:#191b1c\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Liquidity keeps Ethereum ahead of faster rivals</span></strong></p><p class=\"\"><span>If institutions prefer to operate where most of the money already sits, then simply making a faster blockchain will not pull capital away from Ethereum.</span></p><p class=\"\"><span>Over the past several cycles, performance has become a weapon to attract users. Solana has emerged as Ethereum’s high-speed alternative, dubbed an “Ethereum killer,” though that label is debated. It onboarded retail traders through the non-fungible token (NFT) boom and the memecoin frenzy, but the heightened activities weren’t sustained in the long run.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><span>Can Solana shed its memecoin image in 2026?</span></p><p class=\"\"><span>Solana now has its own generation of “Solana killers” that advertise higher theoretical transactions per second (TPS). But Ethereum’s liquidity grants tighter spreads, lower slippage for large trades and the capacity to absorb institutional-sized transactions without heavily distorting prices.</span></p><p class=\"\"><span>“I think of Ethereum as like downtown,” Lepsoe said.</span></p><div class=\"blockquote-xrkxvh37\"><span>“You could build a marketplace uptown somewhere in the suburbs and you could get far off market prices there, maybe it’s more convenient or maybe you like the vibe. But if you want the deepest liquidity, you go downtown, and that’s Ethereum.”</span></div><p class=\"\"><span>Though past crypto booms featured high-stakes retail speculation, the next phase is shaping up to include more institutional capital. As it stands, institutional players have expressed interest in practical use cases such as stablecoins and real-world assets (RWAs).</span></p><p class=\"\"><span>Even the world’s largest asset manager is leaning into RWA products. BlackRock’s USD Liquidity Fund (BUIDL) is its tokenized Treasury fund that started on Ethereum and branched out to several blockchains. Ethereum holds over a 30% BUIDL market capitalization. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:438.22525597269623px;max-width:1200px;aspect-ratio:2.7383177570093458\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:69ebf507b094b-34509e3b0625e475c97c7c1849e30d98-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:69ebf507b094b-34509e3b0625e475c97c7c1849e30d98-resized.webp\" style=\"background-color:#f5f7f9\"/></picture></div></button></figure><p class=\"\"><span>Ethereum is the largest network for stablecoins as well, which BlackRock’s global head of market development, Samara Cohen, said are “becoming the bridge between traditional finance and digital liquidity.”</span></p><p class=\"\"><span>Ethereum leads the industry in stablecoin market cap, with $160.4 billion, according to DefiLlama.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ethereum’s L2 liquidity is returning to L1</span></strong></p><p class=\"\"><span>Though Lepsoe said liquidity depth shapes institutional preference, a network’s efficiency cannot be completely disregarded.</span></p><p class=\"\"><span>Ethereum has been adjusting its own technical profile. Transaction fees that once routinely spiked to virtually unusable prices have fallen significantly, as layer-2 rollups eased pressure on the main chain. These solutions brought in new problems of their own. Rollups fragmented liquidity across multiple environments.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><span>2026 is the year Ethereum starts scaling exponentially with ZK tech</span></p><p class=\"\"><span>Lepsoe described the liquidity fragmentation as a blessing in disguise for Ethereum. He argued that if L2s didn’t take away liquidity from the main chain, capital would have flown out to competitors.</span></p><p class=\"\"><span>“I think it actually saved the liquidity from going to other L1s, where they eventually probably couldn’t have brought it back,” he said.</span></p><p class=\"\"><span>Recently, Ethereum has shifted its focus back to scaling the main chain. Co-founder Vitalik Buterin said that many layer 2s have failed to decentralize, while the main chain is now sufficiently scaling.</span></p><p class=\"\"><span>“Both of these facts, for their own separate reasons, mean that the original vision of L2s and their role in Ethereum no longer makes sense, and we need a new path,” Buterin said in a recent X post. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:672.0670391061452px;aspect-ratio:1.1201117318435754\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:69ebf507b094b-958053f17b9dff98a63d6858c505f24a-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:69ebf507b094b-958053f17b9dff98a63d6858c505f24a-resized.webp\" style=\"background-color:#e9eaea\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Scaling upgrades strengthen Ethereum’s liquidity advantage</span></strong></p><p class=\"\"><span>With transaction fees tamed, Ethereum is expected to execute the Glamsterdam fork in 2026, raising the block gas limit to 200 million from 60 million and putting its layer 1 on the road to 10,000 TPS over time.</span></p><p class=\"\"><span>For Ethereum, the timing coincides with institutions evaluating blockchain infrastructure for the next generation of financial services.</span></p><p class=\"\"><span>Alongside protocol upgrades, infrastructure providers are experimenting with ways to improve execution efficiency. Projects like Lepsoe’s ETHGas aim to optimize Ethereum’s block construction process through offchain execution and coordination, while Psy Protocol uses zero-knowledge technology to bundle multiple transactions into one.</span></p><p class=\"\"><span>Marcin Kaźmierczak, co-founder of blockchain oracle RedStone — which supplies data feeds for tokenized assets and institutional blockchain applications — said that Ethereum has the edge, as institutions prefer blockchains that have been battle-tested and around “for a very long time.” However, while institutions are “aggressively” expanding into Ethereum, they’re also shopping around.</span></p><p class=\"\"><span>“They look at Solana, which is getting good traction. Canton is extremely important for them because it gives them privacy, which they value very, very much,” Kaźmierczak told Cointelegraph.</span></p><p class=\"\"><span>Lepsoe said he sees “zero threat” from Solana or Canton, arguing that Ethereum still has the deepest liquidity pool, which is the primary draw for large allocators.</span></p><p class=\"\"><span>For institutional capital, performance improvements may expand Ethereum’s capacity, but liquidity remains its defining advantage. In blockchain markets, speed can attract users during booms, but capital tends to stay where the deepest markets already exist.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Magazine: </span></strong></em><span>6 massive challenges Bitcoin faces on the road to quantum security</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:69ebf507b094b:0-why-institutions-still-prefer-ethereum-despite-faster-blockchains/",
            "pub_date": "2026-02-28 21:00:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002141:0",
            "title": "My boss told me to dress better. Now I feel uncomfortable. He is a white man and I am a Black woman.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Aditi Shrikant</span></p><p class=\"\"><span>During my first review last year, he said, 'I just feel like you don't dress for the occasion'</span></p><p class=\"\"><span>\"I could feel him looking me up and down whenever I walked into the office.\" (Photo subjects are models.)</span></p><p class=\"\"><span>Dear Dollar Signs,</span></p><p class=\"\"><span>I was hired by this organization two years ago. When I first started working there, I could feel my boss's eyes on me. I felt like he was gossiping about me to a lot of people, and during one review, it became clear that he was.</span></p><p class=\"\"><span>I had old clothes from my previous job before the pandemic, and I realized they weren't up to date. I could feel him looking me up and down whenever I walked into the office. He is a white man, and as a Black woman, it was very disheartening. I often felt self-conscious, thinking, \"This man is looking at me like I'm some dirty woman.\"</span></p><p class=\"\"><span>During my first review last year, he said, \"I just feel like you don't dress for the occasion.\" Feeling like I'm always being judged and that he is talking about me to other people has made it hard for me to do a good job and learn. How am I supposed to deal with these kinds of comments from my manager and still thrive in my job?</span></p><p class=\"\"><span>Dressed Down</span></p><p class=\"\"><span>If you're just starting out on your money or career journey and have questions about how to navigate your finances, we want to hear from you. Write to Dollar Signs, MarketWatch's new advice column, at dollarsigns@marketwatch.com.</span></p><p class=\"\"><span>Dear Dressed,</span></p><p class=\"\"><span>First of all, I'm so sorry you're dealing with this kind of behavior. That comment is unhelpful and rude. It's also not uncommon.</span></p><p class=\"\"><span>I, too, was given feedback on my appearance during a job review when I was 23. It was my first salaried position, and I was told that I constantly looked like I had \"just woken up from a nap.\" It was jarring, to say the least, and I wasn't exactly sure what to take from an observation like that aside from offense.</span></p><p class=\"\"><span>Saying that \"you don't dress for the occasion\" is extremely vague. You could ask him what actionable steps you are expected to take, if any. It might also help to ask your colleagues if there is an unwritten dress code. Have they ever gotten similar feedback? What do they think about your attire? What might he be referring to? Perhaps he doesn't like jeans or open-toed shoes, even if they aren't officially banned.</span></p><p class=\"\"><span>Of course, you cannot unhear hurtful comments, but you can prevent them from impacting your performance.</span></p><p class=\"\"><span>Keita Williams, founder of the career coaching company Success Bully, says she \"wants to extend a virtual hug\" to you, as she has experienced similar treatment in the workplace.</span></p><p class=\"\"><span>\"Being a Black woman who is tall, I was viewed as aggressive whether I was aggressive or not,\" Williams says.</span></p><p class=\"\"><span>The key to managing emotions around comments that aren't productive - and, more importantly, aren't about your actual work performance - is to separate who you are from what is being said about you, Williams says.</span></p><p class=\"\"><span>\"That's their worldview, and navigating life as a Black woman, you're going to experience micro- and macroaggressions,\" she says. \"They are unavoidable. You cannot internalize them and let them chip away at your self-worth.\"</span></p><p class=\"\"><span>Crucially, there is a power imbalance here, which threatens your psychological safety at work. The reason you're finding it hard to learn is that you don't feel safe or supported. Does this company have a culture of training on workplace behavior and how to treat employees?</span></p><p class=\"\"><span>Advocate for yourself</span></p><p class=\"\"><span>Next, you need to address the larger issue. Your boss may be bad-mouthing you to others. It might be tempting to confide in colleagues that you're having a hard time connecting with your manager, but that probably isn't a good idea, Williams says.</span></p><p class=\"\"><span>\"Allow your boss to be the unprofessional one,\" she says. \"If you try to out-petty someone, you only make yourself look worse, not the offender.\"</span></p><p class=\"\"><span>A better course of action is to talk yourself up. It sounds like your boss won't be your best advocate, which means you have to be even more vocal about your wins. That project that went smoothly? Mention how crucial you were to its success at the next lunch-and-learn. Did you spearhead a task flawlessly? Make sure those outside your team know about it.</span></p><p class=\"\"><span>\"Do your own personal PR,\" Williams says. \"Start your own rumor mill of positive news.\"</span></p><p class=\"\"><span>I know this can feel uncomfortable, but you know what's even more uncomfortable? Being unemployed.</span></p><p class=\"\"><span>I want to add that if comments about your appearance persist, you might want to consult your employee handbook and ask HR. It likely contains guidelines around dress code, and if your boss isn't adhering to them, you can go to HR.</span></p><p class=\"\"><span>His treatment might cross the line into harassment if you feel like it is about your race or gender, says Priya Rathod, the workplace-trends editor at Indeed.</span></p><p class=\"\"><span>\"What we always say is conflict is about the task and harassment is about the person behind the task,\" she says.</span></p><p class=\"\"><span>Generally speaking, I don't think HR is always the most helpful arm of any company, as it is designed to protect the company. But technically, it's also supposed to help shield the company from legal jeopardy. That includes protecting employees from discrimination.</span></p><p class=\"\"><span>\"If they ignore [your complaint], they could be liable for facilitating a hostile work environment,\" she says.</span></p><p class=\"\"><span>For that reason, it might be worth documenting with them that certain inappropriate comments are being made.</span></p><p class=\"\"><span>If you do want to bring a harassment case against your boss, you'll need to provide documentation of the comments. If snarky remarks are emailed or direct-messaged to you, screenshot and print them out. If the harassment is verbal, record exactly what was said along with the date and time.</span></p><p class=\"\"><span>You cannot help how others perceive or treat you, but you can control how you respond. Yes, it's upsetting to know that your boss is talking to others about something as trivial as your clothing. But ultimately, this is just a job. You need it to pay your rent, travel, and afford the things in life that truly bring you joy. Don't let these comments distract you from securing a consistent paycheck.</span></p><p class=\"\"><span>Most of all, you need to pay attention to your performance. Also, ask him about your goals and make sure that you are hitting them.</span></p><p class=\"\"><span>These observations are a reflection of him, not you. Do your job, talk yourself up, and cash that check.</span></p><p class=\"\"><span>Write to Dollar Signs at dollarsigns@marketwatch.com.</span></p><p class=\"\"><span>By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms.</span></p><p class=\"\"><span>-Aditi Shrikant</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002141:0/",
            "pub_date": "2026-02-28 21:00:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000687:0",
            "title": "Berkshire Hathaway Inc. News Release",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>OMAHA, Neb.--(BUSINESS WIRE)--February 28, 2026--</span></p><p class=\"\"><span>(BRK.A; BRK.B) --</span></p><p class=\"\"><span>Berkshire's operating results for the fourth quarter and full year of 2025 and 2024 are summarized in the following paragraphs. However, we urge investors and reporters to read our 2025 Annual Report, which has been posted at www.berkshirehathaway.com. The limited information that follows in this press release is not adequate for making an informed investment judgment.</span></p><p class=\"\"><span>Earnings of Berkshire Hathaway Inc. and its consolidated subsidiaries for the fourth quarter and full year of 2025 and 2024 are summarized below. Earnings are stated on an after-tax basis. (Dollar amounts are in millions, except for per share amounts).</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>                                   Fourth Quarter                      Full Year </span><br/><span>                           -------------------------------  ------------------------------- </span><br/><span>                                2025             2024            2025             2024 </span><br/><span>                           ---------------  --------------  ---------------  -------------- </span><br/><span> </span><br/><span>Net earnings attributable </span><br/><span> to Berkshire </span><br/><span> shareholders              $       19,199   $       19,694  $       66,968   $       88,995 </span><br/><span>                            =============    =============   =============    ============= </span><br/><span>Net earnings includes: </span><br/><span>    Investment gains </span><br/><span>     (losses)                      13,494            5,167          30,737           41,558 </span><br/><span>    Other-than-temporary </span><br/><span>     impairment of </span><br/><span>     investments in Kraft </span><br/><span>     Heinz and in </span><br/><span>     Occidental                    (4,495)              --          (8,255)              -- </span><br/><span>    Operating earnings             10,200           14,527          44,486           47,437 </span><br/><span>                            -------------    -------------   -------------    ------------- </span><br/><span>Net earnings attributable </span><br/><span> to Berkshire </span><br/><span> shareholders              $       19,199   $       19,694  $       66,968   $       88,995 </span><br/><span>                            =============    =============   =============    ============= </span><br/><span>Net earnings per average </span><br/><span> equivalent Class A </span><br/><span> Share                     $       13,349   $       13,695  $       46,563   $       61,900 </span><br/><span>Net earnings per average </span><br/><span> equivalent Class B </span><br/><span> Share                     $         8.90   $         9.13  $        31.04   $        41.27 </span><br/><span>Average equivalent Class </span><br/><span> A shares outstanding           1,438,223        1,438,022       1,438,223        1,437,720 </span><br/><span>Average equivalent Class </span><br/><span> B shares outstanding       2,157,335,139    2,157,034,121   2,157,335,139    2,156,580,296 </span><br/><span> </span><br/><span>      Note: Per share amounts for the Class B shares are 1/1,500(th) of those shown for the </span><br/><span>      Class A. </span><br/><span> </span></pre><p class=\"\"><span>Generally Accepted Accounting Principles (\"GAAP\") require that we include the changes in unrealized gains (losses) of our equity security investments as a component of investment gains (losses) in our earnings statements. In the table above, investment gains (losses) in 2025 include gains of $9.6 billion in the fourth quarter and $12.9 billion in the full year and in 2024 include gains of $2.1 billion in the fourth quarter and losses of $38.1 billion in the full year due to changes during the fourth quarter and the full year in the unrealized gains that existed in our equity security investment holdings. Investment gains (losses) in 2025 also include after-tax realized gains on sales of investments of $3.9 billion in the fourth quarter and $17.8 billion in the full year and in 2024 include gains of $3.1 billion in the fourth quarter and $79.6 billion in the full year.</span></p><p class=\"\"><span>The amount of investment gains (losses) in any given quarter is usually meaningless and delivers figures for net earnings per share that can be extremely misleading to investors who have little or no knowledge of accounting rules.</span></p><p class=\"\"><span>An analysis of Berkshire's operating earnings follows (dollar amounts are in millions).</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>                              Fourth Quarter       Full Year </span><br/><span>                             -----------------  ---------------- </span><br/><span>                              2025      2024     2025     2024 </span><br/><span>                             -------  --------  -------  ------- </span><br/><span> </span><br/><span> Insurance-underwriting      $ 1,561  $  3,409  $ 7,258  $ 9,020 </span><br/><span> Insurance-investment </span><br/><span>  income                       3,072     4,088   12,513   13,670 </span><br/><span> BNSF                          1,347     1,278    5,476    5,031 </span><br/><span> Berkshire Hathaway Energy </span><br/><span>  Company                        691       729    3,979    3,730 </span><br/><span> Manufacturing, service and </span><br/><span>  retailing                    3,370     3,262   13,647   13,072 </span><br/><span> Other*                          159     1,761    1,613    2,914 </span><br/><span>                              ------   -------   ------   ------ </span><br/><span> Operating earnings          $10,200  $ 14,527  $44,486  $47,437 </span><br/><span>                              ======   =======   ======   ====== </span><br/><span> </span><br/><span>*   (1) Includes foreign currency exchange gains related to </span><br/><span>     non-U.S. Dollar denominated debt in 2025 of approximately </span><br/><span>     $617 million in the fourth quarter and losses of $642 </span><br/><span>     million in the full year and in 2024 includes foreign </span><br/><span>     currency exchange gains related to non-U.S. Dollar </span><br/><span>     denominated debt of approximately $1.2 billion in the </span><br/><span>     fourth quarter and $1.1 billion in the full year. </span><br/><span> </span><br/><span> (2) Includes after-tax interest, dividend and other investment </span><br/><span>  income of Berkshire Hathaway (parent company) and certain </span><br/><span>  other related entities in 2025 of $927 million in the fourth </span><br/><span>  quarter and $3.6 billion in the full year and in 2024 includes </span><br/><span>  $450 million in the fourth quarter and $1.4 billion in the </span><br/><span>  full year. </span><br/><span> </span></pre><p class=\"\"><span>On December 31, 2025 there were 1,438,223 Class A equivalent shares outstanding. At December 31, 2025, insurance float (the net liabilities we assume under insurance contracts) was approximately $176 billion, an increase of $5 billion since yearend 2024.</span></p><p class=\"\"><span>Use of Non-GAAP Financial Measures</span></p><p class=\"\"><span>This press release includes certain non-GAAP financial measures. The reconciliations of such measures to the most comparable GAAP figures in accordance with Regulation G are included herein.</span></p><p class=\"\"><span>Berkshire presents its results in the way it believes will be most meaningful and useful, as well as most transparent, to the investing public and others who use Berkshire's financial information. That presentation includes the use of certain non-GAAP financial measures. In addition to the GAAP presentations of net earnings, Berkshire shows operating earnings defined as net earnings exclusive of investment gains (losses), impairments of goodwill and intangible assets and other-than-temporary impairments of equity method investments.</span></p><p class=\"\"><span>Although the investment of insurance and reinsurance premiums to generate investment income and investment gains or losses is an integral part of Berkshire's operations, the generation of investment gains or losses is independent of the insurance underwriting process. Moreover, as previously described, under applicable GAAP accounting requirements, we are required to include the changes in unrealized gains/losses of our equity security investments as a component of investment gains/losses in our periodic earnings statements. In sum, investment gains/losses for any particular period are not indicative of quarterly business performance.</span></p><p class=\"\"><span>About Berkshire</span></p><p class=\"\"><span>Berkshire Hathaway and its subsidiaries engage in diverse business activities including insurance and reinsurance, utilities and energy, freight rail transportation, manufacturing, services and retailing. Common stock of the company is listed on the New York Stock Exchange, trading symbols BRK.A and BRK.B.</span></p><p class=\"\"><span>Cautionary Statement</span></p><p class=\"\"><span>Certain statements contained in this press release are \"forward looking\" statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are not guaranties of future performance and actual results may differ materially from those forecasted.</span></p><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260228505745/en/</span></p><p class=\"\"><span>CONTACT:    Marc D. Hamburg</span></p><p class=\"\"><span>402-346-1400</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000687:0/",
            "pub_date": "2026-02-28 21:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zaw3j8vrh:0",
            "title": "ZAWYA-PRESSR: Ciena unveils the industry’s highest-density, lowest-power pluggable optical engine to meet data center AI demands",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>200G/lane CPO ideal for leading-edge 100 and next-generation 200 Tb/s ASICs</span></li><li class=\"listItem-bmN0_SHH\"><span>Single-wavelength solution natively enables full fan-out AI cluster interconnect networking</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dubai, UAE., –</span></strong><span> Building on its long history as the leader in high-speed connectivity – and marking the first product introduction following its acquisition of Nubis Communications – Ciena </span><span> is unveiling Vesta 200 6.4T CPX, the industry’s highest-density, lowest-power pluggable CPO solution. Designed to reduce power consumption by up to 70%, the solution helps hyperscalers, cloud providers, and data center operators evolve their architectures to reliably address AI workloads in both scale-out networks as well as next generation scale-up networks.</span></p><p class=\"\"><span>“We’re delivering the industry’s first truly flexible, open pluggable optical engine, removing barriers to CPO adoption and giving our customers exactly what they’ve been asking for: greater density, power efficiency, and reliability – all in an open, multi‑vendor ecosystem,” said Dino DiPerna, Senior Vice President of Global Research &amp; Development at Ciena. “We continue to innovate in response to evolving customer needs, allowing operators to scale AI clusters more efficiently, using less energy and space, while lowering overall infrastructure costs.”</span></p><p class=\"\"><span>Vesta 200 6.4T CPX provides more power-efficient optical interconnect and delivers the chip- edge density required for massive scale-up and scale-out networks on 200G/lane switches, XPUs, and NICs.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Key features include:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Ultra-high density</span></strong><span>: Achieves highest density pluggable CPO through Ciena’s internally developed co-optimized design, combined with unique 2D fiber interconnect technology. This enables compatibility with the smallest co-packaged copper connectors such as Samtec’s CPX and supports high-performance 200G/lane deployments in space-constrained NICs, XPU servers, and leading-edge 100T and next-generation 200T switches.</span></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Power reduction</span></strong><strong class=\"root-Tkn6WL2y\"><span>:</span></strong><span> Features retimer-free linear-drive operation, supporting a robust electrical loss budget of up to 20 dB from the host ASIC, enabling more flexible CPO architectures and saving up to 70% power versus traditional, retimed options.</span></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Superior reliability:</span></strong><span> Designed with ultra-high availability in mind, from high volume external light source to internally developed SiGe drivers and TIAs co-optimized with temperature-stable silicon photonics Mach-Zehnder–based transmitters, and high density standard CPX compression-free electrical connectors.</span></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New optical networking ecosystem:</span></strong><span> Provides access to an open, standards-based CPO ecosystem featuring a pluggable, CPX electrical interconnect and an IEEE802.3dj compliant optical interface enabling a flexible and diverse supply chain by promoting interoperability across multiple ASIC, optical, and electrical interconnect vendors.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Industry Comments:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>“Adoption of CPO has started. The next priority for operators is development of a competitive CPO ecosystem. Ciena’s solution offers a path for establishing such an ecosystem,” said Vladimir Kozlov, CEO of LightCounting. “An open, standards-based CPO ecosystem that creates a flexible and diverse supply chain, removing vendor lock-in and enabling interoperability across multiple ASIC, optical, and electrical interconnect vendors – is exactly what the customer would like to see.”</span></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>“As a leading provider of network infrastructure equipment for AI networks in the world, it is critical to align with our customers’ demand for higher performance, lower power, and higher reliability,” said Michael KT Lee, Senior VP of R&amp;D and Technology, Accton Technology. “To meet these constraints, we adopt new innovative optical technologies – whether CPO, NPO, or new pluggable form factors. We expect the use of CPO to accelerate dramatically over the next few years, and the availability of products like the Vesta 200 6.4T optical engine from Ciena will help address growing needs for next-generation scale-out and scale-up networks.”</span></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>“The unrivaled growth in XPU scale-up networks demands low-latency, low power, high-density optical interconnects at the signal source,” said Brian Vicich, CTO at Samtec. “The combination of Ciena’s Vesta 200 6.4T CPX optical engine and Samtec’s Si-Fly® HD CPX System offers AI system architects a dense interconnect solution to route 200G PAM4 data links directly from the substrate to the front panel.”</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Ciena</span></strong></p><p class=\"\"><span>Ciena is the global leader in high-speed connectivity. We build the world’s most advanced networks to support exponential growth in bandwidth demand. By harnessing the power of our networking systems, interconnects, automation software, and services, Ciena revolutionizes data transmission and network management. With unparalleled expertise and innovation, we empower our customers, partners, and communities to thrive in the AI era. For updates on Ciena, follow us on LinkedIn, or visit the Ciena Insights webpage and Ciena website.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Note to Ciena Investors</span></strong></p><p class=\"\"><span>You are encouraged to review the Investors section of our website, where we routinely post press releases, SEC filings, recent news, financial results, and other announcements. From time to time we exclusively post material information to this website along with other disclosure channels that we use. This press release contains certain forward-looking statements that are based on our current expectations, forecasts, information and assumptions. These statements involve inherent risks and uncertainties.  Actual results or outcomes may differ materially from those stated or implied, because of risks and uncertainties, including those detailed in our most recent annual and quarterly reports filed with the SEC. Forward-looking statements include statements regarding our  expectations, beliefs, intentions or strategies and can be identified by words such as \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"should,\" \"will,\" and \"would\" or similar words. Ciena assumes no obligation to update the information included in this press release, whether as a result of new information, future events or otherwise.</span></p><p class=\"\"><span>For any further details, please reach out at: ciena@activedmc.com  </span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zaw3j8vrh:0-zawya-pressr-ciena-unveils-the-industry-s-highest-density-lowest-power-pluggable-optical-engine-to-meet-data-center-ai-demands/",
            "pub_date": "2026-02-28 20:46:08",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000682:0",
            "title": "More Americans Are Leaving America — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Cristina Lourosa-Ricardo</span></p><p class=\"\"><span>This is an edition of the WSJ Weekend Reads newsletter, a weekly look at our most colorful, thought-provoking and original feature stories on the business of life. If you're not subscribed, sign up here.</span></p><p class=\"\"><span>The new American dream, for a growing number of citizens, is to live somewhere else.</span></p><p class=\"\"><span>The phenomenon has been building for years, Drew Hinshaw and Joe Parkinson write in their piece this week. Fueling this emigration is the rise of remote work, higher living costs at home and an appetite for a different lifestyle. But, as with most things in life, the moves come with trade-offs.</span></p><p class=\"\"><span>\"The wages are higher in the U.S. but the quality of life is higher in Europe,\" says 41-year-old Chris Ford, who lives in Berlin.</span></p><p class=\"\"><span>Other topics we look at include the growing health risk for people under 55, family money meetings and the corporate jargon that annoys you most.</span></p><p class=\"\"><span>Enjoy your weekend with these and all the great reads below.</span></p><p class=\"\"><span>Leading Off</span></p><p class=\"\"><span>The American Emigration</span></p><p class=\"\"><span>U.S. citizens are leaving in the country in record numbers, drawn to a different lifestyle.</span></p><p class=\"\"><span>Young and at Risk</span></p><p class=\"\"><span>More people in their 30s or 40s are dying from heart attacks. Betsy McKay looks at the troubling trend.</span></p><p class=\"\"><span>See the Story</span></p><p class=\"\"><span>A Restoration or a Bust?</span></p><p class=\"\"><span>A Florida couple spent six years and $7 million restoring a Paul Rudolph-designed home. A nonprofit says they destroyed a midcentury icon.</span></p><p class=\"\"><span>Travel</span></p><p class=\"\"><span>Lots of Tips — and Trolling</span></p><p class=\"\"><span>Facebook travel groups can be a great source for practical advice. Just ignore the drama and the bullies.</span></p><p class=\"\"><span>Careers</span></p><p class=\"\"><span>Do You Have the Bandwidth to Read This?</span></p><p class=\"\"><span>Corporate America is full of corporate speak — and most of it annoys us. WSJ readers told us which terms they hate most.</span></p><p class=\"\"><span>Health</span></p><p class=\"\"><span>Not Your Mother's Brittle Bones</span></p><p class=\"\"><span>Bone density — or a lack thereof — is the new big thing in perimenopausal and menopausal wellness.</span></p><p class=\"\"><span>Food &amp; Drink</span></p><p class=\"\"><span>Where Everybody Knows Your Name</span></p><p class=\"\"><span>The neighborhood tavern is getting a revival as the go-to place for a good meal, a cold drink and a sense of community.</span></p><p class=\"\"><span>Tech</span></p><p class=\"\"><span>Declutter Your Data</span></p><p class=\"\"><span>Columnist Nicole Nguyen helps you minimize your digital hoarding, from cloud cleanup to local drives.</span></p><p class=\"\"><span>Your Money</span></p><p class=\"\"><span>Let's Talk About It</span></p><p class=\"\"><span>One family's quarterly money meetings have brought intention to their financial goals. You should try it.</span></p><p class=\"\"><span>Arts &amp; Entertainment</span></p><p class=\"\"><span>Banking on a New Direction</span></p><p class=\"\"><span>The latest season of \"Industry\" takes the hit office drama out of the office.</span></p><p class=\"\"><span>Beyond the Newsroom</span></p><p class=\"\"><span>WSJ | Buy Side: We tested some of the most popular hair dryers on coarse curls and fine straight hair. These are the best hair dryers we found.</span></p><p class=\"\"><span>About Us</span></p><p class=\"\"><span>WSJ Weekend Reads is a showcase for the wide range of great feature writing at WSJ. Let us know what you think by emailing editor Cristina Lourosa-Ricardo at cristina.lourosa@wsj.com (if you're reading this in your inbox, you can just hit reply).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000682:0/",
            "pub_date": "2026-02-28 20:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zaw66ggdK:0",
            "title": "ZAWYA-PRESSR: EDGE and Republic of Korea's DAPA advance major defence cooperation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>It establishes a comprehensive industrial partnership spanning integrated air defence, advanced aircraft, and maritime capabilities, with cooperation valued at approximately $35 billion</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Abu Dhabi, UAE –</span></strong><span> EDGE Group has signed a Defence Industry Cooperation Framework with the Republic of Korea's Defense Acquisition Program Administration (DAPA), during the Republic of Korea’s recent high-level visit to Abu Dhabi, marking a significant milestone in the bilateral defence partnership between both countries.</span></p><p class=\"\"><span>The agreement was signed by H.E. Faisal Al Bannai, Adviser to the UAE President for Strategic Research and Advanced Technology Affairs and Chairman of the Board of Directors of EDGE, and Mr. Lee, Yong Cheol, Minister of DAPA, in the presence of other senior officials from the UAE and Republic of Korea. The visit underscored the enduring strength of the 'Special Strategic Partnership' between the two nations.</span></p><p class=\"\"><span>The MoU establishes a framework for comprehensive defence industry cooperation, encompassing design, development, training, and maintenance, moving beyond a traditional procurement relationship toward deeper, long-term collaboration. Areas of cooperation include integrated air defence systems, advanced aircraft capabilities, and maritime power, with defence cooperation under the framework expected to amount to approximately $35 billion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About EDGE</span></strong></p><p class=\"\"><span>Launched in November 2019, the UAE’s EDGE is one of the world’s leading advanced technology groups, established to develop agile, bold, and disruptive solutions for defence and beyond, and to be a catalyst for change and transformation. It is dedicated to bringing breakthrough innovations, products, and services to market with greater speed and efficiency, to position the UAE as a leading global hub for future industries, and to creating clear paths within the sector for the next generation of highly skilled talent to thrive.  With a focus on the adoption of 4IR technologies, EDGE is driving the development of sovereign capabilities for global export and for the preservation of national security, working with front-line operators, international partners, and adopting advanced technologies such as autonomous capabilities, cyber-physical systems, advanced propulsion systems, robotics, and smart materials. EDGE converges R&amp;D, emerging technologies, digital transformation, and commercial market innovations with military capabilities to develop disruptive solutions tailored to the specific requirements of its customers. Headquartered in Abu Dhabi, capital of the UAE, EDGE consolidates more than 35 entities into five core clusters: Platforms &amp; Systems, Missiles &amp; Weapons, Space &amp; Cyber Technologies, Technologies &amp; Industrialisation, and Homeland Security.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For media enquiries, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>EDGE Group Press Office</span></strong></p><p class=\"\"><span>media@edgegroup.ae</span></p><p class=\"\"><span>+971 52 220 2930</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zaw66ggdK:0-zawya-pressr-edge-and-republic-of-korea-s-dapa-advance-major-defence-cooperation/",
            "pub_date": "2026-02-28 20:33:56",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSR9N2Ta:0",
            "title": "Hospitality Entrepreneurs Romain Kapadia and Joseph Pachioli Introduce Le Tesserae, a 20,000-Square-Foot Architecturally Significant Events Destination in Houston",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>HOUSTON, TX / ACCESS Newswire / February 28, 2026 / Hospitality entrepreneurs Romain Kapadia and Joseph Pachioli, partners at Lexington Union, LLC, recently unveiled Le Tesserae , a 20,000-square-foot indoor-outdoor private events venue overlooking Buffalo Bayou and the Houston skyline, capable of hosting up to 1,500 guests. Developed as a greenfield hospitality project, Le Tesserae reflects a growing national shift away from standardized hotel ballrooms toward architecturally distinctive environments designed to create more meaningful and immersive guest experiences.</span></p><p class=\"\"><span>For decades, hotel ballrooms have served as the default infrastructure for weddings, corporate gatherings, and private events. Yet as hospitality has evolved, many of these spaces, built primarily for scale and operational efficiency, have become increasingly commoditized, offering limited architectural identity or emotional resonance. Le Tesserae was conceived as a direct response to this shift: a venue designed not simply to accommodate events, but to elevate them through architectural character that evoke strong feelings.</span></p><p class=\"\"><span>Located at 2990 Clinton Drive, minutes from downtown Houston, Le Tesserae was developed over a multi-year period with a singular guiding principle - that hospitality environments should be built with the permanence and material integrity traditionally reserved for cultural and civic architecture.</span></p><p class=\"\"><span>Guests arrive through a grand reception lobby anchored by a hand-laid mosaic floor composed of millions of individual tiles, each placed to create a surface that feels both intricate and timeless. Overhead, custom crown moldings and architectural detailing establish an immediate sense of permanence and craftsmanship. This arrival sequence was intentionally designed to create a gradual transition from the exterior urban environment into a fully immersive architectural interior.</span></p><p class=\"\"><span>Beyond the lobby, the main ballroom unfolds beneath soaring ceilings and dramatic floor-to-ceiling windows that frame unobstructed views of Houston's skyline and the surrounding natural landscape of Buffalo Bayou. Natural light moves dynamically through the space throughout the day, while seamless transitions between the ballroom, wraparound balcony, and covered outdoor terraces create a continuous dialogue between interior architecture and the surrounding environment.</span></p><p class=\"\"><span>Inspired by European historic spaces and informed by the partners' international travels, Le Tesserae incorporates custom millwork, handmade detailing, and layered architectural finishes designed to conjure the character of longstanding institutions. The result is a newly constructed venue that carries the visual weight and authenticity of a space that has existed for centuries, an increasingly rare quality in modern hospitality development.</span></p><p class=\"\"><span>Complementing the main venue is an adjacent 5,000-square-foot rooftop bar, offering panoramic views of the Houston skyline and introducing an open-air dimension to the property. The rooftop allows hosts to design multi-layered experiences, ranging from welcome receptions and cocktail hours to after-parties and private gatherings, within a single cohesive destination. This layered spatial composition reflects evolving guest expectations, where movement between environments contributes to the overall experiential narrative.</span></p><p class=\"\"><span>Le Tesserae represents the latest development from Kapadia and Pachioli, whose hospitality portfolio spans multiple venues, culinary concepts, and experiential destinations operated under a single umbrella. Over more than a decade, the partners have built their platform with a consistent focus on creating environments where architectural design and guest experience are inseparable.</span></p><p class=\"\"><span>\"Our intention with Le Tesserae was to create something enduring,\" said Kapadia. \"We wanted to build a space defined by craftsmanship and permanence, an environment that feels timeless and elevates the experience of gathering.\"</span></p><p class=\"\"><span>Pachioli added, \"There is a growing recognition that the physical environment plays a central role in how people experience important moments. Le Tesserae reflects our belief that hospitality spaces should be designed with the same care, intention, and architectural integrity as the experiences they host.\"</span></p><p class=\"\"><span>Kapadia and Pachioli began developing their hospitality platform by identifying an opportunity to create event environments that moved beyond the limitations of traditional venues. After raising outside capital during the company's launch, the partners later reacquired full ownership of their business to pursue long-term independent development aligned with their architectural vision.</span></p><p class=\"\"><span>The onset of the COVID-19 pandemic shortly thereafter created one of the most disruptive periods in modern hospitality history, halting operations across the industry. Rather than retreat, Kapadia and Pachioli continued investing in development and infrastructure, advancing Le Tesserae as a reflection of their conviction in experiential hospitality's long-term evolution.</span></p><p class=\"\"><span>The completion of Le Tesserae comes amid growing national demand for architecturally distinctive hospitality environments that offer differentiation beyond standardized event infrastructure. As experiential hospitality continues to evolve, Le Tesserae positions Houston among a select group of cities investing in design-driven destinations defined by architectural integrity, material craftsmanship, and immersive guest experiences.</span></p><p class=\"\"><span>Today, Le Tesserae stands as both an architectural statement and a reflection of its founders' long-term commitment to creating hospitality environments defined by permanence, craftsmanship, and experiential intention.</span></p><p class=\"\"><span>More than a venue, Le Tesserae represents a philosophy, one where architecture, material integrity, and spatial intention converge to create environments designed not simply to host events, but to shape lasting experiences.</span></p><p class=\"\"><span>Person contact: hello@letesseraeevents.com</span></p><p class=\"\"><span>Company Name: letesseraeevents</span></p><p class=\"\"><span>Person name: Romain Kapadia</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Le Tesserae</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSR9N2Ta:0/",
            "pub_date": "2026-02-28 20:35:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zaw4xTjmY:0",
            "title": "ZAWYA-PRESSR: Fintech innovator PaySelect advances payment optimisation for hospitality businesses",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dubai –</span></strong><span> As the UAE continues to strengthen its position as a global tourism and hospitality hub, payment infrastructure is playing a growing role in protecting profitability and financial efficiency. Beyond occupancy levels and room rates, international collections, exchange rate fluctuations, and delayed settlements can quietly impact margins for hotels and restaurants operating across borders.</span></p><p class=\"\"><span>PaySelect, an innovative UAE-based payments comparison platform, is reshaping how hospitality businesses manage their payment infrastructure, enabling them to compare and implement more efficient payment processing, cross-border transactions, and FX solutions tailored to their operations.</span></p><p class=\"\"><span>“Hospitality operators often focus on revenue growth, yet the way funds move into and out of the business has a direct impact on profitability,” said Sissel Nielsen, Founder &amp; CEO of PaySelect. “We work with hotels and restaurants to modernise their payment infrastructure, reduce avoidable international costs, and improve settlement predictability — without disrupting their commercial relationships.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Rethinking international collections</span></strong></p><p class=\"\"><span>Hotels receiving payments from overseas tour operators, travel agencies, and global partners frequently rely on traditional bank transfers that involve intermediary banks, retail FX spreads, and multi-day settlement cycles. These inefficiencies can restrict liquidity and create operational friction, particularly during peak seasons.</span></p><p class=\"\"><span>Through PaySelect’s network of regulated payment and FX partners, hospitality businesses can collect international payments via local accounts in key source markets such as Europe, the UK, and the United States. Overseas partners transact domestically, while funds are consolidated and settled into the UAE more efficiently, often within one business day. This structure improves cash flow visibility, reduces hidden charges, and enhances financial planning across properties.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Supporting franchise and management fee payments</span></strong></p><p class=\"\"><span>Beyond inbound collections, PaySelect also supports outbound cross-border payments, including franchise and management fee transfers to international hotel chains. A UAE-based hotel operating under a European or global brand franchise can leverage PaySelect to identify the most suitable payment gateway or FX partner when remitting fees to its headquarters. By comparing corridor-specific pricing, routing structures, and settlement options, owners gain greater transparency and cost control when fulfilling contractual obligations.</span></p><p class=\"\"><span>Exchange rate structures and routing decisions can materially affect annual profitability for multi-property operators. Even small percentage improvements in FX pricing or settlement timing can translate into significant savings across portfolios.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How restaurants benefit</span></strong></p><p class=\"\"><span>Restaurants and hospitality groups face equally complex requirements, spanning in-venue POS systems, online reservations, deposits, group bookings, events, and international guest payments. Rather than relying on a single provider or navigating multiple sales channels, operators can compare payment gateways, POS providers, and payment link solutions based on transaction volumes, service models, and expansion plans. This enables F&amp;B brands to streamline checkout experiences, reduce transaction costs, and maintain operational flexibility as they scale across locations.</span></p><p class=\"\"><span>“Restaurants today require flexible payment ecosystems, not just terminals,” added Nielsen. “We ensure operators select infrastructure that supports reservations, deposits, events, and international guests, allowing payments to enhance the guest journey rather than complicate it.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Advisory for hospitality groups</span></strong></p><p class=\"\"><span>In addition to its comparison platform, PaySelect provides independent payments consulting to hotel groups across the GCC and MENA. The firm advises multi-property operators on acquiring optimisation, cross-border routing strategy, fee benchmarking, settlement improvements, and FX efficiency. Unlike traditional consultants or single-provider sales teams, PaySelect operates a market-wide advisory model, working closely with more than 20 local and global payment providers. This ecosystem gives hospitality groups direct visibility into pricing structures, provider capabilities across jurisdictions, approval criteria, and risk mitigation — while enabling objective benchmarking and faster implementation.</span></p><p class=\"\"><span>“Our ambition is to remove friction from hospitality payments at every stage,” said Nielsen. “By helping operators build resilient, future-ready payment infrastructure today, we are contributing to a more efficient and globally connected hospitality ecosystem.”</span></p><p class=\"\"><span>As hospitality businesses continue expanding internationally and managing increasingly diverse revenue streams, payment optimisation is becoming a strategic function rather than a back-office task. By simplifying how hotels and restaurants collect, route, and manage payments across borders, PaySelect enables operators to reduce friction behind the scenes — allowing leadership teams to focus on what matters most: delivering exceptional guest experiences, strengthening brand reputation, and expanding their international footprint with confidence.</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zaw4xTjmY:0-zawya-pressr-fintech-innovator-payselect-advances-payment-optimisation-for-hospitality-businesses/",
            "pub_date": "2026-02-28 20:28:45",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zaw46PS7x:0",
            "title": "ZAWYA-PRESSR: Sohar International and Sohar Islamic introduce Ramadan auto financing campaign with rates starting from 3.45%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Muscat</span></strong><strong class=\"root-Tkn6WL2y\"><span>:</span></strong><span> As a bank that has consistently advanced customer-focused financing solutions aligned with evolving lifestyle needs, Sohar International, along with its Islamic banking window, Sohar Islamic, recently launched its Ramadan auto finance campaign. Under the initiative, Sohar International is offering competitive interest rates starting from 3.45% on auto loans, while Sohar Islamic is providing Shariah-compliant auto financing with profit rates also starting from 3.45%. Positioned to enable customers to make timely and well-considered decisions during the Holy Month, the campaign underscores the bank’s continued emphasis on responsible lending practices, disciplined pricing frameworks, and value-oriented financial solutions designed to serve diverse customer segments.</span></p><p class=\"\"><span>Commenting on the offering, Abdul Qadir Al Sumali, Chief Retail &amp; Premier Banking Officer, stated, “Ramadan represents a period of heightened consumer activity, and our responsibility as a leading financial institution is to respond with solutions that balance accessibility with prudent financial discipline. This campaign has been structured within a clearly defined risk and pricing framework, ensuring that competitiveness does not come at the expense of sustainability. Our objective is not merely to stimulate demand, but to enable informed financial decisions through transparent pricing, structured tenors, and value-added features that enhance overall affordability. By aligning our auto finance proposition with evolving customer behavior during the Holy Month, we reinforce our commitment to responsible lending, portfolio quality, and long-term customer financial wellbeing. At Sohar International, growth must be deliberate and sustainable. Through disciplined execution and customer-centric structuring, we continue to strengthen our retail franchise while maintaining the credit integrity that underpins our performance.”</span></p><p class=\"\"><span>Fahad Akbar Al Zadjali, Head of Sohar Islamic, said, “Our approach to Islamic auto finance is rooted in delivering solutions that uphold ethical principles while remaining practical for modern financial requirements. This campaign reflects our focus on transparency, fairness, and responsible structuring, ensuring customers benefit from financing that is both Shariah-compliant and aligned with their long-term financial wellbeing. We continuously work to refine our offerings so they not only meet market expectations but also reinforce trust, clarity, and value at every stage of the customer journey, particularly during Ramadan, a time when financial decisions often carry deeper personal significance.”</span></p><p class=\"\"><span>The Ramadan auto finance campaign offers tenors of up to 10 years, providing customers with the flexibility to structure repayments in alignment with their income cycles and overall financial planning priorities. Beyond competitive pricing, the campaign incorporates practical value enhancements, including complimentary vehicle registration coverage of up to OMR 40, alongside motor protection support of up to OMR 100 when the insurance or takaful policy is obtained through the bank’s approved partners. These features are designed to strengthen overall affordability while delivering measurable and immediate customer value.</span></p><p class=\"\"><span>The offer is extended to both Omani nationals and expatriate residents, subject to applicable income, employment, and age criteria, with eligibility commencing from 18 years for Omani nationals and 21 years for expatriate residents, and extending up to a maximum age of 65 years at finance maturity. Available under both salary transfer and non-salary transfer arrangements, the campaign is supported by a clearly defined documentation framework to ensure a transparent and efficient application process for customers financing either new or used vehicles. By maintaining structured credit standards while enabling flexibility across employment segments, the bank continues to balance accessibility with prudent risk management principles.</span></p><p class=\"\"><span>Sohar International closely monitors market dynamics and customer purchasing patterns, remaining deliberate in refining its product propositions to reflect prevailing market conditions and consumer sentiment. The ongoing campaign exemplifies this adaptive approach, combining timely market responsiveness with sound financial discipline. As customer expectations evolve, the bank remains committed to enhancing its offerings to ensure sustained competitiveness, relevance, and alignment with long-term financial sustainability.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Sohar International:</span></strong></p><p class=\"\"><span>Sohar International is Oman’s fastest-growing bank, guided by a clear vision to become a world-leading Omani service company that helps customers, communities, and people prosper and grow. With a purpose to help people ‘win’ by delivering responsive banking for their ever-changing world, the bank offers innovative solutions across Commercial and Investment Banking, Wealth Management, Islamic Banking, and more. Operating with a strong digital-first approach and an expanding regional footprint—including presence in the Kingdom of Saudi Arabia—Sohar International is committed to driving value through strategic partnerships and a dynamic customer experience. Learn more at www.SIB.om</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zaw46PS7x:0-zawya-pressr-sohar-international-and-sohar-islamic-introduce-ramadan-auto-financing-campaign-with-rates-starting-from-3-45/",
            "pub_date": "2026-02-28 20:28:54",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002098:0",
            "title": "These fintech stocks are loved by analysts and could bounce back in a big way",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Emily Bary and Philip van Doorn</span></p><p class=\"\"><span>Shares of PayPal and Block are both cheap relative to historic levels, but only one of them commands heavy enthusiasm from analysts</span></p><p class=\"\"><span>PayPal and Block are examples of financial-technology stocks trading at low price-to-earnings ratios relative to their three-year average valuations.</span></p><p class=\"\"><span>Financial-technology stocks have been battered in recent years - and now may be worth a fresh look.</span></p><p class=\"\"><span>The Global X FinTech ETF FINX has fallen 48% over the past five years, while the S&amp;P 500 SPX has risen 80% and the S&amp;P 500 financials sector XX:SP500.40 has increased 59%. Analysts now see plenty of opportunity in the fintech sector, particularly as valuations have come down for some high-profile names.</span></p><p class=\"\"><span>Recent actions in the payment-technology industry suggest that major players are getting more serious about improving operating performance. Block (XYZ), the parent of Square and Cash App, said this week that it would slash more than 40% of its workforce in a bid to drive operational efficiencies and reduce organizational friction. Management said that artificial-intelligence tools are driving major productivity benefits that will enable the company to do more with less.</span></p><p class=\"\"><span>See more: Block says AI will allow it to cut more than 4,000 jobs. Some argue that's not the whole story.</span></p><p class=\"\"><span>Block CFO Amrita Ahuja told MarketWatch that the move came from a \"position of strength,\" as the company simultaneously announced fourth-quarter results that exceeded the consensus view. But the reality is that Block shares have plunged 77% from their 2021 peak, as pricey acquisitions have failed to yield commensurate financial benefits and as fintech valuations have receded from pandemic-era levels.</span></p><p class=\"\"><span>In turn, the stock's valuation is now more compelling. As of Friday's close, Block was trading at 17.4-times estimated earnings per share over the next 12 months, according to LSEG data. That valuation compares with a three-year average price-to-earnings multiple of 24.2 for its stock. Block is heavily favored by analysts working for brokerage and research firms polled by LSEG, as you can see below.</span></p><p class=\"\"><span>Then there's PayPal Holdings (PYPL), which in early February announced that Enrique Lores, formerly of HP (HPQ), would be taking over as CEO after prior turnaround attempts failed to manifest quickly enough. Critics have noted that PayPal underinvested in its core business, ceded its first-mover advantages to Apple Pay (AAPL) and moved too slowly with its push to monetize Venmo.</span></p><p class=\"\"><span>Some analysts are now intrigued by the possibility of a breakup or outright sale of the company. Lores doesn't exactly have a payments-sector background, but PayPal called him the \"lead architect\" of the 2015 split of HP and Hewlett Packard Enterprise (HPE). And Bloomberg News reported earlier this week that multiple entities have expressed early interest in buying either parts of the company or all of it. PayPal declined to comment on those talks.</span></p><p class=\"\"><span>See also: PayPal's stock pops on takeover hopes. Here's who could swoop in with a purchase.</span></p><p class=\"\"><span>Off 85% from their 2021 peak, PayPal shares sport a potentially compelling forward P/E valuation of 8.6, compared with a three-year average valuation of 12.4.</span></p><p class=\"\"><span>Then again, Wall Street analysts aren't enthusiastic about PayPal, even at the current low P/E level: Only 10 out of 45 analysts polled by LSEG who cover the company rate the stock a buy or the equivalent.</span></p><p class=\"\"><span>See more: Could Stripe 'salvage' PayPal? What Wall Street has to say about the latest takeover talk.</span></p><p class=\"\"><span>For more perspective on the valuations, the S&amp;P 500 trades at a forward P/E of 21.6, while its financial sector trades at a forward P/E of 15.3. Payment-processing stalwarts Visa (V) and Mastercard (MA), which have competitive moats and enviable profit margins, trade at respective P/E valuations of 23.6 and 25.7. Those are well below the three-year average forward P/Es of 27.6 for Visa and 31 for Mastercard.</span></p><p class=\"\"><span>Investors have been worried about a laundry list of issues, including regulatory changes, economic prospects and whether there's simply much more room to convert cash-based payments over to cards. The stocks even got hit in the wake of Citrini Research's viral blog post floating a futuristic scenario in which AI-fueled stablecoins disrupt established payment networks and AI-driven productivity boosts force mass underemployment, leaving knowledge workers with less money to spend.</span></p><p class=\"\"><span>\"The sad truth in this market is also that if you have to say 'xyz is not an AI loser but a winner,' then you have already lost (at least the debate),\" Bernstein analyst Harshita Rawat wrote in a note to clients earlier this week. But she also noted that Mastercard and Visa have \"two-sided networks across billions of consumers and hundreds of millions of merchants\" that confer major incumbency advantages.</span></p><p class=\"\"><span>See more: How to play payments stocks after essentially their worst run in 15 years</span></p><p class=\"\"><span>MarketWatch conducted a broader screen of fintech stocks to assess which are most favored by analysts. We narrowed our universe to the 41 U.S. companies in the Global X FinTech ETF that are expected to generate positive 12-month earnings per share and that are covered by at least five analysts. That left us with 34 companies, and we also added Visa and Mastercard.</span></p><p class=\"\"><span>Among those, 18 are rated a buy or the equivalent by at least two-thirds of the analysts covering them, according to LSEG data. Here's the full list, sorted by ascending forward P/E:</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>   Company                             Forward P/E  Feb. 27 price  Consensus price target  Implied 12-month upside potential  2026 price change </span><br/><span>   LendingTree Inc.                            7.3         $37.37                  $81.33                               118%               -30% </span><br/><span>   LendingClub Corp.                           8.1         $14.91                  $24.01                                61%               -21% </span><br/><span>   SS&amp;C Technologies Holdings Inc.            10.8         $75.29                 $100.92                                34%               -14% </span><br/><span>   Mitek Systems Inc.                         12.1         $14.58                  $15.00                                 3%                38% </span><br/><span>   ACI Worldwide Inc.                         13.1         $39.68                  $62.65                                58%               -17% </span><br/><span>   Sezzle Inc.                                14.9         $72.95                  $97.00                                33%                15% </span><br/><span>   Intuit Inc.                                16.0        $409.03                 $630.51                                54%               -38% </span><br/><span>   Payoneer Global Inc.                       16.3          $4.32                   $8.19                                90%               -23% </span><br/><span>   HealthEquity Inc.                          16.5         $76.49                 $116.94                                53%               -17% </span><br/><span>   Block Inc.                                 17.4         $63.70                  $83.88                                32%                -2% </span><br/><span>   i3 Verticals Inc.                          19.0         $22.38                  $31.33                                40%               -11% </span><br/><span>   Jack Henry &amp; Associates Inc.               23.2        $162.46                 $203.58                                25%               -11% </span><br/><span>   Visa Inc.                                  23.6        $320.14                 $400.90                                25%                -9% </span><br/><span>   Blend Labs Inc.                            23.9          $1.68                   $4.21                               151%               -45% </span><br/><span>   Mastercard Inc.                            25.7        $517.21                 $661.68                                28%                -9% </span><br/><span>   Paymentus Holdings Inc.                    29.3         $24.47                  $33.32                                36%               -23% </span><br/><span>   Affirm Holdings Inc.                       30.6         $46.98                  $85.06                                81%               -37% </span><br/><span>   Guidewire Software Inc.                    41.5        $145.32                 $249.79                                72%               -28% </span><br/><span>                                                                                                                                Source: FactSet </span></pre><p class=\"\"><span>Related: Financial stocks are off to their worst yearly start in a decade. How to spot value.</span></p><p class=\"\"><span>-Emily Bary -Philip van Doorn</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002098:0/",
            "pub_date": "2026-02-28 20:30:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Zawb0XyzG:0",
            "title": "ZAWYA-PRESSR: Dubai real estate surges in February 2026 with AED 60.6bln in sales",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The second month of 2026 showed exceptional momentum, recording strong sales across both residential and commercial sectors, supported by strong investor confidence.</span></p><p class=\"\"><span>According to the Dubai Land Department (DLD), the total sales reached 16,959, generating a total value of AED 60.60 billion. This demonstrates a 5% increase in sales and 18.14% increase in value compared to February 2025. The city recorded 10,526 off-plan sales, approximately 62% of the total sales. Ready sales account for 38%, totaling 6,437. A total of 738 gift sales have been registered, with a combined value of AED 6.86 billion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Mortgage Market</span></strong></p><p class=\"\"><span>The mortgage-backed transactions are on an upward trajectory. A total of 3,867 mortgage transactions were registered, totaling AED 16.43 billion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sales Comparison by Property Type</span></strong></p><p class=\"\"><span>Here is the detailed comparison of February 2025 vs February 2026:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Property Type</span></p></td><td><p class=\"\"><span>Total Sales in February 2025</span></p></td><td><p class=\"\"><span>Total Sales Value in February 2025</span></p></td><td><p class=\"\"><span>Total Sales in February 2026</span></p></td><td><p class=\"\"><span>Total Sales Value in February 2026</span></p></td></tr><tr><td><p class=\"\"><span>Apartment</span></p></td><td><p class=\"\"><span>11,385</span></p></td><td><p class=\"\"><span>AED 21.7 billion</span></p></td><td><p class=\"\"><span>12,820</span></p></td><td><p class=\"\"><span>AED 26.6 billion</span></p></td></tr><tr><td><p class=\"\"><span>Villa</span></p></td><td><p class=\"\"><span>3,966</span></p></td><td><p class=\"\"><span>AED 19.7 billion</span></p></td><td><p class=\"\"><span>1,563</span></p></td><td><p class=\"\"><span>AED 6.4 billion</span></p></td></tr><tr><td><p class=\"\"><span>Commercial</span></p></td><td><p class=\"\"><span>443</span></p></td><td><p class=\"\"><span>AED 1.2 billion</span></p></td><td><p class=\"\"><span>717</span></p></td><td><p class=\"\"><span>AED 9.54 billion</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Top Performing Areas by Volume</span></strong></p><p class=\"\"><span>The following are the top-performing areas by volume:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Area</span></p></td><td><p class=\"\"><span>Sales Volume</span></p></td></tr><tr><td><p class=\"\"><span>Jumeirah Village Circle</span></p></td><td><p class=\"\"><span>1,146</span></p></td></tr><tr><td><p class=\"\"><span>Al Yelayiss 1</span></p></td><td><p class=\"\"><span>916</span></p></td></tr><tr><td><p class=\"\"><span>Madinat Al Mataar</span></p></td><td><p class=\"\"><span>828</span></p></td></tr><tr><td><p class=\"\"><span>Dubai Land Residence Complex (DLRC)</span></p></td><td><p class=\"\"><span>750</span></p></td></tr><tr><td><p class=\"\"><span>Business Bay</span></p></td><td><p class=\"\"><span>733</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Top Performing Areas by Value</span></strong></p><p class=\"\"><span>These areas are the best-performing areas in terms of value:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Area</span></p></td><td><p class=\"\"><span>Sales Value</span></p></td></tr><tr><td><p class=\"\"><span>Al Yelayiss 1</span></p></td><td><p class=\"\"><span>AED 5,384,203,445</span></p></td></tr><tr><td><p class=\"\"><span>Al Yelayiss 5</span></p></td><td><p class=\"\"><span>AED 2,409,324,184</span></p></td></tr><tr><td><p class=\"\"><span>Me’Aisem Second</span></p></td><td><p class=\"\"><span>AED2,266,888,144</span></p></td></tr><tr><td><p class=\"\"><span>Business Bay</span></p></td><td><p class=\"\"><span>AED 2,205,729,585</span></p></td></tr><tr><td><p class=\"\"><span>Palm Jumeirah</span></p></td><td><p class=\"\"><span>AED 1,886,308,416</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Most Expensive Projects Sold in February 2026</span></strong></p><p class=\"\"><span>The following are the most expensive apartment projects sold in February 2026:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>The Alba Residences by Omniyat: AED 225,965,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Peninsula Dubai Residences - Tower 2: AED 210,000,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Solara Tower Dubai: AED 113,658,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Passo by Beyond: AED 98,000,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Como Residences: AED 63,504,800</span></li></ul><p class=\"\"><span>The most expensive villas sold in February 2026 are given below:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>EOME at Palm Jumeirah: AED 115,000,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Zaya Zuha Island at The World Islands: AED 68,575,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Zaya Zuha Island at The World Islands: AED 68,575,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Zaya Zuha Island at The World Islands: AED 68,575,000</span></li><li class=\"listItem-bmN0_SHH\"><span>Amali Island at The World Islands: AED 68,400,000</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Best-Selling Projects in February 2026</span></strong></p><p class=\"\"><span>The following are the best-selling projects in February 2026:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Project</span></p></td><td><p class=\"\"><span>Type</span></p></td><td><p class=\"\"><span>Volume</span></p></td><td><p class=\"\"><span>Value</span></p></td></tr><tr><td><p class=\"\"><span>Maybach Six</span></p></td><td><p class=\"\"><span>Apartment</span></p></td><td><p class=\"\"><span>433</span></p></td><td><p class=\"\"><span>AED 722,253,980</span></p></td></tr><tr><td><p class=\"\"><span>Hado by Beyond</span></p></td><td><p class=\"\"><span>Apartment</span></p></td><td><p class=\"\"><span>213</span></p></td><td><p class=\"\"><span>AED 783,968,840</span></p></td></tr><tr><td><p class=\"\"><span>Damac Islands 2 - Bahamas 1</span></p></td><td><p class=\"\"><span>Villa</span></p></td><td><p class=\"\"><span>139</span></p></td><td><p class=\"\"><span>AED 449,573,000</span></p></td></tr><tr><td><p class=\"\"><span>Damac Islands 2 - Bahamas 2</span></p></td><td><p class=\"\"><span>Villa</span></p></td><td><p class=\"\"><span>126</span></p></td><td><p class=\"\"><span>AED 391,570,330</span></p></td></tr></tbody></table></div><p class=\"\"><span>Tara Khan, Sales Director of Kelt and Co Realty, said, “Hitting over AED 60 billion in sales volume solidifies Dubai’s position as one of the globe’s most resilient and desirable real estate hubs. This surge is driven by a balanced blend of end-user demand and enduring investor confidence. The market has reached a mature phase – price growth is steady, supply is strategically managed, and buyer involvement is across emerging and established communities.”</span></p><p class=\"\"><span>She added, “These numbers demonstrate a clear transformation in Dubai’s global image. It has become a preferred destination for long-term residents looking for stability, a luxurious lifestyle, and better opportunities.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Kelt and Co</span></strong></p><p class=\"\"><span>Kelt and Co Realty is a prominent real estate agency in Dubai, offering the highest standards of service. Their professionals leverage years of experience and in-depth market knowledge to provide bespoke guidance to the clients, ensuring they make well-informed and strategic decisions. From buying and selling to property management, handover, and investment consultancy, Kelt and Co Realty is dedicated to maintaining the highest standards of professionalism, integrity, and client satisfaction.</span></p><p class=\"\"><span>For more inquiries, contact us at:</span></p><p class=\"\"><span>Website: www.keltandcorealty.com</span></p><p class=\"\"><span>Email: info@keltandcorealty.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Zawb0XyzG:0-zawya-pressr-dubai-real-estate-surges-in-february-2026-with-aed-60-6bln-in-sales/",
            "pub_date": "2026-02-28 20:30:06",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:7841660ad094b:0",
            "title": "Micron Celebrates Opening of India’s First Semiconductor Assembly and Test Facility",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><em><span>State-of-the-art site in Sanand, Gujarat, expands Micron’s global footprint and advances India's semiconductor ecosystem</span></em></p><p class=\"\"><span>SANAND, India, Feb. 28, 2026 (GLOBE NEWSWIRE) -- Micron Technology, Inc. </span><span> today celebrated the grand opening of its semiconductor assembly and test facility in Sanand, Gujarat, India. The state-of-the-art facility converts advanced DRAM and NAND wafers from Micron's global manufacturing network into finished memory and storage products. Once fully ramped, the first phase of Micron’s Sanand operation will feature more than 500,000 square feet of cleanroom space, making it one of the world’s largest single-floor assembly and test cleanrooms. The site serves customers worldwide to meet the growing global demand for memory and storage fueled by AI.</span></p><p class=\"\"><span>The facility represents a combined investment of approximately $2.75 billion by Micron and its government partners, advancing semiconductor manufacturing capabilities in India. Micron Chairman, President and CEO Sanjay Mehrotra and other executives witnessed the opening ceremony with Prime Minister Narendra Modi, Chief Minister of Gujarat Bhupendra Patel, Union Minister for Railways, Communications, Electronics &amp; IT Ashwini Vaishnaw, U.S. Ambassador to India Sergio Gor and other distinguished government officials and guests.</span></p><p class=\"\"><span>\"Today is a proud moment for Micron and India's growing semiconductor industry,\" said Sanjay Mehrotra, Chairman, President and CEO of Micron Technology. “This pioneering facility, the first assembly and test site of its kind in the country, helps build a resilient ecosystem that underpins the global AI economy. We are deeply grateful to the government of India, the Gujarat government and all of the partners involved for their steadfast support in making this achievement possible.\"</span></p><p class=\"\"><span>The Sanand site is ISO 9001:2015 certified and has begun commercial production. To mark the grand opening of the site, Micron presented its first shipment of made-in-India memory modules to Dell Technologies for its laptops made in India for India. Micron expects to assemble and test tens of millions of chips at Sanand in 2026, scaling to hundreds of millions in 2027. The expansion of conventional assembly and test operations in India complements Micron's planned development of advanced manufacturing and packaging capabilities in the United States and strengthens the company’s global assembly and test network.</span></p><p class=\"\"><span>“The inauguration of Micron’s semiconductor facility in Sanand marks a historic milestone as Bharat begins its first commercial semiconductor chip production,” said Union Minister Ashwini Vaishnaw. “This is a decisive step towards building a trusted, resilient and self-reliant semiconductor ecosystem under the leadership of Hon’ble PM Shri Narendra Modi Ji. India is now moving from being a consumer of chips to becoming a global hub for semiconductor manufacturing and innovation.”</span></p><p class=\"\"><span>Micron is building India's next generation of semiconductor talent to support its operations in India. Through partnerships with Pandit Deendayal Energy University (PDEU), Namtech, leading universities nationwide and government-sponsored skills development programs, Micron is supporting STEM education, specialized training, workforce readiness for advanced manufacturing roles and community initiatives, including digital and AI literacy programs across the region. </span></p><p class=\"\"><span>Micron built and is operating the assembly and test facility in accordance with the company's sustainability goals, rigorous health and safety standards, and with local and global environmental commitments. The facility is designed to meet or exceed Leadership in Energy and Environmental Design (LEED) Gold standards. Additionally, the facility uses advanced water-saving technologies to enable zero liquid discharge.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Micron Technology, Inc.</span></strong></p><p class=\"\"><span>Micron Technology, Inc. is an industry leader in innovative memory and storage solutions, transforming how the world uses information to enrich life for all. With a relentless focus on our customers, technology leadership and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND and NOR memory and storage products. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence (AI) and compute-intensive applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience. To learn more about Micron Technology, Inc. </span><span>, visit </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=fDrOUEAZn5LqvSxeNPPe4D_xwzKD0HnBL7R9VEzobcQTxFtlf-6i7Rg46dS99rrYhuA4nQAdgOKPpgdWBPEWWMIi3m8wwYeOv24kfuUzqJ23uSUj1gzWBkhLl4FwSd8Tg3VmbHYatVAnuWDO2KWDYdHgWg7xhMWZOpFRlXpbCyOdqJCUADeivsp58Qq0RdqiDVwgRVMLjxO80yMtO7SnTBMTnwACIVY0SNh_THJtaBw=\" rel=\"nofollow\" target=\"_blank\">micron.com</a><span>.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Statements</span></strong></p><p class=\"\"><span>This press release contains forward-looking statements, including statements regarding expectations of future production. These forward-looking statements are subject to a number of risks and uncertainties that could cause actual results to differ materially. Please refer to the documents Micron files with the Securities and Exchange Commission, specifically its most recent Form 10-K and Form 10-Q. These documents contain and identify important factors that could cause actual results to differ materially from those contained in these forward-looking statements. These certain factors can be found at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=NC-nl8nRSqrnSBHdL7bCRvazZeBw8slMHFOijMJ8kj3HkOnzWIbnHSYtRT9DZH9DmAg3ALcMsSZmrv6jSWkquGtcghaFlNBmsgT529HRBs0hxIY2wI41KKRsY4c1Je3uPL1RToJRZnSErkh-7meWotlp0nX7Cb0NBH7PuW1YIyZ0n-LgjSV6Ii_ZHA9rczmPQT-s0A02svSI827yVCPX6hvwagkylVR6m0cJebJ6a0u2zzcCMiXo4bIltCIAcqqc0beDBhuRW7XOfNlEtcJeEQzjCIvE1isWfF7XcG6NWSGRMEcZM3x16YR5VBcwpn9kpDvlhZIGRqpmO58FRBtqcitRpdN6ArHCuqjYYtC2P7NOXJV2fa0cMj0MXm01s6ia1hypQVeeU0j8eQvJgcErDJo69AaVnRA85hDulKHtKRcU7ZMnHnSLars9gXb4dh_T5ntleCDJf5mVamcMmW_3IxQo7nVERswoNSDekMjrDPaoO64p9IOCrLkLs-3yhLbVbUANfrSNrvE_yb7ueSPNtMNJOSS96wWrSrZ-9yEBtVJsJu6qm9cj62fLD5RU_sxOiNwoYh-l5TDm6Rmf0QhQoZYXfJhMNEfIeX9zGsUAO-ic4tlgSM0KzSshTHH6ixLG\" rel=\"nofollow\" target=\"_blank\">https://investors.micron.com/risk-factor</a><span>. Although Micron believes that the expectations reflected in the forward-looking statements are reasonable, Micron cannot guarantee future results, levels of activity, or achievements. Micron is under no duty to update any of the forward-looking statements after the date of this press release to conform these statements to actual results.</span></p><p class=\"\"><em><span>© 2026 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Micron Media Relations Contact</span></strong></p><p class=\"\"><span>Mark Plungy</span></p><p class=\"\"><span>+1 (408) 203-2910</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=dkOGVJ4qa_0Xrq1utlto4zvMv-J5etcUgQQIYP-Kpp0LSYYqa1MmN-WvHlJQK2YbxPorG2EUz_C4M0aCXLi0anxuJuY8qC_770baO9Ppb82OZWEQweiCfhKgguDGgrAeW9cKCNaKfM6e47oFlY2vPdIkI6KNIMrP27a24Q-M0gweuPNZZQJQMpQZBm59hBs8Wf5igKV5zo6EfrkZ_twxtbvKG2lKFVH-aXkEqrBCgrHdr_8bZNNQ2moEmGPZ9H2Gcbvi9IHphKAS40tKaj1cqg==\" rel=\"nofollow\" target=\"_blank\">corpcomms@micron.com</a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Micron Investor Relations Contact</span></strong><span> </span></p><p class=\"\"><span>Satya Kumar </span></p><p class=\"\"><span>+1 (408) 450-6199 </span></p><p class=\"\"><span>satyakumar@micron.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:7841660ad094b:0-micron-celebrates-opening-of-india-s-first-semiconductor-assembly-and-test-facility/",
            "pub_date": "2026-02-28 20:00:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ObikgcHYa:0",
            "title": "Hofseth International Q4 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Quarterly report Hofseth International Q4 2025</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667189</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ObikgcHYa:0-hofseth-international-q4-2025/",
            "pub_date": "2026-02-28 20:03:09",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACShVYv2a:0",
            "title": "MEWA Launches the First Saudi Water Week Next April to Shape the Future of the Water Sector Regionally and Globally",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>MEWA Launches the First Saudi Water Week Next April</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>RIYADH, SA / ACCESS Newswire / February 28, 2026 /</span></strong><span> The Ministry of Environment, Water and Agriculture will inaugurate the first Saudi Water Week during the second week of April. This premier national and international forum will convene policymakers, specialists, researchers, private sector entities, and relevant water sector organizations from both within Saudi Arabia and internationally. This initiative underscores the Ministry's sustained commitment to bolstering water security, reinforcing the sustainable governance of water resources, and fostering scientific research and innovation within this critical sector.</span></p><p class=\"\"><span>The Ministry clarified that the Saudi Water Week will feature several specialized events, including the Arab Water Forum and the Second Stakeholders Meeting for the World Water Forum 2027, in addition to detailed presentations of the achievements of the water sector in the Kingdom and other national sectors.</span></p><p class=\"\"><span>The organization of Saudi Water Week comes as an extension of the Kingdom's leading role in developing the water system locally, regionally, and internationally. It aims to enhance the exchange of experiences, discuss common challenges, review practical solutions and modern technologies, and support partnerships and quality investments in the water sector, in line with the objectives of the Kingdom's Vision 2030.</span></p><p class=\"\"><span>The Saudi Water Week is expected to receive widespread media attention at the local, regional, and international levels, due to its strategic importance and the vital issues it raises concerning the future of water, its sustainability, and its role in supporting comprehensive development and quality of life.</span></p><p class=\"\"><span>It is noted that the World Water Forum 2027, scheduled to be held in Riyadh, is the world's largest event in water issues, with broad participation from countries, international organizations, and experts. The second stakeholders meeting of the World Water Forum, held within the Saudi Water Week, is seen as one of the pivotal stations in the preparatory path for this global event, reflecting the Kingdom's advanced position and its influential role in leading international efforts to address water challenges and enhance global cooperation in this field.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For Registration:</span></strong></p><p class=\"\"><span>https://swweek.mewa.gov.sa</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information:</span></strong></p><p class=\"\"><span>Ministry of Environment, Water and Agriculture (MEWA)</span></p><p class=\"\"><span>info@mewa.gov.sa</span></p><p class=\"\"><span>0112038888</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Ministry of Environment, Water and Agriculture</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACShVYv2a:0/",
            "pub_date": "2026-02-28 19:56:27",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000661:0",
            "title": "Coal Power's Comeback Isn't Spurring New Investment — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Jennifer Hiller</span></p><p class=\"\"><span>Coal-fired power generation is having something of a moment. It isn't clear just how long it will last.</span></p><p class=\"\"><span>President Trump is trying to throw a lifeline to coal, the once-dominant fuel source for the U.S. power grid that has been in steep decline for more than 15 years. His efforts, combined with the boom in construction of power-hungry artificial-intelligence data centers, could keep coal plants that were once slated for retirement operating years longer than expected.</span></p><p class=\"\"><span>The Trump administration has ordered an expansion of coal mining, leasing and exports, while requiring a handful of power plants to continue operating past their expected retirement dates.</span></p><p class=\"\"><span>Trump touted coal on the campaign trail and included it in his day-one executive order declaring an energy emergency. An electricity capacity crunch has emerged as new artificial-intelligence data centers strain power supplies.</span></p><p class=\"\"><span>\"I don't use the word coal,\" Trump said at a White House event this month. \"It needs a PR job because it had a bad reputation for a while. It has to be preceded by 'beautiful, clean' coal. We're cleaning it up.\"</span></p><p class=\"\"><span>Extreme weather and gas price spikes have created recent openings for coal. Coal generation increased about 13% in 2025 from the previous year as higher natural gas costs made coal more competitive, according to the Energy Information Administration. In January, coal generation soared again as a winter storm brought freezing temperatures to much of the country and natural-gas prices rose.</span></p><p class=\"\"><span>The National Mining Association has pointed to those events and said access to coal-fired generation has helped keep the lights on and prevent greater spikes in customer bills.</span></p><p class=\"\"><span>\"The cost of our AI-powered future is showing up on Americans' electricity bills; states with greater access to coal generation are in a much better position to manage that price volatility,\" said Rich Nolan, president and chief executive of the association.</span></p><p class=\"\"><span>Energy Secretary Chris Wright last week called coal the \"MVP of recent winter storms\" while renewing an emergency order to keep a coal plant in Michigan operating.</span></p><p class=\"\"><span>\"The energy sources that perform when you need them most are inherently the most valuable,\" Wright said.</span></p><p class=\"\"><span>Although the AI boom has helped create a window of opportunity for coal, it won't be long-lived, said Gary Dorris, chief executive and founder of Ascend Analytics, which forecasts power prices and provides software for financial modeling and resource planning.</span></p><p class=\"\"><span>\"The economics of this are a gravitational force that can't be ignored by or overwritten by politics,\" Dorris said.</span></p><p class=\"\"><span>Particularly in markets west of the Mississippi River, renewable energy projects can push wholesale electricity prices sharply lower, or even negative, for several hours every day. Generators pay grid operators to take power. Coal plants, which can't easily shut down and restart, either operate at a loss during those hours or ramp down to levels that are inefficient and cause mechanical wear and tear, Dorris said. That makes coal operations difficult to sustain.</span></p><p class=\"\"><span>\"The question becomes, how long and at what rate will the legacy coal continue into the future?\" Dorris asked.</span></p><p class=\"\"><span>The Rhodium Group estimates that economywide emissions increased 2.4% in 2025, growing faster than the overall economy. A colder winter drove more space heating and fuel use in buildings, while in the power industry coal generation grew.</span></p><p class=\"\"><span>Power plant stacks emitted more sulfur dioxide, nitrogen oxide and carbon dioxide last year, according to an analysis of government data.</span></p><p class=\"\"><span>Coal was once the largest fuel source for electricity generation in the U.S. but began a steep slide around 2008. A surge in domestic natural gas supplies unleashed by the shale boom undercut coal's economics, as did cheap renewables, while state environmental policies accelerated the shift away from coal. Hundreds of plants closed.</span></p><p class=\"\"><span>Expenses at a coal plant are roughly double that of a natural gas plant, according to Energy Department data. They might require a few hundred workers versus dozens. Between 2011 and 2019, more than 100 coal plants were converted to or replaced by natural gas-fired plants, according to the Energy Information Administration.</span></p><p class=\"\"><span>Jim McMahon, head of the energy practice at Charles River Associates, said the closures were driven by a combination of high costs, the availability of cheaper renewables and an era of flat electricity demand. Many utilities and plant operators independently made the decision to close their coal plants.</span></p><p class=\"\"><span>\"Suddenly everyone took action and many coal plants were on the chopping block or getting retired,\" McMahon said. \"And then you had all this growth. Capacity became king.\"</span></p><p class=\"\"><span>Projections for future electricity demand vary widely, but all forecasts point up. Consulting firm ICF expects U.S. power demand to rise 25% by 2030 from 2023's levels, largely because of data center needs.</span></p><p class=\"\"><span>The Trump administration's latest action to boost coal came last week with the rollback of mercury and other toxic emission standards for coal-fired power plants. The move reverses more stringent Biden-era standards to levels established in 2012.</span></p><p class=\"\"><span>The president recently signed an executive order that directs the Defense Department to buy electricity from coal plants and issued federal awards for retrofits and upgrades at power plants in West Virginia, Ohio, North Carolina and Kentucky.</span></p><p class=\"\"><span>Analysts at ClearView Energy Partners consider the actions by the Trump administration \"more likely to extend lifetimes for existing coal mining and generation assets than spur new investment.\"</span></p><p class=\"\"><span>Units at 29 coal-fired power plants are slated for retirement through 2028, according to ClearView. So far, four of those plants are operating under emergency orders to stay open, while the Tennessee Valley Authority this month reversed plans to close two coal plants.</span></p><p class=\"\"><span>Still, even as U.S. electricity generation is set to climb 1.4% this year and 2.5% next, the spoils will largely bypass coal, the EIA projects.</span></p><p class=\"\"><span>Solar and wind output are expected to rise. So is hydropower following two historically dry summers. Coal-fired power generation could fall by 6% this year and 4% in 2027, with some plants retiring or remaining idle while still connected to the grid, the EIA said.</span></p><p class=\"\"><span>Write to Jennifer Hiller at jennifer.hiller@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000661:0/",
            "pub_date": "2026-02-28 20:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002071:0",
            "title": "Any chance the Fed cuts rates this year is 'evaporating before our very eyes' as Iran tensions raise oil prices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Greg Robb</span></p><p class=\"\"><span>Experts see high potential for a military strike</span></p><p class=\"\"><span>President Donald Trump greets members of the Joint Chiefs of Staff as he arrives to deliver his State of the Union address on Tuesday.</span></p><p class=\"\"><span>With oil prices rising in response to growing tensions with Iran, the rationale for additional interest-rate cuts by the Federal Reserve is disappearing.</span></p><p class=\"\"><span>\"The argument for having lower rates is just evaporating right before our very eyes,\" said Brian Bethune, an economist at Boston College, in an interview. The uptick in oil prices combined with the Trump administration's aggressive approach to tariffs is putting upward pressure on inflation, complicating any Fed rate cut, he said.</span></p><p class=\"\"><span>Over the past several months, the Fed has struggled to tamp down inflation amid pressure from the White House and the markets to cut rates. These latest developments only add to the central bank's challenges.</span></p><p class=\"\"><span>Prices at the wholesale level started to accelerate in December and are running at a 3% annual rate, frustrating Federal Reserve officials who hoped that the taxes on imports would only have a transitory impact on inflation. It's likely that the increase in producer prices will soon be passed on to consumers, said Ethan Harris, former chief economist at BofA Securities, in a note on LinkedIn.</span></p><p class=\"\"><span>Inflation is looking like it is heating up in the first quarter, agreed Scott Anderson, chief U.S. economist at BMO Capital Markets. Core personal-consumption expenditures could rise to 3.1% annual rate in January, the highest rate in two years - and that's before any impact from a potential U.S. strike on Iran. The Fed's target for inflation is 2%.</span></p><p class=\"\"><span>Any $10 increase in crude-oil prices is estimated to raise consumer-price inflation by 0.2% to 0.4% over the coming year, Anderson said.</span></p><p class=\"\"><span>WTI crude-oil futures (CL00) (CLJ26) are up about 16% year to date, or $10 per barrel since the beginning of the year.</span></p><p class=\"\"><span>\"Just the growing risk of a conflict with Iran is already impacting energy markets and prices, adding to U.S. inflation pressures and creating major headwinds for further Fed rate cuts,\" Anderson said.</span></p><p class=\"\"><span>A prolonged conflict might raise the possibility that the central bank's next move would be to raise interest rates, he added.</span></p><p class=\"\"><span>\"You're really talking about problems for the Fed in terms of putting a lid on inflation,\" Bethune said. \"In this situation, the Fed can't lower rates.\"</span></p><p class=\"\"><span>Traders in derivate markets still expect two quarter-point rate cuts this year, with the first coming in June and the second in September.</span></p><p class=\"\"><span>Both tariffs and oil prices are supply shocks, raising the costs of inputs into production of the economy, which are very hard for the Fed to cool.</span></p><p class=\"\"><span>The Fed's interest-rate tool works more on the demand side of the economy, by either spurring companies and consumers to spend or nudging them to pull back.</span></p><p class=\"\"><span>Military action in Iran is likely, analysts say</span></p><p class=\"\"><span>Oil prices are expected to spike if there is any attack on Iran, with the only debate about how long the higher prices might last.</span></p><p class=\"\"><span>Analysts see a very high potential for some kind of military strike on Iran in the coming weeks.</span></p><p class=\"\"><span>There has been a \"slow-motion effort\" to get U.S. military assets in the Middle East region since January, said Suzanne Maloney, director of the Foreign Policy program at the Brookings Institution.</span></p><p class=\"\"><span>U.S. military action against Iran \"seems more likely than not,\" said Christopher Granville, managing director of TS Lombard, a macroeconomic forecasting consultancy firm based in London.</span></p><p class=\"\"><span>Granville said a military confrontation between the U.S. and Iran is unlikely to send the global economy into a full-blown oil crisis and stagflationary shock. Still, it's possible we'll face an \"oil squall\" similar to what happened after Russia invaded Ukraine in early 2022, when oil prices surged over $100 a barrel and remained high for six months.</span></p><p class=\"\"><span>That so-called squall was enough to fuel inflation in the U.S., with the core PCE price index rising at an annual pace of 5.6% in September 2022, the highest rate in almost 40 years.</span></p><p class=\"\"><span>Still, many economists say it's hard to forecast the future in the Middle East and how any confrontation would impact oil prices. Bank analysts still expect 2026 average prices to remain around the low $60-a-barrel range.</span></p><p class=\"\"><span>Karen Young, senior research scholar at the Center for Global Energy Policy at Columbia University, said any price spike depends on whether the Iranian regime strikes oil-production facilities of its neighbors in the Middle East in response to U.S. action.</span></p><p class=\"\"><span>Iran also has the ability to disrupt the flow of oil through the Strait of Hormuz, a crucial maritime passage connecting the Persian Gulf with the Gulf of Oman and the Arabian Sea.</span></p><p class=\"\"><span>Vali Nasr, a professor at the Johns Hopkins University's School of Advanced International Studies, thinks it is likely that Iran tries to hit its neighbors.</span></p><p class=\"\"><span>The Iranian government's conclusion is that if President Trump calculates that war is cost-free, \"he's going to continue doing it,\" Nasr said during a discussion of the conflict earlier this week sponsored by the Chicago Council on Global Affairs.</span></p><p class=\"\"><span>-Greg Robb</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002071:0/",
            "pub_date": "2026-02-28 20:00:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:cb1bfd377094b:0",
            "title": "Bitcoin Price Could Bottom Out At $51,000 Based On These Pricing Bands",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>As February comes to a close, it would be fair to say that the Bitcoin price has had one of its worst monthly performances in over two years. What’s worrisome is that the premier cryptocurrency doesn’t appear to be done, as the bear market roars on. Below are some of the relevant support levels to watch out for over the next few months.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>MVRV Bands Put BTC Bear Market Bottom At $51,558</span></strong></strong></p><p class=\"\"><span>In a recent post on the X platform, popular crypto analyst Ali Martinez identified two levels that could be crucial to the future of the Bitcoin price in the coming months. This evaluation revolves around the MVRV (Market Value to Realized Value) pricing bands.</span></p><p class=\"\"><span>The MVRV pricing bands are an on-chain analytics tool that shows the different profitability levels of the investors of a cryptocurrency (Bitcoin, in this scenario). Typically, these pricing bands represent dynamic support and resistance levels, as they compare the current market price to the average realized value of all investors.</span></p><p class=\"\"><span>Hence, the MVRV pricing bands can be useful in identifying potential market tops (in overheated conditions) and price bottoms (of undervalued assets). According to Glassnode data shared by Martinez, the potential bottom in the current Bitcoin bear market lies between $51,558 and $54,703.</span></p><p class=\"\"><span>The purple line (which shows a -1 standard deviation of the MVRV ratio) represents a deep capitulation phase for the market and has always been a point of reversal for the Bitcoin price in past bear markets. As shown in the chart below, the price of BTC got rejected twice at this level in 2022, during the thick of the crypto winter.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:480px;aspect-ratio:0.8\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:cb1bfd377094b-40e10502d37b465a39878a42ac179967-resized.webp\" type=\"image/webp\"/><img alt=\"Bitcoin price\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:cb1bfd377094b-40e10502d37b465a39878a42ac179967-resized.webp\" style=\"background-color:#eeeeee\"/></picture></div></button></figure><p class=\"\"><span>At the time of publishing his post, Martinez revealed that the purple MVRV band stood at around $51,558. While this suggests that the $51,000 level could be the potential bottom of the current bear market, it is worth mentioning that the MVRV band could shift slightly downward as the price steadily falls.</span></p><p class=\"\"><span>In the unlikely scenario that the Bitcoin price witnesses a turnaround at its current price point, it would have to contend with a key resistance level around $73,726. According to Glassnode’s MVRV pricing bands, the -0.5 standard deviation line represents an accumulation zone, where investors might look to offload their tokens once they break even.</span></p><p class=\"\"><span>Ultimately, these MVRV pricing bands hint at the potential turning points for the Bitcoin price over the coming months.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin Price At A Glance</span></strong></strong></p><p class=\"\"><span>As of this writing, the price of BTC stands at around $65,800, reflecting an over 2% dip in the past 24 hours.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:cb1bfd377094b:0-bitcoin-price-could-bottom-out-at-51-000-based-on-these-pricing-bands/",
            "pub_date": "2026-02-28 20:00:32",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:d98a18fed094b:0",
            "title": "Binance founder CZ Slams New York Times Over Leaked Draft Detailing $4.3B Settlement Talks",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Binance founder Zhao said the New York Times used an unauthorized early draft of his soon-to-be-released memoir and ignored requests to wait for the finalized manuscript.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The report described 2023 negotiations that led to Binance agreeing to a $4.3 billion settlement with U.S. authorities.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The draft also recounted Zhao’s four-month prison sentence and a detainer issued by Immigration and Customs Enforcement near the end of his custody.</span></li></ul></span></div><span><p class=\"\"><span>Binance founder Changpeng Zhao slammed a New York Times article on Friday that detailed previously undisclosed Department of Justice (DOJ) negotiations from a draft of his memoir without permission.</span></p><p class=\"\"><span>Zhao wrote that his team had asked the New York Times to “hold off on the article till just a few days before publishing” and to use the official copy of the manuscript. “They couldn’t wait,” he said. In another post, he added that the newspaper “only had a copy of a very early draft, without permission.”</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:500.62893081761007px;aspect-ratio:0.8343815513626834\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:d98a18fed094b-1c629ca9f3c4b8b6ce0f60c1cbf593d5-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-02-28 at 6.44.55 AM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:d98a18fed094b-1c629ca9f3c4b8b6ce0f60c1cbf593d5-resized.webp\" style=\"background-color:#b3b6b5\"/></picture></div></button></figure><p class=\"\"><span>Zhao’s post came as The New York Times published an article on Friday detailing content from a draft of his upcoming memoir, Freedom of Money. </span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/binancecoin\" rel=\"nofollow\" target=\"_blank\">Binance Coin (BNB)</a><span> was trading at $596, down by 2.9% in the last 24 hours. On Stocktwits, retail sentiment around BNB remained in 'bearish' territory, with 'low' chatter levels over the past day. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DOJ Negotiations And Prison Account</span></strong></p><p class=\"\"><span>The report described behind-the-scenes negotiations between Binance and the U.S. Department of Justice (DOJ) in 2023, during which prosecutors initially sought a $6.8 billion penalty before the company ultimately agreed to pay $4.3 billion.</span></p><p class=\"\"><span>According to the article, Zhao consulted more than a dozen lawyers during the process and considered remaining outside the United States rather than returning to face charges. He ultimately pleaded guilty to a single count of violating an anti-money-laundering statute and stepped down as Binance’s chief executive officer. He was sentenced to four months in prison in 2024. </span></p><p class=\"\"><span>The draft manuscript also recounted Zhao’s time in prison, including interactions with guards and inmates, and detailed a previously unreported detainer placed by Immigration and Customs Enforcement that briefly put him under additional custody near the end of his sentence. </span></p><p class=\"\"><span>Zhao’s lawyer, Teresa Goody Guillén, said that the article relied on material “that is neither in CZ’s book nor in his words,” adding that readers would see his “real words once the finished book is published soon.”</span></p><p class=\"\"><span>Zhao said in the previous month that he planned to self-publish the memoir in February or March of this year.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:d98a18fed094b:0/",
            "pub_date": "2026-02-28 19:52:11",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coinpedia:8500da358094b:0",
            "title": "Is 2026 the Year Banks Finally Adopt XRP? Clarity Act and Ripple’s Next Move",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The Clarity Act is heading toward a make-or-break moment. Ripple CEO Brad Garlinghouse has put the odds of the bill passing by April at 80%, and the White House has set a March 1 target to resolve the stablecoin yield dispute holding it up.</span></p><p class=\"\"><span>If it passes, XRP would be classified as a digital commodity. That single shift would greenlight U.S. banks for On-Demand Liquidity adoption and open the floodgates for ETF products. </span></p><p class=\"\"><span>If it doesn’t clear before midterm election season, Jake Claver of Digital Ascension Group warns the window could close. Passing legislation gets much harder once the political cycle takes over.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Banks Went From “No” to “Yes” in 12 Months</span></strong></p><p class=\"\"><span>A year ago, Claver would have said banks were not ready. That changed after he attended the Ondo Summit and several recent industry events. BNY Mellon is already custodying RLUSD. Fidelity, Citi, and Franklin Templeton are all leaning in. </span></p><p class=\"\"><span>JP Morgan runs Onyx for internal settlement but needs interoperability with external chains, something only full regulatory clarity unlocks.</span></p><p class=\"\"><span>Ripple CTO David Schwartz has framed the real barrier differently. According to Claver, Schwartz has stated the main obstacle is not clarity itself but asset volatility. Banks want a high, stable XRP price, not a volatile one.</span></p><p class=\"\"><span>The early signals are already showing. XRP saw $5 million in inflows within the first five minutes of a recent morning session. Payment volume between accounts surged roughly 400%.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ripple Built the Full Stack While Everyone Waited</span></strong></p><p class=\"\"><span>Ripple has assembled an end-to-end infrastructure. Hidden Road is now Ripple Prime. G Treasury is now Ripple Treasury. Ripple 1 bundles stablecoin issuance, custody, and digital identity into one integrated product.</span></p><div class=\"blockquote-xrkxvh37\"><span> </span><p class=\"\"><span>Paraphrasing Garlinghouse, Claver said: </span><em><span>“It really doesn’t matter which way it goes as long as we have something in place and we’re going to be able to run because we’re so far ahead of everybody else.”</span></em></p><span> </span></div><p class=\"\"><span>Once the Clarity Act passes, NDA expirations could unleash a wave of partnership announcements. Deutsche Bank has already gone public. Ripple President Monica Long expects full-scale institutional adoption for the XRP Ledger in 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Rotation Is Already Starting</span></strong></p><p class=\"\"><span>Bitcoin dominance has fallen from 61% in November to roughly 58%, signaling capital is beginning to shift toward large-cap alts. But Claver warns this cycle’s rotation will look different. </span></p><p class=\"\"><span>Bitcoin is now held primarily through ETFs and structured products, not on exchanges. The liquidity leaving BTC will likely flow into structured vehicles, not traditional altcoin markets.</span></p><p class=\"\"><span>For XRP, that distinction matters. If clarity arrives and institutional products scale, XRP sits at the front of that queue.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FAQs</span></strong></p><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>What happens if the Clarity Act does not pass before the midterm election cycle?</span></strong></strong><span> </span><p class=\"\"><span>If Congress does not act before midterms, legislative priorities often shift toward campaigning and partisan positioning. That can delay crypto regulation for months or even years, extending uncertainty for companies and financial institutions planning long-term integration.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Who would directly benefit from XRP being classified as a digital commodity?</span></strong></strong><span> </span><p class=\"\"><span>U.S. banks, payment providers, and asset managers would gain clearer compliance pathways. Institutional investors could also access XRP through regulated structures, reducing legal ambiguity around custody, trading, and product issuance.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>How could regulatory clarity change competition among blockchain networks?</span></strong></strong><span> </span><p class=\"\"><span>Clear U.S. rules may give networks like the XRP Ledger an advantage in attracting institutional partnerships. Platforms without defined regulatory treatment could face slower adoption from banks that require strict compliance standards.</span></p><span> </span><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>What should investors watch in the coming weeks?</span></strong></strong><span> </span><p class=\"\"><span>Investors should monitor congressional timelines, White House negotiations on stablecoin provisions, and public statements from regulators. Institutional product filings and bank partnership announcements may also signal how quickly the market responds.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/coinpedia:8500da358094b:0-is-2026-the-year-banks-finally-adopt-xrp-clarity-act-and-ripple-s-next-move/",
            "pub_date": "2026-02-28 18:43:42",
            "source": "Coinpedia",
            "kind": 1,
            "language": "en"
        }
    ]
}