{
    "data": [
        {
            "id": "te_news:446603:0",
            "title": "Silver Rises to 3-Month High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Silver rose above $32 per ounce in February, the highest in three months, tracking the preference for safety in other precious metals as markets assessed the global growth outlook under threats of trade wars.</p><p class=\"\">US President Trump followed through with 10% tariffs on China and 25% tariffs on Canada and Mexico, before delaying measures against North American neighbors.</p><p class=\"\">In the meantime, the JOLTS report indicated fewer job openings than expected in the US during December, while manufacturing orders declined sharply.</p><p class=\"\">Consequently, the market continued to bet on multiple rate cuts by the Fed this year, supporting the case for rate-sensitive assets.</p><p class=\"\">On the supply front, the Silver Institute recently forecasted a fifth consecutive year of significant market deficits for the metal in 2025, driven by strong industrial demand and retail investment.</p><p class=\"\">These factors are expected to outweigh weaker consumption in jewelry and silverware.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446603:0-silver-rises-to-3-month-high/",
            "pub_date": "2025-02-05 01:57:55",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009202:0",
            "title": "Robinhood Yanks Super Bowl Betting Contracts After Regulator's Pushback — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Alexander Osipovich, Hannah Erin Lang and Katherine Sayre</p><p class=\"\">Robinhood Markets said Tuesday that it was withdrawing its plans to offer betting contracts on the Super Bowl, following pushback from the Commodity Futures Trading Commission, which raised concerns that the contracts might be illegal.</p><p class=\"\">\"We were in regular contact with the CFTC prior to launching this product, and we believe we are in full compliance with all applicable regulations,\" said Robinhood General Counsel Lucas Moskowitz.</p><p class=\"\">Robinhood said it had been asked by the CFTC to stop offering its customers access to the sports contracts on Monday afternoon, just hours after it unveiled its sports-betting plans, a move that blurred the lines between regulated financial markets and gambling.</p><p class=\"\">Robinhood launched the contracts through a partnership with Kalshi, an online prediction market that listed a family of sports-betting contracts in January.</p><p class=\"\">CFTC-regulated prediction markets such as Kalshi are barred under federal law from listing contracts that involve \"gaming\" and are against the public interest, but the definition of \"gaming\" isn't spelled out in the law, which has led to disputes over what is permitted.</p><p class=\"\">Earlier Tuesday, a CFTC spokesman said the agency had \"serious concerns\" about brokers offering customers access to contracts that \"may not be permissible under the law.\" The agency \"will exercise its oversight authority to the fullest extent as appropriate,\" the spokesman added.</p><p class=\"\">Write to Alexander Osipovich at alexo@wsj.com, Hannah Erin Lang at hannaherin.lang@wsj.com and Katherine Sayre at katherine.sayre@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009202:0/",
            "pub_date": "2025-02-05 01:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV2F0:0",
            "title": "North Sea Crude-WTI Midland and Forties slip",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WTI Midland declined after two deals and an offer withdrawal and Forties also fell due to a lower offer.    </p><p class=\"\">PLATTS WINDOW</p><p class=\"\">* Indications are on a free-on-board (FOB) basis unless marked as cost, insurance and freight (CIF) or delivered at place (DAP).</p><p class=\"\">* There were three deals on Tuesday. </p><p class=\"\">* WTI Midland: Glencore bought from Gunvor for Feb. 28-March 4 at 95 cents plus dated Brent on a CIF Rotterdam basis. </p><p class=\"\">* WTI Midland: Gunvor bought from ExxonMobil for Feb. 16-20 at 45 cents plus dated Brent on a CIF Rotterdam basis.</p><p class=\"\">* The WTI Midland average was 70 cents on a CIF Rotterdam basis, equivalent to -18 cents on an FOB basis, according to Reuters calculations.  </p><p class=\"\">* Johan Sverdrup: BP bought from Equinor for Feb. 28-March 2 at $1.40 on an FOB Mongstad basis.  </p><p class=\"\">* Forties: Equinor offered Feb. 24-26 FOB basis at dated Brent plus 0 cents, down from Monday's offer of Feb. 24-26 FOB Mongstad at dated Brent plus 35 cents.   </p><p class=\"\">* ExxonMobil withdrew an offer for WTI Midland for Feb. 21-25 at 60 cents plus dated Brent on a CIF Rotterdam basis. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV2F0:0-north-sea-crude-wti-midland-and-forties-slip/",
            "pub_date": "2025-02-05 01:58:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309118:0",
            "title": "Nvidia to Sooth Worrisome Investors With Q4 Beat, Progress on Blackwell Chip, BofA Securities Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nvidia  remains top pick at BofA Securities that said in a note Tuesday it expects the chipmaker to reassure Wall Street on new artificial intelligence chips and business outlook for ongoing fiscal year. </p><p class=\"\">BofA analyst Vivek Arya expects the company to beat Q4 consensus, while also reassuring investors about progress on its Blackwell microarchitecture and set a primer to its upcoming GTC conference. </p><p class=\"\">Nvidia though faces some headwinds, Arya said, perhaps most noticeably around the US government expanding restrictions on shipments of AI chips to China or increasing regulatory scrutiny as the company cements its dominant market perch. Other potential risks include increased competition along with \"lumpy\" sales for its chips used for enterprise, data center or automobiles. </p><p class=\"\">Despite those potential downside factors, investors should expect Nvidia's upcoming earnings call to \"mark the trough in investor sentiment\" and signaling confidence for growth in the current fiscal year. </p><p class=\"\">BofA reiterated buy rating and $190 price target for Nvidia shares, reflecting a multiple of 33 times its projected price-to-earnings during the company's calendar 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309118:0/",
            "pub_date": "2025-02-05 01:58:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002817:0",
            "title": "These Stocks Are Moving the Most Today: Palantir, Alphabet, Tesla, Merck, PayPal, Super Micro, Spotify, Estee Lauder, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Woelfel</p><p class=\"\">Stocks were rising Tuesday even as China retaliated against new U.S. tariffs by unveiling levies on certain American goods and opening an investigation into Alphabet's Google for possible antitrust violations.</p><p class=\"\">These stocks were moving Tuesday:</p><p class=\"\">Palantir Technologies soared 26% after the software company reported fourth-quarter adjusted earnings that topped analysts' estimates and revenue jumped 36% to $828 million, beating expectations of $776 million. The company's U.S. business jumped 52% from a year earlier. \"Our business results continue to astound, demonstrating our deepening position at the center of the (artificial intelligence) revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,\" said CEO Alex Karp. For the first quarter, Palantir said it expects revenue of $858 million to $862 million, up 36% from 2024 at the midpoint and better than Wall Street estimates of $799 million.</p><p class=\"\">Tesla  was up 0.2% after shares of the electric-vehicle giant slumped 5.2% on Monday. The stock closed lower after it was announced that tariffs levied on Mexico by the U.S. would be delayed by a month but before President Donald Trump struck a similar deal with Canada. The electric-vehicle maker assembles all its vehicles for the U.S. market in the U.S. but about 15% of the parts in a Model Y sold in the U.S. come from Mexico.</p><p class=\"\">Shares of Nvidia, the leading maker of artificial-intelligence chips, were up 2.3%.  Nvidia declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Super Micro Computer rose 6.1%. The maker of AI servers said it would be providing a fiscal second-quarter \" business update\" on Feb. 11. The Nasdaq Stock Market told the company in November that it wasn't in compliance with a listing rule requiring timely filing of reports with the Securities and Exchange Commission. In early December, the company said it expected to file its delayed financial statements by Feb. 25.</p><p class=\"\">PepsiCo posted fourth-quarter adjusted earnings of $1.96 a share, beating analysts' estimates of $1.94 but the stock fell 1.8% after revenue declined 0.2% from a year earlier to $27.78 billion and missed expectations of $27.89 billion. Shares fell 4.2%.</p><p class=\"\">Shares of Spotify Technology jumped 10% after the audio-streaming company added more premium subscribers in the fourth quarter than Wall Street expected, helping revenue top estimates.</p><p class=\"\">Merck fell 11% after the drug maker reported fourth-quarter adjusted earnings that beat analysts' estimates but issued guidance for f2025 that missed expectations. Merck said it expects 2025 adjusted earnings of $8.88 to $9.03 a share, below consensus of $9.21.</p><p class=\"\">Pfizer was down 2.1. The company reported fourth-quarter adjusted earnings of 63 cents a share, beating analysts' forecasts of 46 cents, and the company reaffirmed guidance for 2025.</p><p class=\"\">PayPal was down 9.4%. The fintech beat fourth-quarter earnings and sales estimates, and said total payment volume rose 7% in the quarter, while payment transactions decreased 3%.</p><p class=\"\">Estée Lauder, the luxury beauty brand, slumped 18% after it issued weak earnings guidance, said it expects to cut between 5,800 and 7,000 positions as part of a two-year restructuring plan, and would record more than $1 billion in pretax charges on employee-related costs.</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%, down from a prior outlook for sales to be flat to down 2%. Shares of the cleaning-products maker were down 5.7%.</p><p class=\"\">Earnings reports are expected after the closing bell Tuesday from Alphabet, Advanced Micro Devices, Chipotle Mexican Grill, and Amgen.</p><p class=\"\">Alphabet rose 2.3% ahead of fourth-quarter earnings from the parent of Google. Wall Street expects Alphabet to report earnings of $2.13 a share on revenue of $96.7 billion, up from per-share profit of $1.64 on revenue of $86.3 billion a year earlier. Cloud growth at the company and updates on its AI investments will be closely watched by investors.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002817:0/",
            "pub_date": "2025-02-05 01:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009210:0",
            "title": "Tempur Sealy Cleared to Close Purchase of Mattress Firm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">Tempur Sealy International said that it expects to close its previously announced acquisition of mattress specialty retailer Mattress Firm Group on Wednesday.</p><p class=\"\">The company said the closing follows the ruling from the U.S. District Court for the Southern District of Texas denying the motion by the Federal Trade Commission for a preliminary injunction to halt the closing of the proposed acquisition.</p><p class=\"\">The FTC has indicated that it will not seek emergency relief from the Fifth Circuit, and won't prevent the transaction from closing.</p><p class=\"\">Last July, the FTC voted to block Tempur Sealy's proposed $4 billion acquisition of Mattress Firm due to competition and pricing concerns. The regulator said the acquisition of Mattress Firm would give the world's largest mattress supplier and manufacturer the ability and incentive to suppress competition and raise prices for mattresses for millions of consumers.</p><p class=\"\">Tempur Sealy said last September that it expected to close the deal in late 2024 or early 2025, after the anticipated completion of the litigation process.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009210:0-tempur-sealy-cleared-to-close-purchase-of-mattress-firm/",
            "pub_date": "2025-02-05 01:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309123:0",
            "title": "General Motors' Cruise Unit to Cut Half of Workforce",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">General Motors'  Cruise unit is reducing its headcount by about 50%, a Cruise spokesperson said Tuesday in an email sent to MT Newswires. </p><p class=\"\">\"We are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles,\" the spokesperson said. </p><p class=\"\">The job cuts extend to the chief executive and several top executives, TechCrunch said, adding that what's left of the company will be moved under General Motors. </p><p class=\"\">Separately, General Motors said it completed the acquisition of GM Cruise after the autonomous vehicle company's board of directors approved GM's merger offer. </p><p class=\"\">The automaker said it will integrate Cruise technology into its Super Cruise driver assistance platform and will work together with Cruise on further developing assisted driving technology. </p><p class=\"\">GM shares were over 1% higher in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309123:0/",
            "pub_date": "2025-02-05 01:59:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009215:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 1 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beijing's Retaliation Intensifies Trade War With U.S.</strong></p><p class=\"\">China's tariff increases and other countermeasures were mostly symbolic and apparently designed to project strength while leaving the door open to talks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Americans Kiss Job Hopping Goodbye</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Rise Despite Tariff Concerns</strong></p><p class=\"\">U.S. stocks staged a small recovery despite China's retaliation against the new U.S. tariffs. The moves show some signs of investor anxiety remained.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The U.K. Has Dodged Trump's Tariffs So Far. Here Are Some (Very British) Reasons Why.</strong></p><p class=\"\">In his global tariff offensive, President Trump has said trade with the U.K., while out of line, can be worked out.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Antitrust Shouldn't Become Trade War Weapon, EU Says</strong></p><p class=\"\">Competition enforcement is not a tool to be used in trade disputes, the European Commission said after U.S. tariffs triggered a tit-for-tat reaction from China.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RFK Jr. Clears Committee Vote, Putting Him on Track to Become Health Secretary</strong></p><p class=\"\">Next, the full Senate will vote whether to confirm Robert F. Kennedy Jr.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says</strong></p><p class=\"\">European officials need to manage diplomatic negotiations in a more volatile geopolitical environment, the commission president said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</strong></p><p class=\"\">Digital-asset prices slid after Beijing said it would hit back with levies of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009215:0/",
            "pub_date": "2025-02-05 02:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009216:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 1 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Merck Shares Hit After Guidance Falls Short, Gardasil Challenge</strong></p><p class=\"\">The drugmaker's guidance was affected by a pause in shipments of its top-selling vaccine to China from February through at least the middle of the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Okta to Cut 3% of Workforce to Reallocate Resources Toward Growth Priorities</strong></p><p class=\"\">The digital identity verification provider will recognize $11 million in restructuring charges during the fourth quarter, which will primarily be paid in the first quarter of fiscal 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novartis Sets High Bar in Pursuit of Obesity Deals, CEO Says</strong></p><p class=\"\">The Swiss pharmaceutical company has set a high bar for any potential obesity-treatment acquisition as it scans the market for deals to fill its drug pipeline and power sales growth into the 2030s, CEO Vas Narasimhan said in an interview.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PepsiCo Revenue Slips on Volume Drop for Frito-Lay, Quaker</strong></p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estée Lauder to Cut Up to 7,000 Jobs</strong></p><p class=\"\">The cosmetics company has been struggling with weak demand, especially in Asia.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fox Plans to Launch New Streaming Service by Year-End</strong></p><p class=\"\">The offering, which will include news and sports content, is the company's biggest foray yet into subscription streaming.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Stock Rises on Fourth-Quarter Earnings Beat and Reaffirmed Guidance</strong></p><p class=\"\">CEO Albert Bourla says Pfizer has met the strategic goals it had set for itself in 2024, and that it was 'executing transformative changes.'</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Archer Daniels Midland laying off up to 700 in face of uncertain profit</strong></p><p class=\"\">The company says 2025 guidance reflects \"weaker\" market view on biofuel and trade-policy turmoil.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Spotify Reports First Full-Year Profit</strong></p><p class=\"\">Price increases and cost discipline helped the audiostreaming giant pivot from heavy spending on growth to sustained profits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009216:0/",
            "pub_date": "2025-02-05 02:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2Dp1Bg:0",
            "title": "Jushi Announces Support of Adult-Use Cannabis in Pennsylvania Governor’s Annual Budget Proposal and Address",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BOCA RATON, Fla., Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">Jushi Holdings Inc.</strong> <strong class=\"root-Tkn6WL2y\">(“Jushi” or the “Company”) </strong><strong class=\"root-Tkn6WL2y\">(CSE: JUSH</strong><strong class=\"root-Tkn6WL2y\">) (</strong><strong class=\"root-Tkn6WL2y\">OTCQX: JUSHF</strong>), a vertically integrated, multi-state cannabis operator, made the following statement regarding the inclusion of adult use cannabis in Pennsylvania Governor Josh Shapiro’s annual budget proposal and address.</p><p class=\"\">“Jushi and its subsidiaries’ hundreds of employees here in the Commonwealth of Pennsylvania are pleased that the legalization of cannabis is once again a priority for the legislative session. And while we agree that there are important budget implications to this policy, it is also critically important to extend public protections of the regulated medical market we’ve created to the adult use marketplace.</p><p class=\"\">“It is undeniable that there is a cannabis marketplace in every town in America, with the only question being whether or not that market is regulated. A regulated cannabis market limits sales by age, clearly marks packaging, is subject to rigorous oversight and provides the public with a safe and thoroughly tested product. And yes, it also takes funding from criminal enterprises and puts it into state coffers. The status quo in our Commonwealth fails to do all those things.</p><p class=\"\">“Legalizing cannabis for adult use is a common-sense policy supported by over 60% of the public, and even opponents prefer a regulated market to the status quo. It’s past time to provide the public with a legal, regulated adult use cannabis marketplace,” said Jim Cacioppo, Chief Executive Officer, Chairman, and Founder of Jushi.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Investor Relations</p><p class=\"\">561-617-9100</p><p class=\"\">investors@jushico.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2Dp1Bg:0-jushi-announces-support-of-adult-use-cannabis-in-pennsylvania-governor-s-annual-budget-proposal-and-address/",
            "pub_date": "2025-02-05 02:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:fcc49184cea5e:0",
            "title": "Bankwell Financial Group EVP Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Brunner Steven H</td></tr><tr><td>Relationship</td><td>EVP &amp; Chief Risk Officer</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$67,456</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2009787/000150573225000014/xslF345X05/wk-form4_1738691869.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Steven H Brunner, EVP &amp; Chief Risk Officer of Bankwell Financial Group, sold 2,198 shares of common stock on February 3, 2025, at a price of $30.69 per share, totaling $67,456. Following the transaction, Brunner directly owns 9,563 shares of the company.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2009787/000150573225000014/xslF345X05/wk-form4_1738691869.xml\" rel=\"nofollow\" target=\"_blank\">Bankwell Financial Group, Inc. [ BWFG ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:fcc49184cea5e:0-bankwell-financial-group-evp-sells-shares/",
            "pub_date": "2025-02-05 02:00:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSCnHhha:0",
            "title": "The Philanthropy Network Partners With the Altruist Impact Accelerator to Provide Leadership, Management, and Fundraising Guidance to its Members",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Partnership aims to dramatically increase social impact for tens of thousands of small to midsize nonprofits by 2030</p><p class=\"\">CUMBERLAND, ME AND SEATTLE, WA / ACCESS Newswire / February 4, 2025 / The Philanthropy Network (philanthropy.network), a LinkedIn-based nonprofit fundraising community with over 115,000 members, announced today a new partnership with the Altruist Impact Accelerator (altruistaccelerator.org) to deliver leadership, management, and fundraising guidance to its members to enable them to dramatically increase their revenue and social impact.</p><p class=\"\">\"Many small to midsize nonprofits are doing incredible work, but the reality is that many are struggling just to keep the lights on and make payroll, let alone grow their impact,\" says Brad Smith, Ed.M., Founder of the Philanthropy Network. \"When we talk to our members, we hear the same concern again and again-they're stretched thin, facing constant hurdles, and looking for more than just one-off advice. They're looking for practical, proven ways to grow and advance their mission.\"</p><p class=\"\">\"After years of searching, we believe we've found a solution: the Altruist Impact Accelerator-a program that's proven its ability to transform organizations into scalable agents of change. Together, we aim to reach 25,000 nonprofits over the next five years through their accessible, affordable platform. It could not come at a better time, and if we do this right, we will make a transformative impact and unleash a wave of social progress.\"</p><p class=\"\">The Altruist Impact Accelerator, a 501(c)(3) non-profit organization founded in 2022, is a low-cost, open-access learning community that provides nonprofit executives, staff, and board members a clear, step-by-step pathway for planning, financing, and executing ambitious social change efforts, regardless of mission or location.</p><p class=\"\">\"We've been working with hundreds of nonprofits around the world over the past 15 years to develop this integrated learning curriculum,\" says Donald Summers, Altruist Accelerator Founder and Executive Director. \"Until now, nonprofit leaders have had to piece together disconnected advice on governance, program evaluation, fundraising, hiring, team building, and other key management areas. What we've done is integrate everything into a step-by-step process that any organization can follow to dramatically increase their performance and service delivery. The Accelerator includes tools, templates, real-world examples and a supportive community of experts to help with implementation. This is what the social sector needs: a self-paced, low-cost solution to scaling impact.\"</p><p class=\"\">\"We used the Altruist process to create levels of educational success for foster youth that were considered impossible,\" says Janis Avery, former Executive Director of Treehouse and Vice Chair of the Altruist Accelerator Board of Directors, whose story is featured in the book \"Scaling Altruism: A Proven Pathway for Accelerating Nonprofit Growth and Impact\"(Wiley, 2024). \"We worked for years with many different experts to improve the stubbornly low rates of high school graduation among foster youth. It wasn't until we applied the practices detailed in ‘Scaling Altruism' that we not just moved the needle, but closed the graduation gap almost entirely. We hope other nonprofit leaders take advantage of this proven approach.\"</p><p class=\"\">\"I encourage those who react with skepticism to the Accelerator's bold promise of nonprofit transformation to consider the program's track record,\" says Akhtar Badshah, Distinguished Professor of Social Impact at the University of Washington and Board Chair of the Altruist Accelerator. \"This methodology has been painstakingly developed over two decades of practice. It delivers a median annual increase of revenue and program impact of 25%. It's not easy, and it is only for tenacious nonprofit leaders ready to learn a new set of entrepreneurial practices. But it works. This is a toolkit for nonprofit growth and impact.\"</p><p class=\"\">The Accelerator's self-paced training is provided in an online community where nonprofit staff, leaders and board members follow a carefully sequenced series of organizational development and growth practices and apply them to their unique organizational contexts. They develop business plans, financial models, pitch decks, program evaluation dashboards, and other tools that are taught in leading business schools and for-profit accelerators, all adapted for use in the nonprofit sector.</p><p class=\"\">\"Combine all the rigor of a Harvard MBA with a self-paced, supportive process tailored for busy executives at small nonprofits, and you have an idea of what we are doing,\" Summers says. \"There is nothing like it. The more nonprofits that follow this program, the more social problems we will solve.\"</p><p class=\"\">Suited for organizations ranging in size from start-ups to about $25 million in annual funding, the Accelerator is now open to any nonprofit employee, executive or board member. A description of the training program and a direct link to a free 7-day trial may be found at altruistaccelerator.org.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About:</strong> Brad Smith is the Founder of the Philanthropy Network, (https://philanthropy.network/), a community of 115,000 nonprofit professionals providing guidance, wisdom and connection for its members. Brad is also the founder and CEO of Rootstock Philanthropy, a nonprofit advisory firm delivering world-class advice to clients around fundraising and strategic initiatives. In his previous professional roles, Brad served in senior fundraising and leadership positions at Colby College, Tulane Law School, the American Technion Society and the Massachusetts Institute of Technology, where he led the development of MIT's first Talent Management Program for the Office of Leadership Giving, and where he then served as Director of Strategic Initiatives for MIT.nano, the largest research project in MIT's history. Brad is a graduate of Colby College and lives outside Portland, Maine with his wife, Peg, and two daughters, Elle and Eve.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About:</strong> Donald Summers, is the Founder and CEO of Altruist Partners LLC, a pioneering social impact advisory firm dedicated to helping mission-driven organizations achieve their most ambitious goals. He has a Master's Degree in Leadership &amp; Policy from Harvard. Through Altruist Partners, Summers has assisted hundreds of nonprofits and mission-driven organizations globally, overcoming strategic, fundraising, and organizational challenges to amplify their social impact. Summers is also the founder and executive director of the Altruist Accelerator, the firm's nonprofit arm, which delivers the Altruist Growth and Impact Methodology to ambitious nonprofits and NGOs of all sizes and stages. His work has generated hundreds of millions in new revenue and capital; strengthened boards, staff, and volunteer teams; and advanced some of today's most crucial social change efforts. An accomplished author, Summers recently released his book, \"Scaling Altruism: A Proven Pathway for Accelerating Nonprofit Growth and Impact,\" which became the #1 New Nonprofit Release on Amazon. His research and essays have been featured in the Stanford Social Innovation Review, the Chronicle of Higher Education, and the American Academy of Arts and Sciences. Learn more at altruistaccelerator.org.</p><p class=\"\">###</p><p class=\"\">Online press kit: donaldsummers.onlinepresskit247.com</p><p class=\"\">For more information or interview requests, contact Executive Publicist Michelle Tennant Nicholson at Michelle@WasabiPublicity.com or 828-749-3200.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Philanthropy Network &amp; Altruist Partners</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSCnHhha:0/",
            "pub_date": "2025-02-05 02:00:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX3MpcYR:0",
            "title": "Transaction in Own Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Transaction in Own Shares</strong></p><p class=\"\">04 February, 2025</p><p class=\"\">• • • • • • • • • • • • • • • •</p><p class=\"\">Shell plc (the ‘Company’) announces that on 04 February, 2025 it purchased the following number of Shares for cancellation. </p><p class=\"\">Aggregated information on Shares purchased according to trading venue:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> Date of   purchase </td><td> Number of   Shares purchased </td><td> Highest   price paid </td><td> Lowest   price paid  </td><td> Volume   weighted average price paid per share </td><td> Venue </td><td> Currency </td></tr><tr><td> 04/02/2025 </td><td> 600,000 </td><td>  £ 26.5550 </td><td>  £ 26.0150 </td><td>  £ 26.2811 </td><td> LSE </td><td> GBP </td></tr><tr><td> 04/02/2025 </td><td> 0 </td><td> - </td><td> - </td><td> - </td><td> Chi-X (CXE) </td><td> GBP </td></tr><tr><td> 04/02/2025 </td><td> 440,000 </td><td>  £ 26.5550 </td><td>  £ 26.0150 </td><td>  £ 26.2847 </td><td> BATS (BXE) </td><td> GBP </td></tr><tr><td> 04/02/2025 </td><td> 530,000 </td><td>  € 32.0700 </td><td>  € 31.3950 </td><td>  € 31.7173 </td><td> XAMS </td><td> EUR </td></tr><tr><td> 04/02/2025 </td><td> 150,000 </td><td>  € 32.0700 </td><td>  € 31.4250 </td><td>  € 31.7173 </td><td> CBOE DXE </td><td> EUR </td></tr><tr><td> 04/02/2025 </td><td> 0 </td><td> - </td><td> - </td><td> - </td><td> TQEX </td><td> EUR </td></tr></tbody></table></div><p class=\"\">These share purchases form part of the on- and off-market limbs of the Company's existing share buy-back programme previously announced on 30 January 2025. </p><p class=\"\">In respect of this programme, Natixis will make trading decisions in relation to the securities independently of the Company for a period from 30 January 2025 up to and including 25 April 2025. </p><p class=\"\">The on-market limb will be effected within certain pre-set parameters and in accordance with the Company’s general authority to repurchase shares on-market. The off-market limb will be effected in accordance with the Company’s general authority to repurchase shares off-market pursuant to the off-market buyback contract approved by its shareholders and the pre-set parameters set out therein. The programme will be conducted in accordance with  Chapter 9 of the UK Listing Rules and Article 5 of the Market Abuse Regulation 596/2014/EU dealing with buy-back programmes (“EU MAR”) and EU MAR as “onshored” into UK law from the end of the Brexit transition period (at 11:00 pm on 31 December 2020) through the European Union (Withdrawal) Act 2018 (as amended by the European Union (Withdrawal Agreement) Act 2020), and as amended, supplemented, restated, novated, substituted or replaced by the Financial Services Act, 2021 and relevant statutory instruments (including, The Market Abuse (Amendment) (EU Exit) Regulations (SI 2019/310)), from time to time (“UK MAR”) and the Commission Delegated Regulation (EU) 2016/1052 (the “EU MAR Delegated Regulation”) and the EU MAR Delegated Regulation as “onshored” into UK law from the end of the Brexit transition period (at 11:00 pm on 31 December 2020) through the European Union (Withdrawal) Act 2018 (as amended by the European Union (Withdrawal Agreement) Act 2020), and as amended, supplemented, restated, novated, substituted or replaced by the Financial Services Act, 2021 and relevant statutory instruments (including, The Market Abuse (Amendment) (EU Exit) Regulations (SI 2019/310)), from time to time.</p><p class=\"\">In accordance with EU MAR and UK MAR, a breakdown of the individual trades made by Natixis on behalf of the Company as a part of the buy-back programme is detailed below. </p><p class=\"\">Enquiries </p><p class=\"\">Media International: +44 (0) 207 934 5550</p><p class=\"\">Media Americas: +1 832 337 4335</p><p class=\"\">LEI number of Shell plc: 21380068P1DRHMJ8KU70 </p><p class=\"\">Classification: Acquisition or disposal of the issuer’s own shares </p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Shell plc Share Buyback RNS_02.04.2025      </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX3MpcYR:0-transaction-in-own-shares/",
            "pub_date": "2025-02-05 02:00:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009176:0",
            "title": "Juniper Networks 4Q Revenue Set to Rise — Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Juniper Networks is scheduled to report earnings for the fourth quarter after the market closes on Tuesday. Here's what you need to know:</p><p class=\"\">PROFIT: The routers and switches equipment company is expected to post a net profit of $113.4 million, or 28 cents a share. This compares with a reported profit of $124.3 million, or 38 cents a share, for the year-ago period.</p><p class=\"\">ADJUSTED EARNINGS: Stripping out one-time items, the company's earnings per share are expected to come in at 57 cents, according to FactSet.</p><p class=\"\">REVENUE: Revenue is expected to rise to $1.39 billion, according to FactSet. This compares with reported revenue of $1.36 billion for the same period last year.</p><p class=\"\">The stock has fallen 10% over the past three months.</p><p class=\"\">WHAT TO WATCH:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Look for comments around the pending $14 billion deal with Hewlett Packard Enterprise for the company to acquire Juniper. Last week, the Justice Department sued to block the deal, which would create a combined company to potentially rival Cisco Systems, the current leader in wireless networking for large companies. Regulators said the tie-up would significantly reduce competition.</li><li class=\"listItem-bmN0_SHH\">Investors will want to know how HPE and Juniper will challenge the DoJ's lawsuit. The companies say the DoJ's claim that the WLAN market is composed of three primary players is \"disconnected from market realities.\" The company said it \"will vigorously defend against the Department of Justice's overreaching interpretation of antitrust laws and will demonstrate how this transaction will provide customers with greater innovation and choice, positively change the dynamics in the networking market by enhancing competition, and strengthen the backbone of U.S. networking infrastructure.\"</li><li class=\"listItem-bmN0_SHH\">See what the companies have to say about demand and where product orders stood in the fourth quarter. In the third quarter, Chief Executive Rami Rahim said Juniper saw particularly robust orders from its cloud customers in support of front-end and back-end AI networking initiatives.</li></ul><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009176:0/",
            "pub_date": "2025-02-05 01:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002886:0",
            "title": "Amazon, King of Online Retail, Can't Seem to Make Its Physical Stores Work — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kate King</p><p class=\"\">Amazon.com, the largest e-commerce retailer in the U.S., is stumbling in its efforts to compete in the bricks-and-mortar world.</p><p class=\"\">The company in 2018 launched the Amazon Go convenience store, where customers can grab a latte, bagel or turkey sandwich and walk out without waiting in line to pay. Amazon charges them electronically.</p><p class=\"\">But with the Amazon Go store in Woodland Hills, Calif., closing this month, the retailer has shrunk its Go portfolio by about half since early 2023, to 16 stores in four states. Instead, Amazon is focusing on licensing its \"Just Walk Out\" technology to other retailers, while it focuses its bricks-and-mortar ambitions on grocery stores.</p><p class=\"\">This is hardly Amazon's only misfire in the physical-store universe. It has closed dozens of its other branded retail stores in recent years, including bookstores, fashion outlets and its \"4-star\" locations stocked with bestselling items from its website.</p><p class=\"\">After a decadelong experiment with bricks-and-mortar stores, Amazon's dominance online has yet to translate into a successful strategy for connecting with shoppers in the real world, retail brokers and landlords said.</p><p class=\"\">\"They keep testing these concepts thinking one of them is going to connect with the consumer in a big way,\" said Jeff Edison, chief executive of Phillips Edison &amp; Co., a real-estate investor that owns grocery-anchored shopping centers. \"But can you think of any examples where they've actually done the bricks-and-mortar retail well? I can't.\"</p><p class=\"\">Amazon Go stores were launched to develop technology that speeds up the buying process while saving on labor costs. They use cameras and sensors to track customer purchases instead of a traditional checkout counter.</p><p class=\"\">But reducing the number of employees available to help customers and giving priority to credit-card payments over cash limits sales and makes the shopping experience more cumbersome, said Nick Egelanian, president of retail-advisory firm SiteWorks Retail.</p><p class=\"\">\"I don't think they really understand retail,\" Egelanian said. \"Running warehouses and shipping stuff efficiently is not the same as greeting a customer and saying, 'May I help you?'\"</p><p class=\"\">An Amazon spokeswoman said Go store employees greet customers at the door, restock shelves and are available to answer questions.</p><p class=\"\">While certain locations work better than others, the company continues to invest in its Go stores, including a recent redesign of its suburban store in Mill Creek, Wash., where it added more items such as made-to-order pizza. Amazon also opened a new Go store in Bellevue, Wash., last summer.</p><p class=\"\">\"Amazon aims to provide customers outstanding selection, value, and convenience when shopping for groceries and everyday essentials both online and in physical stores,\" Amazon spokeswoman Jessica Martin said.</p><p class=\"\">And while Amazon is tops for online revenue, its sales at bricks-and-mortar stores, including Whole Foods Market, have grown annually since 2021 as well as in the first nine months of 2024, according to the company's financial filings. Net sales in the third quarter of 2024 topped $5.2 billion, compared with about $61.4 billion at Amazon's online store.</p><p class=\"\">But Amazon Go competes in a crowded field. There are more than 152,000 convenience stores in the U.S., according to industry group NACS, many of which also sell coffee, alcohol and freshly prepared food.</p><p class=\"\">Amazon seemed to hedge its bets on Go from the start, making sure it wasn't locked into locations long term.</p><p class=\"\">The company negotiated hard for short-term leases or those with early-exit provisions, said Ed Coury, senior managing director at retail-advisory firm RCS Real Estate Advisors, who worked on a deal to open a 4-Star location at the Westfield Topanga mall in California. He calls that a \"risk averse\" approach to real estate.</p><p class=\"\">Developing and testing its Just Walk Out technology capabilities was a driving reason behind Amazon's rollout of its Go concept, Coury said, and as the technology improved the stores were less necessary.</p><p class=\"\">Amazon now licenses its Just Walk Out technology to more than 200 retailers, including colleges and universities, sports arenas, hospitals and airports. This allows it to profit by marketing the technology without the cost burden of operating a store.</p><p class=\"\">\"It was an investment well spent in developing technology,\" Coury said. \"But the growth plans that they had for that brand are over.\"</p><p class=\"\">Amazon's bricks-and-mortar retail strategy now seems to be focused on its grocery portfolio.</p><p class=\"\">The company acquired Whole Foods Market for roughly $13.5 billion in 2017 and last week announced that the grocer's chief executive, Jason Buechel, is now in charge of all grocery operations for Amazon, including its Fresh and Go stores.</p><p class=\"\">Amazon is moving forward with plans to open more locations for Amazon Fresh, which offers a more mass-market selection with often cheaper prices than upscale Whole Foods, after pausing expansion to overhaul the in-store experience. The stores have replaced its Just Walk Out technology with \"dash carts,\" where shoppers scan items before placing them in the cart.</p><p class=\"\">Amazon's changes to its Fresh stores have improved the shopping experience there, Egelanian said, though he feels the banner is still searching for a niche in the crowded grocery landscape.</p><p class=\"\">Martin said that \"providing customers with groceries and everyday essentials online and in store is a top priority for Amazon, and we plan to continue investing and innovating for customers in this area.\"</p><p class=\"\">Write to Kate King at kate.king@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002886:0/",
            "pub_date": "2025-02-05 01:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009185:0",
            "title": "Gold Keeps Hitting Record Highs As Tariffs Create More Market Drama — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul R. La Monica</p><p class=\"\">Worries about tariffs are spooking many investors. But not gold bulls. Fans of the yellow metal are probably relishing all the uncertainty that President Donald Trump's tariff threats are creating.</p><p class=\"\">Gold prices are up nearly 9% already this year At just under $2,900 an ounce, the yellow metal is at a record high. And that follows a nearly 30% gain for gold in 2024.</p><p class=\"\">Investors in mining stocks are doing even better. The VanEck Gold Miners exchange-traded fund, which has big stakes in Newmont Corp., Agnico Eagle Mines and Barrick Gold, has soared 18% so far in 2025.</p><p class=\"\">Should investors be a little wary after such a big run this year on top of 2024's massive gains? Of course. That would be prudent. But it's worth noting that the mining stocks could have more room to run if gold prices keep climbing. And that seems very plausible.</p><p class=\"\">It appears that both foreign central banks and retail investors are fueling the rally. Poland, Turkey, India, and China have been big buyers, according to data from late last year from the World Gold Council.</p><p class=\"\">\"Emerging market banks are very committed to gold and well positioned to purchase more. Strategically, they will continue to be buyers,\" said Joe Cavatoni, senior markets strategist with the World Gold Council, in an interview with Barron's.</p><p class=\"\">It's all about the Trump trade war. The continued surge in gold is a bit unusual since it's happening at a time when the U.S. dollar is also strengthening.</p><p class=\"\">Frank Watson, a markets analyst for Kinesis Money, pointed out that a surging greenback is \"normally a bearish element for dollar-denominated gold prices,\" but he added that \"gold's safe haven appeal remains undiminished amid uncertainty over the economic and inflationary effects of expected US trade tariffs.\" In other words, Trump trade policies may trump the usual impact a strong dollar has on gold.</p><p class=\"\">Silver prices have been climbing too, rising about 13% so far this year. Alex Ebkarian, chief operating officer of physical precious metals dealer Allegiance Gold, said in an email to Barron's that the prices of both metals should keep climbing due to the market uncertainty.</p><p class=\"\">\"In a high-risk environment, the appeal of physical gold and silver becomes even more pronounced, as they eliminate counterparty risk and provide a reliable store of value,\" he said, adding that the recent move by JPMorgan Chase to deliver about $4 billion worth in gold futures is \"an apparent hedge against potential trade disruptions.\"</p><p class=\"\">So how much higher could gold go? Michael Arone, chief investment strategist for State Street's SPDR Business, thinks gold could top $3,000 an ounce sometime this year due to all that's happening on the worldwide landscape.</p><p class=\"\">\"Geopolitical risks and structural transitions in monetary and fiscal policies should also boost the prospects for gold,\" Arone wrote. \"Central bank purchases throughout the year will likely continue to support gold's price. All that could finally unleash some pent up investment demand from investors chasing last year's record gold prices.\"</p><p class=\"\">That should be good news as well for the mining stocks, which despite their big run already this year, remain reasonably valued. The VanEck Gold Miners ETF is trading for just 12 times 2025 earnings estimates, lower than its 5-year average of 15. It's also trading at about a price-to-earnings ratio that is 45% below the S&amp;P 500, much steeper than its usual 20% discount to the broader market.</p><p class=\"\">Write to Paul R. La Monica at paul.lamonica@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009185:0/",
            "pub_date": "2025-02-05 01:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009180:0",
            "title": "Ball Prepares for Tariffs, Which CEO Says Would Hurt Demand — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tariffs would certainly dampen Ball's current outlook, Chief Executive Dan Fisher says on a call with analysts. The aluminum-can maker has spent the better part of the last few weeks renegotiating deals with its Chinese aluminum suppliers in an attempt to mitigate a $40 million to $50 million issue, he says: \"I think we've got that resolved down to a couple million dollars.\" The larger concern now revolves around consumer sentiment. Consumers are already pretty stressed, Fisher says, adding that higher costs stemming from a 25% tariff would stifle demand and be a headwind to growth. Shares fall 8% after Ball reports a decline in 4Q sales and logs a loss. (connor.hart@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009180:0/",
            "pub_date": "2025-02-05 01:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009186:0",
            "title": "STOXX Europe 600 Index Ends 0.22% Higher at 536.04 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 600 Index is up 1.19 points or 0.22% today to 536.04</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Third highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its record close of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 52-week high of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 11.02% from its 52-week low of 482.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 10.12% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 2025 closing high of 539.53 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.48% from its 2025 closing low of 508.19 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 28.42 points or 5.60%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009186:0-stoxx-europe-600-index-ends-0-22-higher-at-536-04-data-talk/",
            "pub_date": "2025-02-05 01:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009188:0",
            "title": "FTSE 100 Index Ends 0.15% Lower at 8570.77 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The FTSE 100 Index is down 12.79 points or 0.15% today to 8570.77</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Down for two consecutive trading days</li><li class=\"listItem-bmN0_SHH\">Down 103.19 points or 1.19% over the last two trading days</li><li class=\"listItem-bmN0_SHH\">Largest two day point and percentage decline since Friday, Dec. 20, 2024</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its record close of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 35.23% since the pre-Brexit vote level of 6338.10 hit Thursday, June 23, 2016</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 52-week high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 14.09% from its 52-week low of 7512.28 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 11.58% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 2025 closing high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 4.50% from its 2025 closing low of 8201.54 hit Tuesday, Jan. 14, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 397.75 points or 4.87%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009188:0-ftse-100-index-ends-0-15-lower-at-8570-77-data-talk/",
            "pub_date": "2025-02-05 01:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:38f07d3d2865a:0",
            "title": "ESTEE LAUDER COMPANIES INC SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estée Lauder Companies Inc., a global leader in prestige beauty, has released its Form 10-Q report for the second quarter of fiscal year 2024. The report highlights the company's financial performance and operational activities during the three months ended December 31, 2024. Despite facing challenges in key markets, the company is actively implementing strategic initiatives to drive future growth and operational efficiency.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Sales</strong>: $4,004 million for the three months ended December 31, 2024, reflecting a decrease from $4,279 million in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Profit</strong>: $3,047 million for the three months ended December 31, 2024, compared to $3,125 million in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operating Income (Loss)</strong>: $(580) million for the three months ended December 31, 2024, a significant decline from $574 million in the same period of 2023, primarily due to impairment charges.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Earnings (Loss) Attributable to The Estée Lauder Companies Inc.</strong>: $(590) million for the three months ended December 31, 2024, compared to $313 million in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Earnings (Loss) Attributable to The Estée Lauder Companies Inc. per Common Share - Basic</strong>: $(1.64) for the three months ended December 31, 2024, compared to $0.87 in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Earnings (Loss) Attributable to The Estée Lauder Companies Inc. per Common Share - Diluted</strong>: $(1.64) for the three months ended December 31, 2024, compared to $0.87 in the same period of 2023.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong>: The Estée Lauder Companies Inc. reported revenue across various product categories, including skin care, makeup, fragrance, and hair care. The company experienced a decline in revenue in certain segments due to lower-than-expected growth in key geographic regions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance</strong>: The company faced challenges in key geographic regions, particularly in mainland China, Asia travel retail, and Hong Kong SAR, which impacted the performance of brands like TOM FORD and Too Faced.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">New Product Launches</strong>: During the reporting period, the company focused on launching new products under its existing brands to drive growth and capture market share in competitive segments.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: The company is implementing the Profit Recovery and Growth Plan (PRGP) to rebuild profit margins and enhance operational efficiency. This plan includes restructuring efforts aimed at reducing costs and improving gross margins.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Restructuring Initiatives</strong>: The company announced a restructuring program as part of the PRGP, which involves reorganization and rightsizing efforts, with an estimated reduction of 5,800 to 7,000 positions globally. This initiative is expected to be completed by the end of fiscal 2027.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Efficiency</strong>: The company is focusing on optimizing its supply chain and procurement processes to enhance efficiency and reduce waste, aiming for a zero-waste approach to minimize excess inventory.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Digital Transformation</strong>: Efforts are underway to reorganize and right-size the company's technology functions to create a more agile and effective digital organization, supporting both internal and commercial capabilities.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1001250/000100125025000011/el-20241231.htm\" rel=\"nofollow\" target=\"_blank\">ESTEE LAUDER COMPANIES INC [ EL ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:38f07d3d2865a:0-estee-lauder-companies-inc-sec-10-q-report/",
            "pub_date": "2025-02-05 01:53:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009191:0",
            "title": "STOXX Europe 50 Index Ends 0.11% Higher at 4577.55 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 50 Index is up 5.12 points or 0.11% today to 4577.55</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 13 of the past 15 trading days</li><li class=\"listItem-bmN0_SHH\">Off 11.69% from its record close of 5183.24 hit Tuesday, May 2, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 52-week high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 9.02% from its 52-week low of 4198.67 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 7.86% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 2025 closing high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 6.06% from its 2025 closing low of 4316.04 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 268.92 points or 6.24%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009191:0-stoxx-europe-50-index-ends-0-11-higher-at-4577-55-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009192:0",
            "title": "EURO STOXX 50 Index Ends 0.89% Higher at 5264.59 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The EURO STOXX 50 Index is up 46.68 points or 0.89% today to 5264.59</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 14 of the past 16 trading days</li><li class=\"listItem-bmN0_SHH\">Off 3.66% from its record close of 5464.43 hit Monday, March 6, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 52-week high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 15.16% from its 52-week low of 4571.60 hit Monday, Aug. 5, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 12.23% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 2025 closing high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.07% from its 2025 closing low of 4871.45 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 368.61 points or 7.53%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009192:0-euro-stoxx-50-index-ends-0-89-higher-at-5264-59-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009189:0",
            "title": "DAX Ends 0.36% Higher at 21505.70 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The DAX is up 77.46 points or 0.36% today to 21505.70</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its record close of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 52-week high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 27.40% from its 52-week low of 16880.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 26.26% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 2025 closing high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.04% from its 2025 closing low of 19906.08 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 1596.56 points or 8.02%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009189:0-dax-ends-0-36-higher-at-21505-70-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009190:0",
            "title": "CAC 40 Index Ends 0.66% Higher at 7906.40 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The CAC 40 Index is up 51.48 points or 0.66% today to 7906.40</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up three of the past four trading days</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its record close of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fifth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its 52-week high of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Up 10.89% from its 52-week low of 7130.04 hit Tuesday, Aug. 6, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 3.50% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.55% from its 2025 closing high of 7950.17 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.57% from its 2025 closing low of 7282.22 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 525.66 points or 7.12%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009190:0-cac-40-index-ends-0-66-higher-at-7906-40-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1NL:0",
            "title": "Coinbase urges US regulators to clear path for banks to offer crypto services",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Coinbase Global  on Tuesday renewed its call for U.S. banking regulators to clarify or revise their position on banks offering cryptocurrency services as well as potentially doing tie-ups with companies in the digital assets sector. </p><p class=\"\">The crypto exchange's move comes amid a broader industry push to lobby lawmakers for a regulatory framework to support the sector's growth. Most traditional U.S. banks have steered clear of digital asset firms, citing lack of regulatory clarity. </p><p class=\"\">\"For the last several years, U.S. bank regulators have unilaterally and undemocratically barred banks from offering crypto services,\" Coinbase Chief Policy Officer Faryar Shirzad said on social media platform X.</p><p class=\"\">The industry had donated millions of dollars to back Donald Trump's return to the White House, as it sought making cryptocurrency regulation a top priority for the new administration after years of enforcement actions that companies have criticized as overreach. </p><p class=\"\">Shirzad also sent a letter to top U.S. banking regulators, including, the Office of the Comptroller of the Currency (OCC), the Federal Reserve and the Federal Deposit Insurance Corporation (FDIC), urging them to permit banks to offer services tied to the crypto sector. </p><p class=\"\">The OCC declined to comment, and the Fed and FDIC did not immediately respond to Reuters' requests for comments. </p><p class=\"\">While crypto companies have alleged that U.S. bank supervisors have made a concerted effort to choke them off the traditional financial system, regulators have denied the claim. </p><p class=\"\">Last month, the U.S. Securities and Exchange Commission's new leadership created a task force to develop a regulatory framework for crypto assets.</p><p class=\"\">Trump, who has promised to be a \"crypto president\", has also named former PayPal  executive David Sacks as his \"White House A.I. &amp; Crypto Czar\". </p><p class=\"\">The administration is expected to reshape U.S. policy on digital currency, but U.S. bankers have so far remained cautious on cryptocurrencies.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1NL:0-coinbase-urges-us-regulators-to-clear-path-for-banks-to-offer-crypto-services/",
            "pub_date": "2025-02-05 01:55:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309124:0",
            "title": "CRTC Decision on Whether Big 3 Will be Able to Resell Each Other's Networks Delayed, Says National Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The final CRTC Decision on Big 3 telecoms access to Third Party Internet Access has been pushed to the summer, notes National Bank. </p><p class=\"\">Analyst Adam Shine writes that, \"Less than a week before the Super Bowl, the CRTC opted on Monday to punt its decision by several months on whether to allow the Big 3 to resell each other's networks.\"</p><p class=\"\">Shine also notes that despite many TPIA disclosures by the CRTC over the past 15 months, critical elements remain outstanding - what will final rates look like and who exactly will be able to participate in the new TPIA regime.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309124:0/",
            "pub_date": "2025-02-05 01:46:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204007381:0",
            "title": "Spotify's cites 'innovative' culture, video podcast success in user boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Steve Gelsi</p><p class=\"\">User growth of 12% powers revenue past estimates</p><p class=\"\">Spotify Technology S.A. reported a fourth-quarter profit as the music streaming service's monthly active users climbed by double-digits over the year-ago period, sending shares of the company up sharply higher in premarket trading.</p><p class=\"\">Spotify stock (SPOT) was up 9.6% in early trading.</p><p class=\"\">Spotify said it expects to add 3 million net new monthly active users (MAUs) to 678 million by the end of the first quarter. That's a little bit above the FactSet consensus estimate of 677 million.</p><p class=\"\">Spotify ended the fourth quarter with about 675 million monthly active users, up 12% from the year-ago period and ahead of the previous  quarter by 5%.</p><p class=\"\">Spotify's monthly active user figure of 675 million also beat the Wall Street analyst consensus estimate of 664 million.</p><p class=\"\">Spotify also swung to a profit of  EUR1.76 a share from a loss of EUR0.36 in the year-ago quarter. The company was expected to earn  EUR1.99 a share.</p><p class=\"\">The company said its fourth-quarter revenue rose to EUR4.24 billion, ahead of the FactSet consensus estimate of  EUR 4.15 billion.</p><p class=\"\">Looking ahead, Spotify projected first-quarter revenue of EUR4.2 billion, slightly below the analyst estimate of just under EUR4.3 billion.</p><p class=\"\">-Steve Gelsi</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204007381:0/",
            "pub_date": "2025-02-05 01:47:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009163:0",
            "title": "PepsiCo Sees More Sluggishness in North American Trends — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PepsiCo turned in mixed results for 4Q as strong international growth was offset by softer-than-expected results in North America, Edward Jones analyst Brittany Quatrochi says in a research note. Trends in North America are still sluggish as consumers continue to seek out value, which has been cutting into salty snack sales, the analyst says. The company is also still recovering from a product recall at Quaker, she says. Given its challenges with the U.S. consumer, PepsiCo is guiding for 2025 earnings growth to be weaker than its long-term outlook, the analyst says. Shares fall 4.4% to $143.71. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009163:0/",
            "pub_date": "2025-02-05 01:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009165:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1247 ET - PepsiCo turned in mixed results for 4Q as strong international growth was offset by softer-than-expected results in North America, Edward Jones analyst Brittany Quatrochi says in a research note. Trends in North America are still sluggish as consumers continue to seek out value, which has been cutting into salty snack sales, the analyst says. The company is also still recovering from a product recall at Quaker, she says. Given its challenges with the U.S. consumer, PepsiCo is guiding for 2025 earnings growth to be weaker than its long-term outlook, the analyst says. Shares fall 4.4% to $143.71. (dean.seal@wsj.com)</p><p class=\"\">1232 ET - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p><p class=\"\">1216 ET - The automotive industry should pursue partnerships over traditional mergers and acquisitions, Bain &amp; Company says in a report. Companies have largely held off on M&amp;A in 2024 amid uncertainty and mounting cost pressures, with deal volumes falling about 60% during the first three quarters of the year, the management-consultancy firm says. But alliances could offer a solution, it notes. \"Activity is likely to pick up as companies acknowledge that they can't go it alone much longer,\" Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1216 ET - PayPal is renegotiating deals with large merchants of its Braintree subsidiary and expects to see a resulting 5 percentage point headwind to revenue growth in 2025, CFO Jamie Miller says on a call with analysts. The company is shifting away from some of the volume from the unbranded payment processing unit, which should prove to be accretive to transaction margin dollars, a measure of profitability, according to Miller. \"Over the next few quarters, we will continue to work through renegotiations, at which point we should reach a new baseline to drive faster volume and revenue growth,\" the CFO says. (dean.seal@wsj.com)</p><p class=\"\">1132 ET - JBS, the world's largest meatpacker, says it's investing $200 million in two of its largest U.S. beef plants at a time when meatpackers are broadly struggling to make a profit because of a lack of cattle, driving up costs. The company said $150 million will go to its Cactus, Texas, plant to improve the part of the facility where carcasses are processed into primal cuts and expand its ground beef room. JBS says it will put $50 million toward its Greeley, Colo., plant to build a new distribution center. JBS said the investments will improve efficiencies and could increase production capacity at the two plants that both have the capability to slaughter about 6,000 cattle a day. \"We believe now is the time to invest in the United States,\" said Wesley Batista Filho, JBS' U.S. CEO. (patrick.thomas@wsj.com)</p><p class=\"\">1130 ET - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1108 ET - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p><p class=\"\">1056 ET - Shares of big food companies dip after Robert F. Kennedy Jr. clears a Senate Finance Committee vote on his prospective leadership of Health and Human Services. While Kennedy said he supported vaccines in his Senate testimony, aiming to calm concerns over some of his past criticisms, he reiterated concerns about processed foods, which he's blamed for exacerbating chronic disease. Kraft Heinz recently down 2.3%, with other food stocks like Campbell's, JM Smucker and General Mills down around 2%. ( jacob.bunge@wsj.com; @jacobbunge)</p><p class=\"\">1050 ET - Generative artificial intelligence is here to stay, and set to have a profound impact on the mergers and acquisitions market, Bain &amp; Company says in a report. \"We expect that companies that master the use of generative AI in M&amp;A over the next five years will identify targets faster than their competitors,\" the management-consulting firm says. About one in five surveyed companies currently uses generative AI in M&amp;A processes, and more than half expect to integrate it into their dealmaking by 2027, according to the report. Late followers to adopt AI will be outbid for good deals and find themselves staying too long in the process for bad deals, Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1044 ET - Publicis' guidance for 2025 and the company's track record of being conservative in its initial outlook leave room for upgrades, CFRA's Danny Yeo Sze Wai says in a research note. The French advertising group ended the year with strong momentum in the fourth quarter, when organic net revenue growth of 6.3% beat expectations. \"[Publicis] is targeting 4%-5% of organic growth in net revenue for 2025, similar to its guidance for 2024. However, we still anticipate upside potential given its history of being conservative in terms of providing future projections,\" the analyst says. Shares in Publicis rise 1.6%. (adria.calatayud@wsj.com)</p><p class=\"\">1042 ET - Grain merchant ADM says as part of its plan to cut costs it could shutter or divest facilities that are in need of repair, have a history of poor performance or are located in areas with excess capacity. CEO Juan Luciano said on a call with investors that the company has identified about $2 billion worth of opportunities. The company is facing pressure from low crop prices and falling profit margins in its oilseed processing business. \"We will execute on this over time,\" Luciano said. (patrick.thomas@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009165:0/",
            "pub_date": "2025-02-05 01:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309119:0",
            "title": "GlucoTrack Prices $3 Million Public Offering; Shares Fall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GlucoTrack  said Tuesday it has priced a \"best efforts\" public offering of about 2.6 million shares at $1.15 a share to raise some $3.0 million. </p><p class=\"\">The offering, with Dawson James Securities as the placement agent, is expected to close Wednesday, the medical technology company said. </p><p class=\"\">The shares were down over 7% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309119:0/",
            "pub_date": "2025-02-05 01:47:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}