{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463921:0",
            "title": "TSH Resources Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TSH Resources  bought back 1,150,000 shares for 1.4 million ringgit on Wednesday, according to a same-day disclosure on the Singapore bourse. </p><p class=\"\">The shares were repurchased at between 1.19 ringgit and 1.22 ringgit apiece, the dual-listed oil palm cultivation and wood products company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463921:0/",
            "pub_date": "2025-02-05 17:41:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0KE:0",
            "title": "AMD shares dive as AI chip revenue disappoints investors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Advanced Micro Devices  shares fell 9% in premarket trading on Wednesday, after the company's AI chip revenue failed to meet lofty expectations of investors betting billions on growth prospects of generative artificial intelligence.</p><p class=\"\">AMD, one of the biggest providers of chips for personal computer and servers, reported quarterly results and revenue outlook above analyst estimates, but that was overshadowed by its miss in AI chip-related revenue as investors scrutinized its results against Nvidia , which controls nearly 80% share of the market.</p><p class=\"\">The Santa Clara, California-based company reported fourth-quarter data center revenue - a proxy for its AI revenue - of $3.9 billion, compared to the consensus estimate of $4.15 billion.</p><p class=\"\">\"AMD may still be taking market share from Intel in the central processing unit (CPU) side of things, but it remains a long way behind Nvidia and is struggling to catch up when it comes to graphics processing units (GPU),\" said Ben Barringer, technology analyst at Quilter Cheviot.</p><p class=\"\">\"Investors want the company to take the fight to Nvidia, but for now it is very much struggling to break the moat and disrupt its market position,\" he added.</p><p class=\"\">If losses hold, AMD is set to lose around $17.5 billion in market capitalization at $108.78 premarket, according to data compiled by LSEG.</p><p class=\"\">The results comes as tech giants including Microsoft  and Meta  increasingly dedicate resources to develop their own silicon for processing large data volumes required by GenAI, amid rising competition from Chinese AI company DeepSeek.</p><p class=\"\">\"Investors were always going to be more sensitive, given the arrival of...DeepSeek,\" said Susannah Streeter, head of money and markets at Hargreaves Lansdown, adding that AMD's results and outlook have \"knocked confidence further.\"</p><p class=\"\">At least 5 analysts have cut their price targets on the stock, with median PT now at $155, compared to $166.5 before the results.</p><p class=\"\">AMD's stock fell 18% in 2024, while Nvidia gained 171% in the same period.</p><p class=\"\">AMD's 12-month forward price-to-earnings ratio stands at 23.39, compared with Nvidia's 26.27.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0KE:0-amd-shares-dive-as-ai-chip-revenue-disappoints-investors/",
            "pub_date": "2025-02-05 17:41:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463924:0",
            "title": "San Miguel Food and Beverage Declares Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">San Miguel Food and Beverage  declared a regular cash dividend of 0.50 Philippine pesos per share, according to a Wednesday Philippine Stock Exchange filing. </p><p class=\"\">The dividend is payable on March 6 to shareholders on record as of Feb. 19, the Philippine food and beverage giant said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463924:0/",
            "pub_date": "2025-02-05 17:41:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0TZ:0",
            "title": "US-China trade war sparks record-breaking rally in gold",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Bullion hits all-time high at $2,869.68</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Global gold demand up 1% in 2024 - WGC says</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump in no hurry to talk to Xi amid new tariff war</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Silver, platinum up over 1%</li></ul></span></div><span><p class=\"\">    Gold prices jumped 1% on Wednesday, continuing their record rally, driven by safe-haven demand amid the escalating U.S.-China trade war, while the spotlight was also on payrolls data from the world's largest economy.</p><p class=\"\">Spot gold  rose 0.9% to $2,867.59 per ounce by 0906 GMT, after rising 1% and hitting a record high of $2,869.68 earlier in the session. U.S. gold futures  gained 0.7% to $2,895.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:852.0000000000001px;aspect-ratio:1.4200000000000002\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW0TZ-214176f3d37e695a5365fb38d728513c-resized.webp\" type=\"images/webp\"/><img alt='A line chart titled \"Spot gold price in USD per oz\" that tracks the metric over time.' class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW0TZ-214176f3d37e695a5365fb38d728513c-resized.jpeg\" style=\"background-color:#fbfbfc\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Spot gold price in USD per oz</span></figcaption></figure></span></p><p class=\"\">China imposed tariffs on U.S. imports in a prompt retaliation to newly introduced U.S. duties on Chinese goods, reigniting the trade war between the world's two largest economies, while U.S. President Donald Trump stated he is in no rush to speak with President Xi Jinping to de-escalate tensions.</p><p class=\"\">\"The potential economic consequences of a trade war between the U.S. and China are causing investors to fear a global recession and rising inflation,\" said Dominik Sperzel, head of trading at Heraeus Metals Germany.</p><p class=\"\">Meanwhile, three Federal Reserve officials warned that Trump's trade tariffs could drive inflation, with one suggesting that uncertainty over price outlooks warrants slower interest rate cuts. Investors this week are watching out for the ADP employment report and the payrolls report, which could shed further clues on the U.S. rate path.</p><p class=\"\">Bullion is considered an inflation hedge, but higher interest rates could dampen its appeal as the metal yields no interest.</p><p class=\"\">\"Gold is overbought and needs to correct,\" said StoneX analyst Rhona O'Connell, adding \"there is still scope for further upside, but barring any black swans we still expect to see the price topping out this year.\"</p><p class=\"\">Gold's relative strength index is at 76, indicating that the price has surpassed the \"overbought\" territory that starts at 70. </p><p class=\"\">Meanwhile, global gold demand rose 1% to a record 4,974.5 metric tons in 2024, driven by higher investment and increased central bank purchases in the fourth quarter, according to the World Gold Council.</p><p class=\"\">Spot silver  rose 1.1% to $32.44 per ounce, platinum  gained 1.3% to $976.05 and palladium  added 0.8% to $998.00.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0TZ:0-us-china-trade-war-sparks-record-breaking-rally-in-gold/",
            "pub_date": "2025-02-05 17:41:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463926:0",
            "title": "Thor Energy Names New Managing Director",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uranium and energy metals explorer Thor Energy  appointed Andrew Hume as its new managing director, according to a Wednesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463926:0/",
            "pub_date": "2025-02-05 17:42:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObiQnzRXa:0",
            "title": "Crayon: Invitation to Q4 2024 presentation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crayon Group Holding ASA will publish its Q4 2024 financial results onFebruary12th, 2025, at 7:00 am CET.</p><p class=\"\">CEO Melissa Mulholland and CFO Brede Huser will present the results in a livewebcast at 8:30 am CET.</p><p class=\"\">The materials and webcast can be accessed atwww.crayon.com/investor-relations/.</p><p class=\"\">There will be a Q&amp;A session after the presentation. To join the conferencecallby telephone and ask questions, please use the information below.</p><p class=\"\">Dial in numbers:</p><p class=\"\">DK: +45 7876 8490</p><p class=\"\">SE: +46 8 1241 0952</p><p class=\"\">NO: +47 2195 6342</p><p class=\"\">UK: +44 203 769 6819</p><p class=\"\">US: +1 646-787-0157</p><p class=\"\">DE: +49 30 21789327</p><p class=\"\">Conference Code: 115901</p><p class=\"\">A recording of the presentation and Q&amp;A session will be available on-demandafter the live event has concluded.</p><p class=\"\">Investor contact:</p><p class=\"\">Kjell Arne Hansen Head of Investor Relation &amp; Corporate Finance</p><p class=\"\">ir@crayon.com</p><p class=\"\">+47 950 40 372</p><p class=\"\">About Crayon</p><p class=\"\">Crayon is a customer-centric innovation and IT services company with over4000team members across 46 countries. We optimize businesses' IT estate to helptheminnovate with expertise they can trust. Our services create value forcompaniesto thrive today, and scale for tomorrow. For more information, visitwww.crayon.com.</p><p class=\"\">https://newsweb.oslobors.no/message/637755</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObiQnzRXa:0-crayon-invitation-to-q4-2024-presentation/",
            "pub_date": "2025-02-05 17:42:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002901:0",
            "title": "U.K. July 2053 Green Gilt Likely to Outperform in Relative Value Basis — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.K. Debt Management Office auction of the July 2053 green gilt at 1000 GMT is expected to perform well in relative value terms, RBC Capital Markets analysts say in a note. Wednesday's tap is likely to be the final one for the green gilt, which should support demand for the bond, the analysts say. \"We have also observed that outgoing 30-year conventional gilts have consistently outperformed into the end of their tapping cycles,\" RBC says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002901:0/",
            "pub_date": "2025-02-05 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012106:0",
            "title": "Novo Nordisk Stock Rises After Earnings Beat. There Are Some Growth Concerns. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis and Elsa Ohlen</p><p class=\"\">Novo Nordisk stock rose Wednesday after the Danish drugmaker reported quarterly earnings above analysts' expectations, but forecast slower growth ahead.</p><p class=\"\">Novo posted fourth-quarter earnings of 6.34 ($0.88) Danish kroner a share on sales of 85.7 billion DKK, beating expectations for earnings of 5.98 DKK a share on sales of 80.1 billion DKK, according to FactSet.</p><p class=\"\">The maker of weight-loss and diabetes drugs Ozempic and Wegovy forecast sales growth of between 16% and 24% in 2025, less than the 26% growth observed in 2024.</p><p class=\"\">Novo's Danish listed shares rose 5.1% in early trading Wednesday.</p><p class=\"\">This is breaking news. Read a preview of Novo Nordisk below and check back for more analysis soon.</p><p class=\"\">When Danish drugmaker Novo Nordisk reports its quarterly financial results on Wednesday, investors will be looking for reassurance the GLP-1 market is still on track for the enormous growth Wall Street expects.</p><p class=\"\">Novo shares have taken a beating in recent months, with the stock's American depositary receipts falling nearly 40% in the last six months of 2024. Shares first slid on growing worries that sales of its weight-loss drug Wegovy and its Type 2 diabetes drug Ozempic wouldn't live up to the hype, and then on very disappointing trial data.</p><p class=\"\">A positive pipeline update in January wasn't enough to reverse the momentum, and the ADRs were down roughly 30% over the past 12 months as of Tuesday.</p><p class=\"\">Novo's Wegovy and Ozempic are among the most consequential, closely watched new medications in recent history, but they face serious competition from Eli Lilly's Zepbound and Mounjaro, and from legal copycats manufactured by compounding pharmacies and sold by telehealth firms.</p><p class=\"\">While the compounders will soon be barred from selling knockoffs of the Lilly drugs, Novo's drugs remain in shortage, and can legally be copied.</p><p class=\"\">Analysts expect Novo to report fourth-quarter sales of 80.1 billion Danish Krone, or $11.1 billion, on Wednesday, and earnings of 5.98 DKK per share, or $0.83, according to FactSet.</p><p class=\"\">Investors will be paying particularly close attention to Wegovy and Ozempic sales for the quarter. Current FactSet consensus estimates put Wegovy sales at 20 billion DKK, or $2.8 billion, for the quarter, and Ozempic sales at 33 billion DKK, or $4.6 billion.</p><p class=\"\">Investors will also be looking for updates on supply of the two medicines. Novo in December closed an $11 billion deal to ramp up its supply of GLP-1 medicines, though it could take time for the results of that deal to be felt in the market.</p><p class=\"\">\"If we redirect everything that we have of GLP-1 to the U.S. we will be immediately out of the drug shortage situation,\" Henrik Wulff, executive vice president for product supply, quality, and information technology at Novo, told Barron's in December. But Novo serves markets worldwide.</p><p class=\"\">\"We try to balance these launches up against the in-market demands, and try to guesstimate how we can get out of the drug shortages,\" he said.</p><p class=\"\">Shares of Novo have yet to recover from a startling update in late December on CagriSema, a next-generation weight-loss drug. Novo had said it expected patients to lose at least 25% of their body weight on CagriSema, but in a Phase 3 trial patients only lost 22.7%.</p><p class=\"\">In January, Novo unveiled early results on another weight loss drug, amycretin, which appeared very promising, though the drug has years of studies ahead of it before it can make it to market.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012106:0/",
            "pub_date": "2025-02-05 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002896:0",
            "title": "China's Lunar New Year Travel, Spending Boom Offers Positive Signs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China reported record-high tourism revenue and travel numbers during the Lunar New Year holiday, offering a glimmer of hope for policymakers as they continue their efforts to boost sluggish domestic demand.</p><p class=\"\">Data showing consumers spending more on both goods and services could signal that Beijing's flurry of measures to bolster demand are taking effect. Sustainably reviving consumption in the world's second-largest economy has taken on particular urgency as China's exports face growing headwinds from U.S. tariffs.</p><p class=\"\">Tourism revenues in China during the eight-day holiday that ended Tuesday rose 7.0% in year-over-year terms to 677 billion yuan, or about $94.23 billion, while the number of domestic trips rose 5.9% to 501 million, the state-run Xinhua News Agency reported Wednesday, citing data from China's Ministry of Culture and Tourism.</p><p class=\"\">Several indicators for the cultural and tourism market, including the number of trips and tourism spending, hit record highs during the eight-day holiday following the Lunar New Year, said Xinhua.</p><p class=\"\">Box office data was also upbeat, with revenue and moviegoer numbers both hitting new highs. Box office revenue reached 9.51 billion yuan as more than 187 million people went to cinemas, according to the China Film Administration.</p><p class=\"\">\"China had a solid start to the Year of the Snake,\" Citi Research analysts led by Xiangrong Yu said in a note.</p><p class=\"\">The holiday saw a return of the travel rush, with cross-border travel gaining momentum, especially for inbound tourism, they said, while the government's expanded trade-in programs boosted consumer demand.</p><p class=\"\">A total of 14.37 million cross-border trips in and out of China were made during this year's holiday, marking a 6.3% increase from the same period last year, data from the National Immigration Administration showed. Of that total, foreign nationals accounted for 958,000 trips, up 22.9% in year-over-year terms after Beijing eased restrictions on foreign travel.</p><p class=\"\">During the Lunar New Year, China's goods consumption grew 9.9%, while services consumption rose 12.3% from the same period a year ago, according to the State Taxation Administration, based on value-added tax data. Sales of home appliances and furniture saw strong growth, driven by trade-in policies, alongside robust demand for tourism, cultural, and sports services, it said.</p><p class=\"\">The relatively positive data comes after a private gauge of services sector activity pointed to softer growth, and as markets continue to digest the opening salvos in the U.S.-China trade spat.</p><p class=\"\">On Tuesday, Beijing announced a series of retaliatory measures in response to President Trump's tariff hike on Chinese goods. China's measures targeted both U.S. goods and companies, including an additional 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on crude oil, agricultural machinery, and certain vehicles.</p><p class=\"\">Domestic policy is now the main thing to watch as the tariff action between the U.S. and China continues to unfold, the Citi analysts said.</p><p class=\"\">At the next big policy event in March, the National People's Congress, they expect Beijing to stick to a framework targeting economic growth of \"around 5.0%\" this year. Government financing could be expanded, and monetary policy might require some tweaking given the central bank's determination to keep the yuan stable, they said. More rate cuts and lower reserve requirements for lenders are likely on the cards.</p><p class=\"\">Write to Singapore editors at singaporeeditors@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002896:0-china-s-lunar-new-year-travel-spending-boom-offers-positive-signs/",
            "pub_date": "2025-02-05 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW08H:0",
            "title": "Stocks knocked by Alphabet earnings; gold hits record",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar loses out to yen, Treasury yields ease</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Wall St futures dip after Alphabet earnings disappoint</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold at record; Europe stocks helped by Novo Nordisk beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">    Global stocks fell on Wednesday, after disappointing earnings from Alphabet knocked Wall Street futures, while the dollar took a dive against the yen, which rallied sharply after Japanese wage data upped the chances of another rate hike.</p><p class=\"\">Investors shrugged off comments from President Donald Trump that the U.S. would like to take over the war-ravaged Gaza Strip and develop it economically.</p><p class=\"\">The suggestion came out of the blue and underlined the risk of more policy uncertainty and market volatility ahead. Gold hit another record high, driven mostly by a weaker dollar.</p><p class=\"\">In Europe, activity was dominated by a heavy day for earnings, where shares in Novo Nordisk , the most valuable company in the region, rose 4% after beating fourth-quarter expectations, which helped keep the STOXX 600  relatively steady on the day.</p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area,\" Paul Donovan, chief economist at UBS Global Wealth Management, said.</p><p class=\"\">Volatility across markets has run high in the last few trading days after Trump announced he would slap tariffs on Canada and Mexico, only to back-pedal within hours and agree to a one-month delay.</p><p class=\"\">Some sense of calm returned by Wednesday, leaving investors to focus on more micro-led events, such as company earnings, where Google parent Alphabet missed forecasts as it ramped up spending on capex. Its shares fell 8% in premarket trading, suggesting a heavy fall after the opening bell later.</p><p class=\"\">S&amp;P 500 futures  fell 0.4% and Nasdaq futures  lost 0.5% in response. Results out on Wednesday include Uber, Ford, Qualcomm and Walt Disney.</p><p class=\"\">The delays to tariffs have eased concern about how much scope the Federal Reserve might have to cut interest rates this year, pushing Treasury yields lower, although with China and Europe still in Trump's sights, the mood was cautious.</p><p class=\"\">\"The period of doubt - during which worries about 'tariff risk' prevails in the market - is not over yet,\" Thierry Wizman, global FX and rates strategist at Macquarie said in a note. \"Traders may revisit those doubts in 30 days, as Trump tries to extract more concessions from Mexico and Canada, and then the EU.\" </p><p class=\"\">DOLLAR SOFTENS</p><p class=\"\">Yields on two-year Treasuries (US2YT=RR) were back at 4.224% and off a peak of 4.282% hit on Monday, which in turn took some sheen off the dollar. The U.S. currency is relatively flat so far this year against a basket of major currencies, having risen 7% in 2024.</p><p class=\"\">Chinese markets returned from a week-long break for the Lunar New Year holidays. China has, so far, made a relatively restrained response to Trump's additional 10% in tariffs, announcing levies that cover just $14 billion of U.S. exports.</p><p class=\"\">Beijing set a firm fix for its yuan, countering concerns it might allow the currency to slide to offset the impact of tariffs on its exports.</p><p class=\"\">Elsewhere in Asia, the Japanese yen  strengthened sharply against a range of currencies, after upbeat data on wages supported expectations of further tightening by the Bank of Japan this year.</p><p class=\"\">The dollar fell almost 1% against the yen to 152.875, while the euro  was down 0.6% at 159.18.</p><p class=\"\">Against the dollar, the euro rose 0.3% to $1.041 , having pulled off a two-year trough of $1.0125 at the start of the week. The dollar also fell 0.3% against the Canadian dollar to C$1.4282 , below this week's 22-year high at C$1.4792.</p><p class=\"\">In commodities, gold hit a fresh all-time high at $2,869.68 an ounce  aided in part by the pullback in the dollar and Treasury yields.</p><p class=\"\">Oil prices were weighed down by China's tariffs on imports of U.S. oil, which offset a potential boost from reports Trump had restored his \"maximum pressure\" campaign on Iran in a bid to drive Iranian oil exports to zero. </p><p class=\"\">Brent  was down 0.7% to $75.67 a barrel, while U.S. crude  fell 0.65% to $72.23.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW08H:0-stocks-knocked-by-alphabet-earnings-gold-hits-record/",
            "pub_date": "2025-02-05 17:43:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW139:0",
            "title": "Trump vows to take over Gaza",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    President Donald Trump said the United States would take over war-ravaged Gaza and create a \"Riviera of the Middle East\" after resettling Palestinians elsewhere, shattering decades of U.S. policy on the Israeli-Palestinian conflict.</p><p class=\"\">The shock move drew swift condemnation from regional heavyweight Saudi Arabia which Trump hopes will establish ties with Israel.</p><p class=\"\">Israel's shekel currency was largely flat against the dollar on Wednesday, trading at 3.56 versus the dollar . Israeli and Lebanese sovereign bonds were flat to higher, while those of Jordan and Egypt were flat to lower.</p><p class=\"\">COMMENTS:</p><p class=\"\">MARTEN BRESSEL, PORTFOLIO MANAGER AND TRADER, FIM PARTNERS, LONDON:</p><p class=\"\">    \"There is a big question mark around how credible these statements (by Trump) are.\"     </p><p class=\"\">    \"There has been some moderate reaction though, \"specifically Jordan and Egypt (bonds) are down compared to the rest of high yield and Egypt's FX forwards are a bit weaker too.\"   </p><p class=\"\">    \"When you see days like this, with these kinds of headlines you have reactionary moves, but generally the momentum (in investor sentiment towards the Middle East following the political reshaping in recent months) has been positive.\"  </p><p class=\"\">MODI SHAFRIR, CHIEF STRATEGIST FOR FINANCIAL MARKETS, BANK HAPOALIM, TEL AVIV:</p><p class=\"\">\"The risks to Israel will decline in the short term and that’s good for the shekel and local markets and also since it appears the coalition will not fall apart.\"</p><p class=\"\">ALEX ZABEZHINSKY, CHIEF ECONOMIST, MEITAV DASH BROKERAGE, TEL AVIV:</p><p class=\"\">\"The markets are reacting in a subdued manner. The gap between the announced plans and their implementation is too great to react to the news in a meaningful way.\"</p><p class=\"\">PAUL DONOVAN, CHIEF ECONOMIST, UBS GLOBAL WEALTH MANAGEMENT, LONDON:</p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area.\"</p><p class=\"\">YONIE FANNING, CHIEF STRATEGIST, MIZRAHI TEFAHOT BANK, TEL AVIV:</p><p class=\"\">\"We're seeing a positive market response to the initiative, this morning in the shekel, and also and at the opening of the TASE (Tel Aviv stock exchange). The equity response being primarily centred around banks gives a good example on how such a geopolitical improvement could tame local risks and support the local economy.\"</p><p class=\"\">DAVID MAKOVSKY, DIRECTOR OF THE PROGRAM ON ARAN-ISRAEL RELATIONS, WASHINGTON INSTITUTE OF NEAR EAST POLICY (ON X):</p><p class=\"\">\"Until the WH (White House) press conference, (Trump's)</p><p class=\"\">call for moving Gazans was seen largely as a negotiating ploy: maximalist opening position before reaching a deal--standard operating approach. </p><p class=\"\">\"Is this still the case? If no longer true, there will be a clamour for the WH to provide more of a blueprint of his proposal on a variety of levels so it is not dismissed. Yet, in immediate sense, Trumps remarks seems to shift media focus away from question of Phase Two of Ceasefire that is supposed to begin later this month. Overlooked, with focus on Trump, is that PM @netanyahu made clear at the press conference Israel would resume the fight against Hamas.\"</p><p class=\"\">FRANCESCO PESOLE, FX STRATEGIST, ING, LONDON:</p><p class=\"\">\"Markets are treating Trump’s announced intention to take over the Gaza Strip and evacuate Palestinians to neighbouring countries with scepticism. Should we see hints that the U.S. is planning to deploy troops in the Middle East, the market implications can be risk-off, oil-positive and dollar-positive, as Arab nations should firmly oppose the move.\"</p><p class=\"\">ALVIN TAN, HEAD OF ASIA FX STRATEGY, RBC CAPITAL MARKETS, SINGAPORE:</p><p class=\"\">\"There’s no discernible reaction. I think in general people are quite skeptical. Number one, those comments came out of nowhere. It upends long standing US policy. In general people are thinking he was just making comments off the cuff and this is not likely to be followed up as genuine U.S. foreign policy.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW139:0-trump-vows-to-take-over-gaza/",
            "pub_date": "2025-02-05 17:43:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205005554:0",
            "title": "Amazon and Temu's owner sees stock-market pressure as U.S. Postal Service to stop accepting Chinese parcels",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Steve Goldstein</p><p class=\"\">Shares of Amazon.com and PDD Holdings, the owner of popular Chinese shopping app Temu, fell on Wednesday after the U.S. Postal Service said it would stop accepting parcels from China and Hong Kong.</p><p class=\"\">The move comes after the U.S. imposed an additional 10% tariff on Chinese goods, and importantly, ended a customs exception for small-value parcels under $800 to enter the U.S. without paying tax.</p><p class=\"\">The Postal Service did not give an explanation for the move and did not quantify how long the \"temporary\" suspension would last.</p><p class=\"\">Amazon.com shares (AMZN) fell 2%. In last year's annual statement, Amazon said China-based sellers account for a significant portion of third-party seller services and advertising revenue. An e-commerce intelligence firm, Marketplace Pulse, said Chinese-based sellers account for nearly 50% of the top 10,000 sellers on Amazon in the U.S.</p><p class=\"\">PDD shares (PDD) fell 5% in premarket trade. Shein, another popular Chinese retailer, is not yet publicly traded as it contemplates an initial public offering.</p><p class=\"\">FedEx (FDX) and United Parcel Services (UPS), which could benefit from the Postal Service suspension, were little moved in premarket trade.</p><p class=\"\">-Steve Goldstein</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205005554:0/",
            "pub_date": "2025-02-05 17:45:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463925:0",
            "title": "Asia Optical, MetaOptics Technologies Partner for Innovative Meta Lens Products",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Asia Optical  signed a memorandum of understanding with Singapore-based MetaOptics Technologies to collaborate on various initiatives involving innovative Meta Lens products. </p><p class=\"\">The partnership combines high-tech innovation with mass production capacity, according to a Wednesday Taiwan Exchange filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463925:0/",
            "pub_date": "2025-02-05 17:45:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002855:0",
            "title": "Credit Agricole Lifts Dividend After Hitting Growth Target a Year Early — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Pierre Bertrand</p><p class=\"\">Credit Agricole raised its dividend after exceeding its medium-term growth target a year ahead of schedule.</p><p class=\"\">The French lender said underlying profit last year surged to 7.17 billion euros ($7.44 billion) as it beat the financial targets it had set out for 2025 at its investor day in 2022. Credit Agricole targeted reaching more than 6 billion euros in underlying profit this year.</p><p class=\"\">The full-year result was helped by a fourth-quarter performance that beat analysts' expectations. Net profit rose to 1.69 billion euros  from 1.33 billion euros a year prior on revenue that surged 17% to 7.09 billion euros. Analysts had expected net profit of 1.36 billion euros on 6.58 billion euros of revenue, according to Visible Alpha consensus.</p><p class=\"\">The bank said it would propose a dividend of 1.10 euros a share for the year, a 5% increase from 2023.</p><p class=\"\">Credit Agricole said its results reflected the performance of its retail-banking and consumer-finance activities. Home-loan activity in France rose 18%, while its insurance business posted record premium income for the fourth quarter, it said.</p><p class=\"\">Revenue at its corporate and investment banking business rose 7.7% to its highest ever fourth-quarter level.</p><p class=\"\">Assets under management at the bank's asset gathering division rose 2.1% in the quarter, driven by strong net inflows. Managed assets by Credit Agricole's Amundi reached a new record of 2.24 billion euros at the end of December, after more than 20.5 billion euros in net inflows in the quarter, the highest since 2021.</p><p class=\"\">Credit Agricole said its underlying cost-income ratio for 2024 improved by 1 percentage point to 54.4%.</p><p class=\"\">Its common Tier 1 equity ratio--a measure of balance-sheet strength--stood at 11.7% at the end of 2024.</p><p class=\"\">Write to Pierre Bertrand at pierre.bertrand@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002855:0-credit-agricole-lifts-dividend-after-hitting-growth-target-a-year-early-update/",
            "pub_date": "2025-02-05 17:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:ded7be68c094b:0",
            "title": "Accumulate Nestle India; target of Rs 2448: KR Choksey",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KR Choksey's research report on Nestle India</p><p class=\"\">For Q3FY25, NEST’s revenue increased 3.9% YoY (-6.4% QoQ) to INR 47,797 Mn, largely in line with our estimates by (-1.2%). EBITDA decreased 2.2% YoY (-7.1% QoQ) to INR 10,846 Mn, missed our estimates mainly due to higher-than-expected operating expenses. EBITDA margin contracted 143 bps YoY (-19 bps QoQ) to 22.7%. Adj. net profit decreased 11.5% YoY (-4.0% QoQ) to INR 6,877 Mn, missing our estimates mainly due to the cascading effect of lower EBITDA and higher than expected depreciation expenses. We lower our FY26E/FY27E EPS by 2.0%/2.0%, respectively, on the back of weaker-than-expected Q3FY25 performance and urban slowdown risks. However, long-term growth remains strong, supported by innovation, premiumization, capacity expansion, and ecommerce momentum. We expect Revenue/EBITDA/Adj. PAT to grow at a CAGR of 8.5%/8.7%/7.3%, respectively, over CY23-FY27E. The stock is currently trading at 60.6x/59.2x to our Adj.</p><p class=\"\">Outlook</p><p class=\"\">EPS estimate for FY26E/FY27E, respectively. We roll over our valuation to FY27E, assigning a P/E multiple of 63x on FY27E EPS of INR 38.9 (previously: 39.6), resulting in a target price of INR 2,448 (previously: 2,524). Subsequently, we maintain our ‘ACCUMULATE’ rating on the shares of Nestle India Ltd.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">Nestle India - 05022025 - kr</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:ded7be68c094b:0-accumulate-nestle-india-target-of-rs-2448-kr-choksey/",
            "pub_date": "2025-02-05 17:36:32",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002617_20250205002860:0",
            "title": "Santander Chair: Bank Is Very Committed to the U.K.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002617_20250205002860:0/",
            "pub_date": "2025-02-05 17:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:9e62c05da094b:0",
            "title": "Bitdeer snaps up 101-megawatt Canada site as stock tanks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bitdeer has acquired a 101-megawatt site and gas-fired power project in Alberta, Canada, aiming to become a fully vertically integrated Bitcoin miner.</p><p class=\"\">A fully vertically integrated miner would mean Bitdeer maintains control of the important components of its Bitcoin (BTC) mining operations rather than relying on third parties for infrastructure services.</p><p class=\"\">The crypto mining firm said the deal gives it control over land, power generation, electrical and data center infrastructure, as well as its Sealminer A3 mining rigs. </p><p class=\"\">“It marks a significant step in our strategy to become the first fully vertically integrated Bitcoin miner, giving us unmatched control over costs, energy efficiency, and scalability,” Haris Basit, chief strategy officer at Bitdeer, said in a news release.</p><p class=\"\">Bitdeer is a crypto cloud mining firm out of Singapore with bases across multiple jurisdictions, including the US. It entered the Nasdaq exchange through a backdoor listing in April 2023 after completing a $1.18 billion merger with blank check firm Blue Safari Acquisition.</p><p class=\"\">Despite its expanding global footprint and Canada site acquisition, its stock has continued to struggle. Its shares have plunged 27.5% over the past month, including a 4.95% drop on Feb. 4, bucking the broader US market rally on the day. The three major indexes closed in the green, and rival crypto mining-related stocks, including CleanSpark, Riot Platforms and Terawulf, all posted gains.</p><p class=\"\">Meanwhile, investor sentiment is turning increasingly bearish. Short interest in Bitdeer surged from under 10 million shares in late November to 13.7 million by Jan. 15, while average daily trading volume has continued to decline.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:531.0285220397581px;max-width:1200px;aspect-ratio:2.259765625\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:9e62c05da094b-cb530855dd9de11407da8c020e347e44-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:9e62c05da094b-cb530855dd9de11407da8c020e347e44-resized.jpeg\" style=\"background-color:#f2f2f4\"/></picture></div></figure></span></p><p class=\"\">Bitcoin mining competition is expected to cool due to slower mining hardware rollouts. Bitcoin mining difficulty fell to 108.1 trillion on Jan. 27, marking the first reduction of 2025. </p><p class=\"\">In 2024, Bitcoin miners faced a 50% pay cut due to the quadrennial halving, which reduced Bitcoin rewards for verifying transactions from 6.25 BTC to 3.125 BTC per block. Some mining firms, including Bitdeer, have diversified into other industries, such as AI. Bitdeer reported $2.8 million in gross profit in the third quarter of 2024, down from $21.1 million from the year before.</p><p class=\"\">More recently, mining stocks declined alongside the AI industry after DeepSeek, a Chinese artificial intelligence model that performs on par with OpenAI, exploded to the top of Apple’s App Store. It claimed it could operate at significantly lower costs than its rivals. The development challenged assumptions about AI development costs and hardware reliance, impacting investor sentiment in both sectors.</p><p class=\"\">Magazine: Pectra hard fork explained — Will it get Ethereum back on track? </p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:9e62c05da094b:0-bitdeer-snaps-up-101-megawatt-canada-site-as-stock-tanks/",
            "pub_date": "2025-02-05 17:37:05",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309546:0",
            "title": "Toyota Motor's Fiscal Q3 Operating Profit Fall, Revenue Rises; Raises Fiscal 2025 Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor  reported fiscal Q3 operating profit Wednesday of 1.215 trillion Japanese yen ($79.49 billion), down from 1.681 trillion yen a year earlier. </p><p class=\"\">Analysts polled by FactSet expected 1.43 trillion yen. </p><p class=\"\">Revenue for the quarter ended Dec. 10 was 12.391 trillion yen compared with $12.041 trillion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected 11.95 trillion yen. </p><p class=\"\">The company raised its operating profit guidance for fiscal 2025 to 4.7 trillion yen compared with 4.3 trillion yen previously. Analysts surveyed by FactSet expect 4.84 trillion yen. </p><p class=\"\">The company also increased revenue guidance for the year to 47 trillion yen from 46 trillion yen. Analysts polled by FactSet expect 47.15 trillion yen.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309546:0/",
            "pub_date": "2025-02-05 17:37:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309547:0",
            "title": "Novo Nordisk Q4 Earnings, Sales Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Novo Nordisk  reported Wednesday Q4 earnings of 6.34 Danish kroner ($0.88) per diluted share, up from 4.91 kroner a year earlier. </p><p class=\"\">Analysts polled by FactSet expected 5.96 kroner. </p><p class=\"\">Sales for the quarter ended Dec. 31 were 85.68 billion kroner, up from 65.86 billion kroner a year earlier. </p><p class=\"\">Analysts polled by FactSet expected 80.7 billion kroner. </p><p class=\"\">For 2025, the company expects sales growth at constant exchange rates of 16% to 24%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309547:0/",
            "pub_date": "2025-02-05 17:38:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446719:0",
            "title": "German 10-Year Bund Yield Falls to 1-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Germany’s 10-year Bund yield fell to 2.36%, its lowest in about a month, as concerns grew that US tariffs could lead to deflationary pressures, prompting the European Central Bank (ECB) to potentially ease monetary policy further.</p><p class=\"\">As a result, money markets revised their expectations for the ECB’s deposit rate, lowering it to 1.87% by December.</p><p class=\"\">In economic news, Eurozone inflation rose to 2.5% in January, surpassing expectations, while core inflation remained steady at 2.7%.</p><p class=\"\">This signals persistent price pressures, although economic weakness in Germany and France raises speculation that the ECB may cut rates further.</p><p class=\"\">Meanwhile, China retaliated against US tariffs by imposing additional tariffs on US imports, escalating tensions after President Trump’s 10% tariff on Chinese goods.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446719:0-german-10-year-bund-yield-falls-to-1-month-low/",
            "pub_date": "2025-02-05 17:38:56",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEEmxYDSa:0",
            "title": "Slovenia's Cinkarna Celje 2024 net profit soars 80%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LJUBLJANA (Slovenia), February 5 (SeeNews) - Slovenian chemicals producer Cinkarna Celje [LJE:CICG] said on Wednesday its net profit surged to 22.8 million euro ($23.7 million) in 2024, up from 12.7 million euro in 2023.</p><p class=\"\">Sales rose by 13% to 200.3 million euro, driven by bigger volumes and higher prices of titanium dioxide pigment, Cinkarna Celje said in its preliminary financial report.</p><p class=\"\">The company’s sales within the European Union climbed 21% to 162.2 million euro.</p><p class=\"\">Earnings before interest, tax, depreciation and amortisation (EBITDA) rose 57% on the year to 39.3 million euro in 2024.</p><p class=\"\">Cinkarna Celje was set up in 1873. Its core business is production and marketing of titanium dioxide pigment. Its shares traded 2.52% higher at 28.50 euro on Wednesday morning on the Ljubljana bourse.</p><p class=\"\">($ = 0.961 euro)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEEmxYDSa:0-slovenia-s-cinkarna-celje-2024-net-profit-soars-80/",
            "pub_date": "2025-02-05 17:39:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0XW:0",
            "title": "India's Nilkamal set for worst day in nearly 10 months on Q3 profit slide",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of India's Nilkamal Ltd  falls 5% after Q3 profit drop </p><p class=\"\">** Co, which sells home products like mattresses and chairs, set for worst session since early-April 2024</p><p class=\"\">** Q3 consol net profit fell 27% to 214.9 mln rupees ($2.5 mln) as a 8% rise in expenses overshadowed 6% rise in rev </p><p class=\"\">** Session's decline takes losses logged so far in 2025 to 10%; in 2024 it shed ~15% </p><p class=\"\">($1 = 87.4230 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0XW:0-india-s-nilkamal-set-for-worst-day-in-nearly-10-months-on-q3-profit-slide/",
            "pub_date": "2025-02-05 17:39:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309534:0",
            "title": "PennyMac Financial Services Prices $850 Million Senior Notes Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PennyMac Financial Services  said late Tuesday it has priced an offering of $850 million of 6.875% senior notes due 2033, up from the initial offering size of $650 million. </p><p class=\"\">The company said the notes will mature on Feb. 15, 2033, with interest payable semi-annually starting this Aug. 15. </p><p class=\"\">Proceeds from the offering, expected to close on Feb. 6, will be used to repay certain debts, including borrowings under secured MSR facilities and a portion of its 5.375% senior notes due October 2025, along with general corporate purposes, the company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309534:0/",
            "pub_date": "2025-02-05 17:39:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463918:0",
            "title": "Singapore Shares Linger in Red as Trump Tariffs Trigger Trade War Fears",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's stock market remained in the red zone on Wednesday as trade tensions between US and China continued, with the latter responding in kind to the former's trade tariffs. </p><p class=\"\">The Straits Times Index (STI), a key benchmark for the Singapore Exchange, ranged between 3,805.46 and 3,840.68 throughout the day. It ended the session at 3,815.37, down 7.64 points or 0.2% compared to Tuesday's close. </p><p class=\"\">In economic news, Singapore's retail sales declined 2.9% in December 2024, following a 0.5% drop in November, according to data from the Department of Statistics. </p><p class=\"\">Meanwhile, S&amp;P Global Singapore Purchasing Manager's Index or PMI, a composite single figure indicator of performance, dipped under the 50.0 no-change mark during January, according to figures released by S&amp;P Global. PMI was 49.9, down from 51.5 in December 2024. </p><p class=\"\">In company news, shares of Sunpower  were up nearly 9% after it received an approval in principle from the Singapore Exchange Securities Trading for the listing and quotation of up to SG$99.6 million worth of 7% bonds. </p><p class=\"\">Frasers Logistics &amp; Commercial Trust  was up over 1% after the trust reported an occupancy rate of 94.3% for the fiscal first quarter ended Dec. 31, 2024. </p><p class=\"\">MTQ  was up over 2% at the close after it bought back 50,800 shares in the open market for SG$12,734 or SG$0.25 apiece.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463918:0-singapore-shares-linger-in-red-as-trump-tariffs-trigger-trade-war-fears/",
            "pub_date": "2025-02-05 17:39:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002617_20250205002872:0",
            "title": "Santander Chair Expects Profitability Improvements at U.K. Business",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002617_20250205002872:0/",
            "pub_date": "2025-02-05 17:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr23Jc7k:0",
            "title": "Half of the participants now dosed in Dicot Pharma's Phase 2a study",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Dicot Pharma AB<p class=\"\">Uppsala, Sweden, February 5, 2025. The recruitment rate in the potency drug developer Dicot Pharma's ongoing phase 2a study is high and in alignment with the planned timeline, where the study is expected to be reported in mid-2025. Today, half of the 140 participants have been dosed.</p><p class=\"\">Today, Dicot Pharma announces that the recruitment of participants for the company’s clinical phase 2a study is advancing at a steady rate, and that half of the planned 140 participants have now been dosed.</p><p class=\"\">“We set an ambitious recruitment plan, and thanks to the efficient work of our clinical partners and high level of interest in participating in the study, we have managed to maintain a high recruitment rate,” says Charlotta Gauffin, CSO at Dicot Pharma.</p><p class=\"\">All participating men have erectile dysfunction and have been in a stable relationship for at least six months. To evaluate the effect of LIB-01 on erectile function, they respond to questions from the standardized questionnaire International Index of Erectile Function. In addition, participants continuously fill out a form of diary after each sexual intercourse.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the phase 2a study</strong></p><p class=\"\">The purpose of the Phase 2a study is to evaluate the efficacy of LIB-01 in men with erectile dysfunction. The study is expected to include 140 participants and is being conducted at six clinics in Sweden (Uppsala, Stockholm, Gothenburg and Linköping), Denmark (Herlev) and the Netherlands (Groningen). Each person will participate in the study for eight weeks after dosing. The trial is double blind and placebo controlled. This means that neither the clinical staff administering the study drug, nor the participants, know which research subjects are receiving LIB-01 and which are receiving placebo. The clinical part of the study is expected to last until mid-2025. This will be followed by a statistical analysis before the results can be reported.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Elin Trampe, CEO</p><p class=\"\">Phone: +46 72 502 10 10</p><p class=\"\">E-mail: elin.trampe@dicotpharma.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Dicot Pharma AB</strong></p><p class=\"\">Dicot Pharma is developing the drug candidate LIB-01, which will be a potency agent to better treat erectile dysfunction and premature ejaculation. The ambition is to create a drug with significantly longer effect and far fewer side effects, compared to current available drugs. Today, over 500 million men suffer from these sexual dysfunctions and the market is valued at USD 8 billion. Dicot Pharma's strategy is to develop LIB-01 under own auspices until phase 2a study and thereafter in partnership with larger, established pharmaceutical companies, finance and develop LIB-01 further to a registered pharmaceutical on the world market.</p><p class=\"\">Dicot Pharma is listed on Nasdaq First North and has approximately 8,100 shareholders. FNCA Sweden AB is appointed Certified Adviser. For more information, please visit www.dicotpharma.com.</p><p class=\"\">This is a translation from the Swedish original. In case of differences between versions, the Swedish version prevails.</p><p class=\"\">https://news.cision.com/dicot-pharma-ab/r/half-of-the-participants-now-dosed-in-dicot-pharma-s-phase-2a-study%2Cc4085757</p><p class=\"\">Half of the participants now dosed in Dicot Pharma's Phase 2a study</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr23Jc7k:0-half-of-the-participants-now-dosed-in-dicot-pharma-s-phase-2a-study/",
            "pub_date": "2025-02-05 17:40:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0ZH:0",
            "title": "Demant falls as 2025 margin outlook disappoints",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Demant  fall 5.6% as the Danish hearing aid maker's 2025 forecast implies a cautious margin view</p><p class=\"\">** Demant sees 2025 EBIT at DKK 4.5-4.9 billion, which Jefferies analysts say translates into margin of 18.9% to 19.9%</p><p class=\"\">** \"Cautious 2025 margin outlook may disappoint,\" Jefferies says, noting consensus for the metric stands at 19.9%</p><p class=\"\">** Jefferies also sees \"unexciting 2025 prospects\" with no new product launches from the company</p><p class=\"\">** Demant posted Q4 sales of DKK 5.93 billion ($827.57 million), broadly in line with a consensus of DKK 5.94 billion</p><p class=\"\">** The stock is among the worst performers on the pan-European STOXX 600 index  and on track for its worst day since July if the losses hold</p><p class=\"\">($1 = 7.1656 Danish crowns)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0ZH:0-demant-falls-as-2025-margin-outlook-disappoints/",
            "pub_date": "2025-02-05 17:31:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002824:0",
            "title": "Singapore Shares Edge 0.2% Lower Amid Lingering Tariff Concerns — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's FTSE Straits Times Index edged 0.2% lower to close at 3815.37, erasing earlier gains amid lingering concerns over U.S. tariffs. \"The proverbial tariff can has just been kicked down the road, with the idea of imposing levies on U.S. imports from its two closest neighbors still not off the table entirely,\" says Michael Brown, senior research strategist at Pepperstone, in an email. Among the worst performers on Singapore's benchmark index, Genting Singapore fell 2.0%, Jardine Matheson Holdings lost 1.4% and SATS Ltd. was down 1.2%. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002824:0/",
            "pub_date": "2025-02-05 17:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002821:0",
            "title": "Nidec Announces Its Submission of Answers to the Questionnaire from Makino Milling Machine Co., Ltd.(Securities Code: 6135)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nidec Announces Its Submission of Answers to the Questionnaire from Makino Milling Machine Co., Ltd.(Securities Code: 6135)</p><p class=\"\">KYOTO, Japan--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Nidec Corporation (TOKYO: 6594) (OTC US: NJDCY) (\"Nidec\" or the \"Company\") announced that it submitted answers to Makino Milling Machine Co., Ltd. (listed on Tokyo Stock Exchange Inc.'s Prime Market) (the \"Target Company\") in response to the questionnaire, a document dated January 28, 2025 that Nidec received from the Target Company.</p><p class=\"\">As explained in the press release, \"Notice Regarding Scheduled Commencement of Tender Offer for Makino Milling Machine Co., Ltd. (Securities Code: 6135),\" dated December 27, 2024, Nidec Corporation, as part of a series of transactions (the \"Transaction\") for the purpose of making Makino Milling Machine Co., Ltd. a wholly owned subsidiary of the Company, decided to acquire the shares of common stock of the Target Company through a tender offer, and on the same day submitted to it a letter of intent regarding the Transaction.</p><p class=\"\">The Company intends to continue to provide the Target Company with information that it needs to disclose its opinions regarding the Transaction, in a sincere, timely, and appropriate manner.</p><p class=\"\">The answers to the questionnaire:</p><p class=\"\">https://www.nidec.com/en/corporate/news/2025/news0131-01/</p><p class=\"\">[Restrictions on solicitation] This press release is intended to announce the <br/>Tender Offer to the public and has not been prepared for the purpose of <br/>soliciting an offer to sell shares. If shareholders wish to make an offer to <br/>sell their shares, they should first read the Tender Offer Explanation <br/>Statement concerning the Tender Offer and make an offer to sell their shares <br/>at their own discretion. This press release shall neither be, nor constitute a <br/>part of, an offer to sell or purchase, or solicitation to sell or purchase, <br/>any securities, and neither this press release (or a part of this press <br/>release) nor its distribution shall be interpreted to constitute the basis of <br/>any agreement in relation to the Tender Offer, and this press release may not <br/>be relied upon at the time of entering into any such agreement. [Future <br/>Forecasts] This press release may contain forward-looking statements, <br/>including those related to the future business of Nidec Corporation (the <br/>\"Tender Offeror\" or the \"Offeror\") and other companies, such as \"anticipate,\" <br/>\"expect,\" \"intend,\" \"plan,\" \"believe,\" and \"assume.\" Such statements are based <br/>on the Tender Offeror's current business prospects and may change as a result <br/>of future developments. The Tender Offeror is under no obligation to update <br/>any forward-looking statements in this information to reflect actual business <br/>performance or changes in various circumstances or conditions. This press <br/>release contains \"forward-looking statements\" as defined in Section 27A of the <br/>U.S. Securities Act of 1933 (as amended) and Section 21E of the Securities <br/>Exchange Act. The actual results may be grossly different from the projections <br/>implied or expressly stated as \"forward-looking statements\" due to known or <br/>unknown risks, uncertainties or other factors. None of the Offeror or its <br/>affiliates assures that such express or implied projections set forth herein <br/>as \"forward-looking statements\" will eventually prove to be correct. <br/>\"Forward-looking statements\" contained herein were prepared based on the <br/>information available to the Tender Offeror as of the date of this press <br/>release and, unless required by laws and regulations, neither Tender Offeror <br/>nor its related parties including related companies shall have the obligation <br/>to update or correct the statements made herein in order to reflect the future <br/>events or circumstances. [U.S. Regulations] The Tender Offer shall be <br/>implemented in compliance with the procedures and information disclosure <br/>standards provided by the Financial Instruments and Exchange Act of Japan, <br/>which procedures and standards are not necessarily identical to the procedures <br/>and information disclosure standards applied in the United States. <br/>Specifically, Section 13(e) or Section 14(d) of the U.S. Securities Exchange <br/>Act of 1934 (as amended; \"Securities Exchange Act\") or the rules promulgated <br/>under such Sections do not apply to the Tender Offer, and the Tender Offer is <br/>not necessarily in compliance with the procedures and standards thereunder. It <br/>is not necessarily the case that all financial information in this press <br/>release is equivalent to financial statements of companies in the United <br/>States. It may be difficult to enforce any right or claim arising under U.S. <br/>federal securities laws because the Offeror and Makino Milling Machine Co., <br/>Ltd. (\"the Target\") are incorporated outside the United States and their <br/>directors are non-U.S. residents. Shareholders may not be able to sue a <br/>company outside the United States and its directors in a non-U.S. court for <br/>violations of the U.S. securities laws. Furthermore, there is no guarantee <br/>that shareholders will be able to compel a company outside the United States <br/>or its subsidiaries and affiliates to subject themselves to the jurisdiction <br/>of a U.S. court. The financial advisors of the Offeror or Target and their <br/>respective affiliates may, within their ordinary course of business, purchase, <br/>or conduct any act toward the purchase of, the shares of the common stock of <br/>the Target for their own account or for their customers' accounts outside the <br/>Tender Offer prior to the commencement of, or during, the period of the Tender <br/>Offer, etc. in accordance with the requirements of Rule 14e-5(b) under the <br/>Securities Exchange Act to the extent permissible under the financial <br/>instruments and exchange laws and other applicable laws and regulations in <br/>Japan. If any information concerning such purchase is disclosed in Japan, the <br/>disclosure of such information will be made in the United States in a similar <br/>manner. All the procedures in connection with the Tender Offer shall be taken <br/>in the Japanese language. While a part or all of the documents in connection <br/>with the Tender Offer may be prepared in English, the Japanese documents shall <br/>prevail in case of any discrepancies between Japanese documents and <br/>corresponding English documents. [Other Countries] Some countries or regions <br/>may impose restrictions on the announcement, issue or distribution of this <br/>press release. In such cases, please take note of such restrictions and comply <br/>with them. In countries or regions where the implementation of the Tender <br/>Offer is illegal, even upon receiving this press release, such receipt shall <br/>not constitute a solicitation of an offer to sell or an offer to buy shares <br/>relating to the Tender Offer and shall be deemed a distribution of materials <br/>for informative purposes only. <br/>------------------------------------------------------------------------------</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205311157/en/</p><p class=\"\">CONTACT:    Teruaki Urago</p><p class=\"\">General Manager</p><p class=\"\">Investor Relations</p><p class=\"\">+81-75-935-6140</p><p class=\"\">ir@nidec.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002821:0/",
            "pub_date": "2025-02-05 17:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002825:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0932 GMT - Singapore's FTSE Straits Times Index edged 0.2% lower to close at 3815.37, erasing earlier gains amid lingering concerns over U.S. tariffs. \"The proverbial tariff can has just been kicked down the road, with the idea of imposing levies on U.S. imports from its two closest neighbors still not off the table entirely,\" says Michael Brown, senior research strategist at Pepperstone, in an email. Among the worst performers on Singapore's benchmark index, Genting Singapore fell 2.0%, Jardine Matheson Holdings lost 1.4% and SATS Ltd. was down 1.2%. (ronnie.harui@wsj.com)</p><p class=\"\">0919 GMT - TotalEnergies' integrated LNG division meant its fourth-quarter adjusted earnings beat consensus expectations, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. The French oil-and-gas company's other divisions were all broadly in line with expectations, they add. Given TotalEnergies hosted its capital markets day in October, is isn't surprising that it didn't outline any major changes to guidance, the analysts write. TotalEnergies shares rise 1% to 57.56 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0912 GMT - The U.K. FTSE 100 index could rise to a new all-time high if the Bank of England signals additional future interest-rate cuts during Thursday's rate decision, Capital.com's Daniela Sabin Hathorn says in a note. \"A BOE rate cut could renew investor interest in U.K. stocks,\" she says. The FTSE 100 reached a new high of 8692.84 on Jan. 31. Any hints of more interest-rate cuts could reignite a U.K. equities rally, Hathorn says. (miriam.mukuru@wsj.com)</p><p class=\"\">0910 GMT - Malaysia's benchmark Kuala Lumpur Composite Index ended 0.6% higher at 1574.51 amid bargain hunting. However, continuing concerns about rising U.S.-China trade tensions, fueled by the latest round of tit-for-tat tariffs, could limit further upside in the local benchmark's rebound, TA Securities analyst Stephen Soo says in a note. The KLCI could find support at 1550 and face resistance at 1605, he adds. Among gainers, Gamuda added 4.8% and YTL Power International rose 4.3%. Meanwhile, QL Resources lost 1.1% and SD Guthrie was 0.6% lower. (yingxian.wong@wsj.com)</p><p class=\"\">0859 GMT - The Polish zloty trades steady ahead of the National Bank of Poland's policy decision later. The central bank is widely expected to leave interest rates unchanged. This means the decision will be a \"non-event\" with the focus on any signals about future policy, ING analyst Frantisek Taborsky says in a note. The policy statement Wednesday and NBP Governor Adam Glapinski's press conference Thursday could both sound hawkish again by indicating rates will remain restrictive, Taborsky says. \"However, it's hard to imagine at this point what more the governor might add to the hawkish message from January.\" The NBP's decision is expected at 1400 GMT. EUR/PLN trades at 4.2112. (renae.dyer@wsj.com)</p><p class=\"\">0851 GMT - Hong Kong's Hang Seng Index fell 0.9% to close at 20597.09, weighed by consumer stocks. U.S.-China tariff developments remained in focus as the U.S. Postal Service said it will pause parcels from China and Hong Kong. Analysts say markets are waiting for the U.S. and China to hold talks on a deal to prevent the trade fight from escalating. Nongfu Spring dropped 6.9%, Trip.com Group lost 6.4% and China Mengniu Diary fell 4.6%. Among advancers, Lenovo Group rose 4.0%, while Orient Overseas (International) and Zhongsheng Group gained 3.1% each. (kimberley.kao@wsj.com)</p><p class=\"\">0850 GMT - Pandora's results are broadly mixed, with 4Q performance in line with expectations but guidance softer than anticipated, RBC Capital Markets analyst Piral Dadhania says in a note. The Danish jeweler reported revenue of 11.97 billion Danish kroner ($1.67 billion) for the final quarter of 2024, up 11% organically on year. Analysts had forecast revenue of 11.85 billion kroner, according to company-compiled consensus. However, the group's guidance of organic revenue growth between 7% and 8% in 2025 is slightly softer than expected, which could prompt low-single-digit earnings revisions, the analyst says. The company expects the EBIT margin target by 2026 at the lower end of the 26% to 27% range, which will likely be received with some caution, Dadhania says. Shares are down 1.3% at 1,356.50 kroner. (andrea.figueras@wsj.com)</p><p class=\"\">0847 GMT - Novo Nordisk's 2025 outlook is reassuring, says Sheena Berry at Quilter Cheviot. The Danish pharmaceutical company expects a robust 16%-24% sales growth for the year, Berry says. Fourth-quarter sales rose 30%, outpacing expectations, although this was partly driven by insulin rebate adjustments, she notes. The performance of key growth drivers, Ozempic and Wegovy, remains strong, with Ozempic meeting expectations and Wegovy slightly underperforming. Novo Nordisk is set to initiate a new CagriSema Phase 3 trial in 2025 and plans to file with regulators in the first quarter of 2026, a slight delay to ensure a secure supply chain. Shares trade 4.5% higher at 619 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0845 GMT - DCC's process to sell its healthcare segment, in order to focus on the energy sector, could significantly boost returns to shareholders, Davy Research analyst Colin Grant says. The Irish research firm forecasts that DCC could receive 1.365 billion pounds for the division. This is more than 15 times the FY 2025 Ebitda expectations of 88 million pounds, the analyst adds in a note. Assuming that most of the cash will be returned to shareholders, this means that the disposal will unlock significant value as the deal could be far ahead of DCC's current valuation, Grant adds. DCC said in its third-quarter update that the disposal is progressing in line with expectations, the analyst says. Shares are down 2.4% at 53.65 pounds. (michael.susin@wsj.com)</p><p class=\"\">0838 GMT - Novo Nordisk's initial 2025 outlook is just ahead of Jefferies's expectations. But given a higher starting point and stronger currency effects it suggests up to 6% sales and 10% EBIT consensus upgrades, analysts at the bank write. Novo Nordisk's fourth-quarter sales beat expectations by 5%, mostly on positive U.S. gross-to-net adjustments--the discount offered between the list price and the actual net sales price--for its insulins. Sales of Wegovy were shy of expectations while Ozempic and Rybelsus were in line. A better gross margin, higher research and development costs but less selling and distribution spend helped EBIT beat by 9% and EPS by 6%. The stock will likely tick higher initially but could then fade, Jefferies says. Shares trade 4.2% higher at 617.20 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0837 GMT - GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p><p class=\"\">0834 GMT - The cancellation of the \"de minimis\" rule, which allowed low-value shipments to bypass duties and custom scrutiny, as well as the subsequent suspension of Chinese goods shipments by the U.S. Postal Services, should be manageable for PDD Holdings' Temu, says Nomura analyst Jialong Shi tells Dow Jones Newswires. Temu has been preparing for this change in the past year, Shi notes, pointing to the company introducing a half consignment model in early 2024. Under this model, merchants typically ship products to the U.S. in bulk rather than relying on the so-called \"de minimis\" exemption, which was recently revoked by President Trump, Shi notes. While Temu still has significant growth potential in the U.S. market at this stage, uncertainties remain over whether the U.S. government will introduce new regulations to these Chinese companies, he says. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002825:0/",
            "pub_date": "2025-02-05 17:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}