{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309224:0",
            "title": "Sector Update: Financial Stocks Mixed Late Afternoon",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Financial stocks were mixed in late Tuesday afternoon trading with the NYSE Financial Index up 0.2% and the Financial Select Sector SPDR Fund (XLF) easing 0.2%. </p><p class=\"\">The Philadelphia Housing Index gained 0.9%, and the Real Estate Select Sector SPDR Fund (XLRE) fell 0.1%. </p><p class=\"\">Bitcoin (BTC/USD) declined 2.8% to $98,543, and the yield of 10-year US Treasuries dropped 3 basis points to 4.51%. </p><p class=\"\">In economic news, China imposed retaliatory measures on Tuesday after President Donald Trump announced a 10% tariff on Chinese goods over the weekend. </p><p class=\"\">US job openings fell to 7.6 million in December, according to the Bureau of Labor Statistics, lower than the 8 million expected in a Bloomberg survey. </p><p class=\"\">In corporate news, a group of banks led by Morgan Stanley  is prepared to boost a sale of loans tied to social media platform X after receiving stronger-than-expected demand from investors, Bloomberg reported. Morgan Stanley shares fell 0.4%. </p><p class=\"\">Coinbase  is requesting US banking regulators to amend or clarify their positions to permit banks to offer custody and trading execution services for cryptocurrencies and allow them to partner with the company, media reports said Tuesday, citing a letter the company sent to the Office of the Comptroller of the Currency, the Federal Reserve and the Federal Deposit Insurance Corp. Coinbase shares were down 1.5%. </p><p class=\"\">Robinhood  said Tuesday it is suspending the rollout of the Pro Football Championship market after its Robinhood Derivatives unit was requested by the Commodity Futures Trading Commission to \"not permit customers to access\" sports event contracts. Robinhood shares added 1.4%. </p><p class=\"\">PayPal  issued a strong bottom-line outlook as Q4 earnings unexpectedly rose, though its Q1 revenue guidance implied a sequential deceleration. Its shares fell past 12%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309224:0-sector-update-financial-stocks-mixed-late-afternoon/",
            "pub_date": "2025-02-05 04:32:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309225:0",
            "title": "Valero Energy Shares Rise After Tudor Pickering Holt Upgrade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Valero Energy  shares rose 4.4% in recent Tuesday trading after Tudor Pickering Holt upgraded its rating on the stock to buy from hold and boosted its price target to $144 from $130. </p><p class=\"\">Intraday volume topped 2.78 million shares versus the daily average of almost 2.81 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309225:0/",
            "pub_date": "2025-02-05 04:33:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV15K:0",
            "title": "Third Point's Loeb expects favorable stock investment environment, letter says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Billionaire investor Daniel Loeb is betting 2025 will bring a more favorable stock investing environment despite the Trump administration's \"unconventional\" approach to announcing and enacting new policies.</p><p class=\"\">Loeb's hedge fund Third Point is already reaping the benefits, he told clients in a quarterly letter seen by Reuters on Tuesday, with the firm's flagship TP offshore fund up 3.3% in January after finishing last year up 24.2%.</p><p class=\"\">Third Point follows a variety of strategies ranging from stock picking to activist campaigns and credit investments and ranks among Wall Street's most closely watched hedge funds.</p><p class=\"\">Last year, for example, Loeb said the firm rotated into consumer discretionary, financial and industrial companies that helped fuel returns after in a post-election rally.</p><p class=\"\">After the Trump administration imposed tariffs on Canada, Mexico and China, called for a Wealth Fund and signed dozens of executive orders all in the first two weeks in office, Loeb said emotions need to be eliminated to make good investments.</p><p class=\"\">Certain sectors will benefit from the new policies, and he expects to see an uptick in \"M&amp;A and other corporate activity which feeds our event-driven framework.\"</p><p class=\"\">Among stocks, Third Point made a new investment in Siemens Energy , which makes gas turbines, electrical grid equipment and wind turbines, late in the third quarter of 2024. Demand for more power from data centers or the electrification of transport will increase the demand for grid equipment and gas turbines and help fuel demand for Siemens Energy's core business.</p><p class=\"\">As Third Point puts more focus on credit investments, Loeb also pointed to liability management exercises (LMEs), a strategy companies use to restructure  debt and avoid bankruptcy, as the \"most engaging distressed credit opportunities.\" </p><p class=\"\">He said LMEs represent half of the firm's current corporate credit portfolio, or over $700 million. \"We expect this area to be an important source of alpha in the coming months,\" he added.</p><p class=\"\">As M&amp;A activity is expected to pick up this year with fewer regulations and governmental challenges expected, banks will likely sell more consumer and mortgage portfolios, Loeb said.  Third Point will be an opportunistic buyer, hoping to be paid unlevered yields in the high single digits, he said.</p><p class=\"\">       As M&amp;A activity is expected to pick up this year with fewer regulations and governmental challenges expected, banks will likely sell more consumer and mortgage portfolios, Loeb said, adding Third Point will be an opportunistic buyer, hoping to be paid unlevered yields in the high single digits.</p><p class=\"\">With Washington expected to be friendly towards M&amp;A this year, banks are likely to sell consumer and mortgage portfolios, Loeb said. He added that Third Point will be an opportunistic buyer, looking for unlevered yields in the high single digits.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV15K:0-third-point-s-loeb-expects-favorable-stock-investment-environment-letter-says/",
            "pub_date": "2025-02-05 04:33:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009975:0",
            "title": "Fed's Daly Is in No Rush to Cut Interest Rates — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Nicholas Jasinski</p><p class=\"\">The Federal Reserve's Mary Daly is in no rush to lower interest rates until inflation is closing in on the central bank's 2% target.</p><p class=\"\">A solid economic backdrop gives the Fed the luxury of time to hold policy where it is until disinflation progress resumes, the San Francisco Fed President said on Tuesday. \"[The economy] came into 2025 in a very good place,\" Daly said at an event hosted by the Commonwealth Club World Affairs of California.</p><p class=\"\">\"Growth is solid, the labor market is solid, and inflation is coming down, albeit gradually, but we're heading toward our 2% target.\"</p><p class=\"\">Daly has led the San Francisco Fed since 2018. She was a voting member of the Federal Open Market Committee, the Fed's policymaking body, in 2024, before rotating off the voting list in 2025. The San Francisco Fed will next get a vote in 2027.</p><p class=\"\">The FOMC held its target for the federal-funds rate at a range of 4.25% to 4.5% at its January meeting. It cut rates by a total of a percentage point at its final three meetings of 2024.</p><p class=\"\">Daly sees the positive economic momentum continuing this year, giving the Fed the ability to let still-restrictive interest rates slow inflation and watch what government policies are enacted.</p><p class=\"\">\"I remind everybody, the world is always full of uncertainty,\" Daly said. \"In my time at the Fed, I've lived through a financial crisis and a pandemic, and those were extraordinarily uncertain times...Uncertainty is not a paralysis. It just means we have to watch and be careful and thoughtful as we navigate the information we have. So that's how I'm approaching 2025 as a monetary policy maker: We can take our time.\"</p><p class=\"\">The primary sources of uncertainty in 2025 include decisions by President Donald Trump's administration, as shown by the on-again, off-again tariff episode among the U.S., Mexico, and Canada over the weekend and on Monday.</p><p class=\"\">While tariffs can have non-economic goals that are outside the areas central banks assess, she said she doesn't see a significant risk to U.S. growth. She will be evaluating the effect of enacted and potential tariffs by their impact on inflation.</p><p class=\"\">\"They're really not that big by economic damage, there's some economic damage,\" Daly said. \"But as much as I hate them, I can't gin myself to say they're terrible.\"</p><p class=\"\">Immigration policies are another potential area of economic disruption, should the U.S. labor force be meaningfully affected, Daly said. Other factors are potential tax reductions and deregulation. The ultimate impact on the economy will depend on the scope, magnitude, and timing of those policies</p><p class=\"\">\"The way we have to think about it as policy makers is to [focus on the] net effect of all of those, and we don't know what it is yet,\" Daly said. \"If you take preemptive action...you can end up making a policy mistake.\"</p><p class=\"\">The FOMC's next meeting is on March 18-19, when officials will have two more months of inflation and jobs data to consider. Futures are pricing in a roughly 85% chance of a continued pause in interest rates.</p><p class=\"\">Market pricing and the FOMC's median projection both call for a total of a half of a percentage point of interest-rate cuts this year.</p><p class=\"\">\"The Fed is in a good position to wait and see,\" Daly said. \"We will get inflation down...and if it takes more than the rest of this year, we'll continue our work.\"</p><p class=\"\">Write to Nicholas Jasinski at nicholas.jasinski@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009975:0/",
            "pub_date": "2025-02-05 04:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309217:0",
            "title": "Olin Shares Down After Downgrade From RBC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Olin  shares were down nearly 1% in recent trading Tuesday after RBC downgraded the company's stock to sector perform from outperform and cut its price target to $30 from $45. </p><p class=\"\">Deutsche Bank also adjusted the company's price target $32 from $35, while maintaining a hold rating. </p><p class=\"\">The company's trading volume stood at about 1.4 million shares against a daily average of roughly 1.7 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309217:0/",
            "pub_date": "2025-02-05 04:34:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1YQ:0",
            "title": "UPDATE 1-Asia Morning Call-Global Markets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Stock Markets</p></td><td></td><td><p class=\"\">Net Chng</p></td><td><p class=\"\">Stock Markets</p></td><td></td><td><p class=\"\">Net Chng</p></td></tr><tr><td><p class=\"\">S&amp;P/ASX 200**</p></td><td><p class=\"\">8374</p></td><td><p class=\"\">-5.4</p></td><td><p class=\"\">NZX 50**</p></td><td><p class=\"\">12905.04</p></td><td><p class=\"\">94.72</p></td></tr><tr><td><p class=\"\">DJIA**</p></td><td><p class=\"\">44564.63</p></td><td><p class=\"\">142.72</p></td><td><p class=\"\">NIKKEI**</p></td><td><p class=\"\">38798.37</p></td><td><p class=\"\">278.28</p></td></tr><tr><td><p class=\"\">Nasdaq**</p></td><td><p class=\"\">19629.042</p></td><td><p class=\"\">237.244</p></td><td><p class=\"\">FTSE**</p></td><td><p class=\"\">8570.77</p></td><td><p class=\"\">-12.79</p></td></tr><tr><td><p class=\"\">S&amp;P 500**</p></td><td><p class=\"\">6036</p></td><td><p class=\"\">41.43</p></td><td><p class=\"\">Hang Seng**</p></td><td><p class=\"\">20789.96</p></td><td><p class=\"\">572.7</p></td></tr><tr><td><p class=\"\">SPI 200 Fut</p></td><td><p class=\"\">8392</p></td><td><p class=\"\">49</p></td><td><p class=\"\">STI**</p></td><td><p class=\"\">3823.01</p></td><td><p class=\"\">-3.46</p></td></tr><tr><td><p class=\"\">SSEC**</p></td><td><p class=\"\">3250.6007</p></td><td><p class=\"\">-2.0257</p></td><td><p class=\"\">KOSPI**</p></td><td><p class=\"\">2481.69</p></td><td><p class=\"\">27.74</p></td></tr></tbody></table></div><p class=\"\"> ----------------------------------------------------------------------------------------</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Bonds</p></td><td></td><td><p class=\"\">Net Chng</p></td><td><p class=\"\">Bonds</p></td><td></td><td><p class=\"\">Net Chng</p></td></tr><tr><td><p class=\"\">JP 10 YR Bond</p></td><td><p class=\"\">1.275</p></td><td><p class=\"\">0.03</p></td><td><p class=\"\">KR 10 YR Bond</p></td><td><p class=\"\">10189.97</p></td><td><p class=\"\">0.779</p></td></tr><tr><td><p class=\"\">AU 10 YR Bond</p></td><td><p class=\"\">92.641</p></td><td><p class=\"\">0.023</p></td><td><p class=\"\">US 10 YR Bond</p></td><td><p class=\"\">97.890625</p></td><td><p class=\"\">0.1875</p></td></tr><tr><td><p class=\"\">NZ 10 YR Bond</p></td><td><p class=\"\">99.24</p></td><td><p class=\"\">-0.161</p></td><td><p class=\"\">US 30 YR Bond</p></td><td><p class=\"\">95.96875</p></td><td><p class=\"\">0.265625</p></td></tr></tbody></table></div><p class=\"\"> ----------------------------------------------------------------------------------------    </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Currencies</p></td><td></td><td><p class=\"\">Net Chng</p></td><td></td><td></td><td><p class=\"\">Net Chng</p></td></tr><tr><td><p class=\"\">SGD US$ </p></td><td><p class=\"\">1.3514</p></td><td><p class=\"\">-0.0076</p></td><td><p class=\"\">KRW US$ </p></td><td><p class=\"\">1452.03</p></td><td><p class=\"\">-6.54</p></td></tr><tr><td><p class=\"\">AUD US$</p></td><td><p class=\"\">0.6258</p></td><td><p class=\"\">0.0032</p></td><td><p class=\"\">NZD US$</p></td><td><p class=\"\">0.5652</p></td><td><p class=\"\">+0.0024</p></td></tr><tr><td><p class=\"\">EUR US$</p></td><td><p class=\"\">1.0383</p></td><td><p class=\"\">0.0039</p></td><td><p class=\"\">Yen US$</p></td><td><p class=\"\">154.27</p></td><td><p class=\"\">-0.48</p></td></tr><tr><td><p class=\"\">THB US$ </p></td><td><p class=\"\">33.66</p></td><td><p class=\"\">-0.18</p></td><td><p class=\"\">PHP US$</p></td><td><p class=\"\">58.000</p></td><td><p class=\"\">-0.485</p></td></tr><tr><td><p class=\"\">IDR US$</p></td><td><p class=\"\">16340</p></td><td><p class=\"\">-90</p></td><td><p class=\"\">INR US$ </p></td><td><p class=\"\">87.0580</p></td><td><p class=\"\">0.098</p></td></tr><tr><td><p class=\"\">MYR US$</p></td><td><p class=\"\">4.4400</p></td><td><p class=\"\">-0.03</p></td><td><p class=\"\">TWD US$ </p></td><td><p class=\"\">32.862</p></td><td><p class=\"\">-0.062</p></td></tr><tr><td><p class=\"\">CNY US$</p></td><td><p class=\"\">7.2507</p></td><td><p class=\"\">0.0067</p></td><td><p class=\"\">HKD US$</p></td><td><p class=\"\">7.7872</p></td><td><p class=\"\">-0.0055</p></td></tr></tbody></table></div><p class=\"\"> ----------------------------------------------------------------------------------------     </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Commodities</p></td><td></td><td><p class=\"\">Net Chng</p></td><td></td><td></td><td><p class=\"\">Net Chng</p></td></tr><tr><td><p class=\"\">Spot Gold</p></td><td><p class=\"\">2843.323</p></td><td><p class=\"\">29.833</p></td><td><p class=\"\">Silver (Lon)</p></td><td><p class=\"\">32.1454</p></td><td><p class=\"\">0.5932</p></td></tr><tr><td><p class=\"\">U.S. Gold Fut</p></td><td><p class=\"\">2874.1</p></td><td><p class=\"\">17</p></td><td><p class=\"\">Brent Crude</p></td><td><p class=\"\">76.38</p></td><td><p class=\"\">-0.49</p></td></tr><tr><td><p class=\"\">Iron Ore</p></td><td><p class=\"\">CNY810.5</p></td><td><p class=\"\">4</p></td><td><p class=\"\">TRJCRB Index</p></td><td><p class=\"\">-</p></td><td><p class=\"\">-</p></td></tr><tr><td><p class=\"\">TOCOM Rubber</p></td><td><p class=\"\">380.3</p></td><td><p class=\"\">-2.4</p></td><td><p class=\"\">LME Copper</p></td><td><p class=\"\">9174</p></td><td><p class=\"\">75</p></td></tr></tbody></table></div><p class=\"\">-----------------------------------------------------------------------------------------  </p><p class=\"\">** indicates closing price </p><p class=\"\">All prices as of 2009 GMT</p><p class=\"\">EQUITIES</p><p class=\"\">GLOBAL - U.S. stocks regained some strength, while gold reached new highs on Tuesday as global trade jitters kept investors guessing.</p><p class=\"\">MSCI's gauge of stocks across the globe <!-- -->EURONEXT:IACWI<!-- --> rose 7.68 points, or 0.89%, to 867.01.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">NEW YORK -  The three major stock indexes climbed on Tuesday, aided by energy stocks, while investors saw reason for optimism for a trade breakthrough between the U.S. and China after President Donald Trump delayed tariffs for Canada and Mexico.</p><p class=\"\">At 2:05 p.m. EST (1905 GMT) the Dow Jones Industrial Average  rose 84.79 points, or 0.19%, to 44,506.70, the S&amp;P 500  gained 36.26 points, or 0.60%, to 6,030.83 and the Nasdaq Composite  gained 224.93 points, or 1.16%, to 19,616.88.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">LONDON - European shares edged higher on Tuesday, as investors shifted their focus to quarterly earnings reports from companies such as UBS, BNP Paribas and Ferrari among others, while caution prevailed about potential U.S. tariffs.</p><p class=\"\">The pan-European STOXX 600 index  closed a choppy session up 0.3%.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">TOKYO - Japan's Nikkei share average rose on Tuesday after U.S. President Donald Trump suspended his threat of steep tariffs on Mexico and Canada, before paring some gains as tit-for-tat levies ensued between the U.S. and China.</p><p class=\"\">The Nikkei  rose as much as 1.8% as investors bought back shares after the benchmark index logged its worst session in four months on Monday.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">SHANGHAI - Chinese stocks listed in Hong Kong surged on Tuesday as investors loaded up on artificial intelligence and electric vehicle shares while shrugging off news of tit-for-tat Sino-U.S. tariffs on each other's goods.</p><p class=\"\">The Hang Seng China Enterprises Index  closed up 3.5% at a fresh three-month high.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">AUSTRALIA - Australian shares were expected to open higher on Wednesday after China took a measured approach in responding to the new U.S. tariffs, with local gold stocks likely gaining after the prices of the safe-haven metal reached an all-time high.    </p><p class=\"\">The local share price index futures (YAPcm1) rose 0.7%, a 26-point premium to the underlying S&amp;P/ASX 200 index  close. The benchmark ended 0.1% lower on Tuesday.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">SEOUL -  South Korean shares rose on Tuesday after U.S. President Donald Trump delayed tariffs on Mexico and Canada for a month. </p><p class=\"\">     The benchmark KOSPI  closed up 27.74 points, or 1.13%, at 2,481.69.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">FOREIGN EXCHANGE</p><p class=\"\">NEW YORK - The U.S. dollar edged lower on Tuesday as President Donald Trump's tariff threats were interpreted more as a negotiating tactic rather than an end goal, a day after he suspended planned measures against Mexico and Canada.</p><p class=\"\">The U.S. dollar index , a measure of the value of the greenback relative to a weighted basket of six major foreign currencies, was down 0.43% at 108.12.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">SHANGHAI -  Mainland China's stocks, bond, foreign exchange and commodity futures markets will be closed from Tuesday, Jan. 28 for the Lunar New Year holiday.</p><p class=\"\">Markets will resume trade on Wednesday, Feb. 5.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">AUSTRALIA - The Australian and New Zealand dollars were trying to find their footing on Tuesday after sudden swings in U.S. tariff policy sent global markets on a wild ride, leaving the outlook clouded by uncertainty.</p><p class=\"\">The Aussie was hanging on at $0.6213 , having dived to a five-year low of $0.6088 at one stage on Monday before rallying all the way back.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">SEOUL - The won weakened, while the benchmark bond yield rose.</p><p class=\"\">The won was quoted at 1,462.9 per dollar on the onshore settlement platform , 0.06% lower than its previous close at 1,462.0.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">TREASURIES</p><p class=\"\">NEW YORK - Long-dated U.S. Treasury yields rose on Tuesday after the Trump administration granted 30-day tariff reprieves to Canada and Mexico, unwinding some of the previous session's safe-haven bid that had pushed rates lower.</p><p class=\"\">The benchmark 10-year yield was last up 1.2 basis points (bps) at 4.555% , after dropping on Monday to its lowest since mid-December.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">LONDON - German bund yields rose on Tuesday, after falling for three days, as investors weighed the impact of U.S. President Donald Trump's paused tariffs on Canada and Mexico and levies on China took effect.</p><p class=\"\">Germany's 10-year bond yield (DE10YT=RR), the benchmark for the euro zone bloc, rose 1 basis point (bps) to 2.395%, after touching a one-month low of 2.359% on Monday.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">TOKYO -  Japanese government bond (JGB) yields rose to multi-year highs on Tuesday alongside U.S. Treasury yields as investors continued to weigh the impact of U.S. tariffs while eyeing the Bank of Japan's rate path outlook.</p><p class=\"\">10-year JGB futures (2JGBv1) fell 0.21 points to 140.54 yen.</p><p class=\"\">For a full report, click on </p><p class=\"\">COMMODITIES</p><p class=\"\">GOLD - Gold prices regained an all-time high on Tuesday, driven by investors seeking the safe-haven asset after China retaliated with tariffs on the U.S. in response to President Donald Trump's tariffs.</p><p class=\"\">Spot gold  gained 1.1% to $2,844.56 per ounce as of 01:40 p.m. ET (1840 GMT), after hitting a record high of $2,845.14 earlier in the session.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">IRON ORE - The Dalian Commodity Exchange and the Shanghai Futures Exchange will be closed from Jan. 28 to Feb. 4 for the week-long Lunar New Year holiday break in China, the bourses said.</p><p class=\"\">Reuters will have no ferrous metals market report IRONORE/ during the period.</p><p class=\"\">The report will resume on Wednesday, Feb 5.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">BASE METALS - Copper prices rose on Tuesday as the United States delayed import tariffs on Mexican and Canadian goods, although worries about trade tensions and global growth risks persisted as the U.S. and China, the world's top two economies, exchanged trade curbs.</p><p class=\"\">Three-month copper  on the London Metal Exchange (LME) rose 0.6% to $9,150 a metric ton by 1721 GMT.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">OIL - U.S. oil prices slipped on Tuesday on tariff drama between Washington and Beijing, then pared losses after an official said President Donald Trump plans to restore his \"maximum pressure\" campaign on Iran in a bid to drive down Iranian oil exports to zero.</p><p class=\"\">Global benchmark Brent crude futures  rose 42 cents, or 0.55%, to $76.38.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">PALM OIL - Malaysian palm oil futures snapped a five-session winning streak to end lower on Tuesday as Chicago soyoil prices tumbled after the U.S. announced that it would delay implementing import tariffs on Mexico and Canada.</p><p class=\"\">The benchmark palm oil contract  for April delivery on the Bursa Malaysia Derivatives Exchange slid 63 ringgit, or 1.44%, to 4,304 ringgit ($969.37) a metric ton at the close.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p><p class=\"\">RUBBER - Japanese rubber futures extended declines to a second session on Tuesday as China announced tit-for-tat levies after U.S. President Donald Trump's tariffs came into effect, reigniting trade war tensions.</p><p class=\"\">The Osaka Exchange (OSE) July rubber contract ,  ended daytime trade 8.3 yen lower, or 2.12%, at 382.7 yen ($2.47) per kg.</p><p class=\"\">For a full report, click on </p><p class=\"\">- - - -</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1YQ:0-update-1-asia-morning-call-global-markets/",
            "pub_date": "2025-02-05 04:34:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1W1:0",
            "title": "WEC Energy quarterly profit jumps as it expands data center service",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    WEC Energy Group  said on Tuesday that its profit more than doubled in the fourth quarter, with the electric utility benefiting from lower operating expenses and higher revenue as it grows its service to data centers like Microsoft .</p><p class=\"\">U.S. power companies like Milwaukee-based WEC Energy are welcoming a rise in electricity demand from the recent proliferation of AI data centers along with the electrification of buildings and industries.</p><p class=\"\">    WEC is planning to supply electricity to a $3.3 billion Microsoft data center campus being developed in southeast Wisconsin, as reports come in that the technology giant is buying up more land in the state.  </p><p class=\"\">Data center power demand in the United States is expected to nearly triple in the next three years and consume as much as 12% of the country's electricity, according to a study by Lawrence Berkeley National Laboratory.</p><p class=\"\">    WEC is planning for 1,800 megawatts of added power demand over the next five years. That plan doesn't include the development of a 1,700-acre Wisconsin data center campus, which was announced this year by Cloverleaf Infrastructure, WEC executives said on a conference call.  </p><p class=\"\">    The site, which was initially expected to amount to 1 gigawatt of capacity, may end up being much larger, WEC executives said.  </p><p class=\"\">    Construction on the site may begin in the fall, but it would likely be between 2028 and 2029 before energy begins to substantially increase to the site, WEC said.  </p><p class=\"\">As data center development ramps up, utilities like WEC are racing to develop power agreements with terms aimed specifically at these new major customers.</p><p class=\"\">    \"We're actively working with very large customers on tariffs,\" WEC CEO Scott Lauber said.  </p><p class=\"\">Residential power use rose 0.5% while electricity consumption by small commercial and industrial customers rose 0.7% in 2024, compared to a decline in 2023.</p><p class=\"\">The utility reported total operating expenses of $1.69 billion in the fourth quarter, a drop from $1.88 billion last year, with sales costs down about 3% to $738.4 million.</p><p class=\"\">Revenue for the fourth quarter rose about 3% to $2.28 billion from a year earlier.</p><p class=\"\">    WEC provides electricity and gas to nearly 4.7 million customers in Wisconsin, Illinois, Michigan and Minnesota.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1W1:0-wec-energy-quarterly-profit-jumps-as-it-expands-data-center-service/",
            "pub_date": "2025-02-05 04:34:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009979_20250204009980:0",
            "title": "Lovesac's Cuts Not Related to Trump's Tariff Hikes, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009979_20250204009980:0/",
            "pub_date": "2025-02-05 04:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009979_20250204009979:0",
            "title": "Lovesac Eliminates 5% of Corporate Jobs, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009979_20250204009979:0/",
            "pub_date": "2025-02-05 04:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009979_20250204009981:0",
            "title": "Lovesac Doesn't Expect China Tariffs to Affect Profitability, Pricing, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009979_20250204009981:0/",
            "pub_date": "2025-02-05 04:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009979:0",
            "title": "Lovesac Cuts 5% of Corporate Workforce, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(20:35 GMT) </strong>*Lovesac Eliminates 5% of Corporate Jobs, CEO Says<br/><strong class=\"root-Tkn6WL2y\">(20:35 GMT) </strong>*Lovesac's Cuts Not Related to Trump's Tariff Hikes, CEO Says<br/><strong class=\"root-Tkn6WL2y\">(20:35 GMT) </strong>*Lovesac Doesn't Expect China Tariffs to Affect Profitability, Pricing, CEO Says<br/><strong class=\"root-Tkn6WL2y\">(20:35 GMT) </strong>Lovesac Cuts 5% of Corporate Workforce, CEO Says</p><p class=\"\">By Sabela Ojea</p><p class=\"\">Lovesac eliminated about 5% of its corporate workers to reduce expenses ahead of what is shaping up to be another challenging year for furniture makers.</p><p class=\"\">Chief Executive Shawn Nelson said the cuts aren't in response to President Donald Trump increasing tariffs on goods made in China, where Lovesac makes some of its products. The move brings the Stamford, Conn., company's corporate headcount down to about 300 employees, Lovesac said, and includes layoffs and redistributing jobs elsewhere in the company.</p><p class=\"\">Lovesac, and many of its U.S. competitors, have shifted their manufacturing operations out of China and into other countries in Southeast Asia such as Indonesia and Vietnam in recent years. Trump's latest tariffs could result in higher prices for home goods and weigh on furniture makers' sales as consumers continue to shy away from big-ticket purchases, further delaying the sector's recovery after the pandemic.</p><p class=\"\">When Trump began raising tariffs on China in 2018, Lovesac made 90% of its products in China. The company has since reduced that rate to between 15% to 19%. Lovesac also makes less than 1% of its products in Mexico, another target of Trump's tariff measures.</p><p class=\"\">\"We're not pursuing any drastic cost-cutting measures, but we're just being very prudent and not adding many new costs as we enter these new frontiers,\" Nelson said.</p><p class=\"\">Lovesac said it aims to reduce its manufacturing in China to 10% to 15% by the end of the year and is considering raising prices to counteract the effects of the tariff.</p><p class=\"\">Nelson said he doesn't expect the imminent 10% tariff hike for China-made goods to have a meaningful effect on the company's earnings, however. He said Lovesac's workforce reduction will allow the company to expand into new categories within the next three years.</p><p class=\"\">Lovesac mostly sells sectional sofas and plans to branch out into couches and chairs, Nelson said.</p><p class=\"\">\"That's a big opportunity for us and we believe that these other categories will be seeing recoveries,\" he said.</p><p class=\"\">Lovesac, also known for its knotted bean bags, had about 2,000 employees total in April 2024, according to its latest proxy filing with the Securities and Exchange Commission.</p><p class=\"\">In December, Lovesac posted a drop in third-quarter sales to $149.9 million and guided for lower earnings and sales for fiscal 2025. The company also guided for sales to grow 7% to 12% and earnings per share to at least double in fiscal 2026, without taking into account any potential new tariffs.</p><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009979:0/",
            "pub_date": "2025-02-05 04:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009978_20250204009978:0",
            "title": "Eunhong (Edward) Min Named StarKist President and CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009978_20250204009978:0/",
            "pub_date": "2025-02-05 04:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSs1mdqa:0",
            "title": "ECM Releases Case Study on Benefits of PCB Stator Electric Motor Design for Data Centers Ahead of AHR Expo 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Adoption of PrintStator CAD and premium performance printed circuit board stator machines can reduce data center energy consumption and costs.</p><p class=\"\">NEEDHAM, MASSACHUSETTS / ACCESS Newswire / February 4, 2025 / US electric motor design software firm ECM PCB Stator Tech shared a new report on the advantages of PCB Stator electric motor design for global data centers.</p><p class=\"\">The case study, \"Optimizing Data Center Efficiency with ECM PCB Stator Motors,\" comes in advance of ECM's exhibit and speaking role at AHR Expo, 2025 — one of the world's largest HVAC events, set for Feb. 10 -12 in Orlando, Florida.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges in Data Center Efficiency</strong></p><p class=\"\">In the case study, ECM highlights the surge in global energy consumption from increased data center demand. \"Data centers consumed 130 TWh of electricity in 2022, accounting for 2.5% of total U.S. energy usage. This figure is projected to triple by 2030.\"</p><p class=\"\">ECM's report then underscores the centrality of HVAC and electric motors to these facilities.</p><p class=\"\">\"Cooling systems account for 37% of the energy they use. As data centers strive to improve efficiency, lower costs, and align with sustainability goals, the motor systems within their cooling mechanisms play a crucial role.\"</p>ECM PCB Stator electric motor cutaway vs. conventional copper wound option.<p class=\"\">According to ECM, additional challenges in achieving data center efficiency include the following:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Material and Resource Constraints</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Design and Operational Inefficiencies</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Speed, Vibration, and EMI Management; and</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Shipping and Maintenance Costs</p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Advantages of PCB Stator Motor Design</strong></p><p class=\"\">ECM's case study then outlines the solutions its model brings to overcoming data center efficiency and cost challenges.</p>ECM's PrintStator Motor CAD electric motor design platform.<p class=\"\">As a company, ECM pairs printed-circuit-board (PCB Stator) technology to advanced Motor CAD. The combination enables innovators to optimize electric motors that are lighter, smaller, quieter, and more energy efficient.</p><p class=\"\">Those wishing to leverage ECM's innovation can do so via three core product offerings:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PrintStator SaaS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Pre-designed PCB Stator Motor Evaluation Kits; and</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ECM's advanced protoytping services</p></li></ul><p class=\"\">As detailed in, \"Optimizing Data Center Efficiency with ECM PCB Stator Motors,\" ECM's technology offering provides the following solutions:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Premium Efficiency</strong> — PrintStator designed, PCB Stator motors achieve efficiencies up to 94%.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Full Customization</strong> — ECM's PrintStator Motor CAD enables data center operators to design motors to precise performance and dimensional specs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Lightweight and Compact Design</strong> — By replacing the bulky copper-wound stator in conventional electric motors with an ultra-thin disk, PCB Stator motors reduce weight by up to 70%.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Continuous Operation</strong> — ECM motors are designed for robust, continuous operation, ensuring high reliability and minimizing downtime risks in mission-critical environments, such as data centers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Efficient Heat Dissipation</strong> — ECM's patented thermal management solutions effectively dissipate heat without additional cooling systems, improving reliability and energy efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sustainability</strong> — ECM's PrintStator designed motors use up to 80% less copper than conventional options and are more durable (with lower maintenance and longer life cycles).</p><p class=\"\">ECM's case study goes on to offer a cost benefit table comparing its solutions to other options.</p>Comparison of ECM PCB Stator electric motor specs to competitor options for data centers.<p class=\"\">ECM will display its electric motor design solutions for HVAC and data centers and offer live demos of its PrintStator Motor CAD platform at AHR Expo 2025 at exhibit 6391. The company's CFO, Mike Smith, will also speak on the benefits of PCB Stator electric motor design at AHR's New Product Theater on Tues., Feb. 11 at 2:15pm est.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ECM</strong></p><p class=\"\">ECM PCB Stator Tech is an electric motor design software and technology company headquartered in the U.S. ECM pairs advanced Motor CAD and patented PCB Stator-printed circuit board-technology to create next generation machines for multiple applications.</p><p class=\"\">ECM's award-winning PrintStator software powers the design, manufacture, and integration of PCB Stator motors that are lighter, quieter, and more compact and energy efficient. ECM designed motors achieve efficiencies in excess of 90%, while requiring just 20% of the raw materials to produce.</p><p class=\"\">ECM has collaborated with multiple organizations to create optimized motor solutions across a variety of verticals. Those span HVAC, E-Mobility, Medical, Robotics, Aerospace, Haptics, Simulated Inertia, Renewable Energy, Aerospace, and Consumer Electronics.</p><p class=\"\">ECM's design partners include consumer electronics leader Thrustmaster, publicly traded aerospace and technology company L3 Harris, global electronics manufacturer Celestica, marine and rail component leader B. Hepworth, global engineering and manufacturing services firm East West Manufacturing, and consumer electronics startup Nodo Film Systems.</p><p class=\"\">ECM is a 2024 and 2025 CES Innovation Awards Honoree and winner of four International SaaS Awards-including SaaS Solution of The Year, Best SaaS Product for CSR, Sustainability and ESG, and Best SaaS Product for Engineering Management, PLM Or CAD. ECM's PrintStator software is also a winner of the Automate Innovation Awards, <em>Machine Design</em>IDEA Awards, and <em>Design World</em> LEAP Awards.</p><p class=\"\">ECM maintains offices in Boston (MA), Bozeman (MT), and a business development representative in Europe.</p><p class=\"\">You can learn more about ECM's PCB Stator solutions and PrintStator Motor CAD platform at www.pcbstator.com and in these videos: \"How Does a PCB Stator Work?\" and \"Designing Sustainable Electric Motors.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Jake Bright</p><p class=\"\"><em>Direct of Communications</em></p><p class=\"\">jbright@pcbstator.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> ECM PCB Stator Tech</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSs1mdqa:0/",
            "pub_date": "2025-02-05 04:35:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309216:0",
            "title": "Sector Update: Health Care",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Health care stocks fell late Tuesday afternoon with the NYSE Health Care Index down 0.3% and the Health Care Select Sector SPDR Fund (XLV) shedding 0.4%. </p><p class=\"\">The iShares Biotechnology ETF (IBB) rose 0.3%. </p><p class=\"\">In corporate news, Quantum BioPharma  shares more than doubled. The company said a trial of its dietary supplement Unbuzzd confirmed it accelerates alcohol metabolism, speeds the reduction of blood alcohol concentration and reduces symptoms of intoxication, impairment and hangover.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309216:0-sector-update-health-care/",
            "pub_date": "2025-02-05 04:26:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009912:0",
            "title": "Michigan School District to Sell $81.3M in Bonds for School Projects",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paulo Trevisani</p><p class=\"\">Michigan's Traverse City Area Public Schools plans to issue $81.3 million in municipal bonds to finance school improvements and new facility construction.</p><p class=\"\">Proceeds from the 2025 School Building and Site Bonds (General Obligation - Unlimited Tax) will be used for building renovations, new school facilities, technology upgrades, bus purchases, and improvements to athletic fields and playgrounds, according to a document posted Monday on MuniOS.</p><p class=\"\">The school district includes the entire city of Traverse and all or part of 13 townships in Grand Traverse, Leelanau and Benzie counties.</p><p class=\"\">The bonds will be repaid through local taxes. They have been assigned an AA- rating by S&amp;P Global Ratings.</p><p class=\"\">Maturities range from 2026 to 2035. The maximum interest rate is 5.5%, with the purchase price set between 100% and 120% of par value.</p><p class=\"\">PFM Financial Advisors is the municipal advisor for the deal. The sale is scheduled for Feb. 12.</p><p class=\"\">The bonds aren't subject to early redemption.</p><p class=\"\">Write to Paulo Trevisani at paulo.trevisani@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009912:0/",
            "pub_date": "2025-02-05 04:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309199:0",
            "title": "PyroGenesis Expects To Be \"Relatively Unaffected\" By Potential U.S. Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PyroGenesis , a high-tech company, looks set for modest losses Tuesday after saying it expects to be \"relatively unaffected\" by proposed U.S. tariffs, if they are still introduced after a 30 day pause put on them yesterday is removed. </p><p class=\"\">\"Management is happy to see that any possible tariff implementation has been delayed by a month to allow for further dialogue. Nevertheless, management is of the opinion that the contemplated tariffs will have little to no direct negative impact on PyroGenesis' bottom line,\" the company said in a statement. </p><p class=\"\">\"On the contrary, management believes that the company is in a unique position to benefit from many of the Trump administration's stated goals for their economy.\"</p><p class=\"\">The company noted it manufactures and assembles many of its key systems outside of Canada, including its Drosrite aluminum metal dross recovery systems, which are manufactured in the U.S. In fact, most of the components used in PyroGenesis systems are manufactured outside of Canada, the company said. </p><p class=\"\">\"More importantly,\" it said, \"outside of clients in the U.S. defense sector (which often benefits from exemptions or waivers from U.S. tariffs), the bulk of the company's current and prospective clients are located outside of the United States, specifically in Europe, Canada, and the Middle East. </p><p class=\"\">\"On that note, it is also important to point out that the majority of the company's contracts are denominated in US dollars or Euros, and the current exchange rate environment could enhance the value of our foreign-denominated contracts.\"</p><p class=\"\">PyroGenesis views the benefits from President Trump's campaign promises to \"bode well\" for the company. In particular, it cited his commitments to lower corporate taxation to stimulate business growth; reduce regulatory burdens and bureaucracy to accelerate project approvals; and expand the energy sector. </p><p class=\"\">According to Tuesday's statement the company provided the comments in response to investor questions about the impact from the recent trade policy disagreements between the U.S. and Canada, specifically with regards to potential U.S. tariffs imposed on Canadian products. </p><p class=\"\">PYR was at last look down $0.01 at $0.56.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309199:0/",
            "pub_date": "2025-02-05 04:27:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV17Z:0",
            "title": "PREVIEW: Disney seen reporting increase in rev in results before the bell",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Walt Disney  were down 0.6% in afternoon trading, with the co expected to report an increase in rev in its qtrly results to be released before the opening bell Wed</p><p class=\"\">** Analysts expect qtrly rev to rise to $24.62 bln vs $23.55 bln a yr ago and earnings of $1.45/shr vs $1.22 a yr ago, according to LSEG</p><p class=\"\">** Jefferies analysts earlier this week wrote they see risks to the co's fiscal year 2025 guidance \"due to the launch of Epic Universe\"</p><p class=\"\">** In November, DIS offered robust multi-year guidance</p><p class=\"\">** Of the 34 analysts who cover DIS, 24 recommend a \"strong buy\" or \"buy,\" nine recommend a \"hold\" and one recommends a \"sell\"</p><p class=\"\">** The median 12-mth PT is $125.55; the stock was last at $113.29</p><p class=\"\">** Last week, Nielsen's latest report showed that Walt Disney maintained its lead in U.S. TV viewing share in December, bolstered by holiday movie marathons and strong performances across its cable networks</p><p class=\"\">** Including the session move, DIS shares are up 1.7% YTD while the Dow Jones industrial average  is up 4.8%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV17Z:0-preview-disney-seen-reporting-increase-in-rev-in-results-before-the-bell/",
            "pub_date": "2025-02-05 04:27:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309214:0",
            "title": "McCormick & Co Insider Sold Shares Worth $3,840,320, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lawrence Erik Kurzius, Director, on February 03, 2025, sold 50,000 shares in McCormick &amp; Co  for $3,840,320. Following the Form 4 filing with the SEC, Kurzius has control over a total of 330,364 common shares of the company, with 276,895 shares held directly and 53,469 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/63754/000106299325001602/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/63754/000106299325001602/xslF345X05/form4.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309214:0/",
            "pub_date": "2025-02-05 04:27:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b8dea069820e5:0",
            "title": "SILICON LABORATORIES INC. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Silicon Laboratories Inc., a leading player in the semiconductor industry specializing in secure, intelligent wireless technology for IoT applications, has released its Form 10-K report for fiscal 2024. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in a highly competitive market.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Silicon Laboratories Inc. reported the following key financial metrics for fiscal 2024:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenues:</strong> $584.4 million, a decrease of $197.9 million or 25.3% compared to fiscal 2023, primarily due to reduced revenues from both Industrial &amp; Commercial and Home &amp; Life products.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Profit:</strong> $312.2 million, down by $148.4 million from fiscal 2023, with a gross margin of 53.4%, a decline from 58.9% in the previous year, mainly due to variations in customer and product mix.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operating Income (Loss):</strong> $(165.5) million, compared to an operating loss of $24.2 million in fiscal 2023, indicating a significant increase in operating loss.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income (Loss):</strong> $(191.0) million, reflecting a substantial decline from fiscal 2023, primarily due to decreased revenues and increased provision for income taxes.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\">In fiscal 2024, Silicon Laboratories Inc. achieved the following business milestones:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments:</strong> The company generated revenues primarily from its Industrial &amp; Commercial and Home &amp; Life product lines. The Industrial &amp; Commercial segment includes products like industrial automation and control, smart metering, and smart street lighting, while the Home &amp; Life segment covers smart home devices and connected health solutions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance:</strong> A significant portion of the company's revenues, 90% in fiscal 2024, was derived from outside the United States, indicating a strong international market presence. The company maintains sales offices in Asia, the Americas, and Europe to support its global operations.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sales Units:</strong> The company experienced a decrease in unit volumes and average selling prices of its products in fiscal 2024 compared to fiscal 2023, reflecting a softening demand environment as customers reduced inventory levels.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">New Product Launches:</strong> The company introduced its Series 2 portfolio, which focuses on updatable device security, a critical feature for the evolving IoT market. This portfolio enhances the capability to protect user data and system keys from threats.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> The company anticipates continued challenges due to macroeconomic conditions, including geopolitical tensions and potential trade policies. However, it remains focused on leveraging its expertise in secure, intelligent wireless technology to drive growth in the IoT market.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives</strong></p> <p class=\"\">Silicon Laboratories Inc. has undertaken several strategic initiatives to strengthen its market position and financial stability:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Liquidity and Cost Management:</strong> The company is focused on maintaining a strong liquidity position and has implemented cost containment measures to manage operating expenses. It has also reduced inventory levels in response to decreased demand, reflecting a strategic initiative to optimize supply chain management.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Capital Management:</strong> The company ended fiscal 2024 with $382.2 million in cash, cash equivalents, and short-term investments. It has a $400 million revolving credit facility with no outstanding amounts as of December 28, 2024. The company did not repurchase any shares in the last quarter of fiscal 2024, although it has an authorized share repurchase program of up to $100 million through December 2024. The company has not declared or paid any cash dividends and does not intend to pay dividends in the near future.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> The company plans to maintain its liquidity and capital resources to support its operations and potential strategic acquisitions. It intends to continue managing its capital structure prudently, with a focus on sustaining its cash position and exploring opportunities for growth and expansion. The company may seek additional funding if necessary to support strategic initiatives or acquisitions.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges and Risks</strong></p> <p class=\"\">Silicon Laboratories Inc. faces several challenges and risks in its operations:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Industry Competition:</strong> The company operates in the highly competitive semiconductor industry, focusing on secure, intelligent wireless technology for IoT applications. It faces challenges in maintaining its competitive edge due to rapid technological changes and the need for continuous innovation in mixed-signal IC design.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Supply Chain Risks:</strong> The reliance on third-party manufacturers for production introduces risks related to supply chain disruptions, geopolitical tensions, and capacity constraints.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Market Fluctuations:</strong> The semiconductor industry is cyclical, with significant fluctuations in supply and demand, impacting the company's ability to forecast and plan. Economic downturns can lead to reduced demand, high inventory levels, and price erosion.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cybersecurity Threats:</strong> Cybersecurity threats, including potential attacks due to geopolitical tensions, pose risks to operations and reputation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Global Operations:</strong> The company faces challenges related to global operations, including currency fluctuations, political instability, and compliance with diverse regulatory environments.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Volatility:</strong> The reliance on a few key customers and distributors for a significant portion of revenue increases the risk of revenue volatility.</li></ul><p class=\"\">Management acknowledges the need to address supply chain vulnerabilities and enhance cybersecurity measures. The company is investing in research and development to maintain technological leadership and expand its product portfolio. Efforts are being made to diversify the customer base and reduce dependency on key distributors. The company is also focusing on improving operational efficiencies and managing costs to mitigate the impact of market fluctuations.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1038074/000103807425000003/slab-20241228.htm\" rel=\"nofollow\" target=\"_blank\">SILICON LABORATORIES INC. [ SLAB ] - 10-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:b8dea069820e5:0-silicon-laboratories-inc-sec-10-k-report/",
            "pub_date": "2025-02-05 04:28:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0V4:0",
            "title": "US dollar edges lower as China tariffs kick in",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Markets see Trump's tariff threats as a negotiating tool</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. dollar index down 0.56% amid tariff tensions</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China imposes tariffs on U.S. imports in response</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro and Australian dollar rise</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Canadian dollar down after Monday rebound</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">President Trump granted Canada, Mexico 30-day reprieve</li></ul></span></div><span><p class=\"\">    The U.S. dollar edged lower on Tuesday as President Donald Trump's tariff threats were interpreted more as a negotiating tactic rather than an end goal, a day after he suspended planned measures against Mexico and Canada.</p><p class=\"\">However, the new Trump administration imposed additional 10% tariffs on imports from China effective from early Tuesday and currency analysts said they expected high sensitivity to tariff developments and volatility to persist.</p><p class=\"\">The U.S. dollar index , a measure of the value of the greenback relative to a weighted basket of six major foreign currencies, was down 0.56% at 107.97 while the Canadian dollar was weaker and the Mexican peso was stronger.</p><p class=\"\">\"We're still looking at these 10% tariffs on China and China's retaliation, which is going to add some risk premium back into the market,\" said Helen Given, FX trader at Monex USA. \"We'll see if there's any sort of negotiation on the back end that might tamp these down as we saw with Mexico and Canada. But as it looks right now, the trade war with China is back up and running.\"</p><p class=\"\">The euro rose slightly, with Washington warning that the European Union may be next in line for trade levies, which are widely expected to push up U.S. inflation, supporting the dollar by keeping U.S. interest rates higher for longer.</p><p class=\"\">Beijing on Tuesday imposed tariffs on some U.S. imports in a swift response to new U.S. duties on Chinese goods, raising the stakes in a showdown between the world's top two economies. </p><p class=\"\">\"It suggests that China is wary of pushing back too hard against Trump's latest tariffs and is leaving the door open for future negotiations,\" said Lee Hardman, senior currency analyst at MUFG.</p><p class=\"\">The Chinese yuan edged up 0.23% to 7.287 per dollar in offshore trading . There is no official yuan trading until Wednesday, with mainland markets still closed for Lunar New Year festivities.</p><p class=\"\">The Australian dollar , which often acts as a liquid proxy for the yuan because the Australian economy is highly exposed to China, rose 0.5% to $0.626, well above Monday's low of $0.6085, the weakest level since April 2020.</p><p class=\"\">EURO LOWER</p><p class=\"\">The euro  rose 0.37% to $1.038, with market participants watching parity.</p><p class=\"\">Several analysts recently said that U.S. tariffs would have a deflationary effect on the euro area.</p><p class=\"\">\"While the prospects for wider across-the-board tariffs on the EU (are) now highly uncertain, to the extent that tariff back-and-forth continues, an environment of prolonged trade uncertainty should weigh on the Euro in and of itself,\" Goldman Sachs analysts said in a research note. </p><p class=\"\">The Canadian dollar  lost 0.81% to C$1.43 against its U.S. counterpart, following a sharp rebound from a low of C$1.4792 on Monday, the weakest level since 2003.</p><p class=\"\">The Mexican peso  rose 1.06% to 20.546, after jumping over 1.5% the day before.</p><p class=\"\">The U.S. dollar was nearly up 0.3% at 154.290 yen , with the Japanese currency seen as a safe-haven currency and the greenback less appealing after recent rises.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0V4:0-us-dollar-edges-lower-as-china-tariffs-kick-in/",
            "pub_date": "2025-02-05 04:28:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309218:0",
            "title": "Sector Update: Energy Stocks Rise Late Afternoon",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy stocks were higher late Tuesday afternoon, with the NYSE Energy Sector Index adding 2.1% and the Energy Select Sector SPDR Fund (XLE) up 2%. </p><p class=\"\">The Philadelphia Oil Service Sector index climbed 2.5%, while the Dow Jones US Utilities index was down 0.6%. </p><p class=\"\">In sector news, China plans to impose 15% tariffs on US coal and liquefied natural gas imports and a 10% tariff on crude oil, agricultural machinery, large-displacement cars, and pickup trucks. The move follows the Trump administration's announcement of a 10% additional tariff on imports from China late Friday. </p><p class=\"\">Front-month West Texas Intermediate crude oil was declining 0.7% to $72.63 a barrel while the global benchmark Brent crude contract was up 0.1% at $76.06 a barrel. Henry Hub natural gas futures fell 3% to $3.25 per 1 million BTU. </p><p class=\"\">In corporate news, WEC Energy  reported Q4 earnings Tuesday of $1.43 per diluted share, up from $0.69 a year earlier. Analysts polled by FactSet expected $1.44. Its shares shed 0.6%. </p><p class=\"\">BP  is poised to spend up to $25 billion over the lifetime of a project to redevelop four oil and gas fields in Kirkuk, Iraq, Reuters reported Tuesday. Separately, BP is delaying plans to convert its former Kwinana oil refinery in Australia to produce renewable fuels, Bloomberg said Tuesday. BP shares rose 2.1%. </p><p class=\"\">Shell  said Tuesday it has resumed production at the Penguins field in the UK North Sea with a floating production, storage, and offloading facility. Its shares added 1.8%. </p><p class=\"\">SolarBank  shares jumped nearly 9%. The company said Tuesday that construction of its first battery energy storage system project in Ontario is expected to begin next week.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309218:0-sector-update-energy-stocks-rise-late-afternoon/",
            "pub_date": "2025-02-05 04:29:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009946:0",
            "title": "Trump's Trade Tactics Expose Canada's Need to Reshape Economy - Analysis",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul Vieira</p><p class=\"\">OTTAWA--The threat of prolonged uncertainty hovering over Canadian businesses from President Trump's trade policy is fueling calls for Canada to make its economy more resilient and innovative and less reliant on its southern neighbor.</p><p class=\"\">Canadian executives, former officials and economists say the country requires a fresh policy rethink to mitigate the trade risk Trump poses, and counter his promise to unleash business investment and energy production in his country. About 80% of Canadian exports are U.S.-bound.</p><p class=\"\">Canada on Monday avoided a hefty 25% tariff on its U.S. imports for a 30-day period, which Trump said will be used to see if a new economic deal with Canada can be reached. The hefty tariff could be revived without a deal.</p><p class=\"\">\"The worst-case scenario is a giant U.S. tariff. The second worst scenario is ongoing uncertainty. So we have the second-worst scenario,\" said Dan Kelly, president of the Canadian Federation of Independent Business. \"Canadian businesses now have to sleep with one eye open.\"</p><p class=\"\">Business leaders and economists say Canada should pursue lower taxes to encourage investment and innovation, accelerated approvals for resource and infrastructure projects, and perhaps resurrected plans for new oil-and-gas pipelines in the west and east to sell the country's energy to non-U.S. markets.</p><p class=\"\">Failing to do so leaves Canada too exposed to continued trade conflicts with Trump and an increasingly protectionist U.S. Congress. Without predictable U.S. trade, Canada's economy needs other engines of growth other than housing, immigration and public-sector expansion, economists and business leaders argue.</p><p class=\"\">A survey from KPMG Canada late last month indicated that nearly half of the business leaders contacted said they plan to shift investments to the U.S. or set up production operations to secure tariff-free access to the U.S. market and reduce costs.</p><p class=\"\">Among those leading the call for a new Canadian economic vision is the chief executive of the country's largest bank. \"This is the moment to unite the country behind a long-term economic agenda-one that boosts competitiveness and drives prosperity for all,\" Dave McKay of Royal Bank of Canada said in a post on the social-networking site, LinkedIn. \"To do this, Canada must build a more resilient economy that leverages its strengths.\"</p><p class=\"\">Canadian policymakers might be listening. Canada's Liberal government decided last week to defer implementation, until 2026, of an increase in the country's capital-gains tax--a measure that business groups and executives criticized heavily as dissuading investment at an inopportune time.</p><p class=\"\">The Conservative Party, which holds a sizable lead in public-opinion polls, has vowed to scrap that tax, and pledged broadly to lower tax rates, cut the public sector and repeal environmental regulations that thwart the country's resource sector.</p><p class=\"\">Former Canadian and U.K. central banker Mark Carney, the perceived front-runner to succeed Justin Trudeau as prime minister and Liberal Party leader, is also signaling a shift in economic policy for the current governing party.</p><p class=\"\">\"The federal government spends too much, but it invests too little. Middle class taxes are too high,\" he said last month in announcing his bid to be Canada's next prime minister.</p><p class=\"\">Any tax cutting effort by Canada may further strain its public finances, with the budget deficit at historically elevated levels and debt-financing costs up 10% from a year ago, as of the third quarter of last year.</p><p class=\"\">Outgoing Canadian Prime Minister Justin Trudeau has often bragged Canada is the only Group of Seven country with free-trade agreements with all other G7 members. Economists say it's time to capitalize and diversify.</p><p class=\"\">\"There will, or should be in any event, a greater awareness in Canada that it does not have a trusted partner south of the border,\" said David Rosenberg, an economist and head of market-strategy firm Rosenberg Research.</p><p class=\"\">Write to Paul Vieira at paul.vieira@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009946:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009928_20250204009953:0",
            "title": "Otter Tail Raises Qtr Dividend to 52.5c >OTTR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009928_20250204009953:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009928:0",
            "title": "Otter Tail Corporation Increases Quarterly Dividend by 12 Percent",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(20:30 GMT) </strong>*Otter Tail Corporation Increases Quarterly Dividend By 12 Percent &gt;OTTR<br/><strong class=\"root-Tkn6WL2y\">(20:30 GMT) </strong>Press Release: Otter Tail Corporation Increases Quarterly Dividend by 12 Percent</p><p class=\"\">Otter Tail Corporation Increases Quarterly Dividend by 12 Percent</p><p class=\"\">FERGUS FALLS, Minn.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Otter Tail Corporation  announced today that its Board of Directors increased the company's quarterly common stock dividend to $0.525 per share. The increase brings the annual indicated dividend rate to $2.10 per share, a $0.23, or 12.3 percent, increase over the 2024 rate.</p><p class=\"\">\"Otter Tail Corporation ended 2024 in a position of financial strength, and the double-digit increase to our dividend reflects our commitment to delivering shareholder value,\" said President and CEO Chuck MacFarlane. \"Going forward, we expect our annual dividend increase to approximate our long-term earnings per share growth rate target.\"</p><p class=\"\">2025 will mark the 87th consecutive year dividends will be paid on common stock. The first quarter dividend is payable on March 10, 2025 to shareholders of record on February 14, 2025.</p><p class=\"\">The corporation will issue a news release announcing 2024 financial results on Monday, February 17, 2025 and has scheduled an earnings call for Tuesday, February 18, 2025 at 10:00 a.m. CT.</p><p class=\"\">About Otter Tail Corporation: Otter Tail Corporation has interests in diversified operations that include an electric utility and manufacturing businesses. Otter Tail Corporation stock trades on the NASDAQ Global Select Market under the symbol OTTR. The latest investor and corporate information is available at www.ottertail.com. Corporate offices are located in Fergus Falls, Minnesota, and Fargo, North Dakota.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204422675/en/</p><p class=\"\">CONTACT:    Media Contact: Stephanie Hoff, Director of Corporate Communications,</p><p class=\"\">(218) 739-8535</p><p class=\"\">Investor Contact: Beth Eiken, Manager of Investor Relations, (701) 451-3571</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(20:30 GMT) </strong>*Otter Tail Raises Qtr Dividend to 52.5c &gt;OTTR</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009928:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009928_20250204009928:0",
            "title": "Otter Tail Corporation Increases Quarterly Dividend By 12 Percent >OTTR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009928_20250204009928:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr9kTg7f:0",
            "title": "Nordea Bank Abp: Repurchase of own shares on 04.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Nordea<p class=\"\">Nordea Bank Abp</p><p class=\"\">Stock exchange release – Changes in company’s own shares</p><p class=\"\">04.02.2025 at 22.30 EET</p><p class=\"\">Nordea Bank Abp (LEI: 529900ODI3047E2LIV03) has on 04.02.2025 completed repurchases of own shares (ISIN: FI4000297767) as follows:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th><p class=\"\">Trading venue (MIC Code)</p></th><th><p class=\"\">Number of shares</p></th><th><p class=\"\">Weighted average price / share, EUR* **</p></th><th><p class=\"\">Total cost, EUR* **</p></th></tr></thead><tbody><tr><td><p class=\"\">XHEL</p></td><td><p class=\"\">134,713</p></td><td><p class=\"\">11.27</p></td><td><p class=\"\">1,518,148.15</p></td></tr><tr><td><p class=\"\">XSTO</p></td><td><p class=\"\">106,581</p></td><td><p class=\"\">11.24</p></td><td><p class=\"\">1,198,010.66</p></td></tr><tr><td><p class=\"\">XCSE</p></td><td><p class=\"\">26,423</p></td><td><p class=\"\">11.27</p></td><td><p class=\"\">297,661.95</p></td></tr><tr><td><p class=\"\">Total</p></td><td><p class=\"\">267,717</p></td><td><p class=\"\">11.26</p></td><td><p class=\"\">3,013,820.76</p></td></tr></tbody></table></div><p class=\"\">* FX rate used: SEK to EUR 11.4470 and DKK to EUR 7.4610 </p><p class=\"\">** Rounded to two decimals</p><p class=\"\">On 17 October 2024, Nordea announced a share buy-back programme of up to a maximum of EUR 250 million based on the authorisation granted by Nordea’s Annual General Meeting 2024. The repurchase of own shares is executed in public trading in accordance with Regulation No. 596/2014 of the European Parliament and Council of 16 April 2014 (MAR) and the Commission Delegated Regulation (EU) 2016/1052.</p><p class=\"\">After the disclosed transactions, Nordea holds 3,822,436 treasury shares for capital optimisation purposes and 11,513,966 treasury shares for remuneration purposes.</p><p class=\"\">Details of each transaction are included as an appendix to this announcement.</p><p class=\"\">On behalf of Nordea Bank Abp,</p><p class=\"\">Morgan Stanley Europe SE</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information:</strong></p><p class=\"\">Ilkka Ottoila, Head of Investor Relations, +358 9 5300 7058</p><p class=\"\">Media inquiries, +358 10 416 8023 or press@nordea.com</p><p class=\"\">https://news.cision.com/nordea/r/nordea-bank-abp--repurchase-of-own-shares-on-04-02-2025%2Cc4100652</p><p class=\"\">Nordea-statement-of-transactions-in-own-shares-20250204</p><p class=\"\">Nordea-statement-of-transactions-in-own-shares-20250204</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr9kTg7f:0-nordea-bank-abp-repurchase-of-own-shares-on-04-02-2025/",
            "pub_date": "2025-02-05 04:30:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009896:0",
            "title": "NYSE New 52-Week Highs And Lows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">New Highs 63 <br/> <br/>COMPANY                      SYMBOL       HIGH         VOLUME <br/>-------                      ------       ----         ------ <br/>Acres Commercial Realty      ACR         18.20         18,907 <br/>ASA Gold &amp; Prec Metals       ASA         24.47         27,601 <br/>A10 Networks                 ATEN        20.49        488,134 <br/>Accenture Cl A               ACN        392.45      1,866,888 <br/>Agnico-Eagle Mines           AEM         97.01      1,810,039 <br/>Air Products &amp; Chemicals     APD        341.14        785,199 <br/>Alaska Air Group             ALK         75.88      1,598,158 <br/>Algonquin Pwr Nts 2079       AQNB        25.85          7,933 <br/>Angel Oak Finl Strat         FINS        13.49         74,684 <br/>Ares Management              ARES       200.49      1,263,888 <br/>Athene Holding Deb. 2064     ATHS        26.25        255,797 <br/>AutoZone                     AZO       3472.03         76,485 <br/>BJ's Wholesale Club          BJ         103.06      1,140,893 <br/>BlackBerry                   BB           4.66     19,078,588 <br/>BlackSky Technology          BKSY        18.30      2,444,137 <br/>BlackSky Technology Wt       BKSY.WS    0.3500        197,004 <br/>Brinker International        EAT        192.22        718,780 <br/>British Amer Tobacco ADR     BTI         40.25      3,544,848 <br/>Broadridge Finl Solutions    BR         242.03        307,013 <br/>Butterfly Network            BFLY         4.71      8,687,816 <br/>Butterfly Network Wt         BFLY.WS    0.5000        155,871 <br/>Cheniere Energy Ptnr         CQP         66.47        212,281 <br/>Darden Restaurants           DRI        200.90        492,807 <br/>Dover Corp                   DOV        222.31        505,993 <br/>Dutch Bros                   BROS        64.89        973,839 <br/>Embotell Andina B ADR        AKO.B       20.75          5,475 <br/>Fst Tr Splty Fin             FGB          4.49         17,172 <br/>Franco-Nevada                FNV        139.68        441,217 <br/>Gartner Inc                  IT         584.01        640,544 <br/>Genpact                      G           49.46        439,661 <br/>Guidewire Software           GWRE       217.43        513,285 <br/>Hims &amp; Hers Health           HIMS        41.65     13,277,322 <br/>Intercorp Finl Svcs          IFS         30.65        257,501 <br/>IBM                          IBM        264.18      2,917,118 <br/>Kayne Anderson BDC           KBDC        17.34         41,335 <br/>Klaviyo                      KVYO        48.73        801,565 <br/>Kroger                       KR          64.90      2,870,730 <br/>Kyndryl Holdings             KD          39.80      2,919,329 <br/>Live Nation Ent              LYV        148.36      1,564,468 <br/>MBIA Inc                     MBI          7.30        275,594 <br/>MP Materials                 MP          24.78      6,711,033 <br/>MSC Income Fund              MSIF        16.74        120,027 <br/>Markel Group                 MKL       1847.92         28,350 <br/>Oklo                         OKLO        48.02     18,025,479 <br/>OppFi                        OPFI        15.12      1,882,857 <br/>OppFi Wt                     OPFI.WS      4.94        151,650 <br/>PJT Partners                 PJT        190.28        446,007 <br/>Planet Labs PBC              PL           6.55      7,714,032 <br/>Reddit                       RDDT       218.25      4,388,989 <br/>Roblox                       RBLX        73.27      5,695,316 <br/>Similarweb                   SMWB        17.50        400,062 <br/>Sixth Street Spc Lending     TSLX        22.47        110,638 <br/>Skeena Resources             SKE         10.37        246,224 <br/>Spotify Technology           SPOT       618.55      5,297,353 <br/>Stride                       LRN        140.41        634,325 <br/>Tuya ADR                     TUYA         2.94      4,329,433 <br/>UGI                          UGI         31.24        605,892 <br/>Universal Tech Institute     UTI         28.73        428,564 <br/>Walmart                      WMT        100.87     10,151,521 <br/>Wells Fargo                  WFC         79.85      8,367,934 <br/>Westlake Chem Partners       WLKP        24.84         29,652 <br/>Wyndham Hotels &amp; Resorts     WH         107.18        270,872 <br/>XPeng ADR                    XPEV        17.30     13,693,434 <br/> <br/> <br/> <br/>New Lows 44 <br/> <br/>COMPANY                      SYMBOL       LOW          VOLUME <br/>-------                      ------       ----         ------ <br/>ADC Therapeutics             ADCT         1.55        423,996 <br/>AES                          AES         10.33      8,370,441 <br/>Alexandria Real Estate       ARE         93.80        522,032 <br/>Annovis Bio                  ANVS         2.99      1,178,837 <br/>Archer Daniels Midland       ADM         47.46      4,383,129 <br/>Atkore                       ATKR        62.62      3,372,244 <br/>BRC                          BRCC         2.48      1,146,102 <br/>Ball Corp                    BALL        50.81      4,401,065 <br/>Bally's                      BALY/T      15.43          7,578 <br/>Boston Beer Cl A             SAM        243.14        100,727 <br/>Bunge Global                 BG          73.74      1,339,607 <br/>Cable One                    CABO       276.12         76,961 <br/>Conagra Brands               CAG         24.85      2,961,419 <br/>Danaher                      DHR        210.04      5,115,025 <br/>e.l.f. Beauty                ELF         86.14      4,344,228 <br/>Edgewell Personal Care       EPC         30.87        287,919 <br/>Entergy LA Mtg Bds           ELC         20.50          9,977 <br/>Enzo Biochem                 ENZ        0.5677        165,817 <br/>Everest Group                EG         336.50        492,008 <br/>Foot Locker                  FL          18.62      1,105,676 <br/>Forestar Group               FOR         22.67         61,724 <br/>Guess?                       GES         12.19        438,275 <br/>Halliburton                  HAL         25.21      7,859,428 <br/>Herbalife                    HLF          5.18        927,303 <br/>Hershey                      HSY        143.95      1,302,282 <br/>Infinity Natrl Rscs          INR         20.00        358,081 <br/>Koppers Holdings             KOP         28.57         41,974 <br/>Maiden Holdings Nts 2046     MHLA        14.55            105 <br/>Merck                        MRK         87.33     38,822,747 <br/>Murphy Oil                   MUR         25.26      2,153,676 <br/>Offerpad Solutions Cl A      OPAD         2.18         24,159 <br/>PG&amp;E 6% Pfd. A               PCGpX       40.27         27,004 <br/>PG&amp;E                         PCG         14.99     10,210,354 <br/>PVH Corp.                    PVH         80.25      1,163,804 <br/>Peabody Energy               BTU         17.10      1,260,009 <br/>Quanex Building Products     NX          19.57        177,376 <br/>SCE Trust IV Pfd. J          SCEpJ       21.86         26,574 <br/>Seritage Growth Prop A       SRG          3.61         80,489 <br/>Solo Brands                  DTC        0.9401        106,979 <br/>Stoneridge                   SRI          4.21        290,875 <br/>USANA Health Sciences        USNA        30.92         92,360 <br/>Utz Brands                   UTZ         12.71        860,885 <br/>Worthington Steel            WS          27.85         85,747 <br/>XPLR Infrastructure          XIFR         9.37      2,324,954 <br/> <br/> <br/> <br/> <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009896:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009892:0",
            "title": "NYSE American New 52-Week Highs And Lows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">New Highs 2 <br/> <br/>COMPANY                      SYMBOL       HIGH         VOLUME <br/>-------                      ------       ----         ------ <br/>Collective Mining            CNL          5.58          7,055 <br/>Orla Mining                  ORLA         6.47        387,869 <br/> <br/> <br/> <br/>New Lows 5 <br/> <br/>COMPANY                      SYMBOL       LOW          VOLUME <br/>-------                      ------       ----         ------ <br/>Mixed Martial Arts Group     MMA          1.10         12,783 <br/>Pacific Gas &amp; Elec 4.5%      PCGpH       16.08            489 <br/>Pacific G&amp;E 5.5% Cum pfd     PCGpB       19.54            862 <br/>Scorpius Holdings            SCPX       0.2275        403,565 <br/>Toppoint Holdings            TOPP         1.63         51,996 <br/> <br/> <br/> <br/> <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009892:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009893:0",
            "title": "NASDAQ New 52-Week Highs And Lows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">New Highs 92 <br/> <br/>COMPANY                      SYMBOL       HIGH         VOLUME <br/>-------                      ------       ----         ------ <br/>Allot                        ALLT         8.93        698,211 <br/>Alphabet Cl A                GOOGL      206.68     21,584,209 <br/>Alphabet Cl C                GOOG       208.23     13,809,470 <br/>Amazon.com                   AMZN       242.52     18,944,995 <br/>Ascentage Pharma ADR         AAPG        18.91        332,322 <br/>Avid Bioservices             CDMO        12.51      2,121,751 <br/>Axsome Therapeutics          AXSM       112.48        457,162 <br/>Baker Hughes                 BKR         47.83      4,983,343 <br/>Bellevue Life Sciences Rt    BLACR      0.2500         45,533 <br/>Cellebrite DI                CLBT        25.95      1,631,840 <br/>Charlton Aria Acquisition    CHARU       10.30            436 <br/>Charlton Aria Acqn Rt        CHARR      0.2365          1,717 <br/>Cheesecake Factory           CAKE        57.32        881,519 <br/>Clean Energy Fuels           CLNE         3.49      2,955,480 <br/>Cognizant Tech Solutions     CTSH        83.97      2,155,056 <br/>Costco Wholesale             COST      1024.11      1,251,668 <br/>CyberArk Software            CYBR       378.78        425,688 <br/>Direxion Dly AMZN Bl 2X      AMZU        50.61        713,749 <br/>Direxion Dly GOOGL Bl 2x     GGLL        53.52      1,967,449 <br/>Direxion Dly NFLX Bull 2X    NFXL        46.29        394,065 <br/>Direxion Dly PLTR Bull 2X    PLTU        50.92      2,439,250 <br/>DoorDash                     DASH       194.22      1,408,264 <br/>Duolingo                     DUOL       383.06        483,310 <br/>Eton Pharmaceuticals         ETON        18.03        272,389 <br/>Eureka Acquisition Cl A      EURK        10.20          1,959 <br/>ExlService Holdings          EXLS        51.25        385,399 <br/>First Seacoast Bancorp       FSEA        11.30         24,710 <br/>FT Gl Tactical Commodity     FTGC        25.25        760,243 <br/>Fox Corp Cl B                FOX         52.54      1,112,188 <br/>Fox Corp Cl A                FOXA        55.56      4,794,125 <br/>Franklin Financial Svcs      FRAF        34.87         10,035 <br/>Freedom Holding              FRHC       143.16         39,617 <br/>GSR III Acquisition          GSRT         9.94         87,361 <br/>Gl X Social Media ETF        SOCL        47.61          9,710 <br/>Goldenstone Acquisition      GDSTU       12.89         17,892 <br/>GrShr 2x Long AMZN Daily     AMZZ        41.70        186,431 <br/>GrShr 2x Long PLTR Daily     PTIR       240.30      1,618,924 <br/>HealthEquity                 HQY        113.23        370,011 <br/>Horizon Space Acqn II        HSPTU       10.15          4,200 <br/>IF Bancorp                   IROQ        25.00          3,198 <br/>Inari Medical                NARI        79.89      1,330,900 <br/>Inflection Point II Wt       IPXXW        1.34        558,044 <br/>Insmed                       INSM        81.25        836,921 <br/>Intapp                       INTA        75.90        912,717 <br/>iSh BBB-B CLO Active         BCLO        50.42            962 <br/>JVSPAC Acquisition Cl A      JVSA        10.60          1,001 <br/>KORU Medical Systems         KRMD         5.05      1,084,659 <br/>Kingstone                    KINS        18.15        413,565 <br/>Kolibri Global Energy        KGEI         7.91         82,336 <br/>Liberty Formula One A        FWONA       89.13         49,116 <br/>Liberty Live C               LLYVK       75.68        176,901 <br/>Liberty Live A               LLYVA       74.06         75,957 <br/>Locafy Wt                    LCFYW      109.00         11,044 <br/>MIND Technology              MIND        10.13        296,503 <br/>M3-Brigade Acqn V Wt         MBAVW      0.2200         10,050 <br/>Matterport                   MTTR         5.36      6,299,100 <br/>Mesa Laboratories            MLAB       152.75         27,061 <br/>Mirum Pharmaceuticals        MIRM        50.34        193,273 <br/>Monopar Therapeutics         MNPR        49.98         67,249 <br/>NSTS Bancorp                 NSTS        12.96          1,850 <br/>Nabors Energy II Cl A        NETD        10.90          1,213 <br/>Nayax                        NYAX        39.28          2,725 <br/>Netflix                      NFLX      1008.00      4,772,107 <br/>News Corp Cl B               NWS         33.00        741,793 <br/>Nutex Health                 NUTX        49.75         29,476 <br/>O'Reilly Automotive          ORLY      1336.63        178,102 <br/>Oak Woods Acquisition Wt     OAKUW      0.1450         50,256 <br/>Oportun Financial            OPRT         5.22        234,657 <br/>Palantir Technologies        PLTR       106.91    201,842,762 <br/>Playa Hotels &amp; Resorts       PLYA        12.98      1,287,987 <br/>ProShares Nasdaq-100 DW      QQQA        50.67          2,297 <br/>Pulse Biosciences            PLSE        23.74        135,901 <br/>RF Industries                RFIL         5.67         48,713 <br/>Remitly Global               RELY        24.18      1,443,274 <br/>Roman DBDR Acquisition II    DRDB         9.93        505,800 <br/>Sanmina                      SANM        86.69        356,475 <br/>Sprouts Farmers Market       SFM        165.63        796,415 <br/>Starbucks                    SBUX       110.75      6,377,629 <br/>Stellar V Capital            SVCCU       10.09        213,981 <br/>Sun Country Airlines         SNCY        17.75        793,590 <br/>Supernus Pharmaceuticals     SUPN        40.24        377,250 <br/>Texas Community Bcshs        TCBS        15.92            417 <br/>ThredUp                      TDUP         2.61        908,241 <br/>Translational Dev Acqn Un    TDACU       10.06        183,255 <br/>Trinity Capital              TRIN        15.51        397,661 <br/>TruBridge                    TBRG        25.90        169,700 <br/>Unity Bancorp                UNTY        49.40         56,231 <br/>VanEck Retail ETF            RTH        242.60          4,936 <br/>VeriSign                     VRSN       219.57        417,390 <br/>Viant Technology             DSP         22.67        191,078 <br/>Wang &amp; Lee Group             WLGS         7.90        153,439 <br/>Willamette Valley            WVVI         6.00         12,074 <br/> <br/> <br/> <br/>New Lows 111 <br/> <br/>COMPANY                      SYMBOL       LOW          VOLUME <br/>-------                      ------       ----         ------ <br/>Aditxt                       ADTX       0.0905     11,661,441 <br/>AgriFORCE Growing Sys        AGRI         2.00        120,371 <br/>Allogene Therapeutics        ALLO         1.62      2,078,614 <br/>Alternus Clean Energy        ALCE       0.2751        158,201 <br/>American Woodmark            AMWD        72.93         78,588 <br/>Amphastar Pharm              AMPH        32.25        276,772 <br/>Annexon                      ANNX         3.44        717,314 <br/>Applied Therapeutics         APLT       0.5439      2,051,462 <br/>Artiva Biotherapeutics       ARTV         4.58        169,109 <br/>Ascent Solar Technologies    ASTI         1.90         30,636 <br/>Aspira Women's Health        AWH        0.2900        579,128 <br/>Baijiayun Group              RTC        0.6450        794,042 <br/>Beta Bionics                 BBNX        21.72        476,954 <br/>Bolt Biotherapeutics         BOLT       0.4631        286,675 <br/>Boundless Bio                BOLD         2.15         15,411 <br/>Bowen Acquisition            BOWN         3.80         15,289 <br/>BriaCell Therapeutics        BCTX         3.92        797,136 <br/>BriaCell Therapeutics Wt     BCTXW      0.0819        180,404 <br/>CN Energy Group              CNEY       0.2212      1,475,017 <br/>Campbell's                   CPB         37.16      2,135,359 <br/>Celsius Holdings             CELH        23.03      6,463,345 <br/>Chord Energy                 CHRD       109.22        727,327 <br/>ClearOne                     CLRO       0.4500        170,640 <br/>Cloudastructure Cl A         CSAI        12.50         49,789 <br/>Conduit Pharmaceuticals      CDT          1.75        458,525 <br/>Contineum Therapeutics       CTNM         8.96         47,223 <br/>Cyngn                        CYN        0.0730     91,206,165 <br/>Defiance Oil Enh Opt Incm    USOY        13.14        223,002 <br/>Digital Ally                 DGLY       0.1761        819,285 <br/>Direxion Dly AMZN Bear 1X    AMZD        10.44         52,841 <br/>Direxion Dly GOOGL Br 1X     GGLS        11.16        688,631 <br/>Direxion Dly PLTR Bear 1X    PLTD        14.83      7,334,671 <br/>Establishment Labs Hldgs     ESTA        29.59        323,238 <br/>Expion360                    XPON         1.32         54,888 <br/>Fathom Holdings              FTHM         1.19         73,726 <br/>FT Nasdaq Food &amp; Bev         FTXG        21.86         10,358 <br/>Fluence Energy               FLNC        12.01      1,485,700 <br/>Fractyl Health               GUTS         1.55        496,484 <br/>GlucoTrack                   GCTK       0.7400     45,699,550 <br/>Green Plains                 GPRE         8.42        463,650 <br/>Greenidge Generation         GREE         1.24        216,856 <br/>Greenlane Holdings           GNLN         1.34         36,033 <br/>Huadi International          HUDI         1.47          4,903 <br/>Icon Energy                  ICON       0.3050      2,162,120 <br/>Immunovant                   IMVT        20.42        683,568 <br/>Interactive Strength         TRNR         1.85        166,456 <br/>iSpecimen                    ISPC         1.82        101,161 <br/>J&amp;J Snack Foods              JJSF       116.60        370,944 <br/>Johnson Outdoors Cl A        JOUT        28.19         60,888 <br/>Kyverna Therapeutics         KYTX         3.02        243,960 <br/>LanzaTech Global             LNZA       0.8200      1,138,600 <br/>Lexaria Bioscience Wt        LEXXW      0.2500          1,110 <br/>Liberty Lat America Cl C     LILAK        5.88        282,842 <br/>Lightwave Logic              LWLG         1.67        480,858 <br/>LogicMark                    LGMK         1.06        550,037 <br/>MGP Ingredients              MGPI        33.53        203,361 <br/>MKDWELL Tech                 MKDW       0.4521        103,539 <br/>Macrogenics                  MGNX         2.79        334,929 <br/>Maiden Holdings              MHLD       0.9500         54,194 <br/>Manhattan Associates         MANH       196.04        406,614 <br/>Maze Therapeutics            MAZE        13.77        462,864 <br/>Moleculin Biotech            MBRX         1.24        100,158 <br/>Mondelez Intl Cl A           MDLZ        55.88      8,095,965 <br/>Monro                        MNRO        18.29        397,245 <br/>Mustang Bio                  MBIO         3.56        117,742 <br/>NIP Group ADR                NIPG         3.31        129,511 <br/>NWTN Wt                      NWTNW      0.0110        137,926 <br/>National Beverage            FIZZ        40.41         65,340 <br/>Neogen                       NEOG        10.61      1,341,818 <br/>ODP                          ODP         20.84        135,164 <br/>Oatly Group ADR              OTLY       0.5424      3,844,956 <br/>Ocean Biomedical             OCEA       0.1560      3,165,648 <br/>Omega Therapeutics           OMGA       0.1423      8,559,822 <br/>OneConstruction Group        ONEG         2.07         16,552 <br/>Ovid Therapeutics            OVID       0.6500        276,038 <br/>Pasithea Therapeutics        KTTA         2.03          8,835 <br/>Performance Shipping         PSHG         1.53         99,726 <br/>Phathom Pharmaceuticals      PHAT         5.42        896,165 <br/>PowerUp Acquisition          PWUPU        9.81          9,678 <br/>PowerUp Acquisition          PWUP         9.00          3,037 <br/>Prime Medicine               PRME         2.53      1,105,788 <br/>Primega Group Holdings       PGHL       0.7688        268,276 <br/>Professional Diversity       IPDN       0.3300         28,498 <br/>Profound Medical             PROF         6.17         26,541 <br/>Protagenic Therapeutics      PTIX       0.3475         73,369 <br/>RF Acquisition               RFACU        5.16          5,001 <br/>Regeneron Pharmaceuticals    REGN       642.00      1,208,583 <br/>SAG Holdings                 SAG          2.00         82,212 <br/>SBC Medical Group Hldgs      SBC          4.82         17,164 <br/>SMX (Security Matters)       SMX          3.00        467,144 <br/>SRM Entertainment            SRM        0.3140        121,623 <br/>SaverOne 2014 ADR            SVRE       0.3610      3,126,387 <br/>Septerna                     SEPN        14.10        172,228 <br/>Sera Prognostics             SERA         4.61        120,010 <br/>SharpLink Gaming             SBET       0.3317        458,592 <br/>Spero Therapeutics           SPRO       0.7800        309,185 <br/>Starbox Group Cl A           STBX       0.3563        321,781 <br/>Stardust Power               SDST       0.7624      4,202,259 <br/>Steven Madden                SHOO        36.91        939,770 <br/>TNF Pharmaceuticals          TNFA       0.6400        194,319 <br/>TTEC Holdings                TTEC         3.50        103,444 <br/>Third Harmonic Bio           THRD         4.89         82,219 <br/>374Water                     SCWO       0.4401        199,203 <br/>Universe Pharmaceuticals     UPC        0.2723      1,608,501 <br/>Upstream Bio                 UPB          8.36        296,705 <br/>Utah Medical Products        UTMD        59.74         16,596 <br/>Vision Marine Techs          VMAR         1.12      1,213,618 <br/>Vodafone Group ADR           VOD          8.00     25,411,851 <br/>Windtree Therapeutics        WINT       0.1064      3,101,819 <br/>XBiotech                     XBIT         3.25         37,405 <br/>Zentalis Pharmaceuticals     ZNTL         1.61      1,334,389 <br/> <br/> <br/> <br/> <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009893:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009897:0",
            "title": "Houston Ship Channel Congested as Fog Continues to Hamper Vessel Movements — OPIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marine vessel traffic congestion was reported in the Houston Ship Channel as the region experienced fog and reduced visibility, which has hampered vessel movements over the past week.</p><p class=\"\">\"Areas of traffic congestion in the upper channel have developed following extended reduced visibility fog conditions,\" the U.S. Coast Guard on Tuesday, adding that it would \"meter traffic check in the upper channel and departing the Intracoastal Waterway.\"</p><p class=\"\">Houston and Galveston pilots have suspended and resumed boardings off and on starting at the end of January and into the start of February with dense fog hitting the region.</p><p class=\"\">Marine fuel suppliers in the U.S. Gulf Coast have warned that the fog season could result in delays for ships bunkering in the region and put days of notice between five to seven for very low sulfur fuel oil and high sulfur fuel oil.</p><p class=\"\">This content was created by Oil Price Information Service, which is operated by Dow Jones &amp; Co. OPIS is run independently from Dow Jones Newswires and The Wall Street Journal.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Reporting by Eric Wieser, ewieser@opisnet.com; Editing by Tom Sosnowski,   tsosnowski@opisnet.com and Editing by Michael Kelly, mkelly@opisnet.com</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009897:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}