{
    "data": [
        {
            "id": "DJN_DN20250205002100:0",
            "title": "Ericsson appoints Charlotte Levert as Chief People Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ericsson appoints Charlotte Levert as Chief People Officer</p><p class=\"\">PR Newswire</p><p class=\"\">STOCKHOLM, Feb. 5, 2025</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Effective as of February 10, 2025   </li><li class=\"listItem-bmN0_SHH\">Becomes member of Ericsson's Executive Team, reporting to the CEO </li></ul><p class=\"\">STOCKHOLM, Feb. 5, 2025 /PRNewswire/ — Ericsson  today announces the appointment of Charlotte Levert as its new Chief People Officer, Senior Vice President, and Head of Group Function People. Charlotte Levert who is currently Vice President and Head of People Business Area Cloud and Software Services will replace MajBritt Arfert, whose departure Ericsson announced in October 2024. Charlotte Levert will take up her new position on February 10 and will be based in Sweden.</p><p class=\"\">Charlotte Levert has held executive positions within Ericsson across several business areas. She has most recently held the position of Head of People Business Area Managed Services. Before joining Ericsson, Charlotte Levert was Head of HR Sweden &amp; Global HR business partner at Tieto and has held various senior management positions within human resources. She holds a Bachelor in Business Management &amp; Human Resources.</p><p class=\"\">Börje Ekholm, President and CEO of Ericsson, says: \"Charlotte will be an integral part as we are entering the next chapter of Ericsson's strategy and in the continued evolution of the People agenda. She brings a strong track record from different organizations including different parts of Ericsson and I'm very much looking forward to having Charlotte join the Executive Team.\"</p><p class=\"\">Commenting on the appointment, Charlotte Levert says: \"I am truly honored to take on this role and grateful for the trust. Working at Ericsson means we all get the chance to be part of shaping the future. I am looking forward to co-creating a future-proof organization and where Ericsson remains a great place to work.\"</p><p class=\"\">In October 2024 Ericsson announced that MajBritt Arfert would step down after having been with Ericsson for over 38 years and a member of the Company's Executive Team since the autumn of 2016. MajBritt Arfert will be available for Ericsson during the spring and leave Ericsson at the end of May 2025.</p><p class=\"\">NOTES TO EDITORS:</p><p class=\"\">FOLLOW US:</p><p class=\"\">Subscribe to Ericsson press releases here</p><p class=\"\">Subscribe to Ericsson blog posts here</p><p class=\"\">https://twitter.com/ericsson</p><p class=\"\">https://www.facebook.com/ericsson</p><p class=\"\">https://www.linkedin.com/company/ericsson</p><p class=\"\">MORE INFORMATION AT:</p><p class=\"\">Ericsson Newsroom</p><p class=\"\">media.relations@ericsson.com  (+46 10 719 69 92)</p><p class=\"\">investor.relations@ericsson.com  (+46 10 719 00 00)</p><p class=\"\">ABOUT ERICSSON:</p><p class=\"\">Ericsson's high-performing networks provide connectivity for billions of people every day. For nearly 150 years, we've been pioneers in creating technology for communication. We offer mobile communication and connectivity solutions for service providers and enterprises. Together with our customers and partners, we make the digital world of tomorrow a reality. www.ericsson.com</p><p class=\"\">This information was brought to you by Cision http://news.cision.com</p><p class=\"\">https://news.cision.com/ericsson/r/ericsson-appoints-charlotte-levert-as-chief-people-officer, c4100082</p><p class=\"\">The following files are available for download:</p><p class=\"\">https://mb.cision.com/Main/15448/41000  Ericsson appoints Charlotte Levert as <br/>82/3244109.pdf                          Chief People Officer</p><p class=\"\">View original content:https://www.prnewswire.com/news-releases/ericsson-appoints-charlotte-levert-as-chief-people-officer-302368573.html</p><p class=\"\">SOURCE Ericsson</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002100:0/",
            "pub_date": "2025-02-05 15:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002101_20250205002101:0",
            "title": "Carabao Group Target Price Lowered to THB71.75 From THB95.00 by Maybank Securities (Thailand) >CBG.TH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002101_20250205002101:0/",
            "pub_date": "2025-02-05 15:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002101_20250205002102:0",
            "title": "Carabao Group Cut to Hold From Buy by Maybank Securities (Thailand) >CBG.TH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002101_20250205002102:0/",
            "pub_date": "2025-02-05 15:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002103:0",
            "title": "Santander's Results, Guidance, Return Plans All Look Strong — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Santander posted a strong set of fourth-quarter results alongside guidance for 2025 and plans for capital returns to shareholders that are better than expected, Barclays's Cecilia Romero Reyes and Paola Sabbione say in a research note. The Spanish bank reported quarterly net profit and revenue that exceeded consensus forecasts, with results in Spain, Mexico, Brazil and the U.S. that were better than anticipated, Barclays says. The group's 2025 target for return on tangible equity--a profitability measure--of more than 17% is at the high end of previous guidance. Moreover, its intention to return 10 billion euros through buybacks is ahead of consensus expectations of 6 billion euros, according to Barclays. (adria.calatayud@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002103:0/",
            "pub_date": "2025-02-05 15:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002104:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0748 GMT - Santander posted a strong set of fourth-quarter results alongside guidance for 2025 and plans for capital returns to shareholders that are better than expected, Barclays's Cecilia Romero Reyes and Paola Sabbione say in a research note. The Spanish bank reported quarterly net profit and revenue that exceeded consensus forecasts, with results in Spain, Mexico, Brazil and the U.S. that were better than anticipated, Barclays says. The group's 2025 target for return on tangible equity--a profitability measure--of more than 17% is at the high end of previous guidance. Moreover, its intention to return 10 billion euros through buybacks is ahead of consensus expectations of 6 billion euros, according to Barclays. (adria.calatayud@wsj.com)</p><p class=\"\">0740 GMT - Investors could be concerned about Nissan's future as its board is planning to reject Honda's merger terms, Morningstar analyst Vincent Sun says. Nissan would face pressure surviving amid stiff competition in the U.S. and China, especially as it has a larger risk exposure to U.S. tariffs on Mexico than Honda and Toyota, the analyst says. However, even if the merger goes through, that wouldn't solve the challenges the two companies face. Both carmakers lack compelling EV offerings, and the combined entity would need to build a new EV model pipeline, he says. The two could benefit from larger scale and cost synergy, but that would take time to realize, Sun says. In any case, Nissan would find it difficult to \"play a smaller role in the new entity rather than standing on an equal footing with Honda,\" he adds. (sherry.qin@wsj.com)</p><p class=\"\">0735 GMT - The FTSE 100 is expected to open 24 points lower, or 0.3%, according to IG. The index closed down 12 points, or 0.2%, to 8570 points on Tuesday. \"On the equities front, sentiment is much less cheery this morning as Google [parent Alphabet] and AMD results released after the bell didn't enchant investors,\" Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Meanwhile, safe havens remain in demand on growing global uncertainties under President Trump's \"hectic lead,\" she says. On the economic data front, the focus will be on U.S. ADP private payrolls at 1315 GMT and U.S. ISM services at 1500 GMT. (renae.dyer@wsj.com)</p><p class=\"\">0733 GMT - The FTSE 100 is expected to open 24 points, or 0.3%, lower, according to IG. The index closed down 12 points, or 0.2%, to 8570 points Tuesday. \"On the equities front, sentiment is much less cheery this morning as Google [parent Alphabet] and AMD results released after the bell didn't enchant investors,\" Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Meanwhile, safe havens remain in demand on growing global uncertainties under U.S. President Trump's \"hectic lead,\" she says. On the economic data front, the focus will be on U.S. ADP private payrolls at 1315 GMT and U.S. ISM services at 1500 GMT. (renae.dyer@wsj.com)</p><p class=\"\">0730 GMT - Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0657 GMT - Grab's growth drivers are intact, and its adjusted Ebita will likely surge in 2025, driven by margin expansion, HSBC analysts write in a note. Grab is likely to strengthen its leadership position in ride-hailing and deliveries, as it invests into products to help expand its total addressable market with affordable products, they say. However, as the priority will be on new product initiatives, cross-selling and lending products, HSBC trims earlier margin estimates and reduces its adjusted Ebitda projection by 2%-5% for 2025-2026. HSBC lowers its target price to $5.45 from $5.50 but upgrades its stock rating to buy from hold as the stock offers 20% upside, and valuations have become attractive after the recent price correction. (kimberley.kao@wsj.com)</p><p class=\"\">0655 GMT - Chinese AI company DeepSeek's breakthrough is unlikely to hurt demand in the short-term, although the market will likely cut multiples to price on uncertainties in the longer term, according to Julius Baer analysts in an emailed commentary. The market is debating on the long-term impact, as optimists argue that a lower entry barrier would attract new players, which should boost semiconductor demand, they write. \"We do not expect much weakness in the near-term demand,\" the analysts note. They add that long-term demand will be determined by changes in AI-driven computing needs, such as inference, noting that such demand could offset the possibly lower computing demand in training. DeepSeek's development marks a major evolution, though not entirely a revolution, in artificial intelligence, they say. (tracy.qu@wsj.com)</p><p class=\"\">0649 GMT - Thai Credit Bank appears confident in lowering credit costs in 2025, CGS International's Weerapat Wonk-Urai says, citing management commentary at an analysts' briefing. Management highlighted the bank's improving debt collection capabilities, supported by its front office staff helping with loan collections as soon as the loans become overdue, the analyst says in a research report. Also, the bank sold non-performing loans worth THB1.9 billion last year and plans to sell THB1.4 billion worth of NPLs this year, the analyst adds. The brokerage raises the stock's target price to THB26.12 from THB26.00 with an unchanged add rating. Shares are 1.0% lower at THB19.00. (ronnie.harui@wsj.com)</p><p class=\"\">0511 GMT - The U.S. Postal Services will likely need time to sort out how to implement new the tariff policy before resuming acceptance of Chinese packages, according to Chelsey Tam, senior equity analyst at Morningstar in an email. The process poses a significant challenge, given that in 2024, an estimated 4 million daily packages arrived in the U.S. under the de minimis rule, which allows low-value shipments to bypass duties and custom scrutiny, Tam says. The Trump administration revoked this exemption for China as part of broader tariff measures. Among Chinese e-commerce players, PDD Holdings will be hurt as its overseas e-commerce platform Temu has a significant exposure in the U.S., the analyst notes. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002104:0/",
            "pub_date": "2025-02-05 15:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002106_20250205002107:0",
            "title": "Banca Generali Target Raised to EUR56.00 From EUR45.80 by Deutsche Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002106_20250205002107:0/",
            "pub_date": "2025-02-05 15:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002106_20250205002106:0",
            "title": "Banca Generali Raised to Buy From Hold by Deutsche Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002106_20250205002106:0/",
            "pub_date": "2025-02-05 15:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463841:0",
            "title": "Chinese Shares Mixed Following Lunar New Year Holidays Amid Rising China-US Trade Conflict",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chinese shares were mixed on Wednesday after returning to trade from the Lunar New Year holidays, as the market weighed the impact of the rising trade conflict between the US and China. </p><p class=\"\">The Shanghai Composite Index, the main gauge of Chinese stocks, was down 0.7% to 3,229.49. The Shenzhen Component Index ticked up 8.16 points to 10,164.22. </p><p class=\"\">China has filed a complaint against the US with the World Trade Organization over the latter's imposition of a 10% tariff on Chinese products. China also retaliated with tariffs of up to 15% on some US products, imposed sanctions on Calvin Klein maker PVH and biotech firm Illumina, and launched a probe into Google over alleged antitrust violations. </p><p class=\"\">Meanwhile, the US is considering whether to place Chinese e-commerce giants Shein and Temu on the Department of Homeland Security's forced labor list. Both Shein and Temu deny any involvement in forced labor. </p><p class=\"\">In company news, BAIC BluePark New Energy Technology  subsidiary Beijing Auto BluePark New Energy Technology logged significant jumps in production and sales in January. Shares of the automaker closed 3% higher Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463841:0-chinese-shares-mixed-following-lunar-new-year-holidays-amid-rising-china-us-trade-conflict/",
            "pub_date": "2025-02-05 15:48:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002109_20250205002109:0",
            "title": "Ericsson Appoints Charlotte Levert as Chief People Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002109_20250205002109:0/",
            "pub_date": "2025-02-05 15:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002108:0",
            "title": "ASSA ABLOY: Quarterly Report Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ASSA ABLOY: Quarterly Report Q4 2024</p><p class=\"\">PR Newswire</p><p class=\"\">STOCKHOLM, Feb. 5, 2025</p><p class=\"\">STOCKHOLM, Feb. 5, 2025 /PRNewswire/ --</p><p class=\"\">Margin target reached for year 2024</p><p class=\"\">Fourth quarter</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales increased by 7% to SEK 39,575 M (36,970), with organic growth   of 0% (0) and acquired net growth of 6% (11). Exchange rates affected   sales by 1% (1).   </li><li class=\"listItem-bmN0_SHH\">Organic sales growth was strong in Global Technologies, good in Americas,   stable in EMEIA, while organic sales declined in Entrance Systems and   declined significantly in Asia Pacific.   </li><li class=\"listItem-bmN0_SHH\">Eight acquisitions with combined annual sales of more than SEK 1 bn were   completed in the quarter.   </li><li class=\"listItem-bmN0_SHH\">Operating income1 (EBITA) increased by 15% to a record SEK 6,898 M   (6,008) with an operating margin of 17.4% (16.2).   </li><li class=\"listItem-bmN0_SHH\">Operating income1 (EBIT) increased by 14% and amounted to a record of SEK   6,529 M (5,722), with an operating margin of 16.5% (15.5).   </li><li class=\"listItem-bmN0_SHH\">Net income1 amounted to a record SEK 4,214 M (3,969).   </li><li class=\"listItem-bmN0_SHH\">Earnings per share1 amounted to SEK 3.81 (3.56).   </li><li class=\"listItem-bmN0_SHH\">Record operating cash flow of SEK 8,010 M (7,315).   </li><li class=\"listItem-bmN0_SHH\">The Board of Directors proposes a dividend of SEK 5.90 (5.40) per share   for 2024, to be distributed in two equal installments. </li></ul><p class=\"\">Sales and income</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                    Fourth quarter             January-December <br/>------------------  ----------------  -------  ------------------  ------- <br/>                    2023     2024     &lt;DELTA&gt;  2023      2024      &lt;DELTA&gt; <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Sales, SEK M        36,970   39,575   7 %      140,716   150,162   7 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Of which: <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Organic growth      133      --112    0 %      3,393     --1,132   --1% <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Acquisitions and <br/> divestments        3,572    2,215    6 %      10,651    11,326    8 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Exchange rate <br/> effects            349      502      1 %      5,879     --748     0 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Operating income <br/> (EBIT)(1) , SEK <br/> M                  5,722    6,529    14 %     22,185    24,296    10 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Operating margin <br/> (EBITA)(1) , %     16.2 %   17.4 %            16.5 %    17.1 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Operating margin <br/> (EBIT)(1) , %      15.5 %   16.5 %            15.8 %    16.2 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Income before <br/> tax(1) , SEK M     4,879    5,684    16 %     19,654    20,914    6 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Net income(1) , <br/> SEK M              3,969    4,214    6 %      15,049    15,636    4 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Operating cash <br/> flow, SEK M        7,315    8,010    10 %     25,232    23,052    --9% <br/>------------------  -------  -------  -------  --------  --------  ------- <br/>Earnings per <br/> share(1) , SEK     3.56     3.81     7 %      13.54     14.09     4 % <br/>------------------  -------  -------  -------  --------  --------  ------- <br/> </pre><p class=\"\">(1) Excluding items affecting comparability. Please see the section \"Items affecting comparability\" in the report for further details about the financial effects in 2024. For information about items affecting comparability in 2023, please see the Year-end report 2023, available at assaabloy.com.</p><p class=\"\">Comments by the President and CEO</p><p class=\"\">Margin target reached for year 2024</p><p class=\"\">As we close 2024, I am proud to share that ASSA ABLOY showed resilience and agility in a mixed market environment, concluding the year with solid performance. For the full year, sales grew by 7%, reflecting strong contribution from acquisitions of 8%, and a small organic sales decline of 1%. Our operating margin expanded to 16.2%, within the target range of 16-17%.</p><p class=\"\">In the fourth quarter of 2024, organic sales were stable, with net positive contribution from acquisitions of 6% and currency effects of 1%. Global Technologies delivered strong organic growth of 5% with strong performance in most business areas and with Physical Access Control having comparable figures at normalized levels for the full quarter. Americas delivered good organic growth of 2%, with strong growth in the North America Non-Residential segment and in Latin America. Organic sales were stable in EMEIA with commercial segments compensating for continued weak residential demand. Similarly, weak residential markets and weak demand for loading docks resulted in an organic sales decline of 2% in Entrance Systems. Asia Pacific's organic sales declined significantly by 11%, mainly due to very weak demand in China.</p><p class=\"\">The operating profit for the quarter increased by 14% to a record SEK 6,529 M with a corresponding margin of 16.5% (15.5). The operating leverage was very strong at 120 bps, driven by continued price/cost tailwind and strong operational execution, overcompensating for dilution from acquisitions. The operating cash flow increased by 10% in the quarter to a record SEK 8,010 M with a cash conversion of 141% (150).</p><p class=\"\">Focus on accelerating our sales growth</p><p class=\"\">Accelerating organic growth remains a key priority going forward. An important part of our strategy is upgrading the installed base with innovative digital and electromechanical products and solutions. We invest 4% of annual sales in R&amp;D which allows us to strengthen our offering and drive the transition forward. Electromechanical products and solutions are the most important growth driver in our portfolio, with currency adjusted growth of 8% in 2024 and an annual growth rate of 9% in the last ten years in our regional divisions. Through upgrades we can support customers with enhanced security and convenience, but also grow recurring revenue streams. Recurring revenue continues to be a key driver for growth with subscription-based models, service agreements, and digital solutions like remote monitoring and mobile access. In 2024, sales of our subscription-based solutions grew by 18%. Our decentralized organization and region-specific product development provide further opportunities in the emerging markets, that only represent 13% of our sales. In 2024, our currency adjusted sales in emerging markets excluding China grew by 10%.</p><p class=\"\">A record 26 acquisitions were completed in 2024, adding annualized sales close to SEK 8 bn. In the fourth quarter, we completed eight acquisitions. Acquisitions remain a key driver for growth and the pipeline remains strong.</p><p class=\"\">By leveraging our market-leading products and solutions with our local knowledge and global presence, we are confident in our ability to drive continued value for our customers, employees and shareholders. Finally, I would like to thank my colleagues for their outstanding contributions during the year and all our stakeholders for your trust.</p><p class=\"\">Stockholm, February 5, 2025</p><p class=\"\">Nico Delvaux</p><p class=\"\">President and CEO</p><p class=\"\">Further information can be obtained from:</p><p class=\"\">Nico Delvaux,</p><p class=\"\">President and CEO, tel. no: +46 8 506 485 82</p><p class=\"\">Erik Pieder,</p><p class=\"\">Executive Vice President and CFO, tel.no: +46 8 506 485 72</p><p class=\"\">Björn Tibell,</p><p class=\"\">Head of Investor Relations, tel. no: +46 70 275 67 68</p><p class=\"\">e-mail: bjorn.tibell@assaabloy.com</p><p class=\"\">ASSA ABLOY is holding a telephone and web conference at 09.00 on February 5, 2025 which can be followed online at assaabloy.com/investors.</p><p class=\"\">It is possible to submit questions by telephone on: 08--505 100 31, +44 207 107 0613 or +1 631 570 5613</p><p class=\"\">This information is information that ASSA ABLOY AB is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out above, at 08.00 CET on February 5, 2025.</p><p class=\"\">This information was brought to you by Cision http://news.cision.com.</p><p class=\"\">https://news.cision.com/assa-abloy/r/quarterly-report-q4-2024,c4100644</p><p class=\"\">The following files are available for download:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>https://mb.cision.com/Main/7333/4100644/3246382.pdf      The full report (PDF) <br/>https://news.cision.com/assa-abloy/i/assa-abloy-logo-do  ASSA ABLOY logo door <br/>or,c3374416 <br/> </pre><p class=\"\">View original content:https://www.prnewswire.com/news-releases/assa-abloy-quarterly-report-q4-2024-302368577.html</p><p class=\"\">SOURCE ASSA ABLOY</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002108:0/",
            "pub_date": "2025-02-05 15:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002109_20250205002111:0",
            "title": "Ericsson: Levert Is Currently Head of People Business Area Cloud and Software Services",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002109_20250205002111:0/",
            "pub_date": "2025-02-05 15:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446687:0",
            "title": "Indian Rupee Nears Record Low Ahead of RBI Rate Decision",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Indian rupee weakened by 0.2% to 87.23 per USD, nearing its record low of 87.28 reached on Monday.</p><p class=\"\">Expectations of an interest rate cut at the Reserve Bank of India's policy meeting on Friday pressured the currency, alongside routine dollar demand from importers.</p><p class=\"\">Persistent foreign fund outflows, as investors shifted towards higher-yielding assets, added to the downward pressure.</p><p class=\"\">Additionally, a stronger US dollar, bolstered by resilient economic data and hawkish signals from Federal Reserve officials, further weighed on the rupee.</p><p class=\"\">Sentiment was also dampened by concerns over potential US tariff increases on key Indian exports, which could hurt trade flows and strain the currency further.</p><p class=\"\">Amid these pressures, Reuters reported that the central bank likely intervened to support the rupee, responding to broad-based interbank dollar demand.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446687:0-indian-rupee-nears-record-low-ahead-of-rbi-rate-decision/",
            "pub_date": "2025-02-05 15:42:21",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002063:0",
            "title": "GSK Expects Further Profit Growth After Beating Market Views",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Helena Smolak</p><p class=\"\">GSK expects its sales and profit to grow in the new year after cancer treatments lifted sales and profit ahead of analysts' expectations in the fourth quarter despite lower vaccines sales on weak demand in the U.S.</p><p class=\"\">The British pharmaceutical giant said Wednesday that for 2025 it expects sales to grow 3% to 5%. It also targets core operating profit and core earnings per share to grow between 6% and 8%. Targets are at constant exchange rates.</p><p class=\"\">This compares with 2024 sales growth of 7%, core operating profit growth of 11% and core earnings per share growth of 10%.</p><p class=\"\">Its fourth-quarter sales rose 4% at constant currencies to 8.12 billion pounds ($10.13 billion), above the 7.83 billion pounds that analysts had expected, according to a consensus polled by Visible Alpha.</p><p class=\"\">Core operating profit, closely watched by analysts and investors, fell 10% at constant currencies to 1.43 billion pounds on lower-than-anticipated vaccine sales. Analysts had expected 1.385 billion pounds.</p><p class=\"\">Its core earnings per share fell 10% at constant currencies to 23.2 pounds, above analysts' expectations of 20.6 pounds.</p><p class=\"\">Write to Helena Smolak at helena.smolak@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002063:0-gsk-expects-further-profit-growth-after-beating-market-views/",
            "pub_date": "2025-02-05 15:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463842:0",
            "title": "Yotrio to Get 98 Million Yuan From Selling Property to Local Government",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Yotrio Group  expects to receive 98.4 million yuan in compensation to transfer a property in Linhai City, China to the local government, according to a Shenzhen Stock Exchange disclosure on Jan. 27. </p><p class=\"\">The industrial property, including land and factories, has a total building area of ​​13,045.55 square meters and a land area of ​​23,677.17 square meters, the Chinese outdoor living product manufacturer said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463842:0/",
            "pub_date": "2025-02-05 15:43:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002074:0",
            "title": "TotalEnergies Earnings Jump On Quarter",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Whittaker</p><p class=\"\">TotalEnergies reported a 72% jump on its fourth-quarter net profit, boosted by strong earnings in its integrated LNG and integrated power divisions, but still below analysts' expectations.</p><p class=\"\">Net profit for the three months ended Dec. 31 rose to $3.96 billion, compared with analysts expectations of $4.21 billion, according to a Visible Alpha consensus.</p><p class=\"\">The French oil and gas company also said it would target share buybacks worth 2 billion pounds ($2.50 billion) a quarter in 2025.</p><p class=\"\">Write to Adam Whittaker at adam.whittaker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002074:0-totalenergies-earnings-jump-on-quarter/",
            "pub_date": "2025-02-05 15:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002072:0",
            "title": "SSE Renewables Output Rose; Issues EPS Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anthony O. Goriainoff</p><p class=\"\">SSE said renewables energy output over its first three fiscal quarters rose and issued adjusted earnings per share guidance for the full fiscal year.</p><p class=\"\">The U.K. energy group said Wednesday that renewables output over the nine-month period to Dec. 31 rose 26% to 9,253 gigawatt hours, reflecting a good operational performance against variable weather conditions, particularly in the third quarter.</p><p class=\"\">SSE Thermal's output in the same period rose to 12,459 GWh from 10,797 GWh in the year-prior period.</p><p class=\"\">SSE didn't provide full earnings guidance, but said that for the year ending March 31 it expects adjusted earnings per share within a range of 154 to 163 pence ($1.92-$2.03). In fiscal 2024 adjusted EPS was 158.5 pence.</p><p class=\"\">In November, SSE said it was on track to deliver fiscal 2027 adjusted EPS of between 175 pence and 200 pence.</p><p class=\"\">\"As we look to the opportunities presented by decarbonization our focus remains on capital discipline, strategic delivery and the efficient operation of our value-creating assets,\" the company said.</p><p class=\"\">Write to Anthony O. Goriainoff at anthony.orunagoriainoff@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002072:0-sse-renewables-output-rose-issues-eps-guidance/",
            "pub_date": "2025-02-05 15:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446688:0",
            "title": "Kenya Private Sector Growth at 3-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Stanbic Bank Kenya PMI edged lower to 50.5 in January 2025 from 50.6 in December 2024.</p><p class=\"\">This marked the fourth consecutive month of expansion, though at the weakest pace since October, as the growth momentum for output and new orders showed signs of fading, with output growth reaching its slowest pace in the current four-month expansionary period.</p><p class=\"\">Moreover, staffing numbers decreased marginally, breaking a three-month streak of employment growth, as most firms opted to keep staffing levels unchanged.</p><p class=\"\">On the price front, input costs continued to rise at a solid pace, largely due to higher taxes on imported materials.</p><p class=\"\">Output costs also increased, though at a slower rate than in the previous three months.</p><p class=\"\">Finally, firms remained cautious about the future, with expectations for business activity over the coming year remaining among the weakest on record.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446688:0-kenya-private-sector-growth-at-3-month-low/",
            "pub_date": "2025-02-05 15:44:30",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002085:0",
            "title": "Greencore Group Targets Up to 5% Revenue Growth Over Medium-Term",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Ian Walker</p><p class=\"\">Greencore Group is targeting up to 5% revenue growth over the medium term and said it expects to meet market expectations for fiscal 2025.</p><p class=\"\">The U.K. manufacturer of convenience foods on Wednesday set a target to grow revenue between 3% and 5% over the medium term, and for adjusted operating profit to rise more than 7%. It also set a return of invested capital target of more than 15%.</p><p class=\"\">The company is hosting a capital markets event where it will set out how the board plans to strengthen the core business further and grow and expand the group, including through mergers and acquisitions. It will also discuss the board's approach to capital allocation and delivering shareholder returns.</p><p class=\"\">The company has provided a sales consensus for the year ending in September of 1.88 billion pounds ($2.35 billion) and adjusted operating profit of 105.1 million pounds.</p><p class=\"\">This compares with revenue of 1.81 billion pounds and adjusted operating profit of 97.5 million pounds for the year ended Sept. 27, 2024.</p><p class=\"\">Write to Ian Walker at ian.walker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002085:0/",
            "pub_date": "2025-02-05 15:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002080:0",
            "title": "French Industry Ends 2024 in the Doldrums",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joshua Kirby</p><p class=\"\">French factory production unexpectedly dropped at the end of the year, contributing to a backsliding in the eurozone's second-largest economy, with few signs of a rapid rebound at the start of 2025.</p><p class=\"\">Total manufacturing output was 0.7% lower on month in December, reversing a slight increase in November, statistics agency Insee said Wednesday. That was a worse result than the stagnation forecast by economists, according to a poll compiled by The Wall Street Journal.</p><p class=\"\">The latest activity surveys meanwhile suggest French manufacturers remained in a deep slump in January.</p><p class=\"\">Still, there is hope that greater political stability might brighten the mood for industrial employers as the year progresses. Prime Minister Francois Bayrou is expected to survive a confidence vote in the French legislature later Wednesday, having earlier this week forced through a budget after months of delays.</p><p class=\"\">Write to Joshua Kirby at joshua.kirby@wsj.com; @joshualeokirby</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002080:0/",
            "pub_date": "2025-02-05 15:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:3ba965193094b:0",
            "title": "Accumulate Nestle India; target of Rs 2606: Prabhudas Lilladher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Prabhudas Lilladher's research report on Nestle India</p><p class=\"\">We attended the Nestle India analyst meet where the company has given cautiously optimistic outlook on growth, notwithstanding near-term demand pressures led by high inflation and urban distress. NEST will focus on volume led growth with range margin margins as current levels seem optimal post 600bps expansion since 2016. NEST continues to innovate with rising share of NPD (6-6.5% of sales) and is looking at major gains in Maggi, Chocolates, Beverages and OOH consumption. We expect growth rates to accelerate given capacity expansion (Rs55bn in four years) and benefit from JV with Dr Reddy’s in the medical nutrition business. We cut our FY25/FY26/FY27 estimates by 2.8%/1.9%/2% given 1) tepid demand in urban India (75%+ of sales) 2) margin headwinds given steep inflation in input costs of cereals, coffee &amp; cocoa and 2) low growth potential in Infant nutrition (~30% of sales).</p><p class=\"\">Outlook</p><p class=\"\">We cut our DCF based target price to Rs. 2606 (Rs.2689 earlier) valuing it at 68x Mar’27 EPS. We would keenly watch out for the NEST’s strategy under the new management in coming few quarters. Retain Accumulate.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">Nestle India - 05022025 - prabhu</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:3ba965193094b:0-accumulate-nestle-india-target-of-rs-2606-prabhudas-lilladher/",
            "pub_date": "2025-02-05 15:32:27",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463839:0",
            "title": "JTC Forecasts FY24 Results in Line with Market Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JTC  expects full-year 2024 results to be in line with market expectations, according to a Wednesday filing. </p><p class=\"\">The professional services company said it achieved in the 12 months ended Dec. 31, 2024, its objective under the Cosmos era to grow its net organic revenue by at least 10%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463839:0/",
            "pub_date": "2025-02-05 15:36:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463827:0",
            "title": "Union Properties Cuts Debt, Secures New Funding",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Union Properties (DFM:UPP) said Wednesday it reduced its legacy debt as it implements its recovery plan and debt restructuring strategy. </p><p class=\"\">The United Arab Emirates-based property developer shrunk its debt to 575 million Emirati dirhams as of the end of 2024 from 1.47 billion dirhams at the end of 2022, with a further 150 million-dirham reduction targeted by the end of the first quarter of 2025. </p><p class=\"\">The company also secured 150 million dirhams in new bank loans to fund investments over the next 18 months, expecting to generate 40 million dirhams in annual recurring income.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463827:0/",
            "pub_date": "2025-02-05 15:37:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002019:0",
            "title": "Future PLC Expects to Meet Market Views on Continued U.S. Progress",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Michael Susin</p><p class=\"\">Future said it is on track to achieve market expectations for fiscal 2025 after its first-quarter performance was in line with expectations.</p><p class=\"\">The U.K. publishing company on Wednesday said that its performance for the quarter ended Jan. 31 has been as expected, without disclosing any figures. Future said the performance was supported by continued improvement in the U.S. digital advertising and e-commerce segments, with both areas recording growth on year.</p><p class=\"\">The company said the magazines business remained more resilient, led by premium titles, while the U.K. advertising backdrop continues to be challenging.</p><p class=\"\">For the fiscal year as a whole, Future said it is confident it can meet the company-compiled consensus of revenue at 776.9 million pounds ($969.6 million), and adjusted operating profit--which strips out exceptional and other one-off items--at 217.8 million pounds.</p><p class=\"\">Write to Michael Susin at michael.susin@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002019:0/",
            "pub_date": "2025-02-05 15:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002030:0",
            "title": "Investors Could Be Concerned About Nissan's Future After Potential Rejection of Merger Terms — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Investors could be concerned about Nissan's future as its board is planning to reject Honda's merger terms, Morningstar analyst Vincent Sun says. Nissan would face pressure surviving amid stiff competition in the U.S. and China, especially as it has a larger risk exposure to U.S. tariffs on Mexico than Honda and Toyota, the analyst says. However, even if the merger goes through, that wouldn't solve the challenges the two companies face. Both carmakers lack compelling EV offerings, and the combined entity would need to build a new EV model pipeline, he says. The two could benefit from larger scale and cost synergy, but that would take time to realize, Sun says. In any case, Nissan would find it difficult to \"play a smaller role in the new entity rather than standing on an equal footing with Honda,\" he adds. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002030:0/",
            "pub_date": "2025-02-05 15:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463840:0",
            "title": "Pandora to Kick Off DKK4 Billion Share Repurchase Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pandora  will on Thursday initiate its 4 billion-Danish-krone share buyback program, which is scheduled to run until Jan. 30, 2026. </p><p class=\"\">The Danish jewelry maker tapped Nordea for the first tranche, which includes the repurchase of 1.3 billion kroner of shares until June 6, according to a Wednesday release. </p><p class=\"\">The program, which will take place on Nasdaq Copenhagen, Cboe DXE, Turquoise Europe, and Aquis, will be conducted for its incentive programs, as well as its capital reduction.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463840:0/",
            "pub_date": "2025-02-05 15:40:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001898:0",
            "title": "Stronger Market Reaction Likely if U.S.-China Talks Fail to Deliver Results — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">0730 GMT - Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0717 GMT - The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p><p class=\"\">0714 GMT - The impact of Trump's 10% tariff on Chinese exports on China's GDP growth this year looks manageable, Bank of Singapore chief economist Mansoor Mohi-uddin writes in a note. If the 10% levy is maintained for the rest of 2025, that would shave around 0.5% off China's GDP growth, he says. But if tariffs are raised to 20% to 30%, that would likely drag China's economic growth this year to 4.0% from 5.0% last year, he adds. That said, Beijing's retaliation, with targeted tariffs aimed at U.S. exports amounting to only $14 billion, leaves the door open for a potential deal with Washington to avert a broader trade war, he adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0704 GMT - The 'tariff can' has just been kicked down the road, with the idea of imposing levies on U.S. imports from its two closest neighbours still not off the table entirely, says Pepperstone's Michael Brown. \"In fact, this whole saga could well rumble on until the start of April, when the review ordered by President Trump into U.S. trade policy is due to report back,\" the senior research strategist says in a note. Trump agreed to postpone the tariffs on Mexico and Canada for a month after talks with the leaders of both countries. \"Perhaps, it is at that point, that we will see tariffs shift from being used as a bargaining chip to further certain political aims, to actually being used as a measure to address trade imbalances,\" Brown says. (emese.bartha@wsj.com)</p><p class=\"\">0659 GMT - Japan, South Korea and Taiwan have dodged tariff bullets for now, but they shouldn't get too comfortable, Moody's Analytics economists say. The three appear obvious targets given their hefty trade surpluses with the U.S. One possible reason is security ties with the U.S. Another is the fact that Japan is among the U.S.'s biggest foreign investors. Korean and Taiwanese firms have been ramping up investment too. That's come at China's expense, aligning with the U.S. bid to curb its influence in supply chains, they add. But the mood could shift and tariffs could come. The economies also face collateral damage. Carmakers like Toyota and Kia have plants in Mexico, and Taiwanese and Korean chip and electronics producers in the U.S. face disruptions via trade barriers or surging production costs. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0649 GMT - South Korea's benchmark Kospi rose 1.1% to close at 2509.27 amid easing fears over U.S. tariffs. Foreign and institutional investors were net buyers. LG Energy Solution and Samsung SDI gained 3.6% and 3.4%, respectively, after the government prepared a new aid plan for the EV battery industry. Memory-chip maker SK Hynix added 4.0%. Mobile internet giant Kakao climbed 5.6% after agreeing to develop AI Products with OpenAI. Meanwhile, LG CNS, an IT service affiliate of LG Group, fell 9.9% on its stock exchange debut. USD/KRW settled 1.3% lower at 1,444.30 in Seoul onshore trading. South Korea's 10-year government bond yield was down 2.3 bps at 2.821%. (kwanwoo.jun@wsj.com)</p><p class=\"\">0518 GMT - Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0439 GMT - Japan's cash earnings jumped in December, while Moody's Analytics' Stefan Angrick sees little evidence of sustained real wage growth. At first glance, the data suggests things are turning around as monthly cash earnings rose solidly, the economist says, adding that the devil is in the details. Though nominal pay growth is picking up, the gains are uneven, and real cash earnings climbed only 0.6% on year, he says, describing it \"a far more modest gain than the glossy nominal figure.\" The pay bump was also driven significantly by temporary factors, such as bonuses. Wage growth is likely to improve despite strong headwinds expected in 2025, including, but not limited to, a potential inflation spike, he adds. Much depends on the spring wage negotiations. If pay gains come in below 5%, that could delay the rate hikes, he adds. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0422 GMT - Hong Kong PMI data show continued concern among private sector firms about the year ahead as global uncertainty rises. The headline S&amp;P Global PMI for January signaled only a modest improvement in business conditions and slipped to its lowest since September 2024. Weak external demand was the main growth constraint, says Tim Moore, economics director at S&amp;P Global Market Intelligence. \"Survey respondents noted subdued willingness to spend among clients amid concerns about the near-term global economic outlook, in particular the impact of potential U.S. tariffs.\" Export sales fell at the fastest pace since September 2024, while new business from Mainland China decreased to the greatest extent since April 2022. Despite an upturn in total new work, Hong Kong firms remain pessimistic about the year ahead, Moore says. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0402 GMT - Singapore dollar is steady against its U.S. counterpart in the Asian session amid caution over the latest tariffs from the U.S. and China. \"We are only at the beginning of the tariff saga,\" Maybank analysts say in an FX Research &amp; Treasury report. \"It would be wise to be slightly more cautious as there is a likely limit to how much the USD can weaken,\" the analysts say. USD/SGD is little changed at 1.3524. (ronnie.harui@wsj.com)</p><p class=\"\">0339 GMT - The Bank of Korea may cut its policy rate later this month despite January's pickup in domestic inflation, Barclays economist Bum Ki Son writes in a note. Headline inflation accelerated to 2.2% from 1.9% in December, but the BOK may focus on soft core inflation and weak domestic demand, Son says. Core inflation, which strips out volatile food and energy prices, ticked up to 1.9% from 1.8% in December. BOK policymakers see forex-related pressures as limited and oil prices as a one-off shock, he notes. \"As such, we believe inflation is unlikely to stop the BOK from cutting rates 25bp at its February meeting,\" he says. (kwanwoo.jun@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001898:0/",
            "pub_date": "2025-02-05 15:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446686:0",
            "title": "South Africa’s Private Sector Sinks Sharpest Since 2021",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global South Africa PMI fell to 47.4 in January 2025, down from 49.9 in December, marking the sharpest contraction in the private sector since July 2021.</p><p class=\"\">The decline was driven by weak client demand, leading to a sharp drop in new business at the fastest pace since March 2024.</p><p class=\"\">Consequently, businesses reduced output at the steepest rate in three-and-a-half years.</p><p class=\"\">Meanwhile, firms made progress in clearing backlogged work, prompting renewed job cuts and reductions in input purchases, particularly in services and construction.</p><p class=\"\">On a positive note, supply chain pressures eased, as delivery delays moderated to a nine-month low.</p><p class=\"\">Price pressures also softened, with input cost inflation slowing despite higher wages and import fees.</p><p class=\"\">This led to a more measured rise in selling prices compared to previous months.</p><p class=\"\">Looking ahead, business confidence improved, however, concerns over demand conditions persisted, limiting the extent of optimism.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446686:0-south-africa-s-private-sector-sinks-sharpest-since-2021/",
            "pub_date": "2025-02-05 15:31:06",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463829:0",
            "title": "IWOW Technology Buys Back 81,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IWOW Technology (SGX: NXR) repurchased 81,000 shares on Monday at SG$0.1897 each, totaling SG$15,368, according to a same-day filing on the Singapore Exchange. </p><p class=\"\">The company has now bought back 258,100 shares, or 0.1% of its issued stock, under its current buyback mandate which allows it to repurchase around 26.3 million shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463829:0/",
            "pub_date": "2025-02-05 15:31:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463838:0",
            "title": "GSK Commences GBP2 Billion Share Buyback Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GSK  announced a share buyback plan totaling 2 billion pounds sterling. </p><p class=\"\">The pharmaceutical giant said with its 2024 results on Wednesday that the program will run for the next 18 months.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463838:0/",
            "pub_date": "2025-02-05 15:31:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001933:0",
            "title": "German Bund Yields Fall, Tracking U.S. Treasury Yields Lower — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">German Bunds are running into resistance ahead of the yield lows of the year, but shaky risk sentiment and a sanguine European Central Bank wage tracker should keep the momentum going, says Commerzbank Research's Michael Leister. \"With the ongoing focus on trade wars and fragile risk sentiment we expect Bunds to stay bid,\" the head of interest rates strategy says in a note. That said, the air is getting thinner for Bunds as yields are approaching the lows recorded in the initial sessions of the year, Leister says. In addition, risk-off once again turns out to not be self-reinforcing, with equities stuck at the highs, he says. The 10-year German Bund yield falls 2.5 basis points to 2.374%, tracking U.S. Treasury yields lower, according to Tradeweb. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001933:0/",
            "pub_date": "2025-02-05 15:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}