{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308638:0",
            "title": "Evercore ISI Upgrades Juniper Networks to Outperform From In Line, Adjusts Price Target to $330 From $275",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marriott International  has an average rating of hold and mean price target of $286.39, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308638:0/",
            "pub_date": "2025-02-04 20:09:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004847:0",
            "title": "Trump Tariffs Delay Lets Stock Markets Breathe. Why China Could Change That and 4 Other Things to Know Today. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">It's starting to look like all those investors who never expected President Donald Trump to follow through on his biggest tariff threats were right.</p><p class=\"\">But that doesn't mean investors can just go back to the world of a month ago, when the chances of Trump cutting taxes and softening regulation seemed high while the risk of extreme new tariffs seemed remote. The fact that stocks finished Monday lower even after tariffs on Canada and Mexico were delayed at the last minute shows markets are not out of the woods yet.</p><p class=\"\">The additional 10% tariffs on China still took effect, and the world's second-biggest economy was quick to retaliate with levies on gas, coal, and machinery among other things. Other places, such as the European Union, will soon reach the top of Trump's to-do list — and it might not be quite so easy for them to strike a deal to avoid tariffs. And the possibility remains that import taxes on Canada and Mexico could still come into force next month.</p><p class=\"\">The good news is that the worst-case scenarios from tariffs — runaway inflation, recession, Federal Reserve interest-rate hikes — still seem overblown. Investors who woke up Monday wondering if it was time to get out of the market should be able to sleep easier. The bad news is that the market still has other problems — overreliance on technology stocks, the threat from Chinese artificial intelligence start-ups like DeepSeek, and historically high valuations, to name a few.</p><p class=\"\">The tariff threat isn't completely gone — U.K.-based Diageo, the maker of Don Julio tequila in Mexico, Crown Royal whiskey in Canada, and Guinness stout in Ireland said Tuesday that uncertainty means it can't provide financial guidance.</p><p class=\"\">Enjoy the relief for now, but more market turbulence has yet to come.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Brian Swint</li></ul><p class=\"\">***</p><p class=\"\">Beijing Retaliates as U.S. Levies Kick In</p><p class=\"\">The Trump administration's tariffs on China went into effect early Tuesday and Beijing immediately retaliated with levies of its own on U.S. goods. President Donald Trump paused the 25% tariffs he had announced on imports from Mexico and Canada for a month after meeting separately with the leaders of both nations Monday.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Additional 10% tariffs on goods from China took effect overnight. Beijing   announced import taxes of 15% on U.S. crude oil, machinery, and some cars,   as well as a 10% increase on coal and liquefied natural gas. It also   announced export controls on scarce materials critical for making   electronics.   </li><li class=\"listItem-bmN0_SHH\">Separately, China added Calvin Klein owner PVH Corp. and biotechnology   company Illumina to its unreliable entity list and opened an antitrust   probe into Google.   </li><li class=\"listItem-bmN0_SHH\">Canada's Prime Minister Justin Trudeau said Canada is implementing its   $1.3 billion border reinforcement plan -- increasing resources to stop   the flow of the drug fentanyl, and posting nearly 10,000 personnel at the   border. Mexico's President Claudia Sheinbaum Pardo is also moving 10,000   troops to the border.   </li><li class=\"listItem-bmN0_SHH\">Different views of tariffs have emerged within the administration.   Economic advisors such as Treasury Secretary Scott Bessent have   downplayed them. He described Trump's strategy as \"escalate to   de-escalate,\" implying levies are a negotiation tool. </li></ul><p class=\"\">What's Next: The delay of measures on Mexico and Canada was welcomed by investors but China may present a bigger problem ahead. Avoiding tariffs appears to be Trump's real plan, said Stifel's Brian Gardner, chief Washington policy strategist.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Matt Peterson , Janet H. Cho , and Brian Swint</li></ul><p class=\"\">***</p><p class=\"\">Musk's Effort to Erase Agency Independence Challenges Congress</p><p class=\"\">Elon Musk and President Donald Trump are shattering longstanding beliefs about the limits of presidential power, bringing to heel Washington agencies that have sought to operate with at least some independence from the White House. Some legal scholars and lawmakers see a constitutional crisis forming.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The moves could face court challenges and define the limits of   presidential power for years to come, experts said. If left standing,   Trump and Musk will have effectively found a back door way to seize   Congress's power to appropriate funds for the executive branch, making it   easier to cut the budget.   </li><li class=\"listItem-bmN0_SHH\">Musk's Department of Government Efficiency has effectively shut the U.S.   Agency for International Development, which provides humanitarian and   other foreign aid. The agency's website was pulled offline, and USAID   employees were told to stay home on Monday.   </li><li class=\"listItem-bmN0_SHH\">DOGE is pursuing the General Services Administration, the independent   agency that manages federal properties and office space and handles   billions of dollars in government contracts. DOGE has already canceled   some federal leases, and Musk has suggested that GSA could unilaterally   choose to stop billions in other payments.   </li><li class=\"listItem-bmN0_SHH\">Treasury Secretary Scott Bessent was named acting director of the   Consumer Financial Protection Bureau after former director Rohit Chopra   was fired. Bessent halted rule making, enforcement, and hiring. The   Securities and Exchange Commission's leaders told agency lawyers they had   to seek permission to launch probes. </li></ul><p class=\"\">What's Next: The State Department launched its own USAID page and Secretary Marco Rubio said he was acting director. The move would be contrary to the law that enabled the creation of USAID, said William Galston, a senior fellow at the Brookings Institution. The Supreme Court may ultimately have to decide.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Joe Light and Janet H. Cho</li></ul><p class=\"\">***</p><p class=\"\">New U.S. Sovereign Wealth Fund Could Be TikTok's Solution</p><p class=\"\">The U.S. is getting a sovereign-wealth fund, its first, after President Donald Trump directed the Treasury and Commerce Departments to create one. One beneficiary could be the video-sharing app TikTok, which Trump granted extra time to find a buyer to avoid a U.S. ban.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">In an Oval Office signing ceremony, Treasury Secretary Scott Bessent said   a sovereign-wealth fund would allow the U.S. government to make money by   investing some of its assets. About 90 state-owned investment funds   manage more than $8 trillion, the International Forum of Sovereign Wealth   Funds said.   </li><li class=\"listItem-bmN0_SHH\">Such funds operate as institutional money managers for their nations.   Among the biggest are sovereign-wealth funds run by the government of   China, which funded these vehicles beginning in 2007. According to   Foreign Policy magazine, the Chinese Investment Corp.'s funds total more   than $2 trillion in assets.   </li><li class=\"listItem-bmN0_SHH\">Sovereign-wealth funds act as savings funds for rich countries, as   stabilization funds for governments managing inconsistent revenue sources,   or as strategic funds to facilitate domestic economic policies, according   to IFSWF. It's unclear what type of fund the U.S. would create, how it   will operate, and how it will be financed.   </li><li class=\"listItem-bmN0_SHH\">After the Biden administration signed a law banning TikTok from U.S. app   stores unless its parent, the China-based ByteDance divested it, Trump   granted an extension to comply with that law while he consults with   advisors on national security concerns posed by TikTok. </li></ul><p class=\"\">What's Next: That makes TikTok potentially a target for the fund, Trump suggested on Monday. Bessent, a hedge fund manager, indicated during the Oval Office signing ceremony that the new sovereign-wealth fund will be ready to go in 12 months.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Abby Schultz and Liz Moyer</li></ul><p class=\"\">***</p><p class=\"\">Palantir Demolishes Expectations on Earnings Growth</p><p class=\"\">Palantir Technologies blew past expectations and described continued momentum in its U.S. business, which has expanded by double digit percentages over the past year amid the frenzy for artificial intelligence.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The software maker reported earnings of 14 cents a share, up 75% from a   year earlier, and revenue of $828 million, up 36%. Wall Street focused on   its outlook, seeing first quarter revenue of $858 million to $862 million,   a gain of 36% from last year and above forecasts.   </li><li class=\"listItem-bmN0_SHH\">Palantir is known primarily as a defense and intelligence agency, but its   U.S. commercial business is pushing growth higher. Revenue was up 64% on   the year for this end market and the backlog almost doubled. Total   bookings were up 134%. U.S. government revenue grew by 45% from 2023.   </li><li class=\"listItem-bmN0_SHH\">CEO Alex Karp said a shareholder letter that \"the momentum we are seeing   across sectors, both commercial and government, is unlike anything that   has come before.\" </li></ul><p class=\"\">What's Next: Palantir believes that it is uniquely situated to benefit from a new commoditized AI cost structure. \"With the proliferation of AI models, the raw AI labor supply is exploding,\" said chief revenue officer Ryan Taylor. It says it is transforming AI into a measurable stream of high-value finished goods and services.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Adam Levine</li></ul><p class=\"\">***</p><p class=\"\">Be sure to join this month's Barron's Daily virtual stock exchange challenge and show us your stuff.</p><p class=\"\">Each month, we'll start a new challenge and invite newsletter readers — you! — to build a portfolio using virtual money and compete against the Barron's and MarketWatch community.</p><p class=\"\">Everyone will start with the same amount and can trade as often or as little as they choose. We'll track the leaders and at the end of the challenge the winner whose portfolio has the most value will be announced in The Barron's Daily newsletter.</p><p class=\"\">Are you ready to compete? Join the challenge and pick your stocks here.</p><p class=\"\">***</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Newsletter edited by Liz Moyer, Patrick O'Donnell, Callum Keown</li></ul><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004847:0/",
            "pub_date": "2025-02-04 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004850:0",
            "title": "Regeneron Launches Dividend Program, Boost Stock Buybacks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Colin Kellaher</p><p class=\"\">Regeneron Pharmaceuticals is stepping up its shareholder returns with the launch of a quarterly dividend and a $3 billion increase to its stock-buyback program.</p><p class=\"\">Regeneron on Tuesday said its board declared an initial quarterly dividend of 88 cents, payable March 20 to shareholders of record Feb. 20.</p><p class=\"\">The new payout, equal to $3.52 a year, represents an annual yield of about 0.53% based on Monday's closing price of $666.85 for the Tarrytown, N.Y., biotechnology company.</p><p class=\"\">Regeneron said the new buyback authorization brings its total repurchase capacity to about $4.5 billion.</p><p class=\"\">The company, which shelled out about $2.6 billion buying back stock in 2024, has about 108 million shares outstanding and sports a market capitalization topping $73 billion.</p><p class=\"\">Write to Colin Kellaher at colin.kellaher@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004850:0-regeneron-launches-dividend-program-boost-stock-buybacks/",
            "pub_date": "2025-02-04 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203010836:0",
            "title": "Pfizer Stock Rises on Fourth-Quarter Earnings Beat and Reaffirmed Guidance — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis</p><p class=\"\">When CEO Albert Bourla presents Pfizer's financial results on Tuesday morning, investors will be looking for any sign of a turnaround after another year of underperformance.</p><p class=\"\">Pfizer shares fell nearly 50% from the start of 2023 through the end of 2024, while the S&amp;P 500 climbed just over 50%. A Pfizer shareholder has halved her money over that period, while missing out on a shot at historic gains.</p><p class=\"\">Most of Pfizer's losses came in 2023, but the stock failed to recover in 2024. At an investor conference in early January, Bourla said that the company had cut costs, revamped its sales operation, and made other big fixes.</p><p class=\"\">Those efforts have yet to satisfy investors.</p><p class=\"\">Analysts expect the company to report fourth-quarter earnings of 47 cents a share from sales of $17.4 billion, according to FactSet.</p><p class=\"\">In December, the company rolled out initial guidance for 2025 that investors took as bullish, sending shares up slightly. The company expects revenue of between $61 billion and $64 billion, and adjusted per-share earnings of between $2.80 and $3.</p><p class=\"\">Pfizer's earnings call comes at a turbulent moment, as the Trump administration introduces new tariffs that have upset the financial markets. Bourla's public statements on the new administration have so far been overwhelmingly positive.</p><p class=\"\">\"When you have radical change [it is] always coming with risks and opportunities,\" Bourla said at the investor conference in January. But he said that he thinks \"the opportunities outweigh the risks\" under Trump.</p><p class=\"\">One question now for Bourla, and one he will likely face on Tuesday, is whether the new tariffs could damage Pfizer in the near term, and whether he remains optimistic about the new regime.</p><p class=\"\">Meanwhile, Bourla seems to have brushed off what had seemed a formidable challenge from Starboard Value, which reportedly built a $1 billion stake in Pfizer last year. The activist investor slammed the company's performance in a much-discussed presentation that asserted that Pfizer \"management has failed\" to deliver on important commitments.</p><p class=\"\">Bloomberg reported last week, however, that Starboard hadn't nominated any new board members ahead of an April annual meeting, and that the deadline for nominations had passed on Jan. 25.</p><p class=\"\">Pfizer is facing a major string of patent expirations beginning in 2026 that will scrape between $17 billion and $18 billion off the company's revenue by the end of the decade. The company hopes to close that gap with sales of products it has acquired in a recent spending spree.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203010836:0/",
            "pub_date": "2025-02-04 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004851:0",
            "title": "Marathon Petroleum 4Q Profit, Revenue Fall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adriano Marchese</p><p class=\"\">Marathon Petroleum reported a steep decline in profit for the fourth quarter, and revenue fell in line with analyst expectations.</p><p class=\"\">The refiner, transporter and marketer of petroleum products posted on Tuesday a fall in net income to $371 million, or $1.15 a share, compared with $1.45 billion, or $3.84 a share, in the same quarter a year ago.</p><p class=\"\">Adjusted earnings were 77 cents a share. According to FactSet, analysts were expecting 2 cents a share a share.</p><p class=\"\">Adjusted earnings before interest, taxes, depreciation and amortization fell to $2.12 billion from $3.57 billion.</p><p class=\"\">Revenue fell to $33.14 billion from $36.26 billion. The decline was about in line with analyst expectations for the period.</p><p class=\"\">MPC Standalone capital outlook is expected to come to $1.25 billion for 2025, which includes investments in its refineries.</p><p class=\"\">MPC also owns an interest in MPLX, a midstream company that focuses on gathering, processing, and fractionation assets, as well as crude oil and light product transportation and logistics infrastructure.</p><p class=\"\">2025 capital spending for MPLX expected to come to $2 billion. The company said MPLX is expanding its Permian to Gulf Coast value chain, advancing its long-haul pipeline projects to support expected increased producer activity. It is also investing in processing capacity in response to producer demand, it said.</p><p class=\"\">Write to Adriano Marchese at adriano.marchese@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004851:0/",
            "pub_date": "2025-02-04 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004792_20250204004835:0",
            "title": "BetMGM: FY24 iGaming Net Rev Up 13%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004792_20250204004835:0/",
            "pub_date": "2025-02-04 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004792_20250204004853:0",
            "title": "BetMGM: FY24 Online Sports Net Revenue Up 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004792_20250204004853:0/",
            "pub_date": "2025-02-04 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:8241c7243a14e:0",
            "title": "UMB Financial Corp Director Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Gallagher Kevin Charles</td></tr><tr><td>Relationship</td><td>Director</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$60,146</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1417351/000112760225002841/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Kevin Charles Gallagher, a Director at UMB Financial Corp, sold 527 shares of Common Stock on February 3, 2025, at a price of $114.13 per share, totaling $60,146. Following the transaction, Gallagher directly owns 13,009 shares and indirectly owns 8,484 shares through an IRA and a Roth IRA.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1417351/000112760225002841/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">UMB FINANCIAL CORP [ UMBF ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:8241c7243a14e:0-umb-financial-corp-director-sells-shares/",
            "pub_date": "2025-02-04 20:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN6QTwtL:0",
            "title": "Francks Kylindustri strengthens its position in the Gothenburg region through acquiring NR Kyl",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Francks Kylindustri strengthens its position in Gothenburg and adjacent areas through the acquisition of NR Kyl, a specialist offering installation and service within cooling and heat pumps for the commercial cooling segment.</p><p class=\"\">The combination of Francks and NR Kyl will create a stronger organisation and platform to better serve our industrial and commercial customers. The operative owner and CEO of NR Kyl will remain operational as part of Francks.</p><p class=\"\">“We are very pleased that NR Kyl has chosen to join Francks, enabling further development of our joint operations in Gothenburg and the surrounding areas. Through the acquisition, we strengthen our position in the market by adding high competence, expertise and experience as well as a culture that shares our vision and values. It is exciting to continue our journey – now stronger together”, says Anders Lennartsson, Site Manager at Francks Kylindustri Gothenburg.</p><p class=\"\">“We look forward to becoming part of Francks and growing stronger together. Through our com-bined expertise, we can enhance our customer offering in design, installation and service, thereby increasing our customer value. As part of Francks, we gain further opportunities to de-velop, broaden our knowledge, and strengthen our market position together\", says Johannes Ringström, CEO at NR Kyl.</p><p class=\"\">Francks Kylindustri is the leading Nordic industrial and commercial cooling specialist with 50+ offices and ~600 employees across Sweden, Norway, Denmark and Finland.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information contact:</strong></p><p class=\"\">Anders Lennartsson, Platschef, Francks Kylindustri i Göteborg</p><p class=\"\">+46 761-43 35 30, anders.lennartsson@francksref.com</p><p class=\"\">Sören Jensen, Group CEO, Francks Kylindustri</p><p class=\"\">+46 76-130 14 66, soren.jensen@francksref.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN6QTwtL:0-francks-kylindustri-strengthens-its-position-in-the-gothenburg-region-through-acquiring-nr-kyl/",
            "pub_date": "2025-02-04 20:10:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV12E:0",
            "title": "HR software startup Deel prepares for IPO as soon as 2026 - CNBC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/299u3r86</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV12E:0-hr-software-startup-deel-prepares-for-ipo-as-soon-as-2026-cnbc/",
            "pub_date": "2025-02-04 20:10:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308656:0",
            "title": "Susquehanna Adjusts Price Target on Southwest Airlines to $34 From $38, Keeps Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Southwest Airlines Co  has an average rating of hold and mean price target of $32.05, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308656:0/",
            "pub_date": "2025-02-04 20:10:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463486:0",
            "title": "Mach Conferences & Events Secures Three International Orders from Adani Cement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mach Conferences &amp; Events (BOM: 544248) secured three international event orders from Adani Cement, to be executed in fiscal 2025, according to a Monday filing with the Indian exchanges. </p><p class=\"\">The projects include events for 375 participants in Tashkent, Uzbekistan; 68 participants in Dubai, UAE; and 82 participants in Phuket-Krabi, Thailand. </p><p class=\"\">Each event would span four nights and five days, the company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463486:0/",
            "pub_date": "2025-02-04 20:10:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308651:0",
            "title": "Susquehanna Adjusts Price Target on United Airlines to $130 From $120, Keeps Positive Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">United Airlines Holdings  has an average rating of buy and mean price target of $134.41, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308651:0/",
            "pub_date": "2025-02-04 20:10:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308619:0",
            "title": "Barclays Adjusts Price Target on IDEXX Laboratories to $520 From $481, Maintains Overweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IDEXX Laboratories  has an average rating of overweight and mean price target of $515, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308619:0/",
            "pub_date": "2025-02-04 20:04:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004769:0",
            "title": "Silicon Labs Reports Fourth Quarter 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:05 GMT) </strong>*Silicon Laboratories 4Q Loss/Shr 73c &gt;SLAB<br/><strong class=\"root-Tkn6WL2y\">(12:05 GMT) </strong>*Silicon Laboratories 4Q Loss $23.8M &gt;SLAB<br/><strong class=\"root-Tkn6WL2y\">(12:05 GMT) </strong>*Silicon Laboratories 4Q Rev $166.2M &gt;SLAB<br/><strong class=\"root-Tkn6WL2y\">(12:05 GMT) </strong>Press Release: Silicon Labs Reports Fourth Quarter 2024 Results</p><p class=\"\">Silicon Labs Reports Fourth Quarter 2024 Results</p><p class=\"\">PR Newswire</p><p class=\"\">AUSTIN, Texas, Feb. 4, 2025</p><p class=\"\">Wireless IoT leader delivers in-line fourth-quarter results and guides to sequential growth in first quarter</p><p class=\"\">AUSTIN, Texas, Feb. 4, 2025 /PRNewswire/ — Silicon Labs , a leader in secure, intelligent wireless technology for a more connected world, reported financial results for the fourth quarter, which ended December 28, 2024.</p><p class=\"\">\"The Silicon Labs team executed well to close out 2024, with fourth quarter revenue nearly doubling from the same quarter one year ago,\" said Matt Johnson, President and Chief Executive Officer at Silicon Labs. \"Looking ahead, we expect sequential revenue growth to resume beginning in the first quarter and are encouraged by our 2025 outlook as design wins across several key focus areas continue to ramp into production throughout the year.\"</p><p class=\"\">Fourth Quarter Financial Highlights</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue was $166 million   </li><li class=\"listItem-bmN0_SHH\">Industrial &amp; Commercial revenue for the quarter was $89 million, down 8%   sequentially   </li><li class=\"listItem-bmN0_SHH\">Home &amp; Life revenue for the quarter was $78 million, up 11% sequentially </li></ul><p class=\"\">Results on a GAAP basis:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">GAAP gross margin was 54.3%   </li><li class=\"listItem-bmN0_SHH\">GAAP operating expenses were $119 million   </li><li class=\"listItem-bmN0_SHH\">GAAP operating loss was $29 million   </li><li class=\"listItem-bmN0_SHH\">GAAP diluted loss per share was $(0.73) </li></ul><p class=\"\">Results on a non-GAAP basis, excluding the impact of stock compensation, amortization of acquired intangible assets, and certain other items as set forth in the below GAAP to Non-GAAP reconciliation tables were as follows:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Non-GAAP gross margin was 54.6%   </li><li class=\"listItem-bmN0_SHH\">Non-GAAP operating expenses were $98 million   </li><li class=\"listItem-bmN0_SHH\">Non-GAAP operating loss was $7 million   </li><li class=\"listItem-bmN0_SHH\">Non-GAAP diluted loss per share was $(0.11) </li></ul><p class=\"\">Business Outlook</p><p class=\"\">The company expects first-quarter revenue to be between $170 to $185 million. The company also estimates the following results:</p><p class=\"\">On a GAAP basis:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">GAAP gross margin to be between 54% to 56%   </li><li class=\"listItem-bmN0_SHH\">GAAP operating expenses of approximately $128 million to $130 million   </li><li class=\"listItem-bmN0_SHH\">GAAP diluted loss per share between $(0.75) to $(1.05) </li></ul><p class=\"\">On a non-GAAP basis, excluding the impact of stock compensation, amortization of acquired intangible assets, and certain other items as set forth in the reconciliation tables:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Non-GAAP gross margin to be between 54% to 56%   </li><li class=\"listItem-bmN0_SHH\">Non-GAAP operating expenses of approximately $103 million to $105 million   </li><li class=\"listItem-bmN0_SHH\">Non-GAAP diluted earnings (loss) per share between $0.01 to $(0.19) </li></ul><p class=\"\">Earnings Webcast and Conference Call</p><p class=\"\">Silicon Labs will host an earnings conference call to discuss the quarterly results and answer questions at 7:30 am CDT today. An audio webcast will be available on Silicon Labs' website (www.silabs.com) under Investor Relations. In addition, the company will post an audio recording of the event at investor.silabs.com and make a replay available through March 6, 2025.</p><p class=\"\">About Silicon Labs</p><p class=\"\">Silicon Labs  is a leader in secure, intelligent wireless technology for a more connected world. Our integrated hardware and software platform, intuitive development tools, thriving ecosystem, and robust support make us an ideal long-term partner in building advanced industrial, commercial, home and life applications. We make it easy for developers to solve complex wireless challenges throughout the product lifecycle and get to market quickly with innovative solutions that transform industries, grow economies, and improve lives. silabs.com</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">This press release contains forward-looking statements based on Silicon Labs' current expectations. The words \"believe\", \"estimate\", \"expect\", \"intend\", \"anticipate\", \"plan\", \"project\", \"will\", and similar phrases as they relate to Silicon Labs are intended to identify such forward-looking statements. These forward-looking statements reflect the current views and assumptions of Silicon Labs and are subject to various risks and uncertainties that could cause actual results to differ materially from expectations. Among the factors that could cause actual results to differ materially from those in the forward-looking statements are the following: the competitive and cyclical nature of the semiconductor industry; the challenging macroeconomic environment, including tariffs or any other policy changes; geographic concentration of manufacturers, assemblers, test service providers and customers in Asia that subjects Silicon Labs' business and results of operations to risks of natural disasters, epidemics or pandemics, war and political unrest; risks that demand and the supply chain may be adversely affected by military conflict (including in the Middle East, and between Russia and Ukraine), terrorism, sanctions or other geopolitical events globally (including in the Middle East, and conflict between Taiwan and China); risks that Silicon Labs may not be able to maintain its historical growth; quarterly fluctuations in revenues and operating results; difficulties developing new products that achieve market acceptance; risks associated with international activities (including trade barriers, particularly with respect to China); intellectual property litigation risks; risks associated with acquisitions and divestitures; product liability risks; difficulties managing and/or obtaining sufficient supply from Silicon Labs' distributors, manufacturers and subcontractors; dependence on a limited number of products; absence of long-term commitments from customers; inventory-related risks; difficulties managing international activities; risks that Silicon Labs may not be able to manage strains associated with its growth; credit risks associated with its accounts receivable; dependence on key personnel; stock price volatility; the impact of public health crises on the U.S. and global economy; debt-related risks; capital-raising risks; the timing and scope of share repurchases and/or dividends; average selling prices of products may decrease significantly and rapidly; information technology risks; cyber-attacks against Silicon Labs' products and its networks; risks associated with any material weakness in our internal controls over financial reporting; and other factors that are detailed in the SEC filings of Silicon Laboratories Inc. Silicon Labs disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. References in this press release to Silicon Labs shall mean Silicon Laboratories Inc.</p><p class=\"\">Note to editors: Silicon Laboratories, Silicon Labs, the \"S\" symbol, and the Silicon Labs logo are trademarks of Silicon Laboratories Inc. All other product names noted herein may be trademarks of their respective holders.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                            Silicon Laboratories Inc. <br/>                                 Condensed Consolidated Statements of Operations <br/>                                      (In thousands, except per share data) <br/>                                                   (Unaudited) <br/> <br/>                                 Three Months Ended                                  Year Ended <br/>                   ----------------------------------------------  ---------------------------------------------- <br/>                        December 28,            December 30,            December 28,            December 30, <br/>                            2024                    2023                    2024                    2023 <br/>                   ----------------------  ----------------------  ----------------------  ---------------------- <br/>Revenues               $          166,249     $            86,845      $          584,386      $          782,258 <br/>Cost of revenues                   76,026                  42,919                 272,198                 321,672 <br/>                   ----------------------  ----------------------  ----------------------  ---------------------- <br/>Gross profit                       90,223                  43,926                 312,188                 460,586 <br/>Operating <br/>expenses: <br/> Research and <br/>  development                      82,438                  83,404                 332,225                 337,744 <br/> Selling, general <br/>  and <br/>  administrative                   36,412                  33,633                 145,453                 146,996 <br/>                   ----------------------  ----------------------  ----------------------  ---------------------- <br/>Operating <br/> expenses                         118,850                 117,037                 477,678                 484,740 <br/>                   ----------------------  ----------------------  ----------------------  ---------------------- <br/>Operating loss                   (28,627)                (73,111)               (165,490)                (24,154) <br/>Other income <br/>(expense): <br/> Interest income <br/>  and other, net                    2,978                   3,610                  11,987                  19,165 <br/> Interest expense                   (260)                   (942)                 (1,310)                 (5,554) <br/>                   ----------------------  ----------------------  ----------------------  ---------------------- <br/>Loss before <br/> income taxes                    (25,909)                (70,443)               (154,813)                (10,543) <br/>Provision <br/> (benefit) for <br/> income taxes                     (2,086)                (15,536)                  36,197                   7,943 <br/>Equity-method <br/> loss                                  --                (14,880)                      --                (16,030) <br/>                   ----------------------  ----------------------  ----------------------  ---------------------- <br/>Net loss             $           (23,823)    $           (69,787)      $        (191,010)    $           (34,516) <br/>                   ======================  ======================  ======================  ====================== <br/> <br/>Loss per share: <br/> Basic             $               (0.73)  $               (2.19)  $               (5.93)  $               (1.09) <br/> Diluted           $               (0.73)  $               (2.19)  $               (5.93)  $               (1.09) <br/> <br/>Weighted-average <br/>common shares <br/>outstanding: <br/> Basic                             32,420                  31,848                  32,191                  31,804 <br/> Diluted                           32,420                  31,848                  32,191                  31,804 <br/> <br/> </pre><p class=\"\">Non-GAAP Financial Measurements</p><p class=\"\">In addition to the GAAP results provided throughout this document, Silicon Labs has provided non-GAAP financial measurements on a basis excluding non-cash and other charges and benefits. Details of these excluded items are presented in the tables below, which reconcile the GAAP results to non-GAAP financial measurements.</p><p class=\"\">The non-GAAP financial measurements do not replace the presentation of Silicon Labs' GAAP financial results. These measurements provide supplemental information to assist management and investors in analyzing Silicon Labs' financial position and results of operations. Silicon Labs has chosen to provide this information to investors to enable them to perform meaningful comparisons of past, present and future operating results and as a means to emphasize the results of core on-going operations.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                       Unaudited Reconciliation of GAAP to Non-GAAP Financial Measures <br/>                                    (In thousands, except per share data) <br/> <br/>                                                Three Months Ended <br/>                                                 December 28, 2024 <br/>                  ------------------------------------------------------------------------------- <br/>                                 GAAP <br/>Non-GAAP Income                Percent          Stock                                               Non-GAAP <br/>Statement            GAAP         of         Compensation      Intangible Asset      Non-GAAP       Percent of <br/>Items               Measure    Revenue         Expense           Amortization         Measure        Revenue <br/>---------------   -----------  --------  -------------------  ------------------  ---------------  ----------- <br/>Revenues          $   166,249 <br/> <br/>Gross profit           90,223    54.3 %  $               485  $               --  $        90,708       54.6 % <br/> <br/>Research and <br/> development           82,438    49.6 %               10,199               5,437           66,802       40.2 % <br/> <br/>Selling, general <br/> and <br/> administrative        36,412    21.9 %                5,460                  --           30,952       18.6 % <br/> <br/>Operating <br/> expenses             118,850    71.5 %               15,659               5,437           97,754       58.8 % <br/> <br/>Operating income <br/> (loss)              (28,627)  (17.2 %)               16,144               5,437          (7,046)      (4.2 %) <br/> <br/> <br/>                                                   Three Months Ended <br/>                                                    December 28, 2024 <br/>               ------------------------------------------------------------------------------------------ <br/>Non-GAAP                            Stock            Intangible            Income              Non- <br/>Loss Per            GAAP         Compensation           Asset                Tax               GAAP <br/>Share              Measure         Expense*         Amortization*        Adjustments          Measure <br/>------------   --------------  ----------------  ------------------  ------------------  ---------------- <br/>Net income <br/> (loss)          $   (23,823)  $         16,144  $            5,437  $          (1,221)   $       (3,463) <br/> <br/>Diluted <br/> shares <br/> outstanding           32,420                                                                      32,420 <br/> <br/>Diluted loss <br/> per share     $       (0.73)                                                            $         (0.11) <br/> <br/> <br/> <br/>*  Represents pre-tax amounts <br/> <br/> <br/>    Unaudited Forward-Looking Statements Regarding Business Outlook <br/>                  (In millions, except per share data) <br/> <br/>                                     Three Months Ended <br/>                                        April 5, 2025 <br/>                           GAAP            Non-GAAP         Non-GAAP <br/>Business Outlook          Measure        Adjustments**       Measure <br/>------------------   -----------------  --------------  ---------------- <br/>Gross margin            54% to 56%                -- %  54% to 56% <br/> <br/>Operating expenses     $128 to $130              $(25)  $103 to $105 <br/> <br/>Diluted earnings        $(0.75) to      $0.76 to $0.86  $0.01 to $(0.19) <br/> (loss) per share         $(1.05) <br/> <br/> <br/> <br/>** Non-GAAP adjustments include the following estimates: stock compensation <br/>expense of $20.1 million, intangible asset amortization of $5.4 million, and <br/>the application of a long-term non-GAAP tax rate of 20%. <br/> <br/> <br/>                         Silicon Laboratories Inc. <br/>                   Condensed Consolidated Balance Sheets <br/>                   (In thousands, except per share data) <br/>                                (Unaudited) <br/> <br/>                                       December 28,         December 30, <br/>                                            2024                 2023 <br/>                                    -------------------  ------------------- <br/>              Assets <br/>Current assets: <br/> Cash and cash equivalents           $          281,607   $          227,504 <br/> Short-term investments                         100,554              211,720 <br/> Accounts receivable, net                        54,479               29,295 <br/> Inventories                                    105,639              194,295 <br/> Prepaid expenses and other <br/>  current assets                                 59,754               75,117 <br/>                                    -------------------  ------------------- <br/>Total current assets                            602,033              737,931 <br/>Property and equipment, net                     132,136              145,890 <br/>Goodwill                                        376,389              376,389 <br/>Other intangible assets, net                     36,499               59,533 <br/>Other assets, net                                75,617              123,313 <br/>                                    -------------------  ------------------- <br/>Total assets                          $       1,222,674    $       1,443,056 <br/>                                    ===================  =================== <br/>  Liabilities and Stockholders' <br/>              Equity <br/>Current liabilities: <br/> Accounts payable                   $            42,448  $            57,498 <br/> Revolving line of credit                            --               45,000 <br/> Deferred revenue and returns <br/>  liability                                       3,073                2,117 <br/> Other current liabilities                       52,362               58,955 <br/>                                    -------------------  ------------------- <br/>Total current liabilities                        97,883              163,570 <br/>Other non-current liabilities                    44,770               70,804 <br/>                                    -------------------  ------------------- <br/>Total liabilities                               142,653              234,374 <br/>Commitments and contingencies <br/>Stockholders' equity: <br/> Preferred stock -- $0.0001 par <br/> value; 10,000 shares authorized; <br/> no shares issued                                    --                   -- <br/> Common stock -- $0.0001 par <br/>  value; 250,000 shares <br/>  authorized; 31,897 and 31,994 <br/>     shares issued and outstanding <br/>  at December 30, 2023 and <br/>  December 31, 2022, <br/>     respectively                                     3                    3 <br/> Additional paid-in capital                      78,227               16,973 <br/> Retained earnings                            1,001,721            1,192,731 <br/> Accumulated other comprehensive <br/>  income (loss)                                      70              (1,025) <br/>                                    -------------------  ------------------- <br/>Total stockholders' equity                    1,080,021            1,208,682 <br/>                                    -------------------  ------------------- <br/>Total liabilities and <br/> stockholders' equity                 $       1,222,674    $       1,443,056 <br/>                                    ===================  =================== <br/> <br/> <br/>                         Silicon Laboratories Inc. <br/>              Condensed Consolidated Statements of Cash Flows <br/>                               (In thousands) <br/>                                (Unaudited) <br/> <br/>                                                   Year Ended <br/>                                    ---------------------------------------- <br/>                                       December 28,         December 30, <br/>                                           2024                 2023 <br/>                                    ------------------  -------------------- <br/>Operating Activities <br/>Net loss                            $        (191,010)  $           (34,516) <br/>Adjustments to reconcile net loss <br/>to net cash used in operating <br/>activities: <br/> Depreciation of property and <br/>  equipment                                     25,551                25,707 <br/> Amortization of other intangible <br/>  assets                                        23,034                25,374 <br/> Amortization of debt discount and <br/>  debt issuance costs                               --                   960 <br/> Stock-based compensation expense               61,503                48,208 <br/> Equity-method loss                                 --                16,030 <br/> Deferred income taxes                          29,470              (11,815) <br/> Changes in operating assets and <br/> liabilities: <br/>   Accounts receivable                        (25,184)                42,142 <br/>   Inventories                                  88,494              (93,398) <br/>   Prepaid expenses and other <br/>    assets                                      27,362              (10,733) <br/>   Accounts payable                           (15,155)              (25,644) <br/>   Other current liabilities and <br/>    income taxes                              (21,768)              (37,793) <br/>   Deferred revenue and returns <br/>    liability                                      956               (4,663) <br/>   Other non-current liabilities              (17,163)                29,793 <br/>                                    ------------------  -------------------- <br/>Net cash used in operating <br/> activities                                   (13,910)              (30,348) <br/> <br/>Investing Activities <br/>Purchases of marketable securities            (73,602)             (103,485) <br/>Sales of marketable securities                  54,227               395,565 <br/>Maturities of marketable <br/> securities                                    131,858               200,530 <br/>Purchases of property and <br/> equipment                                    (11,748)              (22,282) <br/>Proceeds from sale of equity <br/>investment                                      12,382                    -- <br/>Purchases of other assets                           --                 (520) <br/>                                    ------------------  -------------------- <br/>Net cash provided by investing <br/> activities                                    113,117               469,808 <br/> <br/>Financing Activities <br/>Proceeds from issuance of debt                      --                80,000 <br/>Payments on debt                              (45,000)             (571,157) <br/>Repurchases of common stock                       (16)             (217,137) <br/>Payment of taxes withheld for <br/> vested stock awards                          (16,434)              (18,189) <br/>Proceeds from the issuance of <br/> common stock                                   16,346                14,612 <br/>                                    ------------------  -------------------- <br/>Net cash used in financing <br/> activities                                   (45,104)             (711,871) <br/> <br/>Increase (decrease) in cash and <br/> cash equivalents                               54,103             (272,411) <br/>Cash and cash equivalents at <br/> beginning of period                           227,504               499,915 <br/>                                    ------------------  -------------------- <br/>Cash and cash equivalents at end <br/> of period                          $          281,607    $          227,504 <br/>                                    ==================  ==================== <br/> </pre><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/silicon-labs-reports-fourth-quarter-2024-results-302367394.html</p><p class=\"\">SOURCE Silicon Labs</p><p class=\"\">/CONTACT: Thomas Haws, Investor Relations Manager, (512) 416-8500, investor.relations@silabs.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:05 GMT) </strong>*Silicon Laboratories Sees 1Q Rev $170M-$185M &gt;SLAB</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004769:0/",
            "pub_date": "2025-02-04 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004769_20250204004789:0",
            "title": "Silicon Laboratories Sees 1Q Rev $170M-$185M >SLAB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004769_20250204004789:0/",
            "pub_date": "2025-02-04 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004769_20250204004771:0",
            "title": "Silicon Laboratories 4Q Rev $166.2M >SLAB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004769_20250204004771:0/",
            "pub_date": "2025-02-04 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004769_20250204004769:0",
            "title": "Silicon Laboratories 4Q Loss/Shr 73c >SLAB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004769_20250204004769:0/",
            "pub_date": "2025-02-04 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004769_20250204004770:0",
            "title": "Silicon Laboratories 4Q Loss $23.8M >SLAB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004769_20250204004770:0/",
            "pub_date": "2025-02-04 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204003540:0",
            "title": "PepsiCo's revenue misses amid 'subdued' trends and Quaker Oats recall fallout",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tomi Kilgore</p><p class=\"\">Profit extends long-streak of beats and dividend raised 5%, while Frito-Lay and Quaker Foods see some revenue weakness</p><p class=\"\">Shares of PepsiCo Inc. were taking a hit in early trading Tuesday, after the beverage and snack giant reported a slight decline in quarterly revenue amid weakness in its North America Frito-Lay and Quaker Foods businesses.</p><p class=\"\">Meanwhile, profit rose and extended its long streak of beats and the company boosted its dividend by 5%, lifting the stock's yield to triple that of the S&amp;P 500.</p><p class=\"\">\"Our businesses remained resilient in 2024, despite subdued category performance trends in North America, the continued impacts related to a recall in our Quaker Foods North America division and business disruptions due to geopolitical tensions in certain international markets,\" said Chief Executive Ramon Laguarta.</p><p class=\"\">The stock (PEP) fell 2.7% in premarket trading.</p><p class=\"\">For the fourth quarter to Dec. 28, net revenue declined 0.2% from a year ago, to $27.78 billion from $27.85 billion, while the FactSet consensus was for slight growth to $27.89 billion. That marked the third straight quarter in which revenue missed forecasts.</p><p class=\"\">Revenue for Frito-Lay North America fell 2.1% to $7.32 billion and Quaker Foods North America revenue was also down 2.1% to $874 million, while PepsiCo Beverage North America revenue was little changed at $7.91 billion.</p><p class=\"\">Quaker Foods was still feeling the impact of the recall of its granola bars and granola cereals in December 2023 due to concerns over salmonella contamination.</p><p class=\"\">Net earnings rose to $1.52 billion, or $1.11 a share, from $1.30 billion, or 94 cents a share, in the same period a year ago.</p><p class=\"\">Excluding nonrecurring items, core earnings per share rose $1.96, beating the FactSet consensus of $1.94. That marked at least the 22nd-straight quarter of bottom-line beats, based on available FactSet data.</p><p class=\"\">For 2025, the company expects core EPS growth in the low-single-digit percentage range. The current FactSet consensus for 2025 EPS of $8.52 implies 4.4% growth.</p><p class=\"\">The raised its annual dividend to $5.69 a share from $5.42 a share, effective with the dividend expected to be paid in June.</p><p class=\"\">At Monday's stock closing price of $150.27, the new annual dividend rate implies a dividend yield of 3.79%, which compares with the yield for the Consumer Staples Select Sector SPDR ETF XLP of 2.74% and the implied yield for the S&amp;P 500 index SPX of 1.26%.</p><p class=\"\">PepsiCo's stock has dropped 9.7% over the past three months through Monday, while the S&amp;P 500 has gained 4.9%.</p><p class=\"\">-Tomi Kilgore</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204003540:0/",
            "pub_date": "2025-02-04 20:05:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004780:0",
            "title": "Invivyd Price Target Maintained With a $10.00/Share by HC Wainwright & Co.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004780:0/",
            "pub_date": "2025-02-04 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:5c0001dc9e430:0",
            "title": "Xylem Inc. Reports Fourth Quarter and Full Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Xylem Inc., a leading global water solutions company, has released its financial results for the fourth quarter and full year of 2024. The company, dedicated to addressing the world's most challenging water issues, has shown significant growth and strong performance across various financial metrics.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, Xylem reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Orders of $2.2 billion, up 7% on both a reported and organic basis.</li><li class=\"listItem-bmN0_SHH\">Revenue of $2.3 billion, also up 7% on both a reported and organic basis.</li><li class=\"listItem-bmN0_SHH\">Earnings per share (EPS) of $1.34, a 22% increase; adjusted EPS of $1.18, up 19%.</li></ul><p class=\"\">For the full year of 2024, the company reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $8.6 billion, up 16% on a reported basis and 6% organically.</li><li class=\"listItem-bmN0_SHH\">EPS of $3.65, up 31%; adjusted EPS of $4.27, up 13%.</li><li class=\"listItem-bmN0_SHH\">Net income for the quarter was $326 million, or $1.34 per share, with a net income margin increase of 190 basis points to 14.5%.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Xylem's strong performance was driven by robust execution and demand across all segments. The company set new benchmarks for full-year revenue, net income, and adjusted EBITDA margins. Fourth-quarter adjusted EBITDA margin was 21.0%, reflecting a year-over-year increase of 140 basis points, driven by productivity savings, strong price realization, and higher volume.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">The Board of Directors declared a first-quarter dividend of $0.40 per share, an increase of 11%, payable on March 19, 2025. Additionally, the company experienced a non-recurring gain on the remeasurement of its previously held equity interest in Idrica, partially offset by non-recurring tax benefits in the prior year, a loss on the sale of businesses, and increased restructuring and realignment costs.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Matthew Pine, Xylem’s CEO, commented, \"The team delivered a strong fourth quarter to close a record-breaking year for Xylem. We set new benchmarks for full-year revenue, net income, and adjusted EBITDA margins, and earnings per share, with the team showing great operating discipline across the portfolio. All segments delivered strong Q4 orders growth, giving us momentum coming into 2025 on resilient underlying demand.\"</p><p class=\"\">He further added, \"In a year of transition and transformation, the team focused on what matters while delivering on the initiatives that have laid the foundation for sustainable growth and value creation. Our 2025 guidance reflects the team’s commitment to our long-term framework as we continue to enable our customers to address the world’s greatest water challenges.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead, Xylem forecasts full-year 2025 revenue of approximately $8.6 to $8.7 billion, up approximately 0 to 2% on a reported basis and up approximately 3 to 4% on an organic basis. The company expects full-year 2025 adjusted EBITDA margin to be approximately 21.3 to 21.8%, an increase of 70 to 120 basis points from 2024 adjusted results. Full-year free cash flow margin is expected to be approximately 9 to 10%.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1524472/000152447225000010/xyl-20250204.htm\" rel=\"nofollow\" target=\"_blank\">Xylem Inc. [ XYL ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:5c0001dc9e430:0-xylem-inc-reports-fourth-quarter-and-full-year-2024-results/",
            "pub_date": "2025-02-04 20:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0aa6eaf3f7257:0",
            "title": "PayPal Reports Fourth Quarter and Full Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal Holdings, Inc. has released its financial results for the fourth quarter and full year ending December 31, 2024. The company reported solid performance, with notable improvements in key areas and a new $15 billion share repurchase authorization.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, PayPal's net revenues increased by 4% to $8.4 billion, with transaction margin dollars rising by 7% to $3.9 billion. However, GAAP operating income decreased by 17% to $1.4 billion, while non-GAAP operating income saw a modest increase of 2% to $1.5 billion. GAAP EPS fell by 15% to $1.11, whereas non-GAAP EPS grew by 5% to $1.19.</p><p class=\"\">For the full year 2024, net revenues grew by 7% to $31.8 billion, and transaction margin dollars also increased by 7% to $14.7 billion. GAAP operating income rose by 6% to $5.3 billion, and non-GAAP operating income increased by 14% to $5.8 billion. GAAP EPS saw a 4% increase to $3.99, while non-GAAP EPS surged by 21% to $4.65.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">PayPal's total payment volume (TPV) for the fourth quarter of 2024 increased by 7% to $437.8 billion, and for the full year, TPV grew by 10% to $1.68 trillion. The number of payment transactions decreased by 3% in the fourth quarter to 6.6 billion but increased by 5% for the full year to 26.3 billion. Active accounts grew by 2.1% to 434 million, with a sequential increase of 2.6 million in the fourth quarter.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">PayPal announced a new $15 billion stock repurchase program, adding to the existing June 2022 program, which had $4.86 billion remaining authorization as of December 31, 2024. The company returned $1.2 billion to stockholders by repurchasing approximately 15 million shares in the fourth quarter and $6.0 billion for the full year by repurchasing approximately 92 million shares.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Alex Chriss, President and CEO of PayPal, expressed satisfaction with the company's performance, highlighting the strong foundation laid for long-term, profitable growth. Chriss emphasized the improvements in branded checkout, peer-to-peer, and Venmo, as well as the progress in the price-to-value strategy. He also mentioned the company's focus on scaling adoption in 2025.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">PayPal provided guidance for the first quarter and full year 2025. The company expects GAAP EPS for the first quarter to be between $1.11 and $1.13, and non-GAAP EPS to be between $1.15 and $1.17. For the full year 2025, GAAP EPS is projected to be between $4.80 and $4.95, and non-GAAP EPS between $4.95 and $5.10.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1633917/000163391725000017/pypl-20250204.htm\" rel=\"nofollow\" target=\"_blank\">PayPal Holdings, Inc. [ PYPL ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:0aa6eaf3f7257:0-paypal-reports-fourth-quarter-and-full-year-2024-results/",
            "pub_date": "2025-02-04 20:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:8791e9efa5fe6:0",
            "title": "Energizer Holdings, Inc. Reports Fiscal 2025 First Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energizer Holdings, Inc., a leading manufacturer of batteries and portable lighting products, has released its financial results for the first fiscal quarter ended December 31, 2024. The company reported a solid performance with growth in both net sales and earnings, driven by strategic initiatives and operational efficiencies.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the first quarter of fiscal 2025, Energizer Holdings, Inc. reported net sales of $731.7 million, a 2.1% increase compared to $716.6 million in the prior year period. Organic net sales grew by 3.8%, reflecting strong performance in both the Battery and Auto Care segments. The company achieved a gross margin of 36.8% on a reported basis and 40.0% on an adjusted basis, representing a 50 basis point improvement over the prior year's adjusted gross margin.</p><p class=\"\">Earnings per share (EPS) for the quarter were $0.30, with adjusted EPS at $0.67, marking a 14% increase on an adjusted basis. Adjusted EBITDA also saw growth, reaching $140.7 million compared to $132.9 million in the same period last year. The company successfully reduced its net leverage to 4.7 times, driven by debt paydown and adjusted EBITDA growth.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Energizer's net sales growth was supported by new and expanded distribution, particularly in the Battery &amp; Lights segment, which saw a volume increase of approximately 3.8%. Additionally, hurricanes contributed roughly $10 million in incremental volume, equating to about 1.4% in organic growth. The Auto Care segment also experienced volume increases due to distribution gains, international market expansion, and growth in digital commerce, partially offset by an earlier shift in holiday orders.</p><p class=\"\">Gross margin improvement was largely attributed to Project Momentum, which delivered savings of approximately $16 million in the quarter. However, these benefits were partially offset by planned strategic pricing and promotional investments, as well as unfavorable currency impacts.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">The company continued to focus on debt reduction, paying down approximately $25 million in long-term debt during the first quarter. This marks the tenth consecutive quarter of debt reduction. Dividend payments totaled approximately $24 million, or $0.30 per common share. Energizer also invested in building and scaling capabilities in innovation, distribution, and digital commerce to drive consistent growth.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Mark LaVigne, Chief Executive Officer of Energizer Holdings, Inc., expressed satisfaction with the company's strong start to fiscal 2025. He highlighted the 2.1% increase in net sales and 3.8% growth in organic net sales, with notable performance in both Batteries and Auto Care. LaVigne emphasized the company's commitment to executing its strategies, which resulted in mid-single-digit growth in adjusted EBITDA and a 14% increase in adjusted EPS.</p><p class=\"\">LaVigne also noted the company's continued investment in innovation, distribution, and digital commerce, which are essential for driving long-term shareholder value.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead, Energizer Holdings, Inc. has increased its outlook for organic net sales growth to 2% to 3% for fiscal 2025. The company reaffirmed its expectations for adjusted EBITDA to be in the range of $625 million to $645 million and adjusted EPS to be between $3.45 and $3.65. For the second quarter, Energizer anticipates reported net sales to be flat to up 1%, with organic net sales growth of 2% to 3% and adjusted EPS in the range of $0.60 to $0.70.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1632790/000163279025000021/enr-20250204.htm\" rel=\"nofollow\" target=\"_blank\">ENERGIZER HOLDINGS, INC. [ ENR ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:8791e9efa5fe6:0-energizer-holdings-inc-reports-fiscal-2025-first-quarter-results/",
            "pub_date": "2025-02-04 20:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308643:0",
            "title": "Aya Gold & Silver Brief: Expanding Boumadine Footprint, Adding 4 Mining Licences and an Exploration Authorization",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308643:0/",
            "pub_date": "2025-02-04 20:05:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308553:0",
            "title": "Marathon Petroleum's Q4 Adjusted Earnings, Revenue Decline",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marathon Petroleum  reported Q4 adjusted earnings Tuesday of $0.77 per diluted share, down from $3.98 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.02. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $33.47 billion, compared with $36.82 billion a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $33.14 billion. </p><p class=\"\">Shares of Marathon Petroleum were up over 2% in recent premarket activity Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308553:0/",
            "pub_date": "2025-02-04 20:05:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1ZDZPj:0",
            "title": "Cority Partners with Salus Technical, Bringing Advanced Bowtie Risk Analysis to CorityOne Ecosystem",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TORONTO, Feb.  04, 2025  (GLOBE NEWSWIRE) — Cority, the global leader in enterprise Environmental, Health, and Safety (EHS) software, today announced a strategic partnership with Salus Technical, a UK-based provider of bowtie risk analysis software. Through this partnership, Cority customers can access Salus Technical’s Bowtie Master solution, with its advanced Bowtie Risk diagramming and analysis features, enhancing their ability to manage complex risks within high-hazard settings.</p><p class=\"\">Managing risk is a growing demand for and one of the most critical challenges for organizations operating in high hazard environments. Traditional methods of risk assessment often struggle to adequately capture complexities common in high-reliability environments with intricate &amp; highly coupled processes. Bowtie Risk Analysis, with its intuitive visual diagrams, enables organizations to proactively identify and assess compliance, or Bowtie Risk Analysis tools help organizations build a clear, actionable framework for advanced risk management.</p><p class=\"\">Through this partnership, Cority will integrate Bowtie Master with Cority’s Risk Management solution. As part of CorityOne, the company’s comprehensive EHS and sustainability SaaS-based ecosystem, customers will also be able to access other Safety-based Cority applications and, eventually, the full spectrum of environmental, health, quality, and sustainability programs. This holistic approach provides users with one place for better insights, collaboration, and decision making.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Addressing Complex Risks with Cutting-Edge Tools</strong></p><p class=\"\">“Process safety and risk management require tools that not only analyze risks but also make the insights actionable,” said David Jamieson, founder of Salus Technical. “This partnership allows organizations to streamline their risk assessment workflows, ensuring they can visualize complex scenarios, identify key dependencies, and prioritize resources to protect their workforce and operations.”</p><p class=\"\">Salus Technical’s Bowtie Master dynamically builds bowtie risk diagrams, simplifying the complexities of process safety. Unlike traditional tabular methods, Salus Technical’s Bowtie Master solution enables users to build bowtie risk diagrams dynamically with simple drag-and-drop features, providing a holistic view of risks and dependencies, and helping organizations prioritize required preventive and corrective actions. The integration with CorityOne will allow customers to connect insights from their bowtie risk analysis to other EHS workflows, helping them make informed decisions that increase resiliency, boost system reliability, and reduce the likelihood of catastrophic events.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Benefits of the partnership Include:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Enhanced Risk Visibility: Intuitive, dynamic diagrams simplify complex risk scenarios, improving cross-team collaboration and understanding.</li><li class=\"listItem-bmN0_SHH\">Proactive Risk Management: Organizations can prioritize and address risks before incidents occur, reducing downtime and improving operational safety.</li><li class=\"listItem-bmN0_SHH\">Improved Efficiency: Seamless integration with CorityOne enables streamlined workflows, data visualization, and effective reporting.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Growing Demand for Bowtie Risk Analysis</strong></p><p class=\"\">Bowtie risk analysis has become a preferred tool in industries such as oil and gas, energy, mining, and transportation, where the stakes of operational failures are high. Regulatory trends in specific regions, including Australia, are further driving demand for bowtie risk analysis capabilities integrated in enterprise-grade EHS software.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Unified Approach to Risk Management</strong></p><p class=\"\">“Organizations in high-hazard industries are demanding for solutions that simplify complex risk management processes while delivering actionable insights to support intelligent action,” said Sean Baldry, senior director of product management at Cority. “With Bowtie Master, we are bringing our customers a powerful, integrated tool that enhances their ability to manage the most complex risk scenarios effectively and efficiently.”</p><p class=\"\">This partnership underscores Cority’s ongoing commitment to enhancing its CorityOne ecosystem through organic development and strategic collaborations, delivering comprehensive solutions that help organizations drive safety, operational excellence, and sustainability.</p><p class=\"\">For more information, visit www.cority.com and www.bowtiemaster.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cority</strong></p><p class=\"\">Cority gives every employee from the field to the boardroom the power to make a difference, reducing risks and creating a safer, healthier, and more sustainable world. For over 35 years, Cority’s people-first software solutions have been built by EHS and sustainability experts who know the pressures businesses face. Time-tested, scalable, and configurable, CorityOne is the responsible business platform that combines datasets from across the organization to enable improved efficiencies, actionable insights, data-driven decisions, and more accurate reporting on performance. Trusted by over 1,500 organizations worldwide and consistently recognized as a leader in the EHS industry by independent analyst firms, Cority deeply cares about helping people work toward a better future for everyone. To learn more, visit www.cority.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Salus Technical</strong></p><p class=\"\">Salus Technical, based in Aberdeen, Scotland, provides engineering, training, and software solutions to help organizations understand and manage risks from major accidents. Their flagship product, Bowtie Master, offers advanced process safety tools trusted by industries worldwide.</p><p class=\"\">Media Contact</p><p class=\"\">Natalie Rizk</p><p class=\"\">RiotMind</p><p class=\"\">natalier@theriotmind.agency</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1ZDZPj:0-cority-partners-with-salus-technical-bringing-advanced-bowtie-risk-analysis-to-corityone-ecosystem/",
            "pub_date": "2025-02-04 20:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004533:0",
            "title": "Calendar of Canada Earnings Expected in the Week Ahead",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Major companies tentatively scheduled to report quarterly earnings in the week ahead, with earnings estimates provided by FactSet Research Systems Inc.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Company                                   Symbol     Quarter  Mean*  Report Time <br/> <br/>·Tuesday <br/>·Canaccord Genuity                         (CF.T)        3Q       .24       AMC <br/>·Finning Intl Inc.                         (FTT.T)       4Q       .87       AMC <br/>·Stingray Grp                              (RAY.A.T)     3Q       .33       AMC <br/>· <br/>·Wednesday <br/>·ATS Corp.                                 (ATS.T)       3Q       .35   6:00 AM <br/>·Aurora Cannabis                           (ACB.T)       3Q       .01       BMO <br/>·Dayforce Inc.                             (DAY.T)       4Q       .65   7:00 AM <br/>·FirstSvc Corp                             (FSV.T)       4Q      1.96   7:30 AM <br/>·Great-West Lifeco                         (GWO.T)       4Q      1.14   5:01 PM <br/>·Medexus Pharma.                           (MDP.T)       3Q       .05       AMC <br/>·Sangoma Tech Corp                         (STC.T)       2Q      (.03)  5:00 PM <br/>·Suncor Energy Inc.                        (SU.T)        4Q      1.16   7:00 PM <br/>· <br/>·Thursday <br/>·ARC Resources Ltd.                        (ARX.T)       4Q       .55       AMC <br/>·BCE Inc.                                  (BCE.T)       4Q       .72   7:00 AM <br/>·Bombardier Inc.                           (BBD.A.T)     4Q      2.90   6:30 AM <br/>·Bombardier Inc.                           (BBD.B.T)     4Q      2.94   6:30 AM <br/>·Canada Goose                              (GOOS.T)      3Q      1.54       BMO <br/>·Colliers Intl Gp                          (CIGI.T)      4Q      3.40   7:00 AM <br/>·Constellation Sftwr                       (CSU.T)       4Q     33.30 <br/>·IGM Fincl Inc.                            (IGM.T)       4Q      1.05       AMC <br/>·Lightspeed Comm                           (LSPD.T)      3Q       .15       BMO <br/>·Medicenna Therp                           (MDNA.T)      3Q      (.06) <br/>·Open Text Corp                            (OTEX.T)      2Q      1.31   4:00 PM <br/>·Rogers Sugar Inc.                         (RSI.T)       1Q       .16       BMO <br/>·Saputo Inc.                               (SAP.T)       3Q       .40       AMC <br/>·TerraVest Indus.                          (TVK.T)       1Q      1.09 <br/>·Thomson Reutersn                          (TRI.T)       4Q      1.38   6:30 AM <br/>·Trisura Grp Ltd.                          (TSU.T)       4Q       .63 <br/>· <br/>·Friday <br/>·CAE Inc.                                  (CAE.T)       3Q       .28 <br/>·Canopy Growth                             (WEED.T)      3Q      (.52)      BMO <br/>· <br/>·Monday <br/>·Coveo Solutions                           (CVO.T)       3Q      (.07)  4:01 PM <br/>·Quipt Home Med                            (QIPT.T)      1Q      (.06)      AMC <br/> </pre><p class=\"\">(Companies tentatively scheduled to report quarterly earnings over the next five trading days. At least three brokerage analysts must be forecasting an EPS for the company to be included in this report.</p><p class=\"\">The FactSet EPS estimate is the average of the estimates for operating earnings per share made by individual brokerage analysts surveyed by FactSet. FactSet assumes earnings estimates are on a diluted basis.)</p><p class=\"\">*All EPS values are provided in Canadian Dollars (CAD).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004533:0/",
            "pub_date": "2025-02-04 20:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004603:0",
            "title": "Bio-Techne Appoints Dr. Amy E. Herr to Board of Directors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bio-Techne Appoints Dr. Amy E. Herr to Board of Directors</p><p class=\"\">PR Newswire</p><p class=\"\">MINNEAPOLIS, Feb. 4, 2025</p><p class=\"\">MINNEAPOLIS, Feb. 4, 2025 /PRNewswire/ — Bio-Techne Corporation  today announced the appointment of Amy E. Herr, Ph.D. to serve as an independent director on the Company's Board of Directors beginning on February 1, 2025. Dr. Herr will serve on the Science &amp; Technology Committee of the Board of Directors.</p><p class=\"\">Dr. Herr is a Chancellor's Professor of Bioengineering at the University of California, Berkeley. Dr. Herr also currently serves as the Vice President of the Chan Zuckerberg Biohub Network, a group of nonprofit research institutes established to create tools required to understand the mysteries of the cell to ultimately cure, prevent, and manage human disease. Since joining the faculty at UC Berkeley in 2007, Dr. Herr has served in several university, national, and international leadership roles including as the Founding Executive Director of UC Berkeley's Bakar BioEnginuity Hub — an incubator for academic spin-out companies, and on the National Advisory Council for Biomedical Imaging and Bioengineering (NACBIB) for the National Institutes of Health, as well as governmental science advisory boards. Dr. Herr was a co-founder and advisory board member of Zephyrus Biosciences, which was acquired by Bio-Techne in 2016. Dr. Herr holds a Doctor of Philosophy in Mechanical Engineering from Stanford University and a Bachelor of Science in Engineering &amp; Applied Science from Caltech.</p><p class=\"\">Dr. Herr's appointment completes a two-year process by the Board of Directors to identify and appoint successors to retiring directors Randy Steer, who retired in 2024, and Dr. Roeland Nusse, who will be retiring later in 2025. Dr. Herr will succeed Dr. Roeland Nusse.</p><p class=\"\">\"Dr. Herr's deep biological and engineering experience are an ideal fit for our board and the strategic direction of the Company,\" said Kim Kelderman, Bio-Techne's President and Chief Executive Officer. \"We are elated to add someone with Dr. Herr's credentials to our board.\"</p><p class=\"\">\"We are pleased to welcome Dr. Herr to our board,\" said Bob Baumgartner, Chairman of the Board of Bio-Techne. \"She brings tremendous scientific experience to Bio-Techne. For example, Dr. Herr's extensive bioengineering background brings an important skillset as the Company continues to grow its proteomic analytical instrument business.\"</p><p class=\"\">About Bio-Techne</p><p class=\"\">Bio-Techne Corporation  is a global life sciences company providing innovative tools and bioactive reagents for the research and clinical diagnostic communities. Bio-Techne products assist scientific investigations into biological processes and the nature and progress of specific diseases. They aid in drug discovery efforts and provide the means for accurate clinical tests and diagnoses. With hundreds of thousands of products in its portfolio, Bio-Techne generated approximately $1.2 billion in net sales in fiscal 2024 and has approximately 3,100 employees worldwide. For more information on Bio-Techne and its brands, please visit https://www.bio-techne.com or follow the Company on social media at: Facebook, LinkedIn,  Twitter or YouTube.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Contact:  David Clair, Vice President, Investor Relations &amp; Corporate <br/>          Development david.clair@bio-techne.com 612-656-4416 <br/>          -------------------------------------------------------------------- <br/> </pre><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/bio-techne-appoints-dr-amy-e-herr-to-board-of-directors-302367293.html</p><p class=\"\">SOURCE Bio-Techne Corporation</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004603:0/",
            "pub_date": "2025-02-04 20:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204004609:0",
            "title": "BETMGM FY 2024 UPDATE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BETMGM FY 2024 UPDATE</p><p class=\"\">PR Newswire</p><p class=\"\">LAS VEGAS, Feb. 4, 2025</p><p class=\"\">2024 strategic refinement and delivery underpins confidence of positive EBITDA in 2025</p><p class=\"\">LAS VEGAS, Feb. 4, 2025 /PRNewswire/ — BetMGM LLC (\"BetMGM\"), one of the leading sports betting and iGaming operators across North America, jointly owned by MGM Resorts International  (\"MGM Resorts\") and Entain plc  (\"Entain\"), is today providing an update on its Fiscal Year 2024 (\"FY 2024\") performance.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">BetMGM's leading iGaming offering, strengthened sports product and   enhanced player engagement delivered accelerating growth and performance   metrics through 2024   </li><li class=\"listItem-bmN0_SHH\">Inflection in Online Sports strategy drives expectation of positive   Contribution1 in FY 2025   </li><li class=\"listItem-bmN0_SHH\">FY 2025 expected to be EBITDA1 positive with Net Revenue1 of $2.4 billion   to $2.5 billion   </li><li class=\"listItem-bmN0_SHH\">Reiterate confidence in our pathway to $500 million EBITDA supported by   scale, revenue growth and operational leverage </li></ul><p class=\"\">Adam Greenblatt, Chief Executive Officer of BetMGM, commented:</p><p class=\"\">\"2024 was a year of investment and rebuilding of momentum for BetMGM. Our successful strategic refinement saw BetMGM exit the year with encouraging run rates across our key metrics and Q4 EBITDA trend towards breakeven on a normalized basis(2) . Our leading iGaming business continues to grow strongly and deliver attractive returns. We also have an exciting opportunity in Online Sports, having made meaningful progress in 2024. Our improved product, accelerating growth and enhanced efficiency drive our expectation of Online Sports being Contribution positive for FY 2025. With BetMGM's renewed acceleration across both iGaming and Online Sports we expect to achieve positive EBITDA in 2025, and our scaled podium position in the world's largest gaming market underpins our confidence in our pathway to $500 million EBITDA in the coming years.\"</p><p class=\"\">Key Financial Highlights for Half Year and Full Year 2024</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                        2024 BetMGM Financial Summary(1,2,3,4) <br/>-------------------------------------------------------------------------------------- <br/>$ millions except <br/>percentages and <br/>average monthly        FY       YoY %       2H      YoY %       1H     YoY %     FY <br/>actives                2024     Change     2024     Change     2024    Change    2023 <br/>------------------   -------  ----------  ------  ----------  ------  -------  ------- <br/>Net Revenue(5) <br/>                                    +13%                +15% <br/>         iGaming      $1,479   +15% adj.    $784   +19% adj.    $695    +10 %   $1,313 <br/>        Online                       +4%                 +2% <br/>         Sports          554   +17% adj.     292   +29% adj.     262     +5 %      535 <br/>             Handle  $13,075       +20 %  $7,161       +33 %  $5,914     +8 %  $10,860 <br/>         GGR Hold %    8.6 %     (90)bps   8.3 %    (110)bps   9.0 %  (80)bps    9.6 % <br/>                                   (40)%               (50)% <br/>        Retail(3) /                (32)%               (32)% <br/>         Other           $70        adj.     $27        adj.     $42   (32) %     $117 <br/>                     -------  ----------  ------  ----------  ------  -------  ------- <br/>                                     +7%                 +8% <br/>       Total          $2,102   +13% adj.  $1,104   +19% adj.    $999     +6 %   $1,964 <br/> <br/>EBITDA                ($244)              ($121)              ($123)             ($62) <br/>                     -------  ----------  ------  ----------  ------  -------  ------- <br/> <br/>Average Monthly <br/> Actives <br/> (thousands)(6)          946       +14 %     966       +17 %     926    +12 %      827 <br/>-------------------  -------  ----------  ------  ----------  ------  -------  ------- <br/> </pre><p class=\"\">2024 Financial Highlights</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">2024 Net Revenue of $2.1 billion, grew +7% YoY, with growth and player   engagement metrics accelerating through the year   <br/> -- Record iGaming Net Revenue of $1.5 billion, up +13% YoY <br/> <br/> -- Online Sports Net Revenue up +4% with strengthened product and <br/> enhanced engagement   <br/> -- FY 2024 adjusted2 Net Revenue was up +13% YoY and Online Sports <br/> +17% YoY   <br/> -- Average Monthly Actives up 14% YoY reflecting strategic investment <br/> in player acquisition   </li><li class=\"listItem-bmN0_SHH\">2H saw continued momentum acceleration with adjusted Net Revenue up +19%,   compared to 6% growth in 1H   </li><li class=\"listItem-bmN0_SHH\">2024 EBITDA of ($244) million, consistent with 2024 as a year of   investment and includes approximately $50 million negative impact from   December's highly customer favorable sports results   <br/> -- iGaming achieved significant Contribution of $424 million in FY <br/> 2024   <br/> -- On a normalized basis, 4Q EBITDA trended towards breakeven <br/> demonstrating marketing optimization and growing operational   leverage   </li><li class=\"listItem-bmN0_SHH\">Market share stabilization at 14% GGR share in active markets7 with   iGaming (22%) and Online Sports (8%), and 15% NGR share, cementing   BetMGM's podium position in the market8   <br/> -- Launched sportsbook in North Carolina and district wide in <br/> Washington, D.C. in 2024   </li><li class=\"listItem-bmN0_SHH\">$150 million revolving credit facility secured and currently undrawn; no   further capital from parent companies expected </li></ul><p class=\"\">Delivering on Strategic Priorities</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Market leading iGaming offering   <br/> -- Record Average Monthly Actives (4Q +55% YoY) reflect our leading <br/> iGaming content supported by focused marketing investment   <br/> -- Active Player Days9 increased with players enjoying the extensive <br/> library of engaging real-money games, and unique free-to-play   games   <br/> -- Exclusive game releases, including omnichannel titles representing <br/> 7 of top 10 highest grossing slot games played10   <br/> -- Largest regulated U.S. online jackpot ever paid; $6.5 million in <br/> New Jersey   </li><li class=\"listItem-bmN0_SHH\">Strengthened Online Sports product with enhanced player engagement   approach   <br/> -- Greater market availability with richer pricing and unique <br/> features improving parlay betting and engagement   <br/> -- +41% increase in MLB Same Game Parlay (\"SGP\") bets per <br/> active11   <br/> -- +2.2ppt growth in NFL SGP bet mix12 <br/> <br/> -- Enhanced player experience with features including quick bet, <br/> linear bet slip, and live bet tracking, driving improved   engagement and retention   <br/> -- +11.5ppt YoY improvement in cross-sell of online sports <br/> players to iGaming13   <br/> -- Optimized promotional strategy with enhanced segmentation and <br/> predictive modeling   </li><li class=\"listItem-bmN0_SHH\">Unlocking unique omnichannel opportunities   <br/> -- First sports betting app to offer bettors in Nevada a seamless, <br/> nationwide, digital wallet, allowing players to continue their   BetMGM experience when travelling to other regulated states   <br/> -- Access to MGM Resort's 37,000 rooms provides an attractive <br/> acquisition channel with unique omnichannel advantages   <br/> -- Nevada-acquired First Time Depositors (\"FTDs\") increased <br/> 61% versus prior year football season, and the percentage   of those continuing to play after their visit doubled14   <br/> -- Enriched engagement with omnichannel game titles and exclusive <br/> live events for BetMGM players   <br/> -- Integration of BetMGM Rewards with MGM Resorts loyalty platform <br/> including Marriott Bonvoy   </li><li class=\"listItem-bmN0_SHH\">Ongoing commitment to player safety with responsible gambling prioritized   across our business   <br/> -- Promoted new industry best practices as a founding member of the <br/> Responsible Online Gaming Association (ROGA)   <br/> -- In partnership with MGM Resorts, expanded responsible gaming <br/> marketing to nine NFL stadiums   <br/> -- Launched BetMGM's first responsible gambling commercial featuring <br/> ambassador Connor McDavid </li></ul><p class=\"\">Outlook</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Acceleration achieved during 2024 with encouraging exit rate momentum   carrying into 2025   </li><li class=\"listItem-bmN0_SHH\">BetMGM expects FY 2025 to be EBITDA positive, an increase of   approximately $250 million YoY, with Net Revenue guidance of $2.4 billion   to $2.5 billion   <br/> -- 2025 iGaming Contribution is expected to exceed 2024 and Online <br/> Sports to be Contribution positive for the full year 2025   </li><li class=\"listItem-bmN0_SHH\">Established and scaled podium position in a large and growing total   addressable market, coupled with increasing operating leverage, reaffirms   our confidence in BetMGM's pathway to $500 million EBITDA in the coming   years </li></ul><p class=\"\">FY 2024 Conference Call &amp; Audio Webcast</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">An analyst call will be held today, Tuesday, February 4, 2025 at 9:00am   EST.   </li><li class=\"listItem-bmN0_SHH\">Participants may join via webcast or by conference call; dial in   approximately 10 minutes before the start of the call.   </li><li class=\"listItem-bmN0_SHH\">Live webcast link: BetMGM FY 2024 Results   </li><li class=\"listItem-bmN0_SHH\">To participate in the Q&amp;A, please use dial ins below and register via the   following link: Register for Q&amp;A </li></ul><p class=\"\">US Toll free         +  1 888 500 3691</p><p class=\"\">US                          +  1 646 307 1951</p><p class=\"\">UK Toll free       +44 800 358 0970</p><p class=\"\">UK                          +44 20 3433 3846</p><p class=\"\">Global Dial-In Numbers Access Code:    40609</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>  Contacts: <br/>   BetMGM <br/>  ------------------------------------------------------------------------------------------- <br/>  Witek Wacinski -- SVP Strategy &amp; Development                         witek.wacinski@betmgm. <br/>                                                                                          com <br/>MGM Resorts International <br/>--------------------------------------------------------------------------------------------- <br/>Investment Community Sarah Rogers -- Senior Vice President, Corporate  srogers@mgmresorts.com <br/>Finance                                                       Howard     hwang@mgmresorts.com <br/>Wang -- Vice President, Investor Relations                               media@mgmresorts.com <br/> <br/>News Media Brian Ahern - Executive Director, Communications <br/> <br/>  Entain plc <br/>  ------------------------------------------------------------------------------------------- <br/>  Investor Relations                                                   investors@entaingroup. <br/>                                                                                          com <br/>   Media                                                                 media@entaingroup.co <br/>                                                                                            m <br/> <br/> <br/> </pre><p class=\"\">Notes:</p><p class=\"\">1: Net Revenue, EBITDA, and Contribution are based on how management analyzes the performance of the business, which are not prepared in accordance with GAAP. Refer to \"Non-GAAP Financial Information\" section below for additional detail.</p><p class=\"\">2: Adjusted Net Revenue growth normalizes for Q4 2023 BetMGM rewards points adjustments across both Online Sports and iGaming, and December 2024 theoretical margin in sports; EBITDA adjustments include the associated flow through from the Net Revenue related adjustments plus additional cost adjustments related to prior year operations.</p><p class=\"\">3: BetMGM has not completed its financial closing procedures for the year ended December 31, 2024 and actual results can differ materially from these estimates. In addition, BetMGM's independent registered public accounting firm has not audited, reviewed or performed any procedures with respect to these preliminary estimates. During the course of the preparation of BetMGM's audited financial statements, BetMGM and its auditors may identify items that would require material adjustments to these estimates. As a result, these estimates constitute forward-looking statements and, therefore, investors are cautioned that they are subject to risks and uncertainties, including possible adjustments.</p><p class=\"\">4: Totals may not sum due to rounding.</p><p class=\"\">5: 2024 Revenue for BetMGM on a GAAP basis is expected to be approximately $2,061 million, including approximately $52 million primarily related to Nevada MGM Resorts operations for which BetMGM records on a net basis as BetMGM is considered to be the agent in the Nevada transactions for GAAP purposes. Refer to \"Non-GAAP Financial Information\" section below for additional detail.</p><p class=\"\">6: Average Monthly Actives are equal to the average of unique monthly actives over the period, regardless of product played; monthly actives include players that place 1+ bets within the month.</p><p class=\"\">7: BetMGM operates iGaming and Online Sports Betting in five markets and Sports Betting only (combined online and retail) in 24 markets.</p><p class=\"\">8: Consolidated Gross Gaming Revenue (GGR) market share consists of last three months ending October, November, or December 2024 as latest reported for U.S. sports betting markets where BetMGM was active (online and retail), last three months ending December 2024 for U.S. iGaming markets where BetMGM was active, and last three months ending December 2024 for the Ontario market. Internal estimates used where operator-specific results are unavailable. Estimated total North American Online Sports and iGaming Net Gaming Revenue (NGR) market share consists of NGR disclosed by public operators as of 3Q24.</p><p class=\"\">9. Active player days are equal to total player days over the period divided by the sum of total monthly actives over the same period.</p><p class=\"\">10: Omnichannel games include titles that are available both on the casino floor and digitally.</p><p class=\"\">11: MLB SGP bets per Active who placed 1+ SGP bet on an MLB market during the 2024 MLB season (same-store).</p><p class=\"\">12: NFL SGP mix reflects the percent of NFL bets during the 2024 NFL regular season that were Same Game Parlays (same-store).</p><p class=\"\">13: Cross-sell rate is the percent of Online Sports players in multi-product markets that placed 1+ iGaming bets. Measurement period reflects the NFL regular season.</p><p class=\"\">14: Represents the increase in the percentage of Nevada digital FTDs that have gone on to be active in their home Single Account Single Wallet (SASW) state after visiting Nevada following SASW launch in August 2024.</p><p class=\"\">Supplementary financial disclosures</p><p class=\"\">BetMGM has updated its financial disclosure practices, aiming to provide investors with more comprehensive and transparent information regarding its financial position and operations. These enhanced disclosures will include a more granular breakdown across different segments to provide greater insight into performance drivers.</p><p class=\"\">Forward-looking statements</p><p class=\"\">This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which involve substantial risks and/or uncertainties, including those described in the MGM Resorts International public filings with the Securities and Exchange Commission. BetMGM has based forward-looking statements on management's current expectations, assumptions and projections about future events and trends. Examples of these statements include, but are not limited to, BetMGM's expectations regarding its financial outlook (including forecasted net revenues from operations, EBITDA, and expected investment by Entain and MGM Resorts in 2024), projected market share position, its expected growth in new and existing jurisdictions, product capabilities, and achievement of key milestones. These forward-looking statements are not guarantees of future performance, conditions or results, and involve a number of known and unknown risks, uncertainties, assumptions and other important factors, that could cause actual results or outcomes to differ materially from those discussed in the forward-looking statements. Included among the important factors that could cause actual results to differ materially from those indicated in such forward-looking statements are: the significant competition within the gaming and entertainment industry; BetMGM's ability to execute on its business plan; changes in applicable laws or regulations, particularly with respect to iGaming and online sports betting; BetMGM's ability to manage growth and access the capital needed to support its growth plans; and BetMGM's ability to obtain the required licenses, permits and other approvals necessary to grow in existing and new jurisdictions. In providing forward-looking statements, BetMGM is not undertaking any duty or obligation to update these statements publicly as a result of new information, future events or otherwise, except as required by law. If BetMGM updates one or more forward-looking statements, no inference should be drawn that it will make additional updates with respect to those other forward-looking statements.</p><p class=\"\">Non-GAAP Financial Information</p><p class=\"\">In this press release we provide certain financial measures, including Net Revenue, EBITDA, and Contribution from operations, which have not been prepared in accordance with GAAP. BetMGM believes these measures, which it uses for its own analysis of operations, are useful to supplement the results presented in accordance with GAAP. These non-GAAP financial measures, which may not be comparable to other similarly titled measures presented by other companies, should not be considered a substitute for, or superior to, the financial information prepared in accordance with GAAP.  If BetMGM presented Net Revenue from operations in accordance with GAAP, then BetMGM would present the revenues associated with its Nevada digital and retail sports betting operations differently, until such time as BetMGM is licensed as a Nevada gaming operator. Currently under GAAP, its calculation of Net Revenue would be on a basis net of operating costs, such that the GAAP reported Net Revenue would be lower than the Net Revenue reported herein, with net income remaining the same. We define EBITDA as net income (loss) before the impact of interest income or expense (net), income tax provision or benefit, and depreciation and amortization.  We define Contribution as Net Revenue, less cost of revenue (exclusive of depreciation and amortization) and marketing acquisition spend.</p><p class=\"\">About BetMGM</p><p class=\"\">BetMGM is a market leading sports betting and gaming entertainment company, pioneering the online gaming industry. Born out of a partnership between MGM Resorts International  and Entain Plc , BetMGM has exclusive access to all of MGM Resorts' U.S. land-based and online sports betting, major tournament poker, and online gaming businesses. Utilizing Entain's U.S.-licensed, state-of-the-art technology, BetMGM offers sports betting and online gaming via market-leading brands including BetMGM, Borgata Casino, Party Casino and Party Poker. Founded in 2018, BetMGM is headquartered in New Jersey. For more information, visit www.betmgminc.com</p><p class=\"\">About MGM Resorts International MGM Resorts International  is an S&amp;P 500(R) global gaming and entertainment company with national and international locations featuring best-in-class hotels and casinos, state-of-the-art meetings and conference spaces, incredible live and theatrical entertainment experiences, and an extensive array of restaurant, nightlife and retail offerings. MGM Resorts creates immersive, iconic experiences through its suite of Las Vegas-inspired brands. The MGM Resorts portfolio encompasses 31 unique hotel and gaming destinations globally, including some of the most recognizable resort brands in the industry. The Company's 50/50 venture, BetMGM, LLC, offers sports betting and online gaming in North America through market-leading brands, including BetMGM and partypoker, and the Company's subsidiary, LV Lion Holding Limited, offers sports betting and online gaming through market-leading brands in several jurisdictions throughout Europe. The Company is currently pursuing targeted expansion in Asia through an integrated resort development in Japan. Through its \"Focused on What Matters: Embracing Humanity and Protecting the Planet\" philosophy, MGM Resorts commits to creating a more sustainable future, while striving to make a bigger difference in the lives of its employees, guests, and in the communities where it operates. The global employees of MGM Resorts are proud of their company for being recognized as one of FORTUNE(R) Magazine's World's Most Admired Companies(R). For more information, please visit us at www.mgmresorts.com. Please also connect with us @MGMResortsIntl on X as well as Facebook and Instagram.</p><p class=\"\">About Entain plc</p><p class=\"\">Entain plc  is a FTSE100 company and is one of the world's largest sports betting and gaming groups, operating both online and in the retail sector. The Group owns a comprehensive portfolio of established brands; Sports brands include BetCity, bwin, Coral, Crystalbet, Eurobet, Ladbrokes, Neds, Sportingbet, Sports Interaction, STS and SuperSport; Gaming brands include Foxy Bingo, Gala, GiocoDigitale, Ninja Casino, Optibet, Partypoker and PartyCasino. The Group operates the TAB NZ brand as part of a long-term strategic partnership with TAB New Zealand. The Group owns proprietary technology across all its core product verticals and in addition to its B2C operations, provides services to a number of third-party customers on a B2B basis.</p><p class=\"\">The Group has a 50/50 joint venture, BetMGM, a leader in sports betting and iGaming in the US. Entain provides the technology and capabilities which power BetMGM as well as exclusive games and products, specially developed at its in-house gaming studios. The Group is tax resident in the UK and is the only global operator to exclusively operate in domestically regulated or regulating markets operating in over 30 territories.</p><p class=\"\">Entain is a leader in ESG, a member of FTSE4Good, the DJSI and is AAA rated by MSCI. For more information see the Group's website: www.entaingroup.com</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/betmgm-fy-2024-update-302367085.html</p><p class=\"\">SOURCE BetMGM</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004609:0/",
            "pub_date": "2025-02-04 20:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}