{
    "data": [
        {
            "id": "urn:summary_document_report:quartr.com:2947573:0",
            "title": "NWN: Net income surged to $113.3M on higher rates and acquisitions, with strong customer and revenue growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net income rose to $113.3M, driven by new rates, acquisitions, and strong customer growth. Capital expenditures reached $466.9M, and the company maintained a robust capital structure and liquidity. Regulatory, operational, and market risks remain key considerations.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947573-55c4c0615c05ef5c9835b778d6a9765a\" target=\"_blank\">Northwest Natural Holding Company [NWN] SEC 10-K Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947573:0-nwn-net-income-surged-to-113-3m-on-higher-rates-and-acquisitions-with-strong-customer-and-revenue-growth/",
            "pub_date": "2026-02-28 02:35:08",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:1cebf9859094b:0",
            "title": "Novo Nordisk Shares Sink 21% as Obesity Shot Trails Lilly Rival",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Novo Nordisk </span><span> has now surrendered the last of the gains that followed the 2021 US approval of Wegovy, marking a decisive turn in what had been one of Europe's most powerful pharmaceutical rallies. After a week in which the shares fell 21%, the stock is on track for its steepest weekly drop since August, surpassing the more than 20% slide earlier this month that came after a dire sales forecast. The reversal effectively erases a roughly fivefold surge built over several years, compressing in less than two years what had once propelled Novo to become briefly Europe's most valuable company and placing renewed pressure on Chief Executive Officer Mike Doustdar to consider broadening the company's focus beyond diabetes and obesity.</span></p><p class=\"\"><span>The immediate catalyst was new data for Novo's next-generation obesity shot CagriSema, which delivered 20.2% weight loss, compared with 23.6% achieved by Eli Lilly &amp; Co.'s </span><span> next-generation candidate tirzepatide. While Doustdar highlighted the 20.2% figure on an investor call after an analyst suggested the drug looks somewhat obsolete, several research teams responded cautiously. Five analysts downgraded the shares following the update, including Deutsche Bank's Emmanuel Papadakis, who shifted to hold, and JPMorgan's Richard Vosser, who moved to neutral, both pointing to potential limits on the drug's commercial outlook. The developments have further underscored how Novo and Eli Lilly's trajectories have diverged as competition in obesity treatments intensifies.</span></p><p class=\"\"><span>Against that backdrop, some analysts argue the near-term thesis may now lean heavily on the newly launched Wegovy pill. Doustdar said more than 240,000 Americans have already taken the pill, describing it as one of the most successful pharmaceutical debuts ever. Intron Health analyst Naresh Chouhan warned that if there were any material slowdown from what has been a strong launch, the shares could de-rate further. Looking beyond the immediate data, HSBC's Rajesh Kumar suggested Novo's ability to manage its obesity franchise past the 2032 patent cliffs may come under increasing scrutiny as rivals advance higher-efficacy and less-frequent dosing drugs, potentially adding another layer to the investment debate.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:1cebf9859094b:0-novo-nordisk-shares-sink-21-as-obesity-shot-trails-lilly-rival/",
            "pub_date": "2026-02-28 02:35:28",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2FP:0",
            "title": "Biglari Capital Calls For Immediate Resignation Of Jack In The Box Chairman David Goebel",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BIGLARI CAPITAL: </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BIGLARI CAPITAL CALLS FOR IMMEDIATE RESIGNATION OF JACK IN THE BOX CHAIRMAN DAVID GOEBEL, WHO WAS OVERWHELMINGLY REJECTED BY STOCKHOLDERS WITH \"SKIN IN THE GAME\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BIGLARI CAPITAL: RESERVES RIGHT TO PURSUE ALL AVAILABLE LEGAL REMEDIES AGAINST JACK IN THE BOX</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2FP:0-biglari-capital-calls-for-immediate-resignation-of-jack-in-the-box-chairman-david-goebel/",
            "pub_date": "2026-02-28 02:35:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009014:0",
            "title": "Neurogene Initiated at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:36 GMT) </span></strong><span>Neurogene Price Target Announced at $200.00/Share by Canaccord Genuity</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009014:0/",
            "pub_date": "2026-02-28 02:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009006:0",
            "title": "Block Was Already Eyeing Job Cuts Before AI Shifts — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Block's mass job cuts were clearly motivated by AI, but RBC Capital Markets analysts think the company was already moving toward a material shrink in workforce. Block has had siloed structures for Cash App and Square, and in 2023 made several rounds of job reductions to remove duplication and redundancies, the RBC analysts say. CEO Jack Dorsey said he chose to make all the job cuts at once to avoid frequent eliminations that would erode morale. The analysts think this suggests Block is making a \"one and done reduction\" to settle potential ongoing concerns for surviving employees. (katherine.hamilton@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009006:0/",
            "pub_date": "2026-02-28 02:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN1Q6:0",
            "title": "Warner Bros signs $110 billion deal with Paramount, its executive discloses in townhall",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Karol Badohal and Harshita Mary Varghese</span></p><p class=\"\"><span>    Warner Bros Discovery </span><span> has agreed to be acquired by Paramount Skydance </span><span> in a $110 billion deal signed Friday morning, according to an audio clip of a global townhall by the company, which was reviewed by Reuters.</span></p><p class=\"\"><span>\"Netflix had the legal right to match the PSKY offer. As you all know, they ultimately decided not to do that. That then resulted in a signed agreement with PSKY as of this morning. So that's where everything stands,\" Bruce Campbell, Warner Bros' chief revenue and strategy officer, said in the townhall.</span></p><p class=\"\"><span>Paramount and Warner Bros did not immediately respond to requests for comment.</span></p><p class=\"\"><span>The deal - which includes some $29 billion in debt - is among Hollywood's biggest media shake-ups and will create one of the largest film studios in the world, allowing Paramount to tap Warner's trove of intellectual property, including franchises such as \"Fantastic Beasts\" and \"The Matrix\".</span></p><p class=\"\"><span>It will also allow Paramount to bolster its streaming efforts, with a potential combination of HBO Max and Paramount+, enabling it to gain market share and tussle with market leader Netflix. </span></p><p class=\"\"><span>The agreement caps a bidding war after Netflix declined to match Paramount's latest $31-per-share offer, which was deemed superior by Warner Bros to the streaming pioneer's $27.75-per-share agreement for its assets.</span></p><p class=\"\"><span>Paramount was in pursuit of Warner Bros since late last year when it launched a hostile campaign to wrestle the company from the streaming giant by consistently raising its offer. </span></p><p class=\"\"><span>The company, led by billionaire Larry Ellison's son David Ellison, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</span></p><p class=\"\"><span>In its revised bid, Paramount raised the termination fee it would pay should the deal fail to gain regulatory approval to $7 billion from $5.8 billion. </span></p><p class=\"\"><span>Activist investor Ancora Holdings, which owns a small stake in Warner Bros, had also stepped up pressure on the HBO owner to engage more with Paramount.</span></p><p class=\"\"><span>Still, the merger is likely to draw antitrust scrutiny in Washington, foreign countries and U.S. states, including California, despite the Ellisons' ties to President Donald Trump. </span></p><p class=\"\"><span>Lawmakers on both sides of the political aisle have raised concerns that any deal to acquire Warner Bros could result in fewer choices and higher prices for consumers. </span></p><p class=\"\"><span>Cinema operators are also concerned that combining large Hollywood studios could cost jobs and reduce the number of movies released in theaters.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN1Q6:0-warner-bros-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall/",
            "pub_date": "2026-02-28 02:36:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006086:0",
            "title": "Amazon Leads Record $110 Billion OpenAI Funding Round. AWS Is Why. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Mackenzie Tatananni and Adam Levine</span></p><p class=\"\"><span>Amazon.com unveiled a strategic partnership with OpenAI that includes a $50 billion investment in the ChatGPT maker and positions Amazon Web Services to compete more effectively in AI computing.</span></p><p class=\"\"><span>Under the terms of the deal, Amazon Web Services will be the exclusive third-party cloud distribution provider for OpenAI Frontier, which allows users to build, deploy, and manage teams of artificial-intelligence agents. Amazon will make an initial $15 billion investment, with the remaining $35 billion coming after certain conditions are met.</span></p><p class=\"\"><span>The partners pledged to create a computing environment powered by OpenAI models that will be available for AWS customers \"to build generative AI applications and agents at production scale.\"</span></p><p class=\"\"><span>OpenAI and Amazon also plan to develop customized models that can power Amazon's customer-facing applications. The agreement comes with a pledge from OpenAI to use 2 gigawatts of capacity from Amazon's Trainium chips. This gives AWS some traction among the crowd of producers of AI chips trying to steal some of Nvidia's business.</span></p><p class=\"\"><span>Amazon shares ticked up 0.1% on Friday morning. The tech-heavy Nasdaq Composite was down 0.9%.</span></p><p class=\"\"><span>OpenAI said separately Friday that it had closed a $110 billion funding round, more than double the $40 billion it raised last year. The figure includes the $50 billion from Amazon, $30 billion from SoftBank, and $30 billion from Nvidia.</span></p><p class=\"\"><span>The $110 billion funding round is by far the largest ever. Early investor Microsoft remains the biggest outside shareholder.</span></p><p class=\"\"><span>The investment brings OpenAI to a $730 billion so-called pre-money valuation, up from $500 billion in October.</span></p><p class=\"\"><span>The partnerships with Amazon, Nvidia, and the like \"expand our global reach, deepen our infrastructure, and strengthen our balance sheet so we can bring frontier AI to more people, more businesses, and more communities worldwide,\" OpenAI said in a blog post.</span></p><p class=\"\"><span>OpenAI is a customer of both Amazon and Nvidia, so much of their investments will wind up in those companies' pockets.</span></p><p class=\"\"><span>More importantly for investors, the latest funding arrives before a possible OpenAI initial public offering. Multiple reports have suggested the company could make its trading debut as soon as the second half of the year.</span></p><p class=\"\"><span>The developments come at a time when concerns over artificial-intelligence disruption have reached a fever pitch. Software stocks have been hammered in a broad-based selloff that reflects a downward spiral in tech valuations.</span></p><p class=\"\"><span>Although Nvidia reported blowout earnings on Wednesday, the results failed to assuage investor concerns over the longevity of the AI boom. Shares of the chip maker suffered their worst single-day drop in nearly a year on Thursday.</span></p><p class=\"\"><span>OpenAI has about a trillion dollars in multiyear commitments via contracts with Oracle, Microsoft, Nvidia, Advanced Micro Devices and others. While revenue is growing very quickly at the start-up, even under generous assumptions the sales will probably not be enough to fulfill these long-term commitments profitably. OpenAI may have to scale back its ambitions, or keep returning to funding markets to push forward.</span></p><p class=\"\"><span>Amazon backed almost half of the new round, which appears to be no accident. The AI offerings at AWS were losing out to competitors Microsoft Azure, Google Cloud, and even smaller cloud providers. Hosting Frontier puts AWS on better footing.</span></p><p class=\"\"><span>Write to Mackenzie Tatananni at mackenzie.tatananni@barrons.com and Adam Levine at adam.levine@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006086:0/",
            "pub_date": "2026-02-28 02:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:ce5108f4d62f6:0",
            "title": "Amadeus IT Group SA Profit Climbs In Full Year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MADRID (dpa-AFX) - Amadeus IT Group SA (AMS.MC) revealed earnings for its full year that Increases, from last year</span></p><p class=\"\"><span>The company's earnings totaled EUR1.336 billion, or EUR3.01 per share.  This compares with EUR1.253 billion, or EUR2.79 per share, last year.</span></p><p class=\"\"><span>Excluding items, Amadeus IT Group SA reported adjusted earnings of EUR1.420 billion or EUR3.20 per share for the period.</span></p><p class=\"\"><span>The company's revenue for the period rose 6.1% to EUR6.517 billion from EUR6.142 billion last year.</span></p><p class=\"\"><span>Amadeus IT Group SA earnings at a glance (GAAP) :</span></p><p class=\"\"><span>-Earnings: EUR1.336 Bln. vs. EUR1.253 Bln. last year.</span></p><p class=\"\"><span>-EPS: EUR3.01 vs. EUR2.79 last year.</span></p><p class=\"\"><span>-Revenue: EUR6.517 Bln vs. EUR6.142 Bln last year.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:ce5108f4d62f6:0-amadeus-it-group-sa-profit-climbs-in-full-year/",
            "pub_date": "2026-02-28 02:38:35",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009026:0",
            "title": "Arlo Technologies Surges on 4Q Earnings Beat, Outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Elias Schisgall</span></p><p class=\"\"><span>Shares of Arlo Technologies rose after the company swung to a profit in the fourth quarter and issued upbeat guidance for the current first quarter.</span></p><p class=\"\"><span>Shares surged 31% to $16.20 in Friday afternoon trading. The stock is up 36% over the past year.</span></p><p class=\"\"><span>The home security company on Thursday posted a profit of $5.8 million, or 5 cents a share, compared with a loss of $4.9 million, or 5 cents a share, a year earlier.</span></p><p class=\"\"><span>Stripping out certain one-time items, the company logged adjusted earnings of 22 cents a share. Analysts polled by FactSet were expecting 16 cents a share.</span></p><p class=\"\"><span>Revenue rose to $141.3 million, up from $121.6 million a year earlier. Analysts were expecting $135.6 million.</span></p><p class=\"\"><span>For the current quarter, Arlo is expecting revenue between $135 million and $145 million, with adjusted earnings between 17 cents and 23 cents a share.</span></p><p class=\"\"><span>Analysts are expecting $138.4 million in revenue and adjusted per-share earnings of 18 cents.</span></p><p class=\"\"><span>Write to Elias Schisgall at elias.schisgall@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009026:0/",
            "pub_date": "2026-02-28 02:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:ef05af864094b:0",
            "title": "MARA Holdings Stock Rallies Despite Caution From Analysts Around AI Pivot",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>MARA Holdings announced it has entered into a strategic agreement with Starwood Capital Group and their dedicated data center development platform Starwood Digital Ventures on Thursday. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>H.C. Wainwright downgraded Mara Holdings to ‘Neutral’ from ‘Buy’ without a price target.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Cantor Fitzgerald lowered the firm's price target on Mara Holdings to $11 from $21 and kept an ‘Overweight’ rating on the shares.</span></li></ul></span></div><span><p class=\"\"><span>MARA Holdings’ recent Starwood deal buoyed retail trader sentiment on Friday even as several Wall Street analysts downgraded the stock. </span></p><p class=\"\"><span>Shares of the company traded 10% higher at the time of writing. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users’ React?</span></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment around MARA trended in the ‘extremely bullish’ territory amid ‘extremely high’ message volume. </span></p><p class=\"\"><span>One bullish user said that the “Starwood deal could imply ~$2 billion in annual revenue potential at scale!!!”</span></p><p class=\"\"><span>https://stocktwits.com/anokato/message/646125633</span></p><p class=\"\"><span>Another bullish user wrote, “Pretty sure this is oversold. I wish I had extra money to buy.”</span></p><p class=\"\"><span>https://stocktwits.com/gotitoutthemud/message/646124552</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Starwood Deal</span></strong></p><p class=\"\"><span>MARA Holdings on Thursday </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/mara-stock-is-rallying-today-what-is-all-the-buzz-about/cZTGrGCRIRW\" rel=\"nofollow\" target=\"_blank\">announced</a><span> it has entered into a strategic agreement with Starwood Capital Group and their dedicated data center development platform Starwood Digital Ventures. Together, the companies expect to deliver approximately 1 gigawatt of near-term IT capacity with a pathway to more than 2.5 gigawatts.</span></p><p class=\"\"><span>The companies will prioritize sites with access to low-cost energy, strong interconnection positions, and clear pathways to scale. These campuses will be designed to operate both Bitcoin mining and AI compute, giving MARA the ability to toggle workloads in response to market pricing and customer demand.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Downbeat Analysts</span></strong></p><p class=\"\"><span>H.C. Wainwright downgraded Mara Holdings to ‘Neutral’ from ‘Buy’ without a price target as the firm slashed its FY26 sales forecast to $851.1 million from $954.8 million, primarily driven by a downward revision to its bitcoin price outlook throughout 2026. </span></p><p class=\"\"><span>H.C. Wainwright sees risks associated with Mara's pronounced pivot to AI and hyperscale data centers and while it recognizes potential value in both its tie to Starwood Capital Group and Exiaon, success at both is hinging on securing large leases that have \"proven to materialize slowly amid current peak demand,\" the analyst told investors.</span></p><p class=\"\"><span>Cantor Fitzgerald lowered the firm's price target on Mara Holdings to $11 from $21 and kept an ‘Overweight’ rating on the shares. Mara's Q4 results showed a 19.8% quarter over quarter decline in mining revenue and negative adjusted core profit amid lower Bitcoin prices, the analyst told investors in a research note.</span></p><p class=\"\"><span>Shares in the company have fallen 34% over the past year. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:ef05af864094b:0/",
            "pub_date": "2026-02-28 02:39:04",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0c6618f5d35ce:0",
            "title": "IAMGOLD Corp Director Sells 31,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>IAMGOLD Corp Director, Smith David Stewart, sold a total of 31,000 shares of common stock on February 27, 2026, at varying prices with a weighted average price of approximately $32.85 CAD. The total sale amount was $1,018,881. Following these transactions, Stewart directly owns 20,000 shares of IAMGOLD Corp.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Smith David Stewart</span></td></tr><tr><td><span>Relationship</span></td><td><span>Director</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$1,018,881</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1647943/000164794326000001/xslF345X05/primary_doc.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1647943/000164794326000001/xslF345X05/primary_doc.xml\" rel=\"nofollow\" target=\"_blank\">IAMGOLD CORP [ IAG ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:0c6618f5d35ce:0-iamgold-corp-director-sells-31-000-shares/",
            "pub_date": "2026-02-28 02:40:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:5c1b2fc36f9c1:0",
            "title": "Independent Review Raises Safety Concerns Over ChatGPT Health Feature",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>WASHINGTON (dpa-AFX) - OpenAI introduced a limited rollout of ChatGPT's 'Health' feature in January, positioning it as a tool that allows users to securely link medical records and wellness apps to receive personalized health guidance. Several reports revealed that more than 40 million people turn to ChatGPT daily for health-related queries.</span></p><p class=\"\"><span>However, the first independent safety review of ChatGPT Health, published in Nature Medicine, found that the system underestimated the urgency of more than half the medical scenarios it was given.</span></p><p class=\"\"><span>Lead researcher Dr. Ashwin Ramaswamy said the study aimed to address a fundamental safety concern- whether someone facing a real medical emergency would be advised to seek immediate care if they consulted ChatGPT Health.</span></p><p class=\"\"><span>The study, titled ChatGPT Health performance in a structured test of triage recommendations, evaluated how well the system could determine the seriousness of medical situations. Researchers used 60 clinician-written case scenarios covering 21 medical fields and tested them under 16 varying conditions, resulting in 960 responses.</span></p><p class=\"\"><span>The system was asked to guide multiple versions of each case, for example, by altering the patient's gender, adding lab results, or including input from relatives, producing nearly 1,000 responses overall. These recommendations were then compared with assessments made by doctors.</span></p><p class=\"\"><span>While ChatGPT Health showed strong performance in clear-cut emergencies such as stroke and severe allergic reactions, it was less reliable in more nuanced cases. In one asthma-related scenario, for instance, it is recommended to wait instead of seeking urgent care, despite recognizing early signs of respiratory distress.</span></p><p class=\"\"><span>In over half of the situations where immediate hospital care was necessary, the platform advised users to remain at home or arrange a routine appointment. Alex Ruani, a doctoral researcher specializing in health misinformation at University College London, described such outcomes as highly concerning.</span></p><p class=\"\"><span>In one simulated case, the system directed a woman struggling to breathe toward a future appointment in 84% of responses, Ruani noted. At the same time, nearly 65% of individuals who were not in danger were told to seek urgent care.</span></p><p class=\"\"><span>The findings also showed that the system was significantly more likely to downplay symptoms when the scenario included reassurance from a 'friend', suggesting the issue was not serious.</span></p><p class=\"\"><span>Responding to the study, OpenAI said it welcomes independent evaluations but emphasized that the research may not fully represent real-world use. The company added that its models are continually updated and improved.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:5c1b2fc36f9c1:0-independent-review-raises-safety-concerns-over-chatgpt-health-feature/",
            "pub_date": "2026-02-28 02:40:18",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0YG:0",
            "title": "Cheniere gets $370 million 'alternative fuel' tax break from Trump's IRS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Timothy Gardner</span></p><p class=\"\"><span>    Cheniere Energy Inc </span><span> disclosed this week that it got a $370 million tax break from the Trump administration for burning liquefied natural gas in its massive tankers, a credit critics said was meant for far smaller boats. </span></p><p class=\"\"><span>The company said on Thursday in financial disclosures that it had won the alternative fuels tax break from the IRS. The tax credit was in a law signed by former President George W. Bush in 2005 that was designed to subsidize an array of alternative fuels derived from sources including biomass, coal and natural gas. </span></p><p class=\"\"><span>The credit was designed to be claimed by parties operating motor vehicles or motorboats. The IRS does not define the size of a motorboat, but other federal regulations define them as smaller than 65 feet long (20 m), tiny compared to LNG tankers, which can measure about three football fields long.  </span></p><p class=\"\"><span>\"Cheniere took a very aggressive position\" on the tax credit, said William Henck, a former IRS lawyer. \"Does a tanker sound like a motorboat?\"</span></p><p class=\"\"><span>Lukas Shankar-Ross, a deputy director at the environmental nonprofit group Friends of the Earth, called Cheniere's claiming of the credit a \"new kind of fabulous and incredulous interpretation of the tax code that has been rubber-stamped by an IRS whose independence is increasingly in question.\"</span></p><p class=\"\"><span>Cheniere's disclosure was first reported by the Washington Post.</span></p><p class=\"\"><span>Cheniere, whose CEO Jack Fusco donated to President </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a><span> 2024 campaign, declined to comment. The IRS did not immediately respond to a request for comment. </span></p><p class=\"\"><span>Cheniere, which exported the first LNG cargo from the lower 48 states 10 years ago, told Reuters earlier that it has invested $50 billion in growing its two export facilities in </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/texas/\" rel=\"nofollow\" target=\"_blank\">Texas</a><span> and </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/louisiana/\" rel=\"nofollow\" target=\"_blank\">Louisiana</a><span> over the decade and aims to double output to 100 million tons per annum by the mid-2030s.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0YG:0-cheniere-gets-370-million-alternative-fuel-tax-break-from-trump-s-irs/",
            "pub_date": "2026-02-28 02:29:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:6967ac3ae094b:0",
            "title": "Lululemon Founder Calls Board Response Weak as Shares Slide 10%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Lululemon Athletica </span><span> is facing a more forceful challenge from its founder, Chip Wilson, who has intensified his campaign for board changes at the yogawear retailer. In a letter to shareholders, Wilson argued that the company's responses to his earlier proposals have been weak and insufficient, and reiterated his slate of three director nominees. He also said he has a strong feeling that additional board members should be replaced, positioning the effort as a push to catalyze what he described as a quantum of change at Lululemon. The company did not immediately respond to requests for comment.</span></p><p class=\"\"><span>The timing underscores the operational and market pressure already surrounding the business. Shares fell as much as 2.2% in premarket trading following the letter, adding to a roughly 10% decline this year after losing nearly half their value in 2025. Lululemon remains without a permanent chief executive officer and is expected to report its slowest annual sales growth since going public in 2007. Attempts to win back shoppers through brighter colors and more prominent logos have not gained traction, and prior product missteps have added to the scrutiny.</span></p><p class=\"\"><span>Wilson's renewed push comes alongside heightened activist interest. Elliott Investment Management disclosed a stake of more than $1 billion in the company late last year, signaling that shareholder pressure could continue to build. With leadership unsettled, growth moderating and influential investors calling for change, the coming quarters could be pivotal for Lululemon as shareholders assess whether governance shifts might help stabilize performance and restore confidence.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:6967ac3ae094b:0-lululemon-founder-calls-board-response-weak-as-shares-slide-10/",
            "pub_date": "2026-02-28 02:29:53",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008974:0",
            "title": "Yields Dive Below 4%, Bond Spreads Hit Yearly Highs as Traders Get Spooked — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Karishma Vanjani</span></p><p class=\"\"><span>Traders are accepting Treasuries at a more expensive price tag, but are demanding more compensation to buy corporate debt. The split exposes deepening concerns among investors over AI.</span></p><p class=\"\"><span>Yields have dropped to 2026 lows while credit spreads have widened to their highs this year. The yield on a virtually risk-free U.S. 10-year Treasury debt traded as low as 3.978% on Friday, its lowest intraday value since Nov. 28. Lower yields mean higher prices for Treasuries since the two move in opposite directions.</span></p><p class=\"\"><span>Spreads, or the extra money companies must pay over a risk-free Treasury, for reputed company bonds are at 0.82 percentage points on average, the highest since Nov. 25.</span></p><p class=\"\"><span>Spreads for more unstable companies, or on junk bonds, are sitting at 2.82 percentage points, the highest since December.</span></p><p class=\"\"><span>Investors are increasingly concerned about capital expenditures by mega-cap tech companies and how AI could disrupt different sectors. Nervous capital has fled the volatility of the stock market — and now even the corporate bond market — to seek refuge in the stability of U.S. Treasuries.</span></p><p class=\"\"><span>The potential for another U.S. military campaign against Iran is also pushing 10-year yields lower. Oil, as measured by the West Texas Intermediate benchmark, is up 2.1% to $66.89, a sign investors fear more conflict.</span></p><p class=\"\"><span>\"Investor concern is undoubtedly justified at the moment,\" wrote Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets, in a note to clients. \"This is a constructive shift for Treasuries.\"</span></p><p class=\"\"><span>For companies, that means they have to pay a higher dollar to attract investors. In January, America's safest companies were paying investors near 0.75 percentage points in additional yield on average, a level matching 1998 lows.</span></p><p class=\"\"><span>Feels like its go time for bears.</span></p><p class=\"\"><span>Write to Karishma Vanjani at karishma.vanjani@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008974:0/",
            "pub_date": "2026-02-28 02:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:fa3b98fce094b:0",
            "title": "Video - CEO Clips: Erdene Resource Development Advances High-Grade Gold Project in Mongolia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Erdene Resource Development </span><span> (OTCQX: ERDCF) is producing at a high-grade gold project in an underexplored district in Mongolia while progressing studies and exploration on gold, copper and molybdenum prospects. The company's first mover position and strategic local partnership support continued exploration and multi-commodity growth.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Erdene Resource Development. </span><span> (OTCQX: ERDCF)</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/zAJGGFjoxA\" rel=\"nofollow\" target=\"_blank\">https://erdene.com/</a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About BTV - Business Television:</span></strong></p><p class=\"\"><span>For over 25 years, BTV has been a capital markets focused TV production and Digital Marketing Agency. BTV helps companies increase their brand awareness to a national retail and institutional investor audience, combining unique content creation and major distribution services on top tier networks including Bloomberg, CNBC, FOX Business News and financial sites. The BTV suite of strategic products include: BTV- Business Television Show, CEO Clips™, TV Branding Ads, Digital, Lead Gen, Social and Direct Email Marketing Campaigns that reach investors where they research and live on-air and online.</span></p><p class=\"\"><span>Discover Investment Opportunities!</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/4YByyuQPnm\" rel=\"nofollow\" target=\"_blank\">www.b-tv.com/theagency </a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About CEO Clips:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CEO Clips</span></strong><span> - are short company video profiles broadcast to a large audience of investors on TV and 15+ financial sites including Reuters, Yahoo!Finance, and Wall Street Journal.</span></p><p class=\"\"><span>Contact: Trina Schlingmann (604) 664-7401 x 5 trina@b-tv.com </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:fa3b98fce094b:0-video-ceo-clips-erdene-resource-development-advances-high-grade-gold-project-in-mongolia/",
            "pub_date": "2026-02-28 02:30:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa8049Ua:0",
            "title": "REG - RNS - Final Announcement Released",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><span>RNS Number : 8049U  RNS  27 February 2026   This is the end of day message for the RNS system Friday 27 February 2026.This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  EODTRMPTMTJTBMF</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa8049Ua:0-reg-rns-final-announcement-released/",
            "pub_date": "2026-02-28 02:30:15",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947569:0",
            "title": "PSTG: Hyperscaler revenue and enterprise demand drive accelerated growth, supported by new models",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Management expects hyperscaler revenue to ramp in FY27, driven by a new business model and strong customer relationships. Broad-based demand, especially in enterprise and AI, supports accelerated growth, while strategic acquisitions and supply chain efficiencies enhance competitiveness.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947569:0-pstg-hyperscaler-revenue-and-enterprise-demand-drive-accelerated-growth-supported-by-new-models/",
            "pub_date": "2026-02-28 02:30:44",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947570:0",
            "title": "Sunstone Hotel Investors: Q4 beat expectations; 2026 outlook strong with growth in RevPAR, earnings, and capital returns",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Fourth quarter results exceeded expectations, led by strong resort and Andaz Miami Beach performance. 2026 guidance calls for 4%-7% rooms RevPAR growth and 5% earnings growth, with continued capital returns and disciplined asset recycling. </span></p><p class=\"\"><span>Based on Sunstone Hotel Investors Q4 2025 Audio Transcript — Feb. 27 2026</span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947570:0-sunstone-hotel-investors-q4-beat-expectations-2026-outlook-strong-with-growth-in-revpar-earnings-and-capital-returns/",
            "pub_date": "2026-02-28 02:30:45",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008982:0",
            "title": "argenx Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008982:0/",
            "pub_date": "2026-02-28 02:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008986:0",
            "title": "Block's Job Cuts Seen as Case Study for AI's Employment Impact — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Block's 40% workforce reduction could be a case study for how AI investments may adversely impact employment rates, Truist analyst Matthew Coad says. A reduction the size of Block's is extremely rare for an S&amp;P 500 company, says Coad, who could only find one other example (General Motor's cut of 47% of its workforce). Improvement in AI models influenced Block's decision to cut employees and the cuts will help Block invest in AI engineers and investors, Coad says. Block's headcount will be where it was before the pandemic, and will create a chance to catch up with peers like Affirm and Toast, Coad says. (katherine.hamilton@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008986:0/",
            "pub_date": "2026-02-28 02:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008990:0",
            "title": "U.S. Oil Rig Count Falls to 407 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The number of rigs drilling for oil in the U.S. fell by two this week to 407, and was down by 79 from a year ago, oil services company Baker Hughes reports. Natural gas rigs edged up by one to 134, or 32 more than a year ago. The EIA forecasts U.S. oil production this year to hold steady at 13.6 million barrels a day on average. But the slowdown in drilling activity due to lower oil prices is expected to have an effect on output in 2027, when the agency sees production falling to 13.3 million barrels a day. (anthony.harrup@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008990:0/",
            "pub_date": "2026-02-28 02:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:7643b1dfaa3ee:0",
            "title": "Presurance Redeems Series B Preferred for $7.5 Million, Amends 2025 Warrant",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Presurance Holdings executed two capital structure actions. The company redeemed and cancelled all Series B preferred stock for $7.5 million from Clarkston Companies, reflecting the original issue price plus accrued dividends, with part of the consideration settled via offsets tied to a rights offering backstop and accrued dividends. Separately, Presurance amended its February 27, 2025 common stock purchase warrant to correct errors and limit holder rights, with all other terms unchanged. Together, these steps streamline the balance sheet and clarify equity terms.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Agreement 1: Presurance Redeems All Series B Preferred for $7.5 Million From Clarkston</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Agreement type</span></strong><span>: Redemption Agreement for Series B Preferred Stock</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Counterparty</span></strong><span>: Clarkston Companies</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Signed / Effective</span></strong><span>: Feb 27 2026 / same</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Duration / Termination</span></strong><span>: One-time transaction</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Reason</span></strong><span>: Retire preferred stock and reduce dividend obligations</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Agreement 2: Presurance Amends 2025 Common Stock Warrant to Correct Errors and Limit Rights</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Agreement type</span></strong><span>: Amendment to Common Stock Purchase Warrant dated Feb 27 2025</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Counterparty</span></strong><span>: Warrant holders</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Signed / Effective</span></strong><span>: Feb 26 2026 / same</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Reason</span></strong><span>: Correct errors and narrow warrant rights</span></li></ul><p class=\"\"><span>Original SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1502292/000119312526081526/prhi-20260227.htm\" rel=\"nofollow\" target=\"_blank\">Presurance Holdings, Inc. [ PRHI ] - 8-K - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:7643b1dfaa3ee:0-presurance-redeems-series-b-preferred-for-7-5-million-amends-2025-warrant/",
            "pub_date": "2026-02-28 02:33:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008997:0",
            "title": "Norwegian Could Sell Assets if Struggles Continue — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Norwegian Cruise Lines could potentially consider asset sales or an outright sale if it continues to struggle, say Melius analysts Conor Cunningham and Patrick Coleman. Norwegian is the smallest of the publicly traded traditional cruise operators and its three major brands all have good customer reputations with solid asset bases. The company's high-end Regent brand, given its high margins, could particularly draw acquisition interest from the industry. The entire company could also be a target, particularly for MSC, which has long sought additional exposure to the U.S. market, the analysts say. (nicholas.miller@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008997:0/",
            "pub_date": "2026-02-28 02:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN13A:0",
            "title": "US SEC adopts final rules for holding foreign insiders accountable",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Wall Street's top regulator on Friday said it had adopted final rules requiring disclosures of shareholdings and transactions by directors and officers of foreign companies traded in the United States, something Congress had mandated late last year.</span></p><p class=\"\"><span>The move adds to an apparently tightening regulatory environment for foreign companies in the United States. Last year, the U.S. Securities and Exchange Commission began a rulemaking process that could require many foreign companies to make more investor disclosures, closing what officials said had become a loophole that benefitted China in particular.</span></p><p class=\"\"><span>Under the rules adopted on Friday, top executives and board members of foreign private issuers who hold certain registered stock must begin disclosing their holdings and transactions by March 18 in compliance with the Holding Foreign Insiders Accountable Act, the SEC said in a statement.</span></p><p class=\"\"><span>The law, adopted by Congress in December, eliminates what had been an exemption for insiders at foreign companies by requiring disclosures like those made by top officials at U.S. companies.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN13A:0-us-sec-adopts-final-rules-for-holding-foreign-insiders-accountable/",
            "pub_date": "2026-02-28 02:35:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008930:0",
            "title": "Caris Life Sciences Climbs After Swing to 4Q Profit, Revenue Tops Expectations",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Amira McKee</span></p><p class=\"\"><span>Shares of Caris Life Sciences rose after the biotechnology company swung to a profit and tripled revenue in the fourth quarter.</span></p><p class=\"\"><span>The stock climbed 5.6%, to $20.32, in Friday afternoon trading. The shares have tumbled about 25% so far this year.</span></p><p class=\"\"><span>The company recorded a fourth-quarter net income of $82 million, or 28 cents a share, compared with a loss of $36.9 million, or $1.73 a share, a year earlier.</span></p><p class=\"\"><span>The results topped Wall Street's forecast for earnings of 12 cents a share, according to FactSet.</span></p><p class=\"\"><span>Revenue more than doubled, to $292.9 million, beating the $240.4 million that analysts polled by FactSet were expecting.</span></p><p class=\"\"><span>The top-line gains were driven by molecular-profiling-services revenue, which nearly tripled, to $282.1 million, on higher total clinical-case volume and pricing improvements across therapy-selection solutions.</span></p><p class=\"\"><span>For 2026, the Irving, Texas, company expects revenue in the range of $1 billion to $1.02 billion, representing growth of about 23% to 26% compared with the prior year. Wall Street is modeling for full-year revenue of $1.01 billion, according to FactSet.</span></p><p class=\"\"><span>Write to Amira McKee at amira.mckee@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008930:0/",
            "pub_date": "2026-02-28 02:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008948:0",
            "title": "Viridian Therapeutics Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:24 GMT) </span></strong><span>Viridian Therapeutics Price Target Cut to $42.00/Share From $45.00 by RBC Capital</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008948:0/",
            "pub_date": "2026-02-28 02:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN14L:0",
            "title": "US drillers cut oil and gas rigs for first time in six weeks, says Baker Hughes",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Scott DiSavino</span></p><p class=\"\"><span>    U.S. energy firms this week cut the number of oil and natural gas rigs operating for the first time in six weeks, energy services firm Baker Hughes </span><span> said in its closely followed report on Friday.</span></p><p class=\"\"><span>The oil and gas rig count, an early indicator of future output, fell by one to 550 in the week to February 27, the lowest since late January. (BHGUSWTT), (BHGUSOILDRLW), (BHGUSGASDRLW)</span></p><p class=\"\"><span>        Baker Hughes said this week's decline puts the total rig count down 43 rigs, or 7% below this time last year. </span></p><p class=\"\"><span>Baker Hughes said oil rigs fell by two to 407 this week, their lowest since December, while gas rigs rose by one to 134, their highest since July 2023.</span></p><p class=\"\"><span>        The oil and gas rig count declined by about 7% in 2025, 5% in 2024, and 20% in 2023 as lower U.S. oil </span><span> prices prompted energy firms to focus more on boosting shareholder returns and paying down debt rather than increasing output.</span></p><p class=\"\"><span>Financial services firm TD Cowen said 17 of the 21 exploration and production companies it tracks said they planned to spend about 1% less in capital expenditures in 2026 than in 2025.</span></p><p class=\"\"><span>That compares with a decline of around 4% in 2025, roughly flat year-on-year spending in 2024, and increases of 27% in 2023, 40% in 2022, and 4% in 2021.</span></p><p class=\"\"><span>With U.S. spot crude prices expected to fall for the fourth year in a row in 2026, the U.S. Energy Information Administration projected crude output would hold at 13.6 million barrels per day in 2026, matching 2025's record high.</span></p><p class=\"\"><span>On the gas side, EIA projected output would rise from a record 107.6 billion cubic feet per day (bcfd) in 2025 to 110.0 bcfd in 2026 with spot prices at the Henry Hub benchmark in Louisiana forecast to jump by about 22% in 2026. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN14L:0-us-drillers-cut-oil-and-gas-rigs-for-first-time-in-six-weeks-says-baker-hughes/",
            "pub_date": "2026-02-28 02:24:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:10dfcbbdb094b:0",
            "title": "Archer Aviation Partners With Starlink Ahead of FAA Approval",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Archer Aviation </span><span> is taking a strategic step that could shape how investors think about its competitive positioning in the emerging eVTOL market. The company said Friday it is partnering with Elon Musk's Starlink, owned by SpaceX, to integrate high-speed satellite internet into its Midnight aircraft once it receives regulatory approval to begin commercial operations. Under the agreement, Archer plans to install Starlink's system onboard and conduct testing, suggesting management is building out infrastructure ahead of a potential service launch.</span></p><p class=\"\"><span>The collaboration appears to extend beyond passenger connectivity. Archer said Starlink will also support communications between its four-passenger Midnight aircraft, pilots and engineering teams on the ground. In addition, both companies intend to work together on a connectivity solution that could help power Archer's future development of autonomous aircraft. If executed as outlined, that capability could become an important layer in scaling operations, particularly as autonomy remains a longer-term objective for the sector.</span></p><p class=\"\"><span>All of this unfolds as Archer continues to await approval from the US Federal Aviation Administration to begin commercial passenger flights. The company has stated that its Midnight aircraft is designed to carry passengers across cities in 5 to 15 minutes, potentially reducing travel times compared with ground transportation such as cars. For investors, the Starlink partnership may represent an effort to strengthen the platform before certification, while the timing of revenue generation will likely depend on when the FAA grants the green light.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:10dfcbbdb094b:0-archer-aviation-partners-with-starlink-ahead-of-faa-approval/",
            "pub_date": "2026-02-28 02:24:16",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0ZL:0",
            "title": "TSA officers get fraction of pay as government shutdown drags",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>TSA officers face financial strain due to partial government shutdown</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Union officials expect rise in TSA resignations amid financial pressures</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>TSA plans staffing surge for upcoming travel season despite challenges</span></li></ul></span></div><span><p class=\"\"><span>By Doyinsola Oladipo and David Shepardson</span></p><p class=\"\"><span>    Airport security screeners across the U.S. received a fraction of their usual pay on Friday as the partial government shutdown drags on, increasing the risk that more officers will call in sick to take second jobs, or even quit.</span></p><p class=\"\"><span>Funding for the U.S. Department of Homeland Security lapsed on February 13 after Congress failed to reach a deal on immigration enforcement reforms demanded by Democrats. That halted funding for the operation of several government agencies, including the Transportation Security Administration.</span></p><p class=\"\"><span>This shutdown is more limited than the record 43-day October-November event that closed numerous departments of government. But with TSA agents facing the possibility of losing even more pay if this one drags on further, the ripple effects could emerge again: absences, departures, and bottlenecked security lines at the nation's airports.</span></p><p class=\"\"><span>\"People are going to get discouraged a lot quicker this time,\" said Philip Glover, national vice president of District 3 of the American Federation of Government Employees, who represents TSA workers at 19 airports in Delaware and Pennsylvania.</span></p><p class=\"\"><span>EXPECTING MORE RESIGNATIONS</span></p><p class=\"\"><span>Local AFGE officials said they are expecting TSA resignations to rise, while other TSA workers, some of whom are still repaying debts from the last shutdown, again tighten their finances.  </span></p><p class=\"\"><span>Ha Nguyen McNeill, the top official at the TSA, told Congress this month that around 1,110 transportation security officers (TSOs) left the TSA in October and November 2025, a more than 25% increase from the same time period in 2024.</span></p><p class=\"\"><span>\"We heard reports of officers sleeping in their cars at airports to save money on gas, selling their blood and plasma and taking on second jobs to make ends meet,\" McNeill said of last year's shutdown, adding that the TSA is working to surge staffing in March, April, and May to be prepared for spring break, summer, and World Cup travel.</span></p><p class=\"\"><span>A TSA officer at Harry Reid International Airport in Las Vegas who asked to remain anonymous told Reuters the back-to-back shutdowns are making her reconsider the future of her nine-year career at the agency. \"I want to keep this job at least for the medical benefits, but sometimes I think I would be better off to abandon ship to reinvest myself elsewhere,\" the 34-year-old said.</span></p><p class=\"\"><span>Airline CEOs recently met with McNeill and Homeland Security Secretary Kristi Noem to talk about the shutdown and the effect on TSA, American Airlines </span><span> CEO Robert Isom said in a social media post.</span></p><p class=\"\"><span>Airlines raised concerns about the recent suspension of the Global Entry program - which was not affected during last year's shutdown - while lawmakers have urged DHS to restore the program, used to expedite U.S. customs and immigration clearance.</span></p><p class=\"\"><span>Senator Jacky Rosen of Nevada said in a Friday letter to Noem the government is using the program \"to maximize the administration’s political leverage and create uncertainty.\"   </span></p><p class=\"\"><span>MAKING ENDS MEET</span></p><p class=\"\"><span>Workers for a second time in four months have to find a way to make ends meet without pay as the agency's management is pressing workers more on absences, as some call in sick to take on odd jobs to pay bills and fill their gas tanks, local AFGE officials said. </span></p><p class=\"\"><span>\"Officers are looking at other alternatives just to maintain some kind of stability,\" said Darrell English, president of AFGE Local 777, which represents TSA workers in Illinois and Wisconsin. \"That's the backlash that's coming down the line from these continuous shutdowns.\"</span></p><p class=\"\"><span>Neal Gosman, treasurer of the AFGE Local 899 in Minnesota, said that several of his colleagues with high seniority decided to retire shortly after this shutdown started.</span></p><p class=\"\"><span>\"Maybe it's just coincidence and these are older people who've been there a while, but somehow they decided to pull the trigger this week,\" he said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0ZL:0-tsa-officers-get-fraction-of-pay-as-government-shutdown-drags/",
            "pub_date": "2026-02-28 02:24:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}