{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309535:0",
            "title": "Huachen AI Parking Management Technology Holding Prices $6 Million IPO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Huachen AI Parking Management Technology Holding (HCAI) said late Tuesday it priced its initial public offering of 1.5 million ordinary shares at $4 per share for gross proceeds of $6 million. </p><p class=\"\">The company granted the underwriters a 45-day option to buy up to an additional 225,000 shares to cover possible over-allotments. </p><p class=\"\">The shares have been approved for listing on the Nasdaq Capital Market and are expected to start trading on Wednesday under the ticker symbol \"HCAI.\" The offering is expected to close on or about Thursday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309535:0/",
            "pub_date": "2025-02-05 17:21:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0BR:0",
            "title": "Yuan slips on trade-war anxiety, yen jumps after wage data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Onshore yuan falls following return from extended break</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar on the back foot, giving respite to peers</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Yen rises on upbeat Japanese wage gain, rising bets of BOJ hike</li></ul></span></div><span><p class=\"\">    The yuan fell on Wednesday as a new U.S.-China trade war dented Chinese markets returning from an extended Lunar New Year break, while the yen jumped against the dollar as traders raised their bets on Bank of Japan rate hikes this year.</p><p class=\"\">The dollar was last up 0.47% against the yuan  to 7.272 in onshore trading, though its gains were capped by the People's Bank of China setting a stronger-than-expected midpoint rate, around which the currency is allowed to trade in a 2% band.</p><p class=\"\">Investors had watched the fixing for clues on whether Beijing would allow the currency to weaken to blunt the impact of new tariffs imposed by U.S. President Donald Trump.</p><p class=\"\">China on Tuesday imposed tariffs on U.S. imports in a swift response, and Trump said the same day he is in no hurry to speak to Chinese President Xi Jinping to try to defuse the situation.</p><p class=\"\">\"China's retaliation when it comes to the tariffs that have been announced and the investigations into Google... all in all it’s actually been relatively mild,\" said Alvin Tan, head of Asia FX strategy at RBC Capital Markets.</p><p class=\"\">\"The U.S. and Trump have delayed the imposition of the tariffs on Mexico and Canada, so there is some expectation in the market that the US could do the same after Trump speaks with President Xi, although the date and time of that call is still very uncertain.\"</p><p class=\"\">The offshore yuan  was marginally stronger at 7.276 per dollar; it fell to a record low of 7.3765 per dollar at the start of the week.</p><p class=\"\">During Trump's first term as president, the yuan was allowed to weaken more than 12% against the dollar to help make Chinese goods more competitive.</p><p class=\"\">Volatility in other currencies continued to ease after a turbulent start to the week driven by impending 25% tariffs on Mexico and Canada which were halted for a month at the last moment following negotiations on border security.</p><p class=\"\">The dollar index  was last down 0.39% at 107.63, mainly weighed down by the yen, after rising as much as 1.3% on Monday to 109.88. </p><p class=\"\">The euro and pound climbed around 0.22% , .</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:885.6548856548857px;aspect-ratio:1.476091476091476\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0BR-c54bd1b3d319b1448e90a3643268c895-resized.webp\" type=\"images/webp\"/><img alt=\"Global currencies have gyrated this week as Mexico and Canada won a tariff reprieve but China faced new levies\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0BR-c54bd1b3d319b1448e90a3643268c895-resized.jpeg\" style=\"background-color:#f6f5f3\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Currencies go on wild ride as Trump tariffs rock markets</span></figcaption></figure></span></p><p class=\"\">YEN JUMP</p><p class=\"\">The dollar fell to its lowest in six weeks at 152.92 per dollar as strong Japanese wage data and comments from a BOJ official hinting at further rate hikes boosted the country's currency .</p><p class=\"\">Data showed Japan's December inflation-adjusted real wages rose 0.6% year-on-year thanks to a wintertime bonus bump, with government officials expressing optimism that wage hike momentum is growing.</p><p class=\"\">That left traders ramping up bets of more BOJ rate hikes this year, with just over 30 basis points priced in by the year-end.</p><p class=\"\">\"The latest catalyst for yen buying was the much stronger wage data released today,\" said Derek Halpenny, a senior foreign exchange strategist at MUFG.</p><p class=\"\">\"The data still argues that the BoJ could certainly hike on two more occasions this year, which is certainly not priced.\"</p><p class=\"\">Elsewhere, the U.S. dollar slipped against its Canadian counterpart  as the latter continued to recover from Monday's 22-year low.</p><p class=\"\">The U.S. currency climbed against the Mexican peso  but remained below the almost three-year high of 21.28 hit on Monday.</p><p class=\"\">\"I am actually quite surprised at the resilience of markets. Risk sentiment ... has been quite positive despite all the tariff headlines and the resumption of the U.S.-China trade war,\" said Carol Kong, a currency strategist at Commonwealth Bank of Australia.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0BR:0-yuan-slips-on-trade-war-anxiety-yen-jumps-after-wage-data/",
            "pub_date": "2025-02-05 17:21:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002754_20250205002754:0",
            "title": "FTSE Straits Times Index Closes 0.2% Lower at 3815.37",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002754_20250205002754:0/",
            "pub_date": "2025-02-05 17:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEEp9bTga:0",
            "title": "Bulgaria's economy to grow 2.5% in 2025 - Allianz Trade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SOFIA (Bulgaria), February 5 (SeeNews) - Bulgaria’s gross domestic product (GDP) is forecast to expand by a real 2.5% this year and 2.4% in 2026, France-headquartered trade credit insurer Allianz Trade said.</p><p class=\"\">In 2024, Bulgaria's economic output grew by an estimated 2.2%, constrained by weak public and private investment amid political uncertainty and delayed EU fund absorption, Allianz Trade said in its Country Risk Atlas 2025 on Monday. Private consumption significantly expanded in the first half of 2024, driven by double-digit wage growth.</p><p class=\"\">Meanwhile, inflation steadily declined from 13% in 2022 to 8.6% in 2023, reaching a low of 1.2% in September 2024 due to reduced fuel prices. Inflation is projected to stabilise at around 2.7% in 2025 before easing to 2.4% in 2026, as strong wage pressures and accelerating credit growth persist.</p><p class=\"\">\"However, we expect accession to the Eurozone to be delayed until 2026 at least since inflation is still exceeding the reference value of the ECB (European Central Bank) and the European Commission and also because of continued government instability,\" Allianz Trade said.</p><p class=\"\">Despite recent crises, Bulgaria's public finances will remain stable, reflecting a long-standing commitment to fiscal prudence. Fiscal deficits averaged 2.4% of GDP in 2022-2023 due to stimulus measures mitigating the impact of the war in Ukraine.</p><p class=\"\">Allianz Trade expects a fiscal deficit of around 3% of GDP in 2025-2026 as public investment picks up. Public debt is forecast to rise slightly to 27% of GDP by 2026, which is still a favourable level by EU standards.</p><p class=\"\">Foreign trade activity is expected to stay subdued, with near-balanced current accounts through 2026. The gross external debt-to-GDP ratio, which peaked at 107% in 2009, has since declined to 48% in 2023 and is set to continue its downward trend in the next years.</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEEp9bTga:0-bulgaria-s-economy-to-grow-2-5-in-2025-allianz-trade/",
            "pub_date": "2025-02-05 17:22:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0VX:0",
            "title": "DCC falls; JP Morgan cuts target price",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Dublin-based conglomerate DCC  down 3.1% at 5315p </p><p class=\"\">** Stock among top losers in London's All-Share Index (.FTAS)</p><p class=\"\">** JP Morgan cuts TP to 6,300p from 6,400p, and maintains \"overweight\" rating </p><p class=\"\">** Brokerage expects lower organic growth for co's energy segment over milder UK weather in Q4</p><p class=\"\">** DCC says that the group's adjusted operating profit for Q3 was broadly in line with prior year</p><p class=\"\">** Co expects good operating profit growth for year ending 31 March 2025 despite FX headwinds</p><p class=\"\">** Stock lost 11% in 2024 </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0VX:0-dcc-falls-jp-morgan-cuts-target-price/",
            "pub_date": "2025-02-05 17:22:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463901:0",
            "title": "Market Chatter: CATL Looking to Submit Hong Kong Secondary Offering Documents in Coming Weeks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shenzhen-listed Contemporary Amperex Technology , better known as CATL, is preparing to submit documents for a secondary listing in Hong Kong by February or early March, potentially marking the city's largest offering in years, Bloomberg News reported Wednesday, citing sources familiar with the matter. </p><p class=\"\">The world's largest EV battery manufacturer could raise over $5 billion in the Hong Kong listing, which may take place as soon as the first half of the year, the report said. </p><p class=\"\">Bank of America, China International Capital Corp. , CSC Financial , and JPMorgan Chase are reportedly among the lead arrangers, with Goldman Sachs, Morgan Stanley, and UBS also involved. Additional banks may join in more minor roles, Bloomberg reported. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463901:0/",
            "pub_date": "2025-02-05 17:22:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002757:0",
            "title": "Gold Futures Hit Record for Fifth Straight Session on Safe Haven Demand — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gold futures rise to a fresh record for the fifth consecutive session on geopolitical uncertainty. Futures are up 0.6% at $2,893.10 a troy ounce, having touched $2,896 earlier in the session. Safe-haven assets continue to see increased demand on growing global uncertainties under President Trump's hectic lead, with the prospects that the first weeks of the administration are just a foretaste of what is to come over the next four years, Swissquote Bank's Ipek Ozkardeskaya says. Gold is the best hedge for protecting a portfolio from Trump worries, Ozkardeskaya writes in a note. More international relations chaos means greater demand--especially from central banks looking to reduce U.S. exposure should Trump turn his focus on their countries--Ozkardeskaya says. \"At this pace, Trump makes $3,000 [an ounce] look like an easy target,\" the analyst adds. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002757:0/",
            "pub_date": "2025-02-05 17:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEECkq0Ja:0",
            "title": "Montenegro's mobile subscribers rise 7.8% in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PODGORICA (Montenegro), February 5 (SeeNews) - The number of mobile phone subscribers in Montenegro increased by 7.8% to 1,415,427 in 2024, the national telecommunications regulator, EKIP, said.</p><p class=\"\">On a monthly comparison basis, however, the mobile subscribers dropped by 3.48% in December, EKIP said in a data release published on its website.</p><p class=\"\">The mobile penetration rate in Montenegro fell to 228.28% at the end of December from 236.51% a month earlier.</p><p class=\"\">Montenegro, with a population of around 630,000, has three mobile operators: M:tel, part of Telekom Srbija group; Crnogorski Telekom, controlled by Croatia's Hrvatski Telekom; and One Crna Gora, part of Hungary's 4iG.</p><p class=\"\">At the end of December, M:tel had a 40.78% share of the overall number of subscribers, followed by Crnogorski Telekom with 35.15% and One with 24.07%.</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEECkq0Ja:0-montenegro-s-mobile-subscribers-rise-7-8-in-2024/",
            "pub_date": "2025-02-05 17:23:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463894:0",
            "title": "AIM Submits Clinical Trial Application to US FDA for mRNA RSV Vaccine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AIM Vaccine  recently submitted a clinical trial application to the US Food and Drug Administration for its mRNA RSV (respiratory syncytial virus) vaccine. </p><p class=\"\">The drugmaker said results from third-party preclinical tests showed that the group's mRNA RSV vaccine had significantly higher humoral and cellular immunity than those of the internationally</p><p class=\"\">marketed mRNA RSV control vaccines, according to a Wednesday bourse filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463894:0/",
            "pub_date": "2025-02-05 17:23:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE96f2zN:0",
            "title": "Virtune AB (Publ) launches two new Crypto ETPs on Nasdaq Helsinki",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Helsinki, February 5th, 2025 - Virtune, a Swedish regulated digital asset manager and issuer of crypto exchange-traded products, today announced the listing of <strong class=\"root-Tkn6WL2y\">Virtune Avalanche ETP </strong>and<strong class=\"root-Tkn6WL2y\"> Virtune Staked Cardano ETP</strong> on Nasdaq Helsinki. </p><p class=\"\">Virtune recently introduced the first five crypto ETPs in Finland on Nasdaq Helsinki, receiving a strong reception in the Finnish market. The previously listed products include Virtune Bitcoin ETP, Virtune Staked Ethereum ETP, Virtune Staked Solana ETP, Virtune XRP ETP, and Virtune Crypto Altcoin Index ETP. To meet the growing demand from Finnish investors, Virtune has now expanded its offering with two additional crypto ETPs on Nasdaq Helsinki.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Virtune Avalanche ETP</strong></p><p class=\"\">Virtune Avalanche ETP provides exposure to Avalanche. Like all of Virtune’s exchange-traded products, Virtune Avalanche ETP is 100% physically backed and fully collateralized, denominated in EUR for the Finnish investors, available through brokers and banks such as Nordnet.</p><p class=\"\">Key Information about Virtune Avalanche ETP and what it offers to investors :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">1:1 exposure to Avalanche </li><li class=\"listItem-bmN0_SHH\">100% physically backed by AVAX </li><li class=\"listItem-bmN0_SHH\">1.49% annual management fee </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Virtune Avalanche ETP</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Full name: Virtune Avalanche ETP  </li><li class=\"listItem-bmN0_SHH\">Short name: Virtune Avalanche </li><li class=\"listItem-bmN0_SHH\">Nasdaq Helsinki Ticker: VIRAVAXE </li><li class=\"listItem-bmN0_SHH\">Trading currency: EUR</li><li class=\"listItem-bmN0_SHH\">First day of trading: Wednesday 5th of February 2025 </li><li class=\"listItem-bmN0_SHH\">ISIN: SE0022050092 </li><li class=\"listItem-bmN0_SHH\">Stock exchange: Nasdaq Helsinki and Nasdaq Stockholm  </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Virtune Staked Cardano ETP</strong>Virtune Staked Cardano ETP provides exposure to Cardano combined with the benefits of staking rewards. Like all of Virtune’s exchange-traded products, Virtune Staked Cardano ETP is 100% physically backed and fully collateralized, is denominated in EUR for the Finnish investors and is available through brokers and banks such as Nordnet.</p><p class=\"\">Key Information about Virtune Staked Cardano ETP and what it offers to investors :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">1:1 exposure to Cardano with 2% extra annual return through staking rewards </li><li class=\"listItem-bmN0_SHH\">Staking rewards are added continuously and reflected in the daily price of the ETP </li><li class=\"listItem-bmN0_SHH\">100% physically backed by ADA </li><li class=\"listItem-bmN0_SHH\">1.49% annual management fee </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Virtune Staked Cardano ETP</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Full name: Virtune Staked Cardano ETP  </li><li class=\"listItem-bmN0_SHH\">Short name: Virtune Staked Cardano </li><li class=\"listItem-bmN0_SHH\">Ticker: VIRADAE </li><li class=\"listItem-bmN0_SHH\">Trading currency: EUR</li><li class=\"listItem-bmN0_SHH\">First day of trading: Wednesday 5th of February 2025 </li><li class=\"listItem-bmN0_SHH\">ISIN: SE0021630449  </li><li class=\"listItem-bmN0_SHH\">Stock exchange: Nasdaq Helsinki and Nasdaq Stockholm </li></ul><p class=\"\">Christopher Kock, CEO of Virtune: </p><p class=\"\">“After successfully introducing Finland’s first crypto ETPs on Nasdaq Helsinki two weeks ago, we are pleased to expand our local offering in Finland by announcing the listing of the first Avalanche ETP and Staked Cardano ETP on Nasdaq Helsinki. These innovative products are 100% physically backed, with AVAX and ADA securely stored in cold storage with our custodian, Coinbase. They are accessible to both institutional and retail investors through various brokers and banks.“</p><p class=\"\">If you, as an (institutional) investor, are interested in meeting with Virtune to discuss the opportunities our ETPs offer for your asset management services or to learn more about Virtune and our ETPs, please do not hesitate to contact us at hello@virtune.com. You can also read more about Virtune and our ETPs at www.virtune.com and register your email address on our website to subscribe to our newsletters, which cover updates on Virtune's upcoming ETP launches and other news related to digital assets.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Press contact</strong></p><p class=\"\">Christopher Kock, CEO Virtune AB (Publ)</p><p class=\"\">christopher@virtune.com</p><p class=\"\">+46 70 073 45 64</p><p class=\"\">Virtune with its headquarters in Stockholm is a regulated Swedish digital asset manager and issuer of crypto exchange traded products on regulated European exchanges. With regulatory compliance, strategic collaborations with industry leaders and our proficient team, we empower investors on a global level to access innovative and sophisticated investment products that are aligned with the evolving landscape of the global crypto market.</p><p class=\"\">Crypto investments are associated with high risk. Virtune does not provide investment advice; investments are made at your own risk. Securities may increase or decrease in value, there is no guarantee of getting back invested capital. Read the prospectus, KID, terms at virtune.com.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE96f2zN:0-virtune-ab-publ-launches-two-new-crypto-etps-on-nasdaq-helsinki/",
            "pub_date": "2025-02-05 17:24:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463739:0",
            "title": "Italian Monthly Retail Sales Up 0.6% in December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Italy's seasonally adjusted retail sales grew 0.6% month over month in December 2024, following a 0.4% decline a month ago, according to data from Istat published Wednesday. </p><p class=\"\">Analysts expected a 0.1% increase for the month. </p><p class=\"\">On a yearly basis, retail sales were 0.6% higher, against the prior 1.1% growth.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463739:0/",
            "pub_date": "2025-02-05 17:24:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002617_20250205002771:0",
            "title": "Santander Chair Expects Challenging Environment in Year Ahead",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002617_20250205002771:0/",
            "pub_date": "2025-02-05 17:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SSNdRt2:0",
            "title": "Introduction of forward and future contracts 04/25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fixed IncomeProduct information</p><p class=\"\">Introduction of forward and future contracts 04/25</p><p class=\"\">New forward and future contracts will be introduced according to attacheddocuments.</p><p class=\"\">For further information concerning this exchange notice please contact ProductManagement, telephone +46 8 405 69 70, or product.management@nasdaq.com.https://view.news.eu.nasdaq.com/view?id=b359cc29b9b4fe4c99d81b893754892a2&amp;lang=en&amp;src=omxlink</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SSNdRt2:0-introduction-of-forward-and-future-contracts-04-25/",
            "pub_date": "2025-02-05 17:25:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002731:0",
            "title": "Tech, Media & Telecom Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Technology, Media and Telecom. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0655 GMT - Chinese AI company DeepSeek's breakthrough is unlikely to hurt demand in the short-term, although the market will likely cut multiples to price on uncertainties in the longer term, according to Julius Baer analysts in an emailed commentary. The market is debating on the long-term impact, as optimists argue that a lower entry barrier would attract new players, which should boost semiconductor demand, they write. \"We do not expect much weakness in the near-term demand,\" the analysts note. They add that long-term demand will be determined by changes in AI-driven computing needs, such as inference, noting that such demand could offset the possibly lower computing demand in training. DeepSeek's development marks a major evolution, though not entirely a revolution, in artificial intelligence, they say. (tracy.qu@wsj.com)</p><p class=\"\">0337 GMT - Inari Amertron's FY 2025-FY 2026 earnings my be pressured by weaker radio frequency revenue as handset sales slow down, CGS International analysts Shafiq Kadir and Dharmini Thuraisingam say in a note. Margin dilution from new packaging ventures could add pressure on earnings, they write, as CGS cuts its forecast for Inari's FY 2025-FY 2026 EPS by 19%-20%. However, margins may recover by FY 2026-FY 2027 with new businesses scaling up production, they add. CGS International lowers Inari's target price to MYR2.60 from MYR2.90, while maintaining a hold rating, citing near-term risks from a subdued automotive market and policy uncertainties under the Trump administration. Shares are 0.4% lower at MYR2.44. (yingxian.wong@wsj.com)</p><p class=\"\">1045 GMT - Vodafone is struggling to remain relevant, AJ Bell's Russ Mould writes in a note. \"While there are some reasons for encouragement, the market has tuned these out and is focused on the growing problems in its German operation,\" Mould says. The London-listed telecom company's U.K. segment showed some growth, ahead of the now-approved merger with Three. However, the group needs to demonstrate it can achieve sustainable growth to reassure investors, Mould says. Shares fall 6.3% to 65.62 pence. (najat.kantouar@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002731:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002729:0",
            "title": "Health Care Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Health Care sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0847 GMT - Novo Nordisk's 2025 outlook is reassuring, says Sheena Berry at Quilter Cheviot. The Danish pharmaceutical company expects a robust 16%-24% sales growth for the year, Berry says. Fourth-quarter sales rose 30%, outpacing expectations, although this was partly driven by insulin rebate adjustments, she notes. The performance of key growth drivers, Ozempic and Wegovy, remains strong, with Ozempic meeting expectations and Wegovy slightly underperforming. Novo Nordisk is set to initiate a new CagriSema Phase 3 trial in 2025 and plans to file with regulators in the first quarter of 2026, a slight delay to ensure a secure supply chain. Shares trade 4.5% higher at 619 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0838 GMT - Novo Nordisk's initial 2025 outlook is just ahead of Jefferies's expectations. But given a higher starting point and stronger currency effects it suggests up to 6% sales and 10% EBIT consensus upgrades, analysts at the bank write. Novo Nordisk's fourth-quarter sales beat expectations by 5%, mostly on positive U.S. gross-to-net adjustments--the discount offered between the list price and the actual net sales price--for its insulins. Sales of Wegovy were shy of expectations while Ozempic and Rybelsus were in line. A better gross margin, higher research and development costs but less selling and distribution spend helped EBIT beat by 9% and EPS by 6%. The stock will likely tick higher initially but could then fade, Jefferies says. Shares trade 4.2% higher at 617.20 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0837 GMT - GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p><p class=\"\">0830 GMT - Novo Nordisk's sales guidance is materially ahead of expectations, Intron Health's Naresh Chouhan writes. The company expects sales to grow 16%-24% this year with EBIT growing 19%-27%. Fourth-quarter EBIT beat expectations by 9% as the gross margin beat by 140 basis points and the EBIT margin beat by 170 basis points. \"Given recent concerns on growth, we expect the shares to be up strongly this morning given the sales guidance is materially higher than consensus was expecting and Wegovy was in-line,\" Chouhan says. Shares trade 4.3% higher at 617.90 Danish kroner. (dominic.chopping@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002729:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002737:0",
            "title": "Financial Services Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Financial Services. Exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0748 GMT - Santander posted a strong set of fourth-quarter results alongside guidance for 2025 and plans for capital returns to shareholders that are better than expected, Barclays's Cecilia Romero Reyes and Paola Sabbione say in a research note. The Spanish bank reported quarterly net profit and revenue that exceeded consensus forecasts, with results in Spain, Mexico, Brazil and the U.S. that were better than anticipated, Barclays says. The group's 2025 target for return on tangible equity--a profitability measure--of more than 17% is at the high end of previous guidance. Moreover, its intention to return 10 billion euros through buybacks is ahead of consensus expectations of 6 billion euros, according to Barclays. (adria.calatayud@wsj.com)</p><p class=\"\">0649 GMT - Thai Credit Bank appears confident in lowering credit costs in 2025, CGS International's Weerapat Wonk-Urai says, citing management commentary at an analysts' briefing. Management highlighted the bank's improving debt collection capabilities, supported by its front office staff helping with loan collections as soon as the loans become overdue, the analyst says in a research report. Also, the bank sold non-performing loans worth THB1.9 billion last year and plans to sell THB1.4 billion worth of NPLs this year, the analyst adds. The brokerage raises the stock's target price to THB26.12 from THB26.00 with an unchanged add rating. Shares are 1.0% lower at THB19.00. (ronnie.harui@wsj.com)</p><p class=\"\">0439 GMT - Japan's cash earnings jumped in December, while Moody's Analytics' Stefan Angrick sees little evidence of sustained real wage growth. At first glance, the data suggests things are turning around as monthly cash earnings rose solidly, the economist says, adding that the devil is in the details. Though nominal pay growth is picking up, the gains are uneven, and real cash earnings climbed only 0.6% on year, he says, describing it \"a far more modest gain than the glossy nominal figure.\" The pay bump was also driven significantly by temporary factors, such as bonuses. Wage growth is likely to improve despite strong headwinds expected in 2025, including, but not limited to, a potential inflation spike, he adds. Much depends on the spring wage negotiations. If pay gains come in below 5%, that could delay the rate hikes, he adds. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0356 GMT - Insurance broker and underwriter Steadfast gets upgraded to buy from hold at Goldman Sachs, where analysts think that the Australian company looks cheap compared with global peers. They think that Steadfast will maintain its annual guidance despite moderation in commercial rates for small and medium enterprises. They see limited risk from strata reviews and reckon that Steadfast was tracking well through the first fiscal quarter, albeit performance looked to be acquisition led. Steadfast is trading at less than 18 times one-year forward earnings, which they write in a note is below mid-cycle multiples. GS keeps a A$6.50 target price on the stock. Shares are up 1.7% at A$5.795. (stuart.condie@wsj.com)</p><p class=\"\">0257 GMT - Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">2225 GMT - BlackRock, the world's largest asset manager, last year announced a series of acquisitions of private market-focused firms that \"lay a foundation for an increased integration of public and private\" assets, Apollo's CEO Marc Rowan says during an earnings call. \"I continue to believe this convergence of public and private will be a very important source of demand for private assets,\" Rowan says. BlackRock last year acquired infrastructure-focused Global Infrastructure Partners and agreed to buy credit specialist HPS Investment Partners as well as Preqin, a provider of private-market research. \"We envision that traditional asset managers will evolve their businesses to include products that are public and private,\" Rowan adds. \"Our industry and our firm will be a supplier of products to [them].\" (luis.garcia@wsj.com; @lhvgarcia)</p><p class=\"\">2318 GMT - Risks to Macquarie's balance sheet from its investments in renewable energy look manageable to Morgan Stanley. Analyst Andrei Stadnik estimates some A$2 billion of Macquarie's principal investments, or 18%, are in green energy. Still, only 10% of investments by Corio--Macquarie's unit focused on offshore wind-energy developments--are in the U.S. and exposed to policy shifts by the Trump administration. \"Elsewhere, we estimate Macquarie booked a A$50 million gain on sale of Formosa 2 offshore wind in Asia, so offshore wind transactions are continuing,\" Morgan Stanley says. \"Nonetheless, we have baked in a A$150 million 2H impairment charge for principal investments in renewables.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1632 GMT - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p><p class=\"\">1616 GMT - PayPal is renegotiating deals with large merchants of its Braintree subsidiary and expects to see a resulting 5 percentage point headwind to revenue growth in 2025, CFO Jamie Miller says on a call with analysts. The company is shifting away from some of the volume from the unbranded payment processing unit, which should prove to be accretive to transaction margin dollars, a measure of profitability, according to Miller. \"Over the next few quarters, we will continue to work through renegotiations, at which point we should reach a new baseline to drive faster volume and revenue growth,\" the CFO says. (dean.seal@wsj.com)</p><p class=\"\">1530 GMT - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1619 GMT - Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p><p class=\"\">1508 GMT - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002737:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002730:0",
            "title": "Energy & Utilities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy and Utilities. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0919 GMT - TotalEnergies' integrated LNG division meant its fourth-quarter adjusted earnings beat consensus expectations, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. The French oil-and-gas company's other divisions were all broadly in line with expectations, they add. Given TotalEnergies hosted its capital markets day in October, is isn't surprising that it didn't outline any major changes to guidance, the analysts write. TotalEnergies shares rise 1% to 57.56 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0450 GMT - Perusahaan Gas Negara's earnings performance is likely to be solid and steady, Maybank Sekuritas Indonesia analysts say in a research report. The brokerage likes the Indonesian natural-gas distributor for its strong free cash flow generation, which offers flexibility for reinvestment, debt repayment and high dividends. The company serves industries such as power, food and chemicals, and is expanding to include households, the analysts note. The brokerage anticipates the company to deliver stable revenue of $2.9 billion per year for 2025-2026. It initiates coverage of the stock with a buy rating and a target price of IDR2,000.00. Shares are 1.6% higher at IDR1,610.00. (ronnie.harui@wsj.com)</p><p class=\"\">1917 GMT - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">1336 GMT - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">1310 GMT - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002730:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002738:0",
            "title": "China Mulls Probe Into Apple's App Store, Bloomberg Reports, Citing Sources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">China's State Administration for Market Regulation is examining Apple's policies, which include taking a cut of as much as 30% on in-app spending and barring external payment services and stores, Bloomberg reported, citing multiple sources.</li><li class=\"listItem-bmN0_SHH\">Antitrust watchdog officials have spoken with Apple executives and app developers since last year, Bloomberg reported.</li><li class=\"listItem-bmN0_SHH\">Chinese regulators believe Apple may be charging local developers unreasonably high fees, and may launch a formal investigation if Apple resists making changes, Bloomberg reported.</li><li class=\"listItem-bmN0_SHH\">Bloomberg said an Apple spokesperson didn't respond to a request for comment, while the regulator didn't respond to a faxed request for comment.</li></ul><p class=\"\">Full story: https://www.bloomberg.com/news/articles/2025-02-05/china-weighs-investigating-apple-over-app-store-policies-fees-including-30-cut</p><p class=\"\">Write to Jiahui Huang at jiahui.huang@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002738:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002732:0",
            "title": "Basic Materials Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Basic Materials. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0700 GMT - Comex gold futures are approaching $2,900/oz on strong bullish momentum, based on daily charts, RHB Retail Research's Joseph Chai says in a research report. Futures saw fresh positive price movements on Tuesday, while they remain on track to test resistance at $2,900/oz, the analyst says. If the commodity rises beyond that mark, it will likely extend gains toward the $3,000/oz level, the analyst says. The 20-day simple moving average is also trending upward, offering extra support for the bullish technical setup, the analyst adds.Spot gold is 0.7% higher at $2,861.48/oz. (ronnie.harui@wsj.com)</p><p class=\"\">2331 GMT - Crop chemicals producer Nufarm's earnings likely aren't immune from tit-for-tat trade measures taken by the U.S. and China, contends Macquarie. The U.S. has imposed an additional 10% tariff on Chinese imports, prompting Beijing to respond. Macquarie highlights that 28% of Nufarm's earnings are from North America, and the company relies heavily on sourcing agricultural chemicals from China to sell into markets including the U.S. Nufarm's costs are likely to rise as the trade war unfolds. Still, Nufarm has some production in the U.S. and recently upgraded its manufacturing capacity in Australia so has \"some ability to self-source,\" says Macquarie. It retains a neutral call on Nufarm. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">2328 GMT - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1824 GMT - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p><p class=\"\">1245 GMT - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002732:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002733:0",
            "title": "Auto & Transport Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Auto and Transport sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0812 GMT - Great Wall Motor's February sales volume will likely stay flat on month, but may recover somewhat in March, Citi analysts write in a note, citing company management. The automaker's January exports dropped on month due to the New Year holiday outside China, and it expects overseas sales growth in February and March due to postholiday promotional events. Meanwhile, the carmaker's new Tank 500 model, released this year, has secured 2,000 new orders since Jan. 2, Citi notes. Great Wall Motor will be a beneficiary of growth in the EV sector and EVs' higher market share in China, the bank says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0740 GMT - Investors could be concerned about Nissan's future as its board is planning to reject Honda's merger terms, Morningstar analyst Vincent Sun says. Nissan would face pressure surviving amid stiff competition in the U.S. and China, especially as it has a larger risk exposure to U.S. tariffs on Mexico than Honda and Toyota, the analyst says. However, even if the merger goes through, that wouldn't solve the challenges the two companies face. Both carmakers lack compelling EV offerings, and the combined entity would need to build a new EV model pipeline, he says. The two could benefit from larger scale and cost synergy, but that would take time to realize, Sun says. In any case, Nissan would find it difficult to \"play a smaller role in the new entity rather than standing on an equal footing with Honda,\" he adds. (sherry.qin@wsj.com)</p><p class=\"\">0657 GMT - Grab's growth drivers are intact, and its adjusted Ebita will likely surge in 2025, driven by margin expansion, HSBC analysts write in a note. Grab is likely to strengthen its leadership position in ride-hailing and deliveries, as it invests into products to help expand its total addressable market with affordable products, they say. However, as the priority will be on new product initiatives, cross-selling and lending products, HSBC trims earlier margin estimates and reduces its adjusted Ebitda projection by 2%-5% for 2025-2026. HSBC lowers its target price to $5.45 from $5.50 but upgrades its stock rating to buy from hold as the stock offers 20% upside, and valuations have become attractive after the recent price correction. (kimberley.kao@wsj.com)</p><p class=\"\">1733 GMT - Autonomous-vehicle company Cruise confirms it will lay off about half of its workforce. \"We are grateful for their passion and contributions to help us reach this stage, and our focus is on supporting them into their next chapter with severance packages and career support,\" a company spokesperson says in an emailed statement. \"While not an easy decision, we are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles.\" The layoffs come as GM announces the completion of its acquisition of Cruise, stating the company moving forward will work collaboratively on autonomous-vehicle technology and advanced driver assistance systems for personal vehicles. GM shares rise 1.4%. (connor.hart@wsj.com)</p><p class=\"\">1716 GMT - The automotive industry should pursue partnerships over traditional mergers and acquisitions, Bain &amp; Company says in a report. Companies have largely held off on M&amp;A in 2024 amid uncertainty and mounting cost pressures, with deal volumes falling about 60% during the first three quarters of the year, the management-consultancy firm says. But alliances could offer a solution, it notes. \"Activity is likely to pick up as companies acknowledge that they can't go it alone much longer,\" Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1441 GMT - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1437 GMT - Canada's two railroads, Canadian Pacific Kansas City and Canadian National Railway, would be exposed in the event of a 25% tariff situation with the U.S., but RBC analysts think CPKC would be the most affected. CPKC has 41% of its revenue tied to cross-border trade, according to RBC. Sustained tariffs, the analysts say, over a longer period of time could derail its growth plans. \"Moreover, we see many of the company's Investor Day growth targets as dependent on cross-border trade and therefore flag risk to long-term consensus EPS growth estimates should tariffs at current levels be sustained,\" the analysts say. (adriano.marchese@wsj.com)</p><p class=\"\">1340 GMT - With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">1008 GMT - Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p><p class=\"\">1001 GMT - TomTom's 2025 guidance is disappointing, ING analyst Marc Hesselink writes in a note. The location technology specialist's outlook remains very uncertain, with no free cash flow expected in the near term, he adds. However, \"the guidance provides significant room for error to reflect the uncertain automotive market,\" he adds. In the fourth quarter, the main negative was its free cash flow--5 million euros outflow--due to unfavorable working capital timing, Hesselink says. Shares are down 14% at 4.28 euros. (najat.kantouar@wsj.com)</p><p class=\"\">1000 GMT - A potential merger between Grab and GoTo would improve margins, Citi Research analyst Alicia Yap writes in a note. Bloomberg reported Tuesday that talks between the ride-hailing companies over a possible combination have recently intensified. They would likely save costs on competing user subsidies, as well as see faster new user acquisition with broader product offerings and better reach to lower-tier cities, Yap says. There could also be better user targeting, cross-selling of financial services and increased advertising revenue on both platforms, Yap adds. Both brands would likely continue running independently, but there could be back-end integration of systems and more collaboration regarding merchant management and sharing their rider and vehicle pool, Yap adds. Citi retains a buy rating on Grab with a target of $5.90. Shares last closed at $4.54. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002733:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFNbP4DFN:0",
            "title": "Analyst Group: Analyst Group Comment on Eevia Health’s Divestment of the Eye-Health Candidate Retinari™",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On February 4thth, Eevia Health Plc (publ) (“Eevia”) announced that the Company has agreed to sell IP related to the leading eye-health compound, Retinari™, to Havu Health Oy for EUR 800k, equivalent to approx. SEK 9.2m. Retinari™ is a promising compound in fighting Age-related Macular Degeneration (AMD), the primary cause of blindness.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">In summary, </strong>we view the divestment as a pivotal step in the Company’s ongoing restructuring plan, reinforcing the underlying value that the transformational strategy aims to unlock. Moving forward, Havu Health Oy’s ability to secure the necessary funding will be a key factor to monitor, as successful financing could unlock significant upside potential and accelerate the commercialization of Retinari™.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read Analyst Group’s comment here</strong></p><p class=\"\">About Analyst Group: One of Sweden's leading equity research boutiques with focus on small and medium-sized listed companies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read more about Analyst Group</strong></p><p class=\"\"><em> </em></p><p class=\"\">This is a press release from Analyst Group regarding the publication of a comment on Eevia Health. Readers may assume that Analyst Group has received compensation for making the comment. The Company has not been given an opportunity to influence the parts where Analyst Group has had opinions about the Company, future valuation or anything else that could be considered a subjective assessment.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFNbP4DFN:0-analyst-group-analyst-group-comment-on-eevia-health-s-divestment-of-the-eye-health-candidate-retinari/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463911:0",
            "title": "Aptitude Software Group CFO Plans Exit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aptitude Software Group  Chief Financial Officer Mike Johns intends to step down, according to a Wednesday release. </p><p class=\"\">Johns will remain in the financial software company to oversee the 2024 results, which it will publish on March 26, and ensure a smooth transition. </p><p class=\"\">The company has started looking for a new CFO.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463911:0/",
            "pub_date": "2025-02-05 17:20:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463902:0",
            "title": "Zyxel Group Logs NT$508 Million Profit in Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zyxel Group  booked net income attributable to the parent company of NT$507.9 million, or NT$1.26 per share for the fourth quarter of 2024. </p><p class=\"\">Operating revenue of the networking solutions provider for the three months stood at NT$7.5 billion, according to a Wednesday Taiwan Exchange filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463902:0/",
            "pub_date": "2025-02-05 17:20:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446717:0",
            "title": "Italy Retail Sales Rebound, Beat Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The value of retail sales in Italy grew by 0.6% month-over-month in December 2024, rebounding from a 0.4% drop in the previous month and surpassing market expectations of a 0.1% rise.</p><p class=\"\">Sales recovered for both food (0.6% vs -0.1% in November) and non-food (0.8% vs -0.7%) products.</p><p class=\"\">On a yearly basis, retail sales increased by 0.6% in December, slowing from a 1.1% growth in November.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446717:0-italy-retail-sales-rebound-beat-forecasts/",
            "pub_date": "2025-02-05 17:20:49",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463912:0",
            "title": "Eurozone Private Sector Output Returns to Growth in January, Final PMI Shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The eurozone's private sector saw output growth at the start of 2025, marking the first expansion since August 2024, Hamburg Commercial Bank and S&amp;P Global's final data showed Wednesday. </p><p class=\"\">The HCOB Eurozone Composite PMI Output Index rose to a five-month high of 50.2 in January 2025 from 49.6 in December 2024, in line with the flash estimate. </p><p class=\"\">Meanwhile, the HCOB Eurozone Services PMI Business Activity Index hit a two-month low of 51.3, down from the prior month's 51.6 and the initial reading of 51.4.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463912:0/",
            "pub_date": "2025-02-05 17:20:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463907:0",
            "title": "SMMT: Britain's New Car Sales Down 2.5% in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UK's new car registrations fell 2.5% year over year to 139,345 units in January, according to data from the Society of Motor Manufacturers and Traders published Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463907:0/",
            "pub_date": "2025-02-05 17:20:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002669:0",
            "title": "FTSE 100 Could Rally to New All-Time High if BOE Signals More Rate Cuts — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.K. FTSE 100 index could rise to a new all-time high if the Bank of England signals additional future interest-rate cuts during Thursday's rate decision, Capital.com's Daniela Sabin Hathorn says in a note. \"A BOE rate cut could renew investor interest in U.K. stocks,\" she says. The FTSE 100 reached a new high of 8692.84 on Jan. 31. Any hints of more interest-rate cuts could reignite a U.K. equities rally, Hathorn says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002669:0/",
            "pub_date": "2025-02-05 17:12:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463903:0",
            "title": "Nokia to Upgrade Orange's 5G Infrastructure Under Extended Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nokia  secured a four-year contract extension from French telecoms company Orange  to upgrade the latter's 5G radio infrastructure. </p><p class=\"\">The Finnish telecommunications group will deliver its portfolio of AirScale products and artificial intelligence-based MantaRay network management system to boost customer experience and performance of Orange's network in Southeastern and Western France, according to a Wednesday release. </p><p class=\"\">The deal also covers a trial of Nokia's 5G Cloud RAN solutions by Orange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463903:0/",
            "pub_date": "2025-02-05 17:12:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446713:0",
            "title": "Eurozone Services Output Rises Slightly in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HCOB Eurozone Services PMI stood at 51.3 in January 2025, little changed from the preliminary estimate of 51.4 and marginally down from December’s 51.6.</p><p class=\"\">The latest reading signaled a modest expansion in services output, supported by a second consecutive month of rising new orders, driven by domestic demand.</p><p class=\"\">Employment growth accelerated compared to late 2024, while backlogs of work declined at a faster pace.</p><p class=\"\">On the pricing front, input costs saw their sharpest rise in nine months, while selling price inflation remained steady at its highest level since May 2024.</p><p class=\"\">Meanwhile, business sentiment remained positive, though it softened slightly from the previous month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446713:0-eurozone-services-output-rises-slightly-in-january/",
            "pub_date": "2025-02-05 17:13:16",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463899:0",
            "title": "UPM-Kymmene to Initiate EUR160 Million Share Repurchase Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UPM-Kymmene  said Wednesday that it will launch a share buyback program to repurchase up to 160 million euros of its shares on Feb. 10. </p><p class=\"\">The Finnish forest and paper products company will buy back and cancel a maximum of 6 million shares. The program, which will be done to reduce capital, will end on May 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463899:0/",
            "pub_date": "2025-02-05 17:13:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}