{
    "data": [
        {
            "id": "dpa_afx:0eaee671c1ec2:0",
            "title": "Treasury Proposes Rule To Sever Swiss Bank MBaer's Access To US Financial System",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>WASHINGTON (dpa-AFX) - The U.S. Department of the Treasury's Financial Crimes Enforcement Network has proposed a rule that would sever Swiss bank MBaer Merchant Bank AG's access to the U.S. financial system for providing financial support to illicit actors linked to Russia and Iran. If finalized, the proposed rule would prohibit covered U.S. financial institutions from opening or maintaining a correspondent account for, or on behalf of, MBaer.</span></p><p class=\"\"><span>'MBaer has funneled over a hundred million dollars through the U.S. financial system on behalf of illicit actors tied to Iran and Russia,' said Secretary of the Treasury Scott Bessent. 'Banks should be on notice that the U.S. Treasury will aggressively protect the integrity of the U.S. financial system using the full force of our authorities.'</span></p><p class=\"\"><span>The Treasury alleged that since its inception, MBaer and its employees have enabled money laundering and illicit finance activities, including by facilitating corruption linked to Russian money laundering and money laundering and terrorist financing on behalf of Iran-aligned foreign terrorist organizations, including the Islamic Revolutionary Guard Corps and its Quds Force. MBaer is a critical access node to the U.S. dollar for a wide variety of illicit actors, putting U.S. national security at risk and undermining the integrity of the U.S. financial system.</span></p><p class=\"\"><span>Under section 311 of the USA PATRIOT Act, FinCEN published a notice of proposed rule-making to impose special measure, which would prohibit covered domestic financial institutions from opening or maintaining a correspondent account for or on behalf of MBaer.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:0eaee671c1ec2:0-treasury-proposes-rule-to-sever-swiss-bank-mbaer-s-access-to-us-financial-system/",
            "pub_date": "2026-02-27 18:48:04",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM13E:0",
            "title": "Gold's rise cheers Turks, takes shine off anti-inflation efforts",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Total gold stock $750 bln, half size of economy</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>$300-bln annual boost in wealth spurred demand</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Complicates central bank's anti-inflation efforts</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Turkey among highest household gold ownerships</span></li></ul></span></div><span><p class=\"\"><span>By Nevzat Devranoglu and Ezgi Erkoyun</span></p><p class=\"\"><span>Gold‑loving Turks grew $300 billion wealthier in the past year as record prices swelled the value of their holdings to nearly half the size of Turkey’s economy, but the resulting resilience in domestic demand has slowed the country's already difficult fight against inflation.</span></p><p class=\"\"><span>With global bullion soaring to all-time highs since the summer, the total value of Turkey's gold stock has climbed to more than $750 billion, which is exceptionally high by global standards considering Turkey's GDP of about $1.57 trillion. </span></p><p class=\"\"><span>The central bank says $600 billion of that stock is \"under‑the‑mattress\", or \"under-the-pillow\" in Turkish: gold held by households and companies outside the banking system, reflecting a long tradition of Turks holding tight to the metal as a safe, portable, tangible store of wealth. </span></p><p class=\"\"><span>The doubling of the value of these coins, bangles and other gold pieces in a year has encouraged spending, despite annual inflation  above 30%. Economists and the central bank say this has complicated a disinflation path, prompting slower interest rate cuts. </span></p><p class=\"\"><span>CONFIDENCE TO SPEND</span></p><p class=\"\"><span>Gold hit $5,000 an ounce last month, driven by trade disruptions and geopolitical instability.</span></p><p class=\"\"><span>For Turks, the global gold rush marks some relief after a nearly decade-long inflation and currency crisis at home that slashed their earnings and savings. </span></p><p class=\"\"><span>\"I've been investing in physical gold for a year, buying it piece by piece whenever I save up,\" said 21-year-old air conditioning technician Furkan as he used cash to buy a gram of gold at an Istanbul shop. \"I believe prices will rise even further. I'm planning to buy a car.\"</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:887.5px;aspect-ratio:1.4791666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZM13E-68a023c059302cbcb28e51a6ab359c41-resized.webp\" type=\"image/webp\"/><img alt=\"The graphic shows profit or loss levels from gold stock\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZM13E-68a023c059302cbcb28e51a6ab359c41-resized.webp\" style=\"background-color:#332c29\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">$300 billion bonanza in Turkey</span></figcaption></figure><p class=\"\"><span>Turkey has among the highest levels of household gold ownership alongside India, Germany and Vietnam.</span></p><p class=\"\"><span>The precious metal, given as gifts at weddings and passed down through generations, is a hedge against inflation and lira depreciation, and a permissible investment  under Islamic tradition that spurns interest-bearing banking.</span></p><p class=\"\"><span>Beyond what is under the pillow, Turkish banks store some $80 billion of the metal in bank deposits and investment funds, while the central bank owns about $80 billion in reserves, data show. </span></p><p class=\"\"><span>CENTRAL BANK SLOWED RATE CUTS</span></p><p class=\"\"><span>In a recent blog post, the central bank flagged that housing prices have risen markedly more in provinces with a higher share of gold deposits than elsewhere since the last quarter of 2023, when global bullion prices started to climb.</span></p><p class=\"\"><span>When households use gold-related wealth to buy homes without relying on credit, \"demand remains strong even amid tight financial conditions\", it said, calling this a \"clear sign of a wealth effect\". </span></p><p class=\"\"><span>Asim Gursel, a gold shop owner in Istanbul, said that over the past year customers were increasingly selling gold to buy cars or first homes in a reversal from past practices when they were largely selling homes to buy gold. </span></p><p class=\"\"><span>The central bank cut its key rate by a smaller-than-expected 100 basis points to 37% in January, when monthly consumer prices soared nearly 5%, and it has since raised year-end inflation forecasts.  </span></p><p class=\"\"><span>Gold prices jumped almost 25% in January alone, when the wealth effect in Turkey amounted to $80 billion - capping a year in which it totaled $300 billion. </span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Item</span></p></td><td><p class=\"\"><span>Amount ($ bln)</span></p></td></tr><tr><td><p class=\"\"><span>\"Under‑the‑mattress\" gold</span></p></td><td><p class=\"\"><span>600</span></p></td></tr><tr><td><p class=\"\"><span>Gold deposits in banks and funds</span></p></td><td><p class=\"\"><span>80</span></p></td></tr><tr><td><p class=\"\"><span>Central bank-owned gold reserves</span></p></td><td><p class=\"\"><span>80</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL GOLD STOCK</span></p></td><td><p class=\"\"><span>760</span></p></td></tr><tr><td><p class=\"\"><span>Turkey GDP (end-2025 estimate, nominal USD)</span></p></td><td><p class=\"\"><span>1,565</span></p></td></tr><tr><td><p class=\"\"><span>Gold stock / GDP ratio</span></p></td><td><p class=\"\"><span>48.5%</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM13E:0-gold-s-rise-cheers-turks-takes-shine-off-anti-inflation-efforts/",
            "pub_date": "2026-02-27 18:48:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003525:0",
            "title": "U.S. Treasury Yields Fall Ahead of U.S. PPI Data — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Falls in U.S. Treasury yields accelerate in European trade amid geopolitical risks and expectations of Federal Reserve interest-rate cuts. The Treasury curve flattens, with short-dated yields falling faster than long-dated yields. U.S. producer price data for January at 1330 GMT \"will serve as the next inflection point,\" says Exness' Wael Makarem in a note. \"Confirmation of easing inflation would reinforce the downward bias in yields and weigh further on the dollar,\" he says. However, higher-than-expected PPI could reduce rate-cut expectations, pushing yields and the dollar back up, he says. The two-year Treasury yield falls 4 basis points to 3.406%; the 10-year yield falls 2.6 basis points to 3.990%, according to Tradeweb. (emese.bartha@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003525:0/",
            "pub_date": "2026-02-27 18:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003520:0",
            "title": "Duolingo Stock Plummets 23%. Why a Strategy Shake-Up Is Spooking Wall Street. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By George Glover</span></p><p class=\"\"><span>Duolingo stock was plummeting on Friday after the educational technology company said it would sacrifice near-term revenue growth to focus on boosting its user base.</span></p><p class=\"\"><span>Shares tumbled 23% to $90.76 ahead of the opening bell. Futures tracking the S&amp;P 500 were 0.2% lower, as investors carried on ditching risk assets.</span></p><p class=\"\"><span>Duolingo said in a fourth-quarter earnings report filed after Thursday's close that its medium-term goal was to reach 100 million daily active users by 2028, having passed the 50 million level in 2025. User growth decelerated last year.</span></p><p class=\"\"><span>To reach its target, Duolingo said it would prioritize user numbers over near-term revenue growth. It added that it would scale back some monetization initiatives to boost \"top-of-funnel user growth.\"</span></p><p class=\"\"><span>For the current quarter, the company expects revenue of $288.5 million, below the $291.4 million that analysts polled by FactSet were expecting.</span></p><p class=\"\"><span>\"Management believes that a portion of the deceleration in user growth over the course of 2025 could be attributed to the push to monetize, which in turn led to disgruntled users and a meaningful negative impact to 'word-of-mouth' marketing,\" D.A. Davidson analyst Wyatt Swanson, who rates the stock at Neutral, wrote in a research note.</span></p><p class=\"\"><span>\"This guidance for 2026 is meant to fix that issue through an abundance of experimentation and reduced friction for users to have a better experience,\" he added, cutting his price target to $85 from $170.</span></p><p class=\"\"><span>The consensus on Wall Street was that the short-term pain could be worth it if Duolingo does manage to boost its user base.</span></p><p class=\"\"><span>\"While we believe this is the right long-term move, the near-term effect is clear,\" KeyBanc analyst Justin Patterson, who rates the stock at Sector Weight, said.</span></p><p class=\"\"><span>The soft revenue guidance overshadowed a fourth-quarter earnings and revenue beat.</span></p><p class=\"\"><span>Duolingo reported adjusted earnings before interest, taxes, depreciation, and amortization, or Ebitda, of $84.3 billion, as revenue jumped 35% to $282.9 billion. Wall Street was looking for adjusted Ebitda of $78.1 billion on revenue of $276 billion.</span></p><p class=\"\"><span>Write to George Glover at george.glover@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003520:0/",
            "pub_date": "2026-02-27 18:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_PLXE2BF37:0",
            "title": "SATS Ltd Logs Q3 Revenue SGD 1,645.1 Mln",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SATS Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q3 REVENUE SGD 1,645.1 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q3 OPERATING INCOME SGD 151.3 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY PROFIT ATTRIBUTABLE S$84.7 MLN</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_PLXE2BF37:0-sats-ltd-logs-q3-revenue-sgd-1-645-1-mln/",
            "pub_date": "2026-02-27 18:49:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003529:0",
            "title": "Yomiuri: Nidec Founder Exits Without Speaking Publicly",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Tomohiko Kanai</span></p><p class=\"\"><span>Yomiuri Shimbun Staff Writer</span></p><p class=\"\"><span>The charismatic founder of major Japanese motor manufacturer Nidec Corp. has abruptly stepped out of the spotlight without speaking about it to the public.</span></p><p class=\"\"><span>The company, which has been hit by an accounting scandal, announced that Shigenobu Nagamori resigned as chairman emeritus on Thursday. His abrupt resignation came while a third-party committee is still compiling a report on its investigation into the company's inappropriate accounting practices, with the report expected to be complete within this month.</span></p><p class=\"\"><span>According to Nidec, Nagamori requested to resign. Despite allegations that the founder and other executives were involved in the scandal, Nagamori has refrained from speaking about his resignation. Instead, the 81-year-old issued a statement that expressed his strong attachment to the company, saying, \"Nidec will last forever.\"</span></p><p class=\"\"><span>In the statement, Nagamori said that he decided to step down \"based on my firm determination to do everything in my power to revitalize Nidec.\"</span></p><p class=\"\"><span>Since May last year, a series of inappropriate accounting practices at the company have come to light. However, it was not until September that the committee began its investigation. The company is still struggling to get the management back on track.</span></p><p class=\"\"><span>In January, Nidec released a plan to improve its internal management system based on an in-house investigation. The plan pointed out that the inappropriate accounting practices stemmed from a corporate culture in which Nagamori's demands and short-term profit were prioritized. The involvement and responsibility of top-level management, including Nagamori, are expected to be a point of focus in the committee's report.</span></p><p class=\"\"><span>Nagamori is known as a charismatic business leader whose guidance turned Nidec into a global company. In December, he assumed the post of chairman emeritus after resigning as representative director and global group representative. According to Nidec President and CEO Mitsuya Kishida, chairman emeritus is an \"honorary post without management authority.\" However, voices expressing concerns about Nagamori's influence on the company remained strong even after he entered that post.</span></p><p class=\"\"><span>Nagamori likely concluded that it was necessary for him to completely step aside from Nidec to restore trust in the company. In the statement, Nagamori said that he deeply regrets the company's inappropriate accounting practices. \"Now is high time for me to leave. My chapter of Nidec ends today, followed by an era for next-generation employees to create a new story,\" he stated.</span></p><p class=\"\"><span>Gone into hiding?</span></p><p class=\"\"><span>Some have voiced questions over Nagamori's abrupt resignation before the release of the committee's report. Nagamori is known for his outspoken remarks at press conferences and shareholder meetings, yet he refrained from speaking publicly about both resignations.</span></p><p class=\"\"><span>\"Resigning at this time could actually give off a negative impression,\" said a Nidec source. \"I think it's unavoidable that people will assume he's running away.\"</span></p><p class=\"\"><span>As of September 2025, Nagamori held 8.61% of Nidec's shares personally and 3.52% through an asset management company, making him the company's de facto largest shareholder. A possibility therefore remains that he will continue to influence Nidec.</span></p><p class=\"\"><span>----</span></p><p class=\"\"><span>This article is from The Yomiuri Shimbun. Neither Dow Jones Newswires, MarketWatch, Barron's nor The Wall Street Journal were involved in the creation of this content.</span></p><p class=\"\"><span>YDN-M0000183407-1</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003529:0/",
            "pub_date": "2026-02-27 18:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003534:0",
            "title": "GDEX Malaysia 4th-Quarter 2025 Earnings Summary Table",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>      GDEX (0078.KU) - Malaysia </span><br/><span>      (4th) quarter ended Dec 31: </span><br/><span>      Figures Are In Ringgit (MYR). </span><br/><span> </span><br/><span> </span><br/><span>                                   2025               2024 </span><br/><span> </span><br/><span>Revenue                     111,335,000        114,548,000 </span><br/><span>PreTax Profit                 2,492,000          6,851,000 </span><br/><span>Net Profit                    3,235,000          4,659,000 </span><br/><span>Earnings Per Share             0.06 Sen           0.08 Sen </span><br/><span>Dividend                       0.20 Sen           0.20 Sen </span><br/><span> </span><br/><span>      12 months ended Dec 31: </span><br/><span> </span><br/><span>Revenue                     416,327,000        419,171,000 </span><br/><span>PreTax Profit                   107,000          2,261,000 </span><br/><span>Net Profit                   -1,720,000         -1,856,000 </span><br/><span>Earnings Per Share            -0.03 Sen          -0.03 Sen </span><br/><span>Dividend                       0.20 Sen           0.20 Sen </span><br/><span> </span><br/><span> </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003534:0/",
            "pub_date": "2026-02-27 18:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003531:0",
            "title": "Block Raised to Overweight From Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(10:50 GMT) </span></strong><span>Block Price Target Raised to $93.00/Share From $72.00 by Morgan Stanley</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003531:0/",
            "pub_date": "2026-02-27 18:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7457Ua:0",
            "title": "REG - BkofA Merrill Lynch Schroders PLC - Form 8.5 (EPT/RI)-Schroders plc",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7457U  Bank of America Merrill Lynch  27 February 2026   </span><p class=\"\"><span>FORM 8.5 (EPT/RI)</span></p><p class=\"\"><span>PUBLIC DEALING DISCLOSURE BY AN EXEMPT PRINCIPAL TRADER WITH RECOGNISED INTERMEDIARY STATUS DEALING IN A CLIENT-SERVING CAPACITY</span></p><p class=\"\"><span> Rule 8.5 of the Takeover Code (the \"Code\")</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>1.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KEY INFORMATION</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(a)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Name of exempt principal trader:</span></p></li></ul></td><td><p class=\"\"><span>Merrill Lynch International</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(b)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Name of offeror/offeree in relation to whose</span></p><p class=\"\"><span>relevant securities this form relates:</span></p><p class=\"\"><span> Use a separate form for each offeror/offeree</span></p></li></ul></td><td><p class=\"\"><span>SCHRODERS PLC</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(c)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Name of the party to the offer with which exempt principal trader is connected:</span></p></li></ul></td><td><p class=\"\"><span>Pantheon, LLC</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(d)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Date dealing undertaken:</span></p></li></ul></td><td><p class=\"\"><span>26/02/2026</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(e)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In addition to the company in 1(b) above, is the</span></p><p class=\"\"><span>exempt principal trader making disclosures in</span></p><p class=\"\"><span>respect of any other party to this offer?</span></p><p class=\"\"><span> If it is a cash offer or possible cash offer, state \"N/A\"</span></p></li></ul></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>2.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DEALINGS BY THE EXEMPT PRINCIPAL TRADER</span></p></li></ul><p class=\"\"><span>Where there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 2(a), (b), (c) or (d) (as appropriate) for each additional class</span></p><p class=\"\"><span>of relevant security dealt in.</span></p><p class=\"\"><span>The currency of all prices and other monetary amounts should be stated.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(a)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Purchases and sales</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>Purchases/</span></p><p class=\"\"><span>sales</span></p></td><td><p class=\"\"><span>Total number of securities</span></p></td><td><p class=\"\"><span>Highest price </span></p><p class=\"\"><span>per unit</span></p><p class=\"\"><span>paid/received</span></p></td><td><p class=\"\"><span>Lowest price </span></p><p class=\"\"><span>per unit</span></p><p class=\"\"><span>paid/received</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Purchase</span></p></td><td><p class=\"\"><span>538,086</span></p></td><td><p class=\"\"><span>5.865176 GBP</span></p></td><td><p class=\"\"><span>5.859414 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Sale</span></p></td><td><p class=\"\"><span>224,389</span></p></td><td><p class=\"\"><span>5.865000 GBP</span></p></td><td><p class=\"\"><span>5.855000 GBP</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(b)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Cash-settled derivative transactions</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of </span></p><p class=\"\"><span>relevant security</span></p></td><td><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. CFD</span></p></td><td><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. opening/closing a </span></p><p class=\"\"><span>long/short position, increasing/reducing a</span></p><p class=\"\"><span>long/short position</span></p></td><td><p class=\"\"><span>Number of reference securities</span></p></td><td><p class=\"\"><span>Price per unit</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Increasing a Short Position</span></p></td><td><p class=\"\"><span>4,120</span></p></td><td><p class=\"\"><span>5.860293 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Increasing a Short Position</span></p></td><td><p class=\"\"><span>510</span></p></td><td><p class=\"\"><span>5.865176 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Opening a Short Position</span></p></td><td><p class=\"\"><span>245,791</span></p></td><td><p class=\"\"><span>5.862930 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Opening a Short Position</span></p></td><td><p class=\"\"><span>184,747</span></p></td><td><p class=\"\"><span>5.862930 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Increasing a Long Position</span></p></td><td><p class=\"\"><span>4,710</span></p></td><td><p class=\"\"><span>5.859707 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Increasing a Short Position</span></p></td><td><p class=\"\"><span>10,703</span></p></td><td><p class=\"\"><span>5.860586 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Reducing a Short Position</span></p></td><td><p class=\"\"><span>61,596</span></p></td><td><p class=\"\"><span>5.860740 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Increasing a Short Position</span></p></td><td><p class=\"\"><span>540</span></p></td><td><p class=\"\"><span>5.860000 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Reducing a Short Position</span></p></td><td><p class=\"\"><span>880</span></p></td><td><p class=\"\"><span>5.859648 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Swaps - Equity Swaps</span></p></td><td><p class=\"\"><span>Increasing a Short Position</span></p></td><td><p class=\"\"><span>340</span></p></td><td><p class=\"\"><span>5.860000 GBP</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(c)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Stock-settled derivative transactions (including options)</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(i)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Writing, selling, purchasing or varying</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class </span></p><p class=\"\"><span>of</span></p><p class=\"\"><span>relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Product description e.g. call option</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Writing, purchasing, selling, varying etc.</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Number </span></p><p class=\"\"><span>of</span></p><p class=\"\"><span>securities to which option relates</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Exercise </span></p><p class=\"\"><span>price</span></p><p class=\"\"><span>per unit</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Type</span></p><p class=\"\"><span>e.g. American, European etc.</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Expiry date</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Option money paid/ received per unit</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(ii)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. call option</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Exercising/</span></p><p class=\"\"><span>exercised</span></p><p class=\"\"><span>against</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Number of </span></p><p class=\"\"><span>securities</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Exercise Price per </span></p><p class=\"\"><span>unit</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(d)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Other dealings (including subscribing for new securities)</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. subscription, conversion</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Details</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Price per unit (if applicable)</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>3.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OTHER INFORMATION</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(a)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Indemnity and other dealing arrangements</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal </span></p><p class=\"\"><span>or refrain from dealing entered into by the exempt principal trader making the disclosure and any party to the offer or any person acting in concert with a party to the offer:</span></p><p class=\"\"><span> Irrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(b)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Agreements, arrangements or understandings relating to options or derivatives</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any agreement, arrangement or understanding, formal or informal, between the exempt principal trader making the disclosure and any other person relating to: </span></p><p class=\"\"><span>(i) the voting rights of any relevant securities under any option; or</span></p><p class=\"\"><span>(ii) The voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:</span></p><p class=\"\"><span> If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Date of disclosure:</span></p></td><td><p class=\"\"><span>27/02/2026</span></p></td></tr><tr><td><p class=\"\"><span>Contact name:</span></p></td><td><p class=\"\"><span>Kamil Dziedzic</span></p></td></tr><tr><td><p class=\"\"><span>Telephone number:</span></p></td><td><p class=\"\"><span>+353 86 168 4821</span></p></td></tr></tbody></table></div><p class=\"\"><span>Public disclosures under Rule 8 of the Code must be made to a Regulatory Information</span></p><p class=\"\"><span>Service.</span></p><p class=\"\"><span>The Panel's Market Surveillance Unit is available for consultation in relation to the Code's</span></p><p class=\"\"><span>dealing disclosure requirements on +44 (0)20 7638 0129.</span></p><p class=\"\"><span>The Code can be viewed on the Panel's website at www.thetakeoverpanel.org.uk.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  FERTRMMTMTITBLF</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7457Ua:0-reg-bkofa-merrill-lynch-schroders-plc-form-8-5-ept-ri-schroders-plc/",
            "pub_date": "2026-02-27 18:50:22",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_EM28R1KTa:0",
            "title": "SOPHARMA AD - Preliminary annual consolidated financial report for 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>POLISH FINANCIAL SUPERVISION AUTHORITY</span></p><p class=\"\"><span>UNI - EN REPORT No 87 / 2026</span></p><p class=\"\"><span>Date of issue: 2026-02-27</span></p><p class=\"\"><span>Short name of the issuer</span></p><p class=\"\"><span>SOPHARMA AD</span></p><p class=\"\"><span>Subject</span></p><p class=\"\"><span>Preliminary annual consolidated financial report for 2025</span></p><p class=\"\"><span>Official market - legal basis</span></p><p class=\"\"><span>Art. 56. 1. 2 of Act on Public Offering</span></p><p class=\"\"><span>Unofficial market - legal basis</span></p><p class=\"\"><span>Contents of the report:</span></p><p class=\"\"><span>Preliminary annual consolidated financial report for 2025</span></p><p class=\"\"><span>Annexes</span></p><p class=\"\"><span>File Description</span></p><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260227_115029_1588482153_SFA_Q4_2025_cons_Financial_statements.rar</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260227:nEMbQhZGla\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_EM28R1KTa:0-sopharma-ad-preliminary-annual-consolidated-financial-report-for-2025/",
            "pub_date": "2026-02-27 18:50:41",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_PLX14D9D6:0",
            "title": "Observe Medical FY Operating Revenue Up At Nok 18.8 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY OPERATING REVENUE NOK 18.8 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>H2 OPERATING REVENUE NOK 7.5 MLN</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>H2 ADJ EBITDA LOSS NOK 14.8 MLN</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_PLX14D9D6:0-observe-medical-fy-operating-revenue-up-at-nok-18-8-million/",
            "pub_date": "2026-02-27 18:50:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7458Ua:0",
            "title": "REG - Goldman Sachs (EPT) Permanent TSB Group - Form 38.5a- PERMANENT TSB GROUP HOLDINGS PLC",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7458U  GoldmanSachs International  27 February 2026   </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FORM 38.5(a)</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>IRISH TAKEOVER PANEL</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DISCLOSURE UNDER RULE 38.5(a) OF THE IRISH TAKEOVER PANEL ACT, 1997, TAKEOVER RULES, 2013</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DEALINGS BY CONNECTED EXEMPT PRINCIPAL TRADERS WITH RECOGNISED INTERMEDIARY STATUS AND DEALING IN A CLIENT-SERVING CAPACITY</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>1. KEY INFORMATION</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Name of exempt principal trader</span></p></td><td><p class=\"\"><span>(GS) GOLDMAN SACHS INTERNATIONAL</span></p></td></tr><tr><td><p class=\"\"><span>Company dealt in</span></p></td><td><p class=\"\"><span>PERMANENT TSB GROUP HOLDINGS PLC</span></p></td></tr><tr><td><p class=\"\"><span>Class of relevant security to which the dealings being disclosed relate (Note1)</span></p></td><td><p class=\"\"><span>EUR 0.01 ordinary shares</span></p></td></tr><tr><td><p class=\"\"><span>Date of dealing</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td></tr></tbody></table></div><p class=\"\"><span>2.    DEALINGS (Note 2)</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(a) Purchases and sales</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Total number of relevant securities acquired</span></p></td><td><p class=\"\"><span>3,016</span></p></td></tr><tr><td><p class=\"\"><span>Highest price paid (Note 3)</span></p></td><td><p class=\"\"><span>3.1645 EUR</span></p></td></tr><tr><td><p class=\"\"><span>Lowest price paid (Note 3)</span></p></td><td><p class=\"\"><span>2.9600 EUR</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Total number of relevant securities disposed</span></p></td><td><p class=\"\"><span>878</span></p></td></tr><tr><td><p class=\"\"><span>Highest price received (Note 3)</span></p></td><td><p class=\"\"><span>3.2019 EUR</span></p></td></tr><tr><td><p class=\"\"><span>Lowest price received (Note 3)</span></p></td><td><p class=\"\"><span>2.9600 EUR</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(b) Derivatives transactions (other than options transactions)</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Product name, e.g. CFD</span></p></td><td><p class=\"\"><span>Nature of transaction  (Note 4)</span></p></td><td><p class=\"\"><span>Number of relevant securities  (Note 5)</span></p></td><td><p class=\"\"><span>Price per unit  (Note 3)</span></p></td></tr><tr><td><p class=\"\"><span>CFD</span></p></td><td><p class=\"\"><span>Reducing a short position</span></p></td><td><p class=\"\"><span>6,517</span></p></td><td><p class=\"\"><span>3.1968 EUR</span></p></td></tr><tr><td><p class=\"\"><span>CFD</span></p></td><td><p class=\"\"><span>Reducing a short position</span></p></td><td><p class=\"\"><span>18</span></p></td><td><p class=\"\"><span>3.2019 EUR</span></p></td></tr><tr><td><p class=\"\"><span>CFD</span></p></td><td><p class=\"\"><span>Reducing a short position</span></p></td><td><p class=\"\"><span>34</span></p></td><td><p class=\"\"><span>3.2019 EUR</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(c) Options transactions in respect of existing relevant securities</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(i) Writing, selling, purchasing or varying</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product name,e.g. call option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Writing, selling,  purchasing, varying etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of securities to which the option relates  (Note 5)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise price</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Type, e.g. American, European etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Expiry date</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Option money paid/received per unit  (Note 3)</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(ii)            Exercising</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product name,e.g. call option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of securities</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise price per unit  (Note 3)</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>4. OTHER INFORMATION</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Agreements, arrangements or understandings relating to options or derivatives</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Full details of any agreement, arrangement or understanding between the person disclosing and any other person relating to the voting rights of any relevant securities under any option referred to on this form or relating to the voting rights or future acquisition or disposal of any relevant securities to which any derivative referred to on this form is referenced.  If none, this should be stated. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NONE</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Date of disclosure</span></p></td><td><p class=\"\"><span>27 February 2026</span></p></td></tr><tr><td><p class=\"\"><span>Contact name</span></p></td><td><p class=\"\"><span>Papa Lette and Andrzej Szyszka</span></p></td></tr><tr><td><p class=\"\"><span>Telephone number</span></p></td><td><p class=\"\"><span>+33(1) 4212 1459 / +48(22) 317 4817</span></p></td></tr><tr><td><p class=\"\"><span>Name of offeree/offeror with which connected</span></p></td><td><p class=\"\"><span>PERMANENT TSB GROUP HOLDINGS PLC</span></p></td></tr><tr><td><p class=\"\"><span>Nature of connection (Note 6)</span></p></td><td><p class=\"\"><span>Advisor to Offeree</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  ITPSESFSWEMSEIE</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7458Ua:0-reg-goldman-sachs-ept-permanent-tsb-group-form-38-5a-permanent-tsb-group-holdings-plc/",
            "pub_date": "2026-02-27 18:50:53",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7459Ua:0",
            "title": "REG - Goldman Sachs (EPT) Permanent TSB Group - Form 38.5b- PERMANENT TSB GROUP HOLDINGS PLC",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7459U  GoldmanSachs International  27 February 2026   </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FORM 38.5(b)</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>IRISH TAKEOVER PANEL</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DISCLOSURE UNDER RULE 38.5(b) OF THE IRISH TAKEOVER PANEL ACT, 1997, TAKEOVER RULES, 2013</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DEALINGS BY CONNECTED EXEMPT PRINCIPAL TRADERS WITHOUT RECOGNISED INTERMEDIARY STATUS, OR WITH RECOGNISED INTERMEDIARY STATUS BUT NOT DEALING IN A CLIENT-SERVING CAPACITY</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>1. KEY INFORMATION</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Name of exempt principal trader</span></p></td><td><p class=\"\"><span>(GS) GOLDMAN SACHS INTERNATIONAL</span></p></td></tr><tr><td><p class=\"\"><span>Company dealt in</span></p></td><td><p class=\"\"><span>PERMANENT TSB GROUP HOLDINGS PLC</span></p></td></tr><tr><td><p class=\"\"><span>Class of relevant security to which the dealings being disclosed relate (Note1)</span></p></td><td><p class=\"\"><span>EUR 0.01 ordinary shares</span></p></td></tr><tr><td><p class=\"\"><span>Date of dealing</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>2. INTERESTS AND SHORT POSITIONS</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(a) Interests and short positions (following dealing) in the class of relevant security dealt in  (Note 2)</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><p class=\"\"><span>Long</span></p></td><td colspan=\"2\"><p class=\"\"><span>Short</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>(%)</span></p></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>(%)</span></p></td></tr><tr><td><p class=\"\"><span>(1) Relevant securities</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td><td><p class=\"\"><span>10,010</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td></tr><tr><td><p class=\"\"><span>(2) Derivatives (other than options)</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td></tr><tr><td><p class=\"\"><span>(3) Options and agreements to purchase/sell</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td></tr><tr><td><p class=\"\"><span>Total</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td><td><p class=\"\"><span>10,010</span></p></td><td><p class=\"\"><span>(0.00)</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(b) Interests and short positions in relevant securities of the company, other than the class dealt in  (Note 2)</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security:</span></p></td><td colspan=\"2\"><p class=\"\"><span>Long</span></p></td><td colspan=\"2\"><p class=\"\"><span>Short</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>(%)</span></p></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>(%)</span></p></td></tr><tr><td><p class=\"\"><span>(1) Relevant securities</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>(2) Derivatives (other than options)</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>(3) Options and agreements to purchase/sell</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Total</span></p></td><td></td><td></td><td></td><td></td></tr></tbody></table></div><p class=\"\"><span>3.    DEALINGS (Note 3)</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(a) Purchases and sales</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Purchase/sale</span></p></td><td><p class=\"\"><span>Number of relevant securities</span></p></td><td><p class=\"\"><span>Price per unit  (Note 4)</span></p></td></tr><tr><td><p class=\"\"><span>Purchase (Loan Full Return)</span></p></td><td><p class=\"\"><span>928</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Purchase (Loan Full Return)</span></p></td><td><p class=\"\"><span>921</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Purchase (Loan Partial Return)</span></p></td><td><p class=\"\"><span>13</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Purchase (Loan Full Return)</span></p></td><td><p class=\"\"><span>1,111</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Sale (Loan New)</span></p></td><td><p class=\"\"><span>2,646</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(b) Derivatives transactions (other than options transactions)</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product name, e.g. CFD</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nature of transaction  (Note 5)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of relevant securities  (Note 6)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price per unit  (Note 4)</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(c) Options transactions in respect of existing relevant securities</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(i) Writing, selling, purchasing or varying</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product name,e.g. call option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Writing, selling,  purchasing, varying etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of securities to which the option relates  (Note 7)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise price</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Type, e.g. American, European etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Expiry date</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Option money paid/received per unit  (Note 4)</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(ii)            Exercising</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product name,e.g. call option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of securities</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise price per unit  (Note 4)</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(d)            Other dealings (including transactions in respect of new securities)  (Note 3)</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nature of transaction  (Note 7)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price per unit (if applicable)  (Note 4)</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>4. OTHER INFORMATION</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Agreements, arrangements or understandings relating to options or derivatives</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Full details of any agreement, arrangement or understanding between the person disclosing and any other person relating to the voting rights of any relevant securities under any option referred to on this form or relating to the voting rights or future acquisition or disposal of any relevant securities to which any derivative referred to on this form is referenced.  If none, this should be stated. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NONE</span></p></li></ul><p class=\"\"><span>Is a Supplemental Form 8 attached? (Note 9)        NO</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Date of disclosure</span></p></td><td><p class=\"\"><span>27 February 2026</span></p></td></tr><tr><td><p class=\"\"><span>Contact name</span></p></td><td><p class=\"\"><span>Papa Lette and Andrzej Szyszka</span></p></td></tr><tr><td><p class=\"\"><span>Telephone number</span></p></td><td><p class=\"\"><span>+33(1) 4212 1459 / +48(22) 317 4817</span></p></td></tr><tr><td><p class=\"\"><span>Name of offeree/offeror with which connected</span></p></td><td><p class=\"\"><span>PERMANENT TSB GROUP HOLDINGS PLC</span></p></td></tr><tr><td><p class=\"\"><span>Nature of connection (Note 9)</span></p></td><td><p class=\"\"><span>Advisor to Offeree</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  ITPSESFSWEMSEIE</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7459Ua:0-reg-goldman-sachs-ept-permanent-tsb-group-form-38-5b-permanent-tsb-group-holdings-plc/",
            "pub_date": "2026-02-27 18:51:17",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ZawchktYl:0",
            "title": "ZAWYA-PRESSR: RAK Properties announces sales for Lunara on The Strand",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>• Sales to commence on 5th March for homes within Lunara on The Strand</span></p><p class=\"\"><span>• 49,500 sqm community on The Strand comprises of three connected towers</span></p><p class=\"\"><span>• Construction expected to begin in Q4 2026 with anticipated completion in Q1 2029</span></p><p class=\"\"><br/><span>Ras Al Khaimah, UAE: RAK Properties </span><span>, Ras Al Khaimah's leading publicly listed developer, has announced that sales for Lunara on The Strand will commence on 5th March 2026. The Strand is RAK Properties’ recently launched new destination located within the highly sought-after Marjan Beach District.</span></p><p class=\"\"><span>Lunara on The Strand will consist of 583 homes across a collection of three connected towers. It encompasses 49,500 sqm of GFA, representing almost AED 1 billion of The Strand’s overall anticipated gross sales value of AED 12 billion. Construction is scheduled to begin in Q4 2026 with an anticipated completion date of Q1 2029.</span></p><p class=\"\"><span>Available units include a mix of 1-2-bedroom apartments as well as a 3-bed penthouse, with competitive prices starting from AED 1.28m. A total of 14 retail and 8 F&amp;B spaces will complement the vision of RAK Properties and Vision 2030 by prioritising independent, UAE-grown vendors as part of a dynamic and authentic ecosystem.</span></p><p class=\"\"><span>Supporting connected living through a focus on amenities that empower contemporary lifestyles, Lunara on The Strand is well suited to meet the diverse needs of the next generation of residents drawn to Ras Al Khaimah’s mix of economic growth, investment opportunity and exciting real estate options.</span></p><p class=\"\"><span>Lunara on The Strand will mature into a bustling hub with state-of-the-art co-working zones, diverse leisure options, and busy streets that prioritise convenience and connectivity.</span></p><p class=\"\"><span>Sameh Muhtadi, Chief Executive Officer, RAK Properties, said: “We are excited to bring Lunara on The Strand to market, representing the next stage in RAK Properties’ overall growth journey.</span></p><p class=\"\"><span>As a destination that supports connected living across a vibrant and walkable community, The Strand has been carefully designed to empower residents who are seeking more than just a new home, but a whole new way of living.</span></p><p class=\"\"><span>\"As the first community to be launched as part of The Strand masterplan, Lunara on The Strand sits at the core of Ras Al Khaimah’s new Marjan Beach District. As such, residents will enjoy easy access to an upcoming portfolio of beachfront hotels, a large public park, and upgraded transportation infrastructure.”</span></p><p class=\"\"><span>The Strand is strategically positioned to benefit from the upcoming Wynn Resort, the UAE’s first integrated destination which will be connected to the mainland by the purpose-built Wynn Bridge. The Strand is also adjacent to the E11 arterial highway, which is currently undergoing major upgrades. A planned public park will add to the masterplan’s livability.</span></p><p class=\"\"><span>The Marjan beachfront, located within a short 2-minute walk from The Strand, will be home to global hospitality brands and beach clubs, further reinforcing this stretch of Ras Al Khaimah’s coastline as a major lifestyle hub for tourists and residents alike. Also in close proximity to The Strand are key lifestyle amenities such as shopping malls and golf courses.</span></p><p class=\"\"><span>Buyers and investors wishing to be among the first to purchase a home in Lunara on The Strand can do so by visiting RAK Properties’ sales offices in Dubai’s Business Bay and in Mina, Ras Al Khaimah from 5th March from 10:00-19:00. For more information, please visit www.thestrand.ae</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About RAK Properties</span></strong></p><p class=\"\"><span>Founded in 2005 under the visionary leadership of His Highness Sheikh Saud Bin Saqr Al Qasimi, Ruler of Ras Al Khaimah, RAK Properties is a leading real estate developer committed to producing exceptional and sustainable destinations. Specialising in contemporary and meticulously crafted communities, RAK Properties integrates excellence, innovation, and nature to create enriching lifestyles in alignment with the aspirations of tomorrow’s people.  </span></p><p class=\"\"><span>RAK Properties plays a pivotal role in achieving RAK Vision 2030, focusing on delivering economic, social, and environmental value, all aimed at enhancing lives and places, and contributing to the prosperous narrative of Ras Al Khaimah.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Awards and recognitions</span></strong></p><p class=\"\"><span>· Awarded ‘Developer of the Year’ 2023 by Construction Week Middle East.</span></p><p class=\"\"><span>· Bay Views Residences won the ‘Best Residential Project’ at the Design Middle East Awards 2023, where the residential development was recognized as the region's best design and architecture.  </span></p><p class=\"\"><span>· Quattro Del Mar was awarded the Best Mixed-Use Project at the prestigious Pillars of Real Estate Awards 2024.</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ZawchktYl:0-zawya-pressr-rak-properties-announces-sales-for-lunara-on-the-strand/",
            "pub_date": "2026-02-27 18:44:11",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2946039:0",
            "title": "PPL: 2025 revenue rose but net income fell on lower NGL margins and new pipeline tolls",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew to $7.8 billion in 2025, but net income declined to $1.7 billion due to lower NGL margins, impairments, and new pipeline toll structures. Major acquisitions and pipeline expansions were completed, while capital spending and adjusted EBITDA both decreased year-over-year.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2946039-5e6e2b3aea2871060e2c1b28823b129f\" target=\"_blank\">Pembina Pipeline Corporation [PPL] Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2946039:0-ppl-2025-revenue-rose-but-net-income-fell-on-lower-ngl-margins-and-new-pipeline-tolls/",
            "pub_date": "2026-02-27 18:44:15",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7452Ua:0",
            "title": "REG - Watches of Switzlnd. - Director/PDMR Shareholding",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7452U  Watches of Switzerland Group PLC  27 February 2026   </span><p class=\"\"><span>Watches of Switzerland Group PLC</span></p><p class=\"\"><span>Notification of transactions by Directors, Persons Discharging Managerial Responsibilities (\"PDMRs\") and persons closely associated with them</span></p><p class=\"\"><span>The following information is given in accordance with Article 19 of the UK Market Abuse Regulation and is made on behalf of Chabi Nouri a PDMR.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>1</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the person discharging managerial responsibilities/person closely associated</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Name</span></p></td><td><p class=\"\"><span>Chabi Nouri</span></p></td></tr><tr><td><p class=\"\"><span>2</span></p></td><td colspan=\"2\"><p class=\"\"><span>Reason for the notification</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Position/status</span></p></td><td><p class=\"\"><span>Non-Executive Director</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>Initial notification/Amendment</span></p></td><td><p class=\"\"><span>Initial Notification   </span></p></td></tr><tr><td><p class=\"\"><span>3</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Name</span></p></td><td><p class=\"\"><span>Watches of Switzerland Group PLC</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>LEI</span></p></td><td><p class=\"\"><span>2138008ZOT5K9PJW7168</span></p></td></tr><tr><td><p class=\"\"><span>4</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; and (iv) each place where transactions have been conducted</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Description of the financial instrument, type of instrument</span></p><p class=\"\"><span>Identification code</span></p></td><td><p class=\"\"><span>Ordinary Shares of £0.0125</span></p><p class=\"\"><span>ISIN: GB00BJDQQ870</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>Nature of the transaction</span></p></td><td><p class=\"\"><span>Purchase of ordinary shares</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Volume</span></p></td><td><p class=\"\"><span>Price (p)</span></p></td></tr><tr><td><p class=\"\"><span>2500</span></p></td><td><p class=\"\"><span>515</span></p></td></tr></tbody></table></div></td></tr><tr><td><p class=\"\"><span>d)</span></p></td><td><p class=\"\"><span>Aggregated information</span></p><p class=\"\"><span> Aggregated volume</span></p><p class=\"\"><span>- Price</span></p></td><td><p class=\"\"><span>£12,875</span></p><p class=\"\"><span>2,500</span></p><p class=\"\"><span>£5.15</span></p></td></tr><tr><td><p class=\"\"><span>e)</span></p></td><td><p class=\"\"><span>Date of the transaction</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td></tr><tr><td><p class=\"\"><span>f)</span></p></td><td><p class=\"\"><span>Place of the transaction</span></p></td><td><p class=\"\"><span>XLON</span></p></td></tr></tbody></table></div><p class=\"\"><span>Contact</span></p><p class=\"\"><span>Caroline Browne                                                              +44 (0) 116 281 7420</span></p><p class=\"\"><span>Group Finance and Investor Relations Director</span></p><p class=\"\"><span>E: investor.relations@thewosgroup.com</span></p><p class=\"\"><span>Laura Battley                                                                      +44 (0) 207 317 4601</span></p><p class=\"\"><span>Company Secretary &amp; General Counsel</span></p><p class=\"\"><span>E: companysecretariat@thewosgroup.com</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  DSHBGGDDXSDDGLR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7452Ua:0-reg-watches-of-switzlnd-director-pdmr-shareholding/",
            "pub_date": "2026-02-27 18:44:16",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2946045:0",
            "title": "ACT: Specialty chemicals drove record margins and growth, with major capacity expansions underway",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Sales and EBITDA grew in 2025, driven by specialty chemicals, with record margins and strong cash flow. Major investments in creatine and defense capacity will support double-digit growth from 2027, despite a temporary EBITDA impact from furnace maintenance in 2026.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2946045:0-act-specialty-chemicals-drove-record-margins-and-growth-with-major-capacity-expansions-underway/",
            "pub_date": "2026-02-27 18:44:19",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN0O6:0",
            "title": "What U.S. swaps traders think about rates",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>STOXX 600 up 0.4%</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Stocks set for big monthly rise</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Flutter slumps after earnings</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Wall St futures edge lower</span></li></ul></span></div><span><p class=\"\"><span>WHAT U.S. SWAPS TRADERS THINK ABOUT RATES</span></p><p class=\"\"><span>Markets may still be pencilling in about two Fed rate cuts for this year, but the 25 basis point slide in U.S. 10-year Treasury yields in February shows investors are growing more confident that more aggressive easing might lie ahead.</span></p><p class=\"\"><span>“We can only deduce from the overnight index swap (OIS) market still pricing in 50 bps of rate cuts is that traders expect a 'dovish' structural shift coming at the Fed once the new Chairperson arrives at the Fed, presumably, Kevin Warsh,” says Thierry Wizman, global forex and rates strategist at Macquarie Group.</span></p><p class=\"\"><span>“In the back of the market's mind may be the premise also that the Fed may be willing to let the economy ‘run hot’ and enable more AI investing via cheap financing, in order to advance the disinflationary and productivity benefits that will come when AI is deployed at scale by 2028,” he adds.</span></p><p class=\"\"><span>Economists at Barclays say markets are now pricing in a delayed, but deeper, easing cycle in the U.S..</span></p><p class=\"\"><span>“We think that is justified given the combination of data so far less need for insurance cuts in the near term, upside risks to nominal GDP growth abating, medium-term inflation outlook improving, and risk of fiscal slippage,” they say.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN0O6:0-what-u-s-swaps-traders-think-about-rates/",
            "pub_date": "2026-02-27 18:44:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:7a3aef2a7094b:0",
            "title": "The Aluminum Supercycle's Pure-Play: Why Alcoa's Operational Transformation Deserves Attention",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investment Thesis: The Best Torque-Adjusted Aluminum Bet</span></strong></p><p class=\"\"><span>Aluminum is a commodity, and Alcoa will always be a cyclical business. No amount of operational improvement changes the fact that earnings rise and fall with LME prices. The relevant question for investors is not whether Alcoa is better than it used to be it demonstrably is but whether it is the best investment opportunity in aluminum today.</span></p><p class=\"\"><span>We address that question directly. When benchmarked against Norsk Hydro and Century Aluminum the two most investable Western aluminum peers Alcoa is not the lowest-cost producer, nor the cleanest balance sheet, nor clearly the cheapest on P/FCF or EV per tonne. Norsk screens better on several simple valuation metrics. Century offers more torque in certain spot-price scenarios but carries materially higher balance sheet risk. Our thesis is not that Alcoa is improved. It is that if you expect structurally higher aluminum prices, Alcoa offers the most torque-adjusted exposure to that view without requiring a binary balance-sheet bet.</span></p><p class=\"\"><span>Alcoa combines full vertical integration (bauxite ? alumina ? aluminum), $675 million in permanent cost reductions that lower the breakeven, 100% AWAC ownership eliminating 40% NCI leakage, and a balance sheet that has reached its target range for the first time since the 2016 separation. The result is a business that generates meaningful excess cash at normalized prices, survives troughs, and provides operational leverage to aluminum that neither Norsk (too diversified, lower beta) nor Century (too leveraged, single-segment) can replicate on a risk-adjusted basis.</span></p><p class=\"\"><span>This report benchmarks all three names explicitly, shows under what aluminum price assumptions each is the better bet, and makes the comparative case for Alcoa as the highest-quality cyclical torque play in the sector.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Competitive Benchmarking: Alcoa vs. Norsk Hydro vs. Century</span></strong></p><p class=\"\"><span>Investment decisions are relative. Before arguing why Alcoa deserves capital, we establish how it stacks up against the alternatives on observable, comparable metrics.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Peer Comparison: Key Operating and Valuation Metrics</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\"><span>Metric</span></td><td colspan=\"1\"><span>Alcoa </span></td><td colspan=\"1\"><span>Norsk Hydro (NHY)</span></td><td colspan=\"1\"><span>Century (CENX)</span></td></tr><tr><td colspan=\"1\"><span>Market Cap</span></td><td colspan=\"1\"><span>~$16B</span></td><td colspan=\"1\"><span>~$11B</span></td><td colspan=\"1\"><span>~$2.5B</span></td></tr><tr><td colspan=\"1\"><span>Enterprise Value</span></td><td colspan=\"1\"><span>~$17.5B</span></td><td colspan=\"1\"><span>~$13B</span></td><td colspan=\"1\"><span>~$2.8B</span></td></tr><tr><td colspan=\"1\"><span>Al Production (Mt)</span></td><td colspan=\"1\"><span>2.3</span></td><td colspan=\"1\"><span>2.0</span></td><td colspan=\"1\"><span>0.8</span></td></tr><tr><td colspan=\"1\"><span>EV / Tonne ($)</span></td><td colspan=\"1\"><span>~$7,600</span></td><td colspan=\"1\"><span>~$6,500</span></td><td colspan=\"1\"><span>~$3,500</span></td></tr><tr><td colspan=\"1\"><span>Vertical Integration</span></td><td colspan=\"1\"><span>Full (Bx?Al?Al)</span></td><td colspan=\"1\"><span>Partial + Downstream</span></td><td colspan=\"1\"><span>Smelting Only</span></td></tr><tr><td colspan=\"1\"><span>2025 Adj. EBITDA ($M)</span></td><td colspan=\"1\"><span>~$3,400</span></td><td colspan=\"1\"><span>~$2,200</span></td><td colspan=\"1\"><span>~$350</span></td></tr><tr><td colspan=\"1\"><span>EV / 2025 EBITDA</span></td><td colspan=\"1\"><span>~5.1x</span></td><td colspan=\"1\"><span>~5.9x</span></td><td colspan=\"1\"><span>~8.0x</span></td></tr><tr><td colspan=\"1\"><span>Net Debt / EBITDA</span></td><td colspan=\"1\"><span>0.44x</span></td><td colspan=\"1\"><span>~0.3x</span></td><td colspan=\"1\"><span>~1.5x</span></td></tr><tr><td colspan=\"1\"><span>Norm. FCF Yield (est.)</span></td><td colspan=\"1\"><span>35%</span></td><td colspan=\"1\"><span>46%</span></td><td colspan=\"1\"><span>28%*</span></td></tr><tr><td colspan=\"1\"><span>Cost Position (Quartile)</span></td><td colspan=\"1\"><span>Q1Q2</span></td><td colspan=\"1\"><span>Q1Q2</span></td><td colspan=\"1\"><span>Q2Q3</span></td></tr><tr><td colspan=\"1\"><span>Beta</span></td><td colspan=\"1\"><span>2.01</span></td><td colspan=\"1\"><span>~1.3</span></td><td colspan=\"1\"><span>~2.5</span></td></tr><tr><td colspan=\"1\"><span>Dividend Yield</span></td><td colspan=\"1\"><span>~0.65%</span></td><td colspan=\"1\"><span>~3.5%</span></td><td colspan=\"1\"><span>0%</span></td></tr></tbody></table></div><p class=\"\"><em><span>*Century's FCF yield range is wider due to higher operating leverage and balance sheet sensitivity. Green = relative advantage; Orange = relative disadvantage.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>What the Table Tells Us Honestly</span></strong></p><p class=\"\"><span>The numbers do not paint a simple picture. Norsk Hydro screens better on several straightforward metrics: lower EV/tonne (~$6,500 vs. Alcoa's ~$7,600), a cleaner balance sheet (0.3x net debt/EBITDA), a meaningful dividend yield (~3.5%), and lower beta (~1.3). For investors seeking steady aluminum exposure with income, Norsk is arguably the safer choice.</span></p><p class=\"\"><span>Century is the cheapest on EV/tonne (~$3,500) and offers the most raw torque to spot aluminum: its higher operating leverage and smaller scale mean earnings explode in a $3,000+/tonne environment. But Century is a single-segment smelter with no upstream integration, ~1.5x leverage, no dividend, and a cost position in the second-to-third quartile. It is a leveraged bet on price, not a business you own through cycles.</span></p><p class=\"\"><span>Alcoa sits in the middle and that positioning is the thesis. It is not the cheapest, safest, or most levered name. It is the one that combines full vertical integration, first-to-second quartile costs, a now-adequate balance sheet, and high operational leverage to aluminum prices. This combination matters because it determines how the investment performs across scenarios, not just at spot.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Torque Framework: Who Wins at Each Price?</span></strong></p><p class=\"\"><span>The honest investor's question is: under what aluminum price assumptions does each name generate the best risk-adjusted return? We model three price environments and estimate the impact on each company's earnings and shareholder outcomes.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Scenario Matrix: EBITDA and FCF by LME Price</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\"><span>LME Scenario</span></td><td colspan=\"1\"><span>$/Tonne</span></td><td colspan=\"1\"><span>AA EBITDA</span></td><td colspan=\"1\"><span>NHY EBITDA</span></td><td colspan=\"1\"><span>CENX EBITDA</span></td><td colspan=\"1\"><span>Best Risk-Adj.</span></td></tr><tr><td colspan=\"1\"><span>Trough</span></td><td colspan=\"1\"><span>$2,250</span></td><td colspan=\"1\"><span>~$950M</span></td><td colspan=\"1\"><span>~$1,200M</span></td><td colspan=\"1\"><span>~$50100M</span></td><td colspan=\"1\"><span>Norsk Hydro</span></td></tr><tr><td colspan=\"1\"><span>Mid-Cycle</span></td><td colspan=\"1\"><span>$2,700</span></td><td colspan=\"1\"><span>~$1,800M</span></td><td colspan=\"1\"><span>~$1,800M</span></td><td colspan=\"1\"><span>~$250M</span></td><td colspan=\"1\"><span>Alcoa</span></td></tr><tr><td colspan=\"1\"><span>Elevated</span></td><td colspan=\"1\"><span>$3,200</span></td><td colspan=\"1\"><span>~$2,800M</span></td><td colspan=\"1\"><span>~$2,400M</span></td><td colspan=\"1\"><span>~$500M</span></td><td colspan=\"1\"><span>Alcoa / Century</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Interpreting the Scenarios</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>At trough ($2,250/t): </span></strong><span>Norsk wins. Its downstream value-added segments (extrusions, energy) provide earnings diversification that Alcoa and Century lack. Century is barely cash-flow positive and faces balance sheet stress. Alcoa survives generating an estimated $950M$1,000M EBITDA versus $289M in 2023 at the same price, thanks to $675M in cost savings but does not offer the best risk-adjusted return. If you expect a prolonged downturn, Norsk is the better name.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>At mid-cycle ($2,700/t): </span></strong><span>Alcoa's vertical integration and cost improvements produce comparable EBITDA to Norsk (~$1,800M each) but on a lower EV/EBITDA multiple (~5.1x vs. ~5.9x), implying greater value per dollar of earnings. Century generates modest FCF but cannot match the through-cycle reliability of either larger peer. This is Alcoa's sweet spot: generating meaningful excess cash ($775M normalized FCF) with the balance sheet capacity to return it.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>At elevated ($3,200/t): </span></strong><span>Both Alcoa and Century offer significant torque, but Alcoa captures margin at every stage of the value chain (bauxite, alumina, aluminum) while Century captures only the smelting spread. Alcoa's beta of 2.01 means the stock price amplifies the move. Century's beta is higher (~2.5), but the balance sheet risk makes it a less reliable way to express the view.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The takeaway: Alcoa is the best risk-adjusted bet if you believe aluminum prices will be at or above mid-cycle ($2,700+/t) through the next 23 years. If you expect a sustained downturn, Norsk's diversification protects better. If you want maximum binary torque and accept the leverage risk, Century is your trade. Alcoa occupies the middle ground which, for most allocators, is exactly where you want to be.</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Three Structural Improvements That Justify Mid-Cycle Confidence</span></strong></p><p class=\"\"><span>The scenario matrix above depends on Alcoa's cost structure being durably improved. This section provides the evidence. The transformation is not speculative; it is completed and auditable in the financials.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>1. $675 Million in Permanent Cost Savings Lower the Breakeven</span></strong></p><p class=\"\"><span>In January 2024, Alcoa announced a target of $645 million in profitability improvements by year-end 2025. By Q4 2024 a full year ahead of schedule the company had exceeded the target by $30 million, delivering $675 million in annual run-rate savings. These are not cyclical gains from favorable input prices. They encompass $100 million in raw materials procurement, an 8% reduction in electricity consumption per tonne, and operational efficiencies across the refining and smelting base.</span></p><p class=\"\"><span>The practical significance: in 2023, with aluminum averaging ~$2,250/tonne, Alcoa posted adjusted EBITDA of approximately $289 million on its legacy cost structure. Applying $675 million in structural savings to that same price implies EBITDA near $950$1,000 million a level that would have produced meaningfully positive FCF rather than the $436 million cash outflow actually recorded. The cost program did not merely improve peak earnings; it shifted the entire distribution of outcomes upward.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>2. 100% AWAC Ownership Eliminates 40% Earnings Leakage</span></strong></p><p class=\"\"><span>The August 2024 all-stock acquisition of Alumina Limited for $2.8 billion eliminated the 40% noncontrolling interest in AWAC, the JV holding five of the world's twenty largest bauxite mines and alumina refineries outside China. Every dollar of refining and mining profit now accrues entirely to Alcoa shareholders. In 2025, alumina prices fell ~42% while aluminum surged Alcoa captured margin at both stages. This natural hedge is unique among the peer set: Norsk has partial upstream integration; Century has none.</span></p><p class=\"\"><span>The acquisition was funded with stock (diluting shares from ~178M to 259M, a 45% increase). This dilution is real and material. If Alcoa fails to grow earnings proportionately or implement buybacks, per-share value creation will lag total business value. This is the highest-priority capital allocation item to monitor.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>3. Balance Sheet at Target Creates Room for Returns</span></strong></p><p class=\"\"><span>Net debt declined from ~$2.4 billion (mid-2024) to $1.5 billion (year-end 2025), funded primarily by the $1.35 billion Ma'aden JV sale. Cash on hand: $1.6 billion. Debt-to-equity: 0.40x. Current ratio: 1.56x. For the first time since the 2016 separation, future FCF is not earmarked for emergency deleveraging. This is what separates Alcoa from Century: both offer cyclical torque, but only Alcoa can credibly return cash through the cycle.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Normalized Free Cash Flow: What Alcoa Generates Through the Cycle</span></strong></p><p class=\"\"><span>The central question for a permanent owner is not what Alcoa earns at $3,100/tonne, but what it earns at a normalized price. Below we construct a framework and then compare the output to peers.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\"></td><td colspan=\"1\"><span>Conservative</span></td><td colspan=\"1\"><span>Base Case</span></td></tr><tr><td colspan=\"1\"><span>Assumed LME ($/tonne)</span></td><td colspan=\"1\"><span>$2,500</span></td><td colspan=\"1\"><span>$2,700</span></td></tr><tr><td colspan=\"1\"><span>Al Production (Mt)</span></td><td colspan=\"1\"><span>2.3</span></td><td colspan=\"1\"><span>2.5</span></td></tr><tr><td colspan=\"1\"><span>Estimated Adj. EBITDA ($M)</span></td><td colspan=\"1\"><span>$1,400</span></td><td colspan=\"1\"><span>$1,800</span></td></tr><tr><td colspan=\"1\"><span>Less: Sustaining Capex ($M)</span></td><td colspan=\"1\"><span>($550)</span></td><td colspan=\"1\"><span>($575)</span></td></tr><tr><td colspan=\"1\"><span>Less: Cash Interest ($M)</span></td><td colspan=\"1\"><span>($150)</span></td><td colspan=\"1\"><span>($150)</span></td></tr><tr><td colspan=\"1\"><span>Less: Cash Taxes ($M)</span></td><td colspan=\"1\"><span>($175)</span></td><td colspan=\"1\"><span>($250)</span></td></tr><tr><td colspan=\"1\"><span>Less: Working Capital / Other</span></td><td colspan=\"1\"><span>($50)</span></td><td colspan=\"1\"><span>($50)</span></td></tr><tr><td colspan=\"1\"><span>Normalized FCF ($M)</span></td><td colspan=\"1\"><span>$475</span></td><td colspan=\"1\"><span>$775</span></td></tr><tr><td colspan=\"1\"><span>FCF per Share</span></td><td colspan=\"1\"><span>$1.83</span></td><td colspan=\"1\"><span>$2.99</span></td></tr><tr><td colspan=\"1\"><span>FCF Yield (at $62)</span></td><td colspan=\"1\"><span>3.0%</span></td><td colspan=\"1\"><span>4.8%</span></td></tr></tbody></table></div><p class=\"\"><span>At the conservative case ($2,500/tonne), a 3% FCF yield on a cyclical commodity producer is not obviously cheap. Norsk's estimated 46% normalized yield screens better at this price. The honest case for Alcoa requires conviction that mid-cycle aluminum is closer to $2,700/tonne which we believe is supported by China's 45 million tonne production cap (98% utilized), declining LME warehouse inventories (~700,000 tonnes, down from 3M+), and ex-China smelter economics that require $2,500+ to incentivize new capacity.</span></p><p class=\"\"><span>At the base case, 4.8% normalized FCF yield for a vertically integrated, first-to-second quartile cost producer begins to look attractive, particularly given the optionality from San Ciprian (228,000 tonnes incremental), Wagerup gallium ($4080M annual revenue potential), and $500M$1B in idle-site monetizations. This is excess cash that did not exist three years ago under the same pricing conditions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Capital Allocation: What Will Management Do With the Cash?</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Capital Allocation Scorecard</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\"><span>Category</span></td><td colspan=\"1\"><span>Evidence</span></td><td colspan=\"1\"><span>Assessment</span></td></tr><tr><td colspan=\"1\"><span>Debt Reduction</span></td><td colspan=\"1\"><span>Net debt from $2.4B to $1.5B in 18 months; early redemption of $141M notes; $385M facility paydown</span></td><td colspan=\"1\"><span>Strong</span></td></tr><tr><td colspan=\"1\"><span>Dividends</span></td><td colspan=\"1\"><span>$0.40/share ($105M in 2025); modest but consistent; ~0.65% yield</span></td><td colspan=\"1\"><span>Adequate</span></td></tr><tr><td colspan=\"1\"><span>Buybacks</span></td><td colspan=\"1\"><span>No program active; shares +45% via Alumina acquisition; per-share value drag until addressed</span></td><td colspan=\"1\"><span>Incomplete</span></td></tr><tr><td colspan=\"1\"><span>Growth Capex</span></td><td colspan=\"1\"><span>San Ciprian JV limits capital at risk; Wagerup gallium backed by govt financing; brownfield focus</span></td><td colspan=\"1\"><span>Disciplined</span></td></tr><tr><td colspan=\"1\"><span>Portfolio Mgmt</span></td><td colspan=\"1\"><span>Ma'aden sale ($1.35B) at fair value; $500M$1B idle site target; Kwinana closure decisive</span></td><td colspan=\"1\"><span>Strong</span></td></tr></tbody></table></div><p class=\"\"><span>The most notable gap is buybacks. With 259 million shares outstanding up 45% and the stock arguably below intrinsic value, a buyback authorization would be a powerful signal. The CFO has stated dividends and debt reduction remain priorities, with buybacks considered as conditions warrant. This is reasonable for a company that only recently hit balance sheet targets, but investors should watch for formal authorization as the next maturity indicator. Norsk, by contrast, has an active buyback program and a 3.5% dividend a clear advantage for income-oriented investors.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Five-Year Per-Share Value Creation Scenarios ($600M Avg. Annual FCF)</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\"></td><td colspan=\"1\"><span>Debt Focus</span></td><td colspan=\"1\"><span>Balanced</span></td><td colspan=\"1\"><span>Buyback Focus</span></td></tr><tr><td colspan=\"1\"><span>Allocation</span></td><td colspan=\"1\"><span>60% debt, 30% div, 10% growth</span></td><td colspan=\"1\"><span>30% debt, 30% div, 20% BB, 20% growth</span></td><td colspan=\"1\"><span>10% debt, 25% div, 50% BB, 15% growth</span></td></tr><tr><td colspan=\"1\"><span>Ending Net Debt</span></td><td colspan=\"1\"><span>~($300M) net cash</span></td><td colspan=\"1\"><span>~$600M</span></td><td colspan=\"1\"><span>~$1.2B</span></td></tr><tr><td colspan=\"1\"><span>Shares Retired</span></td><td colspan=\"1\"><span>0M</span></td><td colspan=\"1\"><span>~10M</span></td><td colspan=\"1\"><span>~24M</span></td></tr><tr><td colspan=\"1\"><span>Ending Share Count</span></td><td colspan=\"1\"><span>~259M</span></td><td colspan=\"1\"><span>~249M</span></td><td colspan=\"1\"><span>~235M</span></td></tr><tr><td colspan=\"1\"><span>Ending FCF/Share</span></td><td colspan=\"1\"><span>$2.32</span></td><td colspan=\"1\"><span>$2.41</span></td><td colspan=\"1\"><span>$2.55</span></td></tr></tbody></table></div><p class=\"\"><span>Under the balanced scenario the most likely outcome an owner who buys at $62 receives ~$3.50/share in cumulative dividends over five years, plus a business with lower debt, a smaller share count, and FCF power approaching $2.41/share. That represents meaningful real return even if the stock price goes nowhere.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Trough Survival: Why This Downturn Will Be Different</span></strong></p><p class=\"\"><span>The most important question a permanent owner asks of a cyclical business is not how good are the peaks? but how painful are the troughs? This is also where the peer comparison sharpens.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\"><span>Metric (at $2,250/t)</span></td><td colspan=\"1\"><span>Alcoa 2023 (Actual)</span></td><td colspan=\"1\"><span>Alcoa Next Trough (Est.)</span></td><td colspan=\"1\"><span>Century Next Trough (Est.)</span></td></tr><tr><td colspan=\"1\"><span>Adj. EBITDA</span></td><td colspan=\"1\"><span>~$289M</span></td><td colspan=\"1\"><span>~$950$1,000M</span></td><td colspan=\"1\"><span>~$50100M</span></td></tr><tr><td colspan=\"1\"><span>NCI Leakage</span></td><td colspan=\"1\"><span>~40%</span></td><td colspan=\"1\"><span>0%</span></td><td colspan=\"1\"><span>N/A</span></td></tr><tr><td colspan=\"1\"><span>FCF</span></td><td colspan=\"1\"><span>($436M)</span></td><td colspan=\"1\"><span>$200$400M</span></td><td colspan=\"1\"><span>($50)$0M</span></td></tr><tr><td colspan=\"1\"><span>Dividend Sustainability</span></td><td colspan=\"1\"><span>At risk</span></td><td colspan=\"1\"><span>Covered</span></td><td colspan=\"1\"><span>No dividend</span></td></tr><tr><td colspan=\"1\"><span>Balance Sheet Stress</span></td><td colspan=\"1\"><span>High</span></td><td colspan=\"1\"><span>Low</span></td><td colspan=\"1\"><span>Elevated</span></td></tr></tbody></table></div><p class=\"\"><span>At the same $2,250/tonne trough price, Alcoa would now generate an estimated $950$1,000M in EBITDA (vs. $289M in 2023), produce positive FCF (vs. negative $436M), and maintain its dividend. Century, by contrast, approaches breakeven with balance sheet stress. This is the structural difference that justifies Alcoa over Century for investors who want to hold through cycles rather than trade the peaks.</span></p><p class=\"\"><span>A further tailwind supports a higher floor: China's 45 million tonne cap (98% utilized) means global supply growth must come from ex-China smelters with higher costs and longer timelines. LME inventories have declined from 3M+ tonnes to ~700,000 tonnes. Alcoa does not need this to happen, but it provides additional margin of safety.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Optionality Beyond Normalized Earnings</span></strong></p><p class=\"\"><span>The core thesis rests on normalized cash generation, not upside scenarios. But several sources of optionality could meaningfully augment returns and are not priced in:</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>San Ciprian: </span></strong><span>228,000 tonnes at full operation by late 2026 could contribute $150250M annual EBITDA at $3,000/t. The 75/25 JV with IGNIS limits Alcoa's capital while preserving majority upside. Not in normalized estimates.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>Gallium at Wagerup: </span></strong><span>$200M government-backed project; 100 tonnes annually (~10% of non-Chinese supply). With China controlling 98% of supply and imposing export restrictions, Alcoa's co-located production reduces capex 6070% vs. greenfield. $4080M annual revenue by 20282029.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>Idle-site monetization: </span></strong><span>$500M$1B targeted from 10 priority sites over five years. Pure asset recycling.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>CBAM green premium: </span></strong><span>Quebec hydro smelters produce ~2 tonnes CO?/tonne vs. 1216 industry average. EU Carbon Border Adjustment Mechanism projected net positive $10/tonne in 2026, growing as carbon pricing tightens. Norsk has a similar advantage; Century does not.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Risks an Owner Must Accept</span></strong></p><p class=\"\"><span>We are not arguing Alcoa is without risk. We are arguing the risk is better compensated here than in Century, and the torque is better than in Norsk. The following risks are real:</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>Price volatility is structural: </span></strong><span>Aluminum has declined from $3,800 to $2,100 within 18 months before. A beta of 2.01 means the stock amplifies market moves. Paper losses will test conviction.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>European energy costs: </span></strong><span>Spanish electricity runs ~50/MWh above Nordic competitors. San Ciprian may not reach cash neutrality until H2 2027. If European energy policy deteriorates, the 228,000-tonne smelter becomes a cost center.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>WA mine approvals: </span></strong><span>Bauxite mining requires ongoing environmental approvals from WA EPA, with ministerial decisions expected by end 2026. Delays could constrain alumina production from Alcoa's most important refining region.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>Acquisition dilution: </span></strong><span>Shares outstanding +45%. Without buybacks or disproportionate earnings growth, per-share value creation lags total business value. This is the single most important capital allocation item to watch.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>Transformation partly priced in: </span></strong><span>The stock is significantly higher than the 2023 trough. Customers don't care about legacy dilution or internal cleanup they care about delivered cost and reliability. Some operational improvement is in the price.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Valuation: What an Owner Pays for Normalized Cash</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\"><span>Scenario</span></td><td colspan=\"1\"><span>Assumptions</span></td><td colspan=\"1\"><span>Implied Value</span></td></tr><tr><td colspan=\"1\"><span>Bear Case</span></td><td colspan=\"1\"><span>$2,250/t sustained; pipeline delays; 7% FCF yield required</span></td><td colspan=\"1\"><span>~$26$37/share</span></td></tr><tr><td colspan=\"1\"><span>Base Case</span></td><td colspan=\"1\"><span>$2,700/t mid-cycle; cost savings hold; 5% FCF yield</span></td><td colspan=\"1\"><span>~$60$78/share</span></td></tr><tr><td colspan=\"1\"><span>Bull Case</span></td><td colspan=\"1\"><span>$3,200/t; San Ciprian + gallium contributing; buybacks active; 4% FCF yield</span></td><td colspan=\"1\"><span>$90+/share</span></td></tr></tbody></table></div><p class=\"\"><span>At $62, the stock prices in the low end of our base case. If mid-cycle aluminum is $2,700/tonne and cost savings are durable both of which we believe there is ~26% upside to our $78 target with additional optionality from buyback initiation and San Ciprian ramp. Downside to the bear case is meaningful (~$37 at a 5% yield, $26 at 7%), which is why this is not a buy and forget name. It is a high-conviction cyclical position for investors with an aluminum view.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Conclusion: The Comparative Case for Alcoa</span></strong></p><p class=\"\"><span>We do not argue Alcoa is the cheapest aluminum stock (Century is cheaper on EV/tonne). We do not argue it has the strongest balance sheet or highest yield (Norsk wins both). We do not argue the transformation alone justifies the investment (it's partly priced in).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>We argue that Alcoa offers the most torque-adjusted exposure to higher aluminum prices without requiring a binary balance-sheet bet. </span></strong><span>Full vertical integration captures margin across the value chain. $675M in permanent cost savings make troughs survivable. 100% AWAC ownership eliminates earnings leakage. And a balance sheet at target for the first time creates room for shareholder returns.</span></p><p class=\"\"><span>The defining comparison is straightforward:</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>If you want safety and income in aluminum: </span></strong><span>buy Norsk Hydro.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>If you want maximum binary torque and accept the leverage: </span></strong><span>trade Century.</span></p><p class=\"\"><span> </span><strong class=\"root-Tkn6WL2y\"><span>If you expect aluminum at $2,700+/tonne and want the best combination of operational leverage, integration, and balance sheet quality: </span></strong><span>own Alcoa.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:7a3aef2a7094b:0-the-aluminum-supercycle-s-pure-play-why-alcoa-s-operational-transformation-deserves-attention/",
            "pub_date": "2026-02-27 18:44:31",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2946050:0",
            "title": "VK: Strong 2025 financials and strategic moves set up EUR 650 million shareholder returns in 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Delivered strong 2025 results with EUR 819 million EBITDA and robust cash generation, enabling EUR 650 million in shareholder returns for 2026. Strategic investments and partnerships position the group for growth in premium energy markets, especially geothermal.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2946050:0-vk-strong-2025-financials-and-strategic-moves-set-up-eur-650-million-shareholder-returns-in-2026/",
            "pub_date": "2026-02-27 18:44:47",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM17A:0",
            "title": "Dancing robots bring support, company to Barcelona elderly",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>City deploys 600 robots for elderly support</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Robots can play games, make calls, remind users of appointments</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>City hopes robots will soon alert social workers to emergencies</span></li></ul></span></div><span><p class=\"\"><span>By Alba Ferrer and Victoria Waldersee</span></p><p class=\"\"><span>        Barcelona resident Irene Veglison had not danced for more than two decades until a robot moved into her home three months ago.  </span></p><p class=\"\"><span>    The 67-year-old received the 1.35-metre-tall device in November as part of a government project to support people in the early stages of cognitive decline.  </span></p><p class=\"\"><span>\"We're developing this pilot project to improve tele-assistance,\" said Marta Villanueva Cendán, a councillor for Barcelona's municipal council. </span></p><p class=\"\"><span>Like many countries, Spain faces rising life expectancy and falling birth rates, increasing pressure on its care sector to support an ageing population.</span></p><p class=\"\"><span>\"In the future, we want the robots to detect risk and alert professionals, like if the person has fallen and cannot respond,\" the councillor added. </span></p><p class=\"\"><span>    Barcelona has deployed 600 such bots to private homes and care centres, under a programme backed by a 3.8 million euro ($4.47 million) grant from the European Union's     COVID recovery funds    .  </span></p><p class=\"\"><span>The devices are built by U.S.-based Misty Robotics and distributed in Europe by Catalan firm Grup Saltó.</span></p><p class=\"\"><span>Veglison, who lives with her two cats, has named her bot Sandi. </span></p><p class=\"\"><span>    It reminds her to take her medication at 9 a.m., tells her when her doctor appointments are, wakes her up in the morning and bids her goodnight at the end of each day.  </span></p><p class=\"\"><span>    Nearly 2 million people over 65 live alone in Spain, three-quarters of them women, according to official data.   </span></p><p class=\"\"><span>    Studies estimate the country will need to double its long-term care workforce by 2030. Yet, pay about 10,000 euros below the national average has deterred younger workers and more than half of current staff are over 45, according to think-tank Funcas.  </span></p><p class=\"\"><span>In an emergency, Veglison can call a social worker through the device, which has a camera that can be activated remotely to assess the situation and offer help.</span></p><p class=\"\"><span>    Scrolling through YouTube on its built-in screen, she selected a French chanson and swayed with Sandi as the screen tilted back and forth with her movements.  </span></p><p class=\"\"><span>The devices are fitted with screens offering entertainment apps, a calendar, maps, and a selection of cartoon-like faces to set when it is on standby, with expressions like \"surprised\", \"loving\" or \"asleep\".</span></p><p class=\"\"><span>\"It's not just a trinket: there are lots of people behind it who are looking out for you, checking whether you've fallen down, whether you're okay,\" Veglison said. </span></p><p class=\"\"><span>($1 = 0.8492 euros)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM17A:0-dancing-robots-bring-support-company-to-barcelona-elderly/",
            "pub_date": "2026-02-27 18:44:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN0RQ:0",
            "title": "Panoro Energy seeks new Equatorial assets after buying Kosmos stake",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Panoro to bid in Equatorial Guinea's new auction round</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Largest Block G shareholder after buying Kosmos stake</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Aiming to triple total oil production by 2030</span></li></ul></span></div><span><p class=\"\"><span>By Wendell Roelf</span></p><p class=\"\"><span>    Africa-focused Panoro Energy </span><span> will take part in Equatorial Guinea's oil and gas auction in April as it hunts for new assets after increasing its stake in the country's offshore Block G, its executive chairman said on Friday.</span></p><p class=\"\"><span>Panoro this week acquired an additional 40.3% interest in Block G from Kosmos Energy </span><span>, making it the largest shareholder in the block, which is operated by Trident Energy.</span></p><p class=\"\"><span>Block G contains the Ceiba field and the Okume complex, both linked to a single floating production storage and offloading unit for export.</span></p><p class=\"\"><span>\"We will definitely have a look on some of those blocks in the auction because we think some of them have very exciting potential,\" Julien Balkany said in a telephone interview.</span></p><p class=\"\"><span>An OPEC member, Equatorial Guinea is seeking to reverse years of stagnant crude output and position itself as a regional gas hub. </span></p><p class=\"\"><span>U.S. oil major Chevron </span><span> recently committed to developing gas projects in the Central African nation, while ConocoPhillips </span><span> is also active there.</span></p><p class=\"\"><span>Beyond Block G, Panoro wants to fast-track development of its EG-23 block, where it is the operator, given its proximity to the Alba oil and gas complex.</span></p><p class=\"\"><span>\"We clearly see EG-23 with the Estrella discovery as being one of the rough diamonds in our portfolio,\" Balkany said.</span></p><p class=\"\"><span>With producing assets in Gabon, Tunisia and Equatorial Guinea, the company is aiming to triple production to more than 30,000 barrels of oil per day by 2030.</span></p><p class=\"\"><span>In Gabon, Panoro and its partners will drill four production wells this year at the Mabomo platform in its offshore Dussafu Marin permit.</span></p><p class=\"\"><span>\"Later this year we will take a decision on the development plan and final investment decision for the exciting Bourdon discovery also in Dussafu,\" Balkany said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN0RQ:0-panoro-energy-seeks-new-equatorial-assets-after-buying-kosmos-stake/",
            "pub_date": "2026-02-27 18:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:edbd07053094b:0",
            "title": "Bitcoin’s Price Drops Below $67K – XRP, Ethereum Lead Losses",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bitcoin (BTC) dropped below $67,000 on Friday morning, with the apex cryptocurrency poised to close February in the red and on track for an unusual back-to-back monthly decline following January losses.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/bitcoin\" rel=\"nofollow\" target=\"_blank\">Bitcoin’s price</a><span> fell 2.3% in the last 24 hours to around $66,800 after the cryptocurrency had climbed back to over $68,000 earlier in the day. On Stocktwits, retail sentiment around the cryptocurrency came down to ‘neutral’ from the ‘bullish’ zone over the past day.</span></p><p class=\"\"><span>According to analyst Ted Pillows, Bitcoin just lost critical support. According to his post on X, if Bitcoin's price had remained above $67,000, then BTC could have rallied to over $72,000.</span></p><p class=\"\"><span>The overall cryptocurrency market slipped back below the $2.4 trillion mark to around $2.38 trillion, down 1.9% in the last 24 hours. Ripple’s XRP (XRP) and Ethereum (ETH) led losses, down more than 3.5% each. Dogecoin (DOGE) dropped more than 3% in the last 24 hours, Solana (SOL) fell 2.8%, and Cardano (ADA) was down 2.3%. </span></p><p class=\"\"><span>Tron (TRX) and Binance Coin (BNB) outperformed Bitcoin, but still saw losses of 0.5% and 1.2%, respectively.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Get updates to this developing story directly on Stocktwits.</span></strong></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:edbd07053094b:0/",
            "pub_date": "2026-02-27 18:45:07",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2946046:0",
            "title": "OHLA: 2025 saw record backlog, higher profitability, and lower leverage, setting up strong 2026 prospects",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strategic objectives were met in 2025 with improved profitability, reduced leverage, and a record order backlog. Cost reduction, favorable litigation, and ESG leadership support a positive outlook for 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2946046-23748c1ef87859366f0a15b8b862f404\" target=\"_blank\">Obrascon Huarte Lain SA [OHLA] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2946046:0-ohla-2025-saw-record-backlog-higher-profitability-and-lower-leverage-setting-up-strong-2026-prospects/",
            "pub_date": "2026-02-27 18:45:18",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7454Ua:0",
            "title": "REG - BkofA Merrill Lynch Schroders PLC - Form 8.5 (EPT/NON-RI)-Schroders plc",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7454U  Bank of America Merrill Lynch  27 February 2026   </span><p class=\"\"><span>FORM 8.5 (EPT/NON-RI)</span></p><p class=\"\"><span>PUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY AN</span></p><p class=\"\"><span>EXEMPT PRINCIPAL TRADER WITHOUT RECOGNISED INTERMEDIARY (\"RI\") STATUS</span></p><p class=\"\"><span>(OR WHERE RI STATUS IS NOT APPLICABLE)</span></p><p class=\"\"><span> Rule 8.5 of the Takeover Code (the \"Code\")</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>1.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KEY INFORMATION</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(a)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Name of exempt principal trader:</span></p></li></ul></td><td><p class=\"\"><span>BofA Securities Europe SA</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(b)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Name of offeror/offeree in relation to whose</span></p><p class=\"\"><span>relevant securities this form relates:</span></p><p class=\"\"><span> Use a separate form for each offeror/offeree</span></p></li></ul></td><td><p class=\"\"><span>SCHRODERS PLC</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(c)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Name of the party to the offer with which exempt principal trader is connected:</span></p></li></ul></td><td><p class=\"\"><span>Pantheon, LLC</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(d)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Date position held/dealing undertaken:</span></p><p class=\"\"><span> For an opening position disclosure, state the latest</span></p><p class=\"\"><span>practicable date prior to the disclosure</span></p></li></ul></td><td><p class=\"\"><span>26/02/2026</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(e)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In addition to the company in 1(b) above, is the</span></p><p class=\"\"><span>exempt principal trader making disclosures in</span></p><p class=\"\"><span>respect of any other party to the offer?</span></p><p class=\"\"><span> If it is a cash offer or possible cash offer, state \"N/A\"</span></p></li></ul></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>2.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>POSITIONS OF THE EXEMPT PRINCIPAL TRADER</span></p></li></ul><p class=\"\"><span>If there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(a)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security:</span></p></td><td colspan=\"4\"><p class=\"\"><span>20p ordinary</span></p></td></tr><tr><td rowspan=\"2\"></td><td colspan=\"2\"><p class=\"\"><span>Interests</span></p></td><td colspan=\"2\"><p class=\"\"><span>Short Positions</span></p></td></tr><tr><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(1)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Relevant securities owned</span></p><p class=\"\"><span>and/or controlled:</span></p></li></ul></td><td><p class=\"\"><span>130,820</span></p></td><td><p class=\"\"><span>0.008%</span></p></td><td><p class=\"\"><span>30,871</span></p></td><td><p class=\"\"><span>0.002 %</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(2)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Cash-settled derivatives:</span></p></li></ul></td><td><p class=\"\"><span>30,473</span></p></td><td><p class=\"\"><span>0.002%</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>0%</span></p></td></tr><tr><td><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(3)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Stock-settled derivatives</span></p><p class=\"\"><span>(including options) and</span></p><p class=\"\"><span>agreements to purchase/sell:</span></p></li></ul></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>0%</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>0 %</span></p></td></tr><tr><td><p class=\"\"><span>TOTAL:</span></p></td><td><p class=\"\"><span>161,293</span></p></td><td><p class=\"\"><span>0.010%</span></p></td><td><p class=\"\"><span>30,871</span></p></td><td><p class=\"\"><span>0.002%</span></p></td></tr></tbody></table></div><p class=\"\"><span>All interests and all short positions should be disclosed.</span></p><p class=\"\"><span>Details of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(b)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Rights to subscribe for new securities (including directors' and other employee options)</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security in relation to </span></p><p class=\"\"><span>which subscription right exists:</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Details, including nature of the rights </span></p><p class=\"\"><span>concerned and relevant percentages:</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>3.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DEALINGS (IF ANY) BY THE EXEMPT PRINCIPAL TRADER</span></p></li></ul><p class=\"\"><span>Where there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.</span></p><p class=\"\"><span>The currency of all prices and other monetary amounts should be stated.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(a)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Purchases and sales</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>Purchases/</span></p><p class=\"\"><span>sales</span></p></td><td><p class=\"\"><span>Total number of securities</span></p></td><td><p class=\"\"><span>Highest price </span></p><p class=\"\"><span>per unit</span></p><p class=\"\"><span>paid/received</span></p></td><td><p class=\"\"><span>Lowest price </span></p><p class=\"\"><span>per unit</span></p><p class=\"\"><span>paid/received</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Purchase</span></p></td><td><p class=\"\"><span>7,225</span></p></td><td><p class=\"\"><span>5.859660 GBP</span></p></td><td><p class=\"\"><span>5.859660 GBP</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>Sale</span></p></td><td><p class=\"\"><span>7,225</span></p></td><td><p class=\"\"><span>5.861962 GBP        </span></p></td><td><p class=\"\"><span>5.855000 GBP</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(b)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Cash-settled derivative transactions</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of </span></p><p class=\"\"><span>relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. CFD</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. opening/closing a </span></p><p class=\"\"><span>long/short position, increasing/reducing a</span></p><p class=\"\"><span>long/short position</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Number of reference securities</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Price per unit</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(c)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Stock-settled derivative transactions (including options)</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(i)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Writing, selling, purchasing or varying</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class </span></p><p class=\"\"><span>of</span></p><p class=\"\"><span>relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Product description e.g. call option</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Writing, purchasing, selling, varying etc.</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Number </span></p><p class=\"\"><span>of</span></p><p class=\"\"><span>securities to which option relates</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Exercise </span></p><p class=\"\"><span>price</span></p><p class=\"\"><span>per unit</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Type</span></p><p class=\"\"><span>e.g. American, European etc.</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Expiry date</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Option money paid/ received per unit</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(ii)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. call option</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Exercising/</span></p><p class=\"\"><span>exercised</span></p><p class=\"\"><span>against</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Number of </span></p><p class=\"\"><span>securities</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Exercise Price per </span></p><p class=\"\"><span>unit</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(d)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Other dealings (including subscribing for new securities)</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. subscription, conversion</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Details</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Price per unit (if applicable)</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>4.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OTHER INFORMATION</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(a)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Indemnity and other dealing arrangements</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the exempt principal trader making the disclosure and any party to the offer or any person acting in concert with a party to the offer: </span></p><p class=\"\"><span> Irrevocable commitments and letters of intent should not be included. If there are no such</span></p><p class=\"\"><span>agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(b)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Agreements, arrangements or understandings relating to options or derivatives</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any agreement, arrangement or understanding, formal or informal, between the exempt principal trader making the disclosure and any other person relating to: </span></p><p class=\"\"><span>(i) the voting rights of any relevant securities under any option; or</span></p><p class=\"\"><span>(ii) The voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:</span></p><p class=\"\"><span> If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>(c)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Attachments</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Is a Supplemental Form 8 (Open Positions) attached?</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>No</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Date of disclosure:</span></p></td><td><p class=\"\"><span>27/02/2026</span></p></td></tr><tr><td><p class=\"\"><span>Contact name:</span></p></td><td><p class=\"\"><span>Kamil Dziedzic</span></p></td></tr><tr><td><p class=\"\"><span>Telephone number:</span></p></td><td><p class=\"\"><span>+353 86 168 4821</span></p></td></tr></tbody></table></div><p class=\"\"><span>Public disclosures under Rule 8 of the Code must be made to a Regulatory Information</span></p><p class=\"\"><span>Service.</span></p><p class=\"\"><span>The Panel's Market Surveillance Unit is available for consultation in relation to the Code's disclosure requirements on +44 (0)20 7638 0129.</span></p><p class=\"\"><span>The Code can be viewed on the Panel's website at www.thetakeoverpanel.org.uk.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  FEOFLFSIFEIDFIR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7454Ua:0-reg-bkofa-merrill-lynch-schroders-plc-form-8-5-ept-non-ri-schroders-plc/",
            "pub_date": "2026-02-27 18:45:45",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN0XD:0",
            "title": "Indonesia tightens rules for Airbnb-style rentals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The Indonesian government has tightened regulations for short-term rental properties including those listed on digital platform Airbnb </span><span> by mandating that they possess business permits, the country's tourism minister said on Friday. </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>All accommodations listed on online travel agencies must have necessary business licenses by March 31, Minister Widiyanti Putri Wardhana said on her Instagram account.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The government expects all operators to start processing the required permits, Widiyanti said.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The new regulation came after the governor of Indonesian resort island of Bali proposed to halt all short-term rentals including those listed on Airbnb, as the provincial government was losing regional tax revenue.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Widiyanti said the move seeks to ensure Indonesia's tourism sector keeps growing, to prevent tax evasion, and to provide a fair environment for all business operators in the tourism sector.</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN0XD:0-indonesia-tightens-rules-for-airbnb-style-rentals/",
            "pub_date": "2026-02-27 18:45:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7428Ua:0",
            "title": "REG - Portmeirion Group - Holding(s) in Company",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7428U  Portmeirion Group PLC  27 February 2026   </span><p class=\"\"><span>TR-1: Standard form for notification of major holdings</span></p><p class=\"\"><span>1. Issuer Details</span></p><p class=\"\"><span>ISIN</span></p><p class=\"\"><span>GB0006957293</span></p><p class=\"\"><span>Issuer Name</span></p><p class=\"\"><span>PORTMEIRION GROUP PUBLIC LIMITED COMPANY</span></p><p class=\"\"><span>UK or Non-UK Issuer</span></p><p class=\"\"><span>UK</span></p><p class=\"\"><span>2. Reason for Notification</span></p><p class=\"\"><span>An acquisition or disposal of voting rights</span></p><p class=\"\"><span>3. Details of person subject to the notification obligation</span></p><p class=\"\"><span>Name</span></p><p class=\"\"><span>Peter Gyllenhammar AB</span></p><p class=\"\"><span>City of registered office (if applicable)</span></p><p class=\"\"><span>Stockholm</span></p><p class=\"\"><span>Country of registered office (if applicable)</span></p><p class=\"\"><span>Sweden</span></p><p class=\"\"><span>4. Details of the shareholder</span></p><p class=\"\"><span>Full name of shareholder(s) if different from the person(s) subject to the notification obligation, above</span></p><p class=\"\"><span>City of registered office (if applicable)</span></p><p class=\"\"><span>Country of registered office (if applicable)</span></p><p class=\"\"><span>5. Date on which the threshold was crossed or reached</span></p><p class=\"\"><span>25-Feb-2026</span></p><p class=\"\"><span>6. Date on which Issuer notified</span></p><p class=\"\"><span>27-Feb-2026</span></p><p class=\"\"><span>7. Total positions of person(s) subject to the notification obligation</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>% of voting rights attached to shares (total of 8.A)</span></p></td><td><p class=\"\"><span>% of voting rights through financial instruments (total of 8.B 1 + 8.B 2)</span></p></td><td><p class=\"\"><span>Total of both in % (8.A + 8.B)</span></p></td><td><p class=\"\"><span>Total number of voting rights held in issuer</span></p></td></tr><tr><td><p class=\"\"><span>Resulting situation on the date on which threshold was crossed or reached</span></p></td><td><p class=\"\"><span>12.324000</span></p></td><td><p class=\"\"><span>0.000000</span></p></td><td><p class=\"\"><span>12.324000</span></p></td><td><p class=\"\"><span>1728000</span></p></td></tr><tr><td><p class=\"\"><span>Position of previous notification (if applicable)</span></p></td><td><p class=\"\"><span>11.290000</span></p></td><td><p class=\"\"><span>0.000000</span></p></td><td><p class=\"\"><span>11.290000</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>8. Notified details of the resulting situation on the date on which the threshold was crossed or reached</span></p><p class=\"\"><span>8A. Voting rights attached to shares</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class/Type of shares ISIN code(if possible)</span></p></td><td><p class=\"\"><span>Number of direct voting rights (DTR5.1)</span></p></td><td><p class=\"\"><span>Number of indirect voting rights (DTR5.2.1)</span></p></td><td><p class=\"\"><span>% of direct voting rights (DTR5.1)</span></p></td><td><p class=\"\"><span>% of indirect voting rights (DTR5.2.1)</span></p></td></tr><tr><td><p class=\"\"><span>GB0006957293</span></p></td><td><p class=\"\"><span>1728000</span></p></td><td><p class=\"\"><span>0</span></p></td><td><p class=\"\"><span>12.324000</span></p></td><td><p class=\"\"><span>0.000000</span></p></td></tr><tr><td><p class=\"\"><span>Sub Total 8.A</span></p></td><td colspan=\"2\"><p class=\"\"><span>1728000</span></p></td><td colspan=\"2\"><p class=\"\"><span>12.324000%</span></p></td></tr></tbody></table></div><p class=\"\"><span>8B1. Financial Instruments according to (DTR5.3.1R.(1) (a))</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Type of financial instrument</span></p></td><td><p class=\"\"><span>Sub Total 8.B1</span></p></td></tr><tr><td><p class=\"\"><span>Expiration date</span></p></td><td colspan=\"2\"></td></tr><tr><td><p class=\"\"><span>Exercise/conversion period</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Number of voting rights that may be acquired if the instrument is exercised/converted</span></p></td><td></td></tr><tr><td><p class=\"\"><span>% of voting rights</span></p></td></tr></tbody></table></div><p class=\"\"><span>8B2. Financial Instruments with similar economic effect according to (DTR5.3.1R.(1) (b))</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Type of financial instrument</span></p></td><td><p class=\"\"><span>Sub Total 8.B2</span></p></td></tr><tr><td><p class=\"\"><span>Expiration date</span></p></td><td colspan=\"3\"></td></tr><tr><td><p class=\"\"><span>Exercise/conversion period</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Physical or cash settlement</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Number of voting rights</span></p></td></tr><tr><td><p class=\"\"><span>% of voting rights</span></p></td></tr></tbody></table></div><p class=\"\"><span>9. Information in relation to the person subject to the notification obligation</span></p><p class=\"\"><span>2. Full chain of controlled undertakings through which the voting rights and/or the financial instruments are effectively held starting with the ultimate controlling natural person or legal entities (please add additional rows as necessary)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Ultimate controlling person</span></p></td><td><p class=\"\"><span>Name of controlled undertaking</span></p></td><td><p class=\"\"><span>% of voting rights if it equals or is higher than the notifiable threshold</span></p></td><td><p class=\"\"><span>% of voting rights through financial instruments if it equals or is higher than the notifiable threshold</span></p></td><td><p class=\"\"><span>Total of both if it equals or is higher than the notifiable threshold</span></p></td></tr><tr><td><p class=\"\"><span>Mr. Peter Gyllenhammar</span></p></td><td><p class=\"\"><span>Peter Gyllenhammar AB</span></p></td><td><p class=\"\"><span>0.000000</span></p></td><td><p class=\"\"><span>0.000000</span></p></td><td><p class=\"\"><span>0.000000%</span></p></td></tr><tr><td><p class=\"\"><span>Mr. Peter Gyllenhammar</span></p></td><td><p class=\"\"><span>Bronsstädet AB</span></p></td><td><p class=\"\"><span>12.324000</span></p></td><td><p class=\"\"><span>0.000000</span></p></td><td><p class=\"\"><span>12.324000%</span></p></td></tr></tbody></table></div><p class=\"\"><span>10. In case of proxy voting</span></p><p class=\"\"><span>Name of the proxy holder</span></p><p class=\"\"><span>The number and % of voting rights held</span></p><p class=\"\"><span>The date until which the voting rights will be held</span></p><p class=\"\"><span>11. Additional Information</span></p><p class=\"\"><span>12. Date of Completion</span></p><p class=\"\"><span>2026-02-27</span></p><p class=\"\"><span>13. Place Of Completion</span></p><p class=\"\"><span>Stockholm, Sweden</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  HOLPPUQWPUPQGUM</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7428Ua:0-reg-portmeirion-group-holding-s-in-company/",
            "pub_date": "2026-02-27 18:37:31",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003444:0",
            "title": "OPEC+ Expected to Resume Output Hikes at Sunday Meeting",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Giulia Petroni</span></p><p class=\"\"><span>The Organization of the Petroleum Exporting Countries and its allies meet Sunday with a familiar dilemma: add barrels to the market or continue holding back against a fragile geopolitical backdrop.</span></p><p class=\"\"><span>OPEC+, the alliance led by Saudi Arabia and Russia, decided to keep output steady in the first quarter after a series of production increases last year. Analysts say the group is now expected to resume hikes, starting with a modest increase of 137,000 barrels a day.</span></p><p class=\"\"><span>An output boost would signal the alliance is restarting the gradual rollback of voluntary cuts of around 1.65 million barrels a day originally set to remain in place through the end of 2026.</span></p><p class=\"\"><span>Some analysts expect the remaining curbs to be unwound within six months, while others see the process stretching to year-end. Many warn, however, that only about half of any quota increase typically translates into actual output, as some members face capacity constraints.</span></p><p class=\"\"><span>OPEC didn't respond to a request for comment.</span></p><p class=\"\"><span>\"The oil market should be able to absorb further barrels,\" said Giovanni Staunovo, strategist at UBS. The ICE Brent forward curve remains in backwardation--meaning near-term oil prices are higher than future prices--suggesting the market is tight in the short term.</span></p><p class=\"\"><span>Goldman Sachs sees OPEC+ positioned to raise production modestly from April to June after a series of supply disruptions earlier this year, particularly in Kazakhstan, and due to lower-than-expected inventories in OECD countries.</span></p><p class=\"\"><span>Much of the anticipated surplus remains outside major pricing hubs, with Russian, Iranian, and Venezuelan barrels accumulating on tankers at sea. Meanwhile, geopolitical concerns are keeping front-month prices supported.</span></p><p class=\"\"><span>In midmorning European trading Friday, Brent traded around $71 a barrel, while WTI was above $65 a barrel. A February survey of major Wall Street banks compiled by The Wall Street Journal showed Brent crude is expected to average at around $61 a barrel, with West Texas Intermediate at $58 in the second quarter--above previous projections by around $1, but still below 2025 levels.</span></p><p class=\"\"><span>The resumption of output hikes would come as markets closely monitor developments in the Middle East, wary that any escalation between the U.S. and Iran could disrupt energy flows in the oil-rich region. The two countries are expected to resume discussions next week after the latest round of talks wrapped up on Thursday without a deal.</span></p><p class=\"\"><span>\"Any escalation of conflict is likely to see OPEC step in to calm the market,\" said Daniel Hynes and Soni Kumari, commodity analysts at ANZ Research. If disruptions occur, OPEC+ is expected to tap spare capacity--with most of it sitting in Saudi Arabia and the United Arab Emirates.</span></p><p class=\"\"><span>Write to Giulia Petroni at giulia.petroni@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003444:0-opec-expected-to-resume-output-hikes-at-sunday-meeting/",
            "pub_date": "2026-02-27 18:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003424_20260227003447:0",
            "title": "India Statistics Ministry: Economic Performance in FY 2025-26 Primarily Due to Robust Growth in 2Q, 3Q",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003424_20260227003447:0/",
            "pub_date": "2026-02-27 18:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227003424_20260227003454:0",
            "title": "India Statistics Ministry: Manufacturing Has Been Major Driver of Economy's Resilience in 3 Financial Years After Rebasing",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227003424_20260227003454:0/",
            "pub_date": "2026-02-27 18:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}