{
    "data": [
        {
            "id": "DJN_DN20250203012253:0",
            "title": "OpenAI to Jointly Develop AI Products With South Korean Tech Giant Kakao",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao</p><p class=\"\">ChatGPT creator OpenAI and South Korean mobile internet giant Kakao plan to jointly develop artificial-intelligence products for the local market.</p><p class=\"\">The companies said Tuesday that they plan to form a strategic partnership, under which Kakao will integrate OpenAI's technology for its products and services, including its widely used messaging app Kakao Talk, tailored to local users.</p><p class=\"\">Kakao said it will also deploy ChatGPT Enterprise, the version of ChatGPT aimed at large companies for business use, for its employees, and use OpenAI models to power its AI communication service Kanana, which Kakao describes as a \"user-friendly AI mate that delivers personalized, context-aware responses.\"</p><p class=\"\">\"We're excited to bring advanced AI to Kakao's millions of users and work together to integrate our technology into services that transform how Kakao's users communicate and connect,\" OpenAI Chief Executive Sam Altman said in a statement.</p><p class=\"\">Kakao CEO Chung Shin-a said the collaboration will help the South Korean company advance its AI efforts.</p><p class=\"\">The announcement was made at a joint press conference in Seoul on the back of Altman's visit to the country. Local media outlet Yonhap News Agency reported that he has met with SK Group Chairman Chey Tae-won, who was accompanied by SK Hynix CEO Kwak Noh-jung, to discuss possible collaborations in AI.</p><p class=\"\">Write to Kimberley Kao at kimberley.kao@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012253:0-openai-to-jointly-develop-ai-products-with-south-korean-tech-giant-kakao/",
            "pub_date": "2025-02-04 12:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463157:0",
            "title": "PointsBet Lowers Fiscal Year 2025 Guidance on Weaker Results in Australia and Canada, Jarden Research Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PointsBet Holdings  has downgraded its full fiscal year revenue and earnings before interest, taxes, depreciation, and amortization (EBITDA) guidance after weaker-than-expected results in Australia and Canada, falling short of analyst forecasts, according to a Jan. 31 note by Jarden Research. </p><p class=\"\">The company now expects full fiscal year EBITDA of AU$11 million to AU$14 million from the previous AU$11 million to AU$16 million, while revenue is forecasted to be between AU$260 million to AU$270 million, reduced from AU$280 million to AU$290 million, Jarden said. </p><p class=\"\">The company reported fiscal-first half Australian turnover of AU$1.15 billion, down 23% year-on-year and below the analyst's estimate of $1.5 billion, driven by a shift from lower-margin clients, Jarden added. </p><p class=\"\">PointsBet's fiscal first-half net win for Australia was AU$117 million, up 4% year-on-year but below the AU$133 million estimate, the broker noted. </p><p class=\"\">Meanwhile, performance in Canada also missed expectations. PointsBet's net win in Canada was AU$18.1 million, missing the AU$24.9 million estimate by 27%, due to unfavorable NFL and iGaming results. </p><p class=\"\">Despite setbacks, the gaming firm reported a modest AU$500,000 operating cash inflow for the fiscal first half ended Dec. 30, beating Jarden's AU$600,000 outflow, and expects positive net cash flows in the second half of the fiscal year. </p><p class=\"\">Jarden Research has a buy rating and AU$1 price target on PointsBet Holdings. </p><p class=\"\">Shares of the company fell 2% in recent Tuesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463157:0/",
            "pub_date": "2025-02-04 12:51:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463176:0",
            "title": "Hibiscus Petroleum Repurchases Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hibiscus Petroleum  bought back 200,000 shares for 369,010 ringgit on Monday, according to a same-day Malaysian bourse disclosure. </p><p class=\"\">The shares were repurchased at a price between 1.83 ringgits and 1.87 ringgits apiece, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463176:0/",
            "pub_date": "2025-02-04 12:52:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0BO:0",
            "title": "India's Power Grid Corp drops after Q3 profit misses estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Power Grid Corporation of India  slides as much as 4.1% to 272.1 rupees, its lowest in near 10 months</p><p class=\"\">** Stock among top five losers on benchmark Nifty 50 index , which is up 0.7% </p><p class=\"\">** State-run energy transmission firm reported Q3 profit below estimates, hurt by sluggish power demand</p><p class=\"\">** PGRD is the only stock trading in red on the Nifty PSE index (.NIFTYPSE), which is trading up 1.8% </p><p class=\"\">** PGRD rated \"Buy\" on avg, same as peer NTPC , while Tata Power , Torrent Power  rated \"Hold\" - LSEG data</p><p class=\"\">** PGRD last down 1.2% </p><p class=\"\">** YTD, PGRD, NTPC, TTPW down ~9%, ~6%, ~8% and ~9% </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0BO:0-india-s-power-grid-corp-drops-after-q3-profit-misses-estimates/",
            "pub_date": "2025-02-04 12:53:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463180:0",
            "title": "Yinson Repurchases Shares Worth About MYR4 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Yinson  bought back 1,645,100 shares for around 3.9 million ringgit, according to a Monday disclosure with Bursa Malaysia. </p><p class=\"\">The shares were repurchased at between 2.330 ringgit and 2.360 ringgit apiece, the energy infrastructure and technology company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463180:0/",
            "pub_date": "2025-02-04 12:53:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463165:0",
            "title": "Sarytogan Graphite Identifies Copper Anomalies at Kazakhstan Project; Shares Rise 3%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sarytogan Graphite  said an exploration review at the Baynazar copper exploration project in Kazakhstan identified three new anomalies at the Aminbay target, according to a Tuesday Australian bourse filing. </p><p class=\"\">The company identified metal zonation and aeromagnetic features consistent with the possible presence of porphyry, the filing said. The review also confirmed previous results at the Ilken target. </p><p class=\"\">Soil sampling will be infilled across the anomalies identified and extended ahead of planning drilling at these targets, according to the firm's managing director, Sean Gregory. </p><p class=\"\">The firm's shares rose past 3% in recent trading on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463165:0/",
            "pub_date": "2025-02-04 12:55:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:260191000094b:0",
            "title": "Hong Kong’s SFC proposes expanding crypto regulatory staff in new fiscal budget",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong’s securities watchdog has proposed adding headcounts for cryptocurrency-specific staff as the region continues its drive to become a crypto hub.</p><p class=\"\">In a budget plan for the financial year 2025 to 2026, the Securities and Futures Commission proposed 15 new headcounts, with eight dedicated to “enhancing the staffing support for virtual asset regulatory regimes, market surveillance, and enforcement investigations.”</p><p class=\"\">The SFC presented the budget on Monday at a Legislative Council meeting. The regulator estimated that its recurrent expenditure for the next fiscal year—starting April 1, 2025—would be HK$2.59 billion ($332.4 million), an increase of 7.2% from the forecast expenditure for 2024-25.</p><p class=\"\">Much of the budget increase stems from a rise in staff costs by HK$130.5 million ($16.7 million), which includes an average salary hike of about 2.1%. The SFC noted that it froze its headcount in three out of the five financial years since 2020-21.</p><p class=\"\">The SFC pointed out in a separate document on Monday that it has deployed staff with experience in licensing and supervision to cope with crypto-related regulatory work. However, it could only conduct on-site inspections of some 200 licensed corporations in 2023, which “fell short of the target of 300.” </p><p class=\"\">Hong Kong has opened its doors to crypto firms. In June 2023, it officially launched a crypto licensing regime for “virtual asset trading platforms” (VATPs), allowing licensed exchanges to offer retail trading services. The government’s proposed stablecoin bill is also progressing through the Legislative Council.</p><p class=\"\">In December, the SFC said it has worked to speed up the VATP licensing process. “We have been proactively engaging with VATPs’ senior management and ultimate controllers, which helps drive home our expected regulatory standards and expedite our licensing process for VATPs,” Eric Yip, the SFC’s Executive Director of Intermediaries, said in a December statement.</p><p class=\"\">Last month, the SFC approved licenses for two additional crypto trading platforms — PantherTrade and YAX, according to the regulator’s website. This brought the total number of licensed platforms to nine, including OSL and HashKey.</p><p class=\"\">Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</p><p class=\"\">© 2024 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p></span></div>",
            "link": "https://www.tradingview.com/news/the_block:260191000094b:0-hong-kong-s-sfc-proposes-expanding-crypto-regulatory-staff-in-new-fiscal-budget/",
            "pub_date": "2025-02-04 12:45:59",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463168:0",
            "title": "Market Chatter: China's Currency May Further Weaken Amid Trade Tensions With US",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Analysts believe the China's renminbi may further weaken if US President Donald Trump's new tariffs become effective, Bloomberg reported Tuesday. </p><p class=\"\">Economists at Australia &amp; New Zealand Banking Group, along with those at Malayan Banking, said People's Bank of China may set the currency's fixing at 7.2 yuan per dollar. Goldman Sachs Group forecasted a 7.3 yuan per dollar fixing, the report said. </p><p class=\"\">The renminbi reached its lowest since October 2022 to as much as 0.7% to 7.3734 yuan per dollar on Monday after Trump announced a 10% duty on China, which is lower than the 60% levy previously planned, the media outlet said. </p><p class=\"\">China's central bank may announce its fixing limit plans on Wednesday when the mainland's markets resume after the Chinese New Year holiday, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463168:0/",
            "pub_date": "2025-02-04 12:46:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012248:0",
            "title": "LIC Housing Finance Likely to Continue Delivering Healthy Asset Quality — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LIC Housing Finance is likely to continue delivering healthy asset quality, Nomura analysts say in a research report. Its gross and net non-performing assets dropped by 152 bps and 32 bps, respectively, in 3Q FY 2025, and it posted a credit cost of negative 0.1% driven by provision write-backs, the analysts note. Thanks to further resolutions of such assets, the Indian housing finance company's credit costs are expected to remain contained at around 35 bps over FY 2026-2027, the analysts estimate. Nomura raises the stock's target price to INR 735.00 from INR 700.00, maintaining an unchanged buy rating. Shares are 2.3% higher at INR 570.70. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012248:0/",
            "pub_date": "2025-02-04 12:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463172:0",
            "title": "HSBC Buys Back Another 3.4 Million Shares in Hong Kong",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HSBC Holdings  bought back 3,397,000 shares in Hong Kong on Monday at a weighted average price of HK$79.85 per share, according to a Tuesday filing with the Hong Kong Stock Exchange. </p><p class=\"\">Since the current buy-back program has started, the British lender has repurchased 301,116,739 shares for about $2.84 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463172:0/",
            "pub_date": "2025-02-04 12:48:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463170:0",
            "title": "Vinci Consortium Wins EUR183 Million River Access Contract in France",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A Vinci  consortium won a contract worth 183 million euros to build a river link to Port 2000 in Le Havre in Normandy, France. </p><p class=\"\">The project, named La Chatière, will deliver a 1.8-kilometer river channel directly connecting Port 2000 and the Seine river basin, according to a Monday release from the construction, energy and concessions company. The project is scheduled to commence operations in 2027. </p><p class=\"\">Vinci Construction holds a 62% stake in the consortium, while Belgium's Deme holds 38%. Vinci also owns a 12.1% stake in Deme.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463170:0/",
            "pub_date": "2025-02-04 12:49:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463171:0",
            "title": "Mitrajaya Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mitrajaya Holdings  bought back 241,000 shares on Monday for 78,897 ringgit, according to a same-day bourse disclosure. </p><p class=\"\">The shares were purchased at 0.325 ringgit apiece, the Malaysian construction company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463171:0/",
            "pub_date": "2025-02-04 12:49:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463173:0",
            "title": "PMI: Saudi Arabia's Non-oil Private Sector Growth Hits 10-Year High in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Business activity growth in Saudi Arabia's non-oil private sector strengthened significantly in January 2025 due to the fastest increase in total new orders since June 2011 and the strongest year-ahead outlook in 10 months, the Riyad Bank and S&amp;P Global said Tuesday. </p><p class=\"\">The Riyad Bank Saudi Arabia PMI climbed to 60.5 from 58.4 in December 2024, reflecting the highest reading since September 2014.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463173:0/",
            "pub_date": "2025-02-04 12:49:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012251_20250203012251:0",
            "title": "Kasikornbank Target Price Lowered to THB187.00 From THB188.00 by CGS International >KBANK.TH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012251_20250203012251:0/",
            "pub_date": "2025-02-04 12:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0B4:0",
            "title": "Australia's Astute Metals jumps on lithium find at US project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Astute Metals  soars 18.8% to A$0.038, highest since Jan. 20</p><p class=\"\">** Stock rose as much as 21.9% to A$0.039 earlier in the day, marking the biggest intraday gain since Jan. 20</p><p class=\"\">** Diversified explorer says it has identified new zone of lithium bearing clay-rich rocks at its Red Mountain Lithium Project in Nevada, USA</p><p class=\"\">** Adds, \"Identification of new high-grade lithium-bearing unit increases project's potential\"</p><p class=\"\">** Around 784,720 shares traded, 2.3x the 30-day avg    </p><p class=\"\">** ASE up 35.7% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0B4:0-australia-s-astute-metals-jumps-on-lithium-find-at-us-project/",
            "pub_date": "2025-02-04 12:50:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463177:0",
            "title": "BH Global Forms New Subsidiary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marine electrical products supplier BH Global  established a wholly-owned subsidiary, namely, Infravision Technology, according to a filing with the Singapore Exchange on Monday. </p><p class=\"\">The new company has an initial issued and paid up capital of SG$100 comprising 100 shares and is involved in the manufacturing and repairing of engineering and scientific instruments.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463177:0/",
            "pub_date": "2025-02-04 12:50:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463178:0",
            "title": "Power Root Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Power Root  on Tuesday bought back 104,200 shares for 152,594 ringgit, according to a same-day bourse disclosure. </p><p class=\"\">The shares were repurchased at between 1.460 ringgit and 1.500 ringgit apiece, the beverage company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463178:0/",
            "pub_date": "2025-02-04 12:50:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0A5:0",
            "title": "India's long-duration bond yields steady as profit booking curbs decline",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Indian government bond yields of longer duration were little changed on Tuesday amid profit booking, while shorter-duration yields dipped in the early session, ahead of a widely expected interest rate cut from the central bank later this week.</p><p class=\"\">The 10-year bond yield (IN067934G=CC) was at 6.6721% as of 10:00 a.m. IST, compared with the previous close of 6.6665%.</p><p class=\"\">\"With hopes of more liquidity injection from the Reserve Bank of India and an almost certain rate cut, the shorter end has started to become more attractive,\" a trader with a private bank said. </p><p class=\"\">Also, heavy offers in longer duration due to profit booking from state-run banks have limited moves in yields, the trader added. </p><p class=\"\">The RBI more than doubled bond purchases in the secondary market, with its net purchases reaching 208.50 billion rupees ($2.40 billion) in the week ended Jan. 24, after buying bonds worth 101.75 billion rupees in the previous week.</p><p class=\"\">It has also bought bonds worth 200 billion rupees in an open market auction as part of its liquidity infusion package. Of the total purchases, one-fourth comprised the benchmark paper.</p><p class=\"\">The RBI conducted a $5.1 billion forex swap last week and will also undertake a 56-day variable rate repo on Feb. 7, followed by additional bond purchases worth 400 billion rupees later this month.</p><p class=\"\">Ashhish Vaidya, managing director and treasurer of global financial markets at DBS Bank India, expects the central bank to purchase bonds worth 2 trillion rupees in the next financial year and does not see any major impact on yields from higher-than-expected gross borrowing in fiscal 2025-26.</p><p class=\"\">A majority of economists are expecting the RBI to announce a 25-basis-point rate cut at its meeting on Feb. 7. </p><p class=\"\">Sandeep Yadav, head of fixed income at DSP Mutual Fund, said the 10-year bond has become attractive, as he anticipates rate cuts and bond purchases to aid this part of the curve. </p><p class=\"\">($1 = 87.0325 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0A5:0-india-s-long-duration-bond-yields-steady-as-profit-booking-curbs-decline/",
            "pub_date": "2025-02-04 12:42:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0BE:0",
            "title": "India's Nahar Spinning Mills jumps on posting Q3 profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Nahar Spinning Mills  jumps 6.4% to 237.6 rupees; set for biggest intraday pct rise in nearly six months</p><p class=\"\">** Cotton yarns maker posts Q3 profit from cont ops of 7.6 mln rupees ($87,360.34) vs year-ago loss of 152.1 mln rupees</p><p class=\"\">** Stock sees most active session since Dec. 19, 2024, with ~79,000 shares traded - 2.6x its 30-day moving avg</p><p class=\"\">** NHRS fell 5.7% in 2024</p><p class=\"\">($1 = 86.9960 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0BE:0-india-s-nahar-spinning-mills-jumps-on-posting-q3-profit/",
            "pub_date": "2025-02-04 12:43:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463169:0",
            "title": "Shuaa Capital Postpones General Assembly",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shuaa Capital (DFM:SHUAA) postponed its general assembly meeting to Feb. 17 due to a lack of quorum, according to a Monday release. </p><p class=\"\">The Dubai-listed financial services company's meeting was initially scheduled for Monday, according to a Jan. 10 filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463169:0/",
            "pub_date": "2025-02-04 12:44:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463161:0",
            "title": "Emyria Reports Reduced Symptoms in Post-Traumatic Stress Disorder Study; Shares Up 3%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Emyria  reported a reduction in the symptoms of patients diagnosed with post-traumatic stress disorder (PTSD) who underwent its therapy program, according to a Tuesday filing with the Australian bourse. </p><p class=\"\">The program showed an average reduction of 29.6 points in PCL-5 scores, which are used in assessing PTSD severity, per the filing. </p><p class=\"\">Additionally, a scale measuring patients' quality of life improved by an average of 23.5 points under the program. </p><p class=\"\">The results are based on an interim analysis of the first eight patients who completed Emyria's MDMA-assisted therapy for PTSD. </p><p class=\"\">Emyria's shares were up nearly 3% in recent Tuesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463161:0/",
            "pub_date": "2025-02-04 12:45:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463164:0",
            "title": "Moody's Withdraws Cenomi Centers' Ratings at Company's Request",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Moody's said Monday it withdrew all of its ratings on Arabian Centres Co. (SASE:4321), d/b/a Cenomi Centers, at the request of the company. </p><p class=\"\">The affected ratings include the B1 long-term corporate family rating of the real estate developer. The rating agency's outlook on the company prior to the withdrawal was negative.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463164:0/",
            "pub_date": "2025-02-04 12:45:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3O506H:0",
            "title": "KKR Raises Tender Offer Price For Fuji Soft To 9,850 Yen From 9,451 Yen, Regulatory Filing Shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">KKR RAISES TENDER OFFER PRICE FOR FUJI SOFT  TO 9,850 YEN FROM 9,451 YEN, REGULATORY FILING SHOWS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">KKR EXTENDS TENDER OFFER PERIOD FOR FUJI SOFT TO FEB 19, REGULATORY FILING SHOWS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3O506H:0-kkr-raises-tender-offer-price-for-fuji-soft-to-9-850-yen-from-9-451-yen-regulatory-filing-shows/",
            "pub_date": "2025-02-04 12:34:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463158:0",
            "title": "Humana Closes EUR25 Million Sale of Elderly Care Units in Finland",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Humana  said Monday it completed the sale of its elderly care units in Finland for 25 million euros. </p><p class=\"\">The transaction covered an operation that caters to 500 clients and employs 430 full-time staff. The Nordic care company said completion followed approval from the Finnish Competition Authority.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463158:0/",
            "pub_date": "2025-02-04 12:35:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012083:0",
            "title": "OpenAI to Jointly Develop AI Products With South Korean Tech Giant Kakao",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao</p><p class=\"\">ChatGPT creator OpenAI and South Korean mobile internet giant Kakao plan to jointly develop artificial-intelligence products for the local market.</p><p class=\"\">The companies said Tuesday that they plan to form a strategic partnership, under which Kakao will integrate OpenAI's technology for its products and services, including its widely used messaging app Kakao Talk, tailored to local users.</p><p class=\"\">Kakao said it will also deploy ChatGPT Enterprise, the version of ChatGPT aimed at large companies for business use, for its employees, and use OpenAI models to power its AI communication service Kanana, which Kakao describes as a \"user-friendly AI mate that delivers personalized, context-aware responses.\"</p><p class=\"\">\"We're excited to bring advanced AI to Kakao's millions of users and work together to integrate our technology into services that transform how Kakao's users communicate and connect,\" OpenAI Chief Executive Sam Altman said in a statement.</p><p class=\"\">Kakao CEO Chung Shin-a said the collaboration will help the South Korean company advance its AI efforts.</p><p class=\"\">The announcement was made at a joint press conference in Seoul on the back of Altman's visit to the country. Local media outlet Yonhap News Agency reported that he has met with SK Group Chairman Chey Tae-won, who was accompanied by SK Hynix CEO Kwak Noh-jung, to discuss possible collaborations in AI.</p><p class=\"\">Write to Kimberley Kao at kimberley.kao@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012083:0/",
            "pub_date": "2025-02-04 12:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-03:newsml_ACSc4Hhca:0",
            "title": "Onco-Innovations Completes Acquisition of Inka Health to Accelerate AI-Driven Cancer Research and Drug Development",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VANCOUVER, BC / ACCESS Newswire / February 3, 2025 / Onco-Innovations Limited (CSE:<strong class=\"root-Tkn6WL2y\">ONCO</strong>)(Frankfurt:<strong class=\"root-Tkn6WL2y\">W1H</strong>,WKN: <strong class=\"root-Tkn6WL2y\">A3EKSZ</strong>) (\"<strong class=\"root-Tkn6WL2y\">Onco</strong>\" or the \"<strong class=\"root-Tkn6WL2y\">Company</strong>\") is pleased to announce, further to its news release dated January 22, 2025, that it has completed the acquisition (the \"<strong class=\"root-Tkn6WL2y\">Acquisition</strong>\") of all of the outstanding share capital of Inka Health Corp. (\"<strong class=\"root-Tkn6WL2y\">Inka Health</strong>\"), a Canadian-based software company pioneering the use of advanced AI-driven analytics and real-world multimodal data to revolutionize clinical research and drug development. In consideration for the Acquisition, Onco has issued to the former holders of the Inka Health shares an aggregate of 1,775,147 common shares of the Company (\"<strong class=\"root-Tkn6WL2y\">Consideration Shares</strong>\"). All of the Consideration Shares are subject to resale restrictions whereby 10% will be released and tradeable four months from the closing date of the Acquisition (\"<strong class=\"root-Tkn6WL2y\">Closing Date</strong>\"), 15% of the remaining Consideration Shares will be released and tradeable within six months from the Closing Date, and a further 15% of the remaining amount will be released and tradeable every six months thereafter.</p><p class=\"\">By integrating Inka Health's (www.inkahealth.ai) cutting-edge AI-driven analytics and multimodal data capabilities, Onco aims to enhance its ability to accelerate cancer detection, precision oncology research, and drug development. Inka Health has developed the proprietary SynoGraph™ platform, which merges genomic, proteomic, and multimodal datasets to uncover deep insights into disease mechanisms, potentially enabling more personalized and effective treatment strategies. Inka Health's technology simulates precision-medicine clinical trials, offering the potential to significantly streamline late-stage drug discovery and clinical research by reducing both time and cost. Backed by a robust network of genomics partnerships and the expertise of Dr. Steven Jones-Head of Bioinformatics and Co-Director of the Genome Sciences Centre in Vancouver, as well as a Distinguished Scientist at the BC Cancer Research Institute1 -Inka Health's expertise and technology is expected to strengthen Onco's capabilities in precision oncology.</p><p class=\"\">Inka Health has built a strong track record of delivering innovative solutions in precision medicine, as evidenced by its partnerships with industry leaders such as AstraZeneca Canada, one of the world's largest pharmaceutical companies, and global data firm Quantify Research. These collaborations reflect Inka Health's established reputation for driving meaningful advancements in the field of science and research.</p><p class=\"\">\"<!-- -->The completion of this acquisition marks an important milestone for Onco, as it significantly enhances our ability to drive forward AI-powered precision oncology. Inka Health's cutting-edge technology and proven track record with industry leaders helps advance our capabilities in cancer therapeutic development and treatment. We are excited to integrate Inka's expertise into our operations as we continue to advance towards the next stages in the development of our technology and research,\" said Thomas O'Shaughnessy, CEO of Onco-Innovations.</p><p class=\"\">\"<!-- -->Joining forces with Onco-Innovations marks an exciting step forward for Inka Health. By leveraging our combined capabilities, we aim to enhance the speed and precision of cancer research, enabling the potential for developments that were previously out of reach or extremely time-consuming. Our AI-driven technology is designed to unlock deeper insights into cancer biology, and I believe that together we can push the boundaries of data-driven research, accelerate the research and development for more effective treatments, and ultimately make significant strides towards advancing the field of oncology research,\" said Dr. Paul Arora, CEO of Inka Health.</p><p class=\"\">The Company is also pleased to announce that it has closed its previously-announced (see news release dated January 27, 2025) non-brokered private placement (the \"<strong class=\"root-Tkn6WL2y\">Private Placement</strong>\") of 408,164 units of the Company (the \"<strong class=\"root-Tkn6WL2y\">Units</strong>\") at a price of $2.45 per Unit, for aggregate gross proceeds of $1,000,000. The proceeds from the Private Placement will be used for general working capital, corporate and research and development purposes, including to continue to fund research studies, to provide funding to pursue the further development of Inka Health's AI technology, and to continue to increase market awareness of Onco and its business activities. Pursuant to applicable securities laws, all securities issued under the Private Placement will be subject to a statutory hold period of four months and one day, expiring on June 4, 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Onco-Innovations Limited</strong></p><p class=\"\">Onco-Innovations is a Canadian-based company dedicated to cancer research and treatment, specializing in oncology. Onco's mission is to prevent and cure cancer through pioneering research and innovative solutions. The Company has secured an exclusive worldwide license to patented technology that targets solid tumours, setting new standards in cancer treatment. Onco's commitment to excellence and innovation drives it to develop advanced therapies that improve patient outcomes and offer hope in the fight against cancer.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ON BEHALF OF ONCO-INNOVATIONS LIMITED,</strong></p><p class=\"\">\"<strong class=\"root-Tkn6WL2y\">Thomas O'Shaughnessy</strong>\"</p><p class=\"\">Chief Executive Officer</p><p class=\"\">For more information, please contact:</p><p class=\"\">Thomas O'Shaughnessy</p><p class=\"\">Chief Executive Officer</p><p class=\"\">Tel:+ 1 888 261 8055</p><p class=\"\">investors@oncoinnovations.com</p><p class=\"\">oncoinnovations.com</p><p class=\"\">The CSE and Information Service Provider have not reviewed and do not accept responsibility for the accuracy or adequacy of this release.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements Caution.</strong> This news release contains forward-looking statements, including in relation to the expected synergies relating to the acquisition of Inka Health, and the Company's ability generally to realize the benefits therefrom, as well as in relation to the expected use of proceeds from the Private Placement, and to the prospects of the Company, and the Company's business and plans generally, and other statements that are not historical facts. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"potential\", \"should\", \"anticipate\", \"expects\" and similar expressions. All statements other than statements of historical fact, included in this release are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations include the failure to realize the anticipated benefits of acquiring Inka Health, that the Company may elect or need to utilize the proceeds of the Private Placement other than as disclosed herein, and other risks detailed from time to time in the filings made by the Company with securities regulators. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company will update or revise publicly any of the included forward-looking statements as expressly required by applicable law.</p><p class=\"\">1 https://www.inkahealth.ai/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Onco-Innovations Limited</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-03:newsml_ACSc4Hhca:0/",
            "pub_date": "2025-02-04 12:36:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012235:0",
            "title": "Real Impact of U.S. Tariff Too Early to Determine — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The real impact of U.S. tariffs is too early to determine, according to Stephen Dover, chief market strategist and head of the Franklin Templeton Institute, in a commentary. It is unclear whether these tariffs are a long-term policy or a negotiation tactic by President Trump to secure concessions, the strategist notes. At the margin, these tariffs should encourage more domestic production of goods in the United States. However, the uncertainty surrounding the permanence of these tariffs makes it challenging for companies to make informed capital investment decisions, Dover adds. Chinese policymakers and businesses are likely to implement measures to mitigate the impact should the situation escalate further, Dover notes. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012235:0/",
            "pub_date": "2025-02-04 12:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0AQ:0",
            "title": "NLC India jumps after Q3 profit surge",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of lignite and coal miner NLC India  rise 9.3% to 231 rupees</p><p class=\"\">** Co reports over two-fold rise in Q3 net profit to 6.68 billion rupees ($76.8 mln), rev up 39.4% at 44.11 billion rupees</p><p class=\"\">** Power generation segment rev grows 39.7% to 36.69 billion rupees</p><p class=\"\">** More than 9 mln shares traded as of 9:51 a.m. IST, 5.9x their 30-day moving avg</p><p class=\"\">** NLC trims YTD losses to 15%</p><p class=\"\">($1 = 87.0300 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0AQ:0-nlc-india-jumps-after-q3-profit-surge/",
            "pub_date": "2025-02-04 12:37:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463163:0",
            "title": "Coface to Buy Information Services Company Cedar Rose Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coface  will buy Cedar Rose Group to boost its information services in the Middle East and Africa. </p><p class=\"\">The French credit insurance company intends to turn Cedar Rose into its exclusive information provider in the region for credit insurance and information services sales, according to a Monday release. </p><p class=\"\">Completion is subject to standard closing conditions.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463163:0/",
            "pub_date": "2025-02-04 12:38:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0BC:0",
            "title": "India stocks, rupee, swaps, call at 10:00 a.m. IST",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">STOCKS:</p><p class=\"\">The benchmark BSE Sensex  was up 0.91% to 77875, while the broader NSE Nifty 50  advanced 0.86% to 23562 tracking the gains in other Asian markets, after the U.S. paused its planned tariffs on Canada and Mexico, easing concerns over a potential worldwide trade war. </p><p class=\"\">RUPEE: </p><p class=\"\">The Indian rupee  rose 0.2% versus the U.S. dollar to 87.03,  boosted by the dollar's decline after U.S. President Donald Trump delayed tariffs on Canada and Mexico by a month.  </p><p class=\"\">GOVERNMENT BONDS:</p><p class=\"\">The benchmark 10-year bond (IN067934G=CC) was quoted at rupees, with the yield little changed at 6.6721%, as profit booking caps downmove on bets of central bank easing. </p><p class=\"\">OVERNIGHT INDEX SWAPS:</p><p class=\"\">The one-year overnight index swap rate (INR1YMIBROIS=CC) was down 2 basis points at 6.30%, while the five-year swap rate (INR5YMIBROIS=CC) rose 1 basis point to 6.08%.</p><p class=\"\">CALL MONEY: </p><p class=\"\">India's overnight call money rate (INROND=) was at 6.35%, and the overnight TREPS rate (INTREPTOT=TCCL) was at 6.26%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0BC:0-india-stocks-rupee-swaps-call-at-10-00-a-m-ist/",
            "pub_date": "2025-02-04 12:38:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}