{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_TUA8T0DCW:0",
            "title": "USA Rare Earth and Inflection Point Acquisition Corp. II Announce Upsized PIPE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Inflection Point Acquisition Corp II :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">USA RARE EARTH AND INFLECTION POINT ACQUISITION CORP. II ANNOUNCE UPSIZED PIPE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">INFLECTION POINT ACQUISITION CORP II - FUND INCREASES PIPE INVESTMENTS BY $15.25 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">INFLECTION POINT ACQUISITION CORP II - AGGREGATE GROSS PROCEEDS FROM PIPE TRANSACTIONS NOW $40.75 MILLION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA8T0DCW:0-usa-rare-earth-and-inflection-point-acquisition-corp-ii-announce-upsized-pipe/",
            "pub_date": "2025-02-04 21:37:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA6J7QZG:0",
            "title": "ZenaTech Signes LOI to Acquire a Fifth Land Survey Company; Focused on Assisting Border Patrol and Law Enforcement to Control Illegal Immigration",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ZenaTech Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ZENATECH SIGNES LOI TO ACQUIRE A FIFTH LAND SURVEY COMPANY; FOCUSED ON ASSISTING BORDER PATROL AND LAW ENFORCEMENT TO CONTROL ILLEGAL IMMIGRATION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA6J7QZG:0-zenatech-signes-loi-to-acquire-a-fifth-land-survey-company-focused-on-assisting-border-patrol-and-law-enforcement-to-control-illegal-immigration/",
            "pub_date": "2025-02-04 21:37:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463503:0",
            "title": "Abu Dhabi's Borouge Mulls Potential New Polyolefins Complex in China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Borouge (ADX:BOROUGE) plans to potentially establish a specialized polyolefins production complex in China as part of its expansion in its key growth market, the WAM news agency reported Tuesday. </p><p class=\"\">Chief Executive Officer Hazeem Sultan Al Suwaidi told the media outlet that the petrochemicals company is working with Wanhua Chemical's Wanrong New Materials (Fujian) to finalize plans and determine the next steps. </p><p class=\"\">The planned Chinese facility is expected to have an annual production capacity of 1.6 million tonnes.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463503:0/",
            "pub_date": "2025-02-04 21:37:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ObiBTlT0a:0",
            "title": "Oncoinvent ASA: Grant of share options - mandatory notification of trade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oncoinvent ASA (\"Oncoinvent\" or the \"Company\") has today granted 3,560,000shareoptions under its long term share incentive scheme for employees (the \"OptionProgram\"), each with a strike price of NOK 2.4991 of these 2,210,000 shareoptions were granted to primary insiders of the Company. For more informationabout the grant of share options to primary insiders, see the attached forms.</p><p class=\"\">Following today's grant, a total of 4,789,808 share options have been grantedunder the Option Program.</p><p class=\"\">This information is subject to the disclosure requirements pursuant to article19 of the regulation EU 596/2014 (the EU Market Abise Regulation) and section5-12 of the Norwegian Securities Trading Act.</p><p class=\"\">About OncoinventOncoinvent ASA is a clinical stage, radiopharmaceutical company developinginnovative treatments for solid cancers. The technology platform is focused onthe use of alpha-emitting radionuclides to deliver powerful radiation directlyto cancer cells. The Company's lead product candidate, Radspherin®, is beingadvanced through clinical development by a team with experience from allstagesof radiopharmaceutical development. Internal manufacturing and supply chaincapabilities have been established, which now have the capacity to supplyRadspherin® for multi-center phase 2 clinical studies.</p><p class=\"\">For further information, please contact:Øystein Soug, Chief Executive OfficerEmail: soug@oncoinvent.com</p><p class=\"\">Tore Kvam, Chief Financial OfficerEmail: kvam@oncoinvent.com</p><p class=\"\">https://newsweb.oslobors.no/message/637685</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ObiBTlT0a:0-oncoinvent-asa-grant-of-share-options-mandatory-notification-of-trade/",
            "pub_date": "2025-02-04 21:38:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV18K:0",
            "title": "Hubbell Reports Fourth Quarter 2024 and Full Year Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hubbell Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK  FY25 TOTAL SALES GROWTH AND ORGANIC SALES GROWTH OF 4%-5%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK  FY25 ADJUSTED DILUTED EPS FROM CONTINUING OPERATIONS IN THE RANGE OF $17.35 TO $17.85</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 NET SALES $1.33 BILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY2025 EARNINGS PER SHARE VIEW $17.70 — LSEG IBES DATA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV18K:0-hubbell-reports-fourth-quarter-2024-and-full-year-results/",
            "pub_date": "2025-02-04 21:38:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0KN:0",
            "title": "Most Gulf markets gain despite trade war fears",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Most stock markets in the Gulf ended higher on Tuesday as investors focused on upcoming corporate earnings, despite escalating trade tensions between the U.S. and China.</p><p class=\"\">China slapped tariffs on U.S. imports in a swift response to new U.S. duties on Chinese goods, renewing a trade war between the world's top two economies even as President Donald Trump offered reprieves to Mexico and Canada.</p><p class=\"\">    An additional 10% tariff on all Chinese imports into the U.S. came into effect at 12:01 a.m. ET on Tuesday (0501 GMT) after Trump repeatedly warned Beijing it was not doing enough to halt the flow of illicit drugs into the United States.</p><p class=\"\">Saudi Arabia's benchmark index  gained 0.5%, led by a 1.6% rise in Al Rajhi Bank  and a 1.4% increase in Saudi Telecom Company . </p><p class=\"\">The kingdom's non-oil business sector expanded at its strongest pace in just over a decade in January, driven by a surge in new orders and robust business activity, a survey showed on Tuesday.</p><p class=\"\">Dubai's main share index  rose 0.7%, with toll operator Salik Company  jumping 3.5% and blue-chip developer Emaar Properties  advancing 0.7%.</p><p class=\"\">Dubai's market continued its recovery following a period of uncertainty. Investor optimism about upcoming fourth-quarter earnings drove positive performance across most sectors, particularly in financials and real estate, said Milad Azar, market analyst at XTB MENA.</p><p class=\"\">Abu Dhabi's benchmark index  edged higher 0.1%, supported by a 0.4% gain in Borouge  after it reported a sharp rise in fourth-quarter profit.</p><p class=\"\">The petrochemical firm also proposed a second-half dividend of 7.9 fils per share.</p><p class=\"\">Crude prices fell as U.S. tariffs on China took effect and Beijing retaliated with its own measures, heightening trade war fears.</p><p class=\"\">The Qatari index  finished 0.3% higher, with Qatar Gas Transport Nakilat  climbing 2.9%.</p><p class=\"\">Outside the Gulf, Egypt's blue-chip index  fell 0.3%, hit by a 1.3% fall in Talaat Moustafa Group Holding .</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">SAUDI ARABIA</p></td><td><p class=\"\"> added 0.5% to 12,434</p></td></tr><tr><td><p class=\"\">Abu Dhabi</p></td><td><p class=\"\"> rose 0.1% to 9,585</p></td></tr><tr><td><p class=\"\">Dubai</p></td><td><p class=\"\"> gained 0.7% to 5,219</p></td></tr><tr><td><p class=\"\">QATAR</p></td><td><p class=\"\"> was up 0.3% to 10,659</p></td></tr><tr><td><p class=\"\">EGYPT</p></td><td><p class=\"\"> eased 0.3% to 29,668</p></td></tr><tr><td><p class=\"\">BAHRAIN</p></td><td><p class=\"\"> lost 0.3% to 1,865</p></td></tr><tr><td><p class=\"\">OMAN</p></td><td><p class=\"\">(.MSX30) added 0.7% to 4,587</p></td></tr><tr><td><p class=\"\">KUWAIT</p></td><td><p class=\"\">(.BKP) increased 0.6% to 8,452</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0KN:0-most-gulf-markets-gain-despite-trade-war-fears/",
            "pub_date": "2025-02-04 21:38:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006516:0",
            "title": "First Business Fincl Svcs Is Maintained at Overweight by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:39 GMT) </strong>First Business Fincl Svcs Price Target Raised to $63.00/Share From $58.00 by Piper Sandler</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006516:0/",
            "pub_date": "2025-02-04 21:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006518:0",
            "title": "Choice Hotels Intl Is Maintained at Underweight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:39 GMT) </strong>Choice Hotels Intl Price Target Raised to $138.00/Share From $133.00 by Wells Fargo</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006518:0/",
            "pub_date": "2025-02-04 21:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002699:0",
            "title": "China Hits Back at Trump With U.S. Tariffs. Why Google Is in Its Crosshairs. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Brian Swint</p><p class=\"\">President Donald Trump's decision to impose additional 10% tariffs on goods from China provoked an immediate response from the world's second-largest economy.</p><p class=\"\">The new levies took effect overnight, prompting China to announce import taxes of 15% on U.S. crude oil, machinery, and some cars, as well as a 10% increase of tariffs on coal and liquified natural gas. In a move that wasn't explicitly tied to Trump's tariffs, China also said it was starting an antitrust probe into Alphabet's Google, the internet search engine.</p><p class=\"\">Beijing added two U.S. companies to its unreliable entity list — Calvin Klein owner PVH Corp. and biotechnology company Illumina.</p><p class=\"\">China also announced export controls on scarce elements that are critical for making electronics, including tungsten, tellurium, bismith, molybdenum and indium. China is a big miner of these materials.</p><p class=\"\">The moves follow a last minute delay to Trump's plans to raise taxes on imports from Mexico and Canada. That sparked a relief rally in stocks, which had fallen sharply on concern that the new tariffs would fan inflation and hamper economic growth. The question now is whether Trump and China can work out a similar deal to prevent the trade war from escalating further.</p><p class=\"\">\"For the most part, these moves are warnings that China intends to harm U.S. interests if need be but still give China the option to back down,\" said Julian Evans-Pritchard, head of China economics at Capital Economics. \"The tariffs could be postponed or cancelled before they come into effect\" on Feb. 10.</p><p class=\"\">Evans-Pritchard also noted that the Chinese retaliation only targets about $20 billion worth of imports, compared to the $450 billion in Chinese wares that Trump has targeted. What's more, China didn't raise tariffs on strategic goods such as semiconductors and pharmaceuticals.</p><p class=\"\">Write to Brian Swint at brian.swint@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002699:0/",
            "pub_date": "2025-02-04 21:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV18L:0",
            "title": "IES Holdings Reports Fiscal 2025 First Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IES Holdings Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">IES HOLDINGS INC: QTRLY ADJUSTED EPS $2.64</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV18L:0-ies-holdings-reports-fiscal-2025-first-quarter-results/",
            "pub_date": "2025-02-04 21:39:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006523:0",
            "title": "TGI Fridays Sells Bankrupt Restaurants — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TGI Fridays has sold more of the 39 company restaurants it declared bankruptcy on last year. The casual-dining chain sold 16 locations to franchisee Yadav Enterprises for $3 million in debt, along with curing costs, according to a court filing. Sugarloaf Hospitality, a current franchisee who is also managing the chain's hundreds of franchised locations, picked up three others. (heather.haddon@wsj.com; @heatherhaddon)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006523:0/",
            "pub_date": "2025-02-04 21:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006525:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0840 ET - TGI Fridays has sold more of the 39 company restaurants it declared bankruptcy on last year. The casual-dining chain sold 16 locations to franchisee Yadav Enterprises for $3 million in debt, along with curing costs, according to a court filing. Sugarloaf Hospitality, a current franchisee who is also managing the chain's hundreds of franchised locations, picked up three others. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">0834 ET - Diageo has had little to toast so far in 2025, AJ Bell's Russ Mould says in a note. First the calls from U.S. surgeon general for warnings about the health impacts of alcohol consumption and now it has withdrawn its medium-term guidance. The Guinness beer owner scrapped its midterm outlook of organic net sales growth of between 5% and 7%, citing uncertainty in key markets. The company said U.S. tariffs would affect the Mexican tequila and Canadian whisky it sells in the U.S. AJ Bell's investment director says the group will be relieved to see the imposition of tariffs for these two countries delayed for now, as imports from these countries account for a good chunk of Diageo's U.S. sales. Shares are down 0.7% at 23.49 pounds. (andrea.figueras@wsj.com)</p><p class=\"\">0829 ET - Base metal prices are mixed, with LME three-month copper up 0.1% at $9,116 a metric ton and LME three-month aluminum flat at $2,620 a ton in muted trading. Base metals reacted to the threat of U.S. tariffs in Monday's session with losses, compounded by the disappointing slip in the Chinese Caixin index for private companies, Commerzbank analysts say in a note. The main burden is the concern that this round of tariffs could just be the beginning, Commerzbank says. The initial reaction to postponed Mexico and Canada tariffs was a small relief rally, especially as U.S. economic data also surprised to the upside, analysts write. That said, some of these gains were reversed early Tuesday on China's countermeasures, and the prevailing hope is that it will stick with just these tariffs, Commerzbank adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0814 ET - Grain trader ADM says it is cutting 600 to 750 jobs globally in 2025 and plans to cut between $500 million and $750 million in costs over the next three to five years. The Chicago-based company that ships grain and processes crops into food ingredients, oil and biofuels says the cost cutting moves come during a challenging period for the agriculture industry, including low crop prices and \"global legislative and regulatory policy uncertainty.\" The company reported adjusted EPS of $1.14, on par with analyst estimates. (patrick.thomas@wsj.com)</p><p class=\"\">0745 ET - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p><p class=\"\">0701 ET - Kion Group posted a better-than-expected finish to the year, JPMorgan analysts say in a research note. The German industrial trucks and forklifts manufacturer's full-year adjusted EBIT exceeded the top end of the guidance, with margins ahead in both segments and fourth-quarter orders ahead of consensus, JPMorgan says. One of the risks to the medium-term margin target is the continued weakness in Supply Chain Solutions segment, where order recovery is still not visible, JPMorgan says. The company will issue 2025 guidance with the full set of results in late February, after which any possible changes to consensus will be made, the analysts say. Shares trade 11.5% higher at 38.90 euros. (nina.kienle@wsj.com)</p><p class=\"\">0645 ET - UBS Group's guidance suggests more top-line pressure to come for its global-wealth-management and personal-and-corporate banking units this quarter, Deutsche Bank's Benjamin Goy and Sharath Kumar say in a research note. The bank guided for a decline in net interest income in global wealth management in the low to mid-single percentage digits this quarter and a 10% decline in the personal and corporate banking unit. While the Swiss bank's fourth-quarter results looked solid, the business mix behind them wasn't ideal, Deutsche Bank says. The group's key global wealth management business was only in line with expectations and its personal and corporate banking unit missed estimates, the analysts say. UBS shares fall 6.1%. (adria.calatayud@wsj.com)</p><p class=\"\">0626 ET - Geberit's margins will come under pressure from higher wage costs this year but consensus estimates could move higher as the year progresses, Stifel Tobias Woerner and Augustin Cendre say in a research note. Generally, the market is too pessimistic on earnings, while the Swiss sanitary-products maker offers quality and value, the analysts say. The company should continue to grow over the years, they say. Germany remains an important part of the group's exposure and the lead indicators for residential construction in that region are better than what the stock suggests, Stifel says. Shares trade broadly flat at 504 Swiss francs. (nina.kienle@wsj.com)</p><p class=\"\">0620 ET - Machinery cyclical stock would be the most affected by U.S tariffs in the capital-goods sector, Deutsche Bank Research analyst Gael de-Bray says in a research note. Most industrial companies that have reported so far beat expectations on orders and revenue. The downturn in manufacturing activity that began in 2022 was just starting to show signs of easing, de-Bray says. However, the uncertainty, extra costs and inflation brought forth by new U.S tariffs could derail this nascent industrial recovery, the analyst says. With the risk of a global recession rising, Swedish SKF and Sandvik are likely first in line to feel the impact. (nina.kienle@wsj.com)</p><p class=\"\">0615 ET - Scor provided a positive update on its January reinsurance-treaty renewals, but this was largely as expected and might not be enough to move the needle, RBC Capital Markets' Derald Goh and Sarah Chong say in a research note. The update points to healthy volumes and flat profit margins, which are consistent with comments the French reinsurer made at its December capital-markets day, the analysts say. \"While it's a positive development we think it's largely as expected and hence we do not see anything incremental to sway the story on the back of this,\" RBC says. Shares rise 3.2%. (adria.calatayud@wsj.com)</p><p class=\"\">0606 ET - Publicis Groupe beat expectations once again in 4Q, but its guidance for the year ahead is in line with expectations, UBS analysts say in a research note. The French advertising group reported net revenue organic growth of 6.3% for 4Q, ahead of both consensus expectations and the company's guidance, UBS says. This is likely to be well received by the market, the analysts say. However, Publicis's outlook seems unlikely to prompt major changes to consensus estimates, according to UBS. Shares rise 2.8% to 105.10 euros, trading near record highs reached last year. (adria.calatayud@wsj.com)</p><p class=\"\">0545 ET - Vodafone is struggling to remain relevant, AJ Bell's Russ Mould writes in a note. \"While there are some reasons for encouragement, the market has tuned these out and is focused on the growing problems in its German operation,\" Mould says. The London-listed telecom company's U.K. segment showed some growth, ahead of the now-approved merger with Three. However, the group needs to demonstrate it can achieve sustainable growth to reassure investors, Mould says. Shares fall 6.3% to 65.62 pence. (najat.kantouar@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006525:0/",
            "pub_date": "2025-02-04 21:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308820:0",
            "title": "Stephens Adjusts Price Target on Vulcan Materials Company to $335 From $325, Maintains Overweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vulcan Materials Company  has an average rating of overweight and mean price target of $305.02, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308820:0/",
            "pub_date": "2025-02-04 21:40:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006432:0",
            "title": "Collegium Pharmaceutical Is Maintained at Neutral by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:33 GMT) </strong>Collegium Pharmaceutical Price Target Cut to $36.00/Share From $37.00 by Piper Sandler</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006432:0/",
            "pub_date": "2025-02-04 21:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308822:0",
            "title": "Evercore ISI Adjusts Synchrony Financial Price Target to $79 From $76, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Synchrony Financial  has an average rating of overweight and mean price target of $78.38, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308822:0/",
            "pub_date": "2025-02-04 21:33:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308817:0",
            "title": "McKesson Agrees to Acquire 80% Stake in PRISM Vision for $850 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">McKesson  said Tuesday it has agreed to acquire a controlling interest in PRISM Vision Holdings from Quad-C for $850 million</p><p class=\"\">McKesson will retain an 80% stake in the provider of ophthalmology and retina management services, while PRISM Vision physicians will hold the rest. </p><p class=\"\">Upon closing, PRISM Vision is anticipated to add about $0.20 to $0.30 to McKesson's adjusted earnings per diluted share in the first 12 months, and $0.65 to $0.75 by the end of the third year, the company said. </p><p class=\"\">The transaction will add 180 providers, 91 office locations, and seven ambulatory surgery centers to McKesson's platform.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308817:0/",
            "pub_date": "2025-02-04 21:33:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006346:0",
            "title": "Jabil Acquires Pharmaceutics International, Inc. (Pii)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:30 GMT) </strong>*Jabil Acquires Pharmaceutics International, Inc. (Pii) &gt;JBL<br/><strong class=\"root-Tkn6WL2y\">(13:34 GMT) </strong>Press Release: Jabil Acquires Pharmaceutics International, Inc. (Pii)</p><p class=\"\">Jabil Acquires Pharmaceutics International, Inc. (Pii)</p><p class=\"\">The acquisition of Pii, a science-driven contract development and manufacturing organization (CDMO), complements Jabil's existing pharmaceutical solutions, enabling comprehensive support for customers in drug development, clinical trials, and product commercialization at scale.</p><p class=\"\">ST. PETERSBURG, Fla.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Jabil Inc. , a global leader in engineering, manufacturing, and supply chain solutions, today announced the successful acquisition of Pharmaceutics International, Inc. (Pii), a contract development and manufacturing organization (CDMO) specializing in early stage, clinical, and commercial volume aseptic filling, lyophilization, and oral solid dose manufacturing, completed February 3, 2025.</p><p class=\"\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20250204436085/en/</p><p class=\"\">Pii's four state-of-the-art manufacturing facilities in Hunt Valley, Maryland, include dedicated space for aseptic filling, oral solid dose production, and handling high potency compounds and hormones. (Photo: Business Wire)</p><p class=\"\">\"As the pace of healthcare innovation accelerates, pharmaceutical companies need partners who can help them scale rapidly with a focus on quality and safety. Jabil and Pii's combined capabilities can provide end-to-end support for pharmaceutical customers, offering one safe, trusted pair of hands to simplify their entire supply chain,\" said Mike Mahaz, SVP, Global Business Units, Healthcare, at Jabil.</p><p class=\"\">Jabil is a leader in parenteral drug delivery, in support of markets like GLP-1s. This acquisition will significantly enhance Jabil's existing Pharmaceutical Solutions offering, which includes the development and commercial production of auto-injectors, pen injectors, inhalers, and on-body pumps. With the addition of Pii's leading scientific insights, depth of product knowledge, and capabilities across aseptic filling, lyophilization, and oral solid dose manufacturing, Jabil can meet the clinical and commercial drug manufacturing demands of healthcare customers.</p><p class=\"\">\"Jabil is very pleased to announce this acquisition. With our shared commitment to creating the best solutions possible for patients around the world, we believe the addition of Pii's capabilities, supported by over 300 team members, is a perfect fit for Jabil and our customers,\" said James O'Gorman, Vice President, Pharmaceutical Solutions, at Jabil. \"The convergence of Jabil's and Pii's complementary capabilities will bolster Jabil's customer offering and support business growth potential as we enter the CDMO market.\"</p><p class=\"\">Founded in 1994, Pii's footprint has grown to over 360,000 square feet across four sites on a single campus in Hunt Valley, Maryland. Pii's state-of-the-art Good Manufacturing Practice (GMP) facilities contain over 70 manufacturing rooms, including containment suites for handling high potency compounds and hormones, dedicated manufacturing suites for oral products (e.g., soft gels), an aseptic facility for injectables (e.g., vials, syringes, and cartridges), a formulation development center, and analytical and microbiology laboratories. This expertise will add a comprehensive portfolio of pharmaceutical development and manufacturing services to Jabil's current healthcare solutions.</p><p class=\"\">By joining Jabil, Pii gains access to an expanded global infrastructure, cutting-edge automation, and enhanced supply chain efficiencies, enabling even greater responsiveness and innovation for their pharmaceutical partners.</p><p class=\"\">\"This acquisition marks an exciting new chapter for Pii. We look forward to leveraging Jabil's extensive expertise to accelerate our mission of delivering best-in-class drug development and manufacturing solutions to our customers and ultimately the patients we serve,\" said John Fowler, President and CEO at Pii.</p><p class=\"\">\"On behalf of our board and fellow shareholders at Athyrium Capital Management, Hildred Capital and Pharmascience Inc., I want to thank our management and staff for their splendid work in building the Company over the past several years,\" said James Gale, Chairman of Pii and managing director of Signet Healthcare Partners. \"Jabil is the perfect owner to continue the momentum of the business. With their resources and capabilities, we believe our customers and employees will be well served going forward.\"</p><p class=\"\">For more information, please visit https://www.pharm-int.com/.</p><p class=\"\">About Jabil:</p><p class=\"\">At Jabil , we are proud to be a trusted partner for the world's top brands, offering comprehensive engineering, manufacturing, and supply chain solutions. With over 50 years of experience across industries and a vast network of over 100 sites worldwide, Jabil combines global reach with local expertise to deliver both scalable and customized solutions. Our commitment extends beyond business success as we strive to build sustainable processes that minimize environmental impact and foster vibrant and diverse communities around the globe. Discover more at www.jabil.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204436085/en/</p><p class=\"\">CONTACT:    Investor Contact</p><p class=\"\">Adam Berry</p><p class=\"\">Senior Vice President, Investor Relations and Communications</p><p class=\"\">adam_berry@jabil.com</p><p class=\"\">Media Contact</p><p class=\"\">Timur Aydin</p><p class=\"\">Senior Director, Enterprise Marketing and Communications</p><p class=\"\">publicrelations@jabil.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006346:0/",
            "pub_date": "2025-02-04 21:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006440:0",
            "title": "Diageo Starts 2025 on Back Foot, AJ Bell Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Diageo has had little to toast so far in 2025, AJ Bell's Russ Mould says in a note. First the calls from U.S. surgeon general for warnings about the health impacts of alcohol consumption and now it has withdrawn its medium-term guidance. The Guinness beer owner scrapped its midterm outlook of organic net sales growth of between 5% and 7%, citing uncertainty in key markets. The company said U.S. tariffs would affect the Mexican tequila and Canadian whisky it sells in the U.S. AJ Bell's investment director says the group will be relieved to see the imposition of tariffs for these two countries delayed for now, as imports from these countries account for a good chunk of Diageo's U.S. sales. Shares are down 0.7% at 23.49 pounds. (andrea.figueras@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006440:0/",
            "pub_date": "2025-02-04 21:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV191:0",
            "title": "Regeneron rises on new dividend program, Q4 results beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of drugmaker Regeneron Pharmaceuticals  rise ~2% to $680.40 premarket</p><p class=\"\">** REGN says its board approved a cash dividend program, paying 88 cents per share to shareholders on March 20</p><p class=\"\">** Co announces an additional $3 bln share repurchase program, bringing total current capacity to around $4.5 bln</p><p class=\"\">** Brokerage Evercore ISI says \"dividend should help attract new investors to the name\" without altering REGN's capital allocation priorities</p><p class=\"\">** Co also reports Q4 adj. profit of $12.07 per share, above analysts' est. of $11.28, according to LSEG data, driven by strong demand for its eczema drug, Dupixent</p><p class=\"\">** Co posts Q4 sales of $3.79 bln vs. analysts' expectations of $3.75 bln - LSEG</p><p class=\"\">** Dupixent sales came in at $3.70 bln, compared to $3.22 bln a year ago</p><p class=\"\">** REGN fell 21.3% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV191:0-regeneron-rises-on-new-dividend-program-q4-results-beat/",
            "pub_date": "2025-02-04 21:34:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV18O:0",
            "title": "Estee Lauder falls on gloomy quarterly profit forecast; announces job cuts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Cosmetics company Estee Lauder's  shares down nearly 7.45% at $76.60</p><p class=\"\">** Company forecasts third-quarter adjusted earnings per share between 24 cents and 34 cents, below analysts' estimates of 63 cents per share, according to data compiled by LSEG.</p><p class=\"\">** \"For the third quarter, we expect overall soft retail trends to persist in Asia travel retail, significantly pressuring our organic net sales\", CEO Stephane de La Faverie </p><p class=\"\">** Co, in its restructuring plan, estimates a net reduction of 5,800 to 7,000 jobs by the end of fiscal 2026 to return to sales growth</p><p class=\"\">** Co adds the plan aims to \"manage external volatility, such as potential tariff increases globally\"</p><p class=\"\">** Q2 sales fall 6% to $4 billion, compared with analysts' estimates of $3.97 billion</p><p class=\"\">** EL stock fell 71% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV18O:0-estee-lauder-falls-on-gloomy-quarterly-profit-forecast-announces-job-cuts/",
            "pub_date": "2025-02-04 21:34:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006468:0",
            "title": "Vacasa Gets $5.25/Share Buyout Bid From Davidson Kempner",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Colin Kellaher</p><p class=\"\">Vacasa has received an unsolicited, non-binding takeover proposal from investment firm Davidson Kempner Capital Management that could upend the vacation rental management platform's deal to be acquired by peer Casago.</p><p class=\"\">Vacasa on Tuesday said Davidson Kempner has proposed a purchase price of $5.25 a share, topping the $5.02 a share that Casago agreed to pay in a deal struck late last year.</p><p class=\"\">Vacasa said a special committee of its board will review the Davidson Kempner bid in consultation with its outside legal counsel and financial adviser to determine whether it could reasonably be expected to result in a superior proposal to the Casago deal.</p><p class=\"\">Shares of Vacasa rose 4.3% to $5.30 in premarket trading, an indication that investors may think a bidding war for the Portland, Ore., company may be in the offing.</p><p class=\"\">Write to Colin Kellaher at colin.kellaher@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006468:0/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXPcz9w:0",
            "title": "Exodus Movement, Inc. Announces Offer to Acquire Banxa Holdings Inc.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OMAHA, Neb., Feb.  04, 2025  (GLOBE NEWSWIRE) — Exodus Movement, Inc. (NYSE American: EXOD) (\"Exodus\"), a leading self-custodial cryptocurrency platform, today announced that it has submitted a proposal (the “Exodus Offer”) for the acquisition of all of the issued and outstanding common shares of Banxa Holdings Inc.  (\"Banxa\"), a globally recognized financial technology platform specializing in digital asset on-and-off ramp solutions. Banxa today announced that its Board of Directors, after consultation with its financial and legal advisors, and after consideration of a recommendation from its Special Committee of the Board of Directors, has unanimously determined that the Exodus Offer constitutes a “Superior Proposal” under the terms of the arrangement agreement between Banxa and 1493819 B.C. Ltd. (“1493819”). Banxa also announced that it provided notice of such determination to 1493819 and that, under its arrangement agreement with 1493819, 1493819 now has the right, until 5:00 p.m. (Vancouver time) on February 10, 2025, to propose to amend the terms of the arrangement agreement in order to make the Exodus Offer no longer a Superior Proposal.</p><p class=\"\">Pursuant to the terms of the Exodus Offer, Exodus has offered to acquire all of the issued and outstanding common shares of Banxa (“Banxa Shares”) for consideration per Banxa Share comprised of (i) CDN$1.10 in cash; and (ii) 0.0079 of class A common stock of Exodus (“Exodus Shares”). Based on the closing price of the Exodus Shares on NYSE American on February 3, 2025 of US$59.59 and the U.S./Canada daily exchange rate on February 3, 2025 of US$1.00/CDN$1.4603, the value of the share consideration to be paid to Banxa shareholders is US$0.47 or approximately CDN$0.69 per Banxa Share, bringing the total consideration to be received by Banxa shareholders to approximately CDN$1.79 per Banxa Share.</p><p class=\"\">At this time, there can be no assurance that the Exodus Offer will lead to a termination of the arrangement agreement between Banxa and 1493819 and the execution of a definitive arrangement agreement between Banxa and Exodus in respect of the Exodus Offer, or that the proposed transaction contemplated by the Exodus Offer will be consummated.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Exodus</strong></p><p class=\"\">Exodus is a financial technology leader empowering individuals and businesses with secure, user-friendly crypto software solutions. Since 2015, Exodus has made digital assets accessible to everyone through its multi-asset crypto wallets prioritizing design and ease of use.</p><p class=\"\">With self-custodial wallets, Exodus puts customers in full control of their funds, enabling them to swap, buy, and sell crypto. Its business solutions include Passkeys Wallet and XO Swap, industry-leading tools for embedded crypto wallets and swap aggregation.</p><p class=\"\">Exodus is committed to driving the future of accessible and secure finance. Learn more at exodus.com or follow us on X at x.com/exodus_io.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contact</strong></p><p class=\"\">investors@exodus.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains “forward-looking statements” as that term is defined by the federal securities laws. All forward-looking statements are based upon our current expectations and various assumptions and apply only as of the date made. Our expectations, beliefs, and projections are expressed in good faith, and we believe there is a reasonable basis for them. However, there can be no assurance that our expectations, beliefs and projections will be achieved. Forward-looking statements are generally identified by the words “may,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “anticipate,” “believe,” “estimate,” “predict,” “project,” “potential,” “continue,” “ongoing,” “forecast,” as well as variations of such words or similar expressions. Forward-looking statements in this document include, but are not limited to, statements regarding the Exodus Offer, including the consideration to be issued pursuant to the Exodus Offer, the possibility that 1493819 submits a revised offer during the matching period, the possibility that Banxa and 1493819 amend the terms of their arrangement agreement that results in the Exodus Offer no longer being a Superior Proposal and the ability of Exodus and Banxa to consummate the transaction on the terms and in the manner contemplated by the Exodus Offer. Such forward-looking statements involve a number of risks, uncertainties and other important factors that could cause our actual results to differ materially from those expressed or implied by our forward-looking statements. Such factors include the possible actions by or on behalf of 1493819; the possibility that Exodus withdraws the Exodus Offer; or the possibility of a third party submitting a proposal or a revised proposal which leads to a new Superior Proposal, as well as those set forth in “Item 1. Business” and “Item 1A. Risk Factors” of Amendment No. 6 to our Registration Statement on Form 10 filed with the Securities and Exchange Commission (the “SEC”) on November 27, 2024, as well as in our other reports filed with the SEC from time to time. All forward-looking statements are expressly qualified in their entirety by such cautionary statements. Readers are cautioned not to place undue reliance on such forward-looking statements. Except as required by law, we undertake no obligation to update or revise any forward-looking statements that have been made to reflect events or circumstances that arise after the date made or to reflect the occurrence of unanticipated events.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">No Offer or Solicitation</strong></p><p class=\"\">The Exodus Offer contemplates that the Exodus Shares will be issued in a transaction exempt from the registration requirements of the U.S. Securities Act of 1933, as amended (the “U.S. Securities Act”), pursuant to Section 3(a)(10) of the U.S. Securities Act. Consequently, the Exodus Shares will not be registered under the U.S. Securities Act or under any U.S. state securities laws. This press release does not constitute an offer to sell or a solicitation of an offer to buy Exodus Shares or any other securities, and shall not constitute an offer, solicitation or sale in any jurisdiction in which such an offer, solicitation or sale would be unlawful.</p><p class=\"\">Source: Exodus Movement, Inc.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXPcz9w:0-exodus-movement-inc-announces-offer-to-acquire-banxa-holdings-inc/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006456_20250204006456:0",
            "title": "Exodus Movement, Inc. Announces Offer To Acquire Banxa Holdings Inc. >EXOD",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006456_20250204006456:0/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbs4tBp:0",
            "title": "Clearmind Medicine Announces Publication of Patent for Binge Behavior Psychedelic Combination Treatment in Mexico",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vancouver, Canada, Feb.  04, 2025  (GLOBE NEWSWIRE) — Clearmind Medicine Inc. , (FSE: CWY0) (“Clearmind” or the \"Company\"), a clinical-stage biotech company focused on discovery and development of novel psychedelic-derived therapeutics to solve major under-treated health problems, announces today a patent publication by the Instituto Mexicano de la Propriedad Industrial (IMPI), the National Mexico Patent Office. The patent refers to the Company’s innovative combination therapy of MEAI and N-Acylethanolamines, addressing binge behavior, including alcohol consumption, eating, tobacco consumption, shopping and sexual conduct.</p><p class=\"\">The patent is part of Clearmind’s successful collaboration with SciSparc Ltd. , a clinical-stage specialty pharmaceutical company focused on treatments for central nervous system disorders. Together, the two companies are researching innovative combination therapies that integrate psychedelic compounds with the N-Acylethanolamines family, including Palmitoylethanolamide (PEA).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Clearmind Medicine Inc.</strong></p><p class=\"\">Clearmind is a clinical-stage psychedelic pharmaceutical biotech company focused on the discovery and development of novel psychedelic-derived therapeutics to solve widespread and underserved health problems, including alcohol use disorder. Its primary objective is to research and develop psychedelic-based compounds and attempt to commercialize them as regulated medicines, foods or supplements.</p><p class=\"\">The Company’s intellectual portfolio currently consists of nineteen patent families including 31 granted patents. The Company intends to seek additional patents for its compounds whenever warranted and will remain opportunistic regarding the acquisition of additional intellectual property to build its portfolio.</p><p class=\"\">Shares of Clearmind are listed for trading on Nasdaq under the symbol \"CMND\" and the Frankfurt Stock Exchange under the symbol “CWY0.”</p><p class=\"\">For further information visit: https://www.clearmindmedicine.com or contact:</p><p class=\"\">Investor Relations</p><p class=\"\"> invest@clearmindmedicine.com</p><p class=\"\">Telephone: (604) 260-1566</p><p class=\"\"> US: CMND@crescendo-ir.com</p><p class=\"\">General Inquiries</p><p class=\"\">Info@Clearmindmedicine.com</p><p class=\"\">www.Clearmindmedicine.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About SciSparc Ltd.</strong></p><p class=\"\">SciSparc Ltd. (SPRC) is a specialty clinical-stage pharmaceutical company led by an experienced team of senior executives and scientists. SciSparc’s focus is on creating and enhancing a portfolio of technologies and assets based on cannabinoid pharmaceuticals. With this focus, the Company is currently engaged in the following drug development programs based on THC and/or non-psychoactive cannabidiol: SCI-110 for the treatment of Tourette Syndrome, for the treatment of Alzheimer's disease and agitation; and SCI-210 for the treatment of autism and status epilepticus. The Company also owns a controlling interest in a subsidiary whose business focuses on the sale of hemp seeds’ oil-based products on the Amazon.com Marketplace.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements:</strong></p><p class=\"\">This press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act and other securities laws. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “estimates” and similar expressions or variations of such words are intended to identify forward-looking statements. The Company cannot assure that any patent will issue as a result of a pending patent application or, if issued, whether it will issue in a form that will be advantageous to the Company. Forward-looking statements are not historical facts, and are based upon management’s current expectations, beliefs and projections, many of which, by their nature, are inherently uncertain. Such expectations, beliefs and projections are expressed in good faith. However, there can be no assurance that management’s expectations, beliefs and projections will be achieved, and actual results may differ materially from what is expressed in or indicated by the forward-looking statements. Forward-looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in the forward-looking statements. For a more detailed description of the risks and uncertainties affecting the Company, reference is made to the Company’s reports filed from time to time with the Securities and Exchange Commission (“SEC”), including, but not limited to, the risks detailed in the Company’s annual report on Form 20-F for the fiscal year ended October 31, 2024 filed with the SEC. Forward-looking statements speak only as of the date the statements are made. The Company assumes no obligation to update forward-looking statements to reflect actual results, subsequent events or circumstances, changes in assumptions or changes in other factors affecting forward-looking information except to the extent required by applicable securities laws. If the Company does update one or more forward-looking statements, no inference should be drawn that the Company will make additional updates with respect thereto or with respect to other forward-looking statements. References and links to websites have been provided as a convenience, and the information contained on such websites is not incorporated by reference into this press release. Clearmind is not responsible for the contents of third-party websites.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbs4tBp:0-clearmind-medicine-announces-publication-of-patent-for-binge-behavior-psychedelic-combination-treatment-in-mexico/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1q1mT9:0",
            "title": "Aligned Data Centers Bolsters Leadership Team with Four Key Executive Appointments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DALLAS, Feb.  04, 2025  (GLOBE NEWSWIRE) — Aligned Data Centers, a leading technology infrastructure company offering innovative, sustainable and adaptive Scale Data Centers and Build-to-Scale solutions for global hyperscale and enterprise customers, today announced four new executive leadership appointments:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Michael Morris </strong>was promoted to Chief Development Officer (CDO)<strong class=\"root-Tkn6WL2y\"> </strong>from his previous role as Executive Vice President of Design and Construction, where he was responsible for overseeing data center campus development, ensuring alignment with best-in-industry design, efficiency, and operational objectives, as well as speed-to-market targets. In his new role, Mr. Morris will lead Aligned's strategic development initiatives, focusing on expanding the company's data center footprint to meet the increasing demand for scalable and adaptable infrastructure.With nearly 15 years of experience in leading high-impact data center development and construction projects, Mr. Morris has been instrumental in advancing Aligned's mission to provide innovative and sustainable data center solutions. Prior to joining Aligned, he held key positions at Equinix, serving as the company’s Regional Director of Construction Management, and at DPR Construction as a Senior Project Manager, where he managed large-scale data center projects and honed his expertise in delivering complex infrastructure. </li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Michael Welch</strong> was promoted to Chief Technology Officer (CTO) of Aligned Data Centers from his previous role as SVP, Procurement and Design. As CTO, he will lead the implementation of new technologies to keep the company at the forefront of the industry. Additionally, he will develop and implement strategies for sustainable and efficient power generation solutions; drive the go-to-market strategy for platform delivery, ensuring successful product launches and market penetration; and strategize and oversee Aligned’s advanced supply chain.Mr. Welch joined Aligned in August 2011 and has since held numerous leadership positions, including Senior Director of Preconstruction and Delivery, Director of Platform Procurement, and Product Development Engineer. He was also instrumental in the launch of the company’s proprietary and award-winning Delta3™ air-cooled and DeltaFlow~ liquid-cooled technologies. </li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Shelby Clark</strong>, previously Aligned’s VP, People and Culture, has assumed the role of Chief People Officer (CPO). As CPO, Ms. Clark is responsible for overseeing Aligned’s HR functions, including talent acquisition, employee engagement, leadership development, and company culture, with the primary goal of maximizing employee potential and aligning the workforce strategy with the company's strategic objectives. She joined the organization in December 2023, spearheading the development of innovative programs designed to empower leaders across Aligned and ODATA’S global operations. Under Ms. Clark’s leadership, her People and Culture team have rolled out several impactful initiatives including mentorship programs, multicultural training, and programs to increase female representation in the data center industry. Her strategic vision supports Aligned’s commitment to operational excellence, employee empowerment, and sustainability.Prior to joining Aligned, Ms. Clark was SVP, HR and Organizational Development and Financial Services Chief of Staff at First United Bank. Previously, as Global Human Resources Business Lead, Americas at Amdocs, she led the human capital strategy in 15 countries across North America, South America, Central America, the Caribbean, EMEA, and APAC.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Matthew Chambliss</strong>, formerly SVP, Finance at Aligned, has assumed the role of EVP, Commercial Strategy and Energy. As EVP, Commercial Strategy and Energy, Mr. Chambliss is responsible for driving Aligned’s continued growth and success by uniting the Sales, Finance, Legal, Project Development, and Energy teams, thereby ensuring seamless execution while balancing speed-to-market, risk mitigation, and financial performance. In his former role as SVP, Finance, he was responsible for Aligned's financial activities, plans and policies. He joined Aligned in May 2017 as Director of Finance.Prior to Aligned, Mr. Chambliss served as the Manager of Financial Planning and Analysis at Spirit Realty Capital, Inc. and Roofing Supply Group. He also held dual analytical roles at Energy Future Holdings, a Dallas-area based electric utility company, as well as an Associate position at PwC, where he began his career.</li></ul><p class=\"\">“Aligned is committed to fostering a culture of leadership excellence,” states Andrew Schaap, CEO of Aligned. “I am incredibly proud to see this talented group of leaders step into their expanded roles and, alongside their respective teams, continue to position Aligned as a leading data center builder and operator in the Americas. This is a pivotal time for our company. I am confident that with our exceptional team and the industry's top talent, Aligned is poised for continued success.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aligned Data Centers</strong></p><p class=\"\">Aligned Data Centers is a leading technology infrastructure company offering innovative, sustainable, and adaptive Scale Data Centers and Build-to-Scale solutions for global hyperscale and enterprise customers. Our intelligent infrastructure allows densification and vertical growth within the same footprint, enabling customers to scale up without disruption, all while maintaining industry-leading Power Usage Effectiveness (PUE). By reducing the energy, water and space needed to operate, our data center solutions, combined with our patented cooling technology, offer businesses a competitive advantage by improving sustainability, reliability, and their bottom line. For more information, visit www.aligneddc.com and connect with us on X, LinkedIn and Facebook.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Press and Analyst Inquiries</strong>Jennifer Handshew for Aligned Data Centers</p><p class=\"\">jennifer@180-mktg.com</p><p class=\"\">+1 (917) 359-8838</p><p class=\"\">A photo accompanying this announcement is available at: https://www.globenewswire.com/NewsRoom/AttachmentNg/9e341b44-f449-442c-9514-36ec064a151f</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aligned Bolsters Leadership Team with Key Executive Appointments</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Aligned Bolsters Leadership Team with Key Executive Appointments</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1q1mT9:0-aligned-data-centers-bolsters-leadership-team-with-four-key-executive-appointments/",
            "pub_date": "2025-02-04 21:35:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV18A:0",
            "title": "Triumvirate Environmental valued at $1.8 billion after investment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Commercial waste management company Triumvirate Environmental said on Tuesday it was valued at $1.8 billion after an investment from private equity firm Berkshire Partners, alongside its CEO and founder, John McQuillan.</p><p class=\"\">The partnership will allow Massachusetts-based Triumvirate to expand into new regions, add new service lines and enhance its technology capabilities, it said.</p><p class=\"\">Founded in 1988, Triumvirate provides sustainable environmental solutions to companies in the life sciences, healthcare, education, and industrial markets. </p><p class=\"\">Raymond James advised Triumvirate on the deal, while Stifel consulted with Berkshire Partners.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV18A:0-triumvirate-environmental-valued-at-1-8-billion-after-investment/",
            "pub_date": "2025-02-04 21:35:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbGhT1M:0",
            "title": "FAVO Capital Inc. Partners with IBN to Strengthen Investor Communications and Market Visibility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AUSTIN, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — via IBN – FAVO Capital Inc. , a leading provider of alternative financing solutions in the private credit sector, has engaged IBN, a multifaceted financial media and publishing firm, to enhance its investor communications strategy, serve as its investor relations liaison, and expand market reach.</p><p class=\"\">FAVO Capital is transforming the private credit and alternative lending industry by expanding funding capacity, enhancing technology-driven underwriting models, and optimizing borrower acquisition strategies to drive market share growth and investor value.</p><p class=\"\">To meet the growing demand for non-bank financing solutions, FAVO Capital provides fast, flexible funding to underserved small and medium-sized businesses. By leveraging proprietary underwriting algorithms and a data-driven approach, the company streamlines access to working capital while mitigating risk, positioning itself as a key player in the $1.5 trillion alternative lending market.</p><p class=\"\">As part of its strategic roadmap to uplist to Nasdaq, FAVO Capital is optimizing its capital structure, strengthening regulatory compliance, and advancing institutional partnerships to support long-term growth. Additionally, the company is developing an advanced digital platform to enhance client engagement and streamline funding processes. This platform will enable businesses to apply for funding, track progress, and manage repayments with greater efficiency. A complementary mobile app is also in development to provide real-time financial insights and tailored funding recommendations, improving the overall borrower experience.</p><p class=\"\">As part of the Client Partner relationship, IBN will leverage its investor-focused distribution network, which includes over 5,000 key syndication outlets, various newsletters, social media channels, and wire services via InvestorWire, along with blogs and other outreach tools, to generate greater awareness for FAVO Capital.</p><p class=\"\">With over 19 years of experience assisting over 500 client partners and a sizable family of 70+ trusted brands, IBN has amassed a collective audience that includes millions of social media followers. This positions IBN to provide FAVO Capital the solutions needed to reach a wide audience of investors, journalists, and the general public.</p><p class=\"\">To learn more about FAVO Capital, please visit the company’s corporate newsroom at https://IBN.fm/FAVO</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About FAVO Capital Inc.</strong></p><p class=\"\">FAVO Capital Inc.  is a fast-growing alternative finance company specializing in flexible, technology-driven funding solutions for emerging, small, and medium-sized businesses. Headquartered in Fort Lauderdale, Florida, FAVO leverages advanced underwriting models and a client-centric approach to bridge gaps left by traditional lenders.</p><p class=\"\">With a commitment to efficiency, flexibility, and long-term growth, FAVO Capital is dedicated to providing scalable financial solutions that help businesses access the capital they need to succeed in an evolving market.</p><p class=\"\">For more information, visit www.FAVOCapital.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IBN</strong></p><p class=\"\">IBN consists of financial brands introduced to the investment public over the course of 19+ years. With IBN, we have amassed a collective audience of millions of social media followers. These distinctive investor brands aim to fulfill the unique needs of a growing base of client-partners. IBN will continue to expand our branded network of highly influential properties, leveraging the knowledge and energy of specialized teams of experts to serve our increasingly diversified list of clients.</p><p class=\"\">Through our Dynamic Brand Portfolio (DBP), IBN provides: (1) access to a network of wire solutions via InvestorWire to reach all target markets, industries and demographics in the most effective manner possible; (2) article and editorial syndication to 5,000+ news outlets; (3) Press Release Enhancement to ensure maximum impact; (4) full-scale distribution to a growing social media audience; (5) a full array of corporate communications solutions; and (6) total news coverage solutions.</p><p class=\"\">For more information, please visit https://www.InvestorBrandNetwork.com</p><p class=\"\">Please see full terms of use and disclaimers on the InvestorBrandNetwork website applicable to all content provided by IBN, wherever published or re-published: http://IBN.fm/Disclaimer</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. All forward-looking statements are inherently uncertain as they are based on current expectations and assumptions concerning future events or future performance of the company. Readers are cautioned not to place undue reliance on these forward-looking statements, which are only predictions and speak only as of the date hereof. In evaluating such statements, prospective investors should review carefully various risks and uncertainties identified in this release and matters set in the company's SEC filings. These risks and uncertainties could cause the company's actual results to differ materially from those indicated in the forward-looking statements.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Corporate Communications</strong></p><p class=\"\">IBN</p><p class=\"\">Austin, Texas</p><p class=\"\">www.InvestorBrandNetwork.com</p><p class=\"\">512.354.7000 Office</p><p class=\"\">Editor@InvestorBrandNetwork.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbGhT1M:0-favo-capital-inc-partners-with-ibn-to-strengthen-investor-communications-and-market-visibility/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX66ZY3f:0",
            "title": "EZCORP to Release First Quarter Fiscal 2025 Results After Market Close on Wednesday, February 5th, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AUSTIN, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — EZCORP, Inc. (“EZCORP” or the “Company”) , a leading provider of pawn transactions in the United States and Latin America, will issue first quarter fiscal 2025 results (period ended December 31, 2024) on Wednesday, February 5th, 2025, after the market close.</p><p class=\"\">The Company will host a webcast and conference call at 9:00 a.m. Eastern time on Thursday, February 6th, 2025, to discuss its results. The presentation slides will be posted to the Investor Relations section of its website after the market close on Wednesday, February 5th, 2025.</p><p class=\"\">Date Thursday, February 6th, 2025</p><p class=\"\">Time: 9:00 a.m. Eastern time</p><p class=\"\">Dial-in registration link: https://register.vevent.com/register/BI86f9072cf4c447ae86954e0a22daa957</p><p class=\"\">Live webcast registration link: https://edge.media-server.com/mmc/p/j568nkgu</p><p class=\"\">A replay of the conference call will be available online at http://investors.ezcorp.com shortly after the live call concludes. If you have any difficulty accessing the conference call, please contact Elevate IR at EZPW@elevate-ir.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About EZCORP</strong></p><p class=\"\">Formed in 1989, EZCORP has grown into a leading provider of pawn transactions in the United States and Latin America. We also sell pre-owned and recycled merchandise, primarily collateral forfeited from pawn lending operations and merchandise purchased from customers. We are dedicated to satisfying the short-term cash needs of consumers who are both cash and credit constrained, focusing on an industry-leading customer experience. EZCORP is traded on NASDAQ under the symbol EZPW and is a member of the S&amp;P 1000 Index and Nasdaq Composite Index.</p><p class=\"\">Follow EZCORP on social media:</p><p class=\"\">Facebook EZPAWN Official https://www.facebook.com/EZPAWN/</p><p class=\"\">EZCORP Instagram Official https://www.instagram.com/ezcorp_official/</p><p class=\"\">EZPAWN Instagram Official https://www.instagram.com/ezpawnofficial/</p><p class=\"\">EZCORP LinkedIn https://www.linkedin.com/company/ezcorp/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Sean Mansouri, CFA</p><p class=\"\">Elevate IR</p><p class=\"\">EZPW@elevate-ir.com</p><p class=\"\">(720) 330-2829</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX66ZY3f:0-ezcorp-to-release-first-quarter-fiscal-2025-results-after-market-close-on-wednesday-february-5th-2025/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006306_20250204006306:0",
            "title": "Data443 Acquires Breezemail.Ai, Accelerating AI-Powered Email Privacy Capabilities For Microsoft Office And Google GMail >ATDS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006306_20250204006306:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5xNM9m:0",
            "title": "Coquille Tribe Breaks Ground on New Distillery, Heritage Distilling-Branded Tasting Room & Expanded Entertainment Zone at Coos Bay Casino",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EUGENE, Ore., Feb.  04, 2025  (GLOBE NEWSWIRE) — Heritage Distilling Company, Inc. (\"HDC\" or \"Heritage\" or \"The Company\"), a leading craft distiller of innovative premium brands, and the Coquille Indian Tribe of Oregon announced the ground breaking of Oregon’s first Tribally-Owned distillery and tasting room, located at The Mill Casino-Hotel &amp; RV Park on Coos Bay, in North Bend, Oregon. The project broke ground this month and is expected to open to the public by the end of the year. Both Heritage and Coquille-branded spirits will be produced and bottled on Tribal land and sold at the casino’s several bars, restaurants and retail outlets.</p><p class=\"\">“After more than two years of planning, negotiating with the state of Oregon, and completing design work, we are thrilled to have broken ground on this historic project,” said Margaret Simpson, Chief Executive Officer of CEDCO, the Tribe’s venture arm that owns and operates The Mill Casino-Hotel &amp; RV Park. “All members of the team, including Heritage Distilling and fi architecture, have brought forth a design for a customer experience space that will be unparalleled for hundreds of miles in every direction. The completion of this project at The Mill further solidifies our casino and resort as the premier destination in the region.”</p><p class=\"\">The project will feature an updated Plank House restaurant, two indoor digital golf suites and a Heritage-branded tasting room. Spanning two levels and with panoramic views of Coos Bay, the tasting room includes two full-service bars, a cigar lounge, retail space, private event suites and Heritage’s proprietary Cask Club®.</p><p class=\"\">Led by Justin and Jennifer Stiefel since 2011, Heritage is the most-awarded craft distillery in North America by the American Distilling Institute for a decade and is recognized for its brand family of premium whiskies, gins, vodkas, rums and ready-to-drink cocktails. Beyond their mastery of distilling, the Stiefels saw both an injustice done to Native American indigenous communities and a mutually beneficial economic opportunity to create national distribution for Heritage’s portfolio of craft spirits. Together, they established the Tribal Beverage Network (TBN), a first-of-its-kind partnership with Native American Tribes to develop Heritage-branded distilleries, brands and tasting rooms to serve patrons of Tribal casinos and entertainment venues.</p><p class=\"\">Jennifer Stiefel, president and co-founder of Heritage Distilling, added: “We are honored to break ground on this historic project with the Coquille Tribe. This marks a significant milestone for the Tribe, the Tribal Beverage Network and Oregon’s craft spirits industry. The Tribe’s commitment to economic self-sufficiency and innovation aligns perfectly with Heritage Distilling’s mission, and we are proud to stand alongside them in bringing the state’s first Tribally-Owned distillery to life. This is more than a distillery—it’s a long-term economic resource that will support the Tribe for generations to come.”</p><p class=\"\">The distillery will be modeled after Heritage’s industry-leading operations derived from its five distilleries and tasting rooms across Washington and Oregon. As a TBN partner, the Coquille-owned and operated destination will also offer several amenities for patrons including a tasting room that features Heritage spirits like Cocoa Bomb Chocolate Whiskey, Heritage canned cocktails, Florescence Vodka, Stiefel’s Select Single Barrel and small batch whiskeys, and Heritage’s latest Salute Series which honors and supports military and first responder communities.</p><p class=\"\">In addition to on-site tastings, the Coquille distillery will also extend unique membership programs available to TBN partners: The Cask Club®, an annual membership-based program that allows members to create, customize and age spirits of their choice; and The Spirits Club®, a program that provides members quarterly shipments of Heritage’s award-winning spirits delivered directly to their door at a reduced rate, as well as priority access to new, limited and seasonal releases.</p><p class=\"\">The project designs were conceived by the team at fi architecture in Gig Harbor, Washington, the longtime design partner for all of Heritage Distilling’s retail and TBN locations. Detailed renderings of the project can be found on the fi architecture website here.</p><p class=\"\">TBN members can benefit from wholesale and retail margins and tax capture. In addition, Tribes entering this industry can generate funds to support social and economic initiatives, increase employment, diversify the skillsets of their members and work with Heritage to create their brands to celebrate the unique characteristics of a Tribe or region.</p><p class=\"\">The Coquille Tribe’s announcement follows on the heels of a recent announcement by the Tonto Apache Tribe in Payson, Arizona on its plans to open a Heritage Distilling branded location in partnership with Heritage at the Mazatzal Hotel and Casino’s newest development, Apache Corners. Until recently, an 1834 federal law prohibited anyone from setting up a distillery on Tribal land for manufacturing “ardent spirits.” In large part due to Heritage Distilling Company’s efforts, the antiquated Andrew Jackson-era law was finally repealed by Congress in 2018, paving the way for the Coquille Indian Tribe to pursue distillery operations on Tribal lands.</p><p class=\"\">Heritage has several other Tribes participating in TBN, with partnership announcements planned in line with each Tribe’s development timeline. For more information on Heritage Distilling Company and the Tribal Beverage Network, visit heritagedistilling.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the Coquille Indian Tribe</strong></p><p class=\"\">The Coquille Indian Tribe flourished in Oregon’s southwestern corner for thousands of years, cherishing the bountiful forests, rivers and beaches of a homeland encompassing more than 750,000 acres. In 1954, Congress declared the Coquille Tribe “terminated.” 35 years later the Tribe was formally restored to federal recognition in 1989. Today the Tribe numbers more than 1,100 members and it has regained more than 10,000 acres of ancestral homeland, proudly managing the bulk of it as sustainable forest. The Tribe provides education assistance, health care, elder services and (where needed) housing assistance to its people, while contributing substantially to the surrounding community’s economy. Its various enterprises employ approximately 600 people, and its community fund is the region’s leading local source of charitable grants.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Heritage Distilling Company, Inc.</strong></p><p class=\"\">Heritage is among the premier independent craft distilleries in the United States offering a variety of whiskeys, vodkas, gins, rums and ready-to-drink canned cocktails. Heritage has been North America's most awarded craft distillery by the American Distilling Institute for ten consecutive years out of the more than 2,600 craft producers. Beyond this remarkable achievement, Heritage has also garnered numerous Best of Class, Double Gold, and Gold medals at esteemed national and international spirits competitions. As one of the largest craft spirits producers on the West Coast by revenue, the company is expanding its presence nationwide through a diverse range of sales channels, including wholesale, on-premises venues, e-commerce, and the innovative Tribal Beverage Network (TBN). The TBN initiative, a groundbreaking collaboration with Native American Tribes, focuses on developing Heritage-branded distilleries, unique Tribal brands, and tasting rooms tailored to Tribal communities. By serving patrons of Tribal casinos and entertainment venues, the TBN creates meaningful economic and social benefits for participating Tribes, while providing an additional avenue for Tribes to exercise and strengthen their sovereignty. This unique partnership reflects Heritage’s commitment to innovation, community engagement, and sustainable growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements may be identified by words such as \"aims,\" \"anticipates,\" \"believes,\" \"could,\" \"estimates,\" \"expects,\" \"forecasts,\" \"goal,\" \"intends,\" \"may,\" \"plans,\" \"possible,\" \"potential,\" \"seeks,\" \"will,\" and variations of these words or similar expressions that are intended to identify forward-looking statements. Any such statements in this press release that are not statements of historical fact may be deemed to be forward-looking statements. These forward-looking statements include, without limitation, statements regarding anticipated results or benefits anticipated from the opening and operation of the TBN location mentioned in this press release or any other current or potential TBN location. Any forward-looking statements in this press release are based on Heritage’s current expectations, estimates and projections only as of the date of this release and are subject to a number of risks and uncertainties that could cause actual results to differ materially and adversely from those set forth in or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, the risks of expanding sales and revenue due to the addition of new members of the executive team or new directors to the board. These and other risks concerning Heritage’s programs and operations are described in additional detail in its registration statement on Form S-1, which is on file with the SEC. Heritage explicitly disclaims any obligation to update any forward-looking statements except to the extent required by law.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\">Contacts</td></tr><tr><td>The Mill CasinoMichael LaffeyMlaffey@themillcasino.com(541) 252-8251</td><td>Heritage Distilling Co.InvestorsScott EcksteinHeritage@kcsa.com(212) 896-1210</td></tr><tr><td> </td><td>Heritage Distilling Co.MediaFrancesca DeMauroHeritage@kcsa.com(917) 880-9771</td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5xNM9m:0-coquille-tribe-breaks-ground-on-new-distillery-heritage-distilling-branded-tasting-room-expanded-entertainment-zone-at-coos-bay-casino/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}