{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463407:0",
            "title": "Temenos to Power Aldermore Bank's Small Business Savings Launch",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Temenos  will supply its cloud-based software to help Aldermore Bank introduce new savings notice accounts for small businesses. </p><p class=\"\">The UK-based bank will integrate the Temenos Business &amp; Corporate Enterprise Service to quickly roll out new products and scale operations as needed, according to a Tuesday release from the Swiss banking software company. </p><p class=\"\">After launching the new accounts, Aldermore plans to transfer its existing business savings accounts to the platform to consolidate multiple legacy systems.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463407:0/",
            "pub_date": "2025-02-04 18:06:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0QU:0",
            "title": "Ferragamo shares slide after company parts ways with CEO Gobbetti",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Ferragamo  shares slide more than 5% on Tuesday after the Italian luxury group announced that its chief executive Marco Gobbetti would leave next month after little over three years in charge.</p><p class=\"\">Gobbetti, the former chief of British brand Burberry , had been attempting to turn around the Florentine brand but progress had been slower than hoped.</p><p class=\"\">\"While waiting for more clarity on the new phase of the relaunch, we see potential negative implications in the short term, also considering that the transition phase could also involve the creative team and part of the top management,\" analysts at Italian broker Equita said in their daily note. </p><p class=\"\">They added that Gobbetti's exit could be the consequence of results that fell below expectations and the delay in the brand's revival compared to initial objectives. </p><p class=\"\">Gobbetti joined the group at the beginning of 2022 and promised a quick turnaround. However, last year he warned that hitting turnaround goals could take longer than anticipated.</p><p class=\"\">Briton Maximilian Davis was hired as creative director in 2022 shortly after Gobbetti took charge of the company. </p><p class=\"\">Ferragamo, controlled by the family of late founder Salvatore Ferragamo, said on Monday it had started the search for a new CEO, who will be in charge of \"continuing the activities of brand renewal and heritage enhancement\".    </p><p class=\"\">Shares in Ferragamo were down 4.64% at 0935 GMT. </p><p class=\"\">In the last year, the shares lost around 38% of their value and hit a record low at the beginning of December. </p><p class=\"\">\"We think his departure could potentially be seen as a small positive by the market, as the brand has been underperforming the sector over the past few years,\" analysts at Barclays said. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0QU:0-ferragamo-shares-slide-after-company-parts-ways-with-ceo-gobbetti/",
            "pub_date": "2025-02-04 18:06:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308416:0",
            "title": "Crude Oil Prices Decline as U.S. and China Exchange Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crude oil prices dropped after U.S. tariffs on China took effect and as U.S. President Donald Trump paused tariffs on Canada and Mexico for a month. </p><p class=\"\">Brent crude fell 1.4% to US$74.88/barrel and West Texas Intermediate crude lost 2.1% to US$71.62/b at last look early Tuesday. </p><p class=\"\">U.S. tariffs on China took effect at midday in Asia, resulting in retaliatory levies by China of 15% on U.S. coal and liquefied natural gas and 10% on crude starting Feb. 10, Reuters said in a Tuesday report. </p><p class=\"\">\"China's counter-tariffs on the US may be perceived as a sign of escalation and may reduce the likelihood of a temporary resolution akin to U.S. agreements with Mexico and Canada,\" Reuters quoted IG market strategist Yeap Jun Rong as saying. </p><p class=\"\">Markets are now pricing in potential downside risks to global growth on fears of a trade war between the two countries, the report said. </p><p class=\"\">Still, WTI is not expected to be significantly affected as it can go to other regions easily, Reuters quoted Sparta Commodities senior analyst June Goh as saying.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308416:0/",
            "pub_date": "2025-02-04 18:06:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0NZ:0",
            "title": "European shares decline as trade war fears loom; UBS slides",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">UBS Group falls despite profit beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Vodafone falls as Germany performance worsens</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Infineon rises after better-than-expected Q1, positive guidance</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Diageo falls after withdrawing medium-term goals</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">STOXX down 0.3%</li></ul></span></div><span><p class=\"\">    European shares extended losses on Tuesday, led by financials following UBS's quarterly earnings, as investors grew unsettled over fears of a trade war between top global economies, the U.S. and China. </p><p class=\"\">The pan-European STOXX 600 index  was down 0.3% as of 0940 GMT. The benchmark had logged its biggest single-day drop in more than one month on Monday.</p><p class=\"\">China announced tariffs on some U.S. imports, starting from Feb. 10, in retaliation for Washington's 10% additional levies on Beijing, reigniting concerns about a trade war between the economies.</p><p class=\"\">\"The key driver right now is the trade tariff and just the uncertainty that seems to be coming with it,\" said Fiona Cincotta, senior market analyst at City Index, adding that latest developments will keep the markets \"wary of a full-blown trade war erupting\".</p><p class=\"\">Financial Services index (.SXFP) dropped 1.2%, dragged by a 5.1% fall in UBS Group  despite the Swiss lender beating its fourth-quarter profit forecast. UBS CEO Sergio Ermotti said higher capital requirements in Switzerland would hurt returns for shareholders.</p><p class=\"\">\"Those comments would be sufficient to be able to put a dampener on otherwise upbeat numbers because that's sort of pointing to lower returns going forward,\" City Index's Cincotta said.</p><p class=\"\">Diageo  fell 3.6% after the world's top spirits maker  withdrew its medium-term organic sales growth target as it took steps to try and mitigate the impact of U.S. tariffs on its tequila and Canadian whisky.</p><p class=\"\">The stock brought down the food and beverages index (.SX3P) by 0.9%. The energy index (.SXEP) lost 0.8% as crude prices fell after U.S. tariffs on China took effect.</p><p class=\"\">Telecommunications (.SXKP) fell 0.8% as Vodafone dropped 5.6% after the mobile group reported another deterioration in Germany in its third quarter. The stock was the biggest percentage loser on the UK's FTSE 100 <!-- -->CURRENCYCOM:UK100<!-- -->, which fell 0.3%.</p><p class=\"\">        Embracer  shares fell 43.4% ahead of the gaming group's spin-off by tabletop game publisher Asmodee.</p><p class=\"\">Providing slight relief, U.S. President Donald Trump on Monday agreed to a 30-day pause in 25% tariffs on Mexico and Canada, in return for concessions on border and crime enforcement with the two neighbouring countries.</p><p class=\"\">Trump has also threatened to impose tariffs on the 27-nation European Union, but did not specify when.</p><p class=\"\">Infineon  jumped 9.7% after the German chipmaker beat first-quarter revenue estimates and slightly raised its full-year revenue outlook.</p><p class=\"\">The earnings lifted the technology index (.SX8P) by 0.5%.</p><p class=\"\">Among other stocks, France's BNP Paribas  rose 2.2% after a forecast-beating jump in net income in the fourth quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0NZ:0-european-shares-decline-as-trade-war-fears-loom-ubs-slides/",
            "pub_date": "2025-02-04 18:06:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463403:0",
            "title": "Japan's Mirrorless Camera Sales See Boost in December 2024, Jefferies Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's camera market showed good momentum in December 2024, with strong mirrorless camera sales and modest growth in lens sales, Jefferies said in a Monday research note. </p><p class=\"\">Mirrorless camera shipments rose about 16.8% year over year to 409,000 units, a third consecutive month of double-digit rise, data from the Camera &amp; Imaging Products Association (CIPA) said. </p><p class=\"\">Meanwhile, 35mm lens shipments rose 3.2%, continuing the growth seen in November 2024. </p><p class=\"\">Jefferies said both the mirrorless and interchangeable lens markets will maintain their robust levels even with tempered growth expectations. </p><p class=\"\">Overall digital camera shipment volume rose 14% year over year to 664,000 units, with their value surging 22.5% to 62.2 billion yen, according to the Jefferies note. </p><p class=\"\">For the full 2024, digital camera shipments reached 8.49 million units, a 10% year-over-year rise and the first volume growth in five years, Jefferies said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463403:0/",
            "pub_date": "2025-02-04 18:07:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463404:0",
            "title": "Daishi Hokuetsu Financial's Fiscal Nine-Month Profit Rises 13%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Daishi Hokuetsu Financial's  attributable profit rose 13% to 21.2 billion yen in the nine months ended Dec. 31, 2024 from 18.7 billion yen in the year-ago period. </p><p class=\"\">Basic earnings per share at the regional banking group increased to 242.78 yen from 208.73 yen in the previous year, according to a Jan. 31 filing with the Tokyo Stock Exchange. </p><p class=\"\">Ordinary revenue grew 4.1% to 143.4 billion yen from 137.7 billion yen a year earlier. </p><p class=\"\">For fiscal 2025, attributable profit is seen to rise 18% to 25 billion yen or 286.57 yen per share, while ordinary profit is forecast to increase 15% to 35.6 billion yen. </p><p class=\"\">The company is seen to declare a total of 145 yen per share at year-end.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463404:0/",
            "pub_date": "2025-02-04 18:07:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002782:0",
            "title": "Reckitt Benckiser's Portfolio Reshaping Brings Greater Risks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reckitt Benckiser's valuation seems undemanding at first look but the stock is expected to face minimal earnings per share growth until 2027 due to its reshaping of its portfolio, Barclays analysts say after downgrading the stock to equal weight from overweight. The U.K. consumer-goods company's plans to slim down the business makes sense, and the plan to return excess proceeds reflects a clear commitment to shareholder value, they say in a note. Looking ahead, the company's performance in 2027 could be in line with main peers, but Reckitt faces greater execution risks due to its portfolio transformation, they add. Shares are down 1.1% at 52.46 pounds. (michael.susin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002782:0/",
            "pub_date": "2025-02-04 18:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002780:0",
            "title": "Europe Could Be More Vulnerable From Trump Tariffs Than First Thought — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002780:0/",
            "pub_date": "2025-02-04 18:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308414:0",
            "title": "Update: Palantir Technologies Q4 Adjusted Earnings, Sales Rise; Sets Q1 Outlook; Shares Up Premarket",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with the stock move and analyst comments in the headline and the last four paragraphs.)</p><p class=\"\">Palantir Technologies  reported Q4 adjusted earnings late Monday of $0.14 per share, up from $0.08 a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $0.11. </p><p class=\"\">Revenue in the three months ended Dec. 31 rose to $827.5 million from $608.4 million a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $775.8 million. </p><p class=\"\">The company expects Q1 revenue of $858 million to $862 million. Analysts surveyed by FactSet expect $799.6 million. </p><p class=\"\">The company expects full-year revenue between $3.74 billion to $3.76 billion. Analysts polled by FactSet expect $3.50 billion. </p><p class=\"\">Shares of the company jumped more than 17% in premarket activity Tuesday. </p><p class=\"\">\"We are very impressed by these results,\" Mizuho said in a note to clients Monday. But the brokerage added that \"valuation cannot and should not be irrelevant, and we find it exceedingly difficult to justify PLTR's multiple that in our view already discounts significant further acceleration and upside versus consensus expectations.\"</p><p class=\"\">Palantir's shares have \"dramatically\" spiked over the past few months and trade at 56x calendar year 2026 estimated revenue for perhaps \"mid-30s expected growth,\" Mizuho said. </p><p class=\"\">Mizuho reiterated its underperform rating for the shares but \"materially\" raised its price target to $80 from $44 on the \"strong execution and significant upward revisions.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308414:0/",
            "pub_date": "2025-02-04 18:08:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463408:0",
            "title": "Nintendo's Nine Month Profit Falls Nearly 42% Amid Slowing Switch Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nintendo's  attributable profit fell 41.9% to 237.2 billion yen in the fiscal nine months ended Dec. 31, 2024, from about 408 billion yen a year ago due to lower hardware and software sales as the Nintendo Switch platform matures. </p><p class=\"\">The company said basic earnings per share dropped to 203.73 yen from 350.48 yen a year ago, according to a Tokyo Stock Exchange filing on Tuesday. </p><p class=\"\">Net sales declined 31.4% to 956.2 billion yen compared with the previous year's 1.395 trillion yen, which was boosted by The Legend of Zelda: Tears of the Kingdom and The Super Mario Bros. Movie. </p><p class=\"\">The company has revised its full-year earnings forecast downward due to lower-than-expected Switch sales. </p><p class=\"\">It forecasted attributable profit to decline 45% to 270 billion yen or 231.91 yen per share and net sales to decrease 28.8% to 1.19 trillion yen for the fiscal year ending March 31. </p><p class=\"\">The company expects to pay a year-end dividend of 81.00 yen per share, bringing the total payout to 116.00 yen per share for the current year. </p><p class=\"\">Nintendo shares put on more than 2% at market close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463408:0/",
            "pub_date": "2025-02-04 18:08:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002786:0",
            "title": "Palm Oil Ends Lower After Trump Pauses Tariff on Mexico, Canada — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palm oil ended lower after President Trump paused the proposed 25% tariffs on imports from Mexico and Canada. Palm oil prices have risen in recent sessions amid concerns over tariffs on Canadian canola oil as well as an urgent need for alternative vegetable oils, Kenanga Futures says in a research note. Trump's delay of tariff implementations likely triggered profit-taking activities following recent rallies, they say. Meanwhile, ongoing worries about India's declining demand, which is at an 11-year low, could further dampen market sentiment. The Bursa Malaysia Derivatives contract for April delivery ended 63 ringgit lower at 4,304 ringgit a ton. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002786:0/",
            "pub_date": "2025-02-04 18:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002789:0",
            "title": "AMC Entertainment Raised to Neutral From Sell by Roth MKM",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(10:09 GMT) </strong>AMC Entertainment Price Target Cut to $3.25/Share From $4.00 by Roth MKM</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002789:0/",
            "pub_date": "2025-02-04 18:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0FR:0",
            "title": "Singamas Container Sees Profit Attributable For Year Of Not Less Than $30 Mln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singamas Container Holdings Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES PROFIT ATTRIBUTABLE FOR YEAR NOT LESS THAN US$30 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">EXPECTED RESULT DUE TO RISE IN DEMAND FOR DRY FREIGHT CONTAINERS FROM RED SEA CRISIS, OTHERS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0FR:0-singamas-container-sees-profit-attributable-for-year-of-not-less-than-30-mln/",
            "pub_date": "2025-02-04 18:09:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446526:0",
            "title": "UK 10-Year Gilt Yield Up from 7-Week Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UK’s 10-year gilt yield rose above 4.5%, rebounding from a seven-week low after Mexico and Canada delayed planned US tariffs by a month.</p><p class=\"\">Earlier concerns over tariffs on these countries and potential levies on the EU had pushed UK yield to as low as 4.442%.</p><p class=\"\">Trade tensions remain high as China retaliated with tariffs on US goods and launched an investigation into Google following Trump’s 10% tariff on Chinese imports, reigniting fears of a deepening trade war.</p><p class=\"\">Amid market uncertainty, investors increasingly expect the Bank of England to cut rates multiple times this year to support the economy.</p><p class=\"\">Futures now price in 81 basis points of BoE rate cuts by December, with a 95% chance of a 25bps cut to 4.5% at the upcoming meeting.</p><p class=\"\">Meanwhile, the Federal Reserve kept rates unchanged last week, signaling caution on future cuts, while the European Central Bank lowered rates by 25bps and hinted at further easing if needed.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446526:0-uk-10-year-gilt-yield-up-from-7-week-low/",
            "pub_date": "2025-02-04 18:01:52",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463398:0",
            "title": "Nippon Densetsu Kogyo's Fiscal Nine-Month Profit Jumps 15%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nippon Densetsu Kogyo's  attributable profit rose 15% to 2.89 billion yen in the nine months ended Dec. 31, 2024, from 2.52 billion yen in the year-ago period. </p><p class=\"\">Basic earnings per share at the construction company increased to 49.02 yen from 40.96 yen in the previous year, according to a Jan. 31 filing with the Tokyo Stock Exchange. </p><p class=\"\">Net sales grew 6.4% to 125 billion yen from 117.5 billion yen a year earlier. </p><p class=\"\">For fiscal 2025, attributable profit is seen to rise 4.6% to 10.5 billion yen or 178.05 yen per share, while revenue is forecast to increase 5.7% to 205.2 billion yen. </p><p class=\"\">The company is seen to declare a total of 50 yen per share at year-end.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463398:0/",
            "pub_date": "2025-02-04 18:01:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1DM:0",
            "title": "Sterling Tools Dec-Quarter Consol Net Profit 136 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sterling Tools Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET PROFIT 136 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 2.61 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1DM:0-sterling-tools-dec-quarter-consol-net-profit-136-mln-rupees/",
            "pub_date": "2025-02-04 18:02:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463402:0",
            "title": "Coro Energy Conditionally Raises Capital via Retail Offer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coro Energy  conditionally raised 126,009 pounds sterling through a retail offer, according to a Tuesday filing. </p><p class=\"\">The UK-based energy company will issue 8,400,616 shares at 0.015 pound apiece. Net proceeds will be used to repay an existing convertible loan, develop a pipeline of renewable energy projects, and finance general and administrative expenses related to the Duyung PSC project. </p><p class=\"\">The offer is conditional on shareholder resolution to be passed at a general meeting on Wednesday and trading of the issued shares on the London bourse's AIM segment, anticipated on Friday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463402:0/",
            "pub_date": "2025-02-04 18:02:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0BU:0",
            "title": "COMMENT-There are good reasons to be long USD in February",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FX traders expecting U.S. dollar gains this month can take comfort from seasonal trends, which are corroborated by technical factors. The market remains positioned for a rise.</p><p class=\"\">An analysis of the dollar's February performance since 2000 shows it has risen in 16 of the past 25 years, including the last eight years in a row.</p><p class=\"\">The USD index, which tracks the greenback against a basket of six major currencies, failed in recent weeks to hold the break under the 107.805 Fibo, a 23.6% retrace of the 100.150 to 110.170 (September to January) rise. That is a likely bear trap, set when a market breaks below a technical level but subsequently reverses, which is usually a bullish sign. Especially as the 14-week momentum reading is positive.</p><p class=\"\">The speculative long position - derived from net contracts of International Monetary Market speculators in the euro, yen, pound, Swiss franc, Canadian and Australian dollars - remains steadfast. For the week ending Jan. 28, the value of net positions held by speculators edged higher to $31.13 billion long from $30.73 billion a week earlier.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:784.4327176781002px;aspect-ratio:1.3073878627968336\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-3d7012da782dcdaa7c0546246650b5d1-resized.webp\" type=\"images/webp\"/><img alt=\".\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-3d7012da782dcdaa7c0546246650b5d1-resized.jpeg\" style=\"background-color:#fbf4e7\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Seasonality Chart</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1116.4705882352941px;aspect-ratio:1.8607843137254902\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-c7650c46bf4306c29a0cb1372cc28403-resized.webp\" type=\"images/webp\"/><img alt=\".\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-c7650c46bf4306c29a0cb1372cc28403-resized.jpeg\" style=\"background-color:#1c202b\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Weekly Chart</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:846.9200524246396px;aspect-ratio:1.4115334207077326\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-8c7515bc84ef85fbaff0196346a950cf-resized.webp\" type=\"images/webp\"/><img alt=\".\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-8c7515bc84ef85fbaff0196346a950cf-resized.jpeg\" style=\"background-color:#ddf2f9\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Speculative Dollar Chart</span></figcaption></figure></span></p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0BU:0-comment-there-are-good-reasons-to-be-long-usd-in-february/",
            "pub_date": "2025-02-04 18:02:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463387:0",
            "title": "Fuji Media Sees Leadership Changes Amid Major Shareholder Dalton's Push for Reform and Hieda's Resignation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dalton Investment urges the board of Fuji Media Holdings  to demand director Hisashi Hieda's resignation from both the group and subsidiary Fuji Television Network (Fuji TV) due to poor governance. </p><p class=\"\">Despite Fuji Media's Prime Market listing, the governance of both Fuji Media and Fuji TV is \"completely dysfunctional\", according to the investment arm's statement on Monday. </p><p class=\"\">Dalton said while it supports the establishment of a Management Reform Committee of outside directors, the directors must insist on Hieda's resignation and \"all the other directors appointed by him\" to safeguard shareholder value. </p><p class=\"\">In a separate Monday filing, Fuji Media said chairman Shuji Kanoh and Director Koichi Minato have resigned from their positions at FMH and Fuji TV, effective immediately. </p><p class=\"\">Kenji Shimizu has been appointed as President and Representative Director of Fuji TV, effective Jan. 28. </p><p class=\"\">Both Fuji Media and Fuji TV will cooperate with a third-party investigation and are committed to fair management and regaining stakeholder trust.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463387:0/",
            "pub_date": "2025-02-04 18:03:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0RB:0",
            "title": "From Johnnie Walker to Corona beer, major alcohol firms could face tariff hit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Makers of alcoholic beverages such as Johnnie Walker whisky and Corona beer could be caught in the crosshairs of a potential trade war after U.S. President Donald Trump imposed sweeping new tariffs on goods from Mexico, Canada and China.</p><p class=\"\">Although Trump agreed to a 30-day pause on the tariffs on Canada and Mexico on Monday, the U.S. went ahead with the 10% levy on Chinese imports on Tuesday, prompting swift tit-for-tat tariffs from the country.</p><p class=\"\">Canada and Mexico had both initially announced retaliatory tariffs had Trump gone ahead with 25% tariffs on their imports.</p><p class=\"\">Here is a list of global beverage companies likely to see an impact:</p><p class=\"\">DIAGEO  </p><p class=\"\">The British beverage company, known for brands such as Johnnie Walker and Smirnoff vodka, withdrew its medium-term organic sales growth target on Tuesday as it took steps to try and mitigate the impact of U.S. tariffs.</p><p class=\"\">Diageo expects a gross impact of around $200 million on operating profit for the current financial year, mostly from tequila, if tariffs are implemented from March 1.</p><p class=\"\">The company has about 46% exposure to imports from Mexico and Canada, according to a Jefferies note. It has end-to-end tequila production is in Mexico. </p><p class=\"\">PERNOD RICARD SA </p><p class=\"\">The French company, which produces well-known spirits such as Absolut Vodka and Jameson Irish Whiskey, has production sites in Canada, Mexico and China with about 6.3% of sales from Mexico and Canada imports, according to Jefferies.</p><p class=\"\">Affected brands include Codigo 1530 tequila and Jefferson's bourbon whiskey. </p><p class=\"\">CAMPARI </p><p class=\"\">The company, whose products include the popular Aperol aperitif, faces reasonable risk as tequila sold in the U.S. accounts for 7% of group sales and has been a key driver to its performance in the country, according to J.P. Morgan.</p><p class=\"\">Campari has a production facility in Canada, and its facility in Mexico produces spirits brands like Gran Centenario and Espolon, according to its website.  </p><p class=\"\">ANHEUSER-BUSCH INBEV </p><p class=\"\">Budweiser and Stella Artois owner AB InBev could see growth in its market share at the cost of its peers since a major portion of its portfolio is sourced from within the U.S., according to J.P. Morgan.</p><p class=\"\">However, the brokerage noted that a significant percentage of its earnings before interest and tax (EBIT) comes from Mexico, which could be impacted by tariffs, weakening demand for some of its products.</p><p class=\"\">BROWN-FORMAN </p><p class=\"\">The American spirits company, which produces Jack Daniel's Tennessee Whiskey, faces tariffs on its tequila portfolio in Mexico, accounting for a mid-single digit percentage of U.S. sales, according to J.P. Morgan.</p><p class=\"\">Brown-Froman is also subject to retaliatory tariffs from Canada and Mexico, which will weigh on its American whiskey portfolio, including its flagship brand Jack Daniel's.    </p><p class=\"\">Canada and Mexico make up 1% and 7% of its 2024 total sales, according to the company's 2024 annual report.</p><p class=\"\">CONSTELLATION BRANDS  </p><p class=\"\">The Corona and Modelo Especial beer maker has a total production capacity of about 48 million hectoliters in Mexico, which is anticipated to rise to about 65 million hectoliters by fiscal 2028, according to the latest annual report for the year ending February 2024</p><p class=\"\">J.P. Morgan noted that about 85% of Constellation Brands' consolidated sales are derived from Mexican beer and could potentially see a mid-20's percentage impact to earnings per share if no pricing or cost savings initiatives is taken.     </p><p class=\"\">MOLSON COORS BEVERAGE  </p><p class=\"\">Miller Lite maker Molson Coors has exposure to tariffs through Molson Canadian, although J.P. Morgan believes the impact would be \"de minimis.\" </p><p class=\"\">The brokerage added that Canada's retaliatory tariff impact on American beer would be limited too as the company produces Coors Light and Miller Lite locally in Canadian breweries. </p><p class=\"\">HEINEKEN  </p><p class=\"\">Dutch brewer Heineken could see some modest impact as Mexican imports for the company are around low-single digit percentage of the group's sales, according to Jefferies. </p><p class=\"\">BECLE </p><p class=\"\">Jose Cuervo owner Becle, a Mexican-based company and one of the world's biggest tequila maker, along with Diageo, dominates the U.S. market for the agave-based drinks and rely heavily on tequila sales in the U.S. for growth.</p><p class=\"\">Becle's U.S. shipments of eight tequila or mezcal brands had a sales value of almost $1.6 billion, according to a Reuters analysis.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0RB:0-from-johnnie-walker-to-corona-beer-major-alcohol-firms-could-face-tariff-hit/",
            "pub_date": "2025-02-04 18:04:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002759:0",
            "title": "Market Talk Roundup: Latest on U.S. Politics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering U.S. politics. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0505 ET - The dollar could suffer a further pullback if the U.S. and China move towards a de-escalation in their trade dispute, ING analyst Francesco Pesole says in a note. A new 10% U.S. tariff on China took effect Tuesday and China has announced retaliatory tariffs. Markets seem to price in a good chance of the U.S. and China striking a deal and delaying tariffs after Trump agreed to pause planned 25% tariffs on Canada and Mexico. However, the case for significant dollar depreciation is weak as the tariff threat remains, Pesole says. Trump has \"more concretely introduced the tariff threat into daily market news.\" The DXY dollar index falls 0.5% to 108.484. (renae.dyer@wsj.com)</p><p class=\"\">0457 ET - U.S. tariffs are likely to end up not as bad as markets had feared, says Jefferies' Mohit Kumar in a note. Jefferies is therefore positive on risky assets over a 3-month to 6-month horizon. The macroeconomic backdrop remains supportive and positioning is light, the global economist says. That said, the coming days are likely to be dominated by headlines around negotiations with China, while Europe is likely the next in the tariffs and negotiations story, he says. (emese.bartha@wsj.com)</p><p class=\"\">0448 ET - Sterling falls on the day but remains comfortably above Monday's lows against the dollar when U.S. President Trump's tariffs on Canada and Mexico--which he later agreed to pause--unsettled markets. ING analyst Francesco Pesole says any sterling losses should be limited because tariffs shouldn't unduly harm the U.K. economy. Exports to the U.S. are less than 2% of gross domestic product, while Trump \"seems in no rush to hit the U.K. with tariffs,\" he says in a note. U.K. Prime Minister Keir Starmer's trip to Brussels to discuss security and defence is positive for sterling as it signals intent to repair EU relations, he says. Sterling falls 0.3% to $1.2409, still well above Monday's low of $1.2248. EUR/GBP rises 0.1% to 0.8322. (renae.dyer@wsj.com)</p><p class=\"\">0432 ET - Beiersdorf's sales in the U.S. are expected to be hit by Trump's tariff proposals should they come into force, as about two-thirds of the sales in the country are sourced from or manufactured in other countries, a company spokesperson says. The owner of Nivea skincare products is monitoring the international backdrop as it plans potential measures to \"adapt to new developments\", the spokesperson adds, without disclosing further details. \"The U.S. market remains a strategic growth market for Beiersdorf, which we intend to expand further in the coming years. We have already invested in the U.S. market in recent years and continue to build on this\". Beiersdorf's sales in North America in 2023 represented nearly 13% of its total sales. Shares are down 1.2% and more than 10% over a 52-week period. (michael.susin@wsj.com)</p><p class=\"\">0426 ET - Gold futures slide as Canada and Mexico came to a last-minute deal with the U.S. Futures are down 0.5% at $2,842.30 a troy ounce, but remain elevated, having hit a record high of $2,872 an ounce in the prior session. Gold prices are correcting after the countries made a deal that will postpone U.S. tariffs by at least a month, ING analysts say in a note. However, the uncertainty over trade and tariffs continue to keep the price relatively well supported, they say. Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING says. Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING says. (joseph.hoppe@wsj.com)</p><p class=\"\">0408 ET - The yields on U.K. government bonds, or gilts, rise, tracking moves in their U.S. and eurozone counterparts after U.S. President Trump paused tariffs on Canada and Mexico for a month, sparking a shift away from safe-haven bonds for now. Tariffs remain a risk and investors are concerned about the harm this could do to the U.K. economy, dampening growth while lifting inflation, Pantheon Macroeconomics economists say in a note. \"We think President Trump's tariffs, by fracturing supply chains, will be stagflationary for the U.K.\" Tariffs could potentially mean fewer interest-rate cuts by the Bank of England as inflation rebounds, the economists say. The 10-year gilt yield climbs 4 basis points to last trade at 4.520%, Tradeweb data show. (miriam.mukuru@wsj.com)</p><p class=\"\">0359 ET - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">0349 ET - U.K. investors are on edge as trade jitters continue, Hargreaves Lansdown's Matt Britzman writes. Trade tensions are dictating the market mood, especially in Europe where U.S. President Trump keeps the continent guessing with lingering threats, the senior equity analyst writes. With volatility set to remain, there may be chances for investors to cash in on market overreactions, especially if Trump's tariff threats are a bluff, the analyst says. The U.K.'s FTSE 100 trades down 0.4%. (adam.whittaker@wsj.com)</p><p class=\"\">0343 ET - The euro remains under pressure as tariff risks remain heightened even after President Trump agreed to pause tariffs on Canada and Mexico, Danske Bank analyst Stefan Mellin says in a note. Tariff headlines will likely remain the primary driver of price action in the coming weeks, with a risk of Trump announcing measures against Europe, he says. Still, Trump looks to be using tariff announcements \"primarily as a negotiating tool\" and this could help the euro to recover back into a $1.04-$1.05 range. \"We believe Trump is ultimately likely to under-deliver on maintaining tariffs for an extended period,\" Mellin says. The euro falls 0.2% on the day to $1.0323. It hit a three-week low of $1.0213 Monday, according to FactSet. (renae.dyer@wsj.com)</p><p class=\"\">0254 ET - Eurozone 10-year government bond yields edge higher, tracking U.S. Treasury yields after the latest twist in President Trump's tariff policy. Trump agreed to postpone the tariffs on Mexico and Canada for a month after talks with the leaders of both countries. Ten-year eurozone bond yields rise about 3 basis points across the board, with the Bund yield up at 2.417%, according to Tradeweb. Eurozone rates are likely to continue to be sensitive to growth risks, ING's Padhraic Garvey and Michiel Tukker say in a note. \"Especially the front end may find itself even lower in the near term,\" the rates strategists say. (emese.bartha@wsj.com)</p><p class=\"\">0231 ET - The FTSE 100 is expected to open 14 points lower, or 0.2%, according to IG. The index closed down 90 points, or 1%, to 8583 points on Monday. U.S. President Trump on Monday agreed to postpone his threatened 25% tariffs on Canada and Mexico following talks with the leaders of the two countries. However, a new 10% tariff on China took effect Tuesday. China has retaliated with new tariffs on select U.S. imports and said it was opening an antitrust probe into Google. \"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies economist Mohit Kumar says in a note. \"Our view remains that eventually tariffs will end up not as bad as feared.\" (renae.dyer@wsj.com)</p><p class=\"\">0133 ET - China's retaliation to Trump's tariffs doesn't seem aggressive, says Zhiwei Zhang, president and chief economist at Pinpoint Asset Management. Beijing's measures only target some U.S. products, whereas the U.S. tariffs apply to all Chinese exports to the country, says Zhang. \"This is likely only the beginning of a long process for the two countries to negotiate,\" the economist says. The negotiations between the U.S. and its neighbors suggest that there is some hope of de-escalation at some point, though the road ahead is likely to be bumpy, Zhang says. Washington postponed tariffs on Canada and Mexico after reaching border-related deals. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002759:0/",
            "pub_date": "2025-02-04 18:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002756:0",
            "title": "Dollar Could Fall Further if U.S.-China Trade Dispute Eases — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The dollar could suffer a further pullback if the U.S. and China move towards a de-escalation in their trade dispute, ING analyst Francesco Pesole says in a note. A new 10% U.S. tariff on China took effect Tuesday and China has announced retaliatory tariffs. Markets seem to price in a good chance of the U.S. and China striking a deal and delaying tariffs after Trump agreed to pause planned 25% tariffs on Canada and Mexico. However, the case for significant dollar depreciation is weak as the tariff threat remains, Pesole says. Trump has \"more concretely introduced the tariff threat into daily market news.\" The DXY dollar index falls 0.5% to 108.484. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002756:0/",
            "pub_date": "2025-02-04 18:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0PN:0",
            "title": "Unicaja shares rise, Jefferies says 2025-27 targets imply upside to consensus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Unicaja  rise more than 5% as the Spanish bank's 2025-2027 strategic plan implies a \"backend-loaded upside\" to consensus, according to Jefferies</p><p class=\"\">** \"Newly presented 2025-2027 strategic targets imply c150m EUR upside to cumulative net profits over the 3-year period and &gt;350m EUR upside to cumulative capital returns over the period,\" Jefferies says</p><p class=\"\">** This year's outlook, however, is in line with consensus, the analysts add</p><p class=\"\">** Unicaja's NII dips 0.8% in Q4 vs Q3, but comes above market expectations</p><p class=\"\">** Q4 profit misses expectations, but Jefferies notes this includes a one-off cost related to restructuring; adjusted for this, the profit would have been a 15% beat, the broker adds</p><p class=\"\">** If the gains hold, the Unicaja shares will see their best day since early February 2024</p><p class=\"\">** Including Tuesday's rise, the stock has gained around 14% YTD​</p><p class=\"\">($1 = 0.9675 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0PN:0-unicaja-shares-rise-jefferies-says-2025-27-targets-imply-upside-to-consensus/",
            "pub_date": "2025-02-04 18:05:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0QQ:0",
            "title": "Rupee ends higher tracking peers, US-China trade tensions in focus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Indian rupee ended higher in a choppy trading session on Tuesday, mirroring gains in regional currencies, but concerns over an escalating U.S.-China trade war kept investors on edge.</p><p class=\"\">The rupee  ended at 87.0675 against the U.S. dollar, against a record closing low of 87.1850 in the previous session, when it also fell to an all-time low of 87.28.</p><p class=\"\">Most Asian currencies rose amid the ongoing tit-for-tat escalation of a global trade war between the world's two largest economies, the U.S. and China.</p><p class=\"\">China retaliated with a package of tariffs on a range of U.S. products in an immediate response to a 10% tariff on Chinese imports announced by U.S. President Donald Trump.</p><p class=\"\">Trump's press secretary said the president would speak with Chinese President Xi Jinping in the next couple of days.</p><p class=\"\">Meanwhile, Trump delayed 25% tariffs against Mexico and Canada, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighbouring countries.</p><p class=\"\">\"The tit-for-tat tariff regime has left investors cautious, with concerns that the potential for a protracted tariff war could stoke inflationary pressures in the U.S.,\" said Jigar Trivedi, a senior analyst at Reliance Securities.</p><p class=\"\">Trivedi expects the rupee to fall to 87.30 as the trade war adds to market volatility.</p><p class=\"\">The dollar index , having rallied to nearly 110 on Monday, pulled back sharply to 108.48 on the day. </p><p class=\"\">The offshore Chinese yuan  recovered to 7.29 to the U.S. dollar.</p><p class=\"\">From now on, markets could handle tariff threats even more cautiously, but \"a new layer of unpredictability\" argues against big dollar depreciation for now, ING Bank said in a note.</p><p class=\"\">\"...markets need to follow a rationale, and we think the conclusion is that Trump is ready to bluff his way into transactional victories, whether on border security or trade,\" the bank said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0QQ:0-rupee-ends-higher-tracking-peers-us-china-trade-tensions-in-focus/",
            "pub_date": "2025-02-04 18:05:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463406:0",
            "title": "Great Southern Copper Extends Copper Mineralization at Chile Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Great Southern Copper  said Tuesday the first phase diamond drilling program at the Mostaza mine in its Cerro Negro project in Chile confirmed visible copper, silver, and gold mineralization. </p><p class=\"\">The program verified the width of mineralization reported in historical drill holes, confirmed mineralization extending at depth and along the strike of historical holes below the mine, and proved the extension of copper mineralization along a trend to the south of the mine, according to Chief Executive Officer Sam Garrett. </p><p class=\"\">The British mineral exploration company added that samples from the holes were sent to the ALS laboratories for assay results.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463406:0/",
            "pub_date": "2025-02-04 18:05:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463311:0",
            "title": "Exports Propel January Factory Boom in India: PMI Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Boosted by a robust upturn in exports, India's manufacturers in January enjoyed strong order growth, expanded production and ramped up hiring, reported S&amp;P Global on Monday. </p><p class=\"\">The seasonally adjusted India manufacturing purchasing managers index (PMI) for January rose to 57.7 from 56.4 in December, rising further above the 50-marker that separates growth from contraction, said S&amp;P Global, citing its own monthly survey. </p><p class=\"\">\"International demand for Indian goods strengthened in January, with panelists noting gains from across the globe. Notably, the rate of expansion in new export orders was the best seen in just under 14 years,\" advised S&amp;P Global. </p><p class=\"\">Domestic demand in India in January was also strong, provoking manufacturers to go on on a hiring spree: \"The extent to which employment expanded was the greatest seen in nearly 20 years of data collection,\" explained S&amp;P Global. </p><p class=\"\">In additional good news for India's factory managers, input cost inflation was tempered in January. \"Input costs increased in January, amid reports of greater outlays on freight, labor and materials. The rate of inflation was modest overall and the weakest since February 2024, however,\" said S&amp;P Global</p><p class=\"\">India's manufacturers were optimistic in January. Looking ahead, a scant 1% of India factory managers expected to decrease production in the next 12 months, while 32% forecast expansion, according to the PMI survey. </p><p class=\"\">The India manufacturing PMI for January was compiled by S&amp;P Global surveys sent to 400 manufacturers from January 8 through January 27.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463311:0/",
            "pub_date": "2025-02-04 18:05:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OU0OX:0",
            "title": "PREVIEW: Merck earnings, revenue expected to rise in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Merck  shares up 1.1% at $99.94 ahead of Q4 results due before the opening bell on Tues</p><p class=\"\">** Last Thurs, co said it plans to stop a late-stage study testing its pulmonary arterial hypertension (PAH) drug ahead of time based on strong efficacy data</p><p class=\"\">** Analysts on avg expect Merck to post adj EPS of $1.62 on revenue of $15.49 bln, per LSEG data, vs yr-ago results of 3 cents/sh and $14.63 bln in revenue</p><p class=\"\">** Merck has met or beaten EPS and revenue expectations for at least the past eight quarters</p><p class=\"\">** Of the 28 analysts that cover Merck, the breakdown of recommendations is 19 \"strong buy\" or \"buy,\" 9 \"hold\"</p><p class=\"\">** Median price target of $121.66 is down from $130 a month ago</p><p class=\"\">** MRK shares up 0.5% YTD stock performance vs 4.6% YTD gain in Dow Industrials  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OU0OX:0-preview-merck-earnings-revenue-expected-to-rise-in-q4/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002722:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">China Retaliates With Levies, Antitrust Probe Into Google</strong></p><p class=\"\">The actions include 15% tariffs on U.S. coal and liquefied natural gas imports, as well as raising levies on crude oil, agricultural machinery and certain vehicles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Asia Markets Jittery as Traders Gauge First Trade War Salvos</strong></p><p class=\"\">Markets across Asia began the day with a relief rally after the U.S. struck last-minute deals with Mexico and Canada to delay tariffs, but the mood took a turn when China hit back with new tariffs on the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Pauses Tariffs on Mexico, Canada. China Levies Are Still Happening-for Now.</strong></p><p class=\"\">Tariffs on Canada and China are still going ahead for now.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</strong></p><p class=\"\">The department said it began the year with more cash on hand than planned.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump's threatened tariffs might not hit clothing retailers much now, but analysts warn price increases could backfire</strong></p><p class=\"\">Lots of clothes on store shelves could get a bit more expensive if new tariffs announced by President Donald Trump over the weekend eventually take hold. But after three years of price increases and higher costs of living, some Wall Street analysts say shoppers might be too worn out to buy any of it.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</strong></p><p class=\"\">Manufacturers anticipate higher costs for steel and aluminum would arise from Trump administration tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Futures Set New Record on Safe-Haven Demand</strong></p><p class=\"\">Gold futures set a fresh record in volatile trading as traders digested U.S. President Trump's tariff plans.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed interest-rate cuts might not come anytime soon, two top officials say</strong></p><p class=\"\">Two senior Federal Reserve officials said Monday that they are in no rush to cut interest rates further given the uncertainty surrounding the U.S. economic outlook and the White House's new policies, including tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002722:0/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002721:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Offer Price for Fuji Soft in Bid to End Takeover Battle</strong></p><p class=\"\">The U.S. investment company bought a more than one-third stake in Fuji Soft in November and has said it is best positioned to work with the company to take it private.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS to Boost Buybacks as Net Profit Beats Expectations</strong></p><p class=\"\">The group plans to repurchase $1 billion of its stock in the first half and buy back up to an additional $2 billion in the second.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BNP Paribas Earnings Grow; Raises Dividend</strong></p><p class=\"\">The French lender intends to buy back more than 1 billion euros worth of shares after posting an earnings rise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tequila has to be made in Mexico. Diageo offers no financial outlook on tariff uncertainty.</strong></p><p class=\"\">The maker of Don Julio tequila and Crown Royal whisky said on Tuesday it can't provide financial guidance because of the uncertainty over tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nintendo Cuts Earnings, Switch Sales Guidance</strong></p><p class=\"\">The Japanese videogame maker said Tuesday that net profit dropped 42% from a year earlier to 237.19 billion yen, for the nine-month period.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apple escaped tariffs last time. This time, it may have to raise prices.</strong></p><p class=\"\">Apple was one of the luckier consumer-electronics companies when it got exemptions on the tariffs imposed by the first Trump administration on many goods made in China. But this time, it might not be quite as fortunate.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Alphabet Earnings Could Provide Answers on AI and Cloud Concerns</strong></p><p class=\"\">Analysts surveyed by FactSet expect Alphabet to report a jump in earnings and revenue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ADM's Outlook Is a Worry. Earnings Are Today.</strong></p><p class=\"\">Last week, the chip maker's rival, Intel,gave a softer-than-expected forecast for its March quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Big Endeavor Group Holders Likely to Battle Silver Lake Over Buyout Price, $6 Billion Windfall</strong></p><p class=\"\">Since the $13 billion, take-private deal was unveiled in April 2024, TKO's stock has surged almost 75% to $156.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gardasil Worries Loom as Merck Reports Earnings</strong></p><p class=\"\">Merck shares are down more than 20% over the past 12 months after trouble with sales of its Gardasil vaccine in China</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002721:0/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002715:0",
            "title": "House Republicans Are Split on How Deeply to Cut Federal Spending — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Richard Rubin and Olivia Beavers</p><p class=\"\">WASHINGTON — House Republicans are sharply divided over how much government spending they should cut, and the dispute is slowing their plans to reduce taxes and increase border enforcement.</p><p class=\"\">On one side: Conservatives who see a rare chance to use full Republican government control to scale back programs such as Medicaid, the health-insurance program covering more than 70 million people. At times, they have been seeking trillions of dollars in spending cuts over the next decade and say they want Republicans' major fiscal legislation to reduce budget deficits.</p><p class=\"\">On the other side: Moderates who are wary about blowback from states, hospitals and the GOP's emerging working-class base. They are looking for smaller minimum spending cuts attached to the \"one big beautiful bill\" that President Trump wants to extend expiring tax cuts, pay for his immigration restrictions and boost the military.</p><p class=\"\">Party leaders are stuck in the middle. Because of the party's tiny House majority, they must keep virtually all House Republicans together on a budget blueprint and a subsequent detailed bill. One early proposal circulating among lawmakers and lobbyists lays out about $300 billion in spending cuts and a roughly equal amount in spending increases. Under that approach, Trump's 2017 tax cuts — $4 trillion or more over a decade — could potentially be extended without accompanying spending cuts.</p><p class=\"\">House Republicans must resolve or postpone the fight before taking the first major step forward — a Budget Committee vote on a resolution setting minimum spending cuts and a maximum deficit increase for Trump's big bill. Even though the ultimate bill could produce smaller deficits than the maximum set in the budget, this moment is an important leverage point in setting the terms for the year's debate. Some Republicans pushed back against that early blueprint, and they haven't reached agreement among themselves yet.</p><p class=\"\">Congress is moving on a different track than the Trump administration's Department of Government Efficiency. The effort led by billionaire Elon Musk has targeted some spending, and canceled contracts and employee resignations might reduce agencies' costs. But the real money is in the federal programs that provide incomes and healthcare for low-income households and retirees. and changing those requires Congress.</p><p class=\"\">House Speaker Mike Johnson (R., La.) had said a budget vote would happen this week, but aides said late Monday that the committee wouldn't act this week. It is the first public slippage in the party's aggressive schedule.</p><p class=\"\">House Republicans \"are working right now to negotiate what that looks like,\" Johnson said on Fox News. \"We don't want to blow a hole in the deficit by extending the Trump-era tax cuts, for example, but we're definitely going to get that extended. So, we got to find those savings, \" he said.</p><p class=\"\">The budget resolution is the crucial first step in the process that lets Republicans get their fiscal agenda through Congress without needing Democratic votes. The process, called budget reconciliation, allows lawmakers to bypass the usual 60-vote filibuster threshold in the Senate.</p><p class=\"\">\"It's always going to be a battle, but that's fine,\" said Rep. Ralph Norman (R., S.C.), a member of the conservative Freedom Caucus, who also sits on the Budget Committee and is pushing for deep cuts. \"Shoot for the stars, and if you have to come down, that's fine. Don't shoot at the lowest number and then expect to go up.\"</p><p class=\"\">Brutal math</p><p class=\"\">Over the next decade, the U.S. government is projected to collect $67.5 trillion in taxes and spend $89.3 trillion, sending publicly held debt as a share of gross domestic product to record levels. Republicans say they want to start closing the gap. But the math is brutal.</p><p class=\"\">Extending Trump's expiring tax cuts and adding his new ideas — like no tax on tips — would subtract more than $5 trillion from revenue. Agency spending and Social Security are generally outside the bounds of one-party reconciliation bills. Paying interest on the debt isn't optional, and Trump also has taken Medicare largely off the table.</p><p class=\"\">With those categories protected, that leaves about $16 trillion in spending that could be eyed for cuts. About half of that is Medicaid, the healthcare program largely for low-income people that is largely run by states.</p><p class=\"\">Republicans have floated several ideas to lower Medicaid's costs. One would lower the minimum share of a state's costs that the federal government pays, a change that could affect states including California and New York. Another possible change would prevent states from imposing taxes on Medicaid providers in ways that raise federal reimbursements. Republicans might also consider creating work requirements for able-bodied Medicaid recipients.</p><p class=\"\">\"Every member of Congress represents a state with a governor and state legislators who will absolutely pressure them to essentially not dump the budget deficit on states,\" said Brian Riedl, a former Senate GOP aide now at the Manhattan Institute.</p><p class=\"\">Riedl said he was dubious Republicans could make trillions of dollars of spending cuts, especially with a House majority of 220-215 at most. \"There is more overlap with Democrats on the tax-cut extensions than there is unanimity about cutting trillions,\" he said.</p><p class=\"\">Centrist Republicans worry that steep cuts could cost the party voters in the 2026 election.</p><p class=\"\">\"If you cut Medicaid, you're, like, pissing off the people who put you in office — who Trump resonates with, right?\" said one House Republican. \"So you got to be careful about how you do it, if you do it.\"</p><p class=\"\">'Different pain thresholds'</p><p class=\"\">Another House Republican recalled a colleague standing up during the GOP's recent Florida retreat and arguing, to applause, that they didn't want to let the tax-writing Ways and Means Committee expand budget deficits.</p><p class=\"\">\"There are different views on tax, there's different pain thresholds on spending,\" this lawmaker said. \"So maybe this does fall apart. Maybe this notion that there's going to be an all-Republican thing on tax, maybe it's a bridge too far.\"</p><p class=\"\">Republicans should seek a middle ground, one that makes progress on deficits while preventing tax increases that would occur in 2026 if they do nothing, said Don Schneider, a former House GOP aide now at investment firm Piper Sandler.</p><p class=\"\">The best path, he said, sets a reasonable floor for the size of the spending cuts and relies on Trump's ability to unify the party.</p><p class=\"\">\"He can be the guy that tips the scales in favor of spending cuts but he's going to need to give members the cover to accept these difficult choices,\" Schneider said.</p><p class=\"\">Republicans will look for other ways to claim that their plans reduce deficits without major spending cuts. One way is to point to revenue from Trump's tariffs.</p><p class=\"\">The other is by arguing that the extension of expiring tax cuts doesn't actually cost anything. The Republican Study Committee, a core group of conservative members, said any tax bill must reduce the deficit — but didn't specify whether that was being measured before or after extending $5 trillion in tax cuts.</p><p class=\"\">Ultimately, the important numbers won't be measured in the trillions but in the votes needed to get majorities in the House and Senate.</p><p class=\"\">\"The numbers that I always tell people you have to keep in mind are 218 and 51,\" Senate Majority Leader John Thune (R., S.D.) said on Fox News Radio.</p><p class=\"\">Write to Richard Rubin at richard.rubin@wsj.com and Olivia Beavers at Olivia.Beavers@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002715:0/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}