{
    "data": [
        {
            "id": "DJN_DN20250204014436_20250204014437:0",
            "title": "Nippon Yusen Sees FY Net Y450.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014436_20250204014437:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014426_20250204014430:0",
            "title": "Chiyoda Corp 9-Mos Net Y20.91B Vs Net Y15.69B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014426_20250204014430:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:0fa6a205b094b:0",
            "title": " The lesson of El Salvador’s failed Bitcoin experiment ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Opinion by: Kadan Stadelmann, chief technology officer of Komodo Platform</strong></em></p><p class=\"\">The International Monetary Fund wants to keep you down. Just look toward El Salvador for proof, where President Nayib Bukele abandoned his Bitcoin legal tender revolution in favor of international development loans. The new status quo has been made clear: while nation-states can stack and hold Bitcoin, the people cannot use it as legal tender. Instead, they must remain chained to fiat currency.</p><p class=\"\">The International Monetary Fund (IMF), a financial arm of the United Nations, has long played a significant role in the economic colonization of emerging countries on behalf of a cabal of corporations, banks and the US government. </p><p class=\"\">The IMF’s modus operandi has been to give developing countries development loans for construction and engineering projects. To receive these loans, countries often agree to balance their deficits, squeeze public spending, open their markets and privatize sectors of the economy. And, in the case of El Salvador, kill the Bitcoin Revolution and squash the opposition — Bitcoiners. This is known as “conditionality.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">The IMF says no Bitcoin for you</strong></strong></p><p class=\"\">El Salvador became the world’s first country to make Bitcoin legal tender in 2021. President Bukele gave lip service to the idea that he introduced Bitcoin as a legal tender to free the Salvadoran people from the chains of central banking.</p><p class=\"\">He has said, however, that the adoption of Bitcoin as tender by El Salvador’s Main Street has been slow. Bukele noted that it was the most unpopular measure his government had undertaken. According to a survey conducted by San Salvador University Francisco Gavidia, approximately 92% of Salvadorans did not use Bitcoin in 2023.</p><p class=\"\">It appears the revolution is dead. El Salvador has been forced to scale back its Bitcoin agenda to attract development funds from the IMF, and take a quick step back on its pro-Bitcoin legal framework. To receive a $1.4 billion credit line, Bukele chose to do what the IMF required: revoke his plan for Bitcoin as a national currency. The IMF called it mitigating Bitcoin-related risks.</p><p class=\"\">The development agency forced El Salvador’s government to reduce its Bitcoin purchases and no longer accept tax payments in Bitcoin. Bukele dropped the law requiring businesses to accept Bitcoin. Meanwhile, the IMF said the public sector’s Bitcoin-related activities will be restricted. </p><p class=\"\">Central American countries will also gradually scale back their partnership with Chivo, the Bitcoin e-wallet El Salvador launched in 2021. The plan is to either privatize or shutter Chivo. How many people use the digital wallet is not public. </p><p class=\"\">In 2021, the El Salvador government forked out $200 million to build out Bitcoin infrastructure, including Chivo and Bitcoin ATMs. It also offered $30 of free Bitcoin for those who signed up for the wallet. Most people used the Bitcoin to buy goods or exchanged it for dollars. </p><p class=\"\">Despite the changes to its Bitcoin strategy, El Salvador’s government says it remains dedicated to Bitcoin. It can still stack Bitcoin — look no further than its recent 12 Bitcoin purchase. Stacy Herbert, director of El Salvador’s National Bitcoin Office, said the country would still buy Bitcoin to continue building its strategy Bitcoin reserve. El Salvador will no longer make putting Bitcoin into the hands of the people a priority. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">The IMF vs. Bitcoin</strong></strong></p><p class=\"\">The Salvadoran government made Bitcoin legal tender so that everyday citizens could enjoy the cryptocurrency’s benefits. They could experience holding a sound asset in their hands. They could start to understand the ills that central banks cast upon society. </p><p class=\"\">The IMF disagrees. It has intended to diminish the chances that people discover how sound assets can change the lives of people with low incomes and the disenfranchised.</p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Recent: </strong></em>El Salvador buys another 12 Bitcoin for country’s reserve despite IMF deal</p><p class=\"\">“For the public sector, engagement in bitcoin-related economic activities and transactions in and purchases of Bitcoin will be confined,” the IMF stated. “Transparency, regulation, and supervision of digital assets will be enhanced to safeguard financial stability, consumer and investor protection, and financial integrity.”</p><p class=\"\">When El Salvador made Bitcoin a legal tender in September 2021, the IMF warned of financial and legal risks, which it recently said never materialized. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Bukele’s deal with the devil </strong></strong></p><p class=\"\">It’s nothing new for the IMF to keep the tools of financial liberation out of the hands of the people. Its dominion over under-resourced countries is a through-line of the post-World War II world. </p><p class=\"\">In 2024, the IMF’s colonial practices were met with mass protests in Kenya, which shed light on the predatory nature of the IMF. </p><p class=\"\">The protest called on President William Ruto to strike down an IMF-led bill for austerity and regressive taxes in the nations. </p><p class=\"\">It’s merely another case of the long arm of US colonial power prioritized at the expense of people experiencing poverty in underdeveloped countries. In Kenya and many other nations, the IMF continues pushing austerity measures, often freezing public sector bills. </p><p class=\"\">“This global financial architecture was not established by us, it was not established for us, so it cannot be the financial architecture that will help us today. [...] That is neo-colonial wealth extraction,” Tunisian-American economist Fadhel Kaboub said in an interview outside the IMF counter-summit in Marrakech. </p><p class=\"\">While people in Africa this year stood up to IMF colonization and power over debt, Bukele submitted.</p><p class=\"\">The IMF, functioning as an arm of the UN to homogenize economic policies worldwide, intends to maintain fiat currency dominance. Nation-states can stack, but the IMF’s development help must be contingent on nation-states abandoning any notions of Bitcoin as legal tender. That is the lesson of El Salvador.</p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Opinion by: Kadan Stadelmann, chief technology officer of Komodo Platform</strong></em></p><p class=\"\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:0fa6a205b094b:0-the-lesson-of-el-salvador-s-failed-bitcoin-experiment/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463643:0",
            "title": "Keppel Logs 43% Increase in H2 Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keppel's  profit in the second half of 2024 surged 43.3% to SG$660.3 million from SG$460.6 million a year earlier. </p><p class=\"\">Basic earnings per share came in at SG$0.349, up 42% from SG$0.246 in the comparable period, according to a Wednesday filing with the Singapore Exchange. </p><p class=\"\">Revenue was up nearly 4% year over year to SG$3.38 billion from SG$3.25 billion, mainly due to stable revenue from asset management fees. </p><p class=\"\">Funds under management grew to SG$88 billion in 2024. </p><p class=\"\">The global asset manager proposed a final cash dividend of SG$0.19 per share.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463643:0/",
            "pub_date": "2025-02-05 11:01:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463646:0",
            "title": "Dataprep Names Chairman",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dataprep  named Nor Adha Bin Yahya as the new company chairman on Tuesday, according to a same-day Malaysian bourse filing. </p><p class=\"\">He was re-designated from the position of independent director, the IT service provider said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463646:0/",
            "pub_date": "2025-02-05 11:02:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463639:0",
            "title": "S&P Global Singapore PMI Dips in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">S&amp;P Global Singapore Purchasing Manager's Index or PMI, a composite single figure indicator of performance, dipped under the 50.0 no-change mark during January, according to figures released by S&amp;P Global on Tuesday. </p><p class=\"\">PMI was 49.9, down from 51.5 in December 2024. </p><p class=\"\">Panelists attributed the dip to the spread of COVID-19 in the city-state which impacted new businesses and company operations. </p><p class=\"\">Business activity also declined, especially across the wholesale &amp; retail, finance &amp; insurance, and construction categories. </p><p class=\"\">However, manufacturing, consumer services, real estate &amp; business services and information and communication showed resilience during January. </p><p class=\"\">Meanwhile, employment decreased in January, following the first decrease in eight months at the end of 2024. </p><p class=\"\">Purchasing activity declined for the third consecutive month but the drop in input buying was relatively slower as compared to December 2024. </p><p class=\"\">Overall input costs increased during January with cost pressures driven by higher shipping and transportation prices.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463639:0/",
            "pub_date": "2025-02-05 11:05:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014418:0",
            "title": "Japan's Wage, Services Growth Support Case for More Rate Hikes — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014418:0/",
            "pub_date": "2025-02-05 10:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014422:0",
            "title": "LG CNS Makes Weak Debut After IPO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">LG CNS, an information-technology services affiliate of conglomerate LG Group, made a weak debut in South Korea after the country's biggest initial public offering in three years.</p><p class=\"\">Shares of LG CNS fell as much as 8.6% to 56,600 won, equivalent to $38.99, after opening at 60,500 won in their first day of trading on the Kospi stock exchange Wednesday. The shares pared some losses in later in the morning but remained below their IPO price of 61,900 won, the top end of their marketed price rage. The Kospi was recently up 0.9%.</p><p class=\"\">The company, through an oversubscribed share sale in January, raised 1.199 trillion won, equivalent to $825.9 million. That marked the largest IPO in South Korea since 2022, when battery maker LG Energy Solution raised more than $10 billion.</p><p class=\"\">The stock's lackluster performance put LG CNS's estimated market value at around $4 billion.</p><p class=\"\">LG CNS plans to use the IPO proceeds for facility investments, acquisitions of other IT firms and debt repayment.</p><p class=\"\">LG CNS said revenue rose 13% to 5.605 trillion won in 2023, while operating profit was up 12% at 464.05 billion won.</p><p class=\"\">LG Corp., the holding company for LG Group, has a 45% stake in LG CNS.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014422:0-lg-cns-makes-weak-debut-after-ipo/",
            "pub_date": "2025-02-05 10:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463642:0",
            "title": "Philippines' Headline Inflation Steady at 2.9% in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Philippines' headline inflation remained unchanged at 2.9% in January versus the previous month, according to data from the Philippine Statistics Authority on Wednesday. </p><p class=\"\">The reading also exceeded the consensus estimate for a 2.7% increase by Trading Economics. </p><p class=\"\">The higher inflation was mainly driven by a faster annual increment in the prices of food and non-alcoholic beverages at 3.8% versus 3.4% a month earlier. Another contributor was an annual increase in transport prices at 1.1% during the month, versus a 0.9% gain in the month prior. </p><p class=\"\">Food inflation also rose 4% in January from 3.5% in December 2024, the PSA said. </p><p class=\"\">Core inflation, which excludes volatile food and energy prices, also remained steady at 2.6% in December, the data showed.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463642:0/",
            "pub_date": "2025-02-05 10:58:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW03S:0",
            "title": "China's AIM jumps on vaccine's clinical trial application in US",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** AIM Vaccine  soars as much as 10.1% to HK$6.09; on course for biggest one-day pct gain since Nov. 1, 2024</p><p class=\"\">** Stock hits highest since Jan. 2 on second consecutive session of gains</p><p class=\"\">** Co submits application for clinical trial of mRNA RSV (respiratory syncytial virus) vaccines to U.S. FDA</p><p class=\"\">** Says preclinical animal tests results showed that humoral and cellular immunity of its mRNA RSV vaccine significantly higher than those of internationally marketed products</p><p class=\"\">** Adds industry consultant expects RSV vaccines' global market size to reach $16.7 bln by 2030 from $2.46 bln in 2023</p><p class=\"\">** RSV is a common respiratory tract infection pathogen, which is highly contagious and widely prevalent</p><p class=\"\">** Stock fell 21.8% last year</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW03S:0-china-s-aim-jumps-on-vaccine-s-clinical-trial-application-in-us/",
            "pub_date": "2025-02-05 10:58:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0A8:0",
            "title": "Weaker dollar, dip in US yields of no help to rupee",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Indian rupee is likely to decline at open on Wednesday weighed by the currency's weakness in the non-deliverable forward markets, while being unable to take advantage of the further decline in the dollar index.      </p><p class=\"\">The 1-month non-deliverable forward indicated that the rupee  will open at 87.14-87.16 to the U.S. dollar compared with 87.0675 in the previous session.</p><p class=\"\">There \"does not seem to be a specific reason\" for (dollar/rupee) NDF to be higher, a currency trader at a bank said.</p><p class=\"\">\"If I had to provide a reason, it's the overall direction, which is higher (on dollar rupee),\" the trader said. </p><p class=\"\">The rupee on Tuesday was in the 87.01-87.14 range, having to contend with the news flow on tariffs. The rally to near 87 brought about by the U.S. delaying tariffs on Canada and Mexico was cut short by China's retaliation to U.S. tariffs, to which the initial reaction of investors was to sell the Chinese yuan and avoid risk assets.</p><p class=\"\">That initial reaction faded, helping the rupee recover from the lows of Tuesday's session. </p><p class=\"\">All eyes on Wednesday were on China with markets resuming trade after the Lunar New Year break. The People's Bank of China set a higher-than-expected yuan mid-point. </p><p class=\"\">The onshore yuan was at 7.2832 to the U.S. dollar. Its offshore counterpart has declined past 7.36 on Tuesday.</p><p class=\"\">DOLLAR FALLS FURTHER</p><p class=\"\">The dollar index  slipped below the 108 handle after rallying to near 110 on worries over U.S. tariffs on its trading partners. U.S. suspending tariffs on Mexico and Canada interrupted the upward march on the dollar. </p><p class=\"\">\"With tariff news flow cooling off for now and no imminent deadlines, the focus will shift back towards the U.S. labour market,\" DBS Bank said in a note. </p><p class=\"\">Data released on Tuesday showed U.S. job openings fell by the most in 14 months. U.S. yields dropped. </p><p class=\"\">KEY INDICATORS:</p><p class=\"\">     ** One-month non-deliverable rupee (INRNDFOR=) forward at 87.34; onshore one-month forward premium at 18.5 paise    </p><p class=\"\">     ** Dollar index  down at 107.85</p><p class=\"\">     ** Brent crude futures  down 0.4% at $75.9 per barrel</p><p class=\"\">     ** Ten-year U.S. note yield at 4.5180    </p><p class=\"\">** As per NSDL data, foreign investors sold a net $416.5mln worth of Indian shares on Feb. 3</p><p class=\"\">     ** NSDL data shows foreign investors bought a net $22.6mln worth of Indian bonds on Feb. 3</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0A8:0-weaker-dollar-dip-in-us-yields-of-no-help-to-rupee/",
            "pub_date": "2025-02-05 10:59:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014437_20250204014437:0",
            "title": "Nippon Yusen Sees FY Net Y450.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014437_20250204014437:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014436_20250204014436:0",
            "title": "Nippon Yusen 9-Mos Net Y395.49B Vs Net Y153.57B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014436_20250204014436:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014442:0",
            "title": "Iron Ore Falls, Dragged by Concerns Over China Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Iron ore falls in the morning Asian session, dragged by concerns over the tariffs China announced Tuesday. China imposed a 15% tariff on imports of U.S. coking coal, ANZ Research analysts say in a research report. Chinese iron-ore markets will probably come under pressure amid worries about weaker export-driven demand, the analysts add. Coking coal along with iron ore are raw materials used in steel production. All of the iron-ore contracts on the Dalian Commodity Exchange are lower, with the May 2025 contract last quoted 1.2% down at CNY799.5 a ton. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014442:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014431_20250204014431:0",
            "title": "Chiyoda Corp Sees FY Net Y22.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014431_20250204014431:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014430_20250204014430:0",
            "title": "Chiyoda Corp 9-Mos Net Y20.91B Vs Net Y15.69B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014430_20250204014430:0/",
            "pub_date": "2025-02-05 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV2EE:0",
            "title": "Australia, NZ dlrs struggle to extend gains amid brewing US trade war",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Australian and New Zealand dollars struggled on Wednesday as China markets returned from a week-long holiday with a whimper, with investors waiting to see if China and the U.S. will try to defuse their escalating trade war. </p><p class=\"\">The Aussie slipped 0.1% to $0.6245 , having dived to as low as $0.6168 overnight before rallying back to end the day 0.4% higher. It faces resistance at $0.6262, while support is at the five-year low of $0.6088 hit on Monday. </p><p class=\"\">The kiwi was flat at $0.5654 , falling to as low as $0.5580 overnight before reversing the losses and ending 0.4% higher. Resistance is at last Friday's high of $0.5683. </p><p class=\"\">        The two have had a few wild sessions after U.S. President Donald Trump imposed tariffs on its top trading partners, although those on Mexico and Canada have been delayed. China responded on Tuesday with new tariffs on U.S. goods, but investors reckoned it was a more measured response. </p><p class=\"\">        Trump kept everyone guessing by saying he was in no hurry to talk to Chinese President Xi Jinping. </p><p class=\"\">        China's onshore yuan  lost 0.5% to 7.2846 per dollar even though more losses have been capped by a strong fix by its central bank. China's blue chips  fell 0.4% while Hong Kong's Hang Seng index  skidded 1.4%.</p><p class=\"\">\"The Aussie has struggled to extend gains. China's steady hand on the yuan post-holidays helps at the margin, but the fact is that extra US tariffs are now in place on Australia's largest trading partner, with plenty of scope for escalation,\" said Sean Callow, a senior analyst at ITC markets.</p><p class=\"\">\"As the RBA prepares to cut rates while the Fed's easing pause could extend for some time, AUD seems likely to slip back below 0.62 near term.\"</p><p class=\"\">Markets are 95% priced in for a cut from the Reserve Bank of Australia on Feb. 18, which would be the first easing in four years. (0#AUDIRPR)</p><p class=\"\">In New Zealand, data showed the jobless rate jumped to a four-year high of 5.1% in the fourth quarter, highlighting the ongoing economic pain. The rise was as expected, with the two-year swap rates (NZDSM3NB2Y=) holding flat at 3.3275%, having hit a three-year low just a day ago. </p><p class=\"\">        The weak report supported expectations the Reserve Bank of New Zealand will deliver another outsized half-point reduction in the 4.25% cash rate later this month.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV2EE:0-australia-nz-dlrs-struggle-to-extend-gains-amid-brewing-us-trade-war/",
            "pub_date": "2025-02-05 11:01:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014405:0",
            "title": "U.S. Postal Service Suspends Shipments of China Parcels — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Esther Fung</p><p class=\"\">The U.S. Postal Service said it would temporarily suspend international parcels from China and Hong Kong, cutting off a service that is popular with online vendors in China.</p><p class=\"\">The announcement said the inbound service was suspended until further notice and that the change wouldn't affect delivery of letters.</p><p class=\"\">The move comes after the Trump administration imposed new tariffs on China and moved to close a loophole that allows companies to avoid paying tariffs if they ship packages worth less than $800 directly to U.S. consumers.</p><p class=\"\">Use of the trade provision has ballooned in recent years, partly through the explosive growth of Shein and Temu, the China-founded merchants that have flooded international e-commerce networks with deeply discounted goods.</p><p class=\"\">About 1.36 billion shipments entered the U.S. using the de minimis provision in fiscal year 2024, up from 637 million in fiscal year 2020, according to U.S. Customs and Border Protection.</p><p class=\"\">Write to Esther Fung at esther.fung@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014405:0/",
            "pub_date": "2025-02-05 10:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW08X:0",
            "title": "Indian shares set to open higher ahead of RBI policy meet",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's equity benchmarks are set to open higher on Wednesday, with rate-sensitive sectors in focus as the three-day monetary policy meeting begins later in the day, where the central bank is widely anticipated to reduce its rates.</p><p class=\"\">Both blue-chip indexes - NSE Nifty 50  and BSE Sensex  - climbed 1.6% and 1.8%, respectively, on Tuesday, logging their best session in a month and pushing them into positive territory for 2025.</p><p class=\"\">Domestic interest rate-sensitive banks  and financials  rose about 2% each, while the auto index  logged its fourth straight daily gain.</p><p class=\"\">The GIFT Nifty futures (GIFc1) were trading at 23,840.5, as of 8:10 a.m. IST, indicating that the blue-chip NSE Nifty 50  will open above Tuesday's close of 23,739.25.</p><p class=\"\">Asian markets opened higher, with the MSCI Asia ex-Japan (.MIAPJ0000PUS) rising 0.3%. Wall Street equities advanced overnight, supported by the one-month tariff reprieves on Mexico and Canada. </p><p class=\"\">Safe-haven investors favoured gold, which hit a record high on Wednesday, after China retaliated with tariffs on Washington in response to U.S. President Donald Trump's tariff salvo.</p><p class=\"\">While global trade uncertainties loom, Indian markets await the Reserve Bank of India's policy decision, due on Friday, in which the central bank is expected to deliver a 25-basis-point rate cut to support growth revival. </p><p class=\"\">Analysts said that with largecaps trading at attractive valuations and the recent tax cuts in the union budget aimed at boosting consumption, markets could maintain positive momentum ahead of the RBI's policy decision.</p><p class=\"\">India's Nifty 50 and Sensex are currently about 9.7% and 8.6% below their record highs from Sept. 27, weighed down by concerns over slowing economic and corporate earnings growth, along with continued foreign outflows.</p><p class=\"\">FPIs have offloaded Indian shares worth $9.37 billion in 2025 so far, registering the second-highest monthly sales in January.</p><p class=\"\">STOCKS TO WATCH</p><p class=\"\">** Titan  beats December-quarter profit estimates on festive gold demand</p><p class=\"\">** Tata Power  misses third-quarter profit estimates on slowing power demand</p><p class=\"\">** Whirlpool of India  reports 51% profit growth in Q3 on strong demand in the festive season</p><p class=\"\">** JK Tyre  posts second straight drop in profit on weak demand from bus, truck makers </p><p class=\"\">($1 = 87.1530 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW08X:0-indian-shares-set-to-open-higher-ahead-of-rbi-policy-meet/",
            "pub_date": "2025-02-05 10:51:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463641:0",
            "title": "Haitong Securities to Halt Shares Amid Delisting, Merger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Haitong Securities ,  said its shares will be suspended from trading on Thursday due to a planned delisting and subsequent merger. </p><p class=\"\">The securities company will be absorbed and merged into Guotai Junan Securities  via a share exchange, according to a Tuesday filing with the Shanghai bourse.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463641:0/",
            "pub_date": "2025-02-05 10:53:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0A2:0",
            "title": "Australia's BWP Trust gains on upbeat HY earnings, in-line DPU",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of BWP Trust  rise 4.6% to A$3.44</p><p class=\"\">** Stock hits its highest level since Dec. 5</p><p class=\"\">** Real estate investment trust posts HY profit attributable of A$157.1 mln ($98.23 mln) versus A$53.2 mln from a year earlier</p><p class=\"\">** Co's posts interim distribution per unit of 9.20 AU cents and provides distribution outlook of 9.46 AU cents/unit for 2H25</p><p class=\"\">** Citi says co's interim DPU is in line with Citi and Visible Alpha consensus estimates</p><p class=\"\">** Stock rose as much as 5.2% earlier in the day, marking its biggest intraday gain since June 9, 2020</p><p class=\"\">** Stock up 5% YTD including current session's moves</p><p class=\"\">($1 = 1.5992 Australian dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0A2:0-australia-s-bwp-trust-gains-on-upbeat-hy-earnings-in-line-dpu/",
            "pub_date": "2025-02-05 10:53:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014408:0",
            "title": "U.S.-China Trade Conflict Path Remains Highly Uncertain — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The future path of the U.S.-China trade conflict remains highly uncertain, say Goldman Sachs analysts in a note. China's retaliatory tariffs appear much less than proportional compared to the U.S.'s 10% across-the-board additional tariff on $525 billion worth of Chinese goods, they write. However, the combination of retaliatory tariffs with export bans, entity list additions, and antitrust probe into Google, suggests a \"more coordinated and comprehensive approach by [Chinese] policymakers\" than during the 2018-2019 U.S.-China trade war, they say. In the coming days, the U.S.'s reactions to China's retaliation will be among key events to watch, they add. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014408:0/",
            "pub_date": "2025-02-05 10:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014410:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">2154 ET - The future path of the U.S.-China trade conflict remains highly uncertain, say Goldman Sachs analysts in a note. China's retaliatory tariffs appear much less than proportional compared to the U.S.'s 10% across-the-board additional tariff on $525 billion worth of Chinese goods, they write. However, the combination of retaliatory tariffs with export bans, entity list additions, and antitrust probe into Google, suggests a \"more coordinated and comprehensive approach by [Chinese] policymakers\" than during the 2018-2019 U.S.-China trade war, they say. In the coming days, the U.S.'s reactions to China's retaliation will be among key events to watch, they add. (amanda.lee@wsj.com)</p><p class=\"\">2130 ET - Unemployment in New Zealand is still rising despite rapid interest-rate cuts since mid-2024, leaving consumers and business owners still searching to see the light of an economic recovery. Mark Smith, senior economist at ASB Bank expects demand for labor will continue to weaken until a modest economic recovery finally shows up in the second half of 2025. Firms will have to carefully manage employee headcount in that time, he adds. With inflation close to the target midpoint and monetary settings still slowing the economy, further swift monetary easing looks appropriate to limit economic and labor market scarring, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2125 ET - Japan's services sector is off to a strong start in 2025, the au Jibun Bank PMI compiled by S&amp;P Global suggests. January data point to a solid upturn in business activity across the sector, accompanied by a steeper, solid rise in new business inflows. The survey signaled a sharp jump in average prices charged by service providers, while exports rose for the first time in four months. Firms are upbeat on their prospects over the coming 12 months and have boosted staffing levels, says Usamah Bhatti, economist at S&amp;P Global Market Intelligence. Services continue to underpin growth in Japan's private sector, contrasting the weakness in manufacturing. Still, companies are confident that private-sector activity will rise over 2025, expecting a rebound in manufacturing output and a broad-based economic recovery, Bhatti says. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">2126 ET - The yen strengthens against other G-10 and Asian currencies in the morning session. Japanese data released earlier showed the economy's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases. A solid rise in Japanese labor cash earnings will reinforce the current market pricing in at least one more rate hike by the BOJ this year, CBA's Joseph Capurso says in a note. In addition, with the 'tariff war' between the U.S. and other countries seemingly ongoing, the AUD/JPY is likely to retest support at 94.69, the head of International and Sustainable Economics adds. USD/JPY falls 0.6% to 153.36; AUD/JPY drops 0.7% to 95.88. (ronnie.harui@wsj.com)</p><p class=\"\">2113 ET - There are reasons to be hopeful that a recovery in New Zealand's economy in the second half of this year will help businesses avoid more cuts to headcount, says Mary Jo Vergara, an economist at Kiwibank. But should the required rate relief not come from the Reserve Bank of New Zealand, the risk of further ​job losses only grows, she says. The RBNZ's current forecasts suggest the OCR will get to 3.5% this year and no lower until deep in 2027. That will leave monetary conditions too restrictive, Vergara says. RBNZ will need to get the OCR down to 3% this year. Holding out longer will only cause unnecessary and indeed avoidable damage to the labor market, she adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2044 ET - There are no signs yet that aggressive interest rate cuts by the Reserve Bank of New Zealand since mid-2024 are gaining traction and lifting the economy, says Ben Jarman, chief economist at JP Morgan. To be sure, recent GDP revisions show a more worrying economic trajectory, he adds. The data have yet to turn up meaningfully because policy traction is still being blunted by earlier OCR hikes, he adds. This has slowed the lowering of new mortgage rates, and any improvement in disposable incomes, Jarman says. A number of households will still be rolling their mortgages into higher rates than previous, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2046 ET - JGBs fall in price terms during the morning Tokyo session. Data released earlier show Japan's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases and adding to the case for another BOJ rate hike. The sharp rise in the BOJ's core CPI inflation forecasts in the January outlook report, together with Gov. Ueda's recent comment that there's \"still a significant distance to the neutral rate of interest,\" has sparked worries over an acceleration of rate hikes and an increase in the terminal rate for this cycle, Mitsubishi UFJ Morgan Stanley Securities' fixed income strategists say in a recent report. The JGB 10-year yield is 1.5 bps higher at 1.290%. (ronnie.harui@wsj.com)</p><p class=\"\">2041 ET - New Zealand's unemployment in 4Q 2024 rose to a four-year high of 5.1%. While this was in line with the Reserve Bank of New Zealand's forecasts, money markets should expect a cut in the official cash rate later this month of \"at least\" 50 basis points, says Kieran Davies, chief macro strategist at Coolabah Capital. The unemployment rate almost matches the peak of 5.2% reached during the short Covid recession in 2020, Davies notes. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2032 ET - From a policy perspective, data showing New Zealand's unemployment rates at a 4-year high of 5.1% reaffirm the view that the Reserve Bank of New Zealand will continue to lower rates sequentially over 1H, including another 50-basis-point cut at a policy meeting later this month, says Andrew Boak, chief economist at Goldman Sachs. Boak continues to expect the RBNZ to slow the pace of cuts to 25 basis points per meeting, starting in April, ultimately reaching a terminal official cash rate of 3.0% in July. Still, the risks are skewed to faster and deeper cuts if the recent improvement in high-frequency surveys does not translate into some improvement in the economy, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">1958 ET - Trump's 10% tariff hike on China will likely cause faster industry consolidation among its industrial companies, Citi Research analysts led by Eric Lau say. While major exporters like Techtronic and Shenzhou have diversified production into Asean to avoid tariffs, smaller Chinese companies are unable to do so given difficulty in obtaining bank loans and lack of management resources, they say in a note. The tariff hike could cause them significant distress and spike the unemployment rate in China as these firms constitute about 79% of the total workforce, they add. That could lead China to roll out more stimulus to counter the economic impact. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">1957 ET - U.S.-China trade tensions have some investors concerned about potentially higher tariffs on Asean. While that can't be ruled out, Citi Research analysts led by Eric Lau think tariffs are unlikely to be on par with those levied at Mexico or China as Asean is an attractive region to help dilute CPI inflation for U.S. imported goods. Many major China exporters have diversified production into Asean to avoid tariffs but focus on labor-intensive, non-tech industries such as apparel and footwear that aren't targeted for reshoring into the U.S., they say. Mexico meanwhile has attracted automotive supply-chain industries as the U.S. government seems inclined to emphasize auto manufacturing reshoring, they add. \"The tariff hike scenario in Mexico may not necessarily apply to Asean, in our view.\"(fabiana.negrinochoa@wsj.com)</p><p class=\"\">1937 ET - South Korea's benchmark Kospi rises 0.9% to 2503.94 in early trade, as battery, semiconductor and auto stocks advance. Foreign and retail investors are net buyers amid easing fears over U.S. tariffs. Battery makers LG Energy Solution and Samsung SDI rise 2.0% and 2.9%, respectively, recovering from recent losses. Memory-chip maker SK Hynix gains 2.6%. Carmaker Kia is up 1.1%. Meanwhile, LG CNS, an IT service affiliate of LG Group, is down 2.9% on its stock exchange debut. USD/KRW is 0.5% lower at 1,454.90, compared with the prior session's Seoul onshore trading close. South Korea's 10-year government bond yield is up 0.9 bp at 2.844%. (kwanwoo.jun@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014410:0/",
            "pub_date": "2025-02-05 10:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446658:0",
            "title": "Dollar Weakens as Tariff Concerns Ease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The dollar index dipped below 108 on Wednesday, extending losses from the previous session as the Trump administration's approach to tariffs and China's retaliatory measures proved less severe than anticipated.</p><p class=\"\">Late on Monday, Trump agreed to delay the planned 25% tariffs on Mexico and Canada following successful negotiations.</p><p class=\"\">However, the 10% tariffs on China took effect on Tuesday, prompting Beijing to retaliate with its own levies on US imports, though the response has been relatively mild.</p><p class=\"\">Trump and Xi Jinping are also expected to discuss the situation in an upcoming phone call, raising hopes that further escalation may be avoided and tariffs could eventually be reversed.</p><p class=\"\">Meanwhile, the outlook for Federal Reserve interest rate cuts remains highly uncertain, with trade policies continuing to evolve.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446658:0-dollar-weakens-as-tariff-concerns-ease/",
            "pub_date": "2025-02-05 10:54:10",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0AO:0",
            "title": "Australia's Nufarm extends gains on annual outlook upgrade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Nufarm  rise as much as 4.9% to A$3.86, their highest levels since Dec 6, 2024</p><p class=\"\">** Shares of agricultural technology co rose 3.4% on Tuesday after upgrading FY25 revenue forecast for its plant-based omega-3 products</p><p class=\"\">** Stock still among top gainers in Australian broad-index  </p><p class=\"\">** Nufarm stock lost 32.2% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0AO:0-australia-s-nufarm-extends-gains-on-annual-outlook-upgrade/",
            "pub_date": "2025-02-05 10:54:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463645:0",
            "title": "GE-Shen to Sell Five Properties for MYR35 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GE-Shen  signed a binding term sheet with Plastico for the proposed sale of five properties in Johor Baru, Malaysia, for an aggregate cash consideration of 35 million ringgit. </p><p class=\"\">The freehold properties comprised offices, warehouses and factories, according to a Tuesday Malaysian bourse filing. </p><p class=\"\">Proceeds will be utilized to repay bank borrowings and finance the group's working capital, the industrial mold manufacturer said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463645:0/",
            "pub_date": "2025-02-05 10:55:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463644:0",
            "title": "Akora Resources Confirms Intermediate-Grade Iron Ore Upgrade Potential at Madagascar Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Akora Resources  said test work confirmed the upgrade potential of intermediate-grade iron ore at its Bekisopa iron ore project in Madagascar, according to a Wednesday Australian bourse filing. </p><p class=\"\">The iron ore deposit has intermediate-grade direct shipping ore mineralization ranging from 40% to 58% grade of iron in addition to the identified high-grade ore resource, the filing said. </p><p class=\"\">Test work confirmed material at coarse-crush product size with a 52.8% iron grade that could be upgraded to a lump product grading 59.2% iron at 80.8% recovery using basic dry low-intensity magnetic separator processing. </p><p class=\"\">Material averaging 50.3% grade of iron was upgraded to a fines product grading 60.8% iron at 88% recovery. </p><p class=\"\">The test work was completed as part of the company's pre-feasibility study, which is expected to be released in the March quarter. </p><p class=\"\">The firm is progressing plans to develop a stage one direct shipping ore operation at the project to produce up to two million tonnes per annum of a greater than 60% grade of iron average grade lump and fines product from the near-surface weathered zone mineralization.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463644:0/",
            "pub_date": "2025-02-05 10:55:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:e8d6fd1a1094b:0",
            "title": "Bitcoin Price Pulls Back Again: Key Support Levels to Watch",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em>Bitcoin price started another decline from the $102,500 zone. BTC is trimming gains and struggling to stay above the $96,500 support zone.</em></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Bitcoin started a fresh decline below the $100,000 level.</li><li class=\"listItem-bmN0_SHH\">The price is trading below $99,500 and the 100 hourly Simple moving average.</li><li class=\"listItem-bmN0_SHH\">There is a new connecting bearish trend line forming with resistance at $99,000 on the hourly chart of the BTC/USD pair (data feed from Kraken).</li><li class=\"listItem-bmN0_SHH\">The pair could start another increase if it stays above the $95,500 zone.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bitcoin Price Dips Below $100,000</strong></p><p class=\"\">Bitcoin price failed to continue higher above the $102,500 zone. It started another decline below the $100,000 zone. BTC gained bearish momentum for a move below the $98,500 and $97,500 levels.</p><p class=\"\">The bears pushed the price below the 50% Fib retracement level of the upward move from the $91,000 swing low to the $102,500 high. The price even tested the $96,500 support zone and is currently consolidating losses. There is also a new connecting bearish trend line forming with resistance at $99,000 on the hourly chart of the BTC/USD pair.</p><p class=\"\">Bitcoin price is now trading below $98,000 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $98,000 level. The first key resistance is near the $99,000 level.</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:560.4359673024524px;max-width:1200px;aspect-ratio:2.1411901983663943\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:e8d6fd1a1094b-6f75f29b51af5049622afd94ee1a3b48-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:e8d6fd1a1094b-6f75f29b51af5049622afd94ee1a3b48-resized.jpeg\" style=\"background-color:#f7f4f6\"/></picture></div></figure></span><p class=\"\">The next key resistance could be $100,000. A close above the $100,000 resistance might send the price further higher. In the stated case, the price could rise and test the $102,500 resistance level. Any more gains might send the price toward the $103,500 level.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">More Losses In BTC?</strong></p><p class=\"\">If Bitcoin fails to rise above the $99,000 resistance zone, it could start a fresh decline. Immediate support on the downside is near the $96,500 level. The first major support is near the $95,500 level or the 61.8% Fib retracement level of the upward move from the $91,000 swing low to the $102,500 high.</p><p class=\"\">The next support is now near the $93,750 zone. Any more losses might send the price toward the $95,500 support in the near term.</p><p class=\"\">Technical indicators:</p><p class=\"\">Hourly MACD – The MACD is now losing pace in the bullish zone.</p><p class=\"\">Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level.</p><p class=\"\">Major Support Levels – $96,500, followed by $95,500.</p><p class=\"\">Major Resistance Levels – $99,000 and $100,000.</p></span></div>",
            "link": "https://www.tradingview.com/news/newsbtc:e8d6fd1a1094b:0-bitcoin-price-pulls-back-again-key-support-levels-to-watch/",
            "pub_date": "2025-02-05 10:43:52",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463640:0",
            "title": "Trigg Minerals Joins International Body for Antimony Industry; Shares Up 5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Trigg Minerals  said it has been accepted into the International Antimony Association, the global representative body for the antimony industry, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">Joining the organization offers access to industry stakeholders, regulatory developments, and global market insights, the filing said. </p><p class=\"\">Shares rose 5% in afternoon trade Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463640:0/",
            "pub_date": "2025-02-05 10:47:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204013476:0",
            "title": "Snap sees another bump in its most loyal users, and company's stock leaps",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Claudia Assis</p><p class=\"\">Snapchat parent also swings to a quarterly profit</p><p class=\"\">Shares of Snap Inc. rose about 12% in the extended session Tuesday after the Snapchat parent swung to a quarterly profit and grew the ranks of its most loyal users.</p><p class=\"\">Snap (SNAP) said that its daily average users rose 9% year over year to 453 million people in the fourth quarter. That was ahead of Wall Street expectations of 451 million daily average users, and on the heels of another 9% rise in daily average users in October.</p><p class=\"\">The social-media company also scored a profit in the fourth quarter, reporting GAAP earnings of 1 cent a share versus a GAAP loss of 15 cents a share in the year-ago quarter.</p><p class=\"\">Revenue rose 14% to $1.56 billion, from $1.36 billion a year ago.</p><p class=\"\">Analysts polled by FactSet expected the company to report a GAAP loss of 4 cents a share on sales of $1.55 billion.</p><p class=\"\">The stock has lost more than 30% in the past 12 months, contrasting with an advance of about 22% for the S&amp;P 500 index SPX.</p><p class=\"\">-Claudia Assis</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204013476:0/",
            "pub_date": "2025-02-05 10:48:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        }
    ]
}