{
    "data": [
        {
            "id": "DJN_DN20260227000986:0",
            "title": "Paratus Energy: Q4 and Full-Year 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>HAMILTON, Bermuda, Feb. 27, 2026 /PRNewswire/ — Paratus Energy Services Ltd. (OSLO: PLSV) (\"Paratus\" or the \"Company\") today reported operational and financial results for the fourth quarter and full-year 2025, highlighted by $115 million (FY 2025: $452 million) in combined segment revenues and $69 million (FY 2025: $261 million) in adjusted EBITDA. The Company and its consolidated subsidiaries and ownership in Joint Ventures (the \"Group\") ended the quarter with $204 million in cash and a net debt balance of $581 million.</span></p><p class=\"\"><span>Paratus is pleased to announce that its Board of Directors (the \"Board\") has authorized a quarterly cash distribution of $0.22 per share for Q4 2025, consistent with prior quarters.</span></p><p class=\"\"><span>\"We closed 2025 with strong performance, meaningful cash collections in Mexico, and continued shareholder returns,\" said Robert Jensen, CEO of Paratus. \"With solid cash generation from Seagems, we are well positioned to execute on our strategic priorities and maximize long-term shareholder value.\"</span></p><p class=\"\"><span>Q4 and full-year 2025 highlights, including notable post-quarter developments:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Achieved full-year fleet utilization of approximately 99%, with financial   results exceeding initial full-year guidance.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Combined full-year segment revenues were $452 million while adjusted   EBITDA grew 4% to $261 million.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Collected $356 million in Mexico, including $209 million through a   receivable monetization agreement.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Simplified Group structure through sale of its 24% Archer stake,   unlocking $48 million of cash, of which $18 million was applied toward   debt reduction.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Delivered $168 million of capital returns to shareholders through cash   distributions and share buybacks   </span></li><li class=\"listItem-bmN0_SHH\"><span>Successfully completed acceptance testing across PLSV fleet, with all   vessels contracted with Petrobras at materially higher dayrates by   year-end 2025.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Reported Q4 2025 combined segment revenue of $115 million and adjusted   EBITDA of $69 million.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Ended the year with $204 million in Group cash and $581 million in net   debt.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Post Q4, declared a $0.22 per share quarterly dividend for Q4 2025,   consistent with previous quarters. </span></li></ul><p class=\"\"><span>Fontis</span></p><p class=\"\"><span>Fontis reported contract revenues of $41.8 million (Q3 2025: $54.8 million). Revenues in the prior quarter included $12.1 million of variable revenue which is only recognized until it is agreed by the customer. Operating expenses (Opex) totaled $21.3 million, compared to $19.5 million in Q3 2025, primarily reflecting higher year-end accruals, while general and administrative expenses (G&amp;A) were $0.9 million (Q3 2025: $0.5 million). Adjusted EBITDA was $19.6 million, compared with $34.8 million in Q3 2025.</span></p><p class=\"\"><span>During Q4 2025, Fontis achieved an average dayrate of $114 thousand per day (Q3 2025: $116 thousand per day) and maintained strong technical utilization of 99.5% (Q3 2025: 99.7%). The company's contract backlog at quarter-end stood at approximately $20 million (Q3 2025: approximately $56 million).</span></p><p class=\"\"><span>At the end of Q4 2025, the notional value of the receivable balance was $199.1 million, down from $293.1 million as of Q3 2025. During the quarter, Fontis received $143 million in payments toward overdue invoices from its client in Mexico, with payments made via a Mexican government investment fund. Including these receipts, the Company collected approximately $356 million in 2025. Post Q4, Fontis received $5 million in collections from its client.</span></p><p class=\"\"><span>The Company continues to actively pursue the collection of its remaining outstanding receivables and remains committed to recovering the full amounts due, consistent with its past practice. While the Company recognizes that the timing of collections may continue to fluctuate, recent payments and ongoing government support initiatives provide greater confidence that the payment cycle is normalizing.</span></p><p class=\"\"><span>The Company observes continued improvement in the global jack-up market, supported by operating and tender activity levels in key regions, particularly in Saudi Arabia, as well as in other markets. Near-term demand for jack-ups in Mexico in 2026 appears to be driven more by the client's approved budgets than by drilling activity required to maintain production, resulting in contracting processes progressing more slowly than anticipated. Recent public statements by the national oil company indicating a 34% year-over-year increase in total capital expenditures, together with its stated objective to increase crude oil production, point to the potential for improved budget availability and activity levels over the medium-term. As of the reporting date, Oberon completed operations in late January and has subsequently been demobilized for warm stacking in anticipation of new work, while Defender has been awarded a two-month contract extension. While no assurances can be provided, the Company remains engaged in ongoing discussions with its client regarding potential contract extensions in Mexico for Defender, Courageous and Intrepid, in direct continuation of their existing commitments. If secured, such extensions would be expected to maintain utilization for these rigs into the first quarter of 2027 and potentially beyond.</span></p><p class=\"\"><span>Titania and Oberon are currently being actively marketed for new contract opportunities in Mexico and internationally. The Company has received several unsolicited bids and indications of interest and is evaluating potential sale transactions for one or both rigs. Any such transaction will be considered in the context of broader strategic alternatives for the jack-up business as a whole. The evaluation of potential sale transactions for Titania and Oberon, as well as the broader review of strategic alternatives for the jack-up business, is progressing constructively. The Company intends to conclude its assessment of these opportunities in the near term, with the objective of determining the most value-accretive path forward for Paratus and its stakeholders.</span></p><p class=\"\"><span>Seagems Joint Venture</span></p><p class=\"\"><span>Paratus' 50% share in the Seagems joint venture contributed $73.5 million in contract revenues, a modest increase from $72.6 million in the prior quarter. Opex totaled $14.8 million (Q3 2025: $21.3 million), while G&amp;A expenses were $3.9 million (Q3 2025: $3.2 million). The decrease in Opex primarily reflects a one-time presentation reclassification of certain withholding taxes from Opex to Income tax. Adjusted EBITDA increased to $51.6 million from $44.8 million in Q3, driven by stronger revenues and lower Opex.</span></p><p class=\"\"><span>The JV achieved an average dayrate of $278 thousand per day (Q3 2025: $272 thousand per day) and maintained strong technical utilization of 98% (Q3 2025: 98.4%). Seagems JV's contract backlog at quarter-end was approximately $1.3 billion (Q3 2025: approximately $1.5 billion). In Q4 2025 the entire fleet operated under the new Petrobras contracts.</span></p><p class=\"\"><span>During the quarter, the Seagems JV distributed $38.1 million to Paratus (Q3 2025: $57.8 million), bringing total distributions received in 2025 to $129 million (2024: $97.5 million).</span></p><p class=\"\"><span>Earlier this year, Petrobras issued a PLSV tender for start-up in 2027-28, offering four-year contracts across five different lots with varying technical specifications. The tender deadline is currently set for mid-April 2026, and Seagems is well positioned to submit a bid with at least one vessel.</span></p><p class=\"\"><span>The Company has, in recent quarters, evaluated opportunities to expand the Seagems business and leverage the strong operational platform it has developed. In this context, Seagems has submitted a commercial proposal in response to a Petrobras tender for the demobilization of flexible lines. To support this bid, Seagems has secured access to a third-party vessel, which would be deployed in the event of a contract award.</span></p><p class=\"\"><span>Webcast and Q&amp;A Session</span></p><p class=\"\"><span>Paratus will host a presentation of the Q4 2025 results via an audio webcast today at 15:00 CET. The presentation will be led by CEO Robert Jensen and CFO Baton Haxhimehmedi.</span></p><p class=\"\"><span>To join the webcast, please use the following link:</span></p><p class=\"\"><span>https://paratusenergy.engagestream.euronext.com/2026-02-27</span></p><p class=\"\"><span>A Q&amp;A session will follow the presentation, with instructions on how to submit questions provided at the start of the session.</span></p><p class=\"\"><span>For further information, please contact:</span></p><p class=\"\"><span>Robert Jensen, CEO</span></p><p class=\"\"><span>Robert.Jensen@paratus-energy.com</span></p><p class=\"\"><span>+47 958 26 729</span></p><p class=\"\"><span>Baton Haxhimehmedi, CFO</span></p><p class=\"\"><span>Baton.Haxhimehmedi@paratus-energy.com</span></p><p class=\"\"><span>+47 406 39 083</span></p><p class=\"\"><span>This information is subject to the disclosure requirements pursuant to section 5-12 the Norwegian Securities Trading Act.</span></p><p class=\"\"><span>Attachments</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Q4 2025 Interim Results Report </span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 2025 Interim Results Presentation </span></li></ul><p class=\"\"><span>About Paratus</span></p><p class=\"\"><span>Paratus Energy Services Ltd. (ticker: PLSV) is an investment holding company of a group of leading energy services companies. The Paratus Group is primarily comprised of its ownership of Fontis Energy and a 50/50 JV interest in Seagems. Fontis Energy is an offshore drilling company with a fleet of five high-specification jack-up rigs in Mexico. Seagems is a leading subsea services company, with a fleet of six multi-purpose pipe-laying support vessels in Brazil.</span></p><p class=\"\"><span>Forward-Looking Statements This release includes forward-looking statements. Such statements are generally not historical in nature, and specifically include statements about the Company's and / or the Paratus Group's (including any member of the Paratus Group) plans, strategies, business prospects, changes and trends in its business and the markets in which it operates. These statements are based on management's current plans, expectations, assumptions and beliefs concerning future events impacting the Company and / or the Paratus Group and therefore involve a number of risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed or implied in the forward-looking statements, which speak only as of the date of this news release. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, but are not limited to, management's reliance on third party professional advisors and operational partners and providers, the Company's ability (or inability) to control the operations and governance of certain joint ventures and investment vehicles, oil and energy services and solutions market conditions, subsea services market conditions, and offshore drilling market conditions, the cost and timing of capital projects, the performance of operating assets, delay in payment or disputes with customers, the  ability to successfully employ operating assets, procure or have access to financing, ability to comply with loan covenants, liquidity and adequacy of cash flow from operations of its subsidiaries and investments, fluctuations in the international price of oil or alternative energy sources, international financial, commodity or currency market conditions, including, in each case, the impact of pandemics and related economic conditions, changes in governmental regulations, including in connection with pandemics, that affect the Paratus Group, increased competition in any of the industries in which the Paratus Group operates, the impact of global economic conditions and global health threats, including in connection with pandemics, our ability to maintain relationships with suppliers, customers, joint venture partners, professional advisors, operational partners and providers, employees and other third parties and our ability to maintain adequate financing to support our business plans, factors related to the offshore drilling, subsea services, and oil and energy services and solutions markets, the impact of global economic conditions, our liquidity and the adequacy of cash flows for our obligations, including the ability of the Company's subsidiaries and investment vehicles to pay dividends, political and other uncertainties, the concentration of our revenues in certain geographical jurisdictions, limitations on insurance coverage, our ability to attract and retain skilled personnel on commercially reasonable terms, the level of expected capital expenditures, our expected financing of such capital expenditures, and the timing and cost of completion of capital projects, fluctuations in interest rates or exchange rates and currency devaluations relating to foreign or U.S. monetary policy, tax matters, changes in tax laws, treaties and regulations, tax assessments and liabilities for tax issues, legal and regulatory matters, customs and environmental matters, the potential impacts on our business resulting from climate-change or greenhouse gas legislation or regulations, the impact on our business from climate-change related physical changes or changes in weather patterns, and the occurrence of cybersecurity incidents, attacks or other breaches to our information technology systems, including our rig operating systems. Consequently, no forward-looking statement can be guaranteed.</span></p><p class=\"\"><span>Neither the Company nor any member of the Paratus Group undertakes any obligation to update any forward-looking statements to reflect events or circumstances after the date on which such statement is made or to reflect the occurrence of unanticipated events. New factors emerge from time to time, and it is not possible for us to predict all of these factors. Further, we cannot assess the impact of each such factors on our businesses or the extent to which any factor, or combination of factors, may cause actual results to be materially different from those contained in any forward-looking statement.</span></p><p class=\"\"><span>This information was brought to you by Cision http://news.cision.com</span></p><p class=\"\"><span>https://news.cision.com/paratus-energy-services-ltd/r/paratus-energy--q4-and-full-year-2025-results, c4313957</span></p><p class=\"\"><span>The following files are available for download:</span></p><p class=\"\"><span>https://mb.cision.com/Public/21459/4313957/b8  Q4 2025 Interim Results Report </span><br/><span>a0702d7de447ef.pdf </span><br/><span>https://mb.cision.com/Public/21459/4313957/92  Q4 2025 Interim Results </span><br/><span>20b45d44ef9146.pdf                             Presentation</span></p><p class=\"\"><span>View original content:https://www.prnewswire.com/news-releases/paratus-energy-q4-and-full-year-2025-results-302699373.html</span></p><p class=\"\"><span>SOURCE Paratus Energy Services Ltd</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000986:0/",
            "pub_date": "2026-02-27 14:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2943559:0",
            "title": "CASH: Net profit rose 3.3% to €94M as transformation products drove growth amid currency headwinds",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Profitability improved with net profit up 3.3% to €94M, despite a 4.9% sales decline due to currency headwinds. Transformation products now account for 35.2% of sales, and free cash flow reached €108M. Strong growth in Asia Pacific and disciplined capital management supported results.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2943559-6a7237e91767cb636b4c4c512b16f34d\" target=\"_blank\">Prosegur Cash SA [CASH] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2943559:0-cash-net-profit-rose-3-3-to-94m-as-transformation-products-drove-growth-amid-currency-headwinds/",
            "pub_date": "2026-02-27 14:34:03",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2943553:0",
            "title": "DHER: Q4 2025 delivered robust growth, record margins, and strong cash flow across all segments",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw 8% YoY GMV growth and 21% revenue growth, with gross profit margin at a record 8.3%. Adjusted EBITDA exceeded €900m and free cash flow topped €200m, driven by strong segment performance and operational efficiency.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2943553-eeafae2dd255b9cb7dcff94df2ba99f7\" target=\"_blank\">Delivery Hero SE [DHER] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2943553:0-dher-q4-2025-delivered-robust-growth-record-margins-and-strong-cash-flow-across-all-segments/",
            "pub_date": "2026-02-27 14:34:07",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_PLXD70793:0",
            "title": "B@ Offshore Expects 2026 EBITDA In Range Of $340-370 Mln",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BW Offshore Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BW OFFSHORE Q4 EBITDA USD 47.8 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BW OFFSHORE Q4 ADJUSTED FREE CASH FLOW USD 107.7 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BW OFFSHORE Q4 DIVIDEND USD 0.18</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BW OFFSHORE Q4 NET INCOME USD 24.1 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 DIVIDEND USD 0.18 PER SHARE EQUIVALENT TO USD 33.2 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>2025 DIVIDEND USD 67.0 MILLION, FIFTH CONSECUTIVE YEAR OF INCREASED SHAREHOLDER DISTRIBUTION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FULL-YEAR 2026 EBITDA GUIDANCE IN RANGE OF USD 340-370 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WILL TRANSITION TO A PRODUCTION VOLUME-BASED DAYRATE IN MID-MARCH, WITH REVENUE RECOGNITION COMMENCING AT THAT TIME</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EXPECTS THAT CURRENT FLEET WILL CONTINUE TO GENERATE SIGNIFICANT CASH FLOW IN TIME AHEAD</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GROWING ENERGY DEMAND CONTINUES TO DRIVE DEMAND FOR DEVELOPING NEW FPSO PROJECTS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EXPECTS THAT A NUMBER OF FPSO PROJECTS COMPANY IS ENGAGING WITH WILL REACH A FINAL INVESTMENT DECISION OVER NEXT 12 TO 36 MONTHS.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CONTINUES TO SELECTIVELY EVALUATE NEW PROJECTS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_PLXD70793:0-b-offshore-expects-2026-ebitda-in-range-of-340-370-mln/",
            "pub_date": "2026-02-27 14:34:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2D0:0",
            "title": "Kirloskar Brothers Gets Order Worth 2.14 Billion Rupees",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Kirloskar Brothers Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KIRLOSKAR BROTHERS LTD- GOT ORDER WORTH 2.14 BILLION RUPEES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2D0:0-kirloskar-brothers-gets-order-worth-2-14-billion-rupees/",
            "pub_date": "2026-02-27 14:34:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM28E:0",
            "title": "Prism Johnson Expands Product Range With Gypsum Plaster",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Prism Johnson Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PRISM JOHNSON LTD - EXPANDS PRODUCT RANGE WITH GYPSUM PLASTER</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM28E:0-prism-johnson-expands-product-range-with-gypsum-plaster/",
            "pub_date": "2026-02-27 14:34:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2AW:0",
            "title": "Marine Electricals (India) Receives Orders Totaling 274.9 Million Rupees",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Marine Electricals (India) Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MARINE ELECTRICALS (INDIA) LTD - RECEIVES ORDERS TOTALING 274.9 MILLION RUPEES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2AW:0-marine-electricals-india-receives-orders-totaling-274-9-million-rupees/",
            "pub_date": "2026-02-27 14:34:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2DA:0",
            "title": "JSL Industries Gets Order Worth 29.1 Million Rupees",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>JSL Industries Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>JSL INDUSTRIES LTD- GOT ORDER WORTH 29.1 MILLION RUPEES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2DA:0-jsl-industries-gets-order-worth-29-1-million-rupees/",
            "pub_date": "2026-02-27 14:34:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000983_20260227001003:0",
            "title": "Kospi Snaps Six-Session Winning Streak; Rises 20% for the Month",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000983_20260227001003:0/",
            "pub_date": "2026-02-27 14:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2DD:0",
            "title": "Frontline Declares Cash Dividend Of $1.03 Per Share For Q4 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Frontline Plc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DECLARED A CASH DIVIDEND OF $1.03 PER SHARE FOR Q4 OF 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 PROFIT OF $227.9 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 ADJUSTED PROFIT OF $230.4 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 REPORTED REVENUES OF $624.5 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2DD:0-frontline-declares-cash-dividend-of-1-03-per-share-for-q4-2025/",
            "pub_date": "2026-02-27 14:35:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2B2:0",
            "title": "Medical Data Vision Co Ltd - To Retire Treasury Shares Worth 5.42% Of Outstanding Stock On April 27",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Medical Data Vision Co Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MEDICAL DATA VISION CO LTD - TO RETIRE TREASURY SHARES WORTH 5.42% OF OUTSTANDING STOCK ON APRIL 27</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2B2:0-medical-data-vision-co-ltd-to-retire-treasury-shares-worth-5-42-of-outstanding-stock-on-april-27/",
            "pub_date": "2026-02-27 14:35:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN0GI:0",
            "title": "Bayer Reports Results For Next Generation Investigational Targeted Radionuclide Therapy 225ac",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BAYER AG </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANNOUNCED ENCOURAGING RESULTS FROM THE ONGOING GLOBAL PHASE I FIRST-IN-HUMAN, DOSE-ESCALATION PANTHA STUDY (NCT06217822) EVALUATING THE SAFETY, TOLERABILITY AND PRELIMINARY EFFICACY OF 225AC-PSMA-TRILLIUM</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DOSE FOR EXPANSION WAS SUCCESSFULLY IDENTIFIED, WITH ≥80% OF PATIENTS ACHIEVING A PSA50 RESPONSE AT THE EXPANSION DOSE.</span></p></li></ul><p class=\"\"><span> Further company coverage: [BAYGn.DE] </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN0GI:0-bayer-reports-results-for-next-generation-investigational-targeted-radionuclide-therapy-225ac/",
            "pub_date": "2026-02-27 14:35:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUC1HFJ46:0",
            "title": "Skanska Refurbishes Laboratory Facilities In Helsinki, Finland",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Skanska AB </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SKANSKA REFURBISHES LABORATORY FACILITIES IN HELSINKI, FINLAND, FOR EUR 28M, ABOUT SEK 300M</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUC1HFJ46:0-skanska-refurbishes-laboratory-facilities-in-helsinki-finland/",
            "pub_date": "2026-02-27 14:35:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000964:0",
            "title": "Raccoon Holdings 9-Mos Net Y579.00M Vs Net Y659.00M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>    Raccoon Holdings Inc. (3031.TO) </span><br/><span>    Japan </span><br/><span>    Nine Months Ended January 31 </span><br/><span>GROUP                2026                 2025 </span><br/><span>Revenue              Y4.81 bln       Y4.56 bln </span><br/><span>Operating Profit     Y974.00 mln   Y952.00 mln </span><br/><span>Pretax Profit        Y892.00 mln     Y1.12 bln </span><br/><span>Net Profit           Y579.00 mln   Y659.00 mln </span><br/><span>Per share </span><br/><span>  Earnings           Y28.52             Y30.98 </span><br/><span>  Diluted Earnings   Y28.27             Y30.74 </span><br/><span> </span><br/><span>    Results are based on Japanese accounting standards. </span></pre><p class=\"\"><span>This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(06:30 GMT) </span></strong><span>Raccoon Holdings Sees FY Net Y900.00M</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>    Raccoon Holdings Inc. also released the following forecasts: </span><br/><span>GROUP              Year Ending </span><br/><span>                      Apr 2026 </span><br/><span>Revenue              Y6.74 bln </span><br/><span>Operating Profit     Y1.41 bln </span><br/><span>Pretax Profit        Y1.40 bln </span><br/><span>Net Profit         Y900.00 mln </span><br/><span>Per share </span><br/><span>  Earnings              Y44.27 </span><br/><span> </span><br/><span>    Results are based on Japanese accounting standards. </span></pre><p class=\"\"><span>This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000964:0/",
            "pub_date": "2026-02-27 14:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000967:0",
            "title": "Natoco 1Q Net Y238.00M Vs Net Y267.00M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>    Natoco Co. Ltd. (4627.TO) </span><br/><span>    Japan </span><br/><span>    1st Quarter Ended January 31 </span><br/><span>GROUP              2026                 2025 </span><br/><span>Revenue            Y5.47 bln       Y5.74 bln </span><br/><span>Operating Profit   Y345.00 mln   Y368.00 mln </span><br/><span>Pretax Profit      Y377.00 mln   Y401.00 mln </span><br/><span>Net Profit         Y238.00 mln   Y267.00 mln </span><br/><span>Per share </span><br/><span>  Earnings         Y31.51             Y35.44 </span><br/><span> </span><br/><span>    Results are based on Japanese accounting standards. </span></pre><p class=\"\"><span>This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000967:0/",
            "pub_date": "2026-02-27 14:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000952:0",
            "title": "Eurozone Government Bond Market in Search of New Drivers — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The eurozone government bond market is lacking impetus, with tight spreads and low volatility, Societe Generale rates strategists say in a note. \"As a result, investors are taking advantage of the carry and looking for signals in this low noise market,\" they say. Seasonal factors may lead to some underperformance in periphery bonds, \"but we don't expect it to last long,\" they say. While Italy's referendum on the reform of the judicial system is drawing attention, Societe Generale doesn't expect a political shock. \"Any market reaction should be viewed as short-term noise.\" (emese.bartha@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000952:0/",
            "pub_date": "2026-02-27 14:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:b9cd25222b4cc:0",
            "title": "Dolphin Drilling AS Announces Financial Results for the Fourth Quarter 2025 and Preliminary Results for the Financial Year Ended 31 December 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Oslo, Norway, 27 February 2026.</span></strong></p><p class=\"\"><span>Dolphin Drilling AS (OSE: DDRIL) announced today its preliminary financial results for the three months ended 31 December 2025 and full year 2025.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>As of December 31, 2025</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Revenues of USD 47.0 million for the fourth quarter, compared to USD 37.7 million in Q3 2025. 2025 revenues were USD 177.7 million, up from USD 96.5 million reported for 2024</span></li><li class=\"listItem-bmN0_SHH\"><span>EBITDA of USD 8.2 million for the fourth quarter, a significant improvement from a loss of USD 4.7 million in Q3 2025. For the full year, EBITDA was USD 13.9 million compared to a loss of USD 34.2 million in 2024</span></li><li class=\"listItem-bmN0_SHH\"><span>Net Earnings: The company reported a loss of USD 1.6 million or USD 0.01 per share, compared to a loss of USD 18.2 million in Q3 2025 or USD 0.06 per share. 2025 earnings per share were a loss of USD 0.10 per share, in comparison to a loss of USD 0.38 per share in the previous year</span></li><li class=\"listItem-bmN0_SHH\"><span>Rig Utilization: Paul B. Loyd, Jr (“PBLJ”) had rig uptime of 98.9% while Blackford Dolphin achieved 92.1%. Utilisation for 2025 was 98.0% and 91.7% respectively</span></li><li class=\"listItem-bmN0_SHH\"><span>Contract award: The company signed new firm contracts representing USD 100 million, USD 60 million in revenue backlog for the Borgland Dolphin with Repsol SA as well as a contract extension adding USD 40 million for the Blackford Dolphin with Oil India</span></li><li class=\"listItem-bmN0_SHH\"><span>New shares: Company raised gross proceeds of approximately USD 15 million in a Private Placement of shares</span></li><li class=\"listItem-bmN0_SHH\"><span>Leadership Change: In December, Michael Boyd was appointed CEO</span></li></ul><p class=\"\"><span>The preliminary earnings report and company presentation are enclosed. The results will be presented later today through an audiocast including Q&amp;A starting 10:00 CET. The presentation will be held by CEO Micheal Boyd and CFO Ingolf Gillesdal. Visit the Investor Relations section of the Company's website at www.dolphindrilling.com and click on the link to \"Q4 2025 Investor Presentation Audiocast\".</span></p><p class=\"\"><span>For further information, please contact:</span></p><p class=\"\"><span>Ingolf Gillesdal, CFO, tel: +47 920 45 320</span></p><p class=\"\"><span>Dolphin Drilling |www.dolphindrilling.com</span></p><p class=\"\"><span>Dolphin Drilling AS is an Oslo listed, Aberdeen head-quartered, company which owns and operates a fleet of harsh environment mid-water &amp; deep-water semisubmersible drilling rigs, capable of working worldwide.</span></p><p class=\"\"><em><span>This information is subject to disclosure under the Norwegian Securities Trading Act, §5-12. The information was submitted for publication, through the agency of the contact persons set out above, at 2026-02-27 07:30 CET.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/cef2cfa4-aca5-45ed-bdb6-2cc7f8605b0a/q4-2025-ddril-preliminary-earnings-report.pdf\" rel=\"nofollow\" target=\"_blank\">Q4 2025 DDRIL Preliminary Earnings Report</a></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/6df02a86-f744-463e-ac07-a3bbf8dc753f/q4-2025-ddril-investor-presentation.pdf\" rel=\"nofollow\" target=\"_blank\">Q4 2025 DDRIL Investor Presentation</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:b9cd25222b4cc:0-dolphin-drilling-as-announces-financial-results-for-the-fourth-quarter-2025-and-preliminary-results-for-the-financial-year-ended-31-december-2025/",
            "pub_date": "2026-02-27 14:30:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:af2b709903c95:0",
            "title": "Annual Report 2025: A record year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Today, Gubra releases its Annual Report for 2025 showing the strongest financial results in Gubra’s history. Group revenue and operating profit amounted to DKK 2.6 billion and DKK 2.2 billion, respectively. Several operational advancements were made across the company in 2025, not least the landmark outlicensing deal of the anti-obesity asset ABBV-295 (long-acting amylin analog) to AbbVie.</span></strong></p><p class=\"\"><span>Markus Rohrwild, CEO of Gubra says:</span></p><p class=\"\"><em><span>“2025 was a defining year for Gubra — not only because of the record financial results, but because of the collective dedication with which we advanced our science, strengthened our platforms and portfolio, and positioned the company for sustainable long‑term growth”.</span></em></p><p class=\"\"></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Our Biotech AI platform is the engine</span></strong></p><p class=\"\"><span>For the Biotech business, the progress during 2025 shows the value embedded into Gubra’s R&amp;D portfolio. The outlicensing deal of ABBV-295 to AbbVie with a total value of $2.2bn is just one validation of this. Gubra generates novel peptide drug development candidates through the proprietary AI-driven discovery platform streaMLine and develops them to a maximum early value inflection stage.</span></p><p class=\"\"><span>Aside from ABBV-295, Gubra’s partner Boehringer-Ingelheim is advancing the first-in-class long-acting triple agonist for obesity into mid-stage development and together with Swedish Camurus, Gubra initiated a research collaboration to develop an extended-release therapy for hypoparathyroidism. In 2025, Gubra also showed compelling preclinical data from the not yet partnered GUB-UCN2 lead asset designed for healthy weight loss.</span></p><p class=\"\"><em><span>“The progress in 2025 collectively shows the strength of our technology platform to generate novel peptides that are widely recognized by our partners. Technology remains at the heart of Gubra. With our streaMLine platform and advanced 3D-imaging and automation capabilities, we have created an integrated engine that accelerates therapeutic discovery across disease areas. The streaMLine platform now supports more programs in more therapeutic areas than ever before. Its rapid design-build-test cycle reinforces our fundamental belief: innovation in therapeutics increasingly depends on innovation in technology,”</span></em><span>Markus Rohrwild</span><span>says.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CRO set to grow</span></strong></p><p class=\"\"><span>Gubra’s CRO business has seen revenue grow organically by almost 70% between 2022-2024. 2025 presented a slight revenue decline, driven by macroeconomic headwinds and constrained funding environments for small biotech companies, resulting in longer decision cycles.</span></p><p class=\"\"><em><span>“Encouragingly, we now see signs of improvement in the order pipeline. This underpins our confidence in continued robust growth and strong profitability within this business segment”, Markus Rohrwild continues.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Stronger operating model for the future</span></strong></p><p class=\"\"><span>Starting in 2026, Gubra has strengthened the operating model and will operate through three synergistic business units – Biotech, CRO, and Ventures – all anchored in Gubra’s commitment to society and sustainability. While highly complementary, each unit has a distinct business model designed to maximize value creation. Furthermore, the leadership team is strengthened with the recruitment of Thomas Langenickel as Chief Medical and Development Officer, Grigo Gaurav as Chief Technology Officer and Zoë Johnson as Head of Gubra Ventures.</span></p><p class=\"\"><span>Gubra Ventures is Gubra’s new business unit. Ventures will incubate high-potential assets in a dedicated venture structure, attract external capital, specialized talent, and strategic partners without diluting the focus of Gubra Biotech. To support continued growth, Gubra is expanding their facilities in the DTU Science Park. With the new facilities, Gubra will increase its total laboratory and office space by 70%.</span></p><p class=\"\"></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strong outlook for 2026</span></strong></p><p class=\"\"><span>There is strong momentum for 2026. In the Biotech business, there are three potential multibillion obesity drugs (GUB-UCN2, ABBV-295 and the triple agonist) in Phase 1 or Phase 2 development with potential readouts for the partnered assets.</span></p><p class=\"\"><span>The mega-program GUB-UCN2 for healthy weight loss will enter first-in-human</span><span>studies in H1 2026. The ambitious Phase 1/2a trial design with close to 200 participants sets the stage for exploring GUB-UCN2 across multiple indications and patient populations. The trial will evaluate the safety, tolerability, pharmacokinetics, and preliminary efficacy of GUB-UCN2, with a particular focus on muscle volume and muscle function endpoints – both as a standalone therapy and in combination with incretin-based therapy for obesity.</span></p><p class=\"\"><span>In the new business unit Ventures, Gubra is currently looking at interesting opportunities and expects to create the first venture in H2 2026.</span></p><p class=\"\"><span>For the CRO business, the orderbook is promising and we expect to see revenue growth of 5-15% compared with 2025 and sound profitability.</span></p><p class=\"\"><em><span>“I’m very excited about the time ahead for Gubra. Not the least due to our great people who make it all possible and because everything we do is founded in our commitment to society and sustainability,”</span></em><span>Makus Rohrwild says.</span></p><p class=\"\"></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Key financial highlights for 2025</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Key ratio</span></strong></td><td colspan=\"2\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Biotech segment</span></strong></td><td colspan=\"2\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>CRO segment</span></strong></td><td colspan=\"2\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Group</span></strong></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>DKK million</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>2024</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>2024</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>2024</span></strong></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Revenue</span></td><td colspan=\"1\" rowspan=\"1\"><span>2,444.3</span></td><td colspan=\"1\" rowspan=\"1\"><span>45.6</span></td><td colspan=\"1\" rowspan=\"1\"><span>192.5</span></td><td colspan=\"1\" rowspan=\"1\"><span>220.2</span></td><td colspan=\"1\" rowspan=\"1\"><span>2,636.8</span></td><td colspan=\"1\" rowspan=\"1\"><span>265.7</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Organic revenue growth</span></td><td colspan=\"1\" rowspan=\"1\"><span>5,269%</span></td><td colspan=\"1\" rowspan=\"1\"><span>25%</span></td><td colspan=\"1\" rowspan=\"1\"><span>-13%</span></td><td colspan=\"1\" rowspan=\"1\"><span>31%</span></td><td colspan=\"1\" rowspan=\"1\"><span>892%</span></td><td colspan=\"1\" rowspan=\"1\"><span>30%</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Reported Cost of Sales &amp; Opex</span></td><td colspan=\"1\" rowspan=\"1\"><span>-320.3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-157.6</span></td><td colspan=\"1\" rowspan=\"1\"><span>-166.1</span></td><td colspan=\"1\" rowspan=\"1\"><span>-157.7</span></td><td colspan=\"1\" rowspan=\"1\"><span>-487.4</span></td><td colspan=\"1\" rowspan=\"1\"><span>-315.5</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Adj. Cost of Sales &amp; Opex*</span></td><td colspan=\"1\" rowspan=\"1\"><span>-251.5</span></td><td colspan=\"1\" rowspan=\"1\"><span>-157.2</span></td><td colspan=\"1\" rowspan=\"1\"><span>-164.3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-155.9</span></td><td colspan=\"1\" rowspan=\"1\"><span>-416.8</span></td><td colspan=\"1\" rowspan=\"1\"><span>-313.1</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Reported EBIT</span></td><td colspan=\"1\" rowspan=\"1\"><span>2,124.2</span></td><td colspan=\"1\" rowspan=\"1\"><span>-112.2</span></td><td colspan=\"1\" rowspan=\"1\"><span>26.6</span></td><td colspan=\"1\" rowspan=\"1\"><span>62.2</span></td><td colspan=\"1\" rowspan=\"1\"><span>2,150.1</span></td><td colspan=\"1\" rowspan=\"1\"><span>-50.0</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Adjusted EBIT*</span></td><td colspan=\"1\" rowspan=\"1\"><span>2,193.0</span></td><td colspan=\"1\" rowspan=\"1\"><span>-108.6</span></td><td colspan=\"1\" rowspan=\"1\"><span>28.4</span></td><td colspan=\"1\" rowspan=\"1\"><span>66.5</span></td><td colspan=\"1\" rowspan=\"1\"><span>2,220.7</span></td><td colspan=\"1\" rowspan=\"1\"><span>-42.4</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Reported EBIT-margin</span></td><td colspan=\"1\" rowspan=\"1\"><span>87%</span></td><td colspan=\"1\" rowspan=\"1\"><span>-246%</span></td><td colspan=\"1\" rowspan=\"1\"><span>14%</span></td><td colspan=\"1\" rowspan=\"1\"><span>28%</span></td><td colspan=\"1\" rowspan=\"1\"><span>82%</span></td><td colspan=\"1\" rowspan=\"1\"><span>-19%</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Adjusted EBIT-margin*</span></td><td colspan=\"1\" rowspan=\"1\"><span>90%</span></td><td colspan=\"1\" rowspan=\"1\"><span>-238%</span></td><td colspan=\"1\" rowspan=\"1\"><span>15%</span></td><td colspan=\"1\" rowspan=\"1\"><span>30%</span></td><td colspan=\"1\" rowspan=\"1\"><span>84%</span></td><td colspan=\"1\" rowspan=\"1\"><span>-16%</span></td></tr></tbody></table></div><p class=\"\"><span>*Adjusted for non-recurring items</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial outlook for 2026</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Key ratio</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>2026 Outlook</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Mid-term guidance</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Results 2025</span></strong></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Biotech Segment</span></strong></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Revenue</span></td><td colspan=\"1\" rowspan=\"1\"><span>No guidance</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>DKK 2,444m</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Total Costs</span></td><td colspan=\"1\" rowspan=\"1\"><span>DKK 330-360m</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>DKK 251m</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>CRO Segment</span></strong></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Revenue</span></td><td colspan=\"1\" rowspan=\"1\"><span>5-15% growth</span></td><td colspan=\"1\" rowspan=\"1\"><span>10% annual growth</span></td><td colspan=\"1\" rowspan=\"1\"><span>DKK 193m</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>EBIT-margin</span></td><td colspan=\"1\" rowspan=\"1\"><span>20-25%</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>15%</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Gubra Ventures EBIT</span></strong></td><td colspan=\"1\" rowspan=\"1\"><span>DKK -5 to -10m</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>n/a</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Gubra Green EBIT</span></strong></td><td colspan=\"1\" rowspan=\"1\"><span>DKK -5 to -10m</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>DKK -1m</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Conference call for investors</span></strong></p><p class=\"\"><span>A presentation for analysts and investors will be held today, February 27, at 10:00am CET. The event will be hosted by the company’s CEO Markus Rohrwild, CFO Kristian Borbos, CSO Louise S. Dalbøge, CDMO Thomas Langenickel, Head of Ventures Zoë Johnson and Head of CRO Trine Nygaard Hamann. The presentation will be held in English.</span></p><p class=\"\"><span>To participate in the conference, please register here to receive the dial-in details:</span></p><p class=\"\"><span>https://player.videosync.fi/hca/2026-02-27-gubra/dial-in</span></p><p class=\"\"><span>The conference can also be followed live via the webcast link:</span></p><p class=\"\"><span>https://hca.videosync.fi/2026-02-27-gubra/register</span></p><p class=\"\"><span>It will also be possible to access the webcast afterwards at the abovementioned link.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contacts at Gubra</span></strong></p><p class=\"\"><span>Media: Sofia Pitt Boserup (</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:sbo@gubra.dk\" rel=\"nofollow\" target=\"_blank\">sbo@gubra.dk</a><span>, +45 4188 9586)</span></p><p class=\"\"><span>Investors: Kristian Borbos (</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:kbo@gubra.dk\" rel=\"nofollow\" target=\"_blank\">kbo@gubra.dk</a><span>, +45 3080 8035) and Emma Jappe Lange (</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:ejl@gubra.dk\" rel=\"nofollow\" target=\"_blank\">ejl@gubra.dk</a><span>, +45 5361 6755)</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Gubra</span></strong></p><p class=\"\"><span>Gubra, founded in 2008 in Denmark and listed on NASDAQ Copenhagen, is a disease-agnostic techbio company specialized in peptide-based drug discovery and preclinical contract research services. Gubra’s activities are focused on the early stages of drug development and are organized in three main business units – Biotech, CRO, and Ventures. The business areas create a unique entity capable of generating a steady cash flow from the CRO business while investing in high-impact biotech R&amp;D projects with significant value inflection potential through partnerships. Gubra has around 300 employees and had revenue of DKK 2.6 billion (around $400 million) in 2025. Seewww.gubra.dkfor more information.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/c0304ac7-15f3-4352-885a-1f56edc1ffb9/gubra-annual-report-2025-incl-sustainability-report.pdf\" rel=\"nofollow\" target=\"_blank\">Gubra Annual Report 2025 (incl Sustainability Report)</a></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/a3daf499-a4aa-46cf-992d-3c3fdb93cb9f/254900T17RRFZONO6W53-2025-12-31-en.zip\" rel=\"nofollow\" target=\"_blank\">254900T17RRFZONO6W53-2025-12-31-en</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:af2b709903c95:0-annual-report-2025-a-record-year/",
            "pub_date": "2026-02-27 14:30:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSb9Vgqa:0",
            "title": "AIZO Group Returns to Profitability with RM1.56 Million PAT in Q2 FY2026 with RM38.23 Million Revenue",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>KUALA LUMPUR, MY / ACCESS Newswire / February 27, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>AIZO Group Berhad</span></strong><span> (\"</span><strong class=\"root-Tkn6WL2y\"><span>AIZO</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\"), announced its unaudited financial results for the second quarter ended 31 December 2025 (\"Q2 FY2026\"), </span><span>delivering revenue of RM38.23 million, representing a 24.0% increase from RM30.82 million recorded in the corresponding quarter last year. Gross profit stood at RM4.26 million compared to RM4.69 million previously, reflecting margin pressures within the bituminous division amid softer global bitumen prices.</span></p><p class=\"\"><span>Notwithstanding this, the Group returned to profitability, </span><span>recording a profit before tax (\"PBT\") of RM1.78 million versus a loss before tax of RM1.55 million in Q2 FY2025. Profit after tax (\"PAT\") amounted to RM1.56 million, a significant turnaround from the RM2.53 million loss recorded a year earlier. The improved performance was primarily driven by stronger work volume at the Selinsing Gold Mine under the civil engineering segment, improved plant availability within the energy division, and the recognition of a one-off waiver of debts during the quarter.</span></p><p class=\"\"><span>On a quarter-on-quarter basis, </span><span>revenue rose 12.6% from RM33.94 million in Q1 FY2026 to RM38.23 million. The civil engineering segment led growth, with revenue increasing to RM29.51 million from RM22.12 million in the preceding quarter, reflecting higher production volume at Selinsing Gold Mine project. However, the bituminous products segment recorded revenue of RM6.91 million, lower than RM9.66 million in Q1 FY2026 due to declining global bitumen prices which exerted downward pressure on selling prices. The energy segment registered revenue of RM1.66 million compared to RM2.10 million previously, mainly attributable to seasonal monsoon conditions affecting generation output.</span></p><p class=\"\"><span>Despite mixed segmental movements, the Group posted a PBT of RM1.78 million compared to a loss before tax of RM1.42 million in Q1 FY2026. The quarter also recorded positive adjusted EBITDA of approximately RM1.2 million, underscoring strengthening operational fundamentals.</span></p><p class=\"\"><span>For the cumulative six-month period ended 31 December 2025, the Group recorded revenue of RM72.17 million and a marginal loss after tax of RM0.31 million, reflecting a continued recovery trajectory compared to prior loss-making periods.</span></p><p class=\"\"><span>En. Ahmad Rahizal Bin Dato' Ahmad Rasidi, Executive Director of AIZO</span></p><p class=\"\"><span>En. Ahmad Rahizal Bin Dato' Ahmad Rasidi, the Executive Director of AIZO commented, \"Q2 FY2026 marks an important inflection point for AIZO as we returned to profitability. The stronger civil engineering output and improved operational efficiency across our segments demonstrate that the restructuring and cost discipline measures implemented earlier are beginning to deliver measurable results. While certain divisions remain sensitive to commodity price movements and seasonal factors, our diversified structure is providing improved earnings stability.\"</span></p><p class=\"\"><span>Looking ahead, AIZO remains cautiously optimistic amid Malaysia's improving macroeconomic landscape, supported by steady GDP expansion, resilient private consumption and stable inflation. The Group will continue to prioritise operational efficiency, disciplined capital expenditure and progress acceleration across its civil works, bituminous manufacturing and renewable energy operations.</span></p><p class=\"\"><span>As at 31 December 2025, AIZO maintained total assets of RM181.30 million and total equity of RM82.98 million, with borrowings managed prudently. The Group remains focused on strengthening balance sheet resilience and enhancing long-term shareholder value as it advances through FY2026.</span></p><p class=\"\"><span>###</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT AIZO GROUP BERHAD</span></strong></p><p class=\"\"><span>AIZO Group Berhad (\"</span><strong class=\"root-Tkn6WL2y\"><span>AIZO</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\"), is primarily a civil engineering specialist and bituminous products manufacturer that has diversified into renewable energy. The Company is a registered solar photovoltaic investor with the Sustainable Energy Development Authority Malaysia and owns a 9.99MW AC floating solar power plant and has expanded its renewable energy portfolio through participation in Malaysia's Large Scale Solar (\"LSS\") programme, including the successful securing of an LSS5 project.</span></p><p class=\"\"><span>For more information, visit https://aizo.com.my/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Issued By:</span></strong><span> Swan Consultancy Sdn. Bhd. on behalf of AIZO Group Berhad</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jazzmin Wan</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> j.wan@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Qian Yu Chow</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> s.chow@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> AIZO Group Berhad</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSb9Vgqa:0/",
            "pub_date": "2026-02-27 14:30:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Obizk7HKa:0",
            "title": "Nordic Financials ASA - Q4 2025 Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Oslo, February 27, 2026.Nordic Financials ASA has today published its report for the fourth quarter of2025.</span></p><p class=\"\"><span>In Q4, the Company continued disciplined capital deployment. Worth mentioningisparticipation in a share issue in Gold Road Inc, and investments in creditinstruments issued by Snowball Software Group. Nordic Financials maintains a focused investment strategy targeting equity andcredit opportunities, supported by a lean and scalable operating model.</span></p><p class=\"\"><span>The full Q4 2025 report is attached.</span></p><p class=\"\"><span>Halldor Chr. TjoflaatCEO, Nordic Financials ASAPhone: +47 47 20 50 00Email: hct@nofin.no</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667058</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Obizk7HKa:0-nordic-financials-asa-q4-2025-report/",
            "pub_date": "2026-02-27 14:30:03",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN0EM:0",
            "title": "BASF seeks more cost cuts as 2026 profit could slip or gain",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Patricia Weiss</span></p><p class=\"\"><span>Germany's chemical giant BASF </span><span> said 2026 adjusted operating income could slip or gain slightly because of challenging markets, prompting it to step up cost saving efforts.</span></p><p class=\"\"><span>In a statement on Friday, it said earnings before interest, tax, depreciation and amortisation (EBITDA), adjusted for special items, could reach between 6.2 billion euros ($7.3 billion) and 7.0 billion euros, compared with 6.6 billion in 2025.</span></p><p class=\"\"><span>\"The start to the first quarter has been as challenging as expected,\" said CEO Markus Kamieth.</span></p><p class=\"\"><span>He cited weak sales volumes in January, with the exception of China, where the timing of New Year celebrations led to a very positive development.</span></p><p class=\"\"><span>First-quarter currency headwinds would likely be 200 million euros, driven by a considerably weaker U.S. dollar.</span></p><p class=\"\"><span>He added the group was now aiming for annual cost savings of 2.3 billion euros by the end of this year, up from 2.1 billion targeted previously.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN0EM:0-basf-seeks-more-cost-cuts-as-2026-profit-could-slip-or-gain/",
            "pub_date": "2026-02-27 14:30:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Obi6tGHKa:0",
            "title": "Arribatec Group ASA - Fourth quarter 2025 financial results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Oslo, Norway, 27 February 2026) Arribatec Group ASA (OSE: ARR, Arribatec)reports another strong quarter marked by solid revenue growth and continuedEBITA improvement. For Q4 2025, the Group achieved revenues of NOK 152,5 million, representing a13,7% year over year increase. EBITA reached NOK 14.4m, corresponding to a9,4%margin, and a NOK 30,2 million EBITA improvement year-over-year.</span></p><p class=\"\"><span>In a separate announcement published yesterday, the Board of Directors hasproposed a cash dividend of NOK 1.00 per share for the financial year 2025,corresponding to a total distribution of approximately NOK 69 million, subjectto approval at the Annual General Meeting on 27 May 2026. Arribatec Group ASA will host a web presentation for the fourth quarterfinancial results 2025 on Friday 27 February 2026 10:00 CET. The presentation will be streamed at:https://www.arribatec.com/arribatec-q4-2025/ Ole Jakob Kjølvik, Interim CEO, Arribatec Group ASA: +47 915 98 935Magnus Hofshagen, CFO, Arribatec Group ASA: +47 484 195    About Arribatec Group ASA, www.arribatec.comArribatec is a software and consulting company headquartered in Oslo,providingdigital business solutions across ERP, enterprise architecture, cloudservices,and business process management. The Company serves more than 1,700 clientsacross 25 countries and is listed on the Oslo Stock Exchange under the tickerARR.</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667059</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Obi6tGHKa:0-arribatec-group-asa-fourth-quarter-2025-financial-results/",
            "pub_date": "2026-02-27 14:30:03",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_XB0WBWI4C:0",
            "title": "TABLE-Hokuriku Electric Power -2025/26 div forecast",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Feb 27 (Reuters) -</span></p><p class=\"\"><span>Hokuriku Electric Power Co Inc</span></p><p class=\"\"><span>CONSOLIDATED EARNINGS ESTIMATES</span></p><p class=\"\"><span>(in billions of yen unless specified)</span></p><p class=\"\"><span>Full year to      Full year to</span></p><p class=\"\"><span>Mar 31, 2026      Mar 31, 2026</span></p><p class=\"\"><span>LATEST           PREVIOUS</span></p><p class=\"\"><span>FORECAST          FORECAST</span></p><p class=\"\"><span>Annual Div      25.00 yen         22.50 yen</span></p><p class=\"\"><span>-Q4 Div         15.00 yen         12.50 yen</span></p><p class=\"\"><span>NOTE - Hokuriku Electric Power Co Inc.</span></p><p class=\"\"><span>If there is no Q1 or Q3 dividend, Q2 will in most cases correspond to the first-half</span></p><p class=\"\"><span>dividend and Q4 to the second-half dividend announced before a new corporate law in 2006</span></p><p class=\"\"><span>allowed companies to pay and report dividends on a quarterly basis.</span></p><p class=\"\"><span>To see Company Overview page, click reuters://REALTIME/verb=CompanyData/ric=9505.T</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_XB0WBWI4C:0-table-hokuriku-electric-power-2025-26-div-forecast/",
            "pub_date": "2026-02-27 14:30:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_XB03PZ5RH:0",
            "title": "TABLE-Hokuriku Electric Power -2025/26 group forecast",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Feb 27 (Reuters) -</span></p><p class=\"\"><span>Hokuriku Electric Power Co Inc</span></p><p class=\"\"><span>CONSOLIDATED EARNINGS ESTIMATES</span></p><p class=\"\"><span>(in billions of yen unless specified)</span></p><p class=\"\"><span>Full Year to      Full Year to</span></p><p class=\"\"><span>Mar 31, 2026      Mar 31, 2026</span></p><p class=\"\"><span>LATEST           PREVIOUS</span></p><p class=\"\"><span>FORECAST          FORECAST</span></p><p class=\"\"><span>Revenues        780.00            780.00</span></p><p class=\"\"><span>Operating        89.00             70.00</span></p><p class=\"\"><span>Recurring        85.00             65.00</span></p><p class=\"\"><span>Net              62.00             48.00</span></p><p class=\"\"><span>EPS           296.81 yen        229.79 yen</span></p><p class=\"\"><span>NOTE - Hokuriku Electric Power Co Inc.</span></p><p class=\"\"><span>To see Company Overview page, click reuters://REALTIME/verb=CompanyData/ric=9505.T</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_XB03PZ5RH:0-table-hokuriku-electric-power-2025-26-group-forecast/",
            "pub_date": "2026-02-27 14:30:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_XB1GO3O8H:0",
            "title": "TABLE-Raccoon Holdings - 9-MTH group results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Feb 27 (Reuters)-</span></p><p class=\"\"><span>Raccoon Holdings, Inc.</span></p><p class=\"\"><span>CONSOLIDATED FINANCIAL HIGHLIGHTS</span></p><p class=\"\"><span>(in billions of yen unless specified)</span></p><p class=\"\"><span>9 months ended      9 months ended       Year to</span></p><p class=\"\"><span>Jan 31, 2026        Jan 31, 2025     Apr 30, 2026</span></p><p class=\"\"><span>LATEST             YEAR-AGO          LATEST</span></p><p class=\"\"><span>RESULTS             RESULTS         FORECAST</span></p><p class=\"\"><span>Sales               4.81                4.56             6.74</span></p><p class=\"\"><span>(+5.5 pct)          (+6.0 pct)       (+10.5 pct)</span></p><p class=\"\"><span>Operating          974 mln             952 mln           1.41</span></p><p class=\"\"><span>(+2.3 pct)         (+104.7 pct)      (+12.4 pct)</span></p><p class=\"\"><span>Recurring          892 mln              1.12             1.40</span></p><p class=\"\"><span>(-20.1 pct)        (+139.3 pct)      (+0.2 pct)</span></p><p class=\"\"><span>Net                579 mln             659 mln          900 mln</span></p><p class=\"\"><span>(-12.1 pct)        (+112.3 pct)      (+7.5 pct)</span></p><p class=\"\"><span>EPS               28.52 yen           30.98 yen        44.27 yen</span></p><p class=\"\"><span>EPS Diluted       28.27 yen           30.74 yen</span></p><p class=\"\"><span>Ann Div                               22.00 yen        27.00 yen</span></p><p class=\"\"><span>-Q2 div           11.00 yen           10.00 yen</span></p><p class=\"\"><span>-Q4 div                               12.00 yen        16.00 yen</span></p><p class=\"\"><span>NOTE - Raccoon Holdings, Inc..</span></p><p class=\"\"><span>To see Company Overview page, click reuters://REALTIME/verb=CompanyData/ric=3031.T</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_XB1GO3O8H:0-table-raccoon-holdings-9-mth-group-results/",
            "pub_date": "2026-02-27 14:30:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_XB0X3CLK9:0",
            "title": "TABLE-Fundely -2025/26 parent forecast",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Feb 27 (Reuters) -</span></p><p class=\"\"><span>Fundely Co., Ltd.</span></p><p class=\"\"><span>PARENT- ONLY EARNINGS ESTIMATES</span></p><p class=\"\"><span>(in billions of yen unless specified)</span></p><p class=\"\"><span>Full Year to      Full Year to</span></p><p class=\"\"><span>Mar 31, 2026      Mar 31, 2026</span></p><p class=\"\"><span>LATEST           PREVIOUS</span></p><p class=\"\"><span>FORECAST          FORECAST</span></p><p class=\"\"><span>Sales            2.63              2.99</span></p><p class=\"\"><span>Operating       122 mln           86 mln</span></p><p class=\"\"><span>Recurring       66 mln            28 mln</span></p><p class=\"\"><span>Net             64 mln            26 mln</span></p><p class=\"\"><span>EPS            5.11 yen          2.12 yen</span></p><p class=\"\"><span>NOTE - Fundely Co., Ltd..</span></p><p class=\"\"><span>To see Company Overview page, click reuters://REALTIME/verb=CompanyData/ric=3137.T</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_XB0X3CLK9:0-table-fundely-2025-26-parent-forecast/",
            "pub_date": "2026-02-27 14:30:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2943432:0",
            "title": "TENAGA: Revenue and profit surged year-over-year, with strong liquidity and stable outlook for 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue rose 19.4% year-over-year to RM67.7 billion, with profit after tax up 19% to RM4.77 billion, driven by higher electricity sales and lower taxation. A one-off tax adjustment reduced retained earnings, but liquidity remains strong and stable earnings are expected for 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2943432-00e0b0b7618bb8bba415d6e6712b4cd1\" target=\"_blank\">Tenaga Nasional Bhd [TENAGA] Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2943432:0-tenaga-revenue-and-profit-surged-year-over-year-with-strong-liquidity-and-stable-outlook-for-2026/",
            "pub_date": "2026-02-27 14:16:19",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2AY:0",
            "title": "Stefaan Debusschere To Become Recticel Group CEO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Recticel NV </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>JAN VERGOTE TO TRANSITION FROM CEO TO EXECUTIVE CHAIRMAN OF BOARD OF DIRECTORS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>STEFAAN DEBUSSCHERE TO BECOME RECTICEL GROUP CEO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CHANGES TAKE EFFECT ON 2 MARCH 2026</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2AY:0-stefaan-debusschere-to-become-recticel-group-ceo/",
            "pub_date": "2026-02-27 14:16:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227000697:0",
            "title": "U.S. 10-Year Treasury Yield Falls to Three-Month Low Below 4% — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The 10-year U.S. Treasury yield slips to a three-month low just below 4% in Asian trade as investors remain attentive to geopolitical developments. \"The latest round of U.S.-Iran talks in Geneva acted as a catalyst to trim down risk across the board,\" says Pepperstone's Michael Brown in a note. However, a sustainable fall below the 4% handle isn't in sight, at least for now. \"We do remain, just about, within the longer-run range here,\" the senior research strategist says. Should the 10-year yield trade under 4.00% on a closing basis, that would give U.S. Treasury bulls some degree of control in the near term, he says. The 10-year Treasury yield was last trading at 3.997%, down 1.9 basis points, according to Tradeweb. (emese.bartha@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227000697:0/",
            "pub_date": "2026-02-27 14:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN0CF:0",
            "title": "Fugro posts annual loss, CFO to step down",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Dutch geological data specialist Fugro </span><span> on Friday reported a 21 million euro annual loss reflecting challenges in the offshore wind industry and said its finance chief would step down in April.</span></p><p class=\"\"><span>The Amsterdam-listed firm's consolidated revenue came in at 1.85 billion euros ($2,18 billion), missing the 1.87 billion euros expected in an LSEG poll of analysts.</span></p><p class=\"\"><span>($1 = 0.8470 euros)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN0CF:0-fugro-posts-annual-loss-cfo-to-step-down/",
            "pub_date": "2026-02-27 14:17:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}