{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW1AA:0",
            "title": "Japan-U.S. Summit Statement To Call For 'Golden Age' Of Bilateral Ties, Nikkei Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nikkei:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">JAPAN-U.S. SUMMIT STATEMENT TO CALL FOR 'GOLDEN AGE' OF BILATERAL TIES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">STATEMENT WILL EMPHASIZE REALIZING FREE AND OPEN INDO-PACIFIC AND BRINGING JAPAN-U.S. ALLIANCE TO \"NEW HEIGHTS\"</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ISHIBA, TRUMP, WILL ISSUE JOINT STATEMENT AFTER THEIR SUMMIT FRIDAY LAYING OUT SHARED VIEWS ON THE ECONOMY, SECURITY AND CHINA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW1AA:0-japan-u-s-summit-statement-to-call-for-golden-age-of-bilateral-ties-nikkei-reports/",
            "pub_date": "2025-02-06 00:18:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310217:0",
            "title": "Gibson Energy Maintained at Outperform with a $29.00 Price Target by National Bank of Canada",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">National Bank of Canada on Wednesday reiterated its outperform rating on the shares of Gibson Energy  and its $29.00 price target. </p><p class=\"\">Gibson recently announced that Sean Brown stepped down from his role as chief financial officer. Riley Hicks succeeded Brown in the role. </p><p class=\"\">National Bank said that during Brown's tenure since early 2016, the company delivered a total return of over 115% on the back of firming up its cash flow quality profile and solidifying an investment grade balance sheet. </p><p class=\"\">Meanwhile, Hicks joined Gibson in 2018 and most recently held the position of senior VP, corporate development, marketing and strategy.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310217:0/",
            "pub_date": "2025-02-06 00:18:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008032:0",
            "title": "Match's CEO Switch Fails to Quell Dating-App Growth Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Denny Jacob</p><p class=\"\">Match Group shares fell as the naming of a new CEO failed to quell concerns about the dating company's growth prospects.</p><p class=\"\">The online dating company on Tuesday named board member Spencer Rascoff as its new chief executive officer, replacing Bernard Kim.</p><p class=\"\">The timing was somewhat surprising but fit into a history of executive turnover at Match. Kim, who was recruited from mobile gaming company Zynga in 2022, would have had his contract automatically renewed in May.</p><p class=\"\">J.P. Morgan's Cory Carpenter in a note following the announcement said while the change wasn't shocking given challenges during Kim's tenure, this \"is not something we expected this soon.\"</p><p class=\"\">Rascoff, who joined the board last year as part of an agreement between Match and activist Elliott Investment Management, appeared to hint at Match's execution challenges.</p><p class=\"\">\"I'm here as CEO to make sure that the plans get executed and then some. I'm bringing urgency, I'm bringing accountability and prior experience to the role,\" said Rascoff, who noted he would buy $2 million worth of stock on Thursday as a sign of his conviction in the company, on an earnings call Wednesday.</p><p class=\"\">Shares are off about 7.5% at $33.75. The stock is down around 81% from its all-time closing high of $175.53 in October 2021.</p><p class=\"\">The Dallas company is turning to new executives to right the ship. Match in October named Steven Bailey as chief financial officer, effective March 1. Gary Swidler will leave the CFO role but remain as president.</p><p class=\"\">Match's priorities will circle around innovating Tinder, meeting its three-year targets laid out at its Investor Day, and keeping its activist investors--which includes Starboard Value and Anson Funds Management--at bay.</p><p class=\"\">The activists have pushed Match to improve its performance. Of the three, Starboard has been the most vocal about Match's struggles and said it should consider going private if it can't fix Tinder and hit on other growth opportunities.</p><p class=\"\">Representatives for the three activist investors couldn't be reached immediately for comment on Rascoff's appointment.</p><p class=\"\">Results from the fourth quarter present a mixed picture on the company's progress. Revenue declined slightly to $860 million from $866 million in the prior-year period, but exceeded Wall Street's estimates of $857.1 million.</p><p class=\"\">At Tinder, however, revenue from the app declined 3.4% to $476 million year-over-year, while the number of paying users edged down to 9.5 million. The dating app has posted declining payers on a year-over-year basis since the second quarter of 2023.</p><p class=\"\">Match also offered detailed revenue guidance for the first quarter and 2025, which was below Wall Street's estimates on a reported basis. Analysts noted that adjusted revenue guidance for 2025 was consistent with the outlook provided at Investor Day in December but relies on assumed strength in the back half of the year.</p><p class=\"\">\"While [foreign-exchange-neutral] revenue guidance was maintained, it's also back-weighted driven by assumptions Tinder [monthly active user] trends improve,\" Citi analyst Ygal Arounian said in a research note.</p><p class=\"\">Write to Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008032:0/",
            "pub_date": "2025-02-06 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008033:0",
            "title": "Chinese Retailer Stocks Fall After USPS Pauses, Then Resumes Shipping",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">Shares of Chinese online retail companies pared back losses after the U.S. Postal Service said it would resume accepting packages from China and Hong Kong--a reversal from its announcement the previous night that it would stop accepting such packages--though the stocks remained down amid continued uncertainty about the effect of tariffs.</p><p class=\"\">Chinese online marketplace Alibaba saw its New York-traded American depositary receipts fall as low as $99.69, a 2.6% drop from market close on Tuesday, but they recovered some of their loss Wednesday morning. New York-traded ADRs of PDD, which owns budget e-retailer Temu, dipped as much as 4.6% to $108.83 after market close, and were still recently down 3%.</p><p class=\"\">The stocks have had a week of ups and downs as the Trump administration's 10% tariffs on Chinese imports threaten to upend their distribution of low-cost products to U.S. customers. The USPS said Wednesday morning it is working with Customs and Border Protection to establish an efficient way to collect the new tariffs while limiting distribution to package delivery.</p><p class=\"\">Some U.S.-based companies that rely on cheap shipping from China also reacted. Amazon's stock fell as much as 2.7% from Tuesday's closing price.</p><p class=\"\">As part of the tariffs, Trump also closed a trade loophole that has helped many Chinese retailers keep prices low for U.S. customers. The loophole, called de minimis, allows exports under $800 to enter the U.S. without duties, and has been crucial savings for e-commerce companies selling cheap clothing, electronics and furniture from China.</p><p class=\"\">Nearly 1.4 billion shipments in 2024 claimed the de minimis exemption, a more-than-sixfold increase from a decade ago, Customs and Border Protection said in January. The cost savings of de minimis has helped companies like Temu offer prices 20% to 40% lower than U.S. competitors and make an estimated $20 billion in 2024, KeyBanc analyst Brad Thomas told The Wall Street Journal.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008033:0-chinese-retailer-stocks-fall-after-usps-pauses-then-resumes-shipping/",
            "pub_date": "2025-02-06 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310208:0",
            "title": "Chipotle Mexican Grill's Guidance for Flattish Transactions in Q1 Conservative, BofA Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chipotle Mexican Grill's  outlook for flattish transactions in Q1 and sequentially slower same-store sales growth in Q2 is likely conservative, BofA Securities said in a note Wednesday. </p><p class=\"\">The outlooks assume that trends would slow against tougher laps despite the company having comp drivers in place, BofA said. </p><p class=\"\">\"We expect restaurant margins will be highest in Q2 to Q3 on seasonally higher volumes — despite headwinds from portion control and potential Q2 sales deleverage — and assume Q4 margins improve over Q1,\" BofA analyst Sara Senatore said in the note. </p><p class=\"\">BofA reduced its Q1 same-store sales growth outlook to 3% from 4.5% to reflect weather and calendar shift headwinds. The firm also lowered its full-year same-store sales growth estimate to 4.3% from 5.1%, but kept its earnings per share view unchanged at $1.34. </p><p class=\"\">BofA maintained its buy rating and $71 price objective on the Chipotle Mexican Grill stock. </p><p class=\"\">The company's shares were down 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310208:0/",
            "pub_date": "2025-02-06 00:19:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310222:0",
            "title": "Update: Kenvue Stockholder Starboard Nominates Four Directors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with Kenvue's statement in the fifth paragraph.)</p><p class=\"\">Kenvue  activist investor Starboard Value has nominated four candidates for Kenvue's board ahead of the company's 2025 annual meeting, according to a US Securities and Exchange Commission filing Wednesday. </p><p class=\"\">The hedge fund and its affiliates, which hold about 22 million shares, cited concerns over financial performance and governance, claiming that Kenvue has missed financial targets, lost market share, and failed to capitalize on its brand portfolio. </p><p class=\"\">Starboard said it tried to engage with Kenvue's leadership multiple times since October 2024. </p><p class=\"\">\"We are deeply concerned that the Board's continued complacency and deference to management will jeopardize the tremendous value creation opportunity we believe is possible at Kenvue,\" according to the filing. </p><p class=\"\">Kenvue said Wednesday that its board has been assessing Starboard's nominations and will provide a \"formal recommendation in due course.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310222:0/",
            "pub_date": "2025-02-06 00:19:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX70m9WY:0",
            "title": "Michael Trites Joins Aembit as Senior Vice President of Global Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1000px;aspect-ratio:1.6666666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX70m9WY-d66f9e6254fd1920233eebf397fc1f31-resized.webp\" type=\"images/webp\"/><img alt=\"Aembit\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX70m9WY-d66f9e6254fd1920233eebf397fc1f31-resized.jpeg\" style=\"background-color:#e17744\"/></picture></div></figure></span></p><p class=\"\">SILVER SPRING, Md., Feb.  05, 2025  (GLOBE NEWSWIRE) — Aembit, the non-human identity and access management (IAM) company, today announced that Michael Trites has joined the company as senior vice president of global sales. In this role, Trites will lead Aembit’s global sales strategy, driving adoption of its industry-first Workload IAM Platform.</p><p class=\"\">Trites brings over two decades of experience scaling sales organizations at high-growth security companies. He previously served as executive vice president of global sales at Dig Security, a provider of data security posture management, where he helped drive the company’s expansion and go-to-market strategy, leading to its acquisition by Palo Alto Networks.</p><p class=\"\">\"Michael's track record spearheading adoption in emerging cybersecurity markets makes him the ideal leader to accelerate Aembit's growth,\" said David Goldschlag, co-founder and CEO of Aembit. \"His expertise will be essential as we help organizations recognize the importance of securing and managing their rapidly growing mix of client workloads, AI agents, and service accounts.\"</p><p class=\"\">Prior to Dig, Trites held sales executive roles at CyCognito, BigID (recognized by Deloitte as one of North America’s fastest-growing companies from 2020 to 2024), and Zimperium, where he helped expand market reach and drive revenue growth. He also spent more than a decade at Riverbed Technology, where he advanced through multiple sales leadership roles, ultimately overseeing sales for the Americas East region. Most recently, he led global sales at MineOS, focusing on data privacy and compliance solutions.</p><p class=\"\">Now at Aembit, he is focused on helping organizations secure non-human identities by authenticating client workloads, enforcing access rights, and issuing short-lived credentials – eliminating static secrets and reducing an attack surface increasingly implicated in high-profile data breaches.</p><p class=\"\">“Aembit’s approach to non-human identity management fills a major gap in modern security,” Trites said. “Many solutions highlight the risk, but almost none actually solve it. Unlike tools that only provide visibility into service accounts, Aembit enforces policy-based, secretless access and removes the need for developers to build authentication into applications. That lets companies move faster and build with confidence. I’m excited to help bring this model to more organizations.”</p><p class=\"\">For more information about Aembit, users can visit www.aembit.io.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aembit</strong></p><p class=\"\">Aembit is the leading provider of workload identity and access management solutions, designed to secure non-human identities like applications, AI agents, and service accounts across on-premises, SaaS, cloud, and partner environments. Aembit’s no-code platform enables organizations to enforce access policies in real time, ensuring the security and integrity of critical infrastructure. Users can visit the official website aembit.io and LinkedIn.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">Apurva Davé</p><p class=\"\">info@aembit.io</p><p class=\"\">Aembit on LinkedIn</p><p class=\"\">Website </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CMO</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apurva Davé</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aembit</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">dkaplan@aembit.io</strong></p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/f007ac12-a88a-415e-956e-91b9049a2bba</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aembit</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Aembit</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX70m9WY:0-michael-trites-joins-aembit-as-senior-vice-president-of-global-sales/",
            "pub_date": "2025-02-06 00:19:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008038:0",
            "title": "Harley-Davidson Growing Impatient with Electric Spinoff — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Harley-Davidson CEO Jochen Zeitz says the company's electric motorcycle spinoff \"needs to perform\" following another disappointing year. LiveWire sold 612 bikes in 2024, far below its expectation of up to 1,500 bikes, and lost $110 million. Its CEO, Karim Donnez, says the company is cutting costs and hopes to succeed in Europe with a new \"maxi-scooter.\" Harley owns nearly 90% of LiveWire, and some analysts say the spinoff's losses are dragging down Harley's financial results. Zeitz says while the slow adoption of EV vehicles has hurt LiveWire, \"we'll obviously have to look at some optionalities\" if results don't improve. (john.keilman@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008038:0/",
            "pub_date": "2025-02-06 00:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008036:0",
            "title": "Celestica Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:20 GMT) </strong>Celestica Price Target Raised to $160.00/Share From $140.00 by RBC Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008036:0/",
            "pub_date": "2025-02-06 00:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310233:0",
            "title": "Jefferies Adjusts PG&E's Price Target to $20 From $25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PG&amp;E  has an average rating of overweight and mean price target of $22.47, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310233:0/",
            "pub_date": "2025-02-06 00:20:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0XW:0",
            "title": "New York Times shares sink as current quarter forecast misses consensus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in New York Times Co  down 10.9% on Wednesday, hitting lowest level since May, on track for biggest one-day drop since June 2022 after quarterly report as subscription rev forecasts for the current quarter disappointed</p><p class=\"\">** NYT reported Q4 rev of $726.63 mln vs consensus view of $726.65 mln with adj EPS of $0.80 above consensus est of $0.74, as per LSGE</p><p class=\"\">** However, signaling intense competition for new readers in a busy year for media industry, NYT forecast subscription revenue growth of 7% to 10% for  Q1, with midpoint of range missing analysts' estimate of 9.9%, according to Visible Alpha     </p><p class=\"\">** After hitting low of $48.35 for session so far, NYT last traded at $49.90 vs median PT of $57, according to LSEG, which shows 12 analyst ratings: 2 'strong buy,' 4 'buy,' and 6 'hold' recommendations</p><p class=\"\">** NYT shares down 4.1% YTD after rising 6.2% in 2024 vs 2.5% gain YTD and 1.9% gain in 2024 for S&amp;P 400 media &amp; entertainment index (.SPMDCME) </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0XW:0-new-york-times-shares-sink-as-current-quarter-forecast-misses-consensus/",
            "pub_date": "2025-02-06 00:20:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310227:0",
            "title": "Griffon Keeps Quarterly Dividend Steady at $0.18 per Share, Payable March 18 to Shareholders of Record on Feb. 25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310227:0/",
            "pub_date": "2025-02-06 00:20:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0VL:0",
            "title": "US yields tumble to multi-week lows after service sector data, tariff risks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-year yield hits lowest since mid-December</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US two-year yield falls to lowest since Dec. 12</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US two/10-year yield curve flattens, narrowest gap since Dec. 23</li></ul></span></div><span><p class=\"\">    U.S. Treasury yields dropped to multi-week lows on Wednesday, weighed down by a weak report on the services sector, with investors continuing to grapple with persistent uncertainty about the Trump administration's tariff policy and the prospect of trade wars.</p><p class=\"\">    The benchmark 10-year yield dropped to its lowest since mid-December after the services data. It was last down 8.5 basis points (bps) at 4.428% . The two-year yield also fell, sliding to its weakest level since Dec. 12. It last changed hands at 4.170%, down 4.4 bps.  </p><p class=\"\">    The drop came after data showed the U.S. services sector activity unexpectedly slowed in January.</p><p class=\"\">The Institute for Supply Management's (ISM) non-manufacturing purchasing managers index (PMI) slipped to 52.8 last month from 54.0 in December. Economists polled by Reuters had forecast the services PMI edging up to 54.3.</p><p class=\"\">But the market focus remains on tariffs and trade wars.</p><p class=\"\">    \"The trade war is the recent thing driving yields. We've had the big threat of tariffs and that hasn't really materialized, at least for the moment,\" said Kathy Jones, chief fixed income strategist at Schwab in New York.  </p><p class=\"\">    \"And that was a relief to the market from the point of view of inflation or the price impact of tariffs ... But it's really a day-by-day, really a minute-by-minute assessment of the outlook. What is the outlook for the next six to 12 months?\"  </p><p class=\"\">    The uncertain outlook on tariffs came as the U.S. trade deficit widened sharply in December. Imports     surged to a record high     against the backdrop of tariff threats, which might have prompted businesses to rush purchases of foreign-made goods like metals and computers.  </p><p class=\"\">    The trade gap increased 24.7% to $98.4 billion, the highest since March 2022, from a revised $78.9 billion in November, the Commerce Department's Bureau of Economic Analysis said. The rise was the largest since March 2015. Imports increased 3.5% to an all-time high of $364.9 billion.   </p><p class=\"\">    The United States posted significant deficits with several trade partners, including China, Mexico and Canada, which have been targeted by President Donald Trump's administration for broad or additional tariffs. Trump on Monday suspended a 25% tariff on Mexican and Canadian goods until next month.  </p><p class=\"\">    In other parts of the bond market, the yield curve flattened, with the gap between two-year and 10-year yields hitting 23.7 bps (US2US10=TWEB), from 29.5 bps in the previous session.   </p><p class=\"\">    The curve hit its narrowest spread since Dec. 23, with traders describing it as a bull flattener, a scenario in which long-term rates are falling faster than short-dated one. The flattening of the curve reflects concerns about the growth and inflation outlook that could prompt the Federal Reserve to hold interest rates unchanged for longer.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0VL:0-us-yields-tumble-to-multi-week-lows-after-service-sector-data-tariff-risks/",
            "pub_date": "2025-02-06 00:20:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0V1:0",
            "title": "Canada to host summit on boosting economy after Trump tariff threat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        Canadian business and labor leaders will meet in Toronto this Friday to discuss diversifying trade and boosting the economy in the wake of U.S. threats to impose tariffs, Prime Minister Justin Trudeau said on Wednesday.  </p><p class=\"\">    U.S. President Donald Trump on Monday said he would     delay     the imposition of tariffs on Canadian exports by 30 days in return for concessions on border and crime enforcement.  </p><p class=\"\">    The move underlined long-standing calls for measures to reduce reliance on the United States, which takes 75% of all Canada's goods and services exports.  </p><p class=\"\">    Trudeau said the one-day meeting would group leaders in trade, business, public policy, and organized labor to build what he called a long-term prosperity agenda.  </p><p class=\"\">    \"(They) will explore ways to grow Canada’s economy, make it easier to build and trade within the country, diversify export markets, and rejuvenate productivity,\" he said in a statement.  </p><p class=\"\">    Trudeau's office did not immediately respond to a request for a list of attendees.  </p><p class=\"\">    Business groups have long complained about internal trade barriers between the 10 provinces and a drawn-out permitting process that means it can take years to develop and build mines, oil pipelines and other major industrial projects.   </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0V1:0-canada-to-host-summit-on-boosting-economy-after-trump-tariff-threat/",
            "pub_date": "2025-02-06 00:13:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310219:0",
            "title": "Goldman Sachs Adjusts PPG Industries' Price Target to $135 From $153",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PPG Industries  has an average rating of overweight and mean price target of $135.80, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310219:0/",
            "pub_date": "2025-02-06 00:13:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008008:0",
            "title": "U.S. Crude Oil Stockpiles Rise More Than Expected",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anthony Harrup</p><p class=\"\">U.S. crude oil stocks increased more than expected as production picked up, while the build in gasoline stocks extended to almost three months, according to data released Wednesday by the U.S. Energy Information Administration.</p><p class=\"\">Commercial crude oil stocks excluding the Strategic Petroleum Reserve rose by 8.7 million barrels to 423.8 million barrels in the week ended Jan. 31, and were about 5% below the five-year average for the time of year, the EIA said. Analysts surveyed by The Wall Street Journal had predicted crude stockpiles would increase by 1.3 million barrels.</p><p class=\"\">Oil stored in the SPR rose by 250,000 barrels to 395.1 million barrels. Oil stocks at Cushing, Okla., the Nymex delivery hub, slipped by 34,000 barrels to 20.9 million barrels.</p><p class=\"\">The EIA estimated U.S. crude oil production at 13.48 million barrels a day, up by 238,000 barrels a day from the week before. Crude imports rose by 467,000 barrels a day to 6.9 million barrels a day, and exports rose by 645,000 barrels a day to 4.3 million barrels a day.</p><p class=\"\">Refinery capacity use increased by 1 percentage point to 84.5%. Refinery runs were forecast to slip by 0.1 percentage points in the Journal survey.</p><p class=\"\">Gasoline inventories grew for a 12th consecutive week, rising by 2.2 million barrels to 251.1 million barrels, and were slightly above the five-year average, the EIA said. Gasoline stocks were forecast to be up by 100,000 barrels. Gasoline demand was little changed at 8.3 million barrels a day.</p><p class=\"\">Distillate fuel stocks fell by 5.5 million barrels to 118.5 million barrels, against expectations of a 1.6 million barrel draw, and were 12% below the five-year average.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Change in U.S. oil inventories for the week ended Jan. 31: <br/> <br/>                   Crude       Gasoline      Distillates         Refinery Use <br/>EIA data:           8.7           2.2           -5.5                  1.0 <br/>Forecast:           1.3           0.1           -1.6                 -0.1 <br/> </pre><p class=\"\">Note: Numbers in millions of barrels, with the exception of refinery use, which is in percentage points.</p><p class=\"\">Write to Anthony Harrup at anthony.harrup@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008008:0-u-s-crude-oil-stockpiles-rise-more-than-expected/",
            "pub_date": "2025-02-06 00:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012106:0",
            "title": "Novo Nordisk Expects Positive News on Weight-Loss Drugs, Soon, From FDA — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis and Elsa Ohlen</p><p class=\"\">Novo Nordisk fourth-quarter results comfortably beat expectations, easing some of investors' recent concern about the stock, including fierce competition from Eli Lilly.</p><p class=\"\">Yet, it wasn't all good news for the Danish pharma giant and maker of blockbuster weight-loss and diabetes drugs Ozempic and Wegovy. It also forecast slower sales growth ahead.</p><p class=\"\">Novo posted fourth-quarter earnings of 6.34 ($0.88) Danish kroner a share on sales of 85.7 billion DKK, beating expectations for earnings of 5.98 DKK a share on sales of 80.1 billion DKK, according to FactSet.</p><p class=\"\">Novo's American depositary receipts, or ADRs, were up 3.9% to $85.80 in premarket trading Wednesday. Novo's Danish listed shares rose 3.6%.</p><p class=\"\">Soaring sales of Ozempic and Wegovy has helped the Danish company to overtake luxury conglomerate LVMH as Europe's most valuable company.</p><p class=\"\">But Novo shares have taken a beating in recent months, with the stock's ADRs falling nearly 40% in the last six months of 2024. Shares first slid on growing worries that sales Wegovy and Ozempic wouldn't live up to the hype, and then on disappointing trial data for its next-generation weight-loss drug CagriSema.</p><p class=\"\">A positive pipeline update in January wasn't enough to reverse the momentum, and ADRs were down roughly 30% over the past 12 months as of Tuesday.</p><p class=\"\">Novo's Wegovy and Ozempic are among the most consequential, closely watched new medications in recent history, but they face serious competition both from Lilly's rival drugs Mounjaro and Zepbound and from legal copycats manufactured by compounding pharmacies and sold by telehealth firms. While compounders will soon be barred from selling knockoffs of the Lilly drugs, Novo's drugs remain in shortage, and can legally be copied.</p><p class=\"\">Ozempic sales for the quarter came in at 33.9 billion DKK, slightly above expectations of 33 billion DKK, according to analysts surveyed by FactSet. Wegovy sales more than doubled from the same period last year, and were largely in line with expectation at 19.9 billion DKK.</p><p class=\"\">Novo now forecast sales growth of between 16% and 24% in 2025, less than the 26% growth observed in 2024. Operating profit growth is expected to be between 19% and 27%, compared with a 26% growth in 2024.</p><p class=\"\">The guide range was broader than expected but better than feared and in line with the mid-point consensus call of 20%, according to BofA analyst Sachin Jain.</p><p class=\"\">\"We see an intact, strong demand for obesity treatments in the U.S. and elsewhere,\" CEO Lars Fruergaard Jørgensen said in a call with journalists early Wednesday. He highlighted that the 2025 guidance assumes a \"quite significant\" ramp in volumes in the U.S.</p><p class=\"\">The new outlook reflects expected continued periodic supply constraints and related drug shortages.</p><p class=\"\">Lingering supply constrains have been a worry for investors as Novo's inability to meet the huge demand for its products has hampered sales.</p><p class=\"\">In December, Novo closed an $11 billion deal to ramp up its supply of GLP-1 medicines, though it could take time for the results of that deal to be felt in the market.</p><p class=\"\">\"If we redirect everything that we have of GLP-1 to the U.S. we will be immediately out of the drug shortage situation,\" Henrik Wulff, executive vice president for product supply, quality, and information technology at Novo, told Barron's in December. But Novo serves markets worldwide.</p><p class=\"\">\"We try to balance these launches up against the in-market demands, and try to guesstimate how we can get out of the drug shortages,\" he said.</p><p class=\"\">Shares of Novo have yet to recover from a startling update in late December on CagriSema, a drug that combines the active ingredient in Ozempic and Wwgovy, Semaglutide, with Novo had said it expected patients to lose at least 25% of their body weight on CagriSema, but in a Phase 3 trial patients only lost 22.7%.</p><p class=\"\">In January, Novo unveiled early results on another weight loss drug, amycretin, which appeared very promising, though the drug has years of studies ahead of it before it can make it to market.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com and Elsa Ohlen at elsa.ohlen@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012106:0/",
            "pub_date": "2025-02-06 00:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008012:0",
            "title": "News Highlights: Top Global Markets News of the Day - Wednesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">ADP says 183,000 private-sector jobs created in January. Labor market in pretty good shape.</strong></p><p class=\"\">Hiring off to good start in 2025</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Postal Service Resumes Shipments of China Parcels</strong></p><p class=\"\">The service said it would work with Customs to collect new tariffs with 'least disruption' to package deliveries.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The biggest part of the U.S. economy cools off early in the new year. So does inflation.</strong></p><p class=\"\">The large service side of the economy has powered U.S. growth for the past few years and is primed to do so again in 2025.</p><p class=\"\">No need to hike interest rates unless economy is overheating, Fed's Barkin says <br/> <br/> <br/>U.S. trade deficit hits second highest level ever as Trump weighs more tariffs</p><p class=\"\">The trade deficit surged in December and the U.S. finished 2024 with the second largest gap ever, perhaps in part because some businesses sought to bring in more imports before President Trump raised tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China's Lunar New Year Travel, Spending Boom Offer Positive Signs</strong></p><p class=\"\">Tourism revenues in China during the eight-day holiday that ended Tuesday rose 7.0% in year-over-year terms, while the number of domestic trips rose 5.9%, state media reported.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">S&amp;P 500, Nasdaq Futures Fall With Google, AMD in Focus</strong></p><p class=\"\">U.S. stocks were mixed with traders poring over disappointing results from Google parent Alphabet and chip maker Advanced Micro Devices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Excessive ECB Caution Could Push Inflation Below Target</strong></p><p class=\"\">The European Central Bank should avoid excessive caution in lowering its key interest rate, but must also be alert to signs that inflation is taking longer than expected to fall to its target, Chief Economist Philip Lane said Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Keeps Plans for Bond Issuance Steady. It's a Relief, for Now.</strong></p><p class=\"\">Strategists had been on edge, speculating over whether a change in language could be coming that would signal larger auctions of long-term bonds.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Options Traders Bet the Rally in Big Tech Stocks Has More Room to Run</strong></p><p class=\"\">They are scooping up contracts that would pay out if stocks like Apple and Amazon race higher in the next few weeks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008012:0-news-highlights-top-global-markets-news-of-the-day-wednesday-at-11-am-et/",
            "pub_date": "2025-02-06 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008013:0",
            "title": "News Highlights: Top Financial Services News of the Day - Wednesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">No need to hike interest rates unless economy is overheating, Fed's Barkin says <br/> <br/> <br/>SEC Ousts Top Litigator Who Battled With Crypto Giants</p><p class=\"\">The agency, seeking to make peace with the crypto market, reassigned its head of litigation to a job in its information-technology office.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Options Traders Bet the Rally in Big Tech Stocks Has More Room to Run</strong></p><p class=\"\">They are scooping up contracts that would pay out if stocks like Apple and Amazon race higher in the next few weeks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Crypto Industry Looks to New SEC Task Force for Quick Action in Its Favor</strong></p><p class=\"\">Industry groups have a wish list they say could bring more regulatory clarity around cryptocurrencies and allow for growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Venture Firm Founded by Ex-Apollo Partner Acts as Sherpa to Startups Raising Debt</strong></p><p class=\"\">Overlap Holdings blends traditional venture investing-it just raised a $33 million fund-with lender-startup matchmaking.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Elizabeth Warren Agrees With Trump: Big Banks Discriminate</strong></p><p class=\"\">The progressive senator from Massachusetts says banks have been shutting down too many accounts without explanation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Santander Shares Get Boost From Buyback, Better-Than-Expected Results</strong></p><p class=\"\">Shares in Spain's biggest bank by assets were sharply higher after its results, and it said it was confident it would be able to boost profitability again in 2025, raising a target despite projecting broadly stable revenue for the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Credit Agricole Lifts Dividend After Hitting Growth Target a Year Early</strong></p><p class=\"\">The lender raised its dividend by 5% on year, after exceeding its medium-term growth target a year ahead of schedule.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Services Roundup: Market Talk</strong></p><p class=\"\">Find insight on Santander, BlackRock, PayPal and more in the latest Market Talks covering Financial Services.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Its Direct Stakes in Three Companies</strong></p><p class=\"\">The firm said it would increase its investment in the companies by $1.1 billion in total as part of its unusual strategy of taking long-term stakes in businesses it likes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008013:0-news-highlights-top-financial-services-news-of-the-day-wednesday-at-11-am-et/",
            "pub_date": "2025-02-06 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008015:0",
            "title": "News Highlights: Top Energy News of the Day - Wednesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil prices drop on rising U.S. inventories and fears tariffs will dent Chinese demand</strong></p><p class=\"\">Oil futures fell Wednesday, poised to mark their lowest settlement of the year so far, after official U.S. data showed a weekly climb of nearly 9 million barrels in U.S. crude inventories and as investors feared that a U.S.-China trade battle could dent demand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Venezuela's Citgo Is Proving a Tough Sell for Bidders</strong></p><p class=\"\">The coming auction for Venezuela's Citgo Petroleum could leave its buyer on the hook to other creditors of the South American country, a stumbling block for the court-ordered sale.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Find insight on TotalEnergies, oil and natural gas futures, and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV's Net Profit Rises Despite Weak Refining Margins</strong></p><p class=\"\">The oil-and-gas company's refining margin fell to $5.9 a barrel, compared with $9.9 a barrel a year ago.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008015:0-news-highlights-top-energy-news-of-the-day-wednesday-at-11-am-et/",
            "pub_date": "2025-02-06 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008014:0",
            "title": "News Highlights: Top Company News of the Day - Wednesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney to Centralize Streaming Offerings Within Disney+</strong></p><p class=\"\">The entertainment company plans to add more live ESPN shows to its main streaming service, saying customers want simplicity.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Outlook Provides Some Welcome Relief</strong></p><p class=\"\">The company's shares rose as investors breathed a sigh of relief on strong sales growth and guidance, despite ongoing capacity constraints and fears over the U.S. demand outlook for Wegovy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Uber's stock falls in the face of its 'strongest quarter ever.' Here's why.</strong></p><p class=\"\">The ride-hailing company faces stiff pressure from the strong U.S. dollar, which is weighing on its forecast for the current quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Santander Shares Get Boost From Buyback, Better-Than-Expected Results</strong></p><p class=\"\">Shares in Spain's biggest bank by assets were sharply higher after its results, and it said it was confident it would be able to boost profitability again in 2025, raising a target despite projecting broadly stable revenue for the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tempur Sealy to Become Somnigroup After Mattress Firm Deal Closes</strong></p><p class=\"\">The world's largest mattress supplier and manufacturer said its Mattress Firm, Dreams and Tempur Sealy businesses will operate as decentralized units under the Somnigroup umbrella after the name change, which takes effect on Feb. 18.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Starboard Launches Proxy Fight at Kenvue</strong></p><p class=\"\">Activist investment firm Starboard Value has launched a proxy battle with pharmacy supplier Kenvue, running a slate of four board nominees including Starboard head Jeff Smith.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Ford Names Electric Vehicle Exec as Next Strategy Chief</strong></p><p class=\"\">Ford Motor named Marin Gjaja as chief strategy officer, part of a broader leadership change.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Merck Is Suffering From a Classic Pharma Problem</strong></p><p class=\"\">Blockbuster Keytruda makes up nearly half of Merck's sales. That's becoming an issue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Harley-Davidson's stock slips after Q4 loss amid 'cyclical headwinds for discretionary products'</strong></p><p class=\"\">The high-interest rate environment has impacted consumer confidence, according to Harley-Davidson CEO Jochen Zeitz</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Watchdog Probes AMD's $5 Billion ZT Systems Acquisition</strong></p><p class=\"\">Advanced Micro Devices agreed to buy the designer of data-center equipment last year to challenge Nvidia's dominance in AI.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008014:0-news-highlights-top-company-news-of-the-day-wednesday-at-11-am-et/",
            "pub_date": "2025-02-06 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008010:0",
            "title": "Aviat Networks Up Over 27%, on Pace for Largest Percent Increase Since May 2020 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aviat Networks, Inc. (AVNW) is currently at $26.12, up $5.57 or 27.1%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Sept. 4, 2024, when it closed at $26.44</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since May 13, 2020, when it rose 31.42%</li><li class=\"listItem-bmN0_SHH\">Currently up five consecutive days; up 44.47% over this period</li><li class=\"listItem-bmN0_SHH\">Longest winning streak since July 16, 2024, when it rose for five straight trading days</li><li class=\"listItem-bmN0_SHH\">Best five day stretch since the five days ending Feb. 5, 2021, when it rose 52.29%</li><li class=\"listItem-bmN0_SHH\">Up 44.23% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 97.76% from its all-time closing high of $1164.00 on March 8, 2000</li><li class=\"listItem-bmN0_SHH\">Down 27.16% from 52 weeks ago (Feb. 7, 2024), when it closed at $35.86</li><li class=\"listItem-bmN0_SHH\">Down 31.87% from its 52-week closing high of $38.34 on March 28, 2024</li><li class=\"listItem-bmN0_SHH\">Up 90.66% from its 52-week closing low of $13.70 on Nov. 6, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $26.65; highest intraday level since Sept. 5, 2024, when it hit $26.87</li><li class=\"listItem-bmN0_SHH\">Up 29.68% at today's intraday high; largest intraday percent increase since Oct. 7, 2024, when it rose as much as 32.95%</li></ul><p class=\"\">All data as of 11:11:41 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008010:0/",
            "pub_date": "2025-02-06 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008016:0",
            "title": "Alphabet Is Maintained at Overweight by JP Morgan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:15 GMT) </strong>Alphabet Price Target Cut to $220.00/Share From $232.00 by JP Morgan</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008016:0/",
            "pub_date": "2025-02-06 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310221:0",
            "title": "Raymond James Adjusts Fair Isaac Price Target to $2,030 From $2,090",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of Hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310221:0/",
            "pub_date": "2025-02-06 00:15:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310220:0",
            "title": "Stifel Adjusts Price Target on NXP Semiconductors NV to $210 From $231",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NXP Semiconductors NV  has an average rating of overweight and mean price target of $249.31, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310220:0/",
            "pub_date": "2025-02-06 00:15:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310223:0",
            "title": "Citigroup Adjusts Palantir Technologies' Price Target to $110 From $42",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palantir Technologies  has an average rating of hold and mean price target of $86.50, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310223:0/",
            "pub_date": "2025-02-06 00:15:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310187:0",
            "title": "Market Chatter: Exxon Mobil Lists Pioneer's Headquarters for Lease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Exxon Mobil  has placed Pioneer Natural Resources' headquarters in Irving, Dallas, up for lease, Bloomberg reported Wednesday, citing a listing on LoopNet. </p><p class=\"\">Exxon is moving Pioneer's employees to its Spring campus and other locations, according to the report. </p><p class=\"\">The property, with an area of 1.1 million square feet, was completed in 2019 and leased to Pioneer for 20 years without any termination options, Bloomberg said, citing building owner PRP. </p><p class=\"\">Exxon Mobil and PRP did not immediately respond to MT Newswires' requests for comment. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310187:0/",
            "pub_date": "2025-02-06 00:07:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:bfdbb5219094b:0",
            "title": "ETF Inflows Hit Record $92B in January, Boosting Market Optimism",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Despite market volatility in late January, ETFs saw a record-breaking $92 billion in inflows, more than doubling the $39 billion monthly average. U.S. equity ETFs led the surge with $40 billion, making up nearly 90% of all equity ETF inflows. </p><p class=\"\">Sector-focused funds also attracted $10 billion, with Financials and Technology ETFs pulling in $9 billion combined. Bond ETFs recorded $37 billion, the second-largest inflow on record, fueled by $7 billion in bank loan and CLO ETFs. </p><p class=\"\">Active ETFs saw unprecedented demand, with $43 billion in inflows across equity and fixed-income funds. As global markets rally, ETF flows reflect rising investor confidence. The SPDR S&amp;P 500 ETF Trust (SPY) remains the world's largest ETF, followed by the Vanguard S&amp;P 500 ETF (VOO) and iShares Core S&amp;P 500 ETF (IVV). </p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:bfdbb5219094b:0-etf-inflows-hit-record-92b-in-january-boosting-market-optimism/",
            "pub_date": "2025-02-06 00:07:09",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310205:0",
            "title": "Citigroup Adjusts Archer-Daniels-Midland's Price Target to $51 From $53",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Archer-Daniels-Midland  as an average rating of hold and mean price target of $52.82, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310205:0/",
            "pub_date": "2025-02-06 00:08:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007985:0",
            "title": "SSR Mining Up Over 16%, On Pace For Largest Percent Increase Since March 2020 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SSR Mining Inc (SSRM) is currently at $9.54, up $1.35 or 16.42%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Feb. 12, 2024, when it closed at $9.72</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since March 24, 2020, when it rose 19.82%</li><li class=\"listItem-bmN0_SHH\">Currently up six of the past seven days</li><li class=\"listItem-bmN0_SHH\">Currently up three consecutive days; up 18.74% over this period</li><li class=\"listItem-bmN0_SHH\">Best three day stretch since the three days ending Dec. 11, 2024, when it rose 27.87%</li><li class=\"listItem-bmN0_SHH\">Up 37% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 79.14% from its all-time closing high of $45.70 on Nov. 6, 2007</li><li class=\"listItem-bmN0_SHH\">Up 1.65% from 52 weeks ago (Feb. 7, 2024), when it closed at $9.38</li><li class=\"listItem-bmN0_SHH\">Down 1.9% from its 52-week closing high of $9.72 on Feb. 12, 2024</li><li class=\"listItem-bmN0_SHH\">Up 139.57% from its 52-week closing low of $3.98 on March 15, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $9.60; highest intraday level since Feb. 12, 2024, when it hit $9.82</li><li class=\"listItem-bmN0_SHH\">Up 17.22% at today's intraday high; largest intraday percent increase since March 24, 2020, when it rose as much as 23.33%</li></ul><p class=\"\">All data as of 11:07:06 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007985:0/",
            "pub_date": "2025-02-06 00:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}