{
    "data": [
        {
            "id": "DJN_DN20250204004659:0",
            "title": "PayPal Earnings Show Refresh Is Working. Why the Stock Is Dropping Anyway. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Emily Dattilo</p><p class=\"\">PayPal easily beat quarterly estimates for earnings and sales and issued solid guidance, but it wasn't enough to boost the stock.</p><p class=\"\">For its fourth quarter, the fintech reported adjusted earnings of $1.19 per share, beating Wall Street's call for $1.12, according to FactSet. Net revenue of $8.37 billion was above the consensus estimate for $8.26 billion.</p><p class=\"\">Total payment volume increased 7% to $437.8 billion, while transaction margin dollars rose 7% to $3.9 billion.</p><p class=\"\">\"We set out at the beginning of 2024 to narrow our focus, improve execution, and reposition the business,\" CEO Alex Chriss said in a statement. \"One year later, I'm proud that we've laid a strong foundation for long-term, profitable growth across the company's most important areas.\"</p><p class=\"\">\"The improvements we made to branded checkout, peer-to- peer, and Venmo, plus the progress we made on our price-to-value strategy, are beginning to show up in our results,\" he continued. \"The strong momentum we've created sets us up well for 2025, which is about scaling adoption.\"</p><p class=\"\">For its first quarter, PayPal anticipates adjusted earnings per share between $1.15 and $1.17, while analysts had penciled in $1.13. It also expects transaction margin dollar growth between 4% and 5%.</p><p class=\"\">For fiscal 2025, the company forecasts adjusted earnings between $4.95 and $5.10, while analysts had expected $4.90. It is calling for transaction margin dollar growth between 4% and 5%.</p><p class=\"\">PayPal's board also authorized a new $15 billion stock repurchase program.</p><p class=\"\">Still, the stock fell 5.8% to $84.30 in premarket trading Tuesday. Fintech peers mostly traded higher. SoFi Technologies rose 0.8% and Affirm gained 0.6%, while Block slipped 0.4%.</p><p class=\"\">Mizuho analyst Dan Dolev, who rates PayPal at Outperform with a price target of $100, offered possible reasoning for the stock decline.</p><p class=\"\">Branded total payment volume growth of 6% fell short of targets, he wrote, adding that \"the health of the Branded Checkout button is the heart of the debate around the future of PYPL.\"</p><p class=\"\">Write to Emily Dattilo at emily.dattilo@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204004659:0/",
            "pub_date": "2025-02-04 22:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007475:0",
            "title": "Merck Down Over 11%, on Pace for Largest Percent Decrease Since March 2008 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Merck &amp; Co., Inc. (MRK) is currently at $88.22, down $11.57 or 11.59%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be lowest close since Oct. 7, 2022, when it closed at $87.60</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent decrease since March 31, 2008, when it fell 14.74%</li><li class=\"listItem-bmN0_SHH\">Currently down two of the past three days</li><li class=\"listItem-bmN0_SHH\">Down 11.31% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 33.65% from its all-time closing high of $132.96 on June 24, 2024</li><li class=\"listItem-bmN0_SHH\">Down 30.47% from 52 weeks ago (Feb. 6, 2024), when it closed at $126.88</li><li class=\"listItem-bmN0_SHH\">Down 33.65% from its 52-week closing high of $132.96 on June 24, 2024</li><li class=\"listItem-bmN0_SHH\">Would be a new 52-week closing low</li><li class=\"listItem-bmN0_SHH\">Traded as low as $87.33; lowest intraday level since Oct. 7, 2022, when it hit $87.12</li><li class=\"listItem-bmN0_SHH\">Down 12.49% at today's intraday low; largest intraday percent decrease since March 16, 2020, when it fell as much as 12.55%</li><li class=\"listItem-bmN0_SHH\">Worst performer in the S&amp;P 500 today</li><li class=\"listItem-bmN0_SHH\">Worst performer in the DJIA today</li><li class=\"listItem-bmN0_SHH\">Fourth most active stock in the S&amp;P 500 today</li><li class=\"listItem-bmN0_SHH\">Subtracted 71.12 points from the DJIA so far today</li></ul><p class=\"\">All data as of 9:50:36 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007475:0/",
            "pub_date": "2025-02-04 22:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0GN:0",
            "title": "Generali to realise €1bn profit from BPCE asset management combination",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - The combination of Generali's asset management division with BPCE's Natixis Investment Managers is expected to generate a realised profit for the Italian insurance group of around €1bn ($1.03bn) at closing, which would be neutral for the calculation of the group's adjusted net result.</p><p class=\"\">Last month it was announced that French banking group BPCE and Generali had agreed a tie-up between their asset management divisions to create a leading European asset manager with €1.9trn of assets under management.</p><p class=\"\">Generali in a statement on Tuesday provided more details about the transaction – which is expected to close by 2026 – and its likely impact on the group.</p><p class=\"\">The insurer revealed that it has committed to contribute a total of €15bn in seed money over the first five years to launch new initiatives and investment strategies, with a primary focus on the alternative investments segment.</p><p class=\"\">Seed money activities will be in the form of the subscription of funds and investment mandates, including cash flows of ~€25bn generated by Generali’s insurance portfolios each year between redemptions of maturing securities, coupons and dividends that are reinvested in the various asset classes.</p><p class=\"\">\"Seed money is not a new concept for Generali: the group already has a seeding policy enabling the investment of a portion of its insurance portfolios for launching new strategies deemed high-potential and consistent with the group's insurance portfolio allocation objectives,\" said the statement.</p><p class=\"\">\"The combination with Natixis IM offers a unique value creation opportunity for the Generali Group, estimated to exceed €1bn. This estimate reflects the present value of the expected economic benefit from seed money and the synergies expected from the transaction, net of integration costs and higher taxes.\"</p><p class=\"\">Revenue synergies and operational efficiencies have been identified totalling €210mn annually pre-tax, driven by greater growth potential and cross-selling opportunities. This does not include the expected contribution from the future deployment of seed money, which could contribute to a further increase in estimated revenues through the launch of new high-potential products.</p><p class=\"\">The proposed transaction would, at closing, result in an overall impact of €25mn and €50mn including costs to achieve over the first two years. This excludes the impact of a preferential €250mn dividend in favour of BPCE for the first two years only, which would see an impact to Generali Group between flat and -€25mn.</p><p class=\"\">The net impact on remittance from Generali's group subsidiaries is estimated to be negative for ~€100mn cumulatively over the 2025-27 strategic plan period, mostly due to costs to achieve and ancillary costs.</p><p class=\"\">According to the statement, the combined business is expected to generate revenues of around €4.1bn. In comparison, the upcoming combination of BNP Paribas and Axa Investment Managers will create an entity with €3.4bn in revenues, with European rival Amundi at €3.2bn.</p><p class=\"\">Amundi is currently the region’s biggest asset manager and ninth-largest globally with €2trn of assets under management, according to analysis by Oliver Wyman.</p><p class=\"\">The combined Generali-Natixis entity will be one of the largest managers of insurance assets globally with €0.7trn insurance assets under management, roughly the same as the combined BNP Paribas-Axa IM business and slightly higher than BlackRock (€0.6trn).</p><p class=\"\">Generali Investments will contribute more than €600bn in assets, with Natixis Investment Managers contributing €1.3bn. The new company will have a significant presence in the US, with notable potential for growth in Asia, as well as ambitions to develop the platform as a global leader in managing assets for insurance clients.</p><p class=\"\">As previously reported, under the terms of the 15-year agreement, BPCE and Generali will each have 50 percent of the voting rights.</p><p class=\"\">BPCE’s CEO Nicolas Namias will serve as chairman of the combined business, while Generali CEO Philippe Donnet will be vice chairman.</p><p class=\"\">Woody Bradford, the current CEO of Generali Investments, will serve as CEO of the combined business, while Philippe Setbon, Natixis Investment Managers’ current CEO, will be deputy CEO of the joint venture.</p><p class=\"\">The board of directors of the new entity will be composed of 15 directors, with Generali Investments and Natixis Investment Managers each appointing six directors. Three independent directors will be jointly selected.</p><p class=\"\">The joint venture will be established in Amsterdam, with Italy, France and the US remaining as the operational hubs from which business activities will continue to be directly managed.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0GN:0-generali-to-realise-1bn-profit-from-bpce-asset-management-combination/",
            "pub_date": "2025-02-04 22:53:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007482:0",
            "title": "Pool Corp Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:54 GMT) </strong>Pool Corp Price Target Cut to $360.00/Share From $370.00 by Wells Fargo</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007482:0/",
            "pub_date": "2025-02-04 22:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007478:0",
            "title": "Mohawk Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007478:0/",
            "pub_date": "2025-02-04 22:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308949:0",
            "title": "PennyMac Mortgage Investment Trust Plans Offering of Senior Secured Notes Due 2030",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PennyMac Mortgage Investment Trust  disclosed plans Tuesday for an underwritten public offering of senior unsecured notes maturing in 2030. </p><p class=\"\">After first paying underwriter discounts and other offering expenses, the mortgage real estate investment trust expects to use net proceeds from the upcoming securities offering to fund the business and its investment activities, including the purchase of subordinated bonds from its private-label securitization unit and other mortgage-related securities. </p><p class=\"\">A portion of the proceeds also may be used to repay existing debt, including PennyMac's 5.5% exchangeable senior notes due 2026, or funding other general business purposes, the company said. </p><p class=\"\">PennyMac also is planning to list the 2030 notes on the New York Stock Exchange, which if approved, would trade under the \"PMTV\" symbol. </p><p class=\"\">PMT shares were down 0.7% in early trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308949:0/",
            "pub_date": "2025-02-04 22:54:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1IY:0",
            "title": "Gold miners up as bullion prices hit record high",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of gold miners jump as bullion prices regain an all-time high </p><p class=\"\">** Spot gold  up 0.9% at $2,839.81/ounce, after hitting a record high of $2,836.98 earlier in the session, driven by investors seeking the safe-haven asset after China retaliated with tariffs on the U.S. in response to President Donald Trump's tariffs</p><p class=\"\">** Top miners Newmont  and Barrick Gold  up ~1% and 1.5%, respectively</p><p class=\"\">** U.S.-listed shares of South African miners Gold Fields  up 1% and Sibanye Stillwater  up 1.4%</p><p class=\"\">** Shares of Canadian miner Kinross Gold  up ~1%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1IY:0-gold-miners-up-as-bullion-prices-hit-record-high/",
            "pub_date": "2025-02-04 22:54:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0HW:0",
            "title": "BP poised to invest up to $25 billion in Iraq’s Kirkuk oil and gas",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">BP investment would be over course of 25-year profit-sharing agreement</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Project aims to raise capacity to 450,000 bpd in 2-3 years</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Contract expected to be signed in the first half of February</li></ul></span></div><span><p class=\"\">    Oil major BP  is expected to spend up to $25 billion over the lifetime of a project to redevelop four Kirkuk oil and gas fields, a senior Iraqi oil official told Reuters, as Baghdad seeks to win back foreign investment.</p><p class=\"\">Provided the deal is signed, which the official said could be over the coming weeks, it would mark a breakthrough for Iraq, where output has been constrained by years of war, corruption and sectarian tensions.</p><p class=\"\">Even so it is the second-largest oil producer in the Organization of the Petroleum Exporting Countries (OPEC), behind only Saudi Arabia.</p><p class=\"\">The senior official with direct knowledge of the issue said BP would invest between $20 billion and $25 billion over a profit-sharing agreement that would last more than 25 years.</p><p class=\"\">BP did not immediately respond to a request for comment on the size of the deal, which has not previously been made public.</p><p class=\"\">The Iraqi official requested anonymity because he was not authorised to speak publicly on the issue.</p><p class=\"\">The prospective BP agreement would be the second major deal between Iraq and an international oil company in as many years after an agreement in Basra with TotalEnergies , valued at around $27 billion.</p><p class=\"\">IRAQ'S DOMESTIC NEEDS    </p><p class=\"\">The BP deal is focused on rehabilitating facilities in four oilfields and developing natural gas to support Iraq's domestic energy needs. </p><p class=\"\">The official said technical and economic negotiations were progressing well and final contracts could be signed in the first half of February and possibly by the end of this week.   </p><p class=\"\">Under the terms of the contract, BP would boost crude production capacity from the four oilfields in Kirkuk by 150,000 barrels per day (bpd) to raise total capacity to at least 450,000 bpd in 2-3 years, the official said.</p><p class=\"\">That compares with current capacity of 300,000 bpd, according to three officials from the state-run North Oil Company (NOC).</p><p class=\"\">Under the profit-sharing model being discussed, the senior oil official said BP would be able to recover costs and start making profits once it has increased output beyond current levels.</p><p class=\"\">BP has deep knowledge of the Kirkuk fields.</p><p class=\"\">It was a member of the consortium of companies that discovered oil in Kirkuk in the 1920s and has estimated the area holds about 9 billion barrels of recoverable oil.</p><p class=\"\">The oil major and the Iraqi oil ministry signed in 2013 a letter of intent to study developing Kirkuk but that deal was put on hold in 2014 when the Iraqi military collapsed in the face of Islamic State's advance in northern and western Iraq, allowing the Kurdish Regional Government (KRG) to take control of the Kirkuk region.</p><p class=\"\">Baghdad regained full control of the deposit from the KRG in 2017 after a failed Kurdish independence referendum.</p><p class=\"\">BP then resumed its studies on the field, but in late 2019 it pulled out of the oilfield after its 2013 service contract expired with no agreement on the field's expansion.</p><p class=\"\">BP holds a 50% stake in a joint venture operating the giant Rumaila oilfield in the south of the country, where it has been operating for a century.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0HW:0-bp-poised-to-invest-up-to-25-billion-in-iraq-s-kirkuk-oil-and-gas/",
            "pub_date": "2025-02-04 22:54:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308951:0",
            "title": "UBS Adjusts Price Target on Henry Schein to $83 From $73, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Henry Schein  has an average rating of overweight and mean price target of $79, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308951:0/",
            "pub_date": "2025-02-04 22:54:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1H8:0",
            "title": "Citi sticks to hybrid working, bucks return-to-office trend, FT reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Citigroup  CEO Jane Fraser has informed top executives the bank will stick to its hybrid work schedule, the Financial Times reported on Tuesday citing people familiar with the matter. </p><p class=\"\">The bank is deviating from the norm on Wall Street, where many have begun to enforce strict back-to-office mandates. Last month, JPMorgan Chase  asked employees on hybrid work schedules to return to the office five days a week starting in March, an internal memo seen by Reuters showed. </p><p class=\"\">Citi currently allows a majority of its employees to work remotely up to two days a week. The bank declined to comment on the report. </p><p class=\"\">Fraser's promise came on a quarterly call with the bank's managing directors in mid-January, the newspaper reported.</p><p class=\"\">Several business leaders, particularly in the financial industry, have been strong advocates of working from the office, saying it fosters better learning, innovation and culture.</p><p class=\"\">However, critics have cited increasing commuting costs and lack of flexibility among their key concerns.</p><p class=\"\">Fraser believes Citi's more flexible in-office work requirements give it a competitive advantage, the Financial Times reported.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1H8:0-citi-sticks-to-hybrid-working-bucks-return-to-office-trend-ft-reports/",
            "pub_date": "2025-02-04 22:54:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446573:0",
            "title": "Stocks in Italy Hit 17-year High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IT40 increased to a 17-year high of 36628.00 Index Points.</p><p class=\"\">Over the past 4 weeks, Italy Stock Market Index (IT40) gained 5.25%, and in the last 12 months, it increased 18.27%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446573:0-stocks-in-italy-hit-17-year-high/",
            "pub_date": "2025-02-04 22:55:15",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446574:0",
            "title": "TSX Rebounds After Tariff Delay",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P/TSX Composite Index rose 0.5% to above the 25,380 mark on Tuesday, after Prime Minister Trudeau confirmed that U.S. tariffs on Canadian goods would be paused for at least 30 days.</p><p class=\"\">This delay eased immediate concerns over trade disruptions that had weighed on Canadian equities amid fears of weaker export demand and reduced foreign exchange inflows.</p><p class=\"\">Leading the gains, Shopify, Canadian Pacific Railway, and CIBC climbed between 1.3% and 1.8%.</p><p class=\"\">Additionally, the energy sector rebounded with heavyweight Canadian Natural Resources surging around 2%, despite plunging oil prices as Canada’s major oil export destination signals reduced room for negotiating terms of trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446574:0-tsx-rebounds-after-tariff-delay/",
            "pub_date": "2025-02-04 22:55:30",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV15K:0",
            "title": "Trump’s tariff threats hang over young Arnault’s mission to fix LVMH drinks unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Alexandre Arnault becomes deputy CEO at LVMH drinks unit</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Son of LVMH boss says struggling business needs restructuring</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump tariff threats complicate recovery efforts</li></ul></span></div><span><p class=\"\">    Alexandre Arnault is taking a key role at LVMH's $6 billion wine and spirits business just as U.S. President Donald Trump risks unleashing a trade war, complicating a turnaround effort that could decide the 32-year-old's future in his father's empire.   </p><p class=\"\">The alcohol division, whose brands include Moët &amp; Chandon champagne and Hennessy cognac, has seen its revenues fall for two straight years and its operating profit plunge by over a third in 2024.</p><p class=\"\">Its challenges are only likely to get tougher if Trump's newly-imposed tariffs on China add to an economic slowdown there, and if he follows through on threatened levies on Europe. </p><p class=\"\">Alexandre Arnault, one of LVMH CEO Bernard Arnault's five children vying for more responsibility in their father's empire, told Reuters he needed a few months to draw up a plan.</p><p class=\"\">\"Give us 100 days to wrap our heads around it and understand the business ... because it's a business that will need a lot of restructuring,\" he said on the sidelines of the group's annual results last week.</p><p class=\"\">The United States is the wine and spirit unit's largest market by sales, with just over a third of its high-end cognac and champagne sold there. Accounting for less than 10% of LVMH group sales, the unit is vulnerable to trade tensions. </p><p class=\"\">Trade data shows LVMH's cognac business increased deliveries to the U.S. in December as distributors built up inventories.</p><p class=\"\">France's luxury groups were hit in Trump's first presidential term when he targeted champagne and handbags over a French digital services tax he decided would harm U.S. firms.  </p><p class=\"\">\"Whilst we continue to believe that the U.S. spirits market will recover further, tariffs bring short-term uncertainty,\" Barclays wrote in a note on Tuesday.</p><p class=\"\">TRUMP TIES</p><p class=\"\">Bernard Arnault and members of his family have cultivated personal ties with Trump. Bernard, his wife Helene Mercier, Alexandre, and daughter Delphine, who runs Dior, sat right behind America's former presidents at Trump's inauguration. </p><p class=\"\">Praising a \"wind of optimism\" in the United States, Bernard Arnault said last week that LVMH was looking at raising production capacity there.    </p><p class=\"\">Alexandre took over as deputy CEO of the alcohol unit on Monday, alongside long-time LVMH finance chief Jean-Jacques Guiony, an industry veteran. Alexandre marked the change on his Instagram account with a post showing he was heading to one of LVMH's grand cru estates in Burgundy. </p><p class=\"\">Shedding parts of the struggling business was \"not on the agenda\", Bernard Arnault said last week in response to recent speculation LVMH could revisit its ties to Diageo , which holds a minority stake in the drinks division. He said he would keep a close eye on the next moves from his son and Guiony. </p><p class=\"\">\"I'm sure they'll get everything back on the growth track. Let's give them two years to show what they can do,\" Bernard Arnault, 75, said. </p><p class=\"\">Alexandre is expected to draw on his experience from previous executive roles at German suitcase maker Rimowa and U.S. jeweller Tiffany &amp; Co, where his missions were to revive somewhat ageing brands, freshly acquired by LVMH. </p><p class=\"\">At Tiffany, he grabbed headlines with a buzzy ad campaign featuring Beyonce and Jay-Z while shaking up the nearly 200-year-old brand's image with a controversial new slogan: \"Not Your Mother's Tiffany\". The brand's end-of-year performance showed some signs of improvement, analysts said.   </p><p class=\"\">LVMH has struggled to find growth in its high-end wine and spirits after several years of high inflation in Western economies and as younger drinkers shift to mixed and non-alcoholic drinks.</p><p class=\"\">\"It's a business with less growth expectations than other parts of the company, the difficulties are here to stay\", Barclays analyst Carole Madjo told Reuters. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV15K:0-trump-s-tariff-threats-hang-over-young-arnault-s-mission-to-fix-lvmh-drinks-unit/",
            "pub_date": "2025-02-04 22:55:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308854:0",
            "title": "Granite REIT Modestly Up After Completing $300 Million Offering, Repaying Loan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Granite Real Estate Investment Trust (GRT-UN.TO) on Tuesday rose 1% after its unit, Granite LP, completed a previously announced offering of $300 million of Series 10 senior unsecured debentures, maturing on Dec. 11, 2026. </p><p class=\"\">Granite LP also repaid its $300 million senior unsecured non-revolving term facility in full, using the net proceeds from the offering. </p><p class=\"\">Shares of the company were last seen up $0.74 at $67.16 in early morning trading on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308854:0/",
            "pub_date": "2025-02-04 22:47:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007435:0",
            "title": "Cigna Group Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:48 GMT) </strong>Cigna Group Price Target Cut to $341.00/Share From $370.00 by Wells Fargo</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007435:0/",
            "pub_date": "2025-02-04 22:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV18V:0",
            "title": "Global stocks, currencies find footing in calm after tariff storm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Stocks and currencies held steady on Tuesday as an uneasy calm settled on markets despite the United States and China going tit-for-tat on tariffs, a day after Mexico and Canada won a last-minute reprieve.</p><p class=\"\">The U.S. S&amp;P 500  opened flat, while the tech-heavy Nasdaq  climbed 0.2%.</p><p class=\"\">The S&amp;P dropped 1.9% early on Monday as U.S. President Donald Trump looked set to put 25% tariffs on Mexican and Canadian goods, only to rally and finish 0.76% lower when both countries won a delay by promising to beef up border security.</p><p class=\"\">European stocks  were last flat after falling 0.87% the previous day.</p><p class=\"\">\"We're taking some comfort from the fact that we sort of stepped back from the brink of a global trade war yesterday,\" said Ben Laidler, head of equity strategy at Bradesco BBI.</p><p class=\"\">\"I think the lack of a stronger rebound is that we're not out of the woods yet. We've got 10% being put on China, I think the European Union has been put clearly in the crosshairs.\"</p><p class=\"\">An additional 10% U.S. tariff on Chinese exports took effect at 0501 GMT, and minutes later Beijing announced it was investigating Google and imposing tariffs on imports of U.S. oil, coal, gas, cars and farm equipment from Feb. 10. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:885.6548856548857px;aspect-ratio:1.476091476091476\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV18V-2e65580770a3cd36a16c27d131484759-resized.webp\" type=\"images/webp\"/><img alt=\"U.S. futures and foreign currencies fell then rallied on tariff news\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV18V-2e65580770a3cd36a16c27d131484759-resized.jpeg\" style=\"background-color:#f4f4f3\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Trump's tariff approach sends currencies and stocks on wild ride</span></figcaption></figure></span></p><p class=\"\">The dollar index , which tracks the currency against six major peers, was last 0.18% lower at 108.38, after jumping as high as 109.88 on Monday.</p><p class=\"\">The U.S. currency fell 0.17% against China's offshore yuan  as investors took heart that a negotiation with China may be possible.</p><p class=\"\">\"Investors will remain hopeful that both sides will reach an agreement before long and remove the barriers,\" said Ben Bennett, Asia-Pacific investment strategist at Legal &amp; General Investment Management in Hong Kong.</p><p class=\"\">Hong Kong's Hang Seng  rallied 2.8% overnight, hitting its highest level since December.</p><p class=\"\">Mainland Chinese markets remained shut for the Lunar New Year break, with investors focusing on where China fixes the currency trading band on Wednesday morning for clues as to whether it will seek to weaken the yuan to limit the impact of tariffs.</p><p class=\"\">Trump's press secretary said the president plans to speak with Chinese President Xi Jinping in the next few days.</p><p class=\"\">Investor discomfort had safe-haven gold  trading near record highs at $2,838 an ounce. </p><p class=\"\">Bonds fell slightly after ticking higher on Monday, with benchmark 10-year Treasury yields up 3 bps to 4.569% .</p><p class=\"\">The euro  was steady at $1.0341 while the dollar rose 0.21% to 155.08 yen .</p><p class=\"\">Traders were also focused on company earnings, with Google  reporting after U.S. markets close on Tuesday.</p><p class=\"\">Crude oil prices fell sharply, with Brent crude  down 2.4% to $74.16, the lowest level this year.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV18V:0-global-stocks-currencies-find-footing-in-calm-after-tariff-storm/",
            "pub_date": "2025-02-04 22:48:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007443:0",
            "title": "Woodward Inc Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:49 GMT) </strong>Woodward Inc Price Target Raised to $205.00/Share From $193.00 by Wells Fargo</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007443:0/",
            "pub_date": "2025-02-04 22:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007445:0",
            "title": "Palantir Technologies Up Over 26%, on Track for Record High Close — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palantir Technologies Inc. Class A (PLTR) is currently at $105.84, up $22.10 or 26.39%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be new all-time high (Based on available data back to Sept. 30, 2020)</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Feb. 6, 2024, when it rose 30.8%</li><li class=\"listItem-bmN0_SHH\">Currently up five of the past six days</li><li class=\"listItem-bmN0_SHH\">Currently up four consecutive days; up 32.69% over this period</li><li class=\"listItem-bmN0_SHH\">Longest winning streak since Jan. 23, 2025, when it rose for seven straight trading days</li><li class=\"listItem-bmN0_SHH\">Best four day stretch since the four days ending Nov. 8, 2024, when it rose 41%</li><li class=\"listItem-bmN0_SHH\">Up 39.94% year-to-date</li><li class=\"listItem-bmN0_SHH\">Up 383.93% from 52 weeks ago (Feb. 6, 2024), when it closed at $21.87</li><li class=\"listItem-bmN0_SHH\">Would be a new 52-week closing high</li><li class=\"listItem-bmN0_SHH\">Up 417.02% from its 52-week closing low of $20.47 on April 19, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $105.93; new all-time intraday high (Based on available data back to Sept. 30, 2020)</li><li class=\"listItem-bmN0_SHH\">Up 26.5% at today's intraday high; largest intraday percent increase since Feb. 6, 2024, when it rose as much as 32.66%</li><li class=\"listItem-bmN0_SHH\">Best performer in the S&amp;P 500 today</li><li class=\"listItem-bmN0_SHH\">Most active stock in the S&amp;P 500 today</li><li class=\"listItem-bmN0_SHH\">Best performer in the Nasdaq 100 today</li><li class=\"listItem-bmN0_SHH\">Most active stock in the Nasdaq 100 today</li></ul><p class=\"\">All data as of 9:46:45 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007445:0/",
            "pub_date": "2025-02-04 22:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007446:0",
            "title": "ICE Canada Morning Comment: Canola Adding More Increases",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WINNIPEG, Manitoba--Intercontinental Exchange canola futures moved higher on Tuesday morning, building on gains from Monday. This follows the one-month delay to the United States and Canada imposing tariffs on each other.</p><p class=\"\">Meanwhile, canola defied pressure from sharp declines in Chicago soyoil and more modest losses in soybeans and Malaysian palm oil. European rapeseed was steady to higher. Crude oil prices pulled back with the U.S. and China implementing tariffs on each other.</p><p class=\"\">Canola found additional support in climbing above its major moving averages.</p><p class=\"\">Canola crush margins were higher as the March position exceeded C$167 per tonne above the futures.</p><p class=\"\">The Canadian dollar nudged up on Tuesday morning, with the loonie rising to 69.53 U.S. cents compared to Monday's close of 68.48.</p><p class=\"\">Approximately 15,050 contracts were traded by 9:38 EST and prices in Canadian dollars per metric tonne were:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>           Price      Change <br/>Mar       645.90     up 5.40 <br/>May       652.90     up 5.30 <br/>Jul       658.40     up 4.80 <br/>Nov       644.60     up 2.10 <br/> </pre><p class=\"\">Source: Commodity News Service Canada, news@marketsfarm.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007446:0/",
            "pub_date": "2025-02-04 22:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308941:0",
            "title": "CF Bankshares Launches Share Buyback Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CF Bankshares  said Tuesday it is launching a share buyback program under which it may repurchase up to 325,000 shares, or about 5% of its outstanding common stock, on or before Jan. 31, 2026. </p><p class=\"\">There is no guarantee as to the exact number or value of shares that will be repurchased and the program may be suspended or discontinued at any time, the company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308941:0/",
            "pub_date": "2025-02-04 22:49:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC5XLKTZ:0",
            "title": "CQS Natural Resources Says All Requisitioned Resolutions Defeated At General Meeting",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CQS Natural Resources Growth and Income PLC :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CQS NATURAL RES  - RESULT OF REQUISITIONED GENERAL MEETING</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CQS NATURAL RESOURCES GROWTH AND INCOME PLC - ALL REQUISITIONED RESOLUTIONS DEFEATED AT GENERAL MEETING</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CQS NATURAL RESOURCES GROWTH AND INCOME PLC - OVER 59% OF VOTES CAST AGAINST SABA'S RESOLUTIONS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC5XLKTZ:0-cqs-natural-resources-says-all-requisitioned-resolutions-defeated-at-general-meeting/",
            "pub_date": "2025-02-04 22:49:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007460:0",
            "title": "Core & Main Is Maintained at Overweight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:50 GMT) </strong>Core &amp; Main Price Target Raised to $65.00/Share From $62.00 by Wells Fargo</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007460:0/",
            "pub_date": "2025-02-04 22:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007459:0",
            "title": "Broadridge Declares Quarterly Dividend of $0.88 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Broadridge Declares Quarterly Dividend of $0.88 Per Share</p><p class=\"\">PR Newswire</p><p class=\"\">NEW YORK, Feb. 4, 2025</p><p class=\"\">NEW YORK, Feb. 4, 2025 /PRNewswire/ — Broadridge Financial Solutions, Inc.  announced that its Board of Directors has declared a quarterly cash dividend of $0.88 per share. The dividend is payable on April 3, 2025 to stockholders of record at the close of business on March 13, 2025.</p><p class=\"\">About Broadridge</p><p class=\"\">Broadridge Financial Solutions , a global Fintech leader with over $6 billion in revenues, provides the critical infrastructure that powers investing, corporate governance and communications to enable better financial lives. We deliver technology-driven solutions to banks, broker-dealers, asset and wealth managers and public companies. Broadridge's infrastructure serves as a global communications hub enabling corporate governance by linking thousands of public companies and mutual funds to tens of millions of individual and institutional investors around the world. In addition, Broadridge's technology and operations platforms underpin the daily trading of on average more than U.S. $10 trillion of equities, fixed income and other securities globally. A certified Great Place to Work(R), Broadridge is a part of the S&amp;P 500(R) Index, employing over 14,000 associates in 21 countries. For more information about Broadridge, please visit www.broadridge.com.</p><p class=\"\">Contact Information</p><p class=\"\">Investors</p><p class=\"\">broadridgeir@broadridge.com</p><p class=\"\">Media</p><p class=\"\">Gregg.rosenberg@broadridge.com</p><p class=\"\">View original content:https://www.prnewswire.com/news-releases/broadridge-declares-quarterly-dividend-of-0-88-per-share-302367614.html</p><p class=\"\">SOURCE Broadridge Financial Solutions, Inc.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007459:0/",
            "pub_date": "2025-02-04 22:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007462:0",
            "title": "Amazon Is Maintained at Buy by Benchmark",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:50 GMT) </strong>Amazon Price Target Raised to $265.00/Share From $215.00 by Benchmark</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007462:0/",
            "pub_date": "2025-02-04 22:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308946:0",
            "title": "UBS Adjusts Price Target on Expedia Group to $178 From $176, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Expedia Group  has an average rating of overweight and mean price target of $192.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308946:0/",
            "pub_date": "2025-02-04 22:50:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463511:0",
            "title": "Market Chatter: BP to 'Re-phase' Renewable Fuels Project in Australia",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BP (BP.L) decided to \"re-phase\" its Kwinana renewable fuels project in Australia, Bloomberg News reported Tuesday, citing a company statement. </p><p class=\"\">The oil giant told the news outlet that bioenergy is still core to its strategy and the decision is expected \"to improve capital efficiency and better align the project with government policies.\"</p><p class=\"\">BP did not immediately respond to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463511:0/",
            "pub_date": "2025-02-04 22:50:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8fgWND:0",
            "title": "ThinkMarkets wins ‘Newcomer of the Year 2024’ at TradingView awards",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:900px;aspect-ratio:1.5\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX8fgWND-a131d6fc8dc1e2e913a2200fed4e80e7-resized.webp\" type=\"images/webp\"/><img alt=\"ThinkMarkets\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX8fgWND-a131d6fc8dc1e2e913a2200fed4e80e7-resized.jpeg\" style=\"background-color:#20395e\"/></picture></div></figure></span></p><p class=\"\">LONDON, Feb.  04, 2025  (GLOBE NEWSWIRE) — ThinkMarkets, a leading online trading provider, recently announced that it received an award from TradingView for ‘Newcomer of the Year 2024’. </p><p class=\"\">The annual TradingView awards aim to recognize integrated brokers on its platform that are at the forefront of global online trading and have consistently demonstrated providing their users with the best service over the last 12 months. </p><p class=\"\">TradingView selects the winner for its nominated categories based on a broker’s verified client reviews, feedback, and ratings, as well as client engagement, platform uptime, and more. This ensures all awards are authentic and that only the best brokers receive recognition. </p><p class=\"\">Commenting on the news, co-CEO, Nauman Anees, said the following: </p><p class=\"\">“We’re delighted to win this prestigious TradingView award. Despite launching on the platform only midway through the year in July 2024 and having to compete alongside other brokers that also joined that year, we’re thrilled to have made such an impact. We’ve received an overwhelmingly positive response from both new and existing clients eager to take advantage of this offering. We’re grateful that TradingView and the wider trading community have recognized our efforts with this award, and we’ll continue to expand and improve our offering to ensure we remain a leading choice among traders on TradingView.” </p><p class=\"\">ThinkMarkets also took the opportunity to express a big thank you for the continued support from its clients, partners, and employees who have all helped in their efforts to achieve this prestigious award. </p><p class=\"\">For more information and the latest updates, users can visit: www.thinkmarkets.com </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ThinkMarkets</strong></p><p class=\"\">ThinkMarkets is a global, multi-regulated online brokerage established in 2010 offering clients quick and easy access to 4,000+ CFD instruments across FX, indices, commodities, equities, and more. ThinkMarkets has offices in London, Dubai, Melbourne, and Tokyo and hubs in the Asia-Pacific, Europe, and South Africa. It also operates with several financial licenses around the globe and delivers some of the industry's most recognized trading platforms, including its award-winning platform, ThinkTrader.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ThinkMarkets</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">pr@thinkmarkets.com</strong></p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/a0daee5a-f695-4bad-8f7e-faf0c960bd58</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ThinkMarkets </strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">ThinkMarkets </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8fgWND:0-thinkmarkets-wins-newcomer-of-the-year-2024-at-tradingview-awards/",
            "pub_date": "2025-02-04 22:42:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC11Qzwl:0",
            "title": "Stonegate Capital Partners Updates Coverage on Alliance Resource Partners, L.P. (ARLP) 2024 Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dallas Texas--(Newsfile Corp. - February 4, 2025) -  Alliance Resource Partners, L.P. : Stonegate Capital Partners updates coverage on Alliance Resource Partners, L.P. ARLP reported a challenging 4Q24, impacted by lower coal sales pricing and higher operating expenses. Total revenues for the quarter decreased by 5.6% year-over-year to $590.1M, primarily due to a 2.3% decline in coal sales volumes. Net income for the quarter was down to $16.3M compared to $115.4M in 4Q23, reflecting higher operating costs and non-cash impairment charges of $31.1M related to the MC Mining operation. Adj. EBITDA came in at $124.0M, a 27.2% decline sequentially. Despite these headwinds, ARLP remains committed to its FY25 guidance, expecting improvements driven by efficiency realizations in its operations, a strengthening order book, and declining domestic inventories.</p><p class=\"\">To view the full announcement, including downloadable images, bios, and more, click here.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key Takeaways:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">ARLP continued to expand its O&amp;G royalties' business, completing $9.6M in mineral interest acquisitions during the quarter.</li><li class=\"listItem-bmN0_SHH\">ARLP reached its coal inventory goal for FY24, reaching 0.6 million tons.</li><li class=\"listItem-bmN0_SHH\">The Company ended 4Q24 with a solid liquidity position of $593.9M, consisting of $137.0M in cash and $456.9M in available credit.</li></ul><p class=\"\"><em>Click image above to view full announcement.</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Stonegate</strong></p><p class=\"\">Stonegate Capital Partners is a leading capital markets advisory firm providing investor relations, equity research, and institutional investor outreach services for public companies. Our affiliate, Stonegate Capital Markets (member FINRA) provides a full spectrum of investment banking, equity research and capital raising for public and private companies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts:</strong></p><p class=\"\">Stonegate Capital Partners</p><p class=\"\">(214) 987-4121</p><p class=\"\">info@stonegateinc.com</p><p class=\"\">Source: Stonegate, Inc.</p><p class=\"\">To view the source version of this press release, please visit https://www.newsfilecorp.com/release/239566</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC11Qzwl:0-stonegate-capital-partners-updates-coverage-on-alliance-resource-partners-l-p-arlp-2024-q4/",
            "pub_date": "2025-02-04 22:42:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007411:0",
            "title": "Pfizer Shares Rise on Better-Than-Expected 4Q",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jared S. Hopkins</p><p class=\"\">Pfizer shares climbed Tuesday after the pharmaceutical company beat fourth-quarter estimates and reaffirmed its full-year guidance.</p><p class=\"\">The positive quarter caps a busy year of cost cutting and pressure from an activist investor as Pfizer has sought to turn around company performance. Shares rose 1.2% to $26.51 soon after market open.</p><p class=\"\">Sales for the fourth quarter rose to $17.76 billion, compared with $17.35 billion from analysts polled by FactSet. Pfizer reported $14.57 billion in sales a year ago.</p><p class=\"\">The New York-based pharma giant saw strong sales from drugs used to treat a range of diseases, including heart drug Vyndaquel, up 61% to $1.55 billion, and from oncology drugs, which saw sales grow 27% to more than $4 billion. New cancer drugs from the $43 billion acquisition of Seagen also aided sales.</p><p class=\"\">Pfizer reaffirmed its 2025 guidance of revenue between $61 billion and $64 billion, and of adjusted per-share earnings of between $2.80 and $3.</p><p class=\"\">Excluding certain items, earnings totaled 63 cents a share, compared with 47 cents a share forecast by analysts.</p><p class=\"\">Investors have been cool to Pfizer, with shares down some 50% since record highs in 2021. Pfizer Chief Executive Albert Bourla has been looking to turn around the company's performance, taking steps such as a multi-billion-dollar cost-cutting program.</p><p class=\"\">A closely watched weight-loss drug is expected to finish testing in the coming weeks, and Bourla has said the company is committed to being in the white-hot obesity market.</p><p class=\"\">Write to Jared S. Hopkins at jared.hopkins@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007411:0/",
            "pub_date": "2025-02-04 22:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1HQ:0",
            "title": "Grain trader ADM falls on Q4 profit miss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Grain trader ADM's shares  fall 3.4% to $48.37 in early morning trade</p><p class=\"\">** Company reported Q4 adj. EPS of $1.14/share vs est of $1.15/share - data compiled by LSEG</p><p class=\"\">** ADM raises dividend by 1 cent per share; says targeting cutting between $500 mln and $750 mln in spending over the next 3 to 5 years</p><p class=\"\">** Company says it is looking to lay off 600-700 people in 2025; it had 41,802 employees, according to its 2023 annual report</p><p class=\"\">** Expects adj. EPS for 2025 in the range of $4/share to $4.75/share, midpoint of which is below analysts' expectations of $4.67/share - LSEG </p><p class=\"\">** ADM down ~9.5% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1HQ:0-grain-trader-adm-falls-on-q4-profit-miss/",
            "pub_date": "2025-02-04 22:43:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}