{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463671:0",
            "title": "Japanese Service Sector Sees Strongest Growth in Four Months Amid Rising Inflation and Employment Surge -S&P",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In January, the Japanese service sector experienced its strongest growth in business activity in four months, as indicated by the au Jibun Bank Japan Services Business Activity Index reaching 53.0. </p><p class=\"\">This upturn was driven by a significant rise in new business inflows, which prompted firms to increase employment levels to meet growing demand, according to S&amp;P Global statement on Wednesday. </p><p class=\"\">The sector's expansion was primarily seen in Transport &amp; Storage and Finance &amp; Insurance, while Information &amp; Communication faced a slight decline. </p><p class=\"\">Export demand contributed positively, rising for the first time in four months, particularly from parts of Asia. </p><p class=\"\">However, inflationary pressures intensified, with input price inflation reaching a five-month high due to rising wages, as well as increased fuel and raw material costs. </p><p class=\"\">As a result, service providers raised prices, leading to the highest inflation in prices charged since May 2024. </p><p class=\"\">Meanwhile,the au Jibun Bank Japan Composite PMI Output Index rose to 51.1 in January from 50.5 in December, remaining above the neutral 50.0 for the third month and indicating the strongest private sector output expansion since last September. </p><p class=\"\">This growth was driven by a solid increase in the service economy, although it was partially offset by a contraction in manufacturing output, as new business volumes reached a five-month high. </p><p class=\"\">Despite a quicker pace of input cost inflation, particularly in the service sector, output price inflation remained historically strong but little changed from December.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463671:0/",
            "pub_date": "2025-02-05 12:17:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:2f3b0f60b094b:0",
            "title": "Federal Reserve speakers on Wednesday include Barkin, Goolsbee, Bowman, and Jefferson",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The times below are listed GMT/US Eastern time. </p><p class=\"\">1400/0900 Federal Reserve Bank of Richmond President Thomas Barkin participates in fireside chat before the Conference Board \"2025: A Year in Preview\" Conference, in New York</p><p class=\"\">1800/1300 Federal Reserve Bank of Chicago President Austan Goolsbee speaks on economic perspectives before hybrid 31st Annual Automotive Insights Symposium</p><p class=\"\">2000/1500 Federal Reserve Board Governor Michelle Bowman gives brief economic update and bank regulation remarks before the 2025 Kansas Bankers Association Harold A. Stones Government Relations Conference</p><p class=\"\">0030/1930 Federal Reserve Vice Chair Philip Jefferson gives lecture, \"Do Non-Inflationary Economic Expansions Promote Shared Prosperity?\" at Swarthmore College, in Swarthmore, Pa</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1115.2941176470588px;aspect-ratio:1.8588235294117648\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:2f3b0f60b094b-6e7c5db741cdb978729e7f77eb491dba-resized.webp\" type=\"images/webp\"/><img alt=\"Federal Reserve\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:2f3b0f60b094b-6e7c5db741cdb978729e7f77eb491dba-resized.jpeg\" style=\"background-color:#b3b2a6\"/></picture></div></figure></span></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:2f3b0f60b094b:0-federal-reserve-speakers-on-wednesday-include-barkin-goolsbee-bowman-and-jefferson/",
            "pub_date": "2025-02-05 12:18:19",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0ET:0",
            "title": "India's Swiggy slides ahead of Q3 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Swiggy  falls ~2% ahead of Q3 results later in the day</p><p class=\"\">** This will be food and grocery delivery firm's first quarterly report since going public in November 2024</p><p class=\"\">** Analysts expect consol loss of 6.17 bln rupees ($70.8 mln), per data compiled by LSEG</p><p class=\"\">** Co's Q2 consol loss was 6.26 bln rupees</p><p class=\"\">** ICICI Securities sees 20% y/y rise in SWIG's food delivery gross order value (GOV)</p><p class=\"\">** Expects quick-commerce (QC) segment GOV to grow 108.9% y/y</p><p class=\"\">** Anand Rathi Research says QC segment's EBITDA margins will contract 80-100 bps q/q on heightened competition, rival Zepto's relentless cash burn</p><p class=\"\">** Last month, SWIG dropped below IPO price (390 rupees) for the first time</p><p class=\"\">** Rival Zomato 's Q3 profit more-than-halved on rising competition in QC, increased expenses</p><p class=\"\">($1 = 87.1200 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0ET:0-india-s-swiggy-slides-ahead-of-q3-results/",
            "pub_date": "2025-02-05 12:19:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSR:0",
            "title": "UAE non-oil business sector expands robustly in January, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UAE's non-oil private sector continued to expand robustly at the start of 2025, although capacity pressures and competitive challenges posed headwinds, a survey showed on Wednesday.</p><p class=\"\">The seasonally adjusted S&amp;P Global UAE Purchasing Managers' Index was 55.0 in January, slightly down from December's nine-month high of 55.4, but well above the 50.0 mark indicating expansion. </p><p class=\"\">Business activity and new orders rose sharply, driven by favourable market conditions and easing cost pressures, although at a slightly slower pace, with the new orders sub index easing to 59.0 in January, from December's 59.3.  </p><p class=\"\">\"Robust expansions in activity and new business, as well as lower input cost inflation, suggest the economy is in a healthy position,\" said David Owen, Senior Economist at S&amp;P Global Market Intelligence. </p><p class=\"\">Input cost inflation fell to a 13-month low, allowing firms to increase purchases, but capacity pressures persisted, with backlogs of work rising at their fastest pace in eight months.</p><p class=\"\">\"Strong competition and cash flow concerns arising from heavy backlogs have appeared to sow doubt among firms that they can continue to boost their revenues,\" Owen said, noting that total confidence was at its lowest level since December 2022. </p><p class=\"\">A separate index for Dubai eased slightly to 55.3 from December's 55.5, as businesses reported improved conditions but expressed subdued expectations for future activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSR:0-uae-non-oil-business-sector-expands-robustly-in-january-pmi-shows/",
            "pub_date": "2025-02-05 12:19:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0F9:0",
            "title": "India's PC Jeweller rises on posting quarterly profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of PC Jeweller  up 4.9% to 15.7 rupees </p><p class=\"\">** Co posts Q3 consolidated net profit of 1.48 billion rupees ($17 million) vs loss of 1.98 billion rupees a year ago</p><p class=\"\">** Rev soars nearly 16x to 6.39 bln rupees on higher demand for jewellery during the festival and wedding season</p><p class=\"\">** Stock has been above its 200-day simple moving avg since Dec 2023, indicating bullish sentiment</p><p class=\"\">** PCJE rose nearly 240% in 2024</p><p class=\"\">($1 = 87.1250 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0F9:0-india-s-pc-jeweller-rises-on-posting-quarterly-profit/",
            "pub_date": "2025-02-05 12:20:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446665:0",
            "title": "Indonesia Economy Expands 0.53% QoQ in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy grew 0.53% qoq in Q4 of 2024, compared with market consensus of 0.56% and after a 1.5% expansion in Q3.</p><p class=\"\">It was the third quarterly rise but the softest in the sequence.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446665:0-indonesia-economy-expands-0-53-qoq-in-q4/",
            "pub_date": "2025-02-05 12:10:55",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014589:0",
            "title": "India's Sensex Flat as Financial, Tech Stocks Gains — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">India's Sensex is flat at 78582.41 as gains in financial and tech stocks help offset losses in consumer stocks. IndusInd Bank is up 1.8% and Zomato is 1.5% higher, while Nestle India is down 2.8% and Hindustan Unilever is 0.8% lower. Investors are focusing on U.S. trade talks as well as domestic earnings. Reliance Power and Zydus Lifesciences are set to announce their quarterly results later in the day. (kosaku.narioka@wsj.com; @kosakunarioka)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014589:0/",
            "pub_date": "2025-02-05 12:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463532:0",
            "title": "Mwb Research Keeps Infineon on Hold After Fiscal Q1 Beat as Geopolitical Risks Persist",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mwb research on Tuesday noted the stellar fiscal first-quarter performance of Infineon Technologies  but cautioned on the geopolitical risks that the European chipmaker is facing. </p><p class=\"\">As such, the research firm kept the German stock on hold and raised its price target to 35 euros from 33 euros. </p><p class=\"\">\"Despite Infineon's solid Q1 beat and slight order backlog growth, industry prospects remain tough and uncertain in the short-term due to ongoing inventory correction and soft demand across key end-markets,\" the note said. \"On top of that, Trump tariffs add an additional layer of uncertainty, particularly for the automotive segment, where slowing EV adoption in key regions, cost pressures, and geopolitical risks could disrupt supply chains and dampen expected recovery.\"</p><p class=\"\">Analysts at mwb also revised upwards their estimates for Infineon's sales, EBIT and EPS for 2025 to 2027.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463532:0/",
            "pub_date": "2025-02-05 12:11:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463675:0",
            "title": "Titan Company's Consolidated Profit Remains Flat in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Titan Company's  consolidated attributable profit was largely flat at 10.5 billion Indian rupees in the fiscal third quarter ended Dec. 31, 2024 from the year-ago level. </p><p class=\"\">Earnings per share contracted to 11.80 rupees compared with 11.90 rupees a year ago, according to a Tuesday filing to the Indian stock exchanges by the watches and accessories manufacturer. The EPS was lower than the 12.03 rupees estimated by the analysts polled by Visible Alpha. </p><p class=\"\">Revenue from operations in fiscal Q3, however, increased to 175.5 billion rupees from 139.6 billion rupees a year earlier. This was higher than Visible Alpha's estimate of 170.96 billion rupees.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463675:0/",
            "pub_date": "2025-02-05 12:12:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463676:0",
            "title": "Vection Technologies Gets AU$4 Million Defense Contract Extension, Shares Down 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vection Technologies  received AU$4 million defense contract extension for its artificial intelligence software, the company said in a Wednesday Australian bourse filing. </p><p class=\"\">The value of the contract will be recognized in its earnings results for the fiscal year ending June 30, the filing said. </p><p class=\"\">Shares were down 6% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463676:0/",
            "pub_date": "2025-02-05 12:13:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204015027:0",
            "title": "Nissan reportedly balks at Honda's terms, putting their merger in doubt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Mike Murphy</p><p class=\"\">Shares of Nissan Motor Co. and Honda Motor Co. rose overnight following reports that the automakers' proposed merger may be scrapped.</p><p class=\"\">The Japanese newspaper Asahi Shimbun and the Wall Street Journal reported the two companies' boards would meet as soon as Wednesday to discuss possibly terminating the talks, after Nissan reportedly balked at a new proposal where it would become a subsidiary of Honda, rather than both being subsidiaries of a single holding company.</p><p class=\"\">Nissan's stock (JP:7201) rose nearly 2% in Tokyo trading early Wednesday. Honda's Japanese shares (JP:7267) were up about 3%, after its U.S.-traded shares (HMC) rose 2.4% on Tuesday.</p><p class=\"\">Merger talks to combine the companies and create one of the world's largest automakers were announced in December.</p><p class=\"\">Both Honda and Nissan saw sharp drops in global sales in 2024, especially in China and Southeast Asia, and they have been forced to cut production capacity as demand has dipped. Nissan has been particularly hard-hit, and announced 9,000 layoffs in November.</p><p class=\"\">When the deal was first announced, analysts said it was a sign of much-needed consolidation in the auto industry, as high prices have hurt sales amid competition from cheaper Chinese electric vehicles.</p><p class=\"\">Mitsubishi (JP:7211), a strategic partner of Nissan's, was invited to join the Honda-Nissan merger, but has not yet made a decision.</p><p class=\"\">-Mike Murphy</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204015027:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014597:0",
            "title": "New Zealand Shares Slip 0.5% as Tariff Worries Weigh — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand's NZX-50 closed 0.5% lower at 12844.59, staying firmly on course for a fifth weekly decline in six weeks. The benchmark index fell at the open and stayed in the red all through Wednesday's session. Medical-device maker Fisher &amp; Paykel lost 3.7% amid continued worries over the impact of global tariffs. The stock is down 8.0% this week and is 9.9% lower so far in 2025. The NZX-50 benchmark index is down 2.0% year to date. Auckland International Airport fell 1.1% Wednesday. Aged-care providers Summerset and Ryman shed 0.8% and 1.6%, respectively. (stuart.condie@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014597:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575:0",
            "title": "Indonesia's Economy Sustained Steady Pace Growth in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(04:08 GMT) </strong>*Indonesia 4Q GDP +5.02% On Year; Mkt Expected +4.89%<br/><strong class=\"root-Tkn6WL2y\">(04:08 GMT) </strong>*Indonesia 4Q GDP +0.53% On Quarter<br/><strong class=\"root-Tkn6WL2y\">(04:09 GMT) </strong>*Indonesia 2024 GDP +5.03%<br/><strong class=\"root-Tkn6WL2y\">(04:14 GMT) </strong>Indonesia's Economy Sustained Steady Pace Growth in 2024</p><p class=\"\">By Ying Xian Wong</p><p class=\"\">Indonesia's economy grew at a steady pace in 2024 as momentum picked up in the final quarter of the year.</p><p class=\"\">Annual growth of 5.03% compared with the 5.05% expansion seen in 2023, the statistics agency said Wednesday. Economists at HSBC and DBS had expected a reading of 5.0%.</p><p class=\"\">That continues a years-long run of growth at a roughly 5% clip, with Southeast Asia's largest economy having expanding at the same pace since about 2016, barring the Covid shock over 2020 and 2021.</p><p class=\"\">Indonesia's resource-rich economy grew 5.02% from a year earlier in the fourth quarter of 2024, compared with a 4.95% expansion in the third quarter. That exceeded economists' expectations, with a Wall Street Journal poll tipping growth at 4.89%.</p><p class=\"\">Gross domestic product expanded 0.53% in the fourth quarter compared with the previous quarter.</p><p class=\"\">The data comes as President Prabowo Subianto looks to boost growth throughout his five-year term.</p><p class=\"\">Current indicators suggest that economic growth will likely remain around 5% this year, ANZ economists Arindam Chakraborty and Sanjay Mathur said in a recent note. While the Indonesian government's focus on welfare-driven spending could help support consumption, the 2025 budget looks conservative, they added.</p><p class=\"\">Write to Ying Xian Wong at yingxian.wong@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446666:0",
            "title": "Indonesia Enonomy Grows 5.03% in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy expanded by 5.02% yoy in Q4 2024, compared with market estimates of 4.98% and after a 4.95% growth in Q3, which was the softest growth in a year.</p><p class=\"\">For the full year, the economy grew by 5.03%, the lowest level in three years, after expanding by 5.05% in 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446666:0-indonesia-enonomy-grows-5-03-in-2024/",
            "pub_date": "2025-02-05 12:14:51",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014600_20250204014600:0",
            "title": "Nissin Foods Holdings 9-Mos Net Y43.58B Vs Net Y49.05B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014600_20250204014600:0/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014602:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Recover Despite China Tariff Fears</strong></p><p class=\"\">A call between Trump and Xi Jinping hasn't happened Tuesday, but might come Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How U.S. Agriculture Market Is Approaching Tariffs and a Potential Trade War</strong></p><p class=\"\">Traders and farmers hope that the Trump administration is using tariff threats as leverage in trade negotiations, as opposed to following through with a major disruption to agricultural trade.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Keeps Hitting Record Highs. Here's Why-and Which Stocks Could Benefit.</strong></p><p class=\"\">The yellow metal is trading just below $2,900 an ounce. Miner stocks are rallying too. Geopolitical turmoil is boosting gold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Eggs Are Through the Roof. What's Up With Food Prices?</strong></p><p class=\"\">Bird flu is making eggs costly, and looming tariffs could cause price hikes in certain items like avocados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014602:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-11-pm-et/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014603:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda's Merger Terms, Putting Deal in Peril</strong></p><p class=\"\">The Japanese automakers had announced a plan to combine in December.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chipotle Shares Fall as Chain Tempers Sales Growth Hopes</strong></p><p class=\"\">Chipotle reduced its financial outlook for same-store sales this year to an increase in the low to mid-single digits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Match Group Replaces CEO as Growth Eludes Dating Apps</strong></p><p class=\"\">The owner of Tinder, Hinge and OkCupid apps said CEO Bernard Kim would step down and be succeeded by board member Spencer Rascoff, a co-founder and former CEO of home-listings portal Zillow Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Earnings Must Show GLP-1 Market Still Set for Big Growth</strong></p><p class=\"\">Novo's Wegovy and Ozempic are among the most closely watched new medications in recent history, but face serious competition from Eli Lilly's Zepbound and Mounjaro.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LG CNS Makes Weak Debut in South Korea After IPO</strong></p><p class=\"\">The information-technology services affiliate of conglomerate LG Group raised around $826 million in South Korea's biggest listing in three years.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mattel Relying on Supply Chain, Potential Price Increases to Offset Tariff Impacts</strong></p><p class=\"\">Chief Executive Ynon Kreiz said the company has spent years building out a supply chain that isn't overly reliant upon any one country. It will also consider increasing its prices, he said.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014603:0-news-highlights-top-company-news-of-the-day-tuesday-at-11-pm-et/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0DN:0",
            "title": "Indian shares open steady as energy stocks offset consumer drop",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's equity benchmarks were steady at the open on Wednesday, as positive momentum in energy stocks, driven by ONGC and oil marketing companies on an improved earnings outlook, countered losses in consumer stocks.</p><p class=\"\">The Nifty 50  was up 0.16% at 23,777.43 points, as of 9:28 a.m. IST, while the BSE Sensex  traded flat at 78,605.23.</p><p class=\"\">Eleven of the 13 major sectors posted early gains. Energy  and state-owned firms  climbed about 1.4% each, with ONGC  leading the charge following an improved production outlook, which also resulted in a rating upgrade by Macquarie.</p><p class=\"\">Oil marketing companies BPCL  and HPCL  rose 3.3% each after Goldman Sachs upgraded them to \"buy\" from \"neutral\", citing improved earnings outlook for the companies.</p><p class=\"\">Shares of Asian Paints  lost 4.3% after the paint maker missed the September-quarter profit view on Tuesday.   </p><p class=\"\">Consumer stocks  shed 0.6% to top the list of sectoral losers. </p><p class=\"\">Both blue-chip indexes - NSE Nifty 50  and BSE Sensex  - climbed 1.6% and 1.8%, respectively, on Tuesday, logging their best session in a month and pushing them into positive territory for 2025.</p><p class=\"\">($1 = 87.1530 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0DN:0-indian-shares-open-steady-as-energy-stocks-offset-consumer-drop/",
            "pub_date": "2025-02-05 12:15:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014570:0",
            "title": "U.S. Tariffs Likely to Have Limited Impact on Chinese Home-Appliance Makers — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.S.'s additional 10% tariff on all Chinese goods is expected to have a limited impact on China's home-appliance makers, Morningstar analyst Jeff Zhang says in a research note. The U.S. accounted for only 5%-15% of Chinese exports of these products in 2024, he says. Home-appliance companies in China are also shifting their focus to developing countries with the potential for faster sales expansion, the analyst says. Midea Group and Haier Smart Home have a 5%-6% revenue exposure to the U.S., according to Morningstar estimates. The two companies could raise selling prices modestly and ramp up production in the U.S. to offset the tariff impact, Zhang adds. He expects the tariff hike to have a mid-single-digit impact on Midea's and Haier's earnings this year. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014570:0/",
            "pub_date": "2025-02-05 12:06:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575_20250204014575:0",
            "title": "Indonesia 4Q GDP +5.02% On Year; Mkt Expected +4.89%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575_20250204014575:0/",
            "pub_date": "2025-02-05 12:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575_20250204014577:0",
            "title": "Indonesia 4Q GDP +0.53% On Quarter",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575_20250204014577:0/",
            "pub_date": "2025-02-05 12:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575_20250204014578:0",
            "title": "Indonesia 2024 GDP +5.03%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575_20250204014578:0/",
            "pub_date": "2025-02-05 12:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0EU:0",
            "title": "BlackRock plans to hire 1,200 people in India, Bloomberg News reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Blackrock  plans to hire nearly 1,200 people to expand two support hubs in India and build out its artificial intelligence (AI) capabilities in the country, Bloomberg News reported on Tuesday citing people familiar with the matter. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0EU:0-blackrock-plans-to-hire-1-200-people-in-india-bloomberg-news-reports/",
            "pub_date": "2025-02-05 12:09:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446663:0",
            "title": "China's 10-Year Bond Yield Stabilizes Post-Holiday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's 10-year government bond yield stabilized around 1.63% as the bond markets reopened following the Lunar New Year holidays.</p><p class=\"\">During the break, US President Donald Trump enacted a 10% tariff on all Chinese imports, effective February 4, 2025.</p><p class=\"\">In retaliation, China introduced additional tariffs of 15% on coal and LNG imports from the US and 10% on crude oil, farm equipment, and certain cars, starting February 10.</p><p class=\"\">Furthermore, China launched an anti-trust investigation into Google, escalating the trade conflict between the world's two largest economies.</p><p class=\"\">Investors are closely monitoring these developments, hoping for a swift strike of a trade agreement.</p><p class=\"\">On the economic front, a private survey revealed that China's composite PMI edged down to 51.1 in January 2025, from 51.4 in December 2024, marking its lowest reading since September.</p><p class=\"\">The slowdown was largely attributed to weaker growth in the services sector, even as manufacturing activity showed signs of strength.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446663:0-china-s-10-year-bond-yield-stabilizes-post-holiday/",
            "pub_date": "2025-02-05 12:09:20",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446664:0",
            "title": "Australia's 10-Year Bond Yield Falls",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australia’s 10-year government bond yield dropped to around 4.41% amid growing expectations that the Reserve Bank of Australia will begin cutting interest rates later this month.</p><p class=\"\">Market pricing implies a 95% chance that the central bank will lower its 4.35% cash rate by 25bps when it meets on February 18.</p><p class=\"\">On the economic data front, final figures showed that Australia’s private sector activity continued to rise in January, with services activity growth reaching a five-month high and the manufacturing sector returning to expansion.</p><p class=\"\">Investors now await December's trade figures, due on Thursday, to gauge the health of the nation’s export-driven economy.</p><p class=\"\">Meanwhile, markets remain focused on developments in U.S.-China trade war.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446664:0-australia-s-10-year-bond-yield-falls/",
            "pub_date": "2025-02-05 12:10:16",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3NI03V:0",
            "title": "BOJ will keep raising rates if prices move as forecast, c.bank official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bank of Japan will continue to raise interest rates if underlying inflation accelerates toward its 2% target as projected, a senior central bank official said on Wednesday.</p><p class=\"\">\"Underlying inflation is heading toward 2% but still remains below that level now. As such, we must support economic activity with loose monetary policy,\" Kazuhiro Masaki, director-general of the BOJ's monetary affairs department, told parliament.</p><p class=\"\">\"Having said that, we will continue to raise interest rates and adjust the degree of monetary support, if underlying inflation accelerates toward 2% as we project,\" he said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3NI03V:0-boj-will-keep-raising-rates-if-prices-move-as-forecast-c-bank-official-says/",
            "pub_date": "2025-02-05 11:54:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463672:0",
            "title": "TA Corp. Appoints CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TA Corp.  appointed Chiang Yi Shin as chief financial officer, effective April 1, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">Shin will initially serve as the chief financial officer designate before assuming the role on a permanent basis following the resignation of Tam Siew Kheong who will relinquish the role effective April 1, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463672:0/",
            "pub_date": "2025-02-05 12:01:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0E9:0",
            "title": "Distressed-debt investors hold tense talks over KKR-owned car parts maker Marelli- FT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/3ptraj5f</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0E9:0-distressed-debt-investors-hold-tense-talks-over-kkr-owned-car-parts-maker-marelli-ft/",
            "pub_date": "2025-02-05 12:01:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014567:0",
            "title": "Singapore Dollar Steady Amid Caution Over U.S., China Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore dollar is steady against its U.S. counterpart in the Asian session amid caution over the latest tariffs from the U.S. and China. \"We are only at the beginning of the tariff saga,\" Maybank analysts say in an FX Research &amp; Treasury report. \"It would be wise to be slightly more cautious as there is a likely limit to how much the USD can weaken,\" the analysts say. USD/SGD is little changed at 1.3524. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014567:0/",
            "pub_date": "2025-02-05 12:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3NQ00A:0",
            "title": "Thailand to roll out next phase of digital wallet scheme in Q2, official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thailand's government will implement the third phase of its \"digital wallet\" handout scheme in the second quarter of the year, and will also discuss more stimulus measure this month, Deputy Finance Minister Julapun Amornvivat said on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3NQ00A:0-thailand-to-roll-out-next-phase-of-digital-wallet-scheme-in-q2-official-says/",
            "pub_date": "2025-02-05 11:54:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}