{
    "data": [
        {
            "id": "DJN_DN20260227009029:0",
            "title": "MannKind Cut to Sector Perform From Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009029:0/",
            "pub_date": "2026-02-28 02:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009034:0",
            "title": "Bank Stocks Head for Worst Day Since April — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By WSJ staff</span></p><p class=\"\"><span>Worries about AI and problems in the private-credit market hit bank stocks on Friday, sending the KBW Nasdaq Bank Index down more than 5% and headed toward its worst day since April's tariff turmoil.</span></p><p class=\"\"><span>Shares of large U.S. lenders slumped across the board, with Goldman Sachs recently leading the way with a 7.5% decline. Morgan Stanley fell 6.9%.</span></p><p class=\"\"><span>This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009034:0/",
            "pub_date": "2026-02-28 02:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0YA:0",
            "title": "Paramount expected to easily secure EU nod for Warner Bros deal, sources say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Paramount's market share below 20% in Europe, faces fewer hurdles</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Paramount open to divesting minor channels if required</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Regulatory approvals needed from US, UK, EU</span></li></ul></span></div><span><p class=\"\"><span>By Foo Yun Chee</span></p><p class=\"\"><span>    Paramount Skydance </span><span> is expected to easily gain European Union antitrust approval to buy Warner Bros Discovery </span><span> while divestments, if required to address regulatory concerns, will likely be minor, two people with direct knowledge of the matter said on Friday.</span></p><p class=\"\"><span>Unlike Netflix's </span><span> aborted bid, Paramount's offer faces fewer regulatory hurdles because a combined Paramount and Warner Bros has a market share of below 20% in all markets across Europe, the people said. They spoke anonymously because of the sensitivity of the matter.</span></p><p class=\"\"><span>European Commission antitrust regulators usually take a tough line when market share is 30% or more. Paramount has yet to formally seek EU approval, but is providing information on its businesses.</span></p><p class=\"\"><span>The deal would also require approval under the EU's foreign subsidies regulation because Saudi Arabia's Public Investment Fund, Abu Dhabi's L'imad Holding Company and the Qatar Investment Authority are also bankrolling the bid. The FSR targets unfair foreign state aid.</span></p><p class=\"\"><span>Paramount declined to comment. The Commission did not immediately respond to a request for comment.</span></p><p class=\"\"><span>PARAMOUNT OPEN TO DIVESTING MINOR CHANNELS: SOURCES</span></p><p class=\"\"><span>While Paramount hopes to secure unconditional EU approval, the company is willing to divest minor channels such as its children's brands if required, the people said. Overlapping businesses include the combination of two studios and several TV channels.</span></p><p class=\"\"><span>Paramount has Nickelodeon while Warner Bros owns the Cartoon Network.</span></p><p class=\"\"><span>Paramount will likely seek formal EU approval in the coming months, the people said, which will then kick off a 25-working-day preliminary review, which can be extended by 10 working days if remedies are offered at the end of the 25 days.</span></p><p class=\"\"><span>California may be the biggest obstacle to the deal. Regulatory approvals from the U.S. and UK are also key deal requirements.</span></p><p class=\"\"><span>Paramount has been on the charm offensive in Europe since January, with CEO David Ellison meeting French President Emmanuel Macron that month while Chief Legal Officer Makan Delrahim met the European Commission's top merger official Guillaume Loriot that same week, the people said.</span></p><p class=\"\"><span>Delrahim is well-acquainted with Loriot from his previous stint as assistant attorney general at the U.S. Department of Justice's antitrust division.</span></p><p class=\"\"><span>European Parliament lawmaker Andreas Schwab, who has criticised Netflix's bid and led the negotiations in several pieces of tech legislation in recent years and also met Delrahim last month, said a Paramount bid poses fewer issues.</span></p><p class=\"\"><span>\"I think Paramount is something we could accept. It is a concentration in the production of films. There is no risk of a digital champion taking over the video streaming market,\" he said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0YA:0-paramount-expected-to-easily-secure-eu-nod-for-warner-bros-deal-sources-say/",
            "pub_date": "2026-02-28 02:41:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009042:0",
            "title": "Arbe Robotics Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009042:0/",
            "pub_date": "2026-02-28 02:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947590:0",
            "title": "IOX: Argentine exit finalized; H2 2025 net loss deepens to USD 20.2M as focus shifts to Colombia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Divestment of Argentine assets in early 2026 led to a strategic refocus on Colombia. H2 2025 saw a net loss of USD 20.2 million, with revenues rising to USD 9.9 million despite lower production. Financial stability measures and capital structure adjustments are underway.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947590-41386e2a07e106e79a42a2a343ba5f40\" target=\"_blank\">InterOil Exploration and Production ASA [IOX] Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947590:0-iox-argentine-exit-finalized-h2-2025-net-loss-deepens-to-usd-20-2m-as-focus-shifts-to-colombia/",
            "pub_date": "2026-02-28 02:42:28",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009052:0",
            "title": "BlackSky Technology Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009052:0/",
            "pub_date": "2026-02-28 02:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007071:0",
            "title": "Quantum Computing Is No Longer a Speculative Bet. IonQ's Surging Stock Drives Home That Point. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Mackenzie Tatananni</span></p><p class=\"\"><span>Quantum computing has frequently been touted as the next big technology, with transformative potential spanning sectors from healthcare to finance to defense. Now, investors appear to be buying in.</span></p><p class=\"\"><span>Just look at the reaction to IonQ's earnings. The stock surged 22% on Thursday, marking its largest single-day percent increase since a 37% jump in May 2025, which came after a Barron's article highlighting IonQ's efforts to grow into the so-called Nvidia of quantum computing.</span></p><p class=\"\"><span>In an interview after the company's latest earnings, which beat consensus estimates, CEO Niccolo de Masi doubled down on the Nvidia comparison, saying he believed IonQ could experience explosive growth in years to come.</span></p><p class=\"\"><span>\"I look at companies with $100 billion market caps, and I go, that's not an absurd concept,\" de Masi said. \"Nvidia had $60 billion in quarterly revenue and we had $62 million, but they had $60 million of revenue in a quarter at one point.\" (Nvidia logged less than $200 million in revenue in its first quarter as a public company).. \"There's room for us to go a long way — I don't knows exactly how far.\"</span></p><p class=\"\"><span>Call him bombastic, but the argument about quantum being a speculative bet has weakened as Wall Street increasingly piles into the space, with more and more analysts initiating coverage on shares of the pure-play companies that are concentrating their efforts on quantum.</span></p><p class=\"\"><span>That can mean focusing solely on computing, as D-Wave does, or diversifying across technologies — including sensing and networking — like IonQ.</span></p><p class=\"\"><span>The companies use different modalities. D-Wave pioneered quantum annealing, tailored to optimization tasks. Gate-model systems also vary.</span></p><p class=\"\"><span>\"An investment of us is a bet on the quantum industry,\" de Masi said in reference to the company's growing reach across technologies. IonQ has been on an acquisition spree, snapping up companies specializing in atomic clocks to quantum sensors and, most recently, semiconductors. The latter will help IonQ take control of its own chip production.</span></p><p class=\"\"><span>While the aggressive M&amp;A has drawn scrutiny from some on the Street, analysts noted in the wake of IonQ's latest earnings that the \"overall diversification of the business across products\" contributed to its strength in the quarter.</span></p><p class=\"\"><span>Expanding too far, too quickly could be a problem for the pure plays. The companies are all fairly young, have yet to turn an annual profit, and have yet to broadly commercialize their technology. It's the larger players that have room to experiment.</span></p><p class=\"\"><span>Alphabet's Google is often cited as a leader in quantum. Its Willow chip helped spark hype at the end of 2024. Still, it isn't counting on the technology as a major revenue driver yet.</span></p><p class=\"\"><span>IonQ's de Masi conceded that one big player stood out: International Business Machines, which Barron's profiled in December. \"I feel like there's two ecosystems right? There's IBM and there's the rest of us,\" he said. \"I think we have the greatest chance of mounting a meaningful, if not prevailing, challenge.\"</span></p><p class=\"\"><span>It's a tall order. IBM's efforts in quantum have spanned decades, and they haven't gone unnoticed. Gartner, a technology research firm that monitors the sector, in a report last year called IBM \"the quantum computing company to beat,\" citing its scale and ecosystem.</span></p><p class=\"\"><span>IBM recently elevated Jay Gambetta, the former head of its quantum division, to lead its research efforts as a whole — a sign of how seriously it takes quantum.</span></p><p class=\"\"><span>Wall Street has been even more excited about the smaller players. Shares in pure plays have doubled — and in some cases tripled — over the past 12 months.</span></p><p class=\"\"><span>IonQ stock has surged 66% over that period, outstripping a 23% gain for the tech-heavy Nasdaq Composite. Rival D-Wave has gained nearly 270%. Rigetti Computing, another closely-watched player that is just starting to break out of R&amp;D in earnest, has risen about 120%.</span></p><p class=\"\"><span>No one is more enthusiastic than the quantum CEOs themselves, but they can't be too aspirational. D-Wave CEO Alan Baratz told Barron's after earnings on Thursday that investors could expect to see unpredictable revenue patterns for the foreseeable future.</span></p><p class=\"\"><span>\"We're still at the early stages of the commercialization of quantum,\" Baratz said. It's a surprisingly modest take from a company that frequently touts its roster of clients including AT&amp;T, whose representatives spoke at D-Wave's annual user conference in January.</span></p><p class=\"\"><span>Rosenblatt analyst John McPeake called D-Wave's latest quarter \"uneventful,\" though bookings were strong. Year over year, bookings fell 27%, largely because of last year's first sale of an Advantage system.</span></p><p class=\"\"><span>Investors must reckon with how new this all is. CEOs still have to convince customers — and shareholders — that quantum will be transformative.</span></p><p class=\"\"><span>The company's expansion into gate-model systems supports D-Wave's aspirations to become a \"one-stop shop\" for quantum computing, Baratz told Barron's. \"We want to make sure we can deliver everything our customers need to be able to solve their hard computational problems leveraging quantum computing.\"</span></p><p class=\"\"><span>Write to Mackenzie Tatananni at mackenzie.tatananni@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007071:0/",
            "pub_date": "2026-02-28 02:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009062:0",
            "title": "Chemed Cut to Sector Perform From Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:45 GMT) </span></strong><span>Chemed Price Target Cut to $422.00/Share From $572.00 by RBC Capital</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009062:0/",
            "pub_date": "2026-02-28 02:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009059:0",
            "title": "Bitcoin Stays Vulnerable in Choppy Geopolitical Situation — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>1345 ET - Bitcoin is wrapping up another negative month, says Antonio Di Giacomo of XS.com in a note. Cryptocurrencies in general are rudderless, he says, with traders needing new developments to spur a rush of volume back into the space. As American foreign policy is experiencing higher tensions with both Iran and Cuba, choppy trading is a recurring feature in a cryptocurrency market that doesn't want too much risk exposure heading into the weekend. \"Volatility remains elevated, with wide intraday swings underscoring the fragile balance between buyers and sellers,\" said Di Giacomo. BTC is down 2.8%, to $65,500, while ethereum drops to just over $1,920 Friday. (kirk.maltais@wsj.com)</span></p><p class=\"\"><span>1220 ET - CoreWeave can still raise capital despite concerns about its capital structure and backlog risks, D.A. Davidson analyst Alex Platt says. Recent news indicating that CoreWeave is looking to raise $8.5 billion in debt capital to finance its Meta capacity is an incremental positive to alleviating capital structure risk, Platt says. Platt also believes that OpenAI will raise enough capital to meet its commitments to CoreWeave, which will help with concerns about backlog. \"While remaining pragmatic and acknowledging there still remains concerns around CoreWeave, we believe these are concerns that can and likely will be alleviated in the near-to-medium term,\" Platt says. (katherine.hamilton@wsj.com)</span></p><p class=\"\"><span>1136 ET - U.S. corporate bond yields rise faster than comparable Treasurys, leading spreads to widen from historically low levels. The driver \"has been the perception of AI displacement,\" Angel Oak's Matt Kennedy says. Renewed uncertainty around President Trump's tariffs hasn't been a factor, as the trade aspect \"has been in the market for a year now\" and most issuers \"have had time to take actions to mitigate the impact.\" Kennedy says corporations have altered their supply chains, reduced costs, or passed through price increases to offset tariffs. Fixed-income investors expect U.S. corporations to greatly increase debt issuance this year to finance AI-related capex. (paulo.trevisani@wsj.com; @ptrevisani)</span></p><p class=\"\"><span>1133 ET - This month's widening of U.S. credit spreads reflects a normalization from historically tight levels, Comerica's Bill Adams says. He compares the move with equity markets' poor performance this month. \"Credit markets have normalized a little bit over the last month as the stock market has treaded water,\" he says. \"But they still point to a generally upbeat view for the outlook for business financial health.\" An ICE BofA index tracked by the St. Louis Fed puts the spread at 0.8 percentage point as of Feb. 23, up from 0.73 p.p. a month ago. (paulo.trevisani@wsj.com; @ptrevisani)</span></p><p class=\"\"><span>1130 ET - Canada's economy on balance was more resilient last year than feared as U.S. tariffs ramped up last spring, says Royal Bank's Nathan Janzen. GDP contracted 0.6% annualized in 4Q 2025, weaker than the flat reading the economist and Bank of Canada forecast. Yet Janzen says that if anything, the firm underlying details lower the off the central bank will need to cut interest rates further. The weakness was largely due to a pull-back in inventories, with consumer spending and government investment up. And net exports added significantly to growth for a second quarter running, following the sharp drop in 2Q. (robb.stewart@wsj.com; @RobbMStewart)</span></p><p class=\"\"><span>1127 ET - The latest U.S. inflation gauge indicates that price increases are likely to remain above the Fed's 2% target for a while. January producer price index unexpectedly accelerates, leading economists to foresee the Fed's preferred inflation indicator, the PCE, still around 3%. \"The data out this morning actually points to inflation being a nagging frustration for the U.S. economy,\" Comerica's Bill Adams says. That would be \"a reason for the Fed to be more cautious on rate cuts,\" he says. Markets are mostly pricing in a Fed hold in coming months and two or more cuts this year, according to CME data. (paulo.trevisani@wsj.com; @ptrevisani)</span></p><p class=\"\"><span>1118 ET - Friday's Commerce Department data on December construction spending rounds out the full-year picture. It shows an overall 1.4% decline in U.S. construction spending — driven in large part by a 6.5% decline in spending on construction of factories. Along with declining employment in manufacturing last year, the numbers are evidence that the first year of the second Trump administration didn't see a decisive revival in U.S. goods production. On the other hand, manufacturing activity itself hasn't slowed — data from the Fed show that between January 2025 and January 2026, output from extant U.S. factories rose by 2.4%. (matt.grossman@wsj.com; @mattgrossman)</span></p><p class=\"\"><span>1116 ET - The 0.6% annualized drop in 4Q Canada GDP doesn't reflect underlying momentum in the economy, says Douglas Porter, chief economist at BMO Capital Markets. Porter says the weakness was concentrated on a big pullback inventories, while consumer spending rebounded, exports were solid, and business investment eked out a gain. Regardless, he says the economy is going to struggle amid heightened trade-policy uncertainty, highlighted by the upcoming US-led review of USMCA. This will keep the door \"slightly ajar\" for possible Bank of Canada rate cuts, \"but we're not there quite yet,\" says Porter. (paul.vieira@wsj.com; @paulvieira)</span></p><p class=\"\"><span>1035 ET - Underlying momentum in Canada's economy isn't consistently strong but it isn't weak enough for the Bank of Canada to cut interest rates further, Desjardins' Royce Mendes reckons. GDP shrank 0.6% annualized in 4Q 2025, but outside of a drag from a drop in business inventories and housing weakness, the economy showed positive numbers. Mendes says there are hurdles to pass in the coming months for the economy but for now it is likely the central bank will remain on the sidelines. He notes neither Canadian government bond yields of the currency really reacted to the GDP data, and markets still price in a 40% probability of another rate cut this year. (robb.stewart@wsj.com; @RobbMStewart)</span></p><p class=\"\"><span>1028 ET - Oxford economics will be on recession watch in early 2026 after Canada's economy slipped into reverse in the last quarter. GDP shrank 0.2% on-quarter, or 0.6% annualized, driven by a large drawdown in inventories that shaved about 1 percentage point off growth, economist Michael Davenport says. Statistics Canada's estimate for January shows flat GDP, suggesting shaky footing starting the year. Davenport says Canada should narrowly avoid a recession, but soft momentum will persist near term to keep risks elevated. (robb.stewart@wsj.com; @RobbMStewart)</span></p><p class=\"\"><span>1017 ET - A notable revision in Canada GDP data suggests the amount of spare capacity sloshing around in the economy didn't grow despite the 4Q decline, says Dominic Lapointe, director of macro strategy at Manulife Investment Management. He says Statistics Canada revised its 2Q data, and it now indicates the drop in output was much shallower than originally estimated. Canada's 2Q GDP fell 0.9% annualized versus the original 1.8% estimate. The economy grew by a revised 2.4% in 3Q, and now followed by a 0.6% drop in 4Q. For the Bank of Canada, Lapointe says, \"this leaves the output gap largely unchanged — albeit negative — and does not open the door to additional rate cuts.\" (paul.vieira@wsj.com; @paulvieira)</span></p><p class=\"\"><span>1011 ET - Bringing the Mercosur free-trade deal into effect will boost European distillers, says Mark Titterington, director-general of industry association SpiritsEUROPE. The EU is provisionally applying the long-awaited trade pact with four South American nations, a move set to boost trade flows between the two blocs. The move will offer new market access for European spirits makers, as well as protecting geographical designations and phasing out costly trade duties, Titterington says in a release. It will also \"provide companies with greater options in terms of diversification,\" he sys. \"Most importantly, it reinforces the EU's leadership in promoting open and fair trade.\" (joshua.kirby@wsj.com; @joshualeokirby)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009059:0/",
            "pub_date": "2026-02-28 02:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw3wr1hV:0",
            "title": "Euromax Enters into Agreements to Extend Maturity Dates of Previously Issued Convertible Debentures",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><p class=\"\"><span>VANCOUVER, BC – TheNewswire- February 27, 2026 - EuromaxResources Ltd. </span><span>: (\"Euromax\" or the\"Company\"), announces that, further to its press release dated February 19, 2026,the Company has obtained agreements from each of the European Bank for Reconstruction and Development (“EBRD”) and CC Ilovitza Limited (“CCC”), an affiliate of Consolidated Contractors Company Group,to extend the maturity dates of EBRD’s and CCC’s previouslyissued convertible debentures in the aggregateprincipal amounts of USD$5,000,000 and CAD$5,200,000, respectively, from February 28, 2026 to February 28, 2027(collectively, the “Debenture Amendments”).</span></p><p class=\"\"><span>The Debenture Amendments do not make any changes to theconversion price applicable to principal under the convertibledebentures ($0.15 per share) or to the applicable interest rate (20%for the period from and including April 30, 2018 to and excludingMarch 31, 2019 and 7% for the period from and including March 31, 2019to and excluding February 28, 2027). </span></p><p class=\"\"><span>In order to comply with the requirements of the TSXVenture Exchange, EBRD and CCC had previously agreed that for as longas the Company is listed on the TSX Venture Exchange, any issuance ofshares pursuant to a conversion of accrued and unpaid interest underthe convertible debentures and of any fees under the EBRD convertibledebenture will be subject to the policies of the TSX Venture Exchange,including the requirement that such issuance would be subject to prioracceptance by the TSX Venture Exchange and that such shares would beissued at a price that is not less than the market price (as definedin the policies of the TSX Venture Exchange) at the time such accruedand unpaid interest or fees become payable.    </span></p><p class=\"\"><span>In completing the Debenture Amendments, the Company isrelying on the exemptions from the formal valuation and minorityapproval requirements in Multilateral Instrument 61-101 –Protection of MinoritySecurity Holders in Special Transactions(“MI 61-101”) contained in sections 5.5(e) and 5.7(1)(c) of MI 61-101,respectively. </span></p><p class=\"\"><span>The Debenture Amendments remain subject to the finalacceptance of the TSX Venture Exchange.</span></p><p class=\"\"><span>Neither the TSX Venture Exchange norits regulation services provider accepts responsibility for theadequacy or accuracy of this news release.</span></p><p class=\"\"><span>About Euromax Resources Ltd.</span><br/></p><p class=\"\"><br/><span>Euromax has a major development project in North Macedonia and is</span><br/><span>focused on building and operating the Ilovica-Shtuka gold-copper</span><br/><span>project.</span><br/></p><p class=\"\"><br/><span>Forward-Looking Information</span><br/></p><p class=\"\"><br/><span>This news release contains</span><br/><span>statements that are forward-looking, such as those relating to the</span><br/><span>conversion of any fees and interest under the convertible debentures</span><br/><span>and the final acceptance of the TSX Venture Exchange of the Debenture</span><br/><span>Amendments. Forward-looking statements are frequently characterized by</span><br/><span>words such as “plan”, “expect”, “project”, ”intend”,</span><br/><span>”believe”, ”anticipate” and other similar words, or statements</span><br/><span>that certain events or conditions “may” or “will” occur.</span><br/><span>Forward-looking statements are based on the opinions and estimates of</span><br/><span>management at the dates the statements are made, and are subject to a</span><br/><span>variety of risks and uncertainties and other factors that could cause</span><br/><span>actual events or results to differ materially from those projected in</span><br/><span>the forward-looking statements. This information is qualified in its</span><br/><span>entirety by cautionary statements and risk factor disclosure contained</span><br/><span>in filings made by the Company, including its annual information form</span><br/><span>for the year ended December 31, 2024 and financial statements and</span><br/><span>related management’s discussion and analysis (“MD&amp;A”) for the financial years ended</span><br/><span>December 31, 2024 and 2023, and the unaudited condensed consolidated</span><br/><span>interim financial statements for the three months ended September 30,</span><br/><span>2025 and 2024 along with the accompanying MD&amp;A, filed with the</span><br/><span>securities regulatory authorities in certain provinces of Canada and</span><br/><span>available on SEDAR+ at www.sedarplus.ca. The forward-looking</span><br/><span>statements contained in this document are as of the date of this</span><br/><span>document, and are subject to change after this date. Readers are</span><br/><span>cautioned that the assumptions used in the preparation of such</span><br/><span>information, although considered reasonable at the time of</span><br/><span>preparation, may prove to be imprecise and, as such, undue reliance</span><br/><span>should not be placed on forward-looking statements. Euromax disclaims</span><br/><span>any intention or obligation to update or revise any forward-looking</span><br/><span>statements, whether as a result of new information, future events or</span><br/><span>otherwise, except as</span><br/><span>otherwise required by applicable law.</span><br/></p><p class=\"\"><br/><span>For more information, please visit www.euromaxresources.com or contact:</span></p><p class=\"\"><span>Tim Morgan-Wynne, Chief Executive</span><br/><span>Officer</span><br/></p><p class=\"\"><br/><span>+44 20 3918 5160</span><br/></p><p class=\"\"><br/><span>tmorganwynne@euromaxresources.com</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw3wr1hV:0-euromax-enters-into-agreements-to-extend-maturity-dates-of-previously-issued-convertible-debentures/",
            "pub_date": "2026-02-28 02:45:10",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947573:0",
            "title": "NWN: Net income surged to $113.3M on higher rates and acquisitions, with strong customer and revenue growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net income rose to $113.3M, driven by new rates, acquisitions, and strong customer growth. Capital expenditures reached $466.9M, and the company maintained a robust capital structure and liquidity. Regulatory, operational, and market risks remain key considerations.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947573-55c4c0615c05ef5c9835b778d6a9765a\" target=\"_blank\">Northwest Natural Holding Company [NWN] SEC 10-K Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947573:0-nwn-net-income-surged-to-113-3m-on-higher-rates-and-acquisitions-with-strong-customer-and-revenue-growth/",
            "pub_date": "2026-02-28 02:35:08",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:1cebf9859094b:0",
            "title": "Novo Nordisk Shares Sink 21% as Obesity Shot Trails Lilly Rival",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Novo Nordisk </span><span> has now surrendered the last of the gains that followed the 2021 US approval of Wegovy, marking a decisive turn in what had been one of Europe's most powerful pharmaceutical rallies. After a week in which the shares fell 21%, the stock is on track for its steepest weekly drop since August, surpassing the more than 20% slide earlier this month that came after a dire sales forecast. The reversal effectively erases a roughly fivefold surge built over several years, compressing in less than two years what had once propelled Novo to become briefly Europe's most valuable company and placing renewed pressure on Chief Executive Officer Mike Doustdar to consider broadening the company's focus beyond diabetes and obesity.</span></p><p class=\"\"><span>The immediate catalyst was new data for Novo's next-generation obesity shot CagriSema, which delivered 20.2% weight loss, compared with 23.6% achieved by Eli Lilly &amp; Co.'s </span><span> next-generation candidate tirzepatide. While Doustdar highlighted the 20.2% figure on an investor call after an analyst suggested the drug looks somewhat obsolete, several research teams responded cautiously. Five analysts downgraded the shares following the update, including Deutsche Bank's Emmanuel Papadakis, who shifted to hold, and JPMorgan's Richard Vosser, who moved to neutral, both pointing to potential limits on the drug's commercial outlook. The developments have further underscored how Novo and Eli Lilly's trajectories have diverged as competition in obesity treatments intensifies.</span></p><p class=\"\"><span>Against that backdrop, some analysts argue the near-term thesis may now lean heavily on the newly launched Wegovy pill. Doustdar said more than 240,000 Americans have already taken the pill, describing it as one of the most successful pharmaceutical debuts ever. Intron Health analyst Naresh Chouhan warned that if there were any material slowdown from what has been a strong launch, the shares could de-rate further. Looking beyond the immediate data, HSBC's Rajesh Kumar suggested Novo's ability to manage its obesity franchise past the 2032 patent cliffs may come under increasing scrutiny as rivals advance higher-efficacy and less-frequent dosing drugs, potentially adding another layer to the investment debate.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:1cebf9859094b:0-novo-nordisk-shares-sink-21-as-obesity-shot-trails-lilly-rival/",
            "pub_date": "2026-02-28 02:35:28",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2FP:0",
            "title": "Biglari Capital Calls For Immediate Resignation Of Jack In The Box Chairman David Goebel",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BIGLARI CAPITAL: </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BIGLARI CAPITAL CALLS FOR IMMEDIATE RESIGNATION OF JACK IN THE BOX CHAIRMAN DAVID GOEBEL, WHO WAS OVERWHELMINGLY REJECTED BY STOCKHOLDERS WITH \"SKIN IN THE GAME\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BIGLARI CAPITAL: RESERVES RIGHT TO PURSUE ALL AVAILABLE LEGAL REMEDIES AGAINST JACK IN THE BOX</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2FP:0-biglari-capital-calls-for-immediate-resignation-of-jack-in-the-box-chairman-david-goebel/",
            "pub_date": "2026-02-28 02:35:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009014:0",
            "title": "Neurogene Initiated at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:36 GMT) </span></strong><span>Neurogene Price Target Announced at $200.00/Share by Canaccord Genuity</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009014:0/",
            "pub_date": "2026-02-28 02:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009006:0",
            "title": "Block Was Already Eyeing Job Cuts Before AI Shifts — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Block's mass job cuts were clearly motivated by AI, but RBC Capital Markets analysts think the company was already moving toward a material shrink in workforce. Block has had siloed structures for Cash App and Square, and in 2023 made several rounds of job reductions to remove duplication and redundancies, the RBC analysts say. CEO Jack Dorsey said he chose to make all the job cuts at once to avoid frequent eliminations that would erode morale. The analysts think this suggests Block is making a \"one and done reduction\" to settle potential ongoing concerns for surviving employees. (katherine.hamilton@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009006:0/",
            "pub_date": "2026-02-28 02:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN1Q6:0",
            "title": "Warner Bros signs $110 billion deal with Paramount, its executive discloses in townhall",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Karol Badohal and Harshita Mary Varghese</span></p><p class=\"\"><span>    Warner Bros Discovery </span><span> has agreed to be acquired by Paramount Skydance </span><span> in a $110 billion deal signed Friday morning, according to an audio clip of a global townhall by the company, which was reviewed by Reuters.</span></p><p class=\"\"><span>\"Netflix had the legal right to match the PSKY offer. As you all know, they ultimately decided not to do that. That then resulted in a signed agreement with PSKY as of this morning. So that's where everything stands,\" Bruce Campbell, Warner Bros' chief revenue and strategy officer, said in the townhall.</span></p><p class=\"\"><span>Paramount and Warner Bros did not immediately respond to requests for comment.</span></p><p class=\"\"><span>The deal - which includes some $29 billion in debt - is among Hollywood's biggest media shake-ups and will create one of the largest film studios in the world, allowing Paramount to tap Warner's trove of intellectual property, including franchises such as \"Fantastic Beasts\" and \"The Matrix\".</span></p><p class=\"\"><span>It will also allow Paramount to bolster its streaming efforts, with a potential combination of HBO Max and Paramount+, enabling it to gain market share and tussle with market leader Netflix. </span></p><p class=\"\"><span>The agreement caps a bidding war after Netflix declined to match Paramount's latest $31-per-share offer, which was deemed superior by Warner Bros to the streaming pioneer's $27.75-per-share agreement for its assets.</span></p><p class=\"\"><span>Paramount was in pursuit of Warner Bros since late last year when it launched a hostile campaign to wrestle the company from the streaming giant by consistently raising its offer. </span></p><p class=\"\"><span>The company, led by billionaire Larry Ellison's son David Ellison, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</span></p><p class=\"\"><span>In its revised bid, Paramount raised the termination fee it would pay should the deal fail to gain regulatory approval to $7 billion from $5.8 billion. </span></p><p class=\"\"><span>Activist investor Ancora Holdings, which owns a small stake in Warner Bros, had also stepped up pressure on the HBO owner to engage more with Paramount.</span></p><p class=\"\"><span>Still, the merger is likely to draw antitrust scrutiny in Washington, foreign countries and U.S. states, including California, despite the Ellisons' ties to President Donald Trump. </span></p><p class=\"\"><span>Lawmakers on both sides of the political aisle have raised concerns that any deal to acquire Warner Bros could result in fewer choices and higher prices for consumers. </span></p><p class=\"\"><span>Cinema operators are also concerned that combining large Hollywood studios could cost jobs and reduce the number of movies released in theaters.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN1Q6:0-warner-bros-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall/",
            "pub_date": "2026-02-28 02:36:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006086:0",
            "title": "Amazon Leads Record $110 Billion OpenAI Funding Round. AWS Is Why. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Mackenzie Tatananni and Adam Levine</span></p><p class=\"\"><span>Amazon.com unveiled a strategic partnership with OpenAI that includes a $50 billion investment in the ChatGPT maker and positions Amazon Web Services to compete more effectively in AI computing.</span></p><p class=\"\"><span>Under the terms of the deal, Amazon Web Services will be the exclusive third-party cloud distribution provider for OpenAI Frontier, which allows users to build, deploy, and manage teams of artificial-intelligence agents. Amazon will make an initial $15 billion investment, with the remaining $35 billion coming after certain conditions are met.</span></p><p class=\"\"><span>The partners pledged to create a computing environment powered by OpenAI models that will be available for AWS customers \"to build generative AI applications and agents at production scale.\"</span></p><p class=\"\"><span>OpenAI and Amazon also plan to develop customized models that can power Amazon's customer-facing applications. The agreement comes with a pledge from OpenAI to use 2 gigawatts of capacity from Amazon's Trainium chips. This gives AWS some traction among the crowd of producers of AI chips trying to steal some of Nvidia's business.</span></p><p class=\"\"><span>Amazon shares ticked up 0.1% on Friday morning. The tech-heavy Nasdaq Composite was down 0.9%.</span></p><p class=\"\"><span>OpenAI said separately Friday that it had closed a $110 billion funding round, more than double the $40 billion it raised last year. The figure includes the $50 billion from Amazon, $30 billion from SoftBank, and $30 billion from Nvidia.</span></p><p class=\"\"><span>The $110 billion funding round is by far the largest ever. Early investor Microsoft remains the biggest outside shareholder.</span></p><p class=\"\"><span>The investment brings OpenAI to a $730 billion so-called pre-money valuation, up from $500 billion in October.</span></p><p class=\"\"><span>The partnerships with Amazon, Nvidia, and the like \"expand our global reach, deepen our infrastructure, and strengthen our balance sheet so we can bring frontier AI to more people, more businesses, and more communities worldwide,\" OpenAI said in a blog post.</span></p><p class=\"\"><span>OpenAI is a customer of both Amazon and Nvidia, so much of their investments will wind up in those companies' pockets.</span></p><p class=\"\"><span>More importantly for investors, the latest funding arrives before a possible OpenAI initial public offering. Multiple reports have suggested the company could make its trading debut as soon as the second half of the year.</span></p><p class=\"\"><span>The developments come at a time when concerns over artificial-intelligence disruption have reached a fever pitch. Software stocks have been hammered in a broad-based selloff that reflects a downward spiral in tech valuations.</span></p><p class=\"\"><span>Although Nvidia reported blowout earnings on Wednesday, the results failed to assuage investor concerns over the longevity of the AI boom. Shares of the chip maker suffered their worst single-day drop in nearly a year on Thursday.</span></p><p class=\"\"><span>OpenAI has about a trillion dollars in multiyear commitments via contracts with Oracle, Microsoft, Nvidia, Advanced Micro Devices and others. While revenue is growing very quickly at the start-up, even under generous assumptions the sales will probably not be enough to fulfill these long-term commitments profitably. OpenAI may have to scale back its ambitions, or keep returning to funding markets to push forward.</span></p><p class=\"\"><span>Amazon backed almost half of the new round, which appears to be no accident. The AI offerings at AWS were losing out to competitors Microsoft Azure, Google Cloud, and even smaller cloud providers. Hosting Frontier puts AWS on better footing.</span></p><p class=\"\"><span>Write to Mackenzie Tatananni at mackenzie.tatananni@barrons.com and Adam Levine at adam.levine@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006086:0/",
            "pub_date": "2026-02-28 02:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:ce5108f4d62f6:0",
            "title": "Amadeus IT Group SA Profit Climbs In Full Year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MADRID (dpa-AFX) - Amadeus IT Group SA (AMS.MC) revealed earnings for its full year that Increases, from last year</span></p><p class=\"\"><span>The company's earnings totaled EUR1.336 billion, or EUR3.01 per share.  This compares with EUR1.253 billion, or EUR2.79 per share, last year.</span></p><p class=\"\"><span>Excluding items, Amadeus IT Group SA reported adjusted earnings of EUR1.420 billion or EUR3.20 per share for the period.</span></p><p class=\"\"><span>The company's revenue for the period rose 6.1% to EUR6.517 billion from EUR6.142 billion last year.</span></p><p class=\"\"><span>Amadeus IT Group SA earnings at a glance (GAAP) :</span></p><p class=\"\"><span>-Earnings: EUR1.336 Bln. vs. EUR1.253 Bln. last year.</span></p><p class=\"\"><span>-EPS: EUR3.01 vs. EUR2.79 last year.</span></p><p class=\"\"><span>-Revenue: EUR6.517 Bln vs. EUR6.142 Bln last year.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:ce5108f4d62f6:0-amadeus-it-group-sa-profit-climbs-in-full-year/",
            "pub_date": "2026-02-28 02:38:35",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009026:0",
            "title": "Arlo Technologies Surges on 4Q Earnings Beat, Outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Elias Schisgall</span></p><p class=\"\"><span>Shares of Arlo Technologies rose after the company swung to a profit in the fourth quarter and issued upbeat guidance for the current first quarter.</span></p><p class=\"\"><span>Shares surged 31% to $16.20 in Friday afternoon trading. The stock is up 36% over the past year.</span></p><p class=\"\"><span>The home security company on Thursday posted a profit of $5.8 million, or 5 cents a share, compared with a loss of $4.9 million, or 5 cents a share, a year earlier.</span></p><p class=\"\"><span>Stripping out certain one-time items, the company logged adjusted earnings of 22 cents a share. Analysts polled by FactSet were expecting 16 cents a share.</span></p><p class=\"\"><span>Revenue rose to $141.3 million, up from $121.6 million a year earlier. Analysts were expecting $135.6 million.</span></p><p class=\"\"><span>For the current quarter, Arlo is expecting revenue between $135 million and $145 million, with adjusted earnings between 17 cents and 23 cents a share.</span></p><p class=\"\"><span>Analysts are expecting $138.4 million in revenue and adjusted per-share earnings of 18 cents.</span></p><p class=\"\"><span>Write to Elias Schisgall at elias.schisgall@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009026:0/",
            "pub_date": "2026-02-28 02:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:ef05af864094b:0",
            "title": "MARA Holdings Stock Rallies Despite Caution From Analysts Around AI Pivot",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>MARA Holdings announced it has entered into a strategic agreement with Starwood Capital Group and their dedicated data center development platform Starwood Digital Ventures on Thursday. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>H.C. Wainwright downgraded Mara Holdings to ‘Neutral’ from ‘Buy’ without a price target.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Cantor Fitzgerald lowered the firm's price target on Mara Holdings to $11 from $21 and kept an ‘Overweight’ rating on the shares.</span></li></ul></span></div><span><p class=\"\"><span>MARA Holdings’ recent Starwood deal buoyed retail trader sentiment on Friday even as several Wall Street analysts downgraded the stock. </span></p><p class=\"\"><span>Shares of the company traded 10% higher at the time of writing. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users’ React?</span></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment around MARA trended in the ‘extremely bullish’ territory amid ‘extremely high’ message volume. </span></p><p class=\"\"><span>One bullish user said that the “Starwood deal could imply ~$2 billion in annual revenue potential at scale!!!”</span></p><p class=\"\"><span>https://stocktwits.com/anokato/message/646125633</span></p><p class=\"\"><span>Another bullish user wrote, “Pretty sure this is oversold. I wish I had extra money to buy.”</span></p><p class=\"\"><span>https://stocktwits.com/gotitoutthemud/message/646124552</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Starwood Deal</span></strong></p><p class=\"\"><span>MARA Holdings on Thursday </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/mara-stock-is-rallying-today-what-is-all-the-buzz-about/cZTGrGCRIRW\" rel=\"nofollow\" target=\"_blank\">announced</a><span> it has entered into a strategic agreement with Starwood Capital Group and their dedicated data center development platform Starwood Digital Ventures. Together, the companies expect to deliver approximately 1 gigawatt of near-term IT capacity with a pathway to more than 2.5 gigawatts.</span></p><p class=\"\"><span>The companies will prioritize sites with access to low-cost energy, strong interconnection positions, and clear pathways to scale. These campuses will be designed to operate both Bitcoin mining and AI compute, giving MARA the ability to toggle workloads in response to market pricing and customer demand.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Downbeat Analysts</span></strong></p><p class=\"\"><span>H.C. Wainwright downgraded Mara Holdings to ‘Neutral’ from ‘Buy’ without a price target as the firm slashed its FY26 sales forecast to $851.1 million from $954.8 million, primarily driven by a downward revision to its bitcoin price outlook throughout 2026. </span></p><p class=\"\"><span>H.C. Wainwright sees risks associated with Mara's pronounced pivot to AI and hyperscale data centers and while it recognizes potential value in both its tie to Starwood Capital Group and Exiaon, success at both is hinging on securing large leases that have \"proven to materialize slowly amid current peak demand,\" the analyst told investors.</span></p><p class=\"\"><span>Cantor Fitzgerald lowered the firm's price target on Mara Holdings to $11 from $21 and kept an ‘Overweight’ rating on the shares. Mara's Q4 results showed a 19.8% quarter over quarter decline in mining revenue and negative adjusted core profit amid lower Bitcoin prices, the analyst told investors in a research note.</span></p><p class=\"\"><span>Shares in the company have fallen 34% over the past year. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:ef05af864094b:0/",
            "pub_date": "2026-02-28 02:39:04",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0c6618f5d35ce:0",
            "title": "IAMGOLD Corp Director Sells 31,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>IAMGOLD Corp Director, Smith David Stewart, sold a total of 31,000 shares of common stock on February 27, 2026, at varying prices with a weighted average price of approximately $32.85 CAD. The total sale amount was $1,018,881. Following these transactions, Stewart directly owns 20,000 shares of IAMGOLD Corp.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Smith David Stewart</span></td></tr><tr><td><span>Relationship</span></td><td><span>Director</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$1,018,881</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1647943/000164794326000001/xslF345X05/primary_doc.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1647943/000164794326000001/xslF345X05/primary_doc.xml\" rel=\"nofollow\" target=\"_blank\">IAMGOLD CORP [ IAG ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:0c6618f5d35ce:0-iamgold-corp-director-sells-31-000-shares/",
            "pub_date": "2026-02-28 02:40:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:5c1b2fc36f9c1:0",
            "title": "Independent Review Raises Safety Concerns Over ChatGPT Health Feature",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>WASHINGTON (dpa-AFX) - OpenAI introduced a limited rollout of ChatGPT's 'Health' feature in January, positioning it as a tool that allows users to securely link medical records and wellness apps to receive personalized health guidance. Several reports revealed that more than 40 million people turn to ChatGPT daily for health-related queries.</span></p><p class=\"\"><span>However, the first independent safety review of ChatGPT Health, published in Nature Medicine, found that the system underestimated the urgency of more than half the medical scenarios it was given.</span></p><p class=\"\"><span>Lead researcher Dr. Ashwin Ramaswamy said the study aimed to address a fundamental safety concern- whether someone facing a real medical emergency would be advised to seek immediate care if they consulted ChatGPT Health.</span></p><p class=\"\"><span>The study, titled ChatGPT Health performance in a structured test of triage recommendations, evaluated how well the system could determine the seriousness of medical situations. Researchers used 60 clinician-written case scenarios covering 21 medical fields and tested them under 16 varying conditions, resulting in 960 responses.</span></p><p class=\"\"><span>The system was asked to guide multiple versions of each case, for example, by altering the patient's gender, adding lab results, or including input from relatives, producing nearly 1,000 responses overall. These recommendations were then compared with assessments made by doctors.</span></p><p class=\"\"><span>While ChatGPT Health showed strong performance in clear-cut emergencies such as stroke and severe allergic reactions, it was less reliable in more nuanced cases. In one asthma-related scenario, for instance, it is recommended to wait instead of seeking urgent care, despite recognizing early signs of respiratory distress.</span></p><p class=\"\"><span>In over half of the situations where immediate hospital care was necessary, the platform advised users to remain at home or arrange a routine appointment. Alex Ruani, a doctoral researcher specializing in health misinformation at University College London, described such outcomes as highly concerning.</span></p><p class=\"\"><span>In one simulated case, the system directed a woman struggling to breathe toward a future appointment in 84% of responses, Ruani noted. At the same time, nearly 65% of individuals who were not in danger were told to seek urgent care.</span></p><p class=\"\"><span>The findings also showed that the system was significantly more likely to downplay symptoms when the scenario included reassurance from a 'friend', suggesting the issue was not serious.</span></p><p class=\"\"><span>Responding to the study, OpenAI said it welcomes independent evaluations but emphasized that the research may not fully represent real-world use. The company added that its models are continually updated and improved.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:5c1b2fc36f9c1:0-independent-review-raises-safety-concerns-over-chatgpt-health-feature/",
            "pub_date": "2026-02-28 02:40:18",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0YG:0",
            "title": "Cheniere gets $370 million 'alternative fuel' tax break from Trump's IRS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Timothy Gardner</span></p><p class=\"\"><span>    Cheniere Energy Inc </span><span> disclosed this week that it got a $370 million tax break from the Trump administration for burning liquefied natural gas in its massive tankers, a credit critics said was meant for far smaller boats. </span></p><p class=\"\"><span>The company said on Thursday in financial disclosures that it had won the alternative fuels tax break from the IRS. The tax credit was in a law signed by former President George W. Bush in 2005 that was designed to subsidize an array of alternative fuels derived from sources including biomass, coal and natural gas. </span></p><p class=\"\"><span>The credit was designed to be claimed by parties operating motor vehicles or motorboats. The IRS does not define the size of a motorboat, but other federal regulations define them as smaller than 65 feet long (20 m), tiny compared to LNG tankers, which can measure about three football fields long.  </span></p><p class=\"\"><span>\"Cheniere took a very aggressive position\" on the tax credit, said William Henck, a former IRS lawyer. \"Does a tanker sound like a motorboat?\"</span></p><p class=\"\"><span>Lukas Shankar-Ross, a deputy director at the environmental nonprofit group Friends of the Earth, called Cheniere's claiming of the credit a \"new kind of fabulous and incredulous interpretation of the tax code that has been rubber-stamped by an IRS whose independence is increasingly in question.\"</span></p><p class=\"\"><span>Cheniere's disclosure was first reported by the Washington Post.</span></p><p class=\"\"><span>Cheniere, whose CEO Jack Fusco donated to President </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a><span> 2024 campaign, declined to comment. The IRS did not immediately respond to a request for comment. </span></p><p class=\"\"><span>Cheniere, which exported the first LNG cargo from the lower 48 states 10 years ago, told Reuters earlier that it has invested $50 billion in growing its two export facilities in </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/texas/\" rel=\"nofollow\" target=\"_blank\">Texas</a><span> and </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/louisiana/\" rel=\"nofollow\" target=\"_blank\">Louisiana</a><span> over the decade and aims to double output to 100 million tons per annum by the mid-2030s.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0YG:0-cheniere-gets-370-million-alternative-fuel-tax-break-from-trump-s-irs/",
            "pub_date": "2026-02-28 02:29:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:6967ac3ae094b:0",
            "title": "Lululemon Founder Calls Board Response Weak as Shares Slide 10%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Lululemon Athletica </span><span> is facing a more forceful challenge from its founder, Chip Wilson, who has intensified his campaign for board changes at the yogawear retailer. In a letter to shareholders, Wilson argued that the company's responses to his earlier proposals have been weak and insufficient, and reiterated his slate of three director nominees. He also said he has a strong feeling that additional board members should be replaced, positioning the effort as a push to catalyze what he described as a quantum of change at Lululemon. The company did not immediately respond to requests for comment.</span></p><p class=\"\"><span>The timing underscores the operational and market pressure already surrounding the business. Shares fell as much as 2.2% in premarket trading following the letter, adding to a roughly 10% decline this year after losing nearly half their value in 2025. Lululemon remains without a permanent chief executive officer and is expected to report its slowest annual sales growth since going public in 2007. Attempts to win back shoppers through brighter colors and more prominent logos have not gained traction, and prior product missteps have added to the scrutiny.</span></p><p class=\"\"><span>Wilson's renewed push comes alongside heightened activist interest. Elliott Investment Management disclosed a stake of more than $1 billion in the company late last year, signaling that shareholder pressure could continue to build. With leadership unsettled, growth moderating and influential investors calling for change, the coming quarters could be pivotal for Lululemon as shareholders assess whether governance shifts might help stabilize performance and restore confidence.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:6967ac3ae094b:0-lululemon-founder-calls-board-response-weak-as-shares-slide-10/",
            "pub_date": "2026-02-28 02:29:53",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008974:0",
            "title": "Yields Dive Below 4%, Bond Spreads Hit Yearly Highs as Traders Get Spooked — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Karishma Vanjani</span></p><p class=\"\"><span>Traders are accepting Treasuries at a more expensive price tag, but are demanding more compensation to buy corporate debt. The split exposes deepening concerns among investors over AI.</span></p><p class=\"\"><span>Yields have dropped to 2026 lows while credit spreads have widened to their highs this year. The yield on a virtually risk-free U.S. 10-year Treasury debt traded as low as 3.978% on Friday, its lowest intraday value since Nov. 28. Lower yields mean higher prices for Treasuries since the two move in opposite directions.</span></p><p class=\"\"><span>Spreads, or the extra money companies must pay over a risk-free Treasury, for reputed company bonds are at 0.82 percentage points on average, the highest since Nov. 25.</span></p><p class=\"\"><span>Spreads for more unstable companies, or on junk bonds, are sitting at 2.82 percentage points, the highest since December.</span></p><p class=\"\"><span>Investors are increasingly concerned about capital expenditures by mega-cap tech companies and how AI could disrupt different sectors. Nervous capital has fled the volatility of the stock market — and now even the corporate bond market — to seek refuge in the stability of U.S. Treasuries.</span></p><p class=\"\"><span>The potential for another U.S. military campaign against Iran is also pushing 10-year yields lower. Oil, as measured by the West Texas Intermediate benchmark, is up 2.1% to $66.89, a sign investors fear more conflict.</span></p><p class=\"\"><span>\"Investor concern is undoubtedly justified at the moment,\" wrote Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets, in a note to clients. \"This is a constructive shift for Treasuries.\"</span></p><p class=\"\"><span>For companies, that means they have to pay a higher dollar to attract investors. In January, America's safest companies were paying investors near 0.75 percentage points in additional yield on average, a level matching 1998 lows.</span></p><p class=\"\"><span>Feels like its go time for bears.</span></p><p class=\"\"><span>Write to Karishma Vanjani at karishma.vanjani@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008974:0/",
            "pub_date": "2026-02-28 02:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:fa3b98fce094b:0",
            "title": "Video - CEO Clips: Erdene Resource Development Advances High-Grade Gold Project in Mongolia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Erdene Resource Development </span><span> (OTCQX: ERDCF) is producing at a high-grade gold project in an underexplored district in Mongolia while progressing studies and exploration on gold, copper and molybdenum prospects. The company's first mover position and strategic local partnership support continued exploration and multi-commodity growth.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Erdene Resource Development. </span><span> (OTCQX: ERDCF)</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/zAJGGFjoxA\" rel=\"nofollow\" target=\"_blank\">https://erdene.com/</a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About BTV - Business Television:</span></strong></p><p class=\"\"><span>For over 25 years, BTV has been a capital markets focused TV production and Digital Marketing Agency. BTV helps companies increase their brand awareness to a national retail and institutional investor audience, combining unique content creation and major distribution services on top tier networks including Bloomberg, CNBC, FOX Business News and financial sites. The BTV suite of strategic products include: BTV- Business Television Show, CEO Clips™, TV Branding Ads, Digital, Lead Gen, Social and Direct Email Marketing Campaigns that reach investors where they research and live on-air and online.</span></p><p class=\"\"><span>Discover Investment Opportunities!</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/4YByyuQPnm\" rel=\"nofollow\" target=\"_blank\">www.b-tv.com/theagency </a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About CEO Clips:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CEO Clips</span></strong><span> - are short company video profiles broadcast to a large audience of investors on TV and 15+ financial sites including Reuters, Yahoo!Finance, and Wall Street Journal.</span></p><p class=\"\"><span>Contact: Trina Schlingmann (604) 664-7401 x 5 trina@b-tv.com </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:fa3b98fce094b:0-video-ceo-clips-erdene-resource-development-advances-high-grade-gold-project-in-mongolia/",
            "pub_date": "2026-02-28 02:30:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa8049Ua:0",
            "title": "REG - RNS - Final Announcement Released",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><span>RNS Number : 8049U  RNS  27 February 2026   This is the end of day message for the RNS system Friday 27 February 2026.This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  EODTRMPTMTJTBMF</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa8049Ua:0-reg-rns-final-announcement-released/",
            "pub_date": "2026-02-28 02:30:15",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947569:0",
            "title": "PSTG: Hyperscaler revenue and enterprise demand drive accelerated growth, supported by new models",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Management expects hyperscaler revenue to ramp in FY27, driven by a new business model and strong customer relationships. Broad-based demand, especially in enterprise and AI, supports accelerated growth, while strategic acquisitions and supply chain efficiencies enhance competitiveness.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947569:0-pstg-hyperscaler-revenue-and-enterprise-demand-drive-accelerated-growth-supported-by-new-models/",
            "pub_date": "2026-02-28 02:30:44",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947570:0",
            "title": "Sunstone Hotel Investors: Q4 beat expectations; 2026 outlook strong with growth in RevPAR, earnings, and capital returns",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Fourth quarter results exceeded expectations, led by strong resort and Andaz Miami Beach performance. 2026 guidance calls for 4%-7% rooms RevPAR growth and 5% earnings growth, with continued capital returns and disciplined asset recycling. </span></p><p class=\"\"><span>Based on Sunstone Hotel Investors Q4 2025 Audio Transcript — Feb. 27 2026</span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947570:0-sunstone-hotel-investors-q4-beat-expectations-2026-outlook-strong-with-growth-in-revpar-earnings-and-capital-returns/",
            "pub_date": "2026-02-28 02:30:45",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227008982:0",
            "title": "argenx Is Maintained at Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227008982:0/",
            "pub_date": "2026-02-28 02:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}