{
    "data": [
        {
            "id": "DJN_DN20250205004221_20250205004221:0",
            "title": "Capri Holdings 3Q Loss/Shr $4.61 >CPRI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004221_20250205004221:0/",
            "pub_date": "2025-02-05 19:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004221_20250205004231:0",
            "title": "Capri Holdings 3Q Loss $546M >CPRI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004221_20250205004231:0/",
            "pub_date": "2025-02-05 19:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1b14f10c98b9b:0",
            "title": "Bunge Global SA Reports Fourth Quarter and Full-Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bunge Global SA, a leading global agribusiness and food company, has released its financial results for the fourth quarter and full-year 2024. The company, headquartered in St. Louis, Missouri, operates in more than 40 countries and is a major player in oilseed processing and the production of specialty plant-based oils and fats.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the full year 2024, Bunge reported a GAAP diluted EPS of $7.99, a significant decrease from $14.87 in the prior year. On an adjusted basis, excluding certain gains/charges and mark-to-market timing differences, the EPS was $9.19 compared to $13.66 in 2023. The fourth quarter GAAP diluted EPS was $4.36, slightly up from $4.18 in the previous year, while the adjusted EPS was $2.13, down from $3.70.</p><p class=\"\">Net income attributable to Bunge for the full year was $1.137 billion, a sharp decline from $2.243 billion in 2023. The company's core segment EBIT also saw a decrease, with $2.171 billion reported for 2024 compared to $3.717 billion in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">In the Agribusiness segment, Bunge experienced lower processing results, partially offset by higher merchandising. The Refined and Specialty Oils segment saw lower results primarily driven by North America. The company made substantial progress on growth investments and strategic partnerships, as well as the divestiture of its sugar &amp; bioenergy joint venture.</p><p class=\"\">During the fourth quarter, Bunge repurchased $500 million of shares, bringing the year-to-date total to $1.1 billion.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Bunge is in the late stages of regulatory processes for its announced combination with Viterra and CJ Selecta. The company has also achieved its 100% traceability and monitoring targets in Brazil, marking a significant step in its sustainability efforts.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Greg Heckman, Bunge’s Chief Executive Officer, commented, “Our team closed out a year of significant achievements for Bunge. We made great progress on integration planning for our announced combination with Viterra and, having received the vast majority of regulatory approvals, we expect to close the transaction soon. We continued to make productivity improvements from our investments in the business while returning significant capital to shareholders. And we took meaningful steps in sustainability by achieving our 100% traceability and monitoring targets in Brazil.\"</p><p class=\"\">Heckman also noted the challenges faced due to increased geopolitical uncertainty but expressed confidence in the company's ability to continue creating value for all stakeholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, Bunge forecasts a full-year adjusted EPS of approximately $7.75, excluding announced acquisitions expected to close during the year. The company anticipates lower results in the Agribusiness segment, particularly in Processing, while Merchandising results are expected to be slightly down. Refined and Specialty Oils results are projected to decline due to a more balanced supply and demand environment in North America. However, Milling and Corporate and Other segments are expected to see improved results.</p><p class=\"\">Bunge also expects an adjusted annual effective tax rate in the range of 21% to 25%, net interest expense between $250 to $280 million, capital expenditures of $1.5 to $1.7 billion, and depreciation and amortization of approximately $490 million.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1996862/000199686225000006/bg-20250205.htm\" rel=\"nofollow\" target=\"_blank\">Bunge Global SA [ BG ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:1b14f10c98b9b:0-bunge-global-sa-reports-fourth-quarter-and-full-year-2024-results/",
            "pub_date": "2025-02-05 19:45:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004220:0",
            "title": "Bunge Global SA Files 8K - Operations And Financial Condition >BG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bunge Global SA (BG) filed a Form 8K - Operations and Financial Condition - with the U.S Securities and Exchange Commission on February 05, 2025.</p><p class=\"\">On February 5, 2025, Bunge Global SA (\"Bunge\") issued a press release announcing its financial results for the fourth quarter and full year ended December 31, 2024. The press release is furnished as Exhibit 99.1 to this report and incorporated herein by reference.</p><p class=\"\">In accordance with general instruction B.2 of Form 8-K, the information in this Item 2.02, including exhibits, is furnished pursuant to Items 2.02 and 9.01 and shall not be deemed \"filed\" for the purposes of Section 18 of the Securities Exchange Act of 1934, or otherwise subject to the liability of that section.</p><p class=\"\">The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1996862/000199686225000006/bg-20250205.htm</p><p class=\"\">Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1996862/000199686225000006/0001996862-25-000006-index.htm</p><p class=\"\">Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004220:0/",
            "pub_date": "2025-02-05 19:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:ae1382ce8d152:0",
            "title": "Boston Scientific Q4 and Full Year 2024 Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Boston Scientific Corporation has released its financial results for the fourth quarter and full year 2024, showcasing significant growth across various metrics. The company, known for its innovative medical technologies, reported robust increases in net sales and earnings per share (EPS), driven by a strong product portfolio and strategic acquisitions.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, Boston Scientific reported net sales of $4.561 billion, marking a 22.4% increase on a reported basis compared to the same period last year. On an operational basis, net sales grew by 23.1%, and on an organic basis, by 19.5%. The company achieved a GAAP net income attributable to common stockholders of $566 million, or $0.38 per share, up from $504 million, or $0.34 per share, in the prior year period. Adjusted EPS for the quarter was $0.70, compared to $0.55 a year ago.</p><p class=\"\">For the full year 2024, net sales reached $16.747 billion, a 17.6% increase on a reported basis. Operational and organic net sales grew by 18.5% and 16.4%, respectively. GAAP net income attributable to common stockholders was $1.853 billion, or $1.25 per share, compared to $1.570 billion, or $1.07 per share, in 2023. The company reported an adjusted EPS of $2.51 for the year, up from $2.05 in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Boston Scientific's performance was bolstered by strong sales across its segments. The MedSurg segment saw a 12.4% increase in reported net sales, while the Cardiovascular segment experienced a 28.8% rise. Regionally, the United States led with a 30.7% increase in reported net sales, followed by Europe, Middle East, and Africa (EMEA) with 10.8%, Asia-Pacific (APAC) with 11.1%, and Latin America and Canada (LACA) with 4.6%.</p><p class=\"\">Notable product launches and clinical achievements included the FARAPULSE™ Pulsed Field Ablation System and positive clinical trial results for the WATCHMAN FLX™ Left Atrial Appendage Closure Device. The company also received regulatory approvals for several products, including the Vercise™ Cartesia™ X and HX Directional Leads.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Boston Scientific completed the acquisition of Axonics, Inc., and Cortex, Inc., and announced agreements to acquire Bolt Medical, Inc., and Intera Oncology® Inc. These acquisitions are expected to enhance the company's product offerings and market reach.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Mike Mahoney, Chairman and CEO of Boston Scientific, stated, \"2024 was one of the best years in the history of Boston Scientific, fueled by our innovative portfolio, the launch of our FARAPULSE™ Pulsed Field Ablation System as well as significant clinical achievements and commercial excellence across businesses and regions. We have a strong foundation for growth, and I am incredibly grateful for our talented global team and the opportunity to continue transforming the lives of millions of patients around the world.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead, Boston Scientific estimates net sales growth for the full year 2025 to be in the range of 12.5% to 14.5% on a reported basis and 10% to 12% on an organic basis. The company projects GAAP EPS to be between $1.86 and $1.93, with adjusted EPS expected to range from $2.80 to $2.87. For the first quarter of 2025, net sales growth is anticipated to be between 17% and 19% on a reported basis and 14% to 16% on an organic basis, with GAAP EPS estimated at $0.43 to $0.45 and adjusted EPS at $0.66 to $0.68.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/885725/000088572525000007/bsx-20250205.htm\" rel=\"nofollow\" target=\"_blank\">BOSTON SCIENTIFIC CORP [ BSX ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:ae1382ce8d152:0-boston-scientific-q4-and-full-year-2024-financial-results/",
            "pub_date": "2025-02-05 19:45:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0D7:0",
            "title": "Workday Announces Restructuring Plan To Eliminate 1,750 Positions",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Workday Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">WORKDAY INC - ANNOUNCES RESTRUCTURING PLAN TO ELIMINATE 1,750 POSITIONS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WORKDAY INC - ESTIMATES $230 MILLION-$270 MILLION IN RESTRUCTURING CHARGES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WORKDAY: EXPECTS TO EXIT CERTAIN OWNED OFFICE SPACE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WORKDAY INC - EXPECTS Q4 GAAP OPERATING MARGIN 22-23 PTS LOWER THAN NON-GAAP</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WORKDAY: AFFECTED EMPLOYEES IN U.S. WILL BE OFFERED A MINIMUM OF 12 WEEKS OF PAY, WITH ADDITIONAL WEEKS BASED ON TENURE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0D7:0-workday-announces-restructuring-plan-to-eliminate-1-750-positions/",
            "pub_date": "2025-02-05 19:45:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW16M:0",
            "title": "Gold miners up as US-China trade war sparks record-breaking bullion rally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** U.S.-listed shares of gold miners up premarket as bullion continues its record rally and jumps 1% </p><p class=\"\">** Spot gold  up 0.9% at $2,868.36/ounce, after rising 1% and hitting a record high of $2,869.68 earlier in the session</p><p class=\"\">** Gold prices rose, driven by safe-haven demand, amid the escalating U.S.-China trade war, while the spotlight was also on payrolls data from the world's largest economy</p><p class=\"\">** Top miner Newmont  and Barrick Gold  up 1.1% and 1.3%, respectively</p><p class=\"\">** U.S.-listed shares of South African miners Gold Fields  up 2.5%, Harmony Gold  rises ~1% and AngloGold Ashanti  up 1.5%</p><p class=\"\">** U.S.-listed shares of Canadian miners Agnico Eagle Mines  and Kinross Gold  up 1.3% and 1.7%, respectively</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW16M:0-gold-miners-up-as-us-china-trade-war-sparks-record-breaking-bullion-rally/",
            "pub_date": "2025-02-05 19:45:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr4Bl9FK:0",
            "title": "Checkin.com Group: Webcast of Year-end report for 2024 Thursday February 13th 08.30 CET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Checkin.com Group<p class=\"\">On Thursday February 13th at 07.30 CET Checkin.com Group publishes the Year-end report for January - December 2024 on the company’s website. In a webcast the same day at 08.30 CET the report will be presented by the company’s CEO Christian Karlsson and CFO Martin Bäuml.</p><p class=\"\">The webcast (Swedish) will be available through this link:</p><p class=\"\">https://www.finwire.tv/webcast/checkin-com/bokslutskommunike-2024/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The full report will be published on:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">https://group.checkin.com/investors/reports/</strong></p><p class=\"\">An English version of the webcast will be published on the company’s website later the same day. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Jonas Köpniwsky, Head of Communications Checkin.com Group, press@checkin.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Certified Adviser</strong></p><p class=\"\">Checkin.com Group’s Certified Adviser is Carnegie Investment Bank AB (publ).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Checkin.com Group</strong></p><p class=\"\">Checkin.com Group, founded in 2017, specializes in creating secure digital environments by helping businesses establish who is on the other side of the screen. The company’s advanced KYC solutions streamline user registration, identification and login processes while also ensuring that their Enterprise and SME customers meet strict regulatory standards. This is achieved through a variety of advanced technologies that in real time verify user identities, assess ages, and scan official documents with high accuracy. The software also features biometric technologies to provide an extra layer of fraud prevention while enabling seamless experiences for end-users. </p><p class=\"\">By offering a smooth and secure experience for users and flexibility and customer-focus for partners, the software drives both user trust and business growth. The Group is headquartered in Stockholm, Sweden, but operates and recruits globally to attract world-leading talent. </p><p class=\"\">Checkin.com Group’s share is since 2021 listed on Nasdaq First North Growth Market under the trading symbol \"CHECK”. The company creates shareholder value and growth through organic growth and strategic acquisitions. </p><p class=\"\">For more information about the company visit: https://group.checkin.com/investors/</p><p class=\"\">https://news.cision.com/checkin-com-group/r/checkin-com-group--webcast-of-year-end-report-for-2024-thursday-february-13th-08-30-cet%2Cc4100913</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr4Bl9FK:0-checkin-com-group-webcast-of-year-end-report-for-2024-thursday-february-13th-08-30-cet/",
            "pub_date": "2025-02-05 19:45:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1FE:0",
            "title": "Ceconomy jumps 15% on report JD.Com revives interest in buying co",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Ceconomy  jump as much as 15.4% to their highest prices since April 2022 after Bloomberg News reported that JD.com has renewed interest in buying the German electronics retailer</p><p class=\"\">** JD.com recently approached Ceconomy about a potential deal and has started sounding out large shareholders of the German company, Bloomberg said citing people familiar with the matter</p><p class=\"\">** \"We do not comment on speculation,\" Ceconomy told Reuters </p><p class=\"\">** At 1142 GMT Ceconomy's shares are up 14.9%; if gains hold they will see their best day since November 2023</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1FE:0-ceconomy-jumps-15-on-report-jd-com-revives-interest-in-buying-co/",
            "pub_date": "2025-02-05 19:45:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW18Q:0",
            "title": "Rxo Expects Q1 2025 Adjusted EBITDA Between $20 Million And $30 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RXO Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">RXO INC - EXPECTS Q1 2025 ADJUSTED EBITDA BETWEEN $20 MILLION AND $30 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">RXO INC - RAISING ANNUALIZED COST SYNERGY ESTIMATE TO AT LEAST $50 MILLION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW18Q:0-rxo-expects-q1-2025-adjusted-ebitda-between-20-million-and-30-million/",
            "pub_date": "2025-02-05 19:45:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309677:0",
            "title": "Morgan Stanley Lowers Price Target on Varonis Systems to $54 From $60, Keeps Overweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Varonis Systems  has an average rating of overweight and mean price target of $57.67, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309677:0/",
            "pub_date": "2025-02-05 19:45:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_PLXCA2CEB:0",
            "title": "BRIEF-Evercore Q4 Adjusted EPS USD 3.41 Vs. IBES Estimate USD 2.85",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 05 (Reuters) - Evercore Q4 adjusted operating margin 22.2%.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q4 EBIT USD 212.6 million</li><li class=\"listItem-bmN0_SHH\">Q4 EPS USD 3.3</li><li class=\"listItem-bmN0_SHH\">Q4 operating margin 21.8%</li><li class=\"listItem-bmN0_SHH\">Q4 revenue USD 975.3 million vs. IBES estimate USD 885.1 million</li><li class=\"listItem-bmN0_SHH\">Q4 dividend USD 0.8</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_PLXCA2CEB:0-brief-evercore-q4-adjusted-eps-usd-3-41-vs-ibes-estimate-usd-2-85/",
            "pub_date": "2025-02-05 19:45:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_PLX754E85:0",
            "title": "BRIEF-Capri Holdings Q3 Adjusted EPS USD 0.45 Vs. IBES Estimate USD 0.66",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 05 (Reuters) - Capri Holdings Q3 operating income USD -590 million.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q3 adjusted net income USD 54 million vs. IBES estimate USD 78.6 million</li><li class=\"listItem-bmN0_SHH\">Q3 adjusted operating income USD 76 million vs. IBES estimate USD 88 million</li><li class=\"listItem-bmN0_SHH\">Q3 net income USD -547 million</li><li class=\"listItem-bmN0_SHH\">Q3 revenue USD 1,260 million vs. IBES estimate USD 1,257 million</li><li class=\"listItem-bmN0_SHH\">Q3 adjusted operating margin 6%</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_PLX754E85:0-brief-capri-holdings-q3-adjusted-eps-usd-0-45-vs-ibes-estimate-usd-0-66/",
            "pub_date": "2025-02-05 19:45:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004166:0",
            "title": "Disney's First-Quarter Profits Surpass Street Views",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Colin Kellaher</p><p class=\"\">Disney posted fiscal first-quarter profits that topped Wall Street's expectations, bolstered by strong performances from its movie studios and streaming business.</p><p class=\"\">Disney on Wednesday reported an adjusted profit of $1.76 a share for the quarter ended Dec. 28, up from $1.22 a share a year earlier and well ahead of the $1.45 a share that analysts polled by FactSet, on average, were expecting.</p><p class=\"\">Revenue rose 5% to $24.69 billion, just above the $24.67 billion that Wall Street had penciled it.</p><p class=\"\">The Burbank, Calif., company said it still expects high single-digit growth in adjusted per-share earnings for the current fiscal year.</p><p class=\"\">Write to Colin Kellaher at colin.kellaher@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004166:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004168:0",
            "title": "Disney Earnings Bolstered by Streaming Gains, 'Moana 2' — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Isabella Simonetti</p><p class=\"\">Streaming gains and a strong box office showing by \"Moana 2\" bolstered Disney's performance in the final three months of last year, signs that its turnaround strategy is bearing fruit.</p><p class=\"\">Disney's earnings topped Wall Street expectations for key metrics including revenue, net income and streaming profit.</p><p class=\"\">The company said a new ESPN tile on Disney+ and improved direct-to-consumer profitability showed progress in its streaming-centric strategy. Cord-cutting continued to weigh on the company's legacy TV business.</p><p class=\"\">Disney's streaming business, home to Disney+, Hulu and ESPN+, reported a profit of $293 million for the three months through December, compared with a $138 million loss a year earlier. That profit exceeded analyst expectations by more than $100 million.</p><p class=\"\">Price increases during the period buoyed its revenue, and Disney+ lost fewer customers from the price hike than expected. The company's two biggest streaming services, Disney+ and Hulu, had 178 million paid subscribers at the end of December, up from 177.3 million at the end of the prior quarter.</p><p class=\"\">The company continues to build out its stable of streaming offerings and plans to launch a new ESPN direct-to-consumer service later this year.</p><p class=\"\">Disney, Fox and Warner in January called off a separate planned sports streaming joint venture called Venu Sports in the face of legal challenges. Exiting that venture is likely to lead to a $50 million hit to Disney's sports operating income in the current quarter, the company said.</p><p class=\"\">Earlier this year, Disney agreed to combine its Hulu + Live TV streaming service with sports-focused Fubo TV, ending Fubo's litigation over the formation of Venu.</p><p class=\"\">After a strong 2024 at the box office, \"Moana 2\" helped Disney's studio end the year on a high note. The unit reported a profit of $312 million compared with a $224 million loss a year earlier. \"Moana 2,\" released late last year, has grossed more than $1 billion.</p><p class=\"\">Companywide revenue increased 5% to $24.7 billion in the quarter ended Dec. 28. Net income climbed 34% to $2.6 billion.</p><p class=\"\">Disney shares are up roughly 2% year-to-date and 17% over the past year.</p><p class=\"\">Hurricanes Milton and Helene dinged the performance of Disney's Experiences unit, which is home to its theme parks and cruises. Milton led to a one-day closure of Walt Disney World Resort and the cancellation of a cruise itinerary.</p><p class=\"\">Experiences' income of $3.1 billion for the final three months of 2024 was relatively unchanged compared with the prior-year period.</p><p class=\"\">Disney had previously said it expects operating income in the Experiences division to grow by 6% to 8% in its 2025 fiscal year, with most of that growth coming during the second half.</p><p class=\"\">Operating income for Disney's traditional TV business declined 11% to $1.1 billion. Its domestic business fared better, with operating income for the final quarter flat year-over-year.</p><p class=\"\">Write to Isabella Simonetti at isabella.simonetti@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004168:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004128_20250205004134:0",
            "title": "Disney 1Q Sports Revenue $4.85B >DIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004128_20250205004134:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004128_20250205004131:0",
            "title": "Disney 1Q Rev $24.69B >DIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004128_20250205004131:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004128_20250205004130:0",
            "title": "Disney 1Q Net $2.55B >DIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004128_20250205004130:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004128_20250205004133:0",
            "title": "Disney 1Q Experiences Revenue $9.41B >DIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004128_20250205004133:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004128_20250205004132:0",
            "title": "Disney 1Q Entertainment Revenue $10.87B >DIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004128_20250205004132:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004128_20250205004128:0",
            "title": "Disney 1Q EPS $1.40 >DIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004128_20250205004128:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004128_20250205004129:0",
            "title": "Disney 1Q Adj EPS $1.76 >DIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004128_20250205004129:0/",
            "pub_date": "2025-02-05 19:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309662:0",
            "title": "Bio-Techne's Fiscal Q2 Adjusted Earnings, Net Sales Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bio-Techne  reported fiscal Q2 adjusted earnings Wednesday of $0.42 per diluted share, up from $0.40 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.39. </p><p class=\"\">Net sales for the quarter ended Dec. 31 were $297 million, up from $272.6 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $285.8 million. </p><p class=\"\">The company's shares were up nearly 6% in recent premarket activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309662:0/",
            "pub_date": "2025-02-05 19:40:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309661:0",
            "title": "Earnings Flash (COR) Cencora Posts Fiscal Q1 Revenue $81.49 Billion, vs. FactSet Est of $78.31 Billion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309661:0/",
            "pub_date": "2025-02-05 19:40:21",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObiSmgmVa:0",
            "title": "Euronext Oslo Børs - Olav Thon Eiendomsselskap ASA - Received application for listing of bonds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oslo Børs has received an application for ISIN NO0013470583 to be admitted tostock exchange listing.</p><p class=\"\">The Market Abuse Regulation (MAR) applies from the time the application hasbeenmade, including the issuer's disclosure obligation on inside information.</p><p class=\"\">https://newsweb.oslobors.no/message/637760</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObiSmgmVa:0-euronext-oslo-b-rs-olav-thon-eiendomsselskap-asa-received-application-for-listing-of-bonds/",
            "pub_date": "2025-02-05 19:40:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463995:0",
            "title": "Japan Average Cash Earnings Up Nearly 5% in December; Overtime Pay Gains",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The average cash earnings for establishments in Japan with at least five employees rose 4.8% year over year in December to 619,580 yen, the Ministry of Health, Labour, and Welfare reported Wednesday. </p><p class=\"\">The reading was an improvement from the 3% gain in November and was higher than the consensus forecast for a 3.8% rise. </p><p class=\"\">Contractual cash earnings grew 2.5% on year during the month to 285,662 yen, while special cash earnings edged up 6.8% to 333,918 yen, the report said. </p><p class=\"\">Cash earnings for firms with 30 or more staff rose 5.1% from a year earlier to 743,195 yen, with contractual earnings up 3.2% to 320,469 yen and special earnings up 6.5% to 422,726 yen. </p><p class=\"\">Meanwhile, non-scheduled cash earnings, or overtime pay, at firms with five or more employees gained 1.3% from a year ago to 20,359 yen, the Ministry said. </p><p class=\"\">Overtime pay for businesses with at least 30 staff inched 2.8% higher to 25,791 yen in December.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463995:0/",
            "pub_date": "2025-02-05 19:40:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463977:0",
            "title": "Alstom Reaches Deal to Offload German Industrial Site to KNDS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alstom  signed a framework agreement to offload its industrial site in Görlitz, Germany, to defense industry company KNDS. </p><p class=\"\">The trains, metros, and related infrastructure developer announced on Wednesday that KNDS will manufacture assemblies for the Leopard 2 battle tank and the Puma infantry fighting vehicle in Görlitz. </p><p class=\"\">The agreement calls for KNDS to take on between 350 and 400 employees from the Alstom site. KNDS will consider offering another 75 employees with career opportunities at other sites and Alstom will also make job offers to 100 impacted employees at its other sites. </p><p class=\"\">The first staff takeovers and KNDS production is slated to begin in 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463977:0/",
            "pub_date": "2025-02-05 19:34:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309656:0",
            "title": "Earnings Flash (RXO) RXO Posts Q4 Revenue $1.67B, vs. FactSet Est of $1.66B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309656:0/",
            "pub_date": "2025-02-05 19:34:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309630:0",
            "title": "Goldman Sachs Adjusts Price Target on Pfizer to $32 From $33, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pfizer  has an average rating of overweight and mean price target of $30.60, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309630:0/",
            "pub_date": "2025-02-05 19:34:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW163:0",
            "title": "Karman Holdings, shareholders seek to raise $421 mln in US IPO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Defense and space systems maker Karman Holdings said on Wednesday that the company and selling shareholders were aiming to raise up to $421 million in its initial public offering in the United States.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW163:0-karman-holdings-shareholders-seek-to-raise-421-mln-in-us-ipo/",
            "pub_date": "2025-02-05 19:34:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}