{
    "data": [
        {
            "id": "DJN_DN20250204008391:0",
            "title": "Viper Energy Price Target Cut to $58.00/Share From $64.00 by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008391:0/",
            "pub_date": "2025-02-05 00:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309048:0",
            "title": "BP to Invest Up to $25 Billion in Kirkuk Oil, Gas Fields, Reuters Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309048:0/",
            "pub_date": "2025-02-05 00:22:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309046:0",
            "title": "Market Chatter: Novartis on Lookout for Next-Generation Obesity Drug Candidates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Novartis  is on the hunt for next-generation obesity drug candidates, despite its main focus remaining on therapeutic areas where it has an established presence, The Wall Street Journal reported Tuesday, citing an interview with Chief Executive Vasant Narasimhan. </p><p class=\"\">\"The bar is very high, we need to find something that's truly differentiated, that brings something new,\" Narasimhan told the Journal. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309046:0/",
            "pub_date": "2025-02-05 00:22:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008392:0",
            "title": "Cummins Stock Rises. There Is More To The Engine Maker Than Trucks. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Al Root</p><p class=\"\">Cummins stock jumped Tuesday after the diesel engine maker posted solid fourth-quarter results and an equally solid outlook for 2025 — all amid a declining market for heavy-duty trucks.</p><p class=\"\">It turns out, there is more to Cummins than trucks.</p><p class=\"\">Tuesday morning, Cummins reported per-share earnings, adjusted for several charges, of more than $12 for the fourth quarter. Wall Street was looking for closer to $5, but comparability is tough. Operating profit was about $920 million, a little better than analysts projected.</p><p class=\"\">Some of the charges were to reorganize Cummins' Accelera business unit, which focuses on zero-emissions technologies, including batteries and fuel cells.</p><p class=\"\">\"Cummins delivered strong operational results in the fourth quarter and achieved record full-year revenues, net income...and EPS [earnings per share], despite a decline in heavy-duty truck demand in North America,\" said CEO Jennifer Rumsey in a news release.</p><p class=\"\">Shares spiked 5.6% to $367.73 in early trading, while the S&amp;P 500 was up 0.1% and the Dow Jones Industrial Average was down 0.2%.</p><p class=\"\">The outlook is helping too. For 2025, Cummins expects sales to grow 2% to 3% and earnings before interest, taxes, depreciation, and amortization, or Ebitda, to be about $5.8 billion. That's about $100 million to $200 million more than current Street projections.</p><p class=\"\">Sales are predicted to rise, despite expected declines in truck-related sales. The company expects the North American heavy-duty truck market to decline about 5% in 2024. Medium-duty truck demand should fall closer to 10%.</p><p class=\"\">Cummins makes a lot of engines for trucks. But it also makes power generation units. Demand from data centers is helping boost sales growth.</p><p class=\"\">\"Strength in data center offsetting softness in core [truck] markets,\" wrote Jefferies analyst Stephen Volkmann in a Tuesday report.</p><p class=\"\">Power systems sales should be up 2% to 7% in 2025, according to the company, after growing 13% in 2024. Sales in Cummins' distribution business are expected to grow as well, helping offset truck weakness.</p><p class=\"\">Volkmann rates shares Buy and has a $435 price target. Citi analyst Kyle Menges rates shares Buy and has a $430 price target for the stock. shares.</p><p class=\"\">Mengese called the profit margin guidance \"encouraging\" in a Tuesday report.</p><p class=\"\">Those are two bulls. Overall, just 30% of analysts covering Cummins shares rate them Buy. The average Buy-rating ratio for stocks in the S&amp;P 500 is about 55%. The average analyst price target for Cummins shares is about $390.</p><p class=\"\">Most of Wall Street looks to be focused on the core truck market, but there is more to Cummins than trucks.</p><p class=\"\">Write to Al Root at allen.root@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008392:0/",
            "pub_date": "2025-02-05 00:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309037:0",
            "title": "Amazon Poised for 'Strong' Q4 Results, BofA Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Amazon.com  is expected to report \"strong\" Q4 results with increasing artificial intelligence contribution from its Amazon Web Services cloud-computing business, BofA Securities said Tuesday. </p><p class=\"\">The e-commerce giant is scheduled to report Q4 results Thursday. BofA expects earnings of $1.53 per share on revenue of $187.24 billion. Wall Street is looking for $1.47 and $187.31 billion, respectively, according to BofA. </p><p class=\"\">\"Q4 retail data was constructive for revenues, and for cloud, we think AWS can meet expectations for 19-20% growth on a growing AI contribution,\" BofA analyst Justin Post said in a note to clients. </p><p class=\"\">The bank expects Q1 sales guidance of $152.25 billion to $158.25 billion, versus market expectations for $158.7 billion, according to the note. </p><p class=\"\">\"Investors may already be expecting upside to AWS and retail margins, but we think Amazon's strong relative profit growth and strong AI positioning via AWS should support the stock's multiple,\" Post said. </p><p class=\"\">BofA maintained its buy rating on the stock, with a $255 price objective</p><p class=\"\">Amazon shares were up by nearly 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309037:0/",
            "pub_date": "2025-02-05 00:23:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309052:0",
            "title": "Topaz Energy Maintained at Outperform at BMO After Acquisition; Price Target Kept at C$32.00",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BMO Capital Markets reiterated its outperform rating on the shares of Topaz Energy  and its C$32.00 price target after Western Canadian oil and gas royalty and infrastructure company acquired a stake in a natural-gas processing plant and a royalty on Alberta exploration lands. </p><p class=\"\">\"Topaz stands out as a uniquely positioned company, with royalties across some of the most active plays in Canada. Specifically to Topaz are its infrastructure royalties on 'newer' facilities, and GORRs on the best plays in the basin, where we continue to see revisions upward on well productivity rates. TPZ continues its M&amp;A strategy today, by announcing another GORR and infrastructure acquisition in the Pouce Coupe Montney region at an attractive ~7.5x NOI multiple. As TPZ's size grows, in profitable ways, this should attract more investor recognition through 2025,\" analyst Jeremy McCrea wrote.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309052:0/",
            "pub_date": "2025-02-05 00:23:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8v4qQr:0",
            "title": "Click announced the CEO Statement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong, Feb.  04, 2025  (GLOBE NEWSWIRE) — Today, Click Holdings Limited (<strong class=\"root-Tkn6WL2y\">NASDAQ: CLIK</strong>) (“Click” or the “Company” or “we” or “our”), a fast-growing human resources solutions provider based in Hong Kong, would like to share the joy and happiness of the Lunar Chinese New Year with all our shareholders, customers and business partners. As we drew a close to the Year of Dragon, our CEO, Mr. Chan Chun Sing, Jeffrey would like to report to you our numerous key achievements in 2024 and share his visions for the year ahead.</p><p class=\"\">“2024 was a remarkable year for Click.” said Jeffrey, founder and CEO of Click. “Not only did we accomplish the historical public listing by raising US$5.6 million on Nasdaq, we also achieved countless breakthroughs in our business.”</p><p class=\"\">“We experienced significant growth across all segments. As for the seniors nursing solution services, we achieved a record of over 170,000 service hours in calendar year 2024, expecting a growth of 60% as compared to that of 2023. In particular, we project our logistic solution services would record a spectacular growth of 90%. To further extend our coverage, in December 2024, we entered a cooperation agreement with Care U Professional Nursing Service Limited, one of the leading nursing service providers in Hong Kong, in order to tap into the prominent government-sponsored CCSV scheme aiming to provide community care services to senior citizens in Hong Kong.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key 2024 Achievements</strong></p><p class=\"\">- Strong growth in revenue – projected 40% surge in overall revenue in calendar year 2024 compared to that of 2023. We project both our nursing and logistics solutions segment recorded strong growth of 30% and 90% respectively.</p><p class=\"\">- Successfully raised US$5.6M of capital from listing</p><p class=\"\">- Tapping into home seniors nursing service through government-sponsored CCSV scheme</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Outlook for 2025 and Beyond</strong></p><p class=\"\">“While unemployment rate in Hong Kong stays low at around 3%, a change in working habit such as freelancers and slashers, is believed to be permanent. Therefore, we continue to expect high demand of human resources outsourcing services in the market. Meanwhile, as aging population becomes a global phenomenon, we will continue to invest big in the seniors nursing solution sector. We will expand our collaboration with business partners and may consider M&amp;A options when opportunities arise.”</p><p class=\"\">“Furthermore, embracing technology has always been a key to our success. Our CTO, Nixon Chau, former GM of SenseTime Group, a leading AI software company, will lead our team to expand into the smart home solutions market for seniors in Hong Kong. Needless to say, we will continue to invest in expanding our talent pool which has been the bedrock to our business, and will extend services to cover property management, food and beverages, and retailing, sectors all currently facing labour shortages in Hong Kong. We are currently the only Nasdaq-listed company focusing on seniors nursing HR solution in Hong Kong and will continue to sustain strong growth by providing a convenient platform to connect our talents with our clients’ HR shortfall.”</p><p class=\"\">“Looking ahead, I remain fully confident in all our business developments and I hope you feel the same. Last but not least, on behalf of Click, I would like to extend our warmest greetings to all our shareholders, customers and business partners, Kung Hei Fat Choy, wish you Good Health and Good Fortune in the Year of Snake ahead.” said Jeffrey.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Click Holdings Limited</strong></p><p class=\"\">We are a fast-growing human resources solutions provider based in Hong Kong, aiming to match our client’s human resources shortfall through our proprietary AI-empowered talent pool by one “click”. Our key businesses primarily include nursing solution (mainly seniors) services, logistics solution services and professional solution services.</p><p class=\"\">For more information, please visit https://clicksc.com.hk.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor Statement</strong></p><p class=\"\">Certain statements in this announcement are forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on the Company’s current expectations and projections about future events that the Company believes may affect its financial condition, results of operations, business strategy and financial needs. Investors can identify these forward-looking statements by words or phrases such as “may,” “will,” “expect,” “anticipate,” “aim,” “estimate,” “intend,” “plan,” “believe,” “is/are likely to,” “potential,” “continue” or other similar expressions. The Company undertakes no obligation to update or revise publicly any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations, except as may be required by law. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct, and the Company cautions investors that actual results may differ materially from the anticipated results and encourages investors to review other factors that may affect its future results in the Company’s registration statement and other filings with the SEC, which are available for review at www.sec.gov.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For enquiry, please contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Click Holdings Limited</strong></p><p class=\"\">Unit 709, 7/F., Ocean Centre</p><p class=\"\">5 Canton Road</p><p class=\"\">Tsim Sha Tsui, Kowloon</p><p class=\"\">Hong Kong</p><p class=\"\">Email: jack.wong@jfy.hk</p><p class=\"\">Phone: +852 2691 8200</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8v4qQr:0-click-announced-the-ceo-statement/",
            "pub_date": "2025-02-05 00:23:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "barchart:5ab731aac094b:0",
            "title": "Stocks Climb as Chip Stocks Rally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P 500 Index  today is up +0.58%, the Dow Jones Industrials Index  is up +0.09%, and the Nasdaq 100 Index  is up +1.14%. March E-mini S&amp;P futures (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/futures/quotes/ES*0/overview\" rel=\"nofollow\" target=\"_blank\">ESH25</a>) are up by +0.60%, and March E-mini Nasdaq futures (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/futures/quotes/NQ*0/overview\" rel=\"nofollow\" target=\"_blank\">NQH25</a>) are up by +1.19%. </p><p class=\"\">Stock indexes today are moderately higher. Stock index futures rallied in overnight trade after President Trump late Monday agreed to delay 25% tariffs on Canada for a month. Stocks extended their gains today as chip stocks rallied.</p><p class=\"\">However, stock gains are limited after the US imposed a 10% tariff on Chinese goods. China retaliated immediately and announced 15% tariffs on US coal and liquified natural gas and 10% levies on US oil and agriculture equipment. China also declared export control on tungsten-related materials, and the State Administration for Market Regulation said it would launch a probe into Google regarding anti-trust law breaches. The Chinese tariffs are set to take effect on February 10, potentially leaving room for negotiation.</p><p class=\"\">Stocks remained higher despite today's weaker-than-expected US economic reports. The Dec JOLTS job openings fell -556,000 to 7.6 million, showing a weaker labor market than expectations of 8.0 million. Also, Dec factory orders fell -0.9% m/m, weaker than expectations of -0.8% m/m and the biggest decline in 6 months.</p><p class=\"\">Hawkish comments Monday evening from Chicago Fed President Goolsbee were bearish for stocks and bonds when he said, \"The Fed has got to be a little more careful and more prudent of how fast interest rates can come down because there are risks that inflation is about to start kicking back up again.\"</p><p class=\"\">Corporate earnings results today are mixed. Palantir Technologies is up more than +25% after reporting better-than-expected Q4 revenue and forecasting full-year revenue above consensus. Also, Cummins is up more than +4% after reporting stronger-than-expected Q4 net sales. On the negative side, Estee Lauder is down more than -18% after forecasting Q3 organic net sales below consensus. Also, Merck is down more than -11% after projecting weaker-than-expected full-year total sales. </p><p class=\"\">Earnings season is in full swing as companies report Q4 earnings results. Megacap technology companies Alphabet and Advanced Micro Devices are set to report earnings after today's close. Qualcomm will release earnings on Wednesday. Amazon.com will release its quarterly results on Thursday. According to Bloomberg Intelligence, analysts estimate S&amp;P 500 earnings grew by +7.5% y/y in Q4, the second-highest pre-season forecast in the past three years.</p><p class=\"\">The markets are discounting the chances at 15% for a -25 bp rate cut at the next FOMC meeting on March 18-19.</p><p class=\"\">Overseas stock markets today are higher. The Euro Stoxx 50 is up +0.75%. China's Shanghai Composite Index did not trade today and will reopen Wednesday after the week-long Lunar New Year holiday. Japan's Nikkei Stock 225 closed up +0.72%.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Interest Rates</strong></p><p class=\"\">March 10-year T-notes (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/futures/quotes/ZN*0/overview\" rel=\"nofollow\" target=\"_blank\">ZNH2</a>5) today are unchanged. The 10-year T-note yield is down -0.2 bp to 4.553%. March T-notes today recovered from a 1-week low, and the 10-year T-note yield fell from a 1-week high of 4.594%. T-notes recovered early losses and are little changed as short covering emerged on today's weaker-than-expected US economic reports on Dec JOLTS job openings and Dec factory orders. </p><p class=\"\">T-notes initially moved lower as the safe-haven demand for T-notes subsided after President Trump delayed imposing tariffs on Canada and Mexico for a month. T-notes are also weighed down by negative carryover from a rise in European government bond yields today. In addition, T-notes were undercut by the inflationary implications of the 10% US tariffs on Chinese goods, which are hawkish for Fed policy. </p><p class=\"\">European government bond yields today are moving higher. The 10-year German bund yield is up +2.0 bp to 2.405%. The 10-year UK gilt yield is up +4.7 bp to 4.533%.</p><p class=\"\">Swaps are discounting the chances at 100% for a -25 bp rate cut by the ECB at the March 6 policy meeting.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">US Stock Movers</strong></p><p class=\"\">Palantir Technologies  is up more than +25% to lead gainers in the S&amp;P 500 and Nasdaq 100 after reporting Q4 revenue of $827.5 million, stronger than the consensus of $775.9 million, and forecast full-year revenue of $3.74 billion-$3.76 billion, well above the consensus of $3.54 billion. </p><p class=\"\">Chip stocks are climbing today to give the overall market a boost. Nvidia  is up more than +2% to lead gainers in the Dow Jones Industrials. Also, Advanced Micro Devices  and ARM Holdings  are up more than +2%. In addition, KLA Corp , Broadcom , Analog Devices , ASML Holding NV , ON Semiconductor , and Qualcomm  are up more than +1%. </p><p class=\"\">Xylem Inc  is up more than +6% after reporting Q4 revenue of $1.26 billion, stronger than the consensus of $2.18 billion. </p><p class=\"\">Super Micro Computer  is up more than +6% after saying it will give a business update on February 11 after being given an extension to file its financial reports for the fiscal year ended June 30 and the quarterly report for the period ended September 30. </p><p class=\"\">Fox Corp  is up more than +5% after reporting Q2 revenue of $5.08 billion, better than the consensus of $4.85 billion.</p><p class=\"\">Regeneron Pharmaceuticals  is up more than +5% after reporting Q4 adjusted EPS of $12.07, well above the consensus of $11.32.</p><p class=\"\">Cummins  is up more than +4% after reporting Q4 net sales of $8.45 billion, better than the consensus of $8.12 billion.</p><p class=\"\">Spotify Technology  is up more than +7% after reporting Q4 monthly active users of 675 million, better than the consensus of 664.94 million, and forecast Q1 monthly active users of 678 million, better than the consensus of 667.61 million. </p><p class=\"\">Estee Lauder  is down more than -18% to lead losers in the S&amp;P 500 after forecasting Q3 organic net sales falling -8% to -10%, weaker than the consensus of -5.08%. </p><p class=\"\">Merck &amp; Co  is down more than -11% to lead losers in the Dow Jones Industrials after saying it was halting shipments of its cancer-preventing Gardasil vaccine to China to at least through mid-year and projected full-year total sales between $64.1 billion-$65.6 billion, weaker than the consensus of $67.4 billion. </p><p class=\"\">PayPal Holdings  is down more than -8% to lead losers in the Nasdaq 100 after reporting Q4 total payment volume in its unbranded payment-processing business rose +2%, well below the +29% growth seen in the same quarter last year. </p><p class=\"\">Ball Corp  is down more than -7% after reporting Q4 net sales of $2.88 billion, weaker than the consensus of $2.91 billion.</p><p class=\"\">Illumina  is down more than -7%, and PVH Corp  is down more than -2% after China placed the companies on a blacklist of entities, citing infringement of market transaction principles and damaging actions against Chinese companies. </p><p class=\"\">Archer-Daniels-Midland  is down more than -5% after forecasting 2025 adjusted EPS of $4.00 to $4.75, the midpoint below the consensus of $4.66. </p><p class=\"\">PepsiCo  is down more than -5% after reporting Q4 net revenue of $27.78 billion, below the consensus of $28.05 billion.</p><p class=\"\">Centene  is down more than -3% after reporting Q4 its Q4 profit was aided by a settlement related to payments insured through Obamacare plans. The settlement boosted 2024 earnings by 29 cents a share, accounting for almost all of its 33 cents-a-share outperformance for 2024 adjusted earnings. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Earnings Reports (2/4/2025)</strong></p><p class=\"\">Advanced Micro Devices Inc (AMD), Alphabet Inc (GOOGL), Amcor PLC (AMCR), AMETEK Inc (AME), Amgen Inc (AMGN), Apollo Global Management Inc (APO), Archer-Daniels-Midland Co (ADM), Atmos Energy Corp (ATO), Ball Corp (BALL), Centene Corp (CNC), Chipotle Mexican Grill Inc (CMG), Cummins Inc (CMI), Electronic Arts Inc (EA), Enphase Energy Inc (ENPH), Essex Property Trust Inc (ESS), Estee Lauder Cos Inc/The (EL), Fair Isaac Corp (FICO), FMC Corp (FMC), Fox Corp (FOXA), Gartner Inc (IT), Hubbell Inc (HUBB), IDEX Corp (IEX), Jack Henry &amp; Associates Inc (JKHY), Jacobs Solutions Inc (J), Juniper Networks Inc (JNPR), KKR &amp; Co Inc (KKR), Marathon Petroleum Corp (MPC), Match Group Inc (MTCH), Merck &amp; Co Inc (MRK), Mondelez International Inc (MDLZ), Omnicom Group Inc (OMC), PayPal Holdings Inc (PYPL), Pentair PLC (PNR), PepsiCo Inc (PEP), Pfizer Inc (PFE), Prudential Financial Inc (PRU), Regeneron Pharmaceuticals Inc (REGN), Simon Property Group Inc (SPG), TransDigm Group Inc (TDG), Veralto Corp (VLTO), WEC Energy Group Inc (WEC), Willis Towers Watson PLC (WTW), Xylem Inc/NY (XYL).</p><p class=\"\"><em>On the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policyhere. </em></p><p class=\"\"> More news from Barchart </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Stock Index Futures Muted Ahead of U.S. JOLTs Report and Fed Speak, Alphabet Earnings on Tap</li><li class=\"listItem-bmN0_SHH\">Stocks Set to Open Sharply Lower as Trump Imposes Tariffs, U.S. Jobs Data and Earnings in Focus</li><li class=\"listItem-bmN0_SHH\">Earnings, Job and Other Key Things to Watch this Week</li><li class=\"listItem-bmN0_SHH\">Stock Index Futures Climb as Apple and Intel Provide a Boost, U.S. PCE Inflation Data in Focus</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/barchart:5ab731aac094b:0-stocks-climb-as-chip-stocks-rally/",
            "pub_date": "2025-02-05 00:24:15",
            "source": "Barchart",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE4qx2kX:0",
            "title": "Intesa Sanpaolo reports record Net Income of €8.7 billion in 2024, raises 2025 Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MILAN, Feb.  04, 2025  (GLOBE NEWSWIRE) — Intesa Sanpaolo has posted its best-ever financial results, closing 2024 with a net income of €8.7 billion, up 12% compared to 2023. This outstanding performance enables the bank to distribute €6.1 billion in cash dividends to shareholders for 2024. Additionally, subject to shareholder approval, a new €2 billion share buyback will be launched in June.</p><p class=\"\">With strong profitability and a robust capital position, Intesa Sanpaolo has raised its net income guidance for 2025 to well above €9 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Strong revenue growth and cost efficiency</strong></p><p class=\"\">Intesa Sanpaolo recorded significant growth in commissions, up 9% compared to 2023, with acceleration in Q4. Insurance income reached an all-time high, increasing by 4% year-over-year.</p><p class=\"\">Customer financial assets expanded by €77 billion, reaching around €1.4 trillion, supported by €5.1 billion in net inflows into Assets under Management (AuM) in Q4.</p><p class=\"\">Despite heavy investments in technology, cost discipline remains a priority. The bank achieved a record-low cost/income ratio of 42.7%, one of the best in Europe.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Technology investments and digital transformation</strong></p><p class=\"\">Technology remains at the core of Intesa Sanpaolo’s strategy. The bank has invested €4.2 billion in digital transformation, hiring over 2,300 IT specialists and migrating 62% of its applications to the cloud.</p><p class=\"\">Isybank, the bank’s digital-only platform, saw a surge in new customers in Q4, surpassing a total of 500,000 new sign-ups. This brought the total isybank customer base close to 900,000, reinforcing its position as a key digital player.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Commitment to Social Impact</strong></p><p class=\"\">Intesa Sanpaolo continues to lead in social impact initiatives, having deployed around €340 million in 2024 alone to combat poverty and reduce inequalities, supported by a dedicated team of 1,000 professionals.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Outlook for 2025 and beyond</strong></p><p class=\"\">The bank expects net income to be well above €9 billion in 2025, maintaining strong and sustainable profitability. Plans include returning over €6 billion in cash dividends, with additional distributions to be determined at year-end.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CEO Carlo Messina’s remarks</strong></p><p class=\"\">Carlo Messina, CEO of Intesa Sanpaolo, remarked on the results:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">“We are over-delivering on our commitments as we enter the final year of our Business Plan. We just delivered our best-ever net income, at €8.7 billion. This rises to €9 billion when excluding non-recurring items and the €900 million in gross income managerial actions taken to strengthen future profitability.”</li><li class=\"listItem-bmN0_SHH\">“This excellent performance allows us to reward shareholders with €6.1 billion in cash dividends for 2024. Our strong profitability and rock-solid capital position also mean that – subject to shareholders’ approval – in June we will launch a new €2 billion share buyback.”</li><li class=\"listItem-bmN0_SHH\">“Our 2024 results are marked by our best-ever Insurance income and strong growth in commissions. Costs remained stable, asset quality was top-tier, and customer financial assets increased by €77 billion. We leveraged Q4 profitability to reinforce our buffers and sustain future results, while increasing our net income guidance for 2025 to well above €9 billion.”</li><li class=\"listItem-bmN0_SHH\">“We continue to invest in technology, with €4.2 billion already deployed, more than 2,300 IT specialists hired, and over 60% of applications already cloud-based. Isybank now has over 500,000 new clients, with a strong acceleration in Q4. This brings the total Isybank customer base to nearly 900,000, giving us significant scale.”</li><li class=\"listItem-bmN0_SHH\">“Our tech investments are also enabling a generational shift in our workforce. In three years, we will see 9,000 exits, allowing us to attract new talent and enhance efficiency. We are generating significant synergies internally, with no need for acquisitions, and avoiding related execution risks.”</li><li class=\"listItem-bmN0_SHH\">“Looking ahead, we expect net income in 2025 to be well above €9 billion—a level that is sustainable in the coming years. We will return more than €6 billion in cash dividends and evaluate additional distributions at year-end.”</li><li class=\"listItem-bmN0_SHH\">“Our well-diversified business model, centered on Wealth Management and Protection, will perform under any interest rate scenario. Strong and sustainable performance allows us to reward shareholders while maintaining a rock-solid capital base and contributing to social impact initiatives.”</li></ul><p class=\"\">Click here for more information on Intesa Sanpaolo’s financial results and strategic outlook.</p><p class=\"\">Contact: international.media@intesasanpaolo.com</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/771c288b-145b-446b-a4ac-87dafc1baee1</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE4qx2kX:0-intesa-sanpaolo-reports-record-net-income-of-8-7-billion-in-2024-raises-2025-guidance/",
            "pub_date": "2025-02-05 00:24:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE2mk3JG:0",
            "title": "Digital Tails Group, LLC. Released New Type of AI Assistant.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New York, NY, Feb.  04, 2025  (GLOBE NEWSWIRE) — bowmo™, Inc. , a New York City–based company powered by AI and XR/VR technologies aiming to provide fully customizable SaaS Platforms to multiple industries (https://bowmo.com ) (“bowmo,” “the Company”) and its recent merger partner OWNverse/Digital Tails Group (“DTG”), are pleased to announce that Digital Tails Group has released a new AI Assistant. This new DTG AI Assistant is smarter and faster than competing AI assistants and will act as a person’s everyday ally. </p><p class=\"\">In the modern technological landscape, there is hardly anyone who hasn’t encountered an AI assistant when reaching out to customer support; it’s becoming commonplace these days. But not all assistants are created equal – each model comes with unique capabilities and levels of sophistication.</p><p class=\"\">In essence, all AI assistants have the same requirements. They should:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">understand you</strong> – using Natural Language Processing (NLP), they get what you’re saying, even if it’s nuanced</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">learn with you</strong> – thanks to machine learning, they get smarter over time, and adapt to your preferences and patterns</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">know you</strong> – they use context like past interactions or location (if allowed) to create tailored responses</li></ul><p class=\"\">known AI assistants can be:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Voice-activated – Think Siri or Alexa, ready to respond when you speak</li><li class=\"listItem-bmN0_SHH\">Task masters – Handling specific jobs, like organizing emails or setting up meetings</li><li class=\"listItem-bmN0_SHH\">Predictive – Anticipating what you need before you even ask</li></ul><p class=\"\">The DTG AI assistant, named Aurora, can help with online shopping, customer support and personalized search, but her intelligence is wide and versatile. She can be trained to support any business, to help automate its operations. </p><p class=\"\">Aleksey Shestakov, Chairman of the Board of OWNverse/Digital Tails and the Chief Technical Officer of bowmo, Inc. summarized, “Our company focuses on the point-to-point application of advanced technologies in the interests of real business, manufacturing, and electronic commerce. That is why we are developing solutions that increase the efficiency of business operations and create additional business value.”</p><p class=\"\">Michael R. Neece, Chief Product Officer of bowmo, Inc. added, “Offering the Digital Tails Group’s AI assistant, which constantly learns each user’s preferences and supports any business process, is a significant value addition we can now deliver to customers.”</p><p class=\"\">You can learn more about Aurora at: https://digital-tails.group/ai-assistant. Try it now at work or home to streamline your day-to-day operations and life.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About bowmo, Inc.</strong></p><p class=\"\">Bowmo Inc.,  is a New York City–based AI-powered software and services company that incorporates a novel set of technologies to build a platform that will deliver solutions for multiple industries. Bowmo's flagship product seamlessly integrates AI and extended reality (XR) technologies to revolutionize recruitment and human resource (HR) processes. </p><p class=\"\">Building upon our multi-vertical platform, bowmo is poised to introduce a suite of future products catering to the cybersecurity, retail, sports, media/entertainment, and real estate sectors. This expansion underscores bowmo's commitment to diversifying revenue streams and addressing diverse industry needs through advanced technological solutions.</p><p class=\"\">bowmo's platform harnesses AI, machine learning (ML), deep learning (DL), blockchain, and process orchestration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About OWNverse, LLC.</strong></p><p class=\"\">OWNverse is a virtual platform company that develops unique tools for creating targeted products and services for virtual spaces (“Metaverses”) by using the technology stack available through widely used Web2 platforms driven by AI. </p><p class=\"\">OWNverse allows for the integration of such tools to elevate the dimensionality of products and services, while offering such products and services within the spatially immersive 3D Internet—Web3. </p><p class=\"\">OWNverse aims to empower all users to become co-creators of the content. The main OWNverse ideology is to supply proven tools to users to provide real value for businesses and create virtual communities in numerous business sectors.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Digital Tails Group, LLC.</strong></p><p class=\"\">Digital Tails Group (“DTG,” the “Company”) is an IT company specializing in software development using 3D technology, extended reality (XR) and artificial intelligence (AI).</p><p class=\"\">The DTG expertise in advanced technologies ranges from virtual reality (VR) experiences to smart AI algorithms, enabling us to help our clients improve their competitive strength through the application of advanced UI and knowledge technologies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Additional Information and Where to Find It</strong></p><p class=\"\">Additional information is available on the Company’s website: https://www.bowmo.com. In addition, other information related to the Company is available at the SEC’s website at www.sec.gov, or by directing a request to: bowmo, Inc., 99 Wall Street, Suite 891, New York, NY 10005; or by phone at 212-398-0002.</p><p class=\"\">Cautionary Statement Regarding Forward-Looking Statements</p><p class=\"\">This release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by the use of the words \"may,\" \"will,\" \"should,\" \"plans,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimates,\" \"projects,\" \"intends,\" and similar expressions. Forward-looking statements involve risks and uncertainties that could cause results to differ materially from those projected or anticipated. These risks and uncertainties include, but are not limited to, BOMO's ability to successfully execute its expanded business strategy, including by entering into definitive agreements with suppliers, commercial partners and customers; general economic and business conditions, effects of continued geopolitical unrest and regional conflicts, competition, changes in technology and methods of marketing, delays in completing various software programs, changes in future customer order patterns, changes in product mix, continued success in technical advances and delivering technological innovations, regulatory requirements and the ability to meet them, government agency rules and changes, and various other factors beyond BOMO's control. Except as may be required by law, bowmo, Inc. undertakes no obligation, and does not intend, to update these forward-looking statements after the date of this release.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\">Michael E. Lakshin</p><p class=\"\">Chairman of the Board and President</p><p class=\"\">Michael.Lakshin@bowmo.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE2mk3JG:0-digital-tails-group-llc-released-new-type-of-ai-assistant/",
            "pub_date": "2025-02-05 00:25:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSKxqcKa:0",
            "title": "OFFPRICE Returns to Las Vegas Marketplace, Celebrating 60th Show",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LAS VEGAS, NV / ACCESS Newswire / February 4, 2025 / <strong class=\"root-Tkn6WL2y\">OFFPRICE Las Vegas,</strong> the global B2B marketplace for the retail fashion industry, returns to Las Vegas celebrating its 60th show over three decades, complete with a new and improved floorplan layout, additional experiences, elevated booth designs and more to celebrate the milestone.</p><p class=\"\">OFFPRICE is now a part of MMGNET Group (Informa Markets Fashion), the fashion industry's go-to B2B resource and event organizer. OFFPRICE Las Vegas offers an extensive variety of today's trends, leading brands and opportunistic buys across all product categories. In-season apparel, footwear, accessories and gifts will be on display from global vendors, across men's, women's and children's categories.</p><p class=\"\">Featuring a robust lineup of attending retailers, from boutiques, discount and non-profits to major chains, hotels and universities, OFFPRICE Las Vegas provides networking opportunities with leading wholesale vendors, showcasing sought-after products with high profit margins. Attending buyers will interact with hands-on, high-quality samples onsite before ordering. Immediate, in-stock and cash and carry products will also be available in-person.</p><p class=\"\">Exhibiting brands include the likes of <!-- -->Love Poem, SUPERLINE, EXIST, Popular 21, Nima Accessories, Wholesale Fashion Trends, Authentic Warehouse and more, showcasing excess and in-season goods. Over 20% of OFFPRICE Las Vegas's attending buyers are international, from across the U.S., Latin America, the Caribbean and beyond, all searching for high-quality value priced items from exhibitors.</p><p class=\"\">Jordan Rudow, Vice President, MAGIC and OFFPRICE, Informa Markets, states, \"For 30 years OFFPRICE Las Vegas has brought the retail and vendor community together over 60 shows to discover a diverse mix of products, below wholesale, to fuel growth in the fashion industry. We are so excited to dive deeper into the wholesale vendor side of the business to expand opportunities and add to OFFPRICE's goals of showcasing premier selections of goods to global audiences.\"</p><p class=\"\">To register to attend the Feb. 9-12 event at the Venetian Expo in Las Vegas, please visit www.offpriceshow.com.</p><p class=\"\">OFFPRICE Las Vegas provides complimentary shuttle transportation for easy access to the Venetian and from other shows at the Las Vegas Convention Center.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About OFFPRICE</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OFFPRICE</strong> is the global B2B off-price marketplace where retailers can find in-season, on-trend, brand name, and value and off-price merchandise for retail stores, e-commerce sites, or resale businesses. Showcasing thousands of quality products at 20-80% off wholesale cost, OFFPRICE plays host to a vast number of categories, including apparel, footwear and accessories for men, women and children. For more information, please visit: www.offpriceshow.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About MMGNET Group (Informa Markets Fashion)</strong></p><p class=\"\">MMGNET Group is home to a comprehensive portfolio of renowned, live B2B fashion events including MAGIC, PROJECT, COTERIE, SOURCING at MAGIC and OFFPRICE. Through its extensive global reach, decades of industry expertise, and world-class content programs, MMGNET Group is a go-to resource where fashion industry professionals source inspiration, connections and opportunities they need to build business, network, and responsibility steward fashion forward. MMGNET Group is a subsidiary of Informa Markets (LON:INF). To learn more about the MMGNET Group portfolio of brands, please visit www.mmgnetgroup.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\">MMGNET Group/ Informa Markets Fashion PR</p><p class=\"\">FashionPR@Informa.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Fashion</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSKxqcKa:0/",
            "pub_date": "2025-02-05 00:25:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1NY:0",
            "title": "Banknote printer De La Rue at 3-yr high on takeover offers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    ** Shares of UK's De La Rue PLC  up as much as 8.7% to a three-year high of 125p</p><p class=\"\">** Co receives preliminary approaches from parties other than British financier Edi Truell's consortium</p><p class=\"\">** Edi Truell consortium's conditional cash offer to be done through issuance of debt instrument and a share buyback at 125p/share</p><p class=\"\">** Truell is the founder of Disruptive Capital GP Limited and Pension SuperFund Capital entities, which are part of the said consortium</p><p class=\"\">** Stock up ~15% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1NY:0-banknote-printer-de-la-rue-at-3-yr-high-on-takeover-offers/",
            "pub_date": "2025-02-05 00:25:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309053:0",
            "title": "Correction: --Novartis on Lookout for Next-Generation Obesity Drug Candidates, The Wall Street Journal Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309053:0/",
            "pub_date": "2025-02-05 00:25:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309038:0",
            "title": "Toro's HammerHead Trenchless Acquires ProKASRO Services USA",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toro's  HammerHead Trenchless division said Tuesday it has acquired ProKASRO Services USA, a provider of robotic solutions and rehabilitation equipment for underground water and wastewater infrastructure repair. </p><p class=\"\">Financial details weren't disclosed. </p><p class=\"\">HammerHead said it will continue to market trenchless pipe rehabilitation and replacement products under the ProKASRO USA brand, while keeping operations in Colorado.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309038:0/",
            "pub_date": "2025-02-05 00:17:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309047:0",
            "title": "Paramount Resources Maintained at Outperform at BMO; Price Target Kept at C$40.00",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BMO Capital Markets on Tuesday reiterated its outperform rating on the shares of Paramount Resources  and its C$40.00 price target. </p><p class=\"\">\" We believe Paramount is a unique E&amp;P business with a number of non-producing/hard-to-value assets that have generally been ignored by investors (especially its long-duration holdings in Cavalier, Sinclair and its Horn River/Liard Basin gas prospects). With the closing of its recently announced Montney disposition to Ovintiv, the company will now shift gears and primarily focus on the development of its Duvernay properties and Sinclair. With high-growth inventory, no debt, and a strong management team, investors should be excited to see the next growth wedge unfold for the company,\" analyst Jeremy McCrea wrote.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309047:0/",
            "pub_date": "2025-02-05 00:17:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008371:0",
            "title": "Saia Is Maintained at Outperform by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:18 GMT) </strong>Saia Price Target Cut to $540.00/Share From $560.00 by Raymond James</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008371:0/",
            "pub_date": "2025-02-05 00:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0J9:0",
            "title": "Microsoft sued by software company Veeva over 'Viva' branding",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pharmaceutical software company Veeva Systems  has sued Microsoft  in California federal court, alleging Microsoft's Viva business software infringes its trademarks.</p><p class=\"\">Veeva told the courton Monday that Microsoft Viva, a suite of applications for employee communication and engagement, will cause consumer confusion with Veeva's software.</p><p class=\"\">Veeva asked the court to force the tech giant to stop using its Viva branding and requested an unspecified amount of monetary damages.</p><p class=\"\">Spokespeople for Microsoft did not immediately respond to a request for comment on Tuesday. A Veeva spokesperson said the company is confident in its case and looks forward to \"resolving the issue.\"</p><p class=\"\">Pleasanton, California-based Veeva specializes in cloud-based software for the pharmaceutical industry. Its products include software for managing customer relationships, content management and data analysis.</p><p class=\"\">The complaint said that Microsoft offers similar business management and collaboration software under the Viva name. Veeva said Microsoft's similarly named software will cause market confusion, and noted that news articles and transcripts of Microsoft earnings calls have referred to its software as \"Veeva.\"</p><p class=\"\">The case is Veeva Systems Inc v. Microsoft Corp, U.S. District Court for the Northern District of California, No. 3:25-cv-01110.</p><p class=\"\">For Veeva: Morgan Smith and Douglas Rettew of Finnegan Henderson Farabow Garrett &amp; Dunner</p><p class=\"\">For Microsoft: attorney information not yet available</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0J9:0-microsoft-sued-by-software-company-veeva-over-viva-branding/",
            "pub_date": "2025-02-05 00:18:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1MO:0",
            "title": "China ADRs recover despite tit-for-tat tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** U.S.-listed shares of Chinese companies rise </p><p class=\"\">** Most shares recover from dip in previous session after U.S. President Donald Trump suspends tariffs on Mexico and Canada, shares broadly unfazed by implementation of 10% tariffs on all Chinese imports </p><p class=\"\">** Beijing responds with tariffs on U.S. imports and targets several U.S. companies</p><p class=\"\">** U.S. trade adviser Peter Navarro says Trump to speak with China's Xi later on Tuesday </p><p class=\"\">** E-commerce firms Alibaba Group Holding , JD.com Inc  and PDD Holdings  rise 4.5%, 5.2% and 8.9%, respectively</p><p class=\"\">** Gaming stocks Bilibili Inc  jumps 7.8%, search engine giant Baidu Inc  gains 8.8% </p><p class=\"\">** EV firms jump, tracking gains in Hong Kong-listed EV stocks: Li Auto Inc  up 7.5%, Nio Inc  gains 4.4%</p><p class=\"\">** Xpeng Inc  jumps 8.8% after co says it delivered 30,350 smart EVs in January, representing a 268% increase year-on-year</p><p class=\"\">** China ETFs rise: IShares MSCI China ETF  gains 3.1% and on track for best day in nearly two months</p><p class=\"\">** China Large-Cap ETF  gains 3%, KraneShares CSI China Internet ETF  up 4.3% </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1MO:0-china-adrs-recover-despite-tit-for-tat-tariffs/",
            "pub_date": "2025-02-05 00:18:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0L1:0",
            "title": "GH Research slides on planned stock sale to fund depression treatments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    **  Shares of GH Research  down 20.5% to $14.30 on Tues as co seeks equity to fund development of its treatments for depression  </p><p class=\"\">    ** GHRS shares surged 70% to close at $17.99 on Mon after co said its depression therapy, GH001, met main goals of mid-stage study  </p><p class=\"\">    ** After the bell Mon,     Ireland-based biotech commenced $150 mln stock offering  </p><p class=\"\">    ** It plans to use net offering proceeds to invest in research, clinical and technical development of current and/or additional product candidates, according to the SEC filing  </p><p class=\"\">    ** Cantor, Stifel and RBC acting as jt bookrunners for the offering  </p><p class=\"\">    ** With ~52 mln shares outstanding, co has current market cap of roughly $760 mln  </p><p class=\"\">    ** Stock ended 2024 at $7  </p><p class=\"\">    ** All 5 analysts covering GHRS are bullish with median PT of $37, LSEG data shows  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0L1:0-gh-research-slides-on-planned-stock-sale-to-fund-depression-treatments/",
            "pub_date": "2025-02-05 00:18:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008378:0",
            "title": "Euro Covered Bonds Supply Likely to Decline in 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008378:0/",
            "pub_date": "2025-02-05 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008376:0",
            "title": "AstraZeneca Sales, Core EPS Seen Rising — Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Helena Smolak</p><p class=\"\">AstraZeneca is scheduled to report results for the fourth quarter on Thursday. Here is what you need to know.</p><p class=\"\">SALES FORECAST: The British pharmaceutical giant's total sales are expected to be $14.2 billion for the three months ended Dec. 31, up from $12.02 billion in the same quarter a year prior, according to a company-compiled consensus based on 19 analysts' estimates.</p><p class=\"\">CORE EARNINGS PER SHARE: Core earnings per share are expected to rise to $2.07 from $1.45 the year prior, according to the same consensus.</p><p class=\"\">AstraZeneca's stock is up 7.9% since the start of 2024.</p><p class=\"\">WHAT TO WATCH</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">PIPELINE &amp; OUTLOOK: Market watchers will closely monitor AstraZeneca's confidence in the potential of its experimental drug for advanced lung cancer datopotamab deruxtecan, Jefferies analysts said. Industry watchers also eye AstraZeneca's development strategy and differentiation of its obesity portfolio, Jefferies said. The company's 2025 outlook will be crucial as this year sees more than 10 key late-stage trials, UBS analysts said.</li><li class=\"listItem-bmN0_SHH\">CHINA: Investors' focus will lie on the impact of the continuing anti-corruption investigation into some of AstraZeneca's employees in China on its sales in the country, according to Jefferies. The company is under regulatory scrutiny in China as part of an anticorruption crackdown by authorities after its top executive in the region was detained and while other employees are subject to an investigation about illegal importation of cancer drugs and patient data collection.</li></ul><p class=\"\">Write to Helena Smolak at helena.smolak@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008376:0/",
            "pub_date": "2025-02-05 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0TN:0",
            "title": "Russian central bank blames sanctions, weak rouble, poor harvest for inflation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Western sanctions, a weaker rouble and a lower harvest were to blame for Russia's high inflation rate in December 2024 and January 2025, the Russian central bank said in a report published on Tuesday.</p><p class=\"\">Inflation, which reached 9.5% in 2024, has emerged as the biggest economic challenge for Russian authorities as the country approaches the fourth year of what it calls \"a special military operation\" in Ukraine.</p><p class=\"\">Prices, driven by rising costs of food and housing, increased by 1.14% from the start of the year to Jan. 27, with most analysts predicting that inflation will exceed the central bank's full-year forecast of 4.5%-5.0%. </p><p class=\"\">\"Significant contributions to the rise in prices are made by supply-side factors related to new sanctions restrictions, the indexation of regulated prices, tariffs and fees, and a decrease in harvest,\" the central bank said. </p><p class=\"\">\"In December, the pass-through of the earlier depreciation of the rouble into prices also intensified,\" it added. </p><p class=\"\">The regulator said that it was important to adhere to approved parameters of the 2025 state budget in order to control inflation. The parameters for the 2024 budget were adjusted to increase the deficit twice during the year.</p><p class=\"\">The regulator also said that maintaining high economic growth rates was no longer possible in an environment of scarce labour and production capacity while a further stimulus would push the economy into recession. </p><p class=\"\">\"This implies that there is actually no choice between continuing rapid economic growth accompanied by high inflation on one hand, and economic slowdown and disinflation on the other,\" the regulator said. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0TN:0-russian-central-bank-blames-sanctions-weak-rouble-poor-harvest-for-inflation/",
            "pub_date": "2025-02-05 00:19:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0TZ:0",
            "title": "Movistar to invest $500 mln in Venezuela to boost cell service",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Telecoms company Movistar will invest $500 million in Venezuela over two years, Movistar Venezuela president Jose Luis Rodriguez said in an interview with Venezuela's telecommunications regulator published on Tuesday. </p><p class=\"\">Movistar, a subsidiary of Spain's Telefonica, will make a $250 million investment in each of the next two years to expand 4G and 5G service, Rodriguez said. </p><p class=\"\">\"We have to strive to improve all our smart platforms, which we have been doing for some time now,\" the executive said. \"Technology is advancing much faster than we might assume and we have to be very up to speed.\"</p><p class=\"\">Movistar has 8.8 million users in Venezuela, according to official data, which represents approximately 42% of the country's mobile phone market. </p><p class=\"\">Many companies have held off investments amid Venezuela's economic collapse in recent years, but relaxed regulations and an informal dollarization beginning in 2019 have created room for greater investment. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0TZ:0-movistar-to-invest-500-mln-in-venezuela-to-boost-cell-service/",
            "pub_date": "2025-02-05 00:19:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250202001199:0",
            "title": "How the U.S.-Canada-Mexico Tariffs Will Work — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chao Deng</p><p class=\"\">The U.S. and China entered a new trade war on Tuesday, with tariffs of 10% going into effect on Chinese goods. Beijing struck back with 10%-15% levies that will take effect Feb. 10 on select American goods, including coal and liquefied natural gas, crude oil, agricultural machinery and pickup trucks. Beijing also said it was opening an antitrust probe into Google and tightening export controls for five key minerals without singling out any particular country.</p><p class=\"\">Mexico and Canada on Monday reached separate agreements with President Trump to pause tariffs on their exports to the U.S. for 30-days, staving off a larger trade war for the time being.</p><p class=\"\">Over the weekend, the Trump administration had said it would levy 25% import tariffs on goods from the two countries. But then Canada agreed to put 10,000 front-line personnel on its border with the U.S., while Mexico agreed to supply 10,000 Mexican soldiers on the Mexican border, as part of their efforts to appease Trump.</p><p class=\"\">How the trade disputes will play out isn't certain. But here are answers to a few fundamental questions about how tariffs work, and their immediate impact on American businesses and consumers:</p><p class=\"\">Who pays the tariffs?</p><p class=\"\">The firms importing the goods, many of which are American individuals and businesses, will pay for the tariffs.</p><p class=\"\">Who bears the ultimate burden of the tariffs however isn't so straightforward. An American importer can pass along the cost of tariffs to American businesses or consumers by raising its prices. Alternatively, a foreign exporter might ultimately shoulder the burden if it cuts prices to avoid losing sales.</p><p class=\"\">If the tariffs prompt U.S. companies to turn to other countries for imports, those levies can be avoided, of course. In those instances, however, Canadian, Mexican and Chinese workers might lose jobs. Under that scenario, Americans would also likely pay higher prices, with more goods coming from alternative suppliers that face higher costs. If production shifts to the U.S., Americans would likely pay higher prices as well, though some of that would likely go toward the wages and profits of other Americans.</p><p class=\"\">What sort of goods will be affected if tariffs are imposed?</p><p class=\"\">U.S. tariffs apply to all Chinese imports and come on top of levies that were previously applied to select Chinese goods. Consumer goods like Chinese electronics — and electronics from U.S. firms made in China — and toys are likely to get more costly.</p><p class=\"\">But the American crude oil and coal that China has announced tariffs on may not see a huge impact because China is far from U.S.'s largest customer for the commodities.</p><p class=\"\">If U.S. tariffs on Mexico and Canada go into effect, prices of many more items would rise for American consumers, including cars, gas and fresh vegetables.</p><p class=\"\">Since the U.S. buys billions of dollars of lumber from Canada, the cost of home construction might go up. The U.S. also relies to a significant degree on Canada to supply its frozen french fries. Mexican grocery goods from tequila, to avocados and tomatoes are also likely to get higher price tags, potentially affecting millions of American households.</p><p class=\"\">Which firms will feel the impact?</p><p class=\"\">During Trump's first term, American firms had an opportunity to apply for exemptions from tariffs. And many were granted. For instance, Apple won tariff exemptions for some of its China-made products.</p><p class=\"\">Whether there will be a process to apply for exemptions this time around is unclear. A senior administration official told reporters on Saturday that there will be no exemptions to the tariffs. Instead, the duties will be in place until the White House is satisfied that the trading partners have scrubbed out the illicit fentanyl moving into the U.S.</p><p class=\"\">How do these tariffs compare with those from Trump's first term?</p><p class=\"\">They look to be much bigger.</p><p class=\"\">The 10% additional tariffs on China apply to all of the country's exports to the U.S., which totaled around $401.4 billion in the first 11 months of 2024, according to Census Bureau data. Tariffs imposed by the U.S. in 2018 and 2019 — during Trump's first term — covered nearly two-third of all imports from China, or roughly $370 billion in annual goods.</p><p class=\"\">The hit from Trump's threatened, 25% tariffs on goods from Canada and Mexico will be significant, if those tariffs ultimately take effect. In January through November of 2024, the U.S. imported $466.6 billion worth of goods from Mexico and $377.2 billion worth of goods from Canada.</p><p class=\"\">During Trump's first term, his administration imposed tariffs on steel and aluminum from Canada and Mexico for about one year. Tariffs he announced on all imports from Mexico were averted after a new free-trade agreement was hashed out by the U.S., Mexico and Canada (USMCA).</p><p class=\"\">This round of action by Trump also targets the \"de minimis\" loophole which allows shipments valued under $800 to enter the U.S. duty-free. Use of the trade provision has ballooned in recent years, partly through the explosive growth of Chinese e-commerce merchants. The U.S. will suspend this loophole for Canada, because of concerns that packages from there aren't being properly inspected under the exemption.</p><p class=\"\">What should we expect moving forward?</p><p class=\"\">Negotiation, and possibly more twists and turns, judging from how this has played out so far.</p><p class=\"\">President Trump said Monday the 10% additional tariffs on China are just \"an opening salvo.\" On the campaign trail, he threatened tariffs as high as 60% on Chinese imports. Trump  is slated to talk with Chinese leader Xi Jinping Tuesday about a potential tariff pause, according to White House trade adviser Peter Navarro.</p><p class=\"\">The 30-day tariff reprieves for Mexico and Canada were announced after Mexican President Claudia Sheinbaum pledged national guard troops to help stop migration into the U.S. and Canadian Prime Minister Justin Trudeau said his country would also implement a border plan in coordination with the U.S. to stop the flow of fentanyl.</p><p class=\"\">Staving off tariffs permanently depends on how negotiations with the Trump administration go. Before the agreements, Canada's Trudeau said his country would retaliate with 25% tariffs on more than $105 billion of U.S. goods. Mexico's Sheinbaum had threatened tariffs and nontariff measures.</p><p class=\"\">Tit-for-tat tariffs by all three countries wouldn't only put U.S. imports but hundreds of billions worth of U.S. exports on the line. In January through November of 2024, the U.S. exported $322.2 billion worth of goods to Canada, $309.4 billion worth of goods to Mexico, and $131 billion to China.</p><p class=\"\">Write to Chao Deng at chao.deng@wsj.com</p><p class=\"\">This explanatory article may be updated periodically.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250202001199:0/",
            "pub_date": "2025-02-05 00:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309034:0",
            "title": "Mineralys Completes Enrollment in Mid-Stage Hypertension Trial",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mineralys Therapeutics  said Tuesday it has completed enrollment in the phase 2 trial of lorundrostat for the treatment of hypertension in subjects with chronic kidney disease and albuminuria. </p><p class=\"\">The clinical-stage biopharmaceutical company said it continues to expect topline data from the trial in Q2 of 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309034:0/",
            "pub_date": "2025-02-05 00:20:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1F7rLH:0",
            "title": "Trading Meets Luxury: Bybit Kazakhstan Brings Unmatched Prizes to Local Crypto Traders",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1F7rLH-5c4aa6e8b7b042328b7bcf907a290b9b-resized.webp\" type=\"images/webp\"/><img alt=\"Bybit Fintech FZE\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1F7rLH-5c4aa6e8b7b042328b7bcf907a290b9b-resized.jpeg\" style=\"background-color:#705f46\"/></picture></div></figure></span></p><p class=\"\">ALMATY, Kazakhstan, Feb.  04, 2025  (GLOBE NEWSWIRE) — Bybit, the world’s second-largest cryptocurrency exchange by trading volume, is redefining the way users join the crypto trading journey. In a new event from now until Feb. 28, 2025, Bybit.kz is offering <!-- -->Tesla Model 3, Rolex watches, popular cryptocurrencies, and <strong class=\"root-Tkn6WL2y\">Apple gadgets</strong>.</p><p class=\"\">The two-part event allows traders to start small for a chance to win big:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">New users may join the <strong class=\"root-Tkn6WL2y\">Sign Up, Deposit, and Win</strong> event with $100 or more in deposit. Successful participants who register on <strong class=\"root-Tkn6WL2y\">Bybit.kz</strong>, sign up for the event, and deposit at least $100, will automatically enter a Lucky Draw. Additionally, extra perks await for users who hit specific deposit milestones.</li><li class=\"listItem-bmN0_SHH\">All eligible users may take part in the <strong class=\"root-Tkn6WL2y\">Trade Your Way to Grand Prizes</strong> event, vying for top-tier prizes by meeting trading goals during the event period. Those who achieve the required trading volumes will be eligible for rewards like the <strong class=\"root-Tkn6WL2y\">Tesla Model 3</strong>, <strong class=\"root-Tkn6WL2y\">Rolex watches</strong>, and trending cryptocurrencies. The higher the stake, the better their chances of winning.</li></ul><p class=\"\">\"We're excited to offer both the crypto community in Kazakhstan an opportunity to get onboard the Bybit trading journey,\" said Joan Han, Sales and Marketing Director at Bybit. \"This event is not only about rewards, but about bringing together a vibrant community of traders eager to make the most of their experience.\"</p><p class=\"\">Since obtaining the license to operate in Kazakhstan in Sep. 2024, Bybit Kazakhstan has been fully committed to supporting Kazakhstan’s growing crypto and blockchain ecosystem. Bybit Kazakhstan’s launch marks a major step in bringing cutting-edge crypto solutions to the region, with the goal of empowering local traders, entrepreneurs, and institutions. As a global leader in digital assets, Bybit aims to foster a secure, transparent, and user-friendly trading environment that aligns with the regulatory framework and the values of the Kazakh market.</p><p class=\"\">Registration is required. For the full terms and conditions of the event, users may visit: Grand Start With Bybit Kazakhstan. </p><p class=\"\">#Bybit / #TheCryptoArk</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Bybit</strong></p><p class=\"\">Bybit is the world’s second-largest cryptocurrency exchange by trading volume, serving a global community of over 60 million users. Founded in 2018, Bybit is redefining openness in the decentralized world by creating a simpler, open, and equal ecosystem for everyone. With a strong focus on Web3, Bybit partners strategically with leading blockchain protocols to provide robust infrastructure and drive on-chain innovation. Renowned for its secure custody, diverse marketplaces, intuitive user experience, and advanced blockchain tools, Bybit bridges the gap between TradFi and DeFi, empowering builders, creators, and enthusiasts to unlock the full potential of Web3. Discover the future of decentralized finance at Bybit.com.</p><p class=\"\">For more details about Bybit, please visit Bybit Press</p><p class=\"\">For media inquiries, please contact: media@bybit.com </p><p class=\"\">For updates, please follow: Bybit's Communities and Social Media</p><p class=\"\">Discord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Head of PR</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tony Au</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bybit</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">tony.au@bybit.com</strong></p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/368796c7-1da2-4f89-8beb-45a0e3edce7c</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bybit Fintech FZE</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Bybit Fintech FZE</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1F7rLH:0-trading-meets-luxury-bybit-kazakhstan-brings-unmatched-prizes-to-local-crypto-traders/",
            "pub_date": "2025-02-05 00:20:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1MW:0",
            "title": "Centene falls on higher Q4 Medicaid costs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of health insurer Centene  fall 3.50% to $62.55 </p><p class=\"\">** Co reports Q4 medical loss ratio - the percentage of premiums spent on medical care - of 93.4% in its Medicaid business </p><p class=\"\">** Costs for health insurers which offer Medicaid plans for lower income individuals have been elevated due to an influx of sicker patients after the end of pandemic era policy</p><p class=\"\">** \"We think the stock reaction reflects the fact that the core Medicaid medical loss ratio came in worse than expected in Q4\"- Stephens analyst Scott Fidel </p><p class=\"\">** Co however beats Q4 adj.profit estimates helped by a settlement related to its plans it offers through the Affordable Care Act</p><p class=\"\">** Reports Q4 adj.profit of 80 cents per share, beating estimates of 49 cents per share as per data compiled by LSEG </p><p class=\"\">** Co leaves its forecast of adj. 2025 profit of greater than $7.25 per share unchanged</p><p class=\"\">** CNC fell 18.4% in 2024 </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1MW:0-centene-falls-on-higher-q4-medicaid-costs/",
            "pub_date": "2025-02-05 00:13:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0SA:0",
            "title": "COMMENT-RBA, tariff risks still plague AUD/USD despite bullish techs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    AUD/USD rallied above the 21-day moving average and struck a 2-session high Tuesday but the pair's upside may be limited due to threats from RBA rate cuts and ongoing U.S.-China trade tensions.</p><p class=\"\">Australia price increases cooled according to Q4 CPI data which helped send interest rates broadly lower as investors pulled forward expectations for rate cuts to begin with the February 18 decision priced at 82% probability for a 25bps cut.</p><p class=\"\">Trade tensions escalated as China retaliated on the U.S. by imposing tariffs of 15% and 10% on selected imports, but U.S. President Donald Trump and Chinese President Xi Jinping are expected to hold a call, which could defuse the situation. </p><p class=\"\">Should an agreement be reached, riskier assets and AUD/USD could rally sharply.</p><p class=\"\">An AUD/USD rally would validate technical signals highlighting upside risks.</p><p class=\"\">Daily and monthly RSIs are rising after they diverged on the 58-month low struck Monday.</p><p class=\"\">A monthly bull hammer has formed and two consecutive daily bull hammers have been put in place.</p><p class=\"\">The monthly bull hammer formed after the 76.4% Fibo of the 0.5510-0.8007 rally was pierced. That Fibo is frequently a retracement level where existing trends reverse.</p><p class=\"\">AUD/USD bulls may be rewarded handsomely if trade tensions ease and the RBA leans less dovish than rate markets expect.</p><p class=\"\">For more click on </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:672.6744186046511px;aspect-ratio:1.121124031007752\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0SA-b78413e548cc28ea40c3eba5afc647e5-resized.webp\" type=\"images/webp\"/><img alt=\"audusd\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0SA-b78413e548cc28ea40c3eba5afc647e5-resized.jpeg\" style=\"background-color:#e3e3e3\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">audusd</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0SA:0-comment-rba-tariff-risks-still-plague-aud-usd-despite-bullish-techs/",
            "pub_date": "2025-02-05 00:13:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0KE:0",
            "title": "Aon: D&O price declines decelerate slightly sequentially to 10.6% in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Aon’s latest US D&amp;O pricing index shows the average price per million decreased by 10.6 percent year on year in Q4, which was a slight sequential deceleration from the 11.1 percent drop in the third quarter of 2024.</p><p class=\"\">The pricing index decreased to 1.26 from 1.41 in the prior-year quarter.</p><p class=\"\">The decrease in Q4 2024 marked the 11th consecutive quarterly year-on-year price decrease, following a period of 17 quarterly pricing increases over the prior four years.</p><p class=\"\">However, Aon believes a better comparison is to look at only those programs that renewed in both the fourth quarters of 2024 and 2023. On that basis, pricing decreased 4.3 percent.</p><p class=\"\">Primary policy pricing down 3.5%</p><p class=\"\">The broker also said that looking at only primary policies in the quarter that renewed with the same limit and deductible as the prior year eliminates some “noise” and focuses only on those policies that renewed on a “like-for-like” basis. </p><p class=\"\">The overall price change for primary policies renewing with the same limit and deductible in the fourth quarter was down 3.5 percent. The average price decrease was 8 percent, while the average price increase was 10 percent. </p><p class=\"\">In the fourth quarter 60 percent of primary policies received a price decrease, 29 percent of policies renewed “flat” and 11 percent of companies received a price increase. </p><p class=\"\">Aon also noted that 95 percent of primary policies renewed with the same limit in Q4 2024, and 91 percent of policies renewed with the same deductible. </p><p class=\"\">Historically, the percentage of clients renewing with the same limit was in the mid- to high 90s, and the percentage of clients renewing with the same deductible was in the low to mid-90s.</p><p class=\"\">“Concurrently with the primary layer rate increases that started in first-quarter 2018, the percentage of clients renewing with both the same limit and deductible had been dropping steadily,” Aon said.</p><p class=\"\">“After bottoming out in third-quarter 2020, that percentage has returned to more historical levels. For the fourth quarter of 2024, 88 percent of clients renewed with the same limit and deductible as the prior-year quarter,” it continued.</p><p class=\"\">Despite movements in limit and deductible levels, 97 percent of primary policies renewed with the same carrier in Q4 2024.</p><p class=\"\">On average, primary policies that renewed with the same limit, deductible and carrier experienced a 3.8 percent premium decrease in Q4.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0KE:0-aon-d-o-price-declines-decelerate-slightly-sequentially-to-10-6-in-q4/",
            "pub_date": "2025-02-05 00:14:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008357:0",
            "title": "Palantir Shares Surge to All-Time High as Growth, Outlook Upstages Competitors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">Shares of Palantir Technologies hit an all-time high after the company's earnings blew past Wall Street's expectations and the company showed it's on track for stronger growth than some of its competitors.</p><p class=\"\">The stock climbed 25% to $104.98 after touching a record high of $106.91 on Tuesday morning, making it the best performer on the S&amp;P 500 and Nasdaq 100. The shares are on pace for their largest percentage increase in a year, and the stock has seen an almost five-fold increase in price in the last 52 weeks.</p><p class=\"\">Palantir's earnings showed no signs of growth deceleration heading into 2025, outshining Microsoft and ServiceNow's forecasts. The artificial intelligence company expects revenue to expand roughly 36% in the first quarter, on par with growth in the fourth quarter.</p><p class=\"\">Competitors, by contrast, posted mixed results and saw their stock prices fall after reporting results last week. Microsoft's earnings beat analysts' expectations, but declining growth in its Azure cloud infrastructure unit gave investors pause. ServiceNow forecast slightly slower revenue growth in its first quarter compared with a 21% rise in the fourth quarter.</p><p class=\"\">Palantir's U.S. revenue was one of its best performing metrics with a 52% increase, and the company expects the same level of growth this year. Business in the U.S. has nearly five times the number of commercial customers compared with three years ago and is still growing, Chief Revenue and Legal Officer Ryan Taylor said. Palantir also signaled that any boost from the Trump administration's Department of Government Efficiency wasn't included in its 2025 guidance, UBS analysts led by Karl Keirstead said in a note.</p><p class=\"\">Palantir's pricing structure may help insulate it from any AI price deflation from falling model costs related to DeepSeek, the UBS analysts said.</p><p class=\"\">The company said it has been ready for the affect that a cost-efficient AI product like DeepSeek would have on the market. For the past two years, Palantir has argued that open- and closed-source AI models are becoming more similar and performance will eventually converge, Chief Technology Officer Shyam Sankar said.</p><p class=\"\">\"With the release of DeepSeek R1, that has gone from a contrarian position to consensus,\" Sankar said.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008357:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}