{
    "data": [
        {
            "id": "smallcaps:91140123d094b:0",
            "title": "Wellnex Life expands global reach with UK market entry and new product approval",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Wellnex Life  has achieved another breakthrough in its expansion plans with a new market authorisation (MA) for its liquid paracetamol plus caffeine soft gel. The MA comes after Wellnex made a successful submission to Australia’s Therapeutic Goods Administration for the latest addition to its product range. The company had previously been granted MAs for liquid paracetamol, liquid paracetamol plus ibuprofen and liquid mini-ibuprofen. International interest Managing director Zack Bozinovski said the approval would further drive revenue opportunities for Wellnex Life, with its existing MAs being utilised by domestic and international companies such as Chemist Warehouse and Haleon. The company views the four MAs as a validation of its philosophy of being either ‘first’ or ‘fast’ to market with innovative consumer health products. “The approval of liquid paracetamol plus caffeine soft gel market authorisation is a great testament to the company and its internal capabilities,” Mr Bozinovski said. “This unique product will provide opportunities not only for use in the company’s own brands but also to licence it to third parties.” UK market order Wellnex Life recently continued its global expansion with the delivery of its TGA-registered paracetamol soft gel liquid analgesic to Haleon and the UK market, building on the product’s successful Australian market launch in FY23. The company signed a supply agreement in March 2022 for the soft gel paracetamol to be retailed under Haleon’s pain relief brand in Australia and New Zealand. Wellnex Life also continues to progress its proposed dual listing on the London Stock Exchange, with clear advancement of work streams required to commence the marketing campaign in the UK. Leading UK-based broker SP Angel has been appointed as joint broker to the UK raise, along with Orana, which is being supported by Australian-based Barclay Pearce Capital. Pain Away acquisition On the local front, Wellnex Life has recently acquired leading Australian topical pain relief brand Pain Away. The company believes the acquisition will both complement and accelerate the potential growth of the company’s business operations. “This transformational acquisition gives added impetus to Wellnex Life’s financial growth and scale and reinforces its place as a major and respected participant in the growing healthcare market, both in Australia and overseas,” Mr Bozinovski said.</p></span></div>",
            "link": "https://www.tradingview.com/news/smallcaps:91140123d094b:0-wellnex-life-expands-global-reach-with-uk-market-entry-and-new-product-approval/",
            "pub_date": "2025-02-04 11:06:36",
            "source": "Small Caps",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463116:0",
            "title": "Keppel Infrastructure Trust Reports 29% Drop in H2 2024 Attributable Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keppel Infrastructure Trust's  profit attributable to unitholders declined 29% to SG$52.2 million in the second half of 2024 from SG$73.5 million a year earlier, a filing with the Singapore Exchange said on Tuesday. </p><p class=\"\">Earnings per unit declined to SG$0.0088 from SG$0.0131 a year ago. </p><p class=\"\">Revenue was up 25% year over year to SG$1.21 billion from SG$972.3 billion in the year-ago period. </p><p class=\"\">Assets under management grew by 22% to SG$9.0 billion as at Dec. 31, 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463116:0/",
            "pub_date": "2025-02-04 11:07:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463123:0",
            "title": "Widgie Nickel Expands Western Australia Gold Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Widgie Nickel  found 3.1 grams per tonne grade of gold from a recent drilling at the Butchers Creek project in Western Australia, according to a Tuesday filing with the Australian bourse. </p><p class=\"\">The findings suggest further upside for the project, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463123:0/",
            "pub_date": "2025-02-04 11:08:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV06L:0",
            "title": "Australia's Perenti gains on underground mining contract in US",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Perenti  rises 2.5% to A$1.4100, highest since Jan. 15</p><p class=\"\">** Diversified mining services co says its underground mining business signed A$120 mln ($74.5 mln) contract with U.S.-based Nevada Gold Mines, a joint venture between Barrick Gold  and Newmont Corporation  </p><p class=\"\">** PRN's mining business will undertake development of Nevada Gold Mines at its Goldrush Project</p><p class=\"\">** Stock gains 0.9% YTD</p><p class=\"\">($1 = A$1.6106)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV06L:0-australia-s-perenti-gains-on-underground-mining-contract-in-us/",
            "pub_date": "2025-02-04 11:08:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV06I:0",
            "title": "New Zealand's Bremworth soars on settlement of insurance claims",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Bremworth  rise 14.6% to NZ$0.55, their highest since Feb. 23, 2024</p><p class=\"\">** Rug &amp; carpet co reaches final settlement with insurers for an amount of NZ$104.2 mln ($58.52 mln) in relation to claims made for loss to business, others caused by Cyclone Gabrielle</p><p class=\"\">** Stock posts its biggest intraday pct gain since Aug. 29</p><p class=\"\">** Stock up 41% this year, including day's move</p><p class=\"\">($1 = 1.7806 New Zealand dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV06I:0-new-zealand-s-bremworth-soars-on-settlement-of-insurance-claims/",
            "pub_date": "2025-02-04 11:03:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV02K:0",
            "title": "South Korea wants to rebuild aviation safety system after crash, fire incidents",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    South Korea aims to rebuild its aviation safety system from scratch, the transport ministry said on Tuesday, launching a new committee to improve air travel in the country that suffered two major aviation incidents a month apart.</p><p class=\"\">\"In order to restore trust in our country's aviation safety system, the government will make a determined effort to rebuild the aviation safety system from the ground up,\" Deputy Minister of Land, Infrastructure and Transport Baek Won-kuk will tell the committee, the ministry statement said.  </p><p class=\"\">The government must address aviation safety as a top priority, he added.</p><p class=\"\">In the deadliest air disaster ever on South Korean soil, a plane belonging to budget airline Jeju Air  crashed at the country's Muan airport on Dec. 29, killing all but two of the 181 passengers and crew members on board.</p><p class=\"\">Duck remains were found in both engines of the plane, a preliminary investigation report said, indicating bird strikes occurred before the crash. Air accidents are nearly always caused by a combination of factors, according to experts.</p><p class=\"\">Last week, an Air Busan  plane was engulfed in flames at Busan's international airport as the low-cost carrier's jet prepared to depart, with all on board evacuated safely.</p><p class=\"\">The fire was first detected by a flight attendant in an overhead luggage bin in the rear of the plane, Air Busan has said.</p><p class=\"\">Investigations into the causes of both incidents are ongoing. </p><p class=\"\">The 10-week committee will include private sector experts and will look at issues including maintenance and aircraft utilisation rates at budget airlines, and airport construction and operation. </p><p class=\"\">In response to the Jeju Air crash, which saw the plane belly land but then plough into a concrete embankment supporting navigation equipment past the end of Muan's runway, authorities already said they would amend similar structures at seven airports around the country. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV02K:0-south-korea-wants-to-rebuild-aviation-safety-system-after-crash-fire-incidents/",
            "pub_date": "2025-02-04 11:03:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012030_20250203012031:0",
            "title": "Hang Seng Tech Index Extends Gains, Last Up 5.1%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012030_20250203012031:0/",
            "pub_date": "2025-02-04 11:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012030_20250203012030:0",
            "title": "Hang Seng Index Extends Gains, Last Up 3.0%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">- -</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012030_20250203012030:0/",
            "pub_date": "2025-02-04 11:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463122:0",
            "title": "Market Chatter: LG Uplus' U+2+ Membership Program Surpasses 8 Million Users",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">South Korean mobile network operator LG Uplus'  U+2+ membership program surpassed 8 million users in nine months since its launch in April 2024, Pulse News reported Monday. </p><p class=\"\">The service offers monthly discount coupons via the U+ Membership app, with 122 partner companies providing an average of 45 benefits per month. Total discounts issued reached 86.8 billion won, with subscribers downloading an average of five coupons each month, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463122:0/",
            "pub_date": "2025-02-04 11:04:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012019_20250203012034:0",
            "title": "Pennant: Texas Facilities Acquisition Subject to Long-Term, Triple Net Lease >PNTG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012019_20250203012034:0/",
            "pub_date": "2025-02-04 11:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012019_20250203012033:0",
            "title": "Pennant: Idaho Acquisition Subject to Triple Net Lease With Option to Purchase >PNTG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012019_20250203012033:0/",
            "pub_date": "2025-02-04 11:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012019_20250203012035:0",
            "title": "Pennant: Deals Expand Pennant's Operations by 188 Units of Assisted Living, Memory Care Services >PNTG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012019_20250203012035:0/",
            "pub_date": "2025-02-04 11:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012019_20250203012032:0",
            "title": "Pennant Acquired Three Premier Senior Living Facilities in Idaho, Texas Effective Feb. 1 >PNTG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012019_20250203012032:0/",
            "pub_date": "2025-02-04 11:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV02X:0",
            "title": "Corn rises for second session as Mexico, Canada tariffs on hold",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump pauses tariffs on Mexico and Canada, but not China</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">EU keeps 2024/25 soft wheat crop estimate at 12-year low</li></ul></span></div><span><p class=\"\">    Chicago corn futures gained more ground on Tuesday, as U.S. President Donald Trump paused his plans to impose tariffs on Mexican and Canadian goods. </p><p class=\"\">Soybeans and wheat slid after closing higher on Monday.</p><p class=\"\">While Mexico is the biggest importer of U.S. corn, China is the leading market for U.S. soybeans. Mexico, Canada and China import several other agricultural goods from the United States.</p><p class=\"\">\"There is some relief for agricultural markets with suspension of U.S. tariffs on Canada and Mexico,\" said one Sydney-based grains trader.</p><p class=\"\">        The most active corn contract on the Chicago Board of Trade (CBOT)  was up 0.3% at $4.90-1/4 a bushel, as of 0253 GMT, building on gains of more than 1% from the previous session.</p><p class=\"\">Soybeans  lost 0.4% to $10.53-3/4 a bushel and wheat  fell 0.4% to $5.64-1/2 a bushel.</p><p class=\"\">Trump suspended his threat of steep tariffs on Mexico and Canada on Monday, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighbouring countries.</p><p class=\"\">U.S. tariffs on China are still due to take effect within hours.</p><p class=\"\">Agricultural futures had tumbled early on Monday after Trump over the weekend ordered 25% tariffs on imports from Canada and Mexico and 10% tariffs on imports from China, triggering fears of a broader trade war that could impact U.S. agricultural commodities.</p><p class=\"\">The European Commission on Monday kept unchanged its forecast for usable production of common wheat, or soft wheat, in the European Union in 2024/25 at 111.9 million metric tons, the lowest level in 12 years.</p><p class=\"\">In supply-and-demand data, the Commission also maintained its forecast for the EU's 2024/25 soft wheat exports at 25 million tons, unchanged from its previous update in December.</p><p class=\"\">Commodity funds were net buyers of CBOT corn, wheat, soybean, soymeal and soyoil futures contracts on Monday, traders said. (COMFUND/CBT)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV02X:0-corn-rises-for-second-session-as-mexico-canada-tariffs-on-hold/",
            "pub_date": "2025-02-04 11:05:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463118:0",
            "title": "Nufarm Expects AU$100 Million in Omega-3 Canola Revenue in Fiscal Year 2025, Shares Rise 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nufarm  said it expects to achieve AU$100 million in its omega-3 canola product in the fiscal year ending June 30, subject to market pricing, according to a Tuesday Australian bourse filing. </p><p class=\"\">It said its plans to plant carinata in South America for its 2025 crop are well advanced and its cost-saving and inventory reduction measures, announced earlier, are on track. </p><p class=\"\">The crop protection and seed technology firm plans to conduct up-sized commercial trials in Australia for carinata plants this year. </p><p class=\"\">It expects its net working capital in the first half of fiscal 2025 to be \"marginally higher\" than the prior year, due to additional working capital for its omega-3 platform and movements in currency. </p><p class=\"\">It also identified AU$50 million of annualized cost savings. </p><p class=\"\">Its shares rose 4% in recent trading on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463118:0/",
            "pub_date": "2025-02-04 11:05:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463119:0",
            "title": "China's Transport Services Exports Rises 47% in Q3 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's transport services exports climbed 47% in the third quarter of 2024, according to a Monday news release from the World Trade Organization. </p><p class=\"\">The country's transport exports rose 50% in Q4 2024, reflecting a surge in shipments.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463119:0/",
            "pub_date": "2025-02-04 11:05:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV02J:0",
            "title": "COMMENT-USD/JPY ranges lower, Trump a risk but more downside?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">USD/JPY has recently ratcheted lower despite Trump tariff threats, falling on perceived haven flows and Bank of Japan rate hike expectations. While it remains in a 153.72-155.90 range for now (the Jan 27 low and Feb 3 high), the risk may be for more downside.</p><p class=\"\">USD/JPY looks to be tracking the top of its daily Ichimoku cloud higher. Having fallen into this ascending cloud over the past few sessions, the pair has mostly traded above it in a 154.75-155.40 range on Tuesday. The cloud is between 153.37-154.82 Tuesday.</p><p class=\"\">U.S. President Donald Trump's tariff threats have so far proven to be more of a favoured negotiating tool to get what he wants with the rest of the world . Granted, large tariffs remain a distinct possibility and will likely continue to rattle markets but, should they prove to be less harsh than expected, the BOJ's stance may trump such concerns.</p><p class=\"\">The BOJ will clearly remain hawkish and more frequent rate hikes may be in the offing , . The U.S. Federal Reserve looks to be on hold for now ,  but will likely resume cutting rates later this year .</p><p class=\"\">USD/JPY will need a decisive break below support ahead of the Jan 27 low and the daily Ichimoku cloud base to trade into a lower range. Support below the cloud is at the 200-day moving average at 152.81 and rapidly ascending 100-DMA below at 152.63.</p><p class=\"\">Large option expiries from 154.50 this week could well limit the downside for now.</p><p class=\"\">For more click on </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:695.4545454545454px;aspect-ratio:1.159090909090909\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02J-72957ec91eb6398f1f79cbdc5da28698-resized.webp\" type=\"images/webp\"/><img alt=\"Cloud support for now but ratchet down still path of least resistance?\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02J-72957ec91eb6398f1f79cbdc5da28698-resized.jpeg\" style=\"background-color:#e2dfdf\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">USD/JPY</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:592.8104575163399px;aspect-ratio:0.9880174291938998\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02J-d83bcf8514818115ed86e32b90aec34f-resized.webp\" type=\"images/webp\"/><img alt=\"Large expiries more to downside this week\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02J-d83bcf8514818115ed86e32b90aec34f-resized.jpeg\" style=\"background-color:#232120\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">USD/JPY nearby option expiries this week</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV02J:0-comment-usd-jpy-ranges-lower-trump-a-risk-but-more-downside/",
            "pub_date": "2025-02-04 11:05:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012009:0",
            "title": "MC Group Remains a Buy on High-Yield Play, Other Tailwinds — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MC Group retains its buy call from Thanachart Securities as the stock is a high-yield play, the brokerage's Phannarai Tiyapittayarut says in a research report. The stock looks inexpensive at a 10.1X 2025 price-to-earnings multiple and a 9.9% dividend yield, the analyst says. Also, the Thai company's sales from online channels are still growing, with contribution to its total sales expected to increase to 19.2% in 2027 from 10.4% in 2024. However, the manufacturer and marketer of 'Mc Jeans' is slowing store openings, which prompts the brokerage to cut its earnings estimates by 6% for 2025, 8% for 2026, and 11% for 2027. Thanachart Securities lowers its target price to THB12.00 from THB15.00. Shares closed 1% higher at THB10.00 on Monday. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012009:0/",
            "pub_date": "2025-02-04 10:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012010:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">2156 ET - MC Group retains its buy call from Thanachart Securities as the stock is a high-yield play, the brokerage's Phannarai Tiyapittayarut says in a research report. The stock looks inexpensive at a 10.1X 2025 price-to-earnings multiple and a 9.9% dividend yield, the analyst says. Also, the Thai company's sales from online channels are still growing, with contribution to its total sales expected to increase to 19.2% in 2027 from 10.4% in 2024. However, the manufacturer and marketer of 'Mc Jeans' is slowing store openings, which prompts the brokerage to cut its earnings estimates by 6% for 2025, 8% for 2026, and 11% for 2027. Thanachart Securities lowers its target price to THB12.00 from THB15.00. Shares closed 1% higher at THB10.00 on Monday. (ronnie.harui@wsj.com)</p><p class=\"\">2133 ET - Yangzijiang Shipbuilding's record-high order backlog boosts earnings visibility through 2027, DBS Group Research's Pei Hwa Ho says in a research report. The shipbuilder's yards are full through 2027 with an order book of roughly US$24 billion, which is expected to lead to earnings CAGR of around 14% over the next two years, the analyst says. Revenue growth and margin expansion are drivers, as about 65% of the company's order book consists of containership orders that command higher value and margins, the analyst adds. DBS raises its 2024-2026 earnings forecasts for Yangzijiang Shipbuilding by 5%-11%. It raises the target price to S$3.80 from S$2.88 with an unchanged buy rating. Shares are 1% lower at S$3.00. (ronnie.harui@wsj.com)</p><p class=\"\">2119 ET - SD Guthrie's Marvesa 48% stake acquisition looks set to help strengthen its downstream business expansion, diversify into other soft oils and boost trading between Europe and Asia-Pacific, MIDF Research says in a note. The 250 million ringgit acquisition comes as a surprise, particularly as many of the company's peers have adopted a cautious stance toward the region due to the impending European Union deforestation regulation policy, it notes. However, considering the plantation giant's strong supply-chain credentials, SD Guthrie views Europe as a key growth driver, MIDF says. SD Guthrie's balance sheet remains healthy and is well-positioned for expansion, it adds. MIDF maintains a buy rating on SD Guthrie and keeps its target price at MYR5.43. Shares are 0.6% higher at MYR4.88. (yingxian.wong@wsj.com)</p><p class=\"\">2103 ET - Hong Kong shares open higher, with the Hang Seng Index rising 1.6% to 20546.6. The Hang Seng Tech Index adds 2.9% to 4875.99. Market sentiment is boosted after Canada and Mexico reached a deal to delay U.S. President Donald Trump's tariffs. Among major stocks, technology stocks are leading the gains, with Bilibili adding 4.7% and JD.com rising 3.0%. Tencent is 1.0% higher. The few decliners include C&amp;D International Investment Group, which drops 1.3% and LVGEM (China) Real Estate Investment, which is 1.4% lower. (tracy.qu@wsj.com)</p><p class=\"\">2044 ET - Sunway REIT could post 11.6% earnings growth in 2025, driven by the record MYR899 million in asset acquisitions completed in 2024, rental reversion and higher occupancy rates, CIMB Securities analysts Lim Yue Jia and Ivy Ng Lee Fang say in a note. Upgrades at Sunway Pyramid Mall and Sunway Carnival Mall may also support earnings, they add. They raise Sunway REIT's 2025-2026 earnings forecasts by 0.9%-1.8% following the completion of the Sunway Kluang Mall acquisition. CIMB Securities raises Sunway REIT's target price to MYR2.11 from MYR2.09, while maintaining a buy rating on the stock. Shares are 2.1% higher at MYR1.91. (yingxian.wong@wsj.com)</p><p class=\"\">2014 ET - AMMB Holdings' canceling the sale of its life insurance unit to Great Eastern comes as no surprise, given the prolonged delay, Maybank IB analyst Desmond Ch'ng says in a note. He notes that there has been no progress on the deal since it was first proposed in October 2023. The impact on AMMB's capital is minimal, with its Common Equity Tier 1 ratio at a solid 15.3%, he reckons. While a sale may still be considered, there is no urgency, he adds. Ch'ng expects AMMB to see 11.7% earnings growth in FY 2025, supported by better net interest margins and lower credit costs. Maybank maintains a buy rating on AMMB and keeps the target price at MYR6.30. Shares are 0.2% higher at MYR5.65. (yingxian.wong@wsj.com)</p><p class=\"\">2008 ET - Singapore's FTSE Straits Times Index rises 0.7% to 3853.13 in early trade. Market sentiment is rosier after President Trump and leaders of Canada and Mexico reached a deal to put tariffs on hold for a month. \"Tariff headlines are still likely to dominate,\" UOB's Global Economics &amp; Markets Research team says in a note. Among advancers, Seatrium climbs 0.9%, DBS adds 1.3% and Yangzijiang Shipbuilding is up 1.0%. Meanwhile, Venture Corp. falls 0.4% and Keppel Ltd. loses 0.3%. (amanda.lee@wsj.com)</p><p class=\"\">2003 ET - Malaysia's benchmark Kuala Lumpur Composite Index is 0.3% higher at 1558.29 in early ytade. Trump's additional 10% tariffs on China's medical glove exports may lift sentiment toward local glove stocks, Malacca Securities says in a note. The recent pullback in construction stocks could attract bargain hunters, supported by Johor-Singapore Special Economic Zone initiatives and data-center developments, the brokerage reckons. It pegs KLCI support at 1533-1538 and resistance at 1568-1573. Among gainers, YTL Corp. adds 1.6% and Petronas Chemicals is up 1.1%. Meanwhile, SD Guthrie is down 1.0% and IHH Healthcare is 0.7% lower.(yingxian.wong@wsj.com)</p><p class=\"\">1939 ET - Australian retail sales data have bolstered Citi's conviction in JB Hi-Fi and Harvey Norman. The data showed a 6.7% increase in sales in the electrical category in the three months through December. Analyst Adrian Lemme notes JB Hi-Fi typically grows much faster than this official measure. So, Citi sees material upside to consensus expectations of 5% like-for-like sales growth by JB Hi-Fi in the December quarter. Its own forecasts are for 8.4% growth. \"Harvey Norman also looks well positioned into results given the improvement in the Electrical and Furniture categories,\" Citi says. It expects Australia's central bank to cut interest rates three times this year, starting this month. \"This should further support the consumer recovery we have been forecasting,\" Citi says. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1923 ET - Drivers of Westgold's downgrade to FY 2025 production guidance are likely to spill into the following year as well, reckons Macquarie. Westgold expects to produce 330,000-350,000 oz of gold in FY 2025, down from a prior projection of 400,000-420,000 oz. It expects to dig up gold at a higher cost, forecasting all-in sustaining costs, or AISC, of A$2,400-A$2,600/oz. \"We also assume the slower ramp-up of Bluebird and Beta Hunt, and softer grades at Big Bell, carry over into FY 2026 and cut production 10% while AISC lifts 4%,\" says Macquarie, referring to Westgold's mines. Still, Macquarie's revised outlook equates to a 32% year-over-year increase in production in FY 2026. It retains an outperform call on Westgold's stock. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1912 ET - Japanese stocks are higher, led by gains in auto and electronics stocks after the U.S. struck deals with Mexico and Canada to delay new tariffs. Toyota Motor is up 3.1% and Canon Inc. is 3.5% higher. USD/JPY is at 155.28, compared with 155.37 as of Monday's Tokyo stock market close. Investors are focusing on U.S. trade talks as well as domestic corporate earnings. Mitsui &amp; Co. and Mitsubishi Heavy Industries are scheduled to announce their quarterly results later in the day. The Nikkei Stock Average is up 1.6% at 39136.69. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1911 ET - South Korea's benchmark Kospi rises 1.1% to 2479.66 in early trade as semiconductor and auto stocks advance. News of President Trump pushing back U.S. tariffs on imports from Mexico and Canada help buoy sentiment. Institutional and retail investors are net buyers. Index heavyweight Samsung Electronics gains 1.8%. Memory-chip maker SK Hynix adds 1.0%, recovering from steep losses on trade war fears in the prior session. Car makers Hyundai Motor and Kia are up 1.7% and 2.2%, respectively. USD/KRW is 0.6% lower at 1,458.30, compared with the prior session's Seoul onshore trading close. South Korea's 10-year government bond yield is down 2.4 bps at 2.835%.(kwanwoo.jun@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012010:0/",
            "pub_date": "2025-02-04 10:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463117:0",
            "title": "Medallion Metals Seeks AU$6.5 Million via Share Placement; Lion Selection Becomes Shareholder with AU$1 Million Investment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Medallion Metals  received binding commitments to raise AU$6.5 million via a share placement, according to a Monday filing with the Australian bourse. </p><p class=\"\">The capital raising comprises the issue of 65 million fully paid ordinary shares at AU$0.10 each, a 4.8% discount to the company's last traded price. </p><p class=\"\">Existing shareholder Alkane Resources  supported the placement and will hold 6.3% of Medallion's shares on issue upon settlement, per the filing. Lowell Resources Fund  also committed to the placement. </p><p class=\"\">Meanwhile, Lion Selection  committed to invest AU$1 million, making it a new Medallion shareholder. </p><p class=\"\">Canaccord Genuity acted as sole lead manager and bookrunner to the placement. </p><p class=\"\">Proceeds will fund Medallion's activities amid its potential acquisition of assets of the Forrestania Nickel Operation from IGO .</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463117:0/",
            "pub_date": "2025-02-04 10:56:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012014_20250203012014:0",
            "title": "Centurion Corp. Target Price Raised to S$1.16 From S$1.06 by RHB Research >OU8.SG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012014_20250203012014:0/",
            "pub_date": "2025-02-04 10:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446464:0",
            "title": "Trump and Xi to Hold First Talks Amid Tariff Dispute",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US President Donald Trump is reportedly set to speak with his Chinese counterpart, Xi Jinping, as soon as this week, as the two largest economies are working toward a deal to avoid broader trade tensions, according to the White House.</p><p class=\"\">The call will mark the first known conversation between Trump and Xi since Trump took office on January 20, following their previous discussion before his inauguration.</p><p class=\"\">On Monday, Beijing urged Washington to engage in \"frank dialogue and strengthen cooperation,\"emphasizing that tariffs are counterproductive and harm normal trade relations.</p><p class=\"\">It also plans to file a lawsuit with the World Trade Organization, arguing that the US tariffs were imposed \"under the pretext of the fentanyl issue.\" Meanwhile, leaders of Canada and Mexico have reached agreements with Washington to delay tariffs for at least one month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446464:0-trump-and-xi-to-hold-first-talks-amid-tariff-dispute/",
            "pub_date": "2025-02-04 10:57:24",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463121:0",
            "title": "AXP Energy to Raise AU$1.3 Million via Share Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AXP Energy  received firm commitments to raise nearly AU$1.3 million through the issue of 833.3 million shares at AU$0.0015 apiece, according to a Tuesday filing with the Australian bourse. </p><p class=\"\">The issue price is a premium of over 9% to the 15-day volume-weighted average price of the company's shares. </p><p class=\"\">Directors pledged to invest AU$165,000, subject to shareholders' approval. </p><p class=\"\">Proceeds are earmarked for the roll-out of Modular Data Centers connected to off-grid power generation infrastructure at AXP's Pathfinder Field in Colorado, per the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463121:0/",
            "pub_date": "2025-02-04 10:59:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012019_20250203012019:0",
            "title": "Pennant Acquires Senior Living Communities In Idaho And Texas >PNTG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012019_20250203012019:0/",
            "pub_date": "2025-02-04 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012016_20250203012017:0",
            "title": "Mitsui & Co Sees FY Net Y920.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012016_20250203012017:0/",
            "pub_date": "2025-02-04 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012016_20250203012016:0",
            "title": "Mitsui & Co 9-Mos Net Y652.17B Vs Net Y726.41B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012016_20250203012016:0/",
            "pub_date": "2025-02-04 11:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:3dab2bca4f53d:0",
            "title": "AI Catalyst Fund, LP Acquires 420,000 Shares of ModivCare",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Ai Catalyst Fund, Lp</td></tr><tr><td>Relationship</td><td>10% Owner</td></tr><tr><td>Type</td><td>Purchase</td></tr><tr><td>Amount</td><td>$1,677,000</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2036637/000095017025012698/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">AI Catalyst Fund, LP, a 10% owner of ModivCare, reported purchasing 420,000 shares of ModivCare's Common Stock across three transactions on January 30, January 31, and February 3, 2025, for a total purchase amount of $1,677,000. The purchases were made at weighted average prices of $4.35, $4.03, and $3.87 per share, respectively, indicating multiple transactions at varying prices. Following these transactions, AI Catalyst Fund, LP directly owns 2,130,000 shares of ModivCare's Common Stock. The ownership is direct, with AI Catalyst Fund GP, LLC and Mr. Gonzales, by virtue of their roles, potentially deemed to have beneficial ownership, though they disclaim any beneficial ownership of the shares other than their pecuniary interest.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2036637/000095017025012698/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">ModivCare Inc [ MODV ] - Form 4 - Feb. 03, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:3dab2bca4f53d:0-ai-catalyst-fund-lp-acquires-420-000-shares-of-modivcare/",
            "pub_date": "2025-02-04 11:00:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9vY9G6:0",
            "title": "Pennant Acquires Senior Living Communities in Idaho and Texas",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EAGLE, Idaho, Feb.  03, 2025  (GLOBE NEWSWIRE) — The Pennant Group, Inc. , the parent company of the Pennant group of affiliated home health, hospice, home care and senior living companies, announced today that effective February 1, 2025, it has acquired three premier senior living facilities in Idaho and Texas. The acquisition in Idaho is subject to a triple net lease with the option to purchase, and the two Texas facilities are subject to a long-term, triple net lease.</p><p class=\"\">These acquisitions reinforce Pennant’s commitment to expanding its national footprint and enhancing the quality of care for its senior residents. These transactions expand Pennant’s operations by 188 units, comprised of both assisted living and memory care services. Pennant has strategically positioned itself to meet the growing demand for senior living services and these acquisitions bolster Pennant’s mission to provide personalized, high-quality care.</p><p class=\"\">“The acquisitions in Idaho and Texas represent another step forward for Pennant as we continue to expand our operations in key markets across the country,” said Brent Guerisoli, Chief Executive Officer of Pennant. “We are dedicated to creating vibrant communities where seniors can thrive, and these facilities are an important addition to our portfolio.”</p><p class=\"\">“As we simultaneously expand our presence in two states, we are excited to bring our expertise and commitment to excellence for the residents of each community,” added Andrew Rider, President of Pinnacle Senior Living LLC, Pennant’s senior living subsidiary. “These acquisitions underscore our focus on long-term growth while delivering exceptional care to our residents.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Pennant</strong><strong class=\"root-Tkn6WL2y\">:</strong></p><p class=\"\">The Pennant Group, Inc. is a holding company of independent operating subsidiaries that provide healthcare services through home health and hospice agencies and senior living communities located throughout Arizona, California, Colorado, Connecticut, Idaho, Montana, Nevada, Oklahoma, Oregon, Texas, Utah, Washington, Wisconsin and Wyoming. Each of these businesses is operated by a separate, independent operating subsidiary that has its own management, employees and assets. References herein to the consolidated \"company\" and \"its\" assets and activities, as well as the use of the terms \"we,\" \"us,\" \"its\" and similar verbiage, are not meant to imply that The Pennant Group, Inc. has direct operating assets, employees or revenue, or that any of the home health and hospice businesses, senior living communities or the Service Center are operated by the same entity. More information about Pennant is available at www.pennantgroup.com.</p><p class=\"\">SOURCE: The Pennant Group, Inc.</p><p class=\"\">Contact Information</p><p class=\"\">The Pennant Group, Inc.</p><p class=\"\">(208) 506-6100</p><p class=\"\">ir@pennantgroup.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9vY9G6:0-pennant-acquires-senior-living-communities-in-idaho-and-texas/",
            "pub_date": "2025-02-04 11:00:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463115:0",
            "title": "Nextgreen Global Prices Private Placement Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nextgreen Global  fixed the issue price for the private placement at 0.87 ringgit per share, according to a Monday Malaysian bourse filing. </p><p class=\"\">According to earlier filings, the printing services provider proposed a private placement of up to 10% of the total number of issued shares of the company to independent third-party investors.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463115:0/",
            "pub_date": "2025-02-04 10:51:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV050:0",
            "title": "Palm retreats on weaker Chicago soyoil, crude oil",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Malaysian palm oil futures fell on Tuesday after five straight sessions of gains, weighed down by declines in Chicago soyoil and crude oil.</p><p class=\"\">The benchmark palm oil contract  for April delivery on the Bursa Malaysia Derivatives Exchange slid 56 ringgit, or 1.28%, to 4,311 ringgit ($968.33) a metric ton in early trade.</p><p class=\"\">FUNDAMENTALS</p><p class=\"\">* Soyoil prices on the Chicago Board of Trade  were down 3.4%. The Dalian Commodity Exchange was closed for the Chinese Lunar New Year and will reopen on Wednesday.</p><p class=\"\">* Palm oil tracks price movements of rival edible oils, as it competes for a share of the global vegetable oils market.   </p><p class=\"\">* Oil prices retreated after U.S. President Donald Trump agreed to hold off imposing steep tariffs on Mexico and Canada, the two biggest foreign oil suppliers to the United States, for a month. O/R</p><p class=\"\">* Brent crude futures  fell 0.68% to $75.44 a barrel by 0240 GMT. Weaker crude oil futures make palm a less attractive option for biodiesel feedstock. </p><p class=\"\">* The ringgit , palm's currency of trade, strengthened 0.4% against the dollar, making the commodity more expensive for buyers holding foreign currencies.</p><p class=\"\">* Brazil's 2024/25 soybean crop is expected to reach a record 174 million metric tons, agribusiness consultancy Celeres said, bumping up its forecast from a prior 170.8 million tons due to positive weather conditions.</p><p class=\"\">* Palm oil may retrace into a range of 4,265 ringgit to 4,315 ringgit per ton, as it failed to break resistance at 4,402 ringgit, Reuters technical analyst Wang Tao said. TECH/C</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:541.875px;max-width:1200px;aspect-ratio:2.2145328719723185\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV050-3d959a10773850217558cc8f5d126f81-resized.webp\" type=\"images/webp\"/><img alt=\"tech/c\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV050-3d959a10773850217558cc8f5d126f81-resized.jpeg\" style=\"background-color:#f6f0ed\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">cpo</span></figcaption></figure></span></p><p class=\"\">MARKET NEWS</p><p class=\"\">* Hong Kong shares hit two-month highs, U.S. equity futures rose and currencies swung to-and-fro in big ranges as investors scrambled to keep up with sudden changes in U.S. trade policy. MKTS/GLOB</p><p class=\"\">DATA/EVENTS</p><p class=\"\">1500   US   Factory Orders MM   Dec</p><p class=\"\">($1 = 4.4520 ringgit)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV050:0-palm-retreats-on-weaker-chicago-soyoil-crude-oil/",
            "pub_date": "2025-02-04 10:51:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}