{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309157:0",
            "title": "Piper Sandler Cuts Price Target on PepsiCo to $167 From $171",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PepsiCo  has an average rating of overweight and mean price target of $172.45, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309157:0/",
            "pub_date": "2025-02-05 02:56:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309158:0",
            "title": "Argus Raises Price Target on Roper Technologies to $625 From $600",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Roper Technologies  has an average rating of overweight and mean price target of $642.75, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309158:0/",
            "pub_date": "2025-02-05 02:57:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008368:0",
            "title": "Palantir Shows the AI Trade Is Alive and Well. 2 Stocks That Could Benefit. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Clark</p><p class=\"\">Palantir Technologies is the darling of the artificial-intelligence bulls again. The data-analytics company's upbeat call on how low-cost AI can boost its business should be good news for other software stocks.</p><p class=\"\">Palantir executives hailed a future where their software is set to become the most valuable part of the AI ecosystem, compared with underlying models, following the company's earnings beat. That comes on the back of Chinese firm DeepSeek apparently demonstrating cutting-edge models can be developed for a fraction of the previously assumed cost.</p><p class=\"\">\"I think one of the obvious lessons of DeepSeek-R1 is something that we've been saying for the last two years, which is that the models are commoditizing,\" Palantir's Chief Technology Officer Shyam Sankar told analysts on an earnings call. \"Yes, they're getting better across both closed and open, but they're also getting more similar. And the price of inference is dropping like a rock.\"</p><p class=\"\">Other companies potentially placed to benefit from that shift include cloud-based data storage company Snowflake, its privately owned rival Databricks, and customer-relationship software company Salesforce.</p><p class=\"\">\"[Palantir's] guidance for strong 54% U.S. commercial revs [revenue] growth in 2025 is a positive signal for primarily Databricks (according to our checks, Palantir and Databricks appear best-positioned to see AI pull-through) but to some degree Snowflake,\" wrote UBS analyst Karl Keirstead in a research note on Tuesday.</p><p class=\"\">Snowflake last year launched its own large-language model that the cloud-based data-warehousing firm claimed was the best option for enterprise AI applications. Snowflake said it trained the model in less than three months, with a budget of under $2 million.</p><p class=\"\">Snowflake shares were rising 3.5% in morning trading. Another gainer was Salesforce, which was up 0.7%.</p><p class=\"\">Salesforce is one of the software companies pushing ahead fastest with \"AI agents,\" or agentic AI. The terms refer to systems that can make decisions for businesses, helping them with issues such as customer interaction.</p><p class=\"\">\"A lower cost of compute could bring down AI computing costs of sales and drive better margin on AI enabled offerings. More importantly, agentic application providers could pass savings on to enterprises via lower price, which could provide a catalyst for adoption/proliferation of agents,\" wrote BofA Securities analyst Brad Sills in a recent research note.</p><p class=\"\">Salesforce plans to lay off more than 1,000 employees as it shifts focus to AI products, Bloomberg reported on Tuesday.</p><p class=\"\">Write to Adam Clark at adam.clark@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008368:0/",
            "pub_date": "2025-02-05 02:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA7JCBZ3:0",
            "title": "Firstservice Declares 10% Increase To Quarterly Cash Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FirstService Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FIRSTSERVICE DECLARES 10% INCREASE TO QUARTERLY CASH DIVIDEND</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FIRSTSERVICE CORP - APPROVES 10% INCREASE IN QUARTERLY DIVIDEND TO $0.275 PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA7JCBZ3:0-firstservice-declares-10-increase-to-quarterly-cash-dividend/",
            "pub_date": "2025-02-05 02:58:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ObivjMRVa:0",
            "title": "Second milestone of the remaining payments from \"the Penguins license contract\" is reached and triggers significant cash payments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On 4 February 2025, Shell UK Ltd. announced the restart of production at thePenguins field in the UK North Sea with a modern floating, production, storageand offloading (FPSO) facility using Magnora's legacy design. This \"first oil\"milestone triggers a USD 4.3125 million payment to Magnora.</p><p class=\"\">The eventual recipient of funds will be Hermana Holding ASA. For Hermana, thepayment has a significant cash flow effect, but no accounting effect as thefullvalue of the milestone has already been recognised as a receivable fromMagnoraduring the demerger that was completed in June 2024.</p><p class=\"\">With the sale of the legacy business in 2018, Magnora no longer has anyemployees or activities within its legacy business. Following the demerger ofHermana Holding ASA in the spring of 2024, the right to legacy royalty andlicense revenue streams were transferred to Hermana. Magnora ASA holds 30percent of the shares in Hermana.</p><p class=\"\">The remaining milestone from the Shell Penguins deal is triggered when Shellreaches a production target of 4m barrels of oil. This event will triggeranother USD 4.3125 million payment. For details on the milestone agreements,please refer to the press release issued 15.01.2018 by Sevan Marine ASA and06.12.2022 by Magnora ASA.</p><p class=\"\">https://newsweb.oslobors.no/message/637700</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ObivjMRVa:0-second-milestone-of-the-remaining-payments-from-the-penguins-license-contract-is-reached-and-triggers-significant-cash-payments/",
            "pub_date": "2025-02-05 02:59:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309159:0",
            "title": "United Corporations Declares Dividends",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">United Corporations  on Tuesday declared cash dividends of $0.375 for First and Second Preferred Shares, and the 1959 Series Second Preferred Shares, and $0.30 for the 1963 Series Common Shares. </p><p class=\"\">All have record dates of May 5 and payable dates of May 15. </p><p class=\"\">This is consistent with dividends paid out in February in a November announcement.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309159:0/",
            "pub_date": "2025-02-05 02:59:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009202:0",
            "title": "Robinhood Yanks Super Bowl Betting Contracts After Regulator's Pushback — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Alexander Osipovich, Hannah Erin Lang and Katherine Sayre</p><p class=\"\">Robinhood Markets said Tuesday that it was withdrawing its plans to offer betting contracts on the Super Bowl, following pushback from the Commodity Futures Trading Commission, which raised concerns that the contracts might be illegal.</p><p class=\"\">\"We were in regular contact with the CFTC prior to launching this product, and we believe we are in full compliance with all applicable regulations,\" said Robinhood General Counsel Lucas Moskowitz.</p><p class=\"\">Robinhood said it had been asked by the CFTC to stop offering its customers access to the sports contracts on Monday afternoon, just hours after it unveiled its sports-betting plans, a move that blurred the lines between regulated financial markets and gambling.</p><p class=\"\">Robinhood launched the contracts through a partnership with Kalshi, an online prediction market that listed a family of sports-betting contracts in January.</p><p class=\"\">CFTC-regulated prediction markets such as Kalshi are barred under federal law from listing contracts that involve \"gaming\" and are against the public interest, but the definition of \"gaming\" isn't spelled out in the law, which has led to disputes over what is permitted.</p><p class=\"\">Earlier Tuesday, a CFTC spokesman said the agency had \"serious concerns\" about brokers offering customers access to contracts that \"may not be permissible under the law.\" The agency \"will exercise its oversight authority to the fullest extent as appropriate,\" the spokesman added.</p><p class=\"\">Write to Alexander Osipovich at alexo@wsj.com, Hannah Erin Lang at hannaherin.lang@wsj.com and Katherine Sayre at katherine.sayre@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009202:0/",
            "pub_date": "2025-02-05 03:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6y016x:0",
            "title": "Defy Investments Acquires Davis Homes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fort Wayne, Indiana, Feb.  04, 2025  (GLOBE NEWSWIRE) — Defy Investments, a newly established investment and management company focused on acquiring and growing commercial and residential construction companies, announced today it has acquired Indianapolis-based homebuilder Davis Homes. This acquisition marks a pivotal step in Defy’s mission to challenge industry norms and elevate the construction landscape.</p><p class=\"\">“At Defy Investments, we’re more than just investors—we’re builders of community and innovation,” said David McDonald, President of Defy Investments. “As a locally owned organization, we’re committed to pushing the boundaries of what’s possible in the construction industry. We aim to create a lasting impact by investing in forward-thinking businesses that prioritize people, embrace new technologies, and deliver strategic results.”</p><p class=\"\">The acquisition of Davis Homes, a well-known brand in Indiana homebuilding, underscores Defy’s dedication to fostering partnerships that bring fresh ideas, adaptability, and real-world impact. With more than 25,000 homes built across Indiana, the Davis companies boast a rich heritage of crafting dream homes in vibrant neighborhoods and on custom lots. This proud legacy continues under the leadership of CEO Bradley C. Davis and COO Don Chesney, started by Bradley’s father Charles Davis and his grandfather O.E. Davis in the 1950’s. Bradley has also worked with his brothers Rick and Mike Davis through the years with a devotion to delivering quality and attention to detail. Bradley will continue in his role as CEO and retain a minority ownership interest in the Company. All other Davis employees will also continue in their current roles.</p><p class=\"\">“We are committed to advancing the construction industry through partnerships that redefine what’s possible in residential and commercial construction,” McDonald added. “We’re excited to support innovative companies like Davis Homes that lead with vision and values.”</p><p class=\"\">Specializing in development and construction of residential subdivisions of all price points as well as construction of custom “on your lot” homes throughout Central Indiana, Davis Homes embodies a commitment to personalized service and craftsmanship. This acquisition ensures that the Davis family’s legacy of quality, integrity, and innovation will continue to thrive for generations to come. “We are honored to join forces with Defy Investments and look forward to achieving new heights together, building on our shared values and dedication to excellence,” said Bradley C. Davis.</p><p class=\"\">Defy Investments invites like-minded business owners, entrepreneurs, and investors to join in building a future that defies expectations and shapes a better tomorrow.</p><p class=\"\">Whelan Advisory acted as the exclusive financial advisor to Davis Homes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Defy Investments</strong>Founded in 2024, Defy Investments is an investment and management company focused on acquiring and growing innovative construction companies in the commercial and residential sectors. Partnering with Defy means gaining a dedicated ally committed to helping you achieve unprecedented success. To learn more, visit defy.re. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Davis Homes</strong>Founded on a legacy of excellence, the Davis companies have built over 25,000 homes in Indiana, specializing in custom “on your lot” construction and new builds in vibrant communities. Led by third-generation builder Bradley C. Davis, Davis Homes continues to deliver the highest quality homes tailored to meet the needs and dreams of their customers. To learn more, visit davishomes.com.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachments</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Defy Investments      </li><li class=\"listItem-bmN0_SHH\">Davis Homes      </li></ul><p class=\"\">Jaclyn Goldsborough</p><p class=\"\">The Ferguson Agency</p><p class=\"\">574-596-0818</p><p class=\"\">jaclyn@fai2.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6y016x:0-defy-investments-acquires-davis-homes/",
            "pub_date": "2025-02-05 03:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbVXKYH:0",
            "title": "Betblast Launches New Features for Bigger Wins and Faster Payouts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">San Jose, Costa Rica, Feb.  04, 2025  (GLOBE NEWSWIRE) — In the competitive world of online gambling, players are always looking for platforms that deliver not just entertainment but also real, tangible rewards. One name that keeps surfacing in discussions about the biggest wins and lightning-fast payouts is Betblast. The buzz surrounding this platform has reached new heights in 2024, with countless players sharing their experiences of hitting life-changing jackpots and enjoying withdrawals that are processed faster than the industry norm.</p><p class=\"\">In this comprehensive press release, we’ll dive deep into what makes Betblast stand out, uncovering the stories behind the biggest wins, the unmatched payout speeds, and why Betblast has become a household name among online casino enthusiasts.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">The Biggest Wins: Stories That Inspire</strong></strong></p><p class=\"\">When it comes to online casinos, nothing grabs attention quite like a big win. Betblast has become synonymous with massive payouts, with players across the globe sharing their jackpot stories.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Real Stories of Life-Changing Wins:</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">James P. from the UK:</strong> “I couldn’t believe my eyes when I hit a $250,000 progressive jackpot on Betblast. The payout was processed within hours, and the money was in my account the next day. This platform changed my life!”</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Maria S. from Spain:</strong> “Winning €50,000 on a single spin felt surreal, but what impressed me the most was how fast Betblast processed my withdrawal. No delays, no excuses—just fast, reliable payouts.”</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Liam K. from Australia:</strong> “I’ve played on many platforms, but Betblast is different. I won $75,000 on a poker tournament, and my winnings were in my crypto wallet the same day. That’s what I call service!”</li></ul><p class=\"\">These stories are not just marketing hype—they’re real testimonials that reflect Betblast's commitment to providing a fair, rewarding gaming environment.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Fastest Payouts in the Industry</strong></strong></p><p class=\"\">While big wins are exciting, they mean little if players face endless delays when trying to cash out. This is where Betblast truly shines. According to multiple testimonials, Betblast has set a new standard for payout speeds in the online casino industry.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">What Makes Betblast's Payouts So Fast?</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Streamlined Withdrawal Process:</strong> Betblast has eliminated unnecessary verification steps that slow down payouts on other platforms. Their system is designed for efficiency, allowing players to withdraw their winnings quickly and hassle-free.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Crypto-Friendly Transactions:</strong> Betblast fully supports cryptocurrency transactions, enabling instant deposits and withdrawals. Bitcoin, Ethereum, and other major cryptos are processed within minutes, giving players near-instant access to their funds.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Dedicated Payment Team:</strong> Betblast's finance team works around the clock to process payouts promptly. Unlike other casinos that batch process withdrawals once a day, Betblast handles requests continuously, ensuring faster turnaround times.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Transparent Policies:</strong> No hidden fees, no unexplained delays. Players know exactly what to expect, as Betblast maintains full transparency in its payment processes.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">How Betblast Compares to Other Casinos</strong></strong></p><p class=\"\">Many online casinos claim to offer fast payouts, but Betblast's track record speaks for itself. Here’s how it stacks up against typical industry standards:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Feature</td><td>Betblast</td><td>Industry Average</td></tr><tr><td>Crypto Withdrawal Time</td><td>Within 1–2 hours</td><td>24–48 hours</td></tr><tr><td>Traditional Bank Withdrawal</td><td>1–3 business days</td><td>3–7 business days</td></tr><tr><td>Bonus Winnings Withdrawal</td><td>No extra delays</td><td>Often delayed for review</td></tr><tr><td>Verification Process</td><td>Instant for verified accounts</td><td>Up to 5 days</td></tr></tbody></table></div><p class=\"\">Based on multiple player testimonials, it’s clear that Betblast outperforms competitors when it comes to getting players their money quickly and securely.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">The Role of Crypto in Speeding Up Payments</strong></strong></p><p class=\"\">In today’s fast-paced world, players expect instant gratification—not just in gameplay but also in payments. Betblast has embraced this by becoming a crypto-friendly platform. The integration of blockchain technology means transactions are processed faster, with fewer intermediaries involved.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Benefits of Using Crypto on Betblast:</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Instant Deposits and Withdrawals:</strong> No more waiting for banks to process transactions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Enhanced Privacy:</strong> Crypto transactions provide an extra layer of anonymity, which many players appreciate.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Lower Fees:</strong> Traditional banking methods often involve transaction fees. Crypto minimizes these costs, ensuring players keep more of their winnings.</li></ul><p class=\"\">According to many players, the ability to deposit and withdraw with crypto has been a game-changer, especially for high-stakes players who move large sums of money.</p><p class=\"\">Betblast's Commitment to Fair Play and Transparency</p><p class=\"\">Big wins and fast payouts are exciting, but they wouldn’t mean much without the foundation of fairness and trust. Betblast operates with complete transparency, using Random Number Generators (RNGs) certified by independent auditors to ensure fair gameplay.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Key Trust Factors:</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Independent Audits:</strong> Regularly reviewed to maintain fairness and integrity.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Responsible Gaming Tools:</strong> Players can set limits to control their gambling habits.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Licensed and Regulated:</strong> Betblast holds licenses from reputable gaming authorities, adding an extra layer of credibility.</li></ul><p class=\"\">Players consistently mention that they feel safe and secure, knowing the games are fair and the company operates with integrity.</p><p class=\"\">Exclusive Bonuses That Boost Your Winning Potential</p><p class=\"\">While the focus here is on big wins and fast payouts, it’s impossible to ignore the generous bonuses that Betblast offers. From welcome packages to reload bonuses and VIP rewards, there’s always an opportunity to boost your bankroll.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Popular Bonuses Include:</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Welcome Bonus:</strong> A generous package for new players to get started with a bang.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Free Spins Galore:</strong> Regular promotions offering free spins on popular slots.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">VIP Program:</strong> Tailored rewards for loyal players, including cashback, exclusive bonuses, and personal account managers.</li></ul><p class=\"\">Many players emphasize how these bonuses have helped them turn small deposits into significant wins, adding to the platform’s overall appeal.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">What Players Are Saying: More Real Testimonials</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Olivia M. from Germany:</strong> “I deposited €100, claimed my bonus, and walked away with €10,000 after a few lucky spins. The withdrawal was processed in under 3 hours—unbelievable!”</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Daniel H. from Canada:</strong> “The crypto payouts are insane. I requested a Bitcoin withdrawal, and it hit my wallet in 30 minutes. Betblast is the real deal.”</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sophia G. from Italy:</strong> “I’ve won big on other sites, but none processed my payouts as fast as Betblast. Plus, the customer support is top-notch!”</li></ul><p class=\"\">Final Thoughts: Why Betblast Is the Best Choice for Big Wins and Fast Payouts</p><p class=\"\">When you combine massive winning potential, lightning-fast payouts, top-tier security, and exceptional customer service, you get Betblast. It’s no surprise that players continue to share stories of life-changing jackpots and hassle-free withdrawals.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Ready to Experience the Thrill?</strong></strong></p><p class=\"\">Visit Betblast today and join the thousands of players who’ve already discovered the winning advantage!</p><p class=\"\">Disclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.</p><p class=\"\">James White</p><p class=\"\">bet-blast</p><p class=\"\">james (at) bet-blast.net</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbVXKYH:0-betblast-launches-new-features-for-bigger-wins-and-faster-payouts/",
            "pub_date": "2025-02-05 03:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Obip6Dy2a:0",
            "title": "Observe Medical ASA - Resignation of board member",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oslo, 4 February 2025: Board member Kathrine Elisabeth Gamborg Andreassen hasinformed the board of directors of Observe Medical ASA (the \"Company\" or\"Observe Medical\") that she will resign from the Company's board of directors,effective 5 February 2025, in order to focus on her responsibilities as CEO ofNavamedic ASA.</p><p class=\"\">Following the resignation, the board of directors will continue to constituteaquorum and is comprised of Terje Bakken (chair), Eskild Endrerud (boardmember)and Line Tønnessen (board member).</p><p class=\"\">The appointment of any replacement director is expected to be considered inrelation to the Company's annual general meeting on 28 May 2025 (the \"AGM\").Ms.Gamborg Andreassen has also informed that she has offered herself for electionto the Company's nomination committee at the AGM.</p><p class=\"\">For further information, please contact:</p><p class=\"\">Jørgen Mann</p><p class=\"\">CEO</p><p class=\"\">Observe Medical</p><p class=\"\">Mobile: +45 408 67 558</p><p class=\"\">E-mail: jorgen.mann@observemedical.com</p><p class=\"\">Johan Fagerli</p><p class=\"\">CFO</p><p class=\"\">Observe Medical</p><p class=\"\">Mobile: +47 958 12 765</p><p class=\"\">E-mail: johan.fagerli@observemedical.com</p><p class=\"\">This information is subject to the disclosure requirements pursuant to article19 of the EU Market Abuse Regulation and section 5-12 of the NorwegianSecurities Trading Act.</p><p class=\"\">About Observe Medical:</p><p class=\"\">Observe Medical is a Nordic medtech company that develops, markets, and sellsinnovative medtech products for the global market. The Company is committed toimproving patient welfare and patient outcomes, improving clinical dataaccuracy, and promoting positive health economics.</p><p class=\"\">The Company seeks to drive growth by leveraging its expertise in sales andcommercialization of its broad portfolio of medical technology products,mainlyin urine measurement and ultrasound, in combination with targeted M&amp;A anddistribution. Observe Medical is working with a network of leadingdistributorsto provide outstanding solutions for healthcare professionals globally.</p><p class=\"\">The Company is headquartered in Oslo, Norway.</p><p class=\"\">Further information is available at www.observemedical.com.</p><p class=\"\">https://newsweb.oslobors.no/message/637701</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Obip6Dy2a:0-observe-medical-asa-resignation-of-board-member/",
            "pub_date": "2025-02-05 03:00:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309161:0",
            "title": "Update: Gold Rises to a Fresh Record as Safe-Haven Demand Continues Despite U.S. Pause on Canada, Mexico Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates prices.)</p><p class=\"\">Gold prices rose mid-afternoon on Tuesday, trading at a second-straight daily record high on a weakening dollar and safe-haven buying as Donald Trump postponed the start of 25% tariffs on imports from Canada and Mexico for 30 days. </p><p class=\"\">Gold for April delivery was last seen up US$17.80 to US$2,874.90 per ounce, rising up from Monday's record close. </p><p class=\"\">U.S. President Donald Trump on Monday agreed to delay tariffs on imports from Canada and Mexico, the country's largest trading partners, in return for border security measures, while going ahead with an immediate 10% tariff on imports from China. China is retaliating with targeted tariffs of up to 15% and export controls on strategic materials, including tungsten and tellurium, that take effect on Feb.10. </p><p class=\"\">The delay to Canada and Mexico tariffs somewhat calmed markets, but concerns over the stability of U.S. trade policy under Donald Trump may continue to unsettle investors, keeping gold demand high. </p><p class=\"\">\"Ongoing tariff uncertainty bolstered demand for safe-haven assets. A softer dollar also provided support,\" Saxo Bank noted. </p><p class=\"\">The dollar weakened early, with the ICE dollar index last seen down 1.00 points to 107.99. </p><p class=\"\">Treasury yields were lower, with the yield on the U.S. two-year note was last seen down 4.5 basis points to 4.22%, while the 10-year note was paying 4.52%, down 4.4 points.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309161:0/",
            "pub_date": "2025-02-05 03:00:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1VD:0",
            "title": "Gartner jumps on fourth-quarter profit beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of research and advisory firm Gartner  up 1.33% at $555.08</p><p class=\"\">** Company reports Q4 revenue of $1.7 bln, above analysts' average estimate of $1.69 bln, according to data compiled by LSEG</p><p class=\"\">** Also reports Q4 adj. profit of  $5.45/shr vs analysts' average estimate of $3.25/shr</p><p class=\"\">** Company expects FY25 revenue of $6.56 bln and adj. profit per share of $11.45</p><p class=\"\">** \"The outlook for 2025 is a bit disappointing despite mgmt history of conservatism\" - Jefferies analysts  </p><p class=\"\">** Shares rose ~7.40% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1VD:0-gartner-jumps-on-fourth-quarter-profit-beat/",
            "pub_date": "2025-02-05 03:00:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACScHPbKa:0",
            "title": "A Rural Hospital Defies the Odds and Turns Around - in 24 Months",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WATKINSVILLE, GA / ACCESS Newswire / February 4, 2025 / Just two years ago, <strong class=\"root-Tkn6WL2y\">Washington County Regional Medical Center (WCRMC)</strong>, a 56-bed hospital in Sandersville, Ga., population 5,831, was on life support. Facing multi-million-dollar annual operational losses, it seemed unlikely that WCRMC could survive.</p><p class=\"\">If the hospital didn't make it, it would not be alone. Since 2020, 36 rural hospitals in the U.S. have closed[i]-a statistic that's more than alarming. Yet, it doesn't even come close to revealing what may yet lie ahead for rural hospitals.</p><p class=\"\">A February 2024 Chartis report found 418 other rural hospitals are at risk of closure and that 50% of these vulnerable facilities are currently operating in the red-that's the highest percentage of rural hospitals losing money in the past decade.[ii]</p><p class=\"\">What's going on? The bottom line is rural hospitals simply cannot continue to care for patients while simultaneously shouldering the enormous and ever-increasing regulatory burdens and reimbursement cuts related to operations and hospital management. However, the importance of rural hospitals to their communities and for local access to care, cannot be overstated.</p><p class=\"\">The issues are complex and come from all angles, and while all hospitals face similar challenges, they are unique in how the problems impact them. Workforce shortages. Inability to offer competitive salaries. Decreases in Medicaid and Medicare reimbursements, as well as 3rd party insurance payments. The inability to invest in needed equipment and technology. Or to afford required upgrades to their facilities.</p><p class=\"\">Then there are the issues happening behind the scenes, like low staff morale or a tarnished hospital reputation, which factor into financial losses. A host of other factors play into the mix related to rules and regulations, too. Case in point: Rural hospitals staff their emergency rooms 24/7. However, hospitals only get paid if patients come in.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">WCRMC Brings In Aletheia Health Partners</strong></p><p class=\"\">WCRMC faced many of these same challenges, including the fact the hospital's ER had earned a reputation with some as a \"band-aid station\" and town residents avoided going there for care. It had also been difficult recruiting/retaining staff and investing in needed resources.</p><p class=\"\">In August of 2022, WCRMC asked strategic advisory and management group, Aletheia Health Partners (AHP), to help them stop their monthly bleed and set them on a course for sustainability. As a result, Aletheia started consulting with WCRMC and AHP's Chief Administrative Officer, Kerry Trapnell, and he took the helm as interim CEO in January of 2023. Aletheia stepped in as the new management team in May of 2023.</p><p class=\"\">Trapnell and the Aletheia team placed priority on listening to the community and to hospital staff to understand the complexities and nuances that were contributing to the financial loss. This process revealed the most critical areas where bleed was happening, allowing Aletheia to offer recommendations to WCRMC, which WCRMC asked them to swiftly put into motion. This included eliminating nearly all high-cost contract clinical positions which included agency staffing and emergency room providers. Of those that needed to remain, the hospital went from managing over 30 individual contracts, to just a handful.</p><p class=\"\">This freed up funds that were used to increase salaries for nurses-who hadn't seen pay raises in years. Other staff eventually received pay increases, too. Another step taken included identifying areas of staff overlap and cost cutting to reduce these redundancies. Other savings allowed for new services and resources to be added into WCRMC, such as growing specialist surgeons in the community, a new nuclear medicine program, and a new CT scanner.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pamela Stewart Becomes CEO</strong></p><p class=\"\">Each win allowed the hospital to regain more sure footing, and in December 2023, WCRMC named its new CEO, Pamela Stewart. Stewart had a significant 20-year history with WCRMC, working as a nurse and in compliance-related roles. Prior to accepting the CEO position, she served as interim Chief Nursing Officer. Her background also included working for The Joint Commission, where she gained additional insights into hospital and care quality, safety, and performance. As a bonus, Sandersville is Stewart's hometown.</p><p class=\"\">Stewart credits Aletheia with their expertise in rural hospital operations as key to the turnaround. But she is quick to point out that, because they are rooted in and deeply understand rural communities, Aletheia was able to do what others who came before them could not.</p><p class=\"\">Notably, the process included listening to concerns from community leaders, attending meetings, getting to know the community leaders, and eventually regaining their trust. Combining this with a \"show, don't tell\" approach, community leaders could see that tangible, significant and swift financial gains were actually happening at WCRMC. This newly forged relationship and demonstrated successes went a long way in securing a $15.5 million bond in 2024 from the Washington County Commissioners for hospital projects. The funds will be applied to new equipment, a new emergency department, remodeled inpatient rooms, remodeled nursing home, and other infrastructure and facility improvements.</p><p class=\"\">\"When Aletheia started working with Washington, the hospital had over $4 million in accounts payable and almost no cash. So we had to deal with old debt, while also paying current expenses. While we have done a lot, where we are going next would not be possible without the help of the county,\" stated Trapnell. \"By the county trusting our demonstrated commitment to the hospital and the community, we have the benefit of their financial support via the bond. Ultimately, the staff, the hospital facility, and the community will be beneficiaries of the county working as a partner with us, allowing our team to forge ahead in our quest to be a shining example of rural healthcare.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">From Surviving to Thriving</strong></p><p class=\"\">Within 24 months, the hospital went from losing millions of dollars each year to generating a profit. Today they are thriving and are poised to break ground on a new Emergency Department in early 2025, using a portion of county-generated funding. And, a new MRI, one of only two available in the state of Georgia that includes the capability to test for post-COVID cardiac issues, was obtained through a grant Aletheia helped WCRMC achieve and will be installed in the WCRMC radiology department in the fall of 2024. Aletheia also pursued and was awarded other grants totaling over $2 million to assist with adding new services.</p><p class=\"\">\"Part of our commitment to the county includes our team pursing every grant opportunity we can, in an effort to do our part obtaining funding. And, with Aletheia's help, we have done just that,\" said Stewart. \"As a Sandersville native and CEO of the hospital, I'm truly excited about our partnership with Aletheia. Admittedly, I was hesitant at first to use another management company, but in the last two years, their team has proven over and over they are fully invested in our hospital and our community. The changes we have made and the improvements on the way ensure that people in our area have access to outstanding care, right here at home.\"</p><p class=\"\">Today, hospital services and capabilities include the following with more improvements on the way:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Comprehensive inpatient and outpatient surgery services</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">24-hour physician staffed emergency room</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Imaging Center, Rehabilitation Services (Occupational Therapy, Physical Therapy, Speech Therapy), Wound Care, Respiratory Therapy, Cardiac Rehabilitation, Swing-Bed, Inpatient and Outpatient Surgery, ICU, Telemedicine, Lab and Ambulance Services</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Pediatric Clinic, Sleep Center, and a Specialty Clinic offering Cardiac and Orthopedic Services</p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Into the Future</strong></p><p class=\"\">The groundwork has been laid and the future is bright not only for WCRMC as a hospital, but for local health care for the citizens of Sandersville and surrounding areas. The financial turnaround of the hospital goes against the grain of what is happening across the state and the country, but it also means it can be done. One key viewpoint Aletheia brings to the table is helping their rural hospital clients to stop looking outward at \"what is being done wrong to them\" with respect to payors, insurance, and regulations but rather focus inward to make sure the elements that are in their control are maximized and executed to the best of their ability, for the betterment of their hospital. Aletheia is of the firm belief when there is leadership, a framework, funding, and importantly, local support, rural hospitals can not only be stabilized, but they can also thrive and regain their place as a healthcare partner in their communities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aletheia Health Partners</strong></p><p class=\"\">Aletheia Health Partners helps rural hospitals become solid and strong so they can focus on what matters most: patient care. As a community-focused hospital management company, Aletheia Health Partners provides management and operations service modules including human resources, revenue cycle management, and pharmacy services - all with the goal of creating a path for rural hospitals to remain sustainable for the communities they serve. To learn more, visit https://aletheiahp.com.</p><p class=\"\">CONTACT:</p><p class=\"\">info@aletheiahp.com</p><p class=\"\">706-389-9500</p><p class=\"\">https://aletheiahp.com</p><p class=\"\">[i] Becker's Hospital Review: https://www.beckershospitalreview.com/finance/36-rural-hospitals-have-closed-since-2020.html</p><p class=\"\">[ii] Report: Unrelenting Pressure Pushes Rural Safety Net Crisis into Uncharted Territory, Feb. 2024, Chartis.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Aletheia</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACScHPbKa:0/",
            "pub_date": "2025-02-05 03:00:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007976:0",
            "title": "RFK Jr. Clears Committee Vote, Putting Him on Track to Become Health Secretary — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kristina Peterson and Liz Essley Whyte</p><p class=\"\">WASHINGTON — The nomination of Robert F. Kennedy Jr. to lead the Health and Human Services Department advanced Tuesday after a key swing Republican voted for the nominee in the Senate Finance Committee, likely clearing his path to confirmation.</p><p class=\"\">Sen. Bill Cassidy (R., La.), a medical doctor, voted with all of the committee's Republicans to support Kennedy's confirmation.</p><p class=\"\">His vote followed an unusually intense pressure campaign from Kennedy, his supporters and the Trump administration over the weekend and up to the committee's vote.</p><p class=\"\">To secure Kennedy's support, the nominee and administration agreed to a number of concessions, Cassidy said, including promises to maintain current federal vaccine recommendations and keep intact Centers for Disease Control and Prevention website pages that say there isn't a link between vaccines and autism.</p><p class=\"\">Kennedy and the Trump administration committed to establish \"an unprecedentedly close, collaborative working relationship,\" Cassidy said, and set up safeguards to ensure the public's continued access to vaccines.</p><p class=\"\">\"I will use my authority as chairman of the Senate committee with oversight of HHS to rebuff any attempt to remove the public access to lifesaving vaccines without iron-clad causational scientific evidence,\" Cassidy said on the Senate floor after Tuesday's vote.</p><p class=\"\">The committee vote signaled that Kennedy's path to becoming the top U.S. health official was becoming smoother. The final tally was 14 to 13.</p><p class=\"\">In the full Senate vote, Kennedy can afford to lose as many as three Republican votes if all Democrats oppose him. In the event of a tie, Vice President JD Vance can cast the deciding vote.</p><p class=\"\">Potential GOP defectors include Sens. Mitch McConnell of Kentucky, a polio survivor; Lisa Murkowski of Alaska; and Susan Collins of Maine. No Republicans have said they plan to oppose Kennedy.</p><p class=\"\">The full Senate vote to confirm Kennedy hasn't been scheduled but could come as soon as next week.</p><p class=\"\">If confirmed, Kennedy would lead a powerful department with a $1.7 trillion budget regulating things as diverse as prescription medicines and food dyes and overseeing Medicare health insurance for the elderly and health services for Native Americans.</p><p class=\"\">Shares of vaccine makers Pfizer and Moderna fell after the Kennedy vote.</p><p class=\"\">Pfizer Chief Executive Albert Bourla told analysts during an earnings call Tuesday he expects Kennedy to have a \"more tempered view\" of vaccines as HHS secretary based on what he has seen from comments from Kennedy and the Trump administration.</p><p class=\"\">Bourla also said he doesn't expect the government to change vaccine manufacturers' liability protections because doing so requires congressional approval. The Trump administration doesn't want to see another health crisis. \"I feel cautiously optimistic that they will be very, very prudent,\" Bourla said.</p><p class=\"\">A scion of the famous Democratic family, Kennedy ran for president last year and then suspended his campaign last summer and endorsed Donald Trump, saying they had a joint mission to \"Make America Healthy Again.\"</p><p class=\"\">The phrase became a rallying cry picked up by many Republicans. Yet many Democrats and health authorities expressed concern over some of its tenets, because Kennedy has questioned the safety of vaccines and suggested unproven links between the shots and a range of chronic diseases, including autism.</p><p class=\"\">More than 20 large-scale studies involving hundreds of thousands of children in several countries have discredited any association between the measles, mumps and rubella vaccines and autism. Additional large studies strongly suggest that no vaccine causes autism.</p><p class=\"\">Democrats on the committee said Kennedy could undermine public health if he were confirmed. He had also struggled to answer questions about Medicare and Medicaid over two days of hearings last week.</p><p class=\"\">Sen. Ron Wyden of Oregon, the committee's top Democrat, said Kennedy was \"singularly unfit\" for the post of Health secretary and would pose \"a grave threat to the health of the American people.\"</p><p class=\"\">But Republicans hold a majority on the Finance committee, and most of the GOP committee members had coalesced around Kennedy, even though the nominee had in the past voiced support for abortion rights.</p><p class=\"\">Sen. Thom Tillis (R., N.C.) said the American Farm Bureau Federation, the National Rifle Association and groups that oppose abortion rights didn't actively oppose Kennedy.</p><p class=\"\">The partisan divide left Cassidy with the swing vote. His position was fraught. He had voted to convict Trump in his second impeachment trial. Now, Cassidy faces a primary challenger in his coming election in 2026.</p><p class=\"\">Yet Cassidy had said last week that he had been \"struggling\" over Kennedy's past comments about vaccines and the role they have played in making some parents hesitant to vaccinate their children.</p><p class=\"\">The Louisiana Republican had urged Kennedy during hearings on the nomination to make clear that he didn't believe vaccines caused autism, but Kennedy had sidestepped such an endorsement, saying he would review the data.</p><p class=\"\">Cassidy became the target of an intense persuasion campaign from Kennedy, his supporters and the Trump administration.</p><p class=\"\">\"MAHA moms packed the halls of the Senate and made thousands of calls,\" said Kennedy adviser Calley Means. \"Their voice was heard.\"</p><p class=\"\">As the committee vote neared, President Trump urged lawmakers to support Kennedy in a social-media post. \"20 years ago, Autism in children was 1 in 10,000. NOW IT'S 1 in 34. WOW! Something's really wrong. We need BOBBY!!!\" Trump wrote.</p><p class=\"\">Cassidy said he held a series of phone calls with Kennedy over the weekend and Tuesday morning before the committee's vote. During the calls, the senator said, Kennedy promised an unusually close working relationship.</p><p class=\"\">Cassidy said Kennedy, in addition to keeping federal vaccine recommendations and CDC web pages on vaccines and autism, committed to not set up alternate safety monitoring or approval systems for vaccines.</p><p class=\"\">Kennedy pledged that HHS would provide 30-day notice before any changes to vaccine-safety monitoring systems and would generally speak to Cassidy several times a month, the senator said.</p><p class=\"\">The nominee also offered Cassidy input on hiring decisions at HHS and promised Cassidy that the Senate health committee could choose a representative \"on any board or commission formed to review vaccine safety,\" Cassidy said.</p><p class=\"\">\"My support is built on assurances that this will not have to be a concern,\" Cassidy said of vaccines. \"He will be the secretary, but I believe he will also be a partner.\"</p><p class=\"\">Cassidy arrived late to the committee vote, walking into the room with Senate Majority Leader John Thune (R., S.D.).</p><p class=\"\">\"I've had very intense conversations with Bobby and the White House over the weekend and even this morning,\" Cassidy said in a social-media post shortly before the vote. \"I want to thank VP JD specifically for his honest counsel.\"</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Jared S. Hopkins contributed to this article.</li></ul><p class=\"\">Write to Kristina Peterson at kristina.peterson@wsj.com and Liz Essley Whyte at liz.whyte@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007976:0/",
            "pub_date": "2025-02-05 02:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009185:0",
            "title": "Gold Keeps Hitting Record Highs. Here's Why — and Which Stocks Could Benefit. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul R. La Monica</p><p class=\"\">Worries about tariffs are spooking many investors. But not gold bulls. Fans of the yellow metal are probably relishing all the uncertainty that President Donald Trump's tariff threats are creating.</p><p class=\"\">Gold prices are up nearly 9% already this year At just under $2,900 an ounce, the yellow metal is at a record high. And that follows a nearly 30% gain for gold in 2024.</p><p class=\"\">Investors in mining stocks are doing even better. The VanEck Gold Miners exchange-traded fund, which has big stakes in Newmont Corp., Agnico Eagle Mines and Barrick Gold, has soared 18% so far in 2025.</p><p class=\"\">Should investors be a little wary after such a big run this year on top of 2024's massive gains? Of course. That would be prudent. But it's worth noting that the mining stocks could have more room to run if gold prices keep climbing. And that seems very plausible.</p><p class=\"\">It appears that both foreign central banks and retail investors are fueling the rally. Poland, Turkey, India, and China have been big buyers, according to data from late last year from the World Gold Council.</p><p class=\"\">\"Emerging market banks are very committed to gold and well positioned to purchase more. Strategically, they will continue to be buyers,\" said Joe Cavatoni, senior markets strategist with the World Gold Council, in an interview with Barron's.</p><p class=\"\">It's all about the Trump trade war. The continued surge in gold is a bit unusual since it's happening at a time when the U.S. dollar is also strengthening.</p><p class=\"\">Frank Watson, a markets analyst for Kinesis Money, pointed out that a surging greenback is \"normally a bearish element for dollar-denominated gold prices,\" but he added that \"gold's safe haven appeal remains undiminished amid uncertainty over the economic and inflationary effects of expected US trade tariffs.\" In other words, Trump trade policies may trump the usual impact a strong dollar has on gold.</p><p class=\"\">Silver prices have been climbing too, rising about 13% so far this year. Alex Ebkarian, chief operating officer of physical precious metals dealer Allegiance Gold, said in an email to Barron's that the prices of both metals should keep climbing due to the market uncertainty.</p><p class=\"\">\"In a high-risk environment, the appeal of physical gold and silver becomes even more pronounced, as they eliminate counterparty risk and provide a reliable store of value,\" he said, adding that the recent move by JPMorgan Chase to deliver about $4 billion worth in gold futures is \"an apparent hedge against potential trade disruptions.\"</p><p class=\"\">So how much higher could gold go? Michael Arone, chief investment strategist for State Street's SPDR Business, thinks gold could top $3,000 an ounce sometime this year due to all that's happening on the worldwide landscape.</p><p class=\"\">\"Geopolitical risks and structural transitions in monetary and fiscal policies should also boost the prospects for gold,\" Arone wrote. \"Central bank purchases throughout the year will likely continue to support gold's price. All that could finally unleash some pent up investment demand from investors chasing last year's record gold prices.\"</p><p class=\"\">That should be good news as well for the mining stocks, which despite their big run already this year, remain reasonably valued. The VanEck Gold Miners ETF is trading for just 12 times 2025 earnings estimates, lower than its 5-year average of 15. It's also trading at about a price-to-earnings ratio that is 45% below the S&amp;P 500, much steeper than its usual 20% discount to the broader market.</p><p class=\"\">Write to Paul R. La Monica at paul.lamonica@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009185:0/",
            "pub_date": "2025-02-05 02:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309147:0",
            "title": "Quebec Innovative Up After Strategic Announcement With Avalio Pty",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Quebec Innovative Materials (QIMC.CN) on Tuesday said it formed a strategic collaboration with Avalio Pty, a geoscience and drilling technology firm, to advance natural hydrogen exploration and development. </p><p class=\"\">The company said this collaboration will integrate Avalio's specialized expertise with QIMC's ongoing exploration initiatives. </p><p class=\"\">Partnership will focus on the customization of drilling technologies designed for depths between 500 meters and 1.5 kilometers, joint appraisal and evaluation methodologies, and the implementation of strategic risk management frameworks. </p><p class=\"\">Shares of the company were last seen up $0.005 at $0.10 on the Canadian Securities Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309147:0/",
            "pub_date": "2025-02-05 02:51:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309155:0",
            "title": "National Bank Reviews TMX Group Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TMX Group reported adjusted fourth-quarter EPS of $0.48, up 31% and ahead of the Street $0.44</p><p class=\"\">\"This is another solid quarter for TMX. Revenues beat in the right places (e.g., Trayport, VettaFi, Issuer Services), which helped to deliver a solid 9% EPS beat,\" writes National Bank analyst Jaeme Gloyn. </p><p class=\"\">Looking ahead, TMX announced pricing increases at Trayport, Datalinx, and Listing fees that will drive 1% revenue upside in 2025. National Bank believes these results are sufficient to uphold TMX's premium valuation. </p><p class=\"\">Maintain $50 target, Sector Perform rating.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309155:0/",
            "pub_date": "2025-02-05 02:51:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009507:0",
            "title": "Psychedelic Drug Stocks Up, Vaccine Shares Down After Senate Committee Advances RFK Jr.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dean Seal</p><p class=\"\">Shares of companies developing psychedelic treatments jumped while those of vaccine makers slipped after a Senate committee advanced the nomination of Robert F. Kennedy Jr. to lead the Health and Human Services Department.</p><p class=\"\">The controversial nominee has previously said he believes psychedelic drugs could be useful therapeutics and should be decriminalized.</p><p class=\"\">Shares of Mind Medicine, the company better known as MindMed that is working on an LSD-based treatment for anxiety, were up 7.3% at $7.91 on Tuesday. Shares of Compass Pathways, which is developing a psilocybin product for depression, rose 9.9% to $4.74. Shares of ATAI Life Sciences, another developer of psychedelic therapies, surged 21% to $2.25.</p><p class=\"\">Kennedy has been a vocal skeptic of vaccines and repeatedly made false claims that they cause autism. He has refused to walk the claim back even at the urging of Sen. Bill Cassidy (R., La.). Cassidy said he struggled with Kennedy's past comments on vaccines but nonetheless cast the deciding vote in favor of his nomination.</p><p class=\"\">Shares of Moderna were down 5.2% to $34.65 while shares of Pfizer dropped 2% to $25.67, despite the company reporting better-than-expected fourth-quarter results Tuesday.</p><p class=\"\">Shares of Novavax and BioNTech, two more vaccine companies, were down about 1% each.</p><p class=\"\">A full Senate vote to confirm Kennedy hasn't been scheduled yet. He can afford to lose up to three Republican votes if all Democrats oppose him.</p><p class=\"\">Write to Dean Seal at dean.seal@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009507:0-psychedelic-drug-stocks-up-vaccine-shares-down-after-senate-committee-advances-rfk-jr/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009511:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1352 ET - Economists polled in January by the Bank of Mexico lowered their economic growth estimate for this year to 1% from 1.1% in December, while inflation expectations were virtually unchanged at 3.83% and 3.74% for core CPI. GDP slowed to 1.5% in 2024 from 3.3% the previous year, according to statistics institute Inegi. While public security remained the top perceived obstacle to growth, the percentage of analysts citing foreign trade policy rose to 13% from 7% in the previous survey. On Monday, Mexico reached agreement with President Trump to hold off imposing 25% tariffs on Mexican goods for a month while Mexico takes action to curb migration and fentanyl trafficking. (anthony.harrup@wsj.com)</p><p class=\"\">1313 ET - A few days after its quarterly launch, the Atlanta Fed's real-time estimate of 1Q GDP shows the U.S. economy growing at a 3.9% annualized pace over the three months through March. That would be a sharp step up from the 2.3% annualized rate recorded in 4Q 2024 and is well above most Wall Street analysts' forecasts. The model hasn't ingested much 1Q data yet, but recent construction-spending data and ISM manufacturing indexes have pushed the forecast in a positive direction. The first official estimates of 1Q GDP from the Commerce Department are expected to land in late April. (matt.grossman@wsj.com, @mattgrossman)</p><p class=\"\">1154 ET - Economist and market strategist David Rosenberg says he believes Canada and Mexico should have called President Trump's bluff on a 25% tariff. \"That may end up having been a mistake,\" says the head of Rosenberg Research. In a note to clients after the tariff reprieve, Rosenberg says he believes trade uncertainty overhanging Canada and Mexico will dissipate. \"The 30-day reprieve is a joke. Trump is not raising tariffs and probably was never going to,\" Rosenberg says. Canada now avoids a deep recession, Rosenberg says. The Canadian dollar has strengthened, with USDCAD at C$1.4318, or down 3.2% from a Sunday night peak. Still, Rosenberg sticks to his call for USDCAD at C$1.62, with Canada's economy set to underperform the U.S. and require more rate relief. (Paul.Vieira@wsj.com, @paulvieira)</p><p class=\"\">1127 ET - U.S. farmers carried an optimistic outlook into 2025, according to the latest Ag Economy Barometer published by Purdue University and the CME Group. Surveyed farmers say that their view of current conditions of the agricultural economy have improved, buoyed by a month of gains for row crop prices on the CBOT. Farmers are increasingly expecting to have a 'more robust' year financially than last year — although some concerns remain. Some 42% of surveyed farmers identified trade policy as their top policy concern over the next five years. Even so, 40% of farmers now say a trade war is likely or very likely, down 8 points from last month's survey. Some 29% say a trade war is unlikely or very unlikely, which is an 8 point increase from last month. (kirk.maltais@wsj.com)</p><p class=\"\">1119 ET - Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p><p class=\"\">1100 ET - Risk premia, or spreads, on euro-denominated credit are expected to tighten further in February, Societe Generale's Juan Valencia says in a note. In recent years, euro credit spreads have tightened modestly in February, excluding in 2020 due to the impact of Covid-19 and in 2022 following Russia's invasion of Ukraine. The pattern is likely to continue with slight spread tightening this February, he says. \"At the moment we don't see much evidence of a correction with spreads widening any time soon,\" Valencia says. (miriam.mukuru@wsj.com)</p><p class=\"\">1059 ET - U.S. and European high-yield bond issuers are well-equipped to cope with upcoming maturities, says MFS Investment Management's Benoit Anne in a note. Refinancing risk is therefore not a major challenge. \"In the U.S., it is not until 2028 and 2029 that the volume of maturities falling due peaks up, which leaves us with a couple of years of cushion,\" he says. In Europe, a significant number of maturies fall due in 2026 and 2027, but interest-rate cuts by the European Central Bank are likely to ease some of the refinancing pain, Anne says. (miriam.mukuru@wsj.com)</p><p class=\"\">1050 ET - Generative artificial intelligence is here to stay, and set to have a profound impact on the mergers and acquisitions market, Bain &amp; Company says in a report. \"We expect that companies that master the use of generative AI in M&amp;A over the next five years will identify targets faster than their competitors,\" the management-consulting firm says. About one in five surveyed companies currently uses generative AI in M&amp;A processes, and more than half expect to integrate it into their dealmaking by 2027, according to the report. Late followers to adopt AI will be outbid for good deals and find themselves staying too long in the process for bad deals, Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1047 ET - Duration from a long-term perspective looks attractive, although the tactical--or short-term--case for being long U.S. duration has become more challenging, says MFS Investment Management's Benoit Anne in a note. The case for fixed income is even stronger outside of the U.S., he says. In Europe, there are strong arguments in favor of both tactical and strategic exposure to fixed income given the significant monetary policy divergence between the U.S. and the eurozone, he says. The Federal Reserve paused last week, while the European Central Bank cut interest rates by 25 basis points. (emese.bartha@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1028 ET - Germany's current political turmoil, with elections to be held later this month, should have a muted impact on German government bonds, says MFS Investment Management's Annalisa Piazza in a note. \"Swap spreads have moved well in advance and are already pricing in some political and policy changes (such as more fiscal space),\" the fixed income research analyst says. MFS IM expects the German bond curve to remain the go-to safe haven among eurozone government bonds in the medium term. (emese.bartha@wsj.com)</p><p class=\"\">1008 ET - The euro has limited scope to recover even as hopes rise that the EU can avert threatened U.S. trade tariffs after President Trump postponed a levy on Canadian and Mexican imports, ING's Francesco Pesole says in a note. Trump's decision to delay tariffs on his U.S. neighbors could reflect domestic backlash over potential economic pain for U.S. consumers but the same isn't necessarily true for the EU, he says. Trump can afford to keep EU tariffs in place for a prolonged period, making the bloc feel some pain before striking a deal. \"With all this in mind, we are somewhat sceptical that the euro is bound for a major rally.\" The euro rises 0.2% to $1.0364. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009511:0/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009509:0",
            "title": "Economists Trim Mexico's 2025 Growth Outlook — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Economists polled in January by the Bank of Mexico lowered their economic growth estimate for this year to 1% from 1.1% in December, while inflation expectations were virtually unchanged at 3.83% and 3.74% for core CPI. GDP slowed to 1.5% in 2024 from 3.3% the previous year, according to statistics institute Inegi. While public security remained the top perceived obstacle to growth, the percentage of analysts citing foreign trade policy rose to 13% from 7% in the previous survey. On Monday, Mexico reached agreement with President Trump to hold off imposing 25% tariffs on Mexican goods for a month while Mexico takes action to curb migration and fentanyl trafficking. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009509:0/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204012283:0",
            "title": "Buffett's Berkshire Hathaway buys more Sirius XM stock as it continues to bounce",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tomi Kilgore</p><p class=\"\">Warren Buffett now owns more than 35% of Sirius XM shares, after spending $54 million in latest round of purchases</p><p class=\"\">Shares of Sirius XM Holdings Inc. climbed toward a two-month high Tuesday after Berkshire Hathaway Inc. disclosed that it boosted its stake in the satellite-radio company to more than 35%.</p><p class=\"\">In a Form 4 filing with the Securities and Exchange Commission, Warren Buffett's investment vehicle (BRK.B) (BRK.A) said that from Jan. 30 to Feb. 3, it spent $54 million to purchase 2,308,119 Sirius XM shares (SIRI) at a weighted average price of $23.38.</p><p class=\"\">Sirius XM's stock was up 1.1% in afternoon trading, to put it on track for its highest close since Dec. 12.</p><p class=\"\">Berkshire now owns 119.8 million shares, or 35.4% of the Sirius XM shares outstanding. That makes Berkshire by far the biggest shareholder, with Vanguard in second place at 6.6%, according to FactSet data.</p><p class=\"\">Buffett's investment vehicle started loading up on Sirius XM shares in 2024. On Sept. 10, the company became an independent public company with a simplified capital structure following the closing of q deal with Liberty Media.</p><p class=\"\">On Sept. 19, after a year-to-date plunge in the stock of 56.1%, Berkshire filed a Schedule 13G form to disclose that it owned 105.16 million Sirius XM shares, or 31% of the shares outstanding.</p><p class=\"\">Schedule 13G is used for the required disclosure when a security holder owns a stake of more than 5% in a company. Owners who file 13Gs tend to be more passive investors than those who file Schedule 13Ds, which include a section for the investor to disclose the purpose of the transaction.</p><p class=\"\">Since then, Berkshire has spent $350.76 million to buy 14.62 million shares, at a weighted average price of $23.99.</p><p class=\"\">The stock has gained 1% since Sept. 19 and 17.9% since closing at a 12-year low of $20.58 on Dec. 19. And it's trading 1.1% above the price Berkshire paid to buy the stock over the past four months.</p><p class=\"\">So far this year, the stock has gained 6.4%, while the S&amp;P 500 SPX has tacked on 2.5%. The stock had fallen for five straight years through 2024, tumbling 68.1% during that time.</p><p class=\"\">-Tomi Kilgore</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204012283:0/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2rG2C0:0",
            "title": "REVO ZERO Launches Crowdfunding Campaign to Bring Zero-Emissions Transportation to the Masses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HERNDON, Va., Feb.  04, 2025  (GLOBE NEWSWIRE) — REVO ZERO, an innovative leader in zero-emissions transportation, is thrilled to announce the launch of its crowdfunding campaign on Netcapital. This campaign offers supporters and investors an opportunity to play a direct role in advancing the zero-emissions revolution.</p><p class=\"\">“Our mission has always been to make hassle-free, zero-emissions transportation accessible to everyone,” said Ruben Creus, CEO of REVO ZERO. “We believe that it takes a crowd to start a <em>REVO</em>lution and we wanted to invite our loyal supporters to join us in shaping the future of sustainable mobility.”</p><p class=\"\">Through this campaign, anyone can invest in REVO ZERO for as little as $250 or as much as they want. Hosted on Netcapital, a trusted crowdfunding platform, this initiative is open under Regulation CF, allowing participation from both accredited and non-accredited investors.</p><p class=\"\">As an exciting benefit, supporters can apply their investment towards the pre-order of the Model ENERGY SUV, REVO ZERO’s flagship large luxury vehicle featuring a 700-mile range and a 7-minute refueling time. The Model ENERGY leverages cutting-edge pFC Technology, coupling a plug-in battery with a hydrogen fuel cell for unmatched range, refueling time, and sustainability. This groundbreaking innovation represents a major leap forward in zero-emissions mobility and brings the next generation of zero-emissions vehicles to the market.</p><p class=\"\">Martin Kay, CEO of Netcapital Inc., emphasized the benefits of the Regulation CF framework: “Regulation CF allows companies to access a new source of capital by offering securities to a diverse group of investors, including individual retail investors that are non-accredited. In addition to raising capital, Regulation CF campaigns can help raise awareness about your business and attract potential customers or partners. We look forward to working with REVO ZERO to build a community of supporters who are interested in helping REVO ZERO succeed.\"</p><p class=\"\">The crowdfunding campaign will remain open for a limited time, and supporters are encouraged to act quickly. For more information, or to invest, visit the official campaign page on Netcapital:</p><p class=\"\">https://netcapital.com/companies/revozero</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Join the REVOlution towards ZERO-emissions</strong></p><p class=\"\">REVO ZERO’s journey is just beginning. By investing today, you’re not only supporting a company—you’re becoming part of a mission to revolutionize transportation for a sustainable future.</p><p class=\"\">For press inquiries or additional information, please contact:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">media@revozero.com</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About REVO ZERO:</strong></p><p class=\"\">REVO ZERO is a pioneering company dedicated to creating convenient, hassle-free zero-emissions transportation solutions. Committed to sustainability and innovation, REVO ZERO is leading the way toward a greener future.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2rG2C0:0-revo-zero-launches-crowdfunding-campaign-to-bring-zero-emissions-transportation-to-the-masses/",
            "pub_date": "2025-02-05 02:53:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV138:0",
            "title": "Urals diffs stable; Russia increases oil lifting plan for western ports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Urals crude differentials were steady on Tuesday while Russia's provisional February loading plan for western ports was revised up by 19% because of lower output from refiners, traders said and Reuters calculations showed.</p><p class=\"\">The revision to 1.9 million barrels per day (bpd) from the provisional plan of 1.6 million bpd follows Ukrainian drone attacks on refineries that have led to reduced processing, leaving more crude for export, the traders said.</p><p class=\"\">PLATTS WINDOW</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">No bids or offers were shown for Urals, Azeri BTC and CPC Blend in the Platts window on Tuesday.</p></li></ul><p class=\"\">NEWS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Kazakhstan will do whatever is necessary in 2025 and 2026 to fulfil its obligations under the OPEC+ agreement and compensate for oil overproduction in 2024, Kazakhstan's energy ministry said on Tuesday.</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV138:0-urals-diffs-stable-russia-increases-oil-lifting-plan-for-western-ports/",
            "pub_date": "2025-02-05 02:54:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1C6:0",
            "title": "US energy firms, Lancaster Colony, Xylem",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Eikon search string for individual stock moves:STXBZ</li></ul></span></div><span><p class=\"\">Wall Street was on track to a cautious opening on Tuesday as investor appetite for risk waned after China retaliated against new trade restrictions announced by U.S. President Donald Trump with counter tariffs. </p><p class=\"\">At  13:30 EST, the Dow Jones Industrial Average  was up 0.17% at 44,497.79. The S&amp;P 500  was up 0.60% at 6,030.77, and the Nasdaq Composite  was up 1.15% at 19,614.70.</p><p class=\"\">The top three S&amp;P 500 (.PG.INX) percentage gainers:</p><p class=\"\">** Palantir Technologies Inc , up 22.4%</p><p class=\"\">** Super Micro Computer Inc , up 7.4%</p><p class=\"\">** Marathon Petroleum Corp , up 6.7%</p><p class=\"\">The top three S&amp;P 500 (.PL.INX) percentage losers:</p><p class=\"\">** Estee Lauder Companies Inc , down 15.2%</p><p class=\"\">** PayPal Holdings Inc , down 11.7%</p><p class=\"\">** Merck &amp; Co Inc , down 10.3%</p><p class=\"\">The top three NYSE (.PG.N) percentage gainers:</p><p class=\"\">** Beyond Inc , up 26.9%</p><p class=\"\">** 3D Systems Corp , up 18.3%</p><p class=\"\">** Butterfly Network Inc , up 17.2%</p><p class=\"\">The top three NYSE (.PL.N) percentage losers:</p><p class=\"\">** Atkore Inc , down 21.2%</p><p class=\"\">** Estee Lauder Companies Inc , down 15.2%</p><p class=\"\">** Merck &amp; Co Inc , down 10.3%</p><p class=\"\">The top three Nasdaq (.PG.O) percentage gainers:</p><p class=\"\">** Captivision Inc , up 157.4%</p><p class=\"\">** Nuvve Holding Corp , up 78.9%</p><p class=\"\">** Quantum BioPharma Ltd , up 70.8%</p><p class=\"\">The top three Nasdaq (.PL.O) percentage losers:</p><p class=\"\">** Omega Therapeutics Inc , down 58.3%</p><p class=\"\">** Cloudastructure Inc , down 33.7%</p><p class=\"\">** Universe Pharmaceuticals Inc , down 33.6%</p><p class=\"\"> ** Illumina Inc :</p><p class=\"\">BUZZ - PVH slide as China retaliates after US tariffs kick in </p><p class=\"\"> ** Merck &amp; Co Inc :</p><p class=\"\">BUZZ - Earnings, revenue expected to rise in Q4 </p><p class=\"\"> ** Sirius XM Holdings Inc :</p><p class=\"\">BUZZ - Gains as Buffett's Berkshire buys more shares </p><p class=\"\"> ** Super Micro Computer Inc :</p><p class=\"\">BUZZ - To issue Q2 update next week; stock rises </p><p class=\"\"> ** Palantir Technologies Inc :</p><p class=\"\">BUZZ - Shares surge on strong forecasts; MS upgrades to 'equal-weight' </p><p class=\"\"> ** Coinbase Global Inc :</p><p class=\"\"> ** Riot Platforms Inc :</p><p class=\"\"> ** Marathon Digital Inc :</p><p class=\"\"> ** Bit Digital Inc :</p><p class=\"\">BUZZ - Crypto stocks fall tracking bitcoin weakness </p><p class=\"\"> ** CNH Industrial N.V :</p><p class=\"\">BUZZ - Down after smaller-than-expected FY profit forecast, Q4 profit miss </p><p class=\"\"> ** Apollo Global Management Inc :</p><p class=\"\">BUZZ - Rises after Q4 profit beats estimates </p><p class=\"\"> ** Marathon Petroleum Corp :</p><p class=\"\">BUZZ - Rises on Q4 profit beat </p><p class=\"\"> ** PepsiCo Inc :</p><p class=\"\">BUZZ - Down after weak annual profit forecast, Q4 revenue miss </p><p class=\"\"> ** Spotify Inc :</p><p class=\"\">BUZZ - Rises on upbeat Q1 profit estimates </p><p class=\"\"> ** Pfizer Inc :</p><p class=\"\">BUZZ - Rises on better-than-expected quarterly results </p><p class=\"\"> ** DraftKings Inc :</p><p class=\"\">BUZZ - TD Cowen cuts DraftKings PT on taxes, potential gambling losses </p><p class=\"\"> ** Archer Daniels Midland Co :</p><p class=\"\">BUZZ - Falls on Q4 profit miss </p><p class=\"\"> ** Jacobs Solutions Inc :</p><p class=\"\">BUZZ - Beats quarterly profit estimates, shares rise </p><p class=\"\"> ** PayPal Holdings Inc :</p><p class=\"\">BUZZ - Falls as Q4 margin contraction clouds upbeat 2025 profit forecast </p><p class=\"\"> ** Regeneron Pharmaceuticals Inc :</p><p class=\"\">BUZZ - Rises on new dividend program, Q4 results beat </p><p class=\"\"> ** Estee Lauder Companies Inc :</p><p class=\"\">BUZZ - Falls on gloomy quarterly profit forecast; announces job cuts </p><p class=\"\"> ** BBB Foods Inc :</p><p class=\"\">BUZZ - Falls after secondary offering unveiled </p><p class=\"\"> ** Brenmiller Energy Ltd :</p><p class=\"\">BUZZ - To launch thermal energy storage system; shares up </p><p class=\"\"> ** Intel Corp :</p><p class=\"\">BUZZ - Falls after report says China mulls formal probe into chipmaker </p><p class=\"\"> ** Cummins Inc :</p><p class=\"\">BUZZ - Rises after Q4 results beat </p><p class=\"\"> ** Crown Holdings Inc :</p><p class=\"\">BUZZ - Analysts say Trump tariffs could disrupt pulp, packaging sector </p><p class=\"\"> ** Hubbell Inc :</p><p class=\"\">BUZZ - Falls on quarterly sales miss </p><p class=\"\"> ** Newmont Corp : </p><p class=\"\"> ** Barrick Gold Corp : </p><p class=\"\"> ** Gold Fields Ltd :</p><p class=\"\"> ** Sibanye Stillwater Ltd :</p><p class=\"\">BUZZ - Gold miners up as bullion prices hit record high </p><p class=\"\"> ** Synaptics Inc :</p><p class=\"\">BUZZ - Shares tumble after CEO departs to Lumentum: LITE stock up </p><p class=\"\"> ** Ametek Inc :</p><p class=\"\">BUZZ - Shares fall after forecasting annual profit below estimates </p><p class=\"\"> ** Ball Corp :</p><p class=\"\">BUZZ - Falls after missing quarterly sales expectations </p><p class=\"\"> ** Netflix Inc :</p><p class=\"\">BUZZ - Crosses $1,000 mark for the first time </p><p class=\"\">** NextDecade Corp :</p><p class=\"\">** Cheniere Energy Inc :</p><p class=\"\">** New Fortress Energy Inc :</p><p class=\"\">** United States Natural Gas Fund LP :</p><p class=\"\">BUZZ - US natgas firms fall on lower LNG feedgas, tariff delays </p><p class=\"\"> ** Supernus Pharmaceuticals Inc :</p><p class=\"\">BUZZ - Rises after FDA approves its drug-device combination for Parkinson's disease </p><p class=\"\"> ** Centene Corp :</p><p class=\"\">BUZZ - Falls on higher Q4 Medicaid costs </p><p class=\"\">** Alibaba.com Ltd :</p><p class=\"\">** JD.com Inc :</p><p class=\"\">** Pinduoduo Inc :</p><p class=\"\">** Bilibili Inc :</p><p class=\"\">BUZZ - China ADRs recover despite tit-for-tat tariffs </p><p class=\"\"> ** GH Research PLC :</p><p class=\"\">BUZZ - Slides on planned stock sale to fund depression treatments </p><p class=\"\"> ** Moderna Inc :</p><p class=\"\"> ** BioNTech SE :</p><p class=\"\"> ** Novavax Inc :</p><p class=\"\">BUZZ - Vaccine makers fall as Kennedy moves closer to health secretary job </p><p class=\"\"> ** Advanced Micro Devices Inc :</p><p class=\"\">BUZZ - Shares up; Q4 rev, EPS seen rising </p><p class=\"\"> ** J &amp; J Snack Foods Corp :</p><p class=\"\">BUZZ - Down after first-quarter profit miss </p><p class=\"\"> ** Madison Square Garden Sports Corp :</p><p class=\"\">BUZZ - Falls after Q2 profit miss </p><p class=\"\"> ** Alphabet Inc :</p><p class=\"\">BUZZ - Shares hit fresh record as Q4 EPS, rev seen rising </p><p class=\"\"> ** PJT Partners Inc :</p><p class=\"\">BUZZ - Shares hit record high after Q4 results beat estimates </p><p class=\"\">** Exxon Mobil Corp : </p><p class=\"\">** Chevron Corp :</p><p class=\"\">** Phillips 66 :</p><p class=\"\">** Valero Energy Corp :</p><p class=\"\">BUZZ - US energy firms rise as Trump set to reimpose 'maximum pressure' on Iran </p><p class=\"\"> ** Lancaster Colony Corp :</p><p class=\"\">BUZZ - Rises on Q2 sales beat </p><p class=\"\"> ** Xylem Inc :</p><p class=\"\">BUZZ - Up after upbeat Q4 results </p><p class=\"\"> The 11 major S&amp;P 500 sectors:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Index RIC</p></td><td><p class=\"\">Index name</p></td><td><p class=\"\">Percent change %</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500</p></td><td><p class=\"\">0.6 </p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Information Technology</p></td><td><p class=\"\">1.3</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Utilities</p></td><td><p class=\"\">-0.72</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Consumer Discretionary</p></td><td><p class=\"\">0.97</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Materials</p></td><td><p class=\"\">0.32</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Industrials</p></td><td><p class=\"\">0.18</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Communication Services (Sector)</p></td><td><p class=\"\">1.24</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Financials</p></td><td><p class=\"\">-0.14</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Real Estate</p></td><td><p class=\"\">-0.08</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Health Care</p></td><td><p class=\"\">-0.41</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Consumer Staples</p></td><td><p class=\"\">-0.52</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Energy</p></td><td><p class=\"\">1.95</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1C6:0-us-energy-firms-lancaster-colony-xylem/",
            "pub_date": "2025-02-05 02:46:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009461:0",
            "title": "Ralph Lauren Is Maintained at Buy by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:47 GMT) </strong>Ralph Lauren Price Target Raised to $268.00/Share From $258.00 by TD Cowen</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009461:0/",
            "pub_date": "2025-02-05 02:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009460:0",
            "title": "China Tariffs More a Bump Than a Roadblock for Tractor Suppliers — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Bob Tita</p><p class=\"\">China's retaliatory 10% tariff on imports of U.S.-made tractors, crop harvesters and other farm equipment is likely to have a minimal effect on U.S. equipment makers, analysts say.</p><p class=\"\">Farm equipment exported to China amounts to about $500 million a year, according to a Jefferies analysis of Census Bureau data. The firm estimated U.S.-made machinery exported to China accounts for about 1% of Deere &amp; Co.'s sales, and likely includes road paving and construction equipment as well. Deere's total equipment sales last year were nearly $45 billion.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009460:0/",
            "pub_date": "2025-02-05 02:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:5c8f59aaf094b:0",
            "title": "XRP bearish divergence raises chance of $2 retest — Here’s what bulls must do",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">XRP’s price registered a multimonth range low at $1.78 during its recent correction before swiftly recovering above $2.50 on the daily chart. <span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:592.4723247232472px;max-width:1200px;aspect-ratio:2.0254110612855007\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-9154645892dfccbc9ca8703e2775ee1f-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-9154645892dfccbc9ca8703e2775ee1f-resized.jpeg\" style=\"background-color:#f9f8f9\"/></picture></div></figure></span></p><p class=\"\">However, the altcoin faces a critical test to invalidate a key bearish signal, possibly turning the tides in the seller’s favor. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP shows bearish divergence on the daily and weekly chart</strong></p><p class=\"\">XRP’s parabolic rally over the past three months took its value from $0.50 to its all-time high range at $3.40, i.e., a 580% rise. The altcoin disrupted multi-year resistance levels, and in January, XRP recorded its highest monthly close at $3.03. </p><p class=\"\">The recent flash crash due to a non-crypto political event implied that buyers’ liquidity is slowly evaporating on the upside. With the markets riddled with volatility, XRP’s long-term chart painted the formation of a bearish divergence on both the daily and weekly charts. <span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:591.1634756995581px;max-width:1200px;aspect-ratio:2.029895366218236\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-aa5bd6f757d5eed6ebe10a08433ef0a1-resized.webp\" type=\"images/webp\"/><img alt=\"Ripple, XRP, Markets, Price Analysis, Market Analysis, Altcoin Watch\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-aa5bd6f757d5eed6ebe10a08433ef0a1-resized.jpeg\" style=\"background-color:#f6f6f7\"/></picture></div></figure></span></p><p class=\"\">As illustrated in the chart, XRP’s price has formed a higher high over the recent weeks, whereas its relative strength index (RSI) has formed a lower high. The RSI indicator on both charts also trended down from an overbought region, which means buyers are slowing down and losing momentum. </p><p class=\"\">While XRP has managed to invalidate previous divergences formed on the lower time frames (LTF), a bearish divergence on the 1-day and weekly chart raises concerns since high-time frame (HTF) charts determine a more dominant trend. </p><p class=\"\">The potential consequence of these bearish divergences is another move below $2, which is a 23% drop from its current value. The probability has also increased since the altcoin formed a new low at $1.78, where new liquidity pockets will be formed. </p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Related: Why is XRP price up today?</strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Will XRP invalidate its bearish thesis?</strong></p><p class=\"\">A fundamental part of technical analysis is that each signal or pattern has an invalidation. Likewise, XRP’s bearish divergence on the daily and weekly chart could also be dismissed if the altcoin can retain a position above $2.90 on the daily chart. <span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:592.4723247232472px;max-width:1200px;aspect-ratio:2.0254110612855007\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-2e23430ede5944f59ddf284a8766df1d-resized.webp\" type=\"images/webp\"/><img alt=\"Ripple, XRP, Markets, Price Analysis, Market Analysis, Altcoin Watch\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-2e23430ede5944f59ddf284a8766df1d-resized.jpeg\" style=\"background-color:#f9f8f9\"/></picture></div></figure></span></p><p class=\"\">The $2.90 level was XRP’s previous higher high formed in December, which also acted as a support level after XRP re-tested its previous all-time high at $3.40. Binance and Coinbase spot activity was also largely concentrated around $2.90, which sent the altcoin above $3 in mid-January. </p><p class=\"\">A recovery above $2.90 would re-establish a bullish market structure, diminishing the effects of XRP’s recent bearish lows. However, time is of the essence in these conditions, as a continued lack of clear directional bias favors the bears since sellers were the market movers for the last major price move. </p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Related: Bitcoin bull trap? Watch these BTC price levels as BTC price risks $90K retrace</strong></em></p><p class=\"\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:5c8f59aaf094b:0-xrp-bearish-divergence-raises-chance-of-2-retest-here-s-what-bulls-must-do/",
            "pub_date": "2025-02-05 02:48:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009476:0",
            "title": "UNITED CORPORATIONS LIMITED ANNOUNCES DIVIDENDS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UNITED CORPORATIONS LIMITED ANNOUNCES DIVIDENDS</p><p class=\"\">Canada NewsWire</p><p class=\"\">TORONTO, Feb. 4, 2025</p><p class=\"\">TORONTO, Feb. 4, 2025 /CNW/ - The Board of Directors of United Corporations Limited     today declared the following cash dividends:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Class                      Record Date   Payable Date   Amount of Dividend <br/>First Preferred Shares     May 5, 2025   May 15, 2025               $0.375 <br/>Second Preferred Shares,   May 5, 2025   May 15, 2025               $0.375 <br/> 1959 Series <br/>Second Preferred Shares,   May 5, 2025   May 15, 2025               $0.375 <br/> 1963 Series <br/>Common Shares              May 5, 2025   May 15, 2025                $0.30 <br/> </pre><p class=\"\">United Corporations Limited advises that the above referenced dividends are eligible dividends for the purposes of the Income Tax Act (Canada) and any similar provincial legislation.</p><p class=\"\">SOURCE United Corporations Limited</p><p class=\"\">View original content: http://www.newswire.ca/en/releases/archive/February2025/04/c8256.html</p><p class=\"\">/CONTACT:</p><p class=\"\">For further information please contact: Frank J. Glosnek, Treasurer, Telephone: (416) 947-2578, Fax: (416) 362-2592, www.ucorp.ca</p><p class=\"\">Copyright CNW Group 2025</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009476:0/",
            "pub_date": "2025-02-05 02:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008163:0",
            "title": "Drug Stocks Stumble as RFK Jr.'s HHS Nomination Moves Forward to a Senate Vote — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis</p><p class=\"\">The Senate's finance committee has cleared the way for Robert F. Kennedy Jr.'s health secretary nomination to head to a full Senate vote, pushing him a major step closer to confirmation.</p><p class=\"\">The committee voted Tuesday to favorably refer Trump's Health and Human Services secretary nominee — a strident critic of vaccines and a skeptic of their vaccine — to the Senate. Drug and food stocks stumbled after the panel's vote, as the once unthinkable notion of Kennedy leading the federal government's public health bureaucracy moved closer to reality.</p><p class=\"\">Shares of Pfizer, a major vaccine maker, fell from $26.25 ahead of the vote to $25.66 immediately after, a 2.2% drop. The stock is now down on the day, though releasing earnings results Tuesday morning that beat expectations.</p><p class=\"\">Shares of the vaccine maker Moderna tumbled 9% following the vote before recovering, and are are now down 3.9% on the day.</p><p class=\"\">The S&amp;P 500 Pharmaceuticals Industry index, which tracks drug stocks in the S&amp;P 500, fell roughly 1% following the vote, and the SPDR S&amp;P Biotech ETF, which tracks biotech stocks, fell 1.5%.</p><p class=\"\">Food stocks also dropped, and the S&amp;P Food and Beverage Select Industry index was down roughly 0.6% following the vote.</p><p class=\"\">A powerful Republican, Sen. Bill Cassidy (R., La.), had directed challenging lines of questioning at Kennedy in hearings last week, leading to widespread speculation that he might eventually oppose the nominee's approval.</p><p class=\"\">On Tuesday, however, Cassidy voted to favorably approve Kennedy's nomination out of committee. The vote was split along party lines, with Sen. Bernie Sanders of Vermont, an independent, voting with the Democrats.</p><p class=\"\">Cassidy could still vote against Kennedy when the full Senate votes. He arrived late to Tuesday's committee meeting, and left without making any comments on his vote. If four Republicans vote against Kennedy on the Senate floor, his nomination would fail.</p><p class=\"\">The vote of the full Senate on the nomination has not yet been scheduled.</p><p class=\"\">Kennedy's bid to lead the U.S. Department of Health and Human Services — which has the largest budget of any federal agency — has roiled Washington more than virtually any of President Donald Trump's top nominees thus far.</p><p class=\"\">Kennedy's stance toward vaccines has been a key focus for lawmakers. In a hearing last week, under questioning by Cassidy, Kennedy declined to assert that measles and hepatitis b vaccines don't cause autism.</p><p class=\"\">\"That's kind of a yes or no question,\" Cassidy said.</p><p class=\"\">\"If the data is there, I will absolutely do that,\" Kennedy said.</p><p class=\"\">\"The data has been there for a long time,\" Cassidy said.</p><p class=\"\">Scientific consensus currently holds that vaccines  do not cause autism.</p><p class=\"\">Democrats railed against Kennedy in opening statements delivered ahead of the committee vote Tuesday morning.</p><p class=\"\">\"The question in front of us this morning is pretty simple: Do Senators want their legacy to include disregarding basic health science and instead of elevating conspiracy theorists?,\" said Sen. Ron Wyden, the Oregon Democrat who is the ranking member on the finance committee.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008163:0/",
            "pub_date": "2025-02-05 02:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309153:0",
            "title": "Sector Update: Tech Stocks Gain Tuesday Afternoon",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tech stocks were higher Tuesday afternoon, with the Technology Select Sector SPDR Fund (XLK) climbing 1.3% and the SPDR S&amp;P Semiconductor ETF (XSD) rising 1.2%. </p><p class=\"\">The Philadelphia Semiconductor index climbed 1%. </p><p class=\"\">In corporate news, Palantir  shares jumped more than 22% after the company reported late Monday higher Q4 adjusted earnings and revenue. Goldman Sachs adjusted Palantir's price target to $80 from $41. </p><p class=\"\">China's State Administration for Market Regulation opened an antitrust probe into Alphabet's  Google over suspected violations of the country's anti-monopoly law, according to media reports. Alphabet shares were rising 2.1%. </p><p class=\"\">NXP Semiconductors  issued a downbeat Q1 outlook at the midpoint after reporting better-than-expected results in the prior three-month period. Its shares were down 1.6% recently.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309153:0-sector-update-tech-stocks-gain-tuesday-afternoon/",
            "pub_date": "2025-02-05 02:48:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}