{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Tnw5zVHQ3:0",
            "title": "A chance encounter in Wyoming unearths a uranium treasure",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\">February 5, 2025 – TheNewswire - Pete Smith, who had just optioned a relatively unknownuranium project at Wyoming’s Copper Mountain, was driving throughrural cowboy country, when he met a rancher on the side of theroad.</p><p class=\"\">They shook hands and Pete updated the rancher that heis working on uncovering the magic of Copper Mountain by de-riskingthe asset. At the time, little was known about the uranium projectother than that it was a past producer.</p><p class=\"\">“Come in, have a cup of coffee,” said the rancherwith a smile. “I have a box of data and we’ll see if we can’tdig up some of those papers, maybe it’ll be of someinterest.”</p><p class=\"\">They walked through the house, down some steps into thebasement, and pulled out an old box. Inside were, indeed, some amazingthings.</p><p class=\"\">The box was treasure trove of information: not just anyold papers, but historicmining data from Union Pacific Railroad’s extensive work at theCopper Mountain project in the 1970s.</p><p class=\"\">This data revealed potentially much larger thanestimated reserves and a rich history of uranium mining,including:</p><p class=\"\">Rocky Mountain Energy Corporation (“RMEC” – asubsidiary of Union Pacific Railway) planned a large-scale uraniummine with California Edison and estimated resources of between 15.7million pounds – 30.1 million pounds eU3O8 at Copper Mountain forthat mine, with potential for much more</p><p class=\"\">RMEC the resource potential of known deposits andprospects at Copper Mountain to be over 65 million pounds eU3O8</p><p class=\"\">an internal memo for Neutron Energy (now part ofencore) speculated that Copper Mountain has potential of “severalhundred million pounds”</p><p class=\"\">a government program called NURE speculated that theentire Copper Mountain district has 600 million pound potential</p><p class=\"\">evidence of high-grade uranium areas and the potentialfor in-situ recovery (ISR) methods</p><p class=\"\">significant historical production in the 1960s and70s</p><p class=\"\">substantial investment by Union Pacific, who had spentUS$74 million (in today’s dollars) in the 1970s, to developed alarge-scale mine plan with six open pits and a leach pad, ready forproduction</p><p class=\"\">These historical estimates are largely within thecurrent claim boundaries of the “Copper Mountain Project”, inwhich Myriad Uranium  (OTCQB: MYRUF)(FSE: C3Q), holds an earnable 75% interest(50% already earned) — making it potentially one of the largest uranium projects in Wyoming.</p><p class=\"\">Myriad Uranium</p><p class=\"\">With the new discovery, Thomas Lamb, CEO of MyriadUranium, moved quickly to advance the project at CopperMountain.</p><p class=\"\">“We got lucky. And kudos to Rush’s CEO PeteSmith… This data find represents an enormous head-start for Myriadat Copper Mountain, and it’s just the beginning: we expect a greatdeal of additional historical data to be located. Not only do we nowbenefit from tens of millions of dollars in past work by many of theleading uranium geologists at the time, we also see that CopperMountain was worthy of investment in a full-scale mining operation”— Thomas Lamb, CEO, MyriadUranium</p><p class=\"\">Aggressive exploration: Myriad has undertaken a maiden drill campaign at Copper Mountain, which yielded “significant highgrade” results, verifying the historical data while alsoencountering new mineralisation in deeper zones, suggesting a largerresource potential than previously understood.</p><p class=\"\">Expansion of projectarea: guided by the historical data, Myriad hassignificantly expanded the project’s footprint, from around 4,000 acres to over9,320 acres, to encompass areas with high mineralisation potential andto “lock up” mineralised extensions, historical resources, and keytargets.</p><p class=\"\">Data digitisation: Myriad has digitised thehistoric data to build 3D models of the resource, to refineunderstanding of the deposit, as well as acquiring more historicaldrill logs to bring resource estimates up to current standards.</p><p class=\"\">Technical team:Myriad has assembled a strong technical team withexperience in uranium exploration and development. This includesexperts with prior experience at industry leaders like Orano andGlobal Atomic, as well as deep in-situ recovery (ISR)expertise.</p><p class=\"\">Fundraising:Myriad has a very successful year in 2024, bringing in ~$9 million of sophisticated capital.They currently have ~$3m in the bank. The funds are earmarked for anumber of initiatives including project-scale geophysics as they looktowards a larger drill campaign this year.</p><p class=\"\">Domestic uranium supply for USnational security</p><p class=\"\">One of the main drivers of the project’s developmentis to help secure US uraniumsupply. According to the US TreasurySecretary, Scott Bessent, America is in an “energy race” with China as they compete to power the expected demandsof data centers to power artificial intelligence and on-shoring ofmanufacturing. And, with the US as the world’s largest nuclear energyproducer, uranium is an essential piece ofthe US energy puzzle to power the plan to triple the capacity ofAmerica’s nuclear fleet.</p><p class=\"\">(Our analysis on the challenges ofsourcing uranium outside of North America: Where will newuranium supply come from?)</p><p class=\"\">The US government is also actively supporting therevival of domestic uranium production, with initiatives aimed atrepatriating uranium production and the entire fuel cycle back to theUnited States. Domestic US production of U3O8 declined significantly in the 1980s as production incentives and subsidies ended,trade barriers were removed, and uranium prices fell — by 2022,95% of the uraniumpurchased by US nuclear power plantoperators originated in other countries. The US has since announcedplans to revive domestic uranium production and <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/energy/ban-russian-uranium-aims-revive-american-supply-2024-06-04/\" rel=\"nofollow\" target=\"_blank\">move the fuel cycle back to theWest</a>. The return of Donald Trump isexpected tocatalyze the development of America’s domestic nuclear and uraniumsector.</p><p class=\"\">Wyoming</p><p class=\"\">The first uranium mines in Wyoming state startedoperating in 1951, and the state has been the leading producer of uranium in the USsince 1995 — and holds the largest knowneconomic uranium ore reserves in the US.</p><p class=\"\">In 2023, the state hosts 4 out of America’s 5operating uranium mines.</p><p class=\"\">This history means the state has the experience andunderstanding to support uranium mining. Now Wyoming’s uraniumindustry is experiencing a resurgence, driven by geopolitics,technology and demand for nuclear energy.</p><p class=\"\">And, Myriad Uranium’s Copper Mountain project islocated in central Wyoming, with good infrastructure links.</p><p class=\"\">Conclusion</p><p class=\"\">The unexpected discovery of historic mining data hasunearthed a potential treasure, not just for Myriad, but for the USand its strategy to achieve “energy dominance” the AI arms race with China.</p><p class=\"\">Now it’s time to dig up the real treasure.</p><p class=\"\">For further information:</p><p class=\"\">Visit Myriad Uranium’s website </p><p class=\"\">Read full story: A chance encounter in Wyoming unearthsa uranium treasure</p><p class=\"\">Disclaimer</p><p class=\"\">The Oregon Group maintains full editorial control overall content published on this website. While sponsored and advertisedplacements may be featured, the content remains the sole opinion ofThe Oregon Group. The author may receive compensation or remunerationfor providing content, but all statements and expressions are madeindependently and are not influenced by sponsors or advertisers. Fromtime to time, The Oregon Group and its directors, officers, partners,employees, authors, or members of their families, as well as personswho are interviewed for articles on this website, may have a long orshort position in securities or commodities mentioned and may makepurchases and/or sales of those securities or commodities in the openmarket or otherwise. By accessing and using this website, readers arecautioned to assume that each of the foregoing persons may have afinancial interest in all companies and sectors mentioned on thiswebsite. Any projections, market outlooks or estimates herein areforward looking statements and are inherently unreliable., and anysuch statements are based upon certain assumptions and should not beconstrued to be indicative of the actual events that will occur. Other events that were not taken into account may occur and maysignificantly affect the returns or performance of the securities orcommodities discussed herein. The information provided herein is basedon matters as they exist as of the date of preparation and not as ofany future date, and The Oregon Group undertakes no obligation tocorrect, update or revise the information in this document or tootherwise provide any additional material. The information provided onthis website is for informational purposes only and is not, directlyor indirectly, an offer, solicitation of an offer and/or arecommendation to buy or sell any security or commodity, and theinformation provided on this website should not be construed asany advice or an opinion as to the price atwhich the securities of any company or commodity may trade at anytime. The Oregon Group is a publisher of financial information, not aninvestment advisor.  We do not provide personalized or individualizedinvestment advice or information that is tailored to the needs of anyparticular recipient, and the information provided on this website isnot and should not be construed as personal, financial, investment orprofessional advice. Readers are cautioned to always do their ownresearch and review of publicly available information and to consulttheir professional and registered advisors before purchasing orselling any securities or commodities and should not rely on theinformation contained herein. Neither The Oregon Group nor any of itsaffiliates accepts any liability whatsoever for any direct orconsequential loss howsoever arising, directly or indirectly, from anyuse of the information contained herein. By using the Site or anyaffiliated social media account, you are indicating your consent andagreement to this disclaimer and our terms of use. Unauthorizedreproduction of this newsletter or its contents by photocopy,facsimile or any other means is illegal and punishable by law.</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Tnw5zVHQ3:0-a-chance-encounter-in-wyoming-unearths-a-uranium-treasure/",
            "pub_date": "2025-02-05 21:07:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446757:0",
            "title": "North Macedonia Slash Borrowing Costs Again",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The National Bank of the Republic of North Macedonia cut the interest rate on treasury bills by 20bps to 5.35% during its February 2025 meeting, citing favorable trends in inflation and foreign exchange reserves, as well as heightened risks from the external environment.</p><p class=\"\">Policymakers voiced concerns about a potential escalation of the US-China trade war, warning it could fuel global inflationary pressures and hamper economic growth.</p><p class=\"\">Domestically, officials highlighted risks associated with the pace and execution of infrastructure projects.</p><p class=\"\">The central bank also emphasized that any future policy moves will be measured, with prudent macroeconomic management remaining a priority.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446757:0-north-macedonia-slash-borrowing-costs-again/",
            "pub_date": "2025-02-05 21:07:16",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309889:0",
            "title": "UBS Adjusts Price Target on Citizens Financial Group to $53 From $50, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Citizens Financial Group  has an average rating of overweight and mean price target of $53.50, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309889:0/",
            "pub_date": "2025-02-05 21:07:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_CSEdRvB:0",
            "title": "Jyske Realkredit A/S - Admission for trading and official listing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bond Market information</p><p class=\"\">Jyske Realkredit A/S - Admission for trading and official listing</p><p class=\"\">It has been decided to admit the following mortage bond for trading andofficial listing with effect from 7 February 2025:</p><p class=\"\">Udsteder / issuer                              Jyske Realkredit A/S   CFI kode / CFI                                 DBFGFB                 Første dato for handel / First day of trading  07-02-2025             ISIN                                           DK0009416976           Instrument name/ticker                         2,5 GCB 321EEUR JA29 RFUdstedelsesvaluta / Currency, issuance         EUR                    Årlig nominel rente / Nominal interest rate    2,5                    Udløbsdato / Maturity date                     01-01-2029 Terminer pr. år / Payments per year            1</p><p class=\"\">For further information please contact Nasdaq Copenhagen A/S, Surveillance,tel. +45 33 93 33 66https://view.news.eu.nasdaq.com/view?id=bacce4767c4d6924029ea1cb0805ffdd7&amp;lang=en&amp;src=omxlink</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_CSEdRvB:0-jyske-realkredit-a-s-admission-for-trading-and-official-listing/",
            "pub_date": "2025-02-05 21:07:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005798:0",
            "title": "PepsiCo Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:08 GMT) </strong>PepsiCo Price Target Cut to $168.00/Share From $185.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005798:0/",
            "pub_date": "2025-02-05 21:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005796:0",
            "title": "NJ Resources Is Maintained at Neutral by Guggenheim",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:08 GMT) </strong>NJ Resources Price Target Raised to $54.00/Share From $53.00 by Guggenheim</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005796:0/",
            "pub_date": "2025-02-05 21:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309885:0",
            "title": "Illinois Tool Works' Q4 Earnings Rise, Revenue Falls; Issues 2025 EPS Outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Illinois Tool Works  reported Q4 earnings Wednesday of $2.54 per diluted share, up from $2.38 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $2.49. </p><p class=\"\">Operating revenue for the quarter ended Dec. 31 was $3.93 billion, down from $3.98 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $3.98 billion. </p><p class=\"\">For 2025, the company said it expects EPS in the range of $10.15 to $10.55. Analysts polled by FactSet expect $10.59. </p><p class=\"\">Shares of Illinois Tool were up 1.8% in recent premarket activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309885:0/",
            "pub_date": "2025-02-05 21:08:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0Y2:0",
            "title": "Kansai Nerolac Paints Q3 Consol Net Profit 6.81 Billion Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kansai Nerolac Paints Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">KANSAI NEROLAC PAINTS Q3 CONSOL NET PROFIT 6.81 BILLION RUPEES; IBES EST. 1.4 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">KANSAI NEROLAC PAINTS Q3 CONSOL REVENUE FROM OPERATIONS 19.22 BILLION RUPEES; IBES EST. 19.23 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">KANSAI NEROLAC PAINTS -  Q3 RESULTS HAVE ONE TIME GAIN OF 6.3 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">KANSAI NEROLAC PAINTS -  PRAVIN D. CHAUDHARI APPOINTED AS MANAGING DIRECTOR, FOR 3 YEARS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0Y2:0-kansai-nerolac-paints-q3-consol-net-profit-6-81-billion-rupees/",
            "pub_date": "2025-02-05 21:08:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464046:0",
            "title": "NRC Group Secures SEK83 Million Rail Upgrade Contract in Sweden",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Norway-based NRC Group  secured a contract worth 83 million kronor from the Swedish Transport Administration to upgrade the railway line between Borlänge and Falun in Sweden. </p><p class=\"\">The work under the contract will start in February and include track, electro, signal/telecom, and groundwork rail services, with completion targeted for July 2026, the Norwegian infrastructure company said Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464046:0/",
            "pub_date": "2025-02-05 21:09:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446758:0",
            "title": "Brazilian Services Activity Contracts the Most Since April 2021",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Brazil Services PMI fell to 47.6 in January 2025 from 51.6 in December, marking the first contraction in the service sector since September 2023 and the sharpest decline since April 2021.</p><p class=\"\">New business intakes declined amid weakening demand, ending a 16-month expansion streak.</p><p class=\"\">Transport, Information, and Communication led output and sales gains, while Finance &amp; Insurance saw declines.</p><p class=\"\">Input costs surged at the fastest rate in two-and-a-half years, fueled by relative US dollar strength, higher international prices, and an inflated domestic market, pushing selling price inflation to its highest since July 2022.</p><p class=\"\">Despite rising costs and subdued business confidence, firms marginally increased hiring for a third consecutive month.</p><p class=\"\">Optimism about 2025 improved from December’s 43-month low, with some businesses expecting a rebound due to better demand trends and economic conditions.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446758:0-brazilian-services-activity-contracts-the-most-since-april-2021/",
            "pub_date": "2025-02-05 21:09:34",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309868:0",
            "title": "AZZ Issues Fiscal 2025, 2026 Adjusted Earnings, Revenue Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AZZ  said Wednesday it expects fiscal 2025 adjusted earnings of $5.00 to $5.30 per diluted share on sales of $1.55 billion to $1.60 billion. </p><p class=\"\">Analysts surveyed by FactSet expect non-GAAP EPS of $5.20 on sales of $1.60 billion. </p><p class=\"\">For fiscal year 2026, the company expects adjusted diluted EPS of $5.50 to $6.10 per diluted share on sales of $1.63 billion to $1.73 billion. </p><p class=\"\">Analysts surveyed by FactSet expect non-GAAP EPS of $5.82 on sales of $1.68 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309868:0/",
            "pub_date": "2025-02-05 21:09:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309890:0",
            "title": "Citigroup Downgrades Warby Parker to Sell From Neutral, Adjusts Price Target to $23 From $19",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Warby Parker  has an average rating of overweight and mean price target of $24.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309890:0/",
            "pub_date": "2025-02-05 21:09:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309803:0",
            "title": "FirstService Q4 Earnings Miss Estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FirstService  inched up 0.4% at last look Wednesday in Nasdaq pre-market trading after reporting fourth-quarter results that missed analysts' forecasts. </p><p class=\"\">The company booked adjusted earnings of US$1.34 per share, below the FactSet projection of US$1.37 per share but higher than US$1.11 per share reported a year ago. </p><p class=\"\">FirstService's GAAP EPS stood at US$0.71, missing the FactSet estimate of US$0.89 but an increase from US$0.14 posted in the previous year. </p><p class=\"\">Revenue rose to US$1.37 billion in the three months ended Dec. 31 from $1.08 billion in the same quarter of the previous year. Adjusted EBITDA increased to US$137.9 million from US$103.3 million. </p><p class=\"\">\"Our teams were focused on driving healthy profitable growth which is reflected in the strong top-line and improved margins year,\" CEO Scott Patterson said. \"This momentum and continued operational execution reinforces our expectations for a strong 2025.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309803:0/",
            "pub_date": "2025-02-05 21:10:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005733:0",
            "title": "Bitdeer Techs Group Is Maintained at Buy by Rosenblatt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:03 GMT) </strong>Bitdeer Techs Group Price Target Raised to $30.00/Share From $22.00 by Rosenblatt</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005733:0/",
            "pub_date": "2025-02-05 21:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309881:0",
            "title": "RBC Trims Price Target on Xylem to $160 From $162, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Xylem  has an average rating of overweight and mean price target of $150.14, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309881:0/",
            "pub_date": "2025-02-05 21:03:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0KK:0",
            "title": "Italy's Anima reports 50% increase in 2024 profit, shares hit highest since 2016",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Italian asset manager Anima Holding  on Wednesday reported a 50% rise to 276.5 million euros ($288 million) in its 2024 adjusted consolidated net profit as acquisitions of new businesses pushed revenue higher.</p><p class=\"\">The group, which is the target of a 1.6 billion euros buyout offer from shareholder Banco BPM , has proposed a dividend of 0.45 euro per share, up from the 0.25 euro per share it paid the previous year.</p><p class=\"\">By 1250 GMT, the stock was up 3.6% at 7 euros per share, hitting its highest level since January 2016.</p><p class=\"\">The company results were bolstered by the contribution of real estate management company Vita, acquired in August 2024, as well as the businesses of Kairos and Castello SGR, purchased in May 2024 and in 2023, respectively.</p><p class=\"\">\"Positive inflows, growing profitability, business diversification, strong capital generation, and attention to shareholder remuneration were the key elements for Anima in 2024,\" Chief Executive Officer Alessandro Melzi d'Eril said in a statement.</p><p class=\"\">Total revenue rose 44% from a year earlier to 530 million euros mainly due to higher commissions. Excluding the effect from acquisitions, revenue rose 33% compared to 2023.</p><p class=\"\">Total assets under management reached 204.2 billion euros at the end of December 2024 thanks to the addition of Kairos Partners and the positive performance of managed assets.</p><p class=\"\">($1 = 0.9605 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0KK:0-italy-s-anima-reports-50-increase-in-2024-profit-shares-hit-highest-since-2016/",
            "pub_date": "2025-02-05 21:03:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309880:0",
            "title": "UBS Adjusts Price Target on Popular to $105 From $104, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Popular  has an average rating of overweight and mean price target of $114.89, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309880:0/",
            "pub_date": "2025-02-05 21:03:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005605_20250205005740:0",
            "title": "Illinois Tool Works 4Q Operating Margin 26.2% >ITW",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005605_20250205005740:0/",
            "pub_date": "2025-02-05 21:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005605_20250205005743:0",
            "title": "Illinois Tool Works 4Q Operating Cash Flow $1.1B, Free Cash Flow $1B >ITW",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005605_20250205005743:0/",
            "pub_date": "2025-02-05 21:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309878:0",
            "title": "GUIDANCE: (ITW) Illinois Tool Works Expects Full Year 2025 EPS Range $10.15 - $10.55, vs. FactSet Est of $10.59",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309878:0/",
            "pub_date": "2025-02-05 21:04:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309876:0",
            "title": "Earnings Flash (ITW) Illinois Tool Works Posts Q4 EPS $2.54, vs. FactSet Est of $2.49",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309876:0/",
            "pub_date": "2025-02-05 21:04:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446756:0",
            "title": "Brazil Private Sector Activity Contracts After Nearly 4 Years of Expantion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Composite PMI for Brazil fell to 48.2 in January 2025 from 51.5 in December, marking the first private sector contraction since April 2021.</p><p class=\"\">Both services and manufacturing sectors declined, with services driving the downturn and manufacturing output contracting slightly.</p><p class=\"\">New business fell overall, ending a yearlong expansion, as modest growth in goods orders was outweighed by a drop in services.</p><p class=\"\">Cost inflation hit a two-and-a-half-year high across sectors, with services facing steeper pressures.</p><p class=\"\">Selling price inflation accelerated to its highest since mid-2022, as firms raised prices to counter rising costs.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446756:0-brazil-private-sector-activity-contracts-after-nearly-4-years-of-expantion/",
            "pub_date": "2025-02-05 21:04:56",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005605_20250205005748:0",
            "title": "Illinois Tool Works: 2025 EPS View Includes 30c Foreign Currency Translation Headwind >ITW",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005605_20250205005748:0/",
            "pub_date": "2025-02-05 21:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:02fde4c902ebb:0",
            "title": "Reservoir Media Announces Third Quarter Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reservoir Media, Inc., an independent music company, has released its financial results for the third quarter of fiscal 2025, ending December 31, 2024. The company reported strong performance across both its Music Publishing and Recorded Music segments, leading to significant revenue growth and improved profitability.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Reservoir Media reported a total revenue of $42.3 million for the third quarter, marking a 19% increase compared to the same period last year. This growth was driven by a 16% rise in Music Publishing revenue and a 20% increase in Recorded Music revenue. The company also reported a net income of $5.3 million, or $0.08 per share, compared to a net loss of $2.9 million, or $0.05 per share, in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Key business highlights for the quarter include the acquisition of the publishing catalog of Lastrada Entertainment, which features multiple chart-topping and Grammy Award-winning titles. Additionally, Reservoir expanded its relationship with producer and songwriter Serban Cazan and signed a publishing catalog deal with composer Lebohang Morake, known for his work on The Lion King franchise.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Reservoir Media has been active in strategic acquisitions, including the Lastrada Entertainment catalog. The company also focused on disciplined cost controls, which contributed to margin growth. These strategic moves are part of Reservoir's ongoing efforts to enhance its catalog and talent roster.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Golnar Khosrowshahi, Founder and CEO of Reservoir Media, commented on the results, stating, \"Our third fiscal quarter marks another strong period of growth across both the top and bottom lines of our business. With our team’s expertise and strong relationships across the industry, Reservoir consistently ushers in accretive opportunities that further shape our catalog and roster of talent into a diverse and valuable portfolio.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Reservoir Media has raised its financial outlook for fiscal 2025, now expecting revenue between $155 million and $158 million, and Adjusted EBITDA between $61.5 million and $64.5 million. CFO Jim Heindlmeyer expressed confidence in the company's performance and future opportunities, highlighting the resiliency of cash flows and the strength of the roster.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1824403/000110465925009381/tm255373d1_8k.htm\" rel=\"nofollow\" target=\"_blank\">Reservoir Media, Inc. [ RSVR ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:02fde4c902ebb:0-reservoir-media-announces-third-quarter-fiscal-2025-results/",
            "pub_date": "2025-02-05 21:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:3c9051b3da9b5:0",
            "title": "American Financial Group, Inc. Announces Fourth Quarter and Full Year Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">American Financial Group, Inc., an insurance holding company based in Cincinnati, Ohio, has released its financial results for the fourth quarter and full year of 2024. The company, primarily engaged in property and casualty insurance through its Great American Insurance Group, reported notable financial performance and strategic developments.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, American Financial Group (AFG) reported net earnings of $255 million, or $3.03 per share, compared to $263 million, or $3.13 per share, in the same period of 2023. Core net operating earnings were $262 million, or $3.12 per share, up from $238 million, or $2.84 per share, in the fourth quarter of 2023. The full year net earnings per share stood at $10.57, with core net operating earnings per share at $10.75.</p><p class=\"\">AFG's return on equity (ROE) for the full year 2024 was 19.0%, with a core operating ROE of 19.3%. The company also achieved an overall average renewal rate increase of 8%, excluding workers' compensation.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">AFG's Specialty Property and Casualty (P&amp;C) insurance operations reported a combined ratio of 89.0% for the fourth quarter of 2024, slightly higher than the 87.7% reported in the prior year quarter. The Property and Transportation Group saw an underwriting profit of $82 million, while the Specialty Casualty Group reported an underwriting profit of $82 million, despite adverse prior year reserve development in certain businesses. The Specialty Financial Group achieved an underwriting profit of $54 million.</p><p class=\"\">Gross and net written premiums for the full year 2024 increased by 9% and 7%, respectively, establishing new records for premium production. The company also reported a 21% increase in property and casualty net investment income for the fourth quarter, driven by improved returns on alternative investments and rising interest rates.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">AFG returned approximately $791 million to shareholders in 2024, including $545 million in special dividends. The company also increased its quarterly dividend by 12.7% and paid special dividends of $6.50 per share. AFG's book value per share was $53.18 at the end of 2024, with book value per share excluding accumulated other comprehensive income (AOCI) at $56.03.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Carl H. Lindner III and S. Craig Lindner, AFG’s Co-Chief Executive Officers, expressed satisfaction with the company's performance, highlighting the annual core operating return on equity exceeding 19% and a 7% growth in net written premiums. They emphasized the company's strong underwriting results, record P&amp;C net investment income, and effective capital management as key factors in creating long-term value for shareholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, AFG expects core operating earnings per share of approximately $10.50, with a core operating return on equity excluding AOCI of around 18%. The company anticipates 5% growth in net written premiums and a 92.5% calendar year combined ratio. AFG also estimates losses related to the Southern California wildfires to be between $60 and $70 million.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1042046/000119312525020439/d919412d8k.htm\" rel=\"nofollow\" target=\"_blank\">AMERICAN FINANCIAL GROUP INC [ AFG ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:3c9051b3da9b5:0-american-financial-group-inc-announces-fourth-quarter-and-full-year-results/",
            "pub_date": "2025-02-05 21:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309839:0",
            "title": "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Wednesday Amid Tech Earnings Misses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The broad market exchange-traded fund SPDR S&amp;P 500 ETF Trust  was down 0.5% and the actively traded Invesco QQQ Trust  retreated 0.8% in Wednesday's premarket activity amid disappointing earnings reports from major technology companies. </p><p class=\"\">US stock futures were mixed, with S&amp;P 500 Index futures down 0.5%, Dow Jones Industrial Average futures slipping 0.04%, and Nasdaq futures retreating 0.8% before the start of regular trading. </p><p class=\"\">US mortgage applications rose 2.2% in the week ended Jan. 31 as the average 30-year fixed mortgage rate fell below 7% for the first time in six weeks, Mortgage Bankers Association data showed Wednesday. </p><p class=\"\">The January ADP private-sector employment report will be released at 8:15 am ET. </p><p class=\"\">The international trade in goods and services bulletin for December posts at 8:30 am ET, followed by the S&amp;P Global PMI composite final for January at 9:45 am ET, and then the ISM services index for January at 10 am ET. </p><p class=\"\">The weekly EIA domestic petroleum status report posts at 10:30 am ET. </p><p class=\"\">Richmond Federal Reserve President Thomas Barkin speaks at 9 am ET, Chicago Federal Reserve President Austan Goolsbee at 2:30 pm ET, Governor Michelle Bowman at 3 pm ET, and Vice Chair Philip Jefferson at 7:30 pm ET. </p><p class=\"\">In premarket activity, bitcoin was down by 0.2% and the cryptocurrency fund ProShares Bitcoin Strategy ETF  was 0.2% lower. </p><p class=\"\">Power Play:</p><p class=\"\">Technology</p><p class=\"\">Technology Select Sector SPDR Fund  retreated 0.5%, and the iShares US Technology ETF  slipped 0.4%, while the iShares Expanded Tech Sector ETF  was down 0.8%. Among semiconductor ETFs, SPDR S&amp;P Semiconductor ETF  fell 1.1%, while the iShares Semiconductor ETF  declined by 0.4%. </p><p class=\"\">Advanced Micro Devices  shares were down more than 9% in recent Wednesday premarket activity after the chipmaker forecast a sequential decline in Q1 revenue, while the company's weaker-than-expected artificial intelligence figures overshadowed top- and bottom-line beats in the prior period. </p><p class=\"\">Winners and Losers:</p><p class=\"\">Financial</p><p class=\"\">Financial Select Sector SPDR Fund  advanced 0.2%. Direxion Daily Financial Bull 3X Shares  was up 0.4%, while its bearish counterpart Direxion Daily Financial Bear 3X Shares  was 0.4% lower. </p><p class=\"\">Banco Santander  shares were up 7.6% pre-bell Wednesday after the company reported higher Q4 earnings that exceeded analyst estimates. </p><p class=\"\">Health Care</p><p class=\"\">The Health Care Select Sector SPDR Fund  advanced 0.3%. The Vanguard Health Care Index Fund  was up 0.2%, while the iShares US Healthcare ETF  and the iShares Biotechnology ETF  were inactive. </p><p class=\"\">Novo Nordisk  stock was up 3.2% premarket after the company reported higher Q4 earnings and sales that beat FactSet analyst estimates. </p><p class=\"\">Consumer</p><p class=\"\">The Consumer Staples Select Sector SPDR Fund  was up 0.1%, while the Vanguard Consumer Staples Fund  was inactive. The iShares US Consumer Staples ETF  was inactive, and the Consumer Discretionary Select Sector SPDR Fund  lost 0.7%. The VanEck Retail ETF  and the SPDR S&amp;P Retail ETF  were inactive. </p><p class=\"\">Toyota Motor  shares were up 3% pre-bell after the company raised its operating profit and revenue guidance for fiscal 2025. </p><p class=\"\">Industrial</p><p class=\"\">Industrial Select Sector SPDR Fund  advanced 0.1% while the Vanguard Industrials Index Fund  and the iShares US Industrials ETF (IYJ) were inactive. </p><p class=\"\">Timken  stock was down 1.8% before the opening bell after the company reported lower Q4 adjusted earnings and net sales. </p><p class=\"\">Energy</p><p class=\"\">The iShares US Energy ETF  was inactive, while the Energy Select Sector SPDR Fund  was up by 0.1%. </p><p class=\"\">TotalEnergies  stock was up 1.6% before Wednesday's opening bell after the company reported higher-than-expected Q4 adjusted earnings and revenue. </p><p class=\"\">Commodities</p><p class=\"\">Front-month US West Texas Intermediate crude oil fell 1% to $71.97 per barrel on the New York Mercantile Exchange. Natural gas was down 1.6% at $3.20 per 1 million British Thermal Units. United States Oil Fund  declined by 1%, while the United States Natural Gas Fund  slipped by 0.8%. </p><p class=\"\">Gold futures for April gained 0.6% to reach $2,892.20 an ounce on the Comex, while silver futures slipped 0.3% to $32.94 an ounce. SPDR Gold Shares  were up 0.8%, and the iShares Silver Trust  was 0.8% higher.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309839:0-exchange-traded-funds-equity-futures-lower-pre-bell-wednesday-amid-tech-earnings-misses/",
            "pub_date": "2025-02-05 21:05:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX26Qmjy:0",
            "title": "BitMEX Launches 20 New Altcoin Options Featuring LTC, SUI, LINK, and More",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Traders can now access 20 new altcoin options contracts for Litecoin, Sui, Chainlink, Aave, and more on BitMEX</p><p class=\"\">MAHE, Seychelles, Feb.  05, 2025  (GLOBE NEWSWIRE) — BitMEX, the OG crypto derivatives exchange, is excited to announce the launch of 20 new option contracts, offering traders one of the first-ever opportunities to engage with a diverse range of altcoin options across Litecoin (LTC), SUI (Sui), LINK (Chainlink), AAVE (Aave), and more.</p><p class=\"\">BitMEX Options delivers on deep liquidity and low slippage through an Orderbook and a Request-for-Quote (RFQ) interface, allowing users to trade single-leg or multi-leg options with the lowest minimum sizes in the industry. This combined with the Strategies Dashboard that enables traders to execute advanced options strategies with a single click, makes trading altcoin options accessible to any type of user.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stephan Lutz, CEO of BitMEX </strong>said, “With the markets showing more volatility than ever, traders have an opportunity to push their strategies further, and we want to ensure they have every advantage. With this expansion, BitMEX is delivering what traders demand - a wider range of assets whilst empowering them with cutting-edge features that make executing sophisticated strategies effortless. With the addition of 20 new altcoin pairs, it reinforces our commitment to making BitMEX the go-to platform for options trading.”</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:847.2868217054264px;aspect-ratio:1.4121447028423773\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX26Qmjy-4c3387ad6a3d11c5c7b0186b725b032d-resized.webp\" type=\"images/webp\"/><img alt=\"BitMEX Options User Interface\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX26Qmjy-4c3387ad6a3d11c5c7b0186b725b032d-resized.jpeg\" style=\"background-color:#1d232a\"/></picture></div></figure></span></p><p class=\"\">Options traders can now access options pairs for BTC, ETH, AAVE, ADA, APT, AVAX, BCH, DOGE, FIL, ICP, LDO, LINK, LTC, MMPEPE, MMSHIB, MNT, OP, ORDI, SOL, SUI, TON, TRX, UNI, WLD, and XRP – totalling 26 pairs available for trading on BitMEX Options.</p><p class=\"\"><em>Ready to Trade?</em> Sign up for BitMEX today and explore the full suite of options trading at https://www.bitmex.com/app/options. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About BitMEX</strong></p><p class=\"\">BitMEX is the OG crypto derivatives exchange, providing professional crypto traders with a platform that caters to their needs through low latency, deep crypto native liquidity and unmatched reliability.</p><p class=\"\">Since its founding, no cryptocurrency has been lost through intrusion or hacking, allowing BitMEX users to trade safely in the knowledge that their funds are secure. So too that they have access to the products and tools they require to be profitable.</p><p class=\"\">BitMEX was also one of the first exchanges to publish their on-chain Proof of Reserves and Proof of Liabilities data. The exchange continues to publish this data twice a week – proving assurance that they safely store and segregate the funds they are entrusted with.</p><p class=\"\">For more information on BitMEX, please visit the BitMEX Blog or www.bitmex.com, and follow Telegram, Twitter, Discord, and its online communities. For further inquiries, please contact press@bitmex.com.</p><p class=\"\">Photos accompanying this announcement are available at: </p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/c35a0026-3fd6-4578-b911-24f3b3aed0ff</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/d07afd47-2728-4646-9a2f-85d7c091d824</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BitMEX Launches 20 New Altcoin Options </strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Traders can now access a total of 26 altcoin options contracts for Litecoin, Sui, Chainlink, Aave, and more on BitMEX</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BitMEX Options User Interface</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">BitMEX Options offers 20 new altcoin pairs </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX26Qmjy:0-bitmex-launches-20-new-altcoin-options-featuring-ltc-sui-link-and-more/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX87sNgy:0",
            "title": "Asia Broadband’s Nears Completion Of Its Next-Generation AABB Wallet’s On/Off Ramp To Facilitate Users to Buy and Sell the AABBG Token",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LAS VEGAS, Feb.  05, 2025  (GLOBE NEWSWIRE) — Asia Broadband Inc.  (“AABB” or the “Company”) is pleased to announce that the Company is nearing completion of incorporating an On/Off ramp mechanism in the next-generation AABB Wallet to facilitate users AABBG token and cryptocurrency transactions. The On/Off ramp integration is a collaborative process that is in the final stages of completion and necessary for Google Play and Apple App stores approval. Additionally, with the current favourable cryptocurrency environment, the Company is adding the official TrumpCoin (TRUMP) and Elon Musk Coin (MUSK) to the new AABB Wallet and will continue to add more tokens and features going forward.</p><p class=\"\">The new next generation AABB Wallet has been built as a leading Algorand wallet for multi-chain management powered by AI. Using advanced algorithms, its AI can analyze market trends and historical data to forecast potential price movements, helping traders make smarter decisions about when to buy or sell cryptocurrencies. By reducing the risk of losses and providing profit insights, this AI-driven approach aims to empower traders to navigate the crypto market transactions with confidence and success. Designed for users with diverse portfolios and DeFi activities across various blockchains, the new AABB Wallet offers a seamless user experience through features like WalletConnect and a browser extension, allowing all assets to be brought into one streamlined interface. Users can also customize their experience by adding unique ID’s, further enhancing their control and flexibility. With robust cross-chain capabilities and exceptional support for Algorand ASA’s, the new next generation AABB Wallet exemplifies and shines as the ideal multi-chain wallet.</p><p class=\"\">\"We are very close to the finish line now to launch our new next generation AABB Wallet app with its high level functionality and AI integrated and merchant payment features. The KOINFOLD team has been instrumental in creating innovative wallet tools for mass-market appeal and use through KYN Capital’s blue-chip relationship networks. We are striving to take our AABBG gold-backed token and digital assets business segment to the next level of expansion with the new AABB Wallet,\" expressed Chris Torres, AABB President and CEO.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Asia Broadband</strong></p><p class=\"\">Asia Broadband Inc.  is a resource company focused on the production of precious metals and the accumulation of physical gold holdings. The Company utilizes its specific geographic expertise, experience and extensive industry contacts to facilitate the expansion of precious metals property holdings and production in Mexico. The Company's industry and business integration in Mexico and its asset diversification are unique strengths of AABB that differentiate it from other companies and creates distinctive value for shareholders. Additionally, the Company has a digital assets business segment with its AABBG mine-to-token gold-backed cryptocurrency within its own proprietary AABB Wallet and the unique Golden Baboons Mining Club and Shorts Rascal Club Non-Fungible Token (NFT) collections. AABB expects its token to become a world-wide standard of exchange that is stable, secured and trusted with gold backing, while having the added benefit of demand based price appreciation. These are unique and outstanding qualities relative to other cryptocurrencies and digital asset developers.</p><p class=\"\">Contact the Company at:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>General Email:</td><td>ir@asiabroadbandinc.com</td></tr><tr><td>Token Support:</td><td>support@aabbgmine2token.com</td></tr><tr><td>Company Websites:</td><td>www.asiabroadbandinc.comwww.aabbgmine2token.comwww.goldenbaboons.com</td></tr><tr><td>Phone: </td><td>702-866-9054</td></tr></tbody></table></div><p class=\"\">Forward-Looking Statements are contained in this press release within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are based on the Asia Broadband Inc.’s (the “Company”) expected current beliefs about the Company’s business, which are subject to uncertainty and change. The operations and results of the Company could materially differ from what is expressed or implied by the statements made above when industry, regulatory, market and competitive circumstances change. Further information about these risks can be found in the annual and quarterly disclosures the Company has published on the OTC Markets website. The Company is under no obligation to update or alter its forward-looking statements as future circumstances, events and information may change.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX87sNgy:0-asia-broadband-s-nears-completion-of-its-next-generation-aabb-wallet-s-on-off-ramp-to-facilitate-users-to-buy-and-sell-the-aabbg-token/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX63T3vP:0",
            "title": "Aprea Therapeutics Announces Strategic IP Portfolio Evolution in DNA Damage Response (DDR) Cancer Therapeutics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DOYLESTOWN, Pa., Feb.  05, 2025  (GLOBE NEWSWIRE) — Aprea Therapeutics, Inc.  (“Aprea”, or the “Company”), a clinical-stage biopharmaceutical company developing innovative treatments that exploit specific cancer cell vulnerabilities while minimizing damage to healthy cells, today provided an update on its existing patent portfolio.</p><p class=\"\">“Our strong patent portfolio reflects our commitment to innovation and leadership in the field of DNA Damage Response therapeutics,” said Oren Gilad, Ph.D., President and Chief Executive Officer of Aprea. “Intellectual property is an essential component of Aprea’s strategy, enabling us to advance first in class and best in class oncology treatments while protecting the value of our assets. Our commitment to securing global intellectual property rights underscores our long-term vision to develop and commercialize breakthrough therapies for difficult to treat cancers.”</p><p class=\"\">Aprea’s ATR inhibitor program is protected by a strong patent estate, including four granted U.S. patents, one pending U.S. application, and one pending provisional application. There are 19 granted non-U.S. patents and 16 pending non-U.S. patent applications. The granted patents will expire 2035-2037 and the pending applications, if granted, could extend exclusivity into 2044. Additional regulatory exclusivities up to five years may also be available. This portfolio comprehensively covers the program’s proprietary compounds, pharmaceutical compositions, and methods of use. The Company’s lead ATR inhibitor, ATRN-119, is currently being evaluated in the ABOYA-119 clinical trial as monotherapy in patients with advanced solid tumors having at least one mutation in a defined panel of DNA damage response (DDR)-related genes.</p><p class=\"\">The intellectual property covering Aprea’s WEE1 kinase inhibitor program includes one pending U.S. patent application and 12 pending non-U.S. patent applications. The WEE1 family of applications, if granted, will expire in 2043, not including any regulatory exclusivities that may be awarded. The WEE1-portfolio covers key aspects of the program, including proprietary compounds, pharmaceutical compositions, and methods of use. The Company’s lead WEE1 inhibitor, APR-1051, is currently being evaluated in the ACESOT-1051 Phase 1 clinical trial in advanced/metastatic solid tumors harboring certain cancer-associated gene alterations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aprea</strong></p><p class=\"\">Aprea is pioneering a new approach to treat cancer by exploiting vulnerabilities associated with cancer cell mutations. This approach was developed to kill tumors but to minimize the effect on normal, healthy cells, decreasing the risk of toxicity that is frequently associated with chemotherapy and other treatments. Aprea’s technology has potential applications across multiple cancer types, enabling it to target a range of tumors, including ovarian, colorectal, prostate, and breast cancers. The company’s lead programs are APR-1051, an oral, small-molecule inhibitor of WEE1 kinase, and ATRN-119, a small molecule ATR inhibitor, both in clinical development for solid tumor indications. For more information, please visit the company website at www.aprea.com.</p><p class=\"\">The Company may use, and intends to use, its investor relations website at https://ir.aprea.com/ as a means of disclosing material nonpublic information and for complying with its disclosure obligations under Regulation FD.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statement</strong></p><p class=\"\">Certain information contained in this press release includes “forward-looking statements”, within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended related to our study analyses, clinical trials, regulatory submissions, and projected cash position. We may, in some cases use terms such as “future,” “predicts,” “believes,” “potential,” “continue,” “anticipates,” “estimates,” “expects,” “plans,” “intends,” “targeting,” “confidence,” “may,” “could,” “might,” “likely,” “will,” “should” or other words that convey uncertainty of the future events or outcomes to identify these forward-looking statements. Our forward-looking statements are based on current beliefs and expectations of our management team and on information currently available to management that involve risks, potential changes in circumstances, assumptions, and uncertainties. All statements contained in this press release other than statements of historical fact are forward-looking statements, including statements regarding our ability to develop, commercialize, and achieve market acceptance of our current and planned products and services, our research and development efforts, including timing considerations and other matters regarding our business strategies, use of capital, results of operations and financial position, and plans and objectives for future operations. Any or all of the forward-looking statements may turn out to be wrong or be affected by inaccurate assumptions we might make or by known or unknown risks and uncertainties. These forward-looking statements are subject to risks and uncertainties including, without limitation, risks related to the success, timing, and cost of our ongoing clinical trials and anticipated clinical trials for our current product candidates, including statements regarding the timing of initiation, pace of enrollment and completion of the trials (including our ability to fully fund our disclosed clinical trials, which assumes no material changes to our currently projected expenses), futility analyses, presentations at conferences and data reported in an abstract, and receipt of interim or preliminary results (including, without limitation, any preclinical results or data), which are not necessarily indicative of the final results of our ongoing clinical trials, our understanding of product candidates mechanisms of action and interpretation of preclinical and early clinical results from its clinical development programs, and the other risks, uncertainties, and other factors described under “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and elsewhere in the documents we file with the U.S. Securities and Exchange Commission. For all these reasons, actual results and developments could be materially different from those expressed in or implied by our forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which are made only as of the date of this press release. We undertake no obligation to update such forward-looking statements for any reason, except as required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor and Media Contact:</strong></p><p class=\"\">Mike Moyer</p><p class=\"\">LifeSci Advisors</p><p class=\"\">mmoyer@lifesciadvisors.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX63T3vP:0-aprea-therapeutics-announces-strategic-ip-portfolio-evolution-in-dna-damage-response-ddr-cancer-therapeutics/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXbWwC6P:0",
            "title": "Alice Group USA Announces Acquisition Strategy and Transformation of TFLM",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WEST HOLLYWOOD, Calif., Feb.  05, 2025  (GLOBE NEWSWIRE) — Alice Group USA, LLC announces the acquisition of the controlling shareholder block of Tofla Megaline Inc. (OTCQB: TFLM) as the <!-- -->first major step in the capitalization of its ambitious strategy to transform TFLM into a real estate, financial services, and tech group aimed at improving inclusion, asset ownership, and access to technology for entrepreneurs, startups, and business owners in the United States. TFLM’s development strategy will include providing co-working spaces, financial services, and IT support, including AI-driven office solutions.</p><p class=\"\">In the coming weeks, Alice Group USA intends to bring on a world-class management team with deep expertise in AI, technology development, and real estate. This new leadership team, is expected to have a robust background in artificial intelligence, machine learning, and innovative financial technologies, with the goal of providing a significant core advantage to Alice in executing its transformative business plan. </p><p class=\"\">The integration of AI-driven solutions across the real estate and financial platforms with the goal of enabling TFLM to streamline operations, enhance data-driven decision-making, and drive unparalleled value for entrepreneurs, startups, and underserved communities. The team’s technological expertise will be utilized in driving TFLM’s growth, improving efficiency, and expanding market opportunities within the emerging AI and real estate sectors. This strong technological foundation positions TFLM to be a leader in the next generation of AI-powered financial services and real estate management.</p><p class=\"\">As the first stage of its strategic development, TFLM is seeking to acquire equity interests in Nexus Workspaces, a leading coworking brand in Florida and Georgia. The assets to be acquired, in a series of transactions subject to entering definitive agreements and various closing convictions, include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Nexus’s proprietary technology, designed to streamline commercial property management, enhance operational efficiency, and automate workspace and support solutions for use within the Nexus workspaces. This acquisition will enable TFLM to develop additional suites of services for growing entrepreneurs, start-ups, and minority businesses, including the provision of financial products and venture capital.</li><li class=\"listItem-bmN0_SHH\">The acquisition of Boundary Midtown Atlanta, a Class A office portfolio strategically located in Midtown Atlanta. The $75 million asset features a 75%+ occupancy rate and is expected to generate consistent income while allowing TFLM to repurpose select vacancies for Nexus-branded operations.</li><li class=\"listItem-bmN0_SHH\">The acquisition of five additional commercial office properties under the Nexus Workspaces brand, covering 251,622 square feet across Florida and Atlanta. With 90% occupancy and over 800 tenants, this portfolio offers a prime opportunity for revenue growth through AI-enhanced commercial real estate management.</li></ul><p class=\"\">Upon completion of these acquisitions, TFLM will have acquired a diverse set of high-value real estate assets. TFLM has identified additional real estate assets and has begun negotiations to acquire and add to its real estate portfolio, with a focus on Florida and other targeted markets. It is the intent of these strategic acquisitions to further enhance TFLM’s long-term growth and operational capabilities, expanding its market presence and fostering sustained revenue generation.</p><p class=\"\">TFLM is seeking to become the U.S. operating company for a group of businesses aimed at democratizing capital access and enhancing financial efficiency, especially for minority-owned businesses, real estate owners, and start-up companies. We are in advanced discussions with businesses in the U.S. involved in neo-banking, provision of AI-enhanced services, and investment risk assessment to complete a powerful and compelling suite of products that will harness the power of American entrepreneurialism while providing investors with the security derived from a grounding in the long-term growth and stable cash flow of prime real estate holdings.</p><p class=\"\">Alice Group USA believes that the suite of products being developed and acquired by TFLM will have international application, and has hired Brigg Macadam Capital, an international corporate finance firm with a track record of providing access to capital for companies’ global business objectives. Tim Murray, CEO of Brigg Macadam Capital, commented:</p><p class=\"\">“We are incredibly excited to work with Alice Group USA and TFLM. By merging AI-driven financial services with strategic real estate acquisitions, Alice’s management team is seeking to build a next-generation ecosystem that has huge relevance in international markets.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Alice Group USA, LLC</strong></p><p class=\"\">Alice Group USA is an innovative <strong class=\"root-Tkn6WL2y\">investment and technology firm</strong> specializing in AI-powered financial solutions, real estate acquisitions, and market-defining investment strategies. With a strong emphasis on <!-- -->capital access, wealth creation, and inclusive finance, the company is <!-- -->pioneering the future of AI-driven financial ecosystems.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About TFLM (Tofla Megaline Inc.)</strong></p><p class=\"\">TFLM is an <strong class=\"root-Tkn6WL2y\">OTCQB-listed public entity</strong> undergoing a <strong class=\"root-Tkn6WL2y\">strategic transformation</strong> which commenced with Alice Group USA’s acquiring its control position. By integrating <!-- -->high-value real estate, AI-driven solutions, and fintech innovations, TFLM is set to emerge as a <strong class=\"root-Tkn6WL2y\">leading diversified company</strong>.</p><p class=\"\">Cautionary Statement Regarding Forward Looking Statements </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">The discussions in this press release contain forward-looking statements reflecting our current expectations that involve risks and uncertainties. These statements are made under the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. When used in this press release, the words “anticipate,” “expect,” “plan,” “believe,” “seek,” “estimate,” and similar expressions are intended to identify forward-looking statements and relate to future periods. Forward-looking statements are statements that are not historical facts and speak only as of the date hereof. We expressly disclaim any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in our expectations with regard thereto or any change in events, conditions, or circumstances on which any such statement is based, except as required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">Alice Group USA</p><p class=\"\">info@alicegroup.ai</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXbWwC6P:0-alice-group-usa-announces-acquisition-strategy-and-transformation-of-tflm/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}