{
    "data": [
        {
            "id": "moneycontrol:88889956d094b:0",
            "title": "Power Grid shares decline over 1% after firm's Q3 net profit falls 4% to Rs 3,862 crore",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Power Grid Corporation of India shares fell over 1 percent in morning trade on February 4, a day after the company reported a strong decline of over 4 percent in Q3 net profit.</p><p class=\"\">Power Grid Corporation of India shares were trading at Rs 279.60 apiece, as seen at 9:45 am. This marks a decline of 1.48 percent from the previous closing price.</p><p class=\"\">Read about Stock Market updates LIVE</p><p class=\"\">The state-owned Power Grid Corporation of India released its earnings performance results for the quarter ended December in the post market hours of February 3. Its net profit declined 4 percent year-on-year to Rs 3,862 crore. The company had earlier recorded a net profit of Rs 4,028 crore in the corresponding quarter of the previous financial year.</p><p class=\"\">Its revenue from operations stood at Rs 11,550 crore in Q3, marking a 3 percent rise from Rs 11,233 crore reported in Q3 of the preceding fiscal. The company's overall income decreased 1 percent to Rs 11,743 crore in Q3, as against Rs 11,819.7 crore in the corresponding period of FY24.</p><p class=\"\">At the operating level, the company's EBITDA decreased by 4 percent year-on-year to Rs 10,048.01 crore in the third quarter of this fiscal. The corresponding period of the previous fiscal saw EBITDA at Rs 10,482.8 crore. EBITDA margin for Q3 was at 86 percent, as against 89 percent year-ago.</p><p class=\"\">A slowdown in India's economy has dampened the growth in power demand. In the second half of 2024, power generation accounted for just about a quarter of the total growth seen in the first half of the year. From October to December 2024, India's power generation grew by only 3 percent, marking a sharp decline when compared to the 12 percent growth during the same period in 2023. Overall, the power generation growth in 2024 marked the slowest pace since the COVID-19 pandemic.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:88889956d094b:0-power-grid-shares-decline-over-1-after-firm-s-q3-net-profit-falls-4-to-rs-3-862-crore/",
            "pub_date": "2025-02-04 14:46:24",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CI:0",
            "title": "Unicaja Sees 2025 NII Above 1.40 Bln Euros",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Unicaja Banco SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES 2025 NII ABOVE 1.40 BILLION EUROS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES CET1 FULLY LOADED ABOVE 14% THROUGHOUT 2025-2027 PERIOD</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES SHAREHOLDER REMUNERATION ACUMULATED PROFIBILITY IN 2025-2027 ABOVE 40%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES ACCUMULATED SHAREHOLDER REMUNERATION (% OF ACCUMULATED NET RESULT OF 2025-2027) ABOVE 85%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CI:0-unicaja-sees-2025-nii-above-1-40-bln-euros/",
            "pub_date": "2025-02-04 14:46:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV00E:0",
            "title": "Mutakamela Insurance FY Profit At 15.2 Mln Riyals",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MUTAKAMELA INSURANCE CO :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">MUTAKAMELA INSURANCE FY INSURANCE REVENUE 873.9 MILLION RIYALS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MUTAKAMELA INSURANCE FY NET PROFIT ATTRIBUTABLE 15.2 MILLION RIYALS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV00E:0-mutakamela-insurance-fy-profit-at-15-2-mln-riyals/",
            "pub_date": "2025-02-04 14:46:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463250:0",
            "title": "Coloplast Posts Lower Fiscal Q1 Profit; Revenue Up",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coloplast (COLO-B.CO) said Tuesday that profit for the first quarter of fiscal 2025 declined, while revenue increased year over year. </p><p class=\"\">Profit for the three months ended Dec. 31, 2024, was 1.04 billion Danish kroner, compared with 1.21 billion kroner earlier. EPS moved to 4.63 kroner from 5.39 kroner. </p><p class=\"\">The Danish medical device company's revenue was 7.03 billion kroner, compared with 6.61 billion kroner a year ago. </p><p class=\"\">Analysts polled by FactSet were expecting 7.04 billion kroner in sales, 1.28 billion kroner in net income, and 5.78 kroner in EPS. </p><p class=\"\">Looking ahead, the company downgraded its expectations for its organic growth for fiscal 2025 to 7%, compared with the previous guidance of 8% to 9%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463250:0/",
            "pub_date": "2025-02-04 14:46:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OU1VQ:0",
            "title": "Unicaja's books 122 mln euro profit in Q4 vs 19 mln euro loss in 2023",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spain's Unicaja  on Tuesday reported a net profit of 122 million euros ($125.57 million) in the fourth against a loss of 19 million euros in the same period in 2023 when it set aside higher provisions to clean up its real estate loan portfolio.</p><p class=\"\">In the September to December period, new loan growth  somewhat offset pressure from lower interest rates on financial margins. Analysts expected net profit would come in at 142 million euros.</p><p class=\"\">($1 = 0.9079 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OU1VQ:0-unicaja-s-books-122-mln-euro-profit-in-q4-vs-19-mln-euro-loss-in-2023/",
            "pub_date": "2025-02-04 14:46:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000961_20250204001257:0",
            "title": "Mitsubishi Electric 3Q Business Platform Segment Operating Profit Y2.7B, Up Y1.3B on Year>6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001257:0/",
            "pub_date": "2025-02-04 14:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001261:0",
            "title": "KKR Raises Offer Price for Fuji Soft in Bid to End Takeover Battle — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">KKR raised its tender-offer price for Japanese software company Fuji Soft in an attempt to end the takeover battle with rival Bain Capital.</p><p class=\"\">The U.S. investment company bought a more than one-third stake in Fuji Soft in November and has said it is best positioned to work with the company to take it private.</p><p class=\"\">Foreign private-equity firms like KKR and Bain Capital have been riding a growing wave of Japanese mergers and acquisitions in recent years as big companies spin off noncore businesses or managements opt to leave the public market.</p><p class=\"\">KKR said in a regulatory filing Tuesday that it decided to raise the tender-offer price to 9,850 yen a share, equivalent to $63.64, from Y9,451 previously. KKR will also extend the tender-offer period through Feb. 19, it said.</p><p class=\"\">Bain Capital has said it planned to start a tender offer for Fuji Soft at Y9,600 a share once certain conditions are met.</p><p class=\"\">Fuji Soft's shares have remained above KKR's previous tender-offer price for the past couple of months. The stock ended 1.9% higher at Y9,990 on Tuesday.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001261:0/",
            "pub_date": "2025-02-04 14:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463244:0",
            "title": "Nikkei Ends Higher as Markets Eye US-China Trade Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japanese shares edged higher on Tuesday, tracking Wall Street gains after Washington delayed tariffs on Mexico and Canada, easing investor nerves ahead of a China-US trade call. </p><p class=\"\">The Nikkei 225 rose 0.72%, or 278.28 points, to close at 38,798.37. </p><p class=\"\">U.S. President Donald Trump said trade talks with China were set to happen \"probably over the next 24 hours,\" raising hopes of a last-minute reprieve on a 10% tariff due early Tuesday. He warned that without a deal, tariffs would be \"very, very substantial.\"</p><p class=\"\">In corporate moves, Takashima &amp; Co.  took full control of Sanwa Holdings  and its 14 affiliates, according to a Monday filing. Sanwa, founded in 2019, sells and installs solar power systems. </p><p class=\"\">Kyocera  reported a 79.7% slump in attributable profit to 18.3 billion yen for the nine months to Dec. 31, hit by weak factory utilization and higher taxes. Basic EPS fell to 13.01 yen, while sales were little changed at 1.492 trillion yen. </p><p class=\"\">ASKA Pharmaceutical  will lift its stake in Vietnam's Ha Tay Pharmaceutical (HNX:DHT) to 40% from 39.9%, making it a subsidiary. The deal, set to close in February, aligns with ASKA's push into Southeast Asia.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463244:0-nikkei-ends-higher-as-markets-eye-us-china-trade-call/",
            "pub_date": "2025-02-04 14:47:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000961_20250204001264:0",
            "title": "Mitsubishi Electric 3Q Semiconductor & Device Segment Operating Profit Y8.4B, Up Y0.5B on Year >6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001264:0/",
            "pub_date": "2025-02-04 14:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV06J:0",
            "title": "Germany's Siltronic posts annual preliminary sales in line with market view",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">German semiconductor materials supplier Siltronic  reported a 7% drop in its preliminary annual sales on Tuesday, citing high inventory levels amid a delay in demand recovery.</p><p class=\"\">The company, which makes silicon wafers used in semiconductor chips, posted 2024 revenue of 1.41 billion euros  ($1.45 billion), down from 1.51 billion euros a year earlier. However, this figure aligned with analysts' expectations of 1.40 billion euros, based on a poll by Vara Research.</p><p class=\"\">Its earnings before interest tax, depreciation and amortisation (EBITDA) came in at 364 million euros for the same period, down from 434 million euros last year.</p><p class=\"\">    \"For the year 2025, we anticipate that the growth in the end-markets, primarily driven by AI, will not yet be reflected in our wafer demand due to the persistently elevated inventory levels in the value chain,\" CEO Michael Heckmeier said in a statement.</p><p class=\"\">The German company anticipates that the first half of next year will be considerably weaker than the second half of 2024. It also expects full-year sales for 2025 to be roughly in line with the previous year, with no significant year-on-year growth.</p><p class=\"\">Siltronic will provide a more detailed outlook at the release of its annual report on March 6.</p><p class=\"\">($1 = 0.9713 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV06J:0-germany-s-siltronic-posts-annual-preliminary-sales-in-line-with-market-view/",
            "pub_date": "2025-02-04 14:48:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV02J:0",
            "title": "Panasonic's battery unit Q3 operating profit rises 39% from a year earlier",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's Panasonic Holdings  said on Thursday the third-quarter operating profit of its energy unit, which supplies batteries to Tesla , rose 39% from a year earlier on improved profitability at its U.S. plant and stronger sales of energy storage systems.</p><p class=\"\">Operating income for the key segment increased to 42 billion yen ($270.46 million) as the better profitability at its U.S. plant helped offset an overall decline in sales in its in-vehicle business, it said in presentation materials.</p><p class=\"\">($1 = 155.2900 yen)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV02J:0-panasonic-s-battery-unit-q3-operating-profit-rises-39-from-a-year-earlier/",
            "pub_date": "2025-02-04 14:49:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0EA:0",
            "title": "Raiffeisen says Russia loan volume reduced to 4.2 bln eur at end of 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Austria's Raiffeisen Bank International  said on Tuesday it reduced its loan volume in Russia to 4.2 billion euros ($4.32 billion) at the end of last year, as it sought to pare back its business in the country in response to unrelenting regulatory pressure.</p><p class=\"\">Almost three years after Russia sent troops into Ukraine, Raiffeisen's continued presence in Russia underlines the lingering ties between Moscow and Vienna - with Vienna having served as a hub for cash from Russia and former Soviet states.</p><p class=\"\">That bond put Raiffeisen and Austria on the front line of a global push by the United States to isolate Russia.</p><p class=\"\">Raiffeisen has around 6 billion euros stranded in Russia, earned in part from processing billions in international payments in the years since Russia's invasion of Ukraine, a person with knowledge of the matter has told Reuters.</p><p class=\"\">($1 = 0.9715 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0EA:0-raiffeisen-says-russia-loan-volume-reduced-to-4-2-bln-eur-at-end-of-2024/",
            "pub_date": "2025-02-04 14:50:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0HH:0",
            "title": "JGB yields rise to multi-year highs as markets weigh US tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Japanese government bond (JGB) yields rose to multi-year highs on Tuesday alongside U.S. Treasury yields as investors continued to weigh the impact of U.S. tariffs while eyeing the Bank of Japan's rate path outlook.</p><p class=\"\">The 10-year JGB yield (JP10YTN=JBTC) touched a 14-year peak of 1.27%, while 10-year JGB futures (2JGBv1) fell 0.21 points to 140.54 yen.</p><p class=\"\">JGB yields followed U.S. Treasury yields higher, with ten-year U.S. Treasury yields  hovering around 4.57% during Asian hours. </p><p class=\"\">U.S. President Donald Trump suspended his threat of steep tariffs on Mexico and Canada on Monday, agreeing to a 30-day pause to negotiate with the two trade partners.</p><p class=\"\">Trump's additional 10% tariff across all Chinese imports into the U.S. came into effect at 12:01 a.m. ET on Tuesday (0501 GMT), spurring a tit-for-tat from China.</p><p class=\"\">Elsewhere, BOJ Governor Kazuo Ueda reiterated on Tuesday the central bank will aim to achieve 2% inflation on a sustained basis. </p><p class=\"\">Markets are eyeing the BOJ's July meeting as the next possible time for it to raise interest rates.</p><p class=\"\">There is a strong consensus in the market that the BOJ will raise rates every six months to around 1%, a view that has more or less been completely factored in, Nomura's chief macro strategist Naka Matsuzawa said.</p><p class=\"\">The Japan policy rate stands at 0.5% after the BOJ hiked rates last month.</p><p class=\"\">BOJ policymakers have been reluctant to give guidance about the terminal rate, but \"at some point before they even get to 1%, they have to start communicating with the market\", Matsuzawa said.</p><p class=\"\">The two-year JGB yield (JP2YTN=JBTC) sat 1.5 basis points higher at 0.735%, having briefly touched its highest since October 2008 at 0.74%.</p><p class=\"\">The five-year yield (JP5YTN=JBTC) rose 3 bps to 0.925%, a level last seen in November 2008.</p><p class=\"\">The 20-year JGB yield (JP20YTN=JBTC) also climbed 3 bps to 1.985%. The 30-year JGB yield (JP30YTN=JBTC) ticked up 2.5 bps to 2.325%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0HH:0-jgb-yields-rise-to-multi-year-highs-as-markets-weigh-us-tariffs/",
            "pub_date": "2025-02-04 14:50:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463247:0",
            "title": "HFCL Sees Drop in Fiscal Q3 Consolidated Net Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HFCL  recorded a decline in its attributable consolidated net profit to 736.5 million Indian rupees in the fiscal third quarter from 822.4 million rupees a year ago, according to a Monday filing with the Indian stock exchanges by the telecom infrastructure company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, dropped to 0.51 rupees from 0.58 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 also slipped to 10.1 billion rupees from 10.3 billion rupees a year earlier, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463247:0/",
            "pub_date": "2025-02-04 14:41:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001168:0",
            "title": "Tariffs Unlikely to Have Long-Term Impact on Central Bank Policy — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Higher tariffs have the potential to increase inflation in the short term if companies pass the costs on to their customers, says Damian McIntyre at Federated Hermes. However, this is unlikely to impact central bank policy in the longer term, says the head of multi-asset solutions in a note. \"We would expect this to be a one-off impact of inflation, rather than a sustained increase,\" he says. In the short term, this could keep rates higher for longer, he adds. Federated Hermes, however, does not expect it to have long-term implications for central bank policy. U.S. President Trump and the leaders of Mexico and Canada reached a deal to put tariffs on hold for a month. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001168:0/",
            "pub_date": "2025-02-04 14:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001170:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0642 GMT - Higher tariffs have the potential to increase inflation in the short term if companies pass the costs on to their customers, says Damian McIntyre at Federated Hermes. However, this is unlikely to impact central bank policy in the longer term, says the head of multi-asset solutions in a note. \"We would expect this to be a one-off impact of inflation, rather than a sustained increase,\" he says. In the short term, this could keep rates higher for longer, he adds. Federated Hermes, however, does not expect it to have long-term implications for central bank policy. U.S. President Trump and the leaders of Mexico and Canada reached a deal to put tariffs on hold for a month. (emese.bartha@wsj.com)</p><p class=\"\">0633 GMT - China's retaliation to Trump's tariffs doesn't seem aggressive, says Zhiwei Zhang, president and chief economist at Pinpoint Asset Management. Beijing's measures only target some U.S. products, whereas the U.S. tariffs apply to all Chinese exports to the country, says Zhang. \"This is likely only the beginning of a long process for the two countries to negotiate,\" the economist says. The negotiations between the U.S. and its neighbors suggest that there is some hope of de-escalation at some point, though the road ahead is likely to be bumpy, Zhang says. Washington postponed tariffs on Canada and Mexico after reaching border-related deals. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0629 GMT - ​The top risk for 2025 identified by ETF provider Global X was policy sequencing across taxes, tariffs and deregulation. These are now now playing out, potentially causing more volatility in rates markets, says Scott Helfstein, head of investment strategy. \"This is likely a source for increased volatility in the rate market more so than serious disruption for companies and equities, but this is early days,\" he says in a note. U.S. President Trump moved to levy tariffs on Mexico and Canada, but the leaders of the three states reached an agreement to put tariffs on hold for a month. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001170:0/",
            "pub_date": "2025-02-04 14:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV071:0",
            "title": "Nintendo cuts FY profit forecast by 22%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's Nintendo  cut its operating profit forecast on Tuesday by 22.2% to 280 billion yen ($1.8 billion) for the financial year ending March. </p><p class=\"\">In the April-December period, profit fell 46.7% to 247.6 billion yen.</p><p class=\"\">Nintendo remains dependent on its console business even as it has opened stores and its roster of characters feature in theme parks and film. </p><p class=\"\">The company said last month it will release a successor to the hit home-portable Switch console this year. </p><p class=\"\">The Switch 2 appears to closely follow the design of its predecessor, which transformed Nintendo's fortunes after the underperformance of the Wii U. </p><p class=\"\">($1 = 155.2900 yen)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV071:0-nintendo-cuts-fy-profit-forecast-by-22/",
            "pub_date": "2025-02-04 14:43:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0BN:0",
            "title": "Logistics firm DSV Q4 profit lags forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Freight forwarder DSV  posted a fourth-quarter operating profit before special items below expectations on Tuesday and said the macroeconomic and geopolitical environment remains uncertain into 2025.</p><p class=\"\">\"The macroeconomic and geopolitical environment, including the situation in the Red Sea remains uncertain, and unforeseen changes may therefore impact our financial results,\" the company said in a statement. </p><p class=\"\">    \"We continue to monitor activity closely across our organisation and adjust capacity and cost base accordingly\".  </p><p class=\"\">    Its earnings before interest, tax and special items fell to 3.94 billion Danish crowns ($543.7 million) from 3.95 billion a year ago, lagging an average forecast of 4.28 billion in a     poll     of 18 analysts conducted by the company.  </p><p class=\"\">    DSV said it expects operating profit before special items this year of between 15.5 billion and 17.5 billion crowns, excluding the impact from its acquisition of Schenker, compared with 17.59 billion expected by analysts and the 16.1 billion it achieved in 2024.  </p><p class=\"\">    DSV is set to become the world's     biggest     logistics company after its $14.6 billion     acquisition     of Schenker which is expected to close in the second quarter.  </p><p class=\"\">    ($1 = 7.2467 Danish crowns)  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0BN:0-logistics-firm-dsv-q4-profit-lags-forecasts/",
            "pub_date": "2025-02-04 14:43:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000961_20250204001209:0",
            "title": "Mitsubishi Electric 3Q FY Infrastructure Segment Operating Profit Y30.5B, Up Y20.6B on Year>6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001209:0/",
            "pub_date": "2025-02-04 14:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cryptopotato:9ebd02c8a094b:0",
            "title": "Trump Approves US Sovereign Wealth Fund, Will it Buy Bitcoin?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On Feb. 3, President Trump announced plans to create a US sovereign wealth fund, a national investment vehicle designed to generate and distribute assets for American citizens.</p><p class=\"\">Trump signed the executive order at a White House event directing Treasury Secretary Scott Bessent and Secretary of Commerce Howard Lutnick, who are both pro-crypto, to “begin a process that will hopefully result in the creation of an American sovereign wealth fund.”</p><p class=\"\">“We’re going to create a lot of wealth for the fund,” Trump told reporters before adding, “And I think it’s about time that this country had a sovereign wealth fund.”</p><p class=\"\">The fund “will be a combination of liquid assets, assets that we have in this country as we work … to bring them out for the American people,” said Bessent, who added that it will be set up within the next 12 months, according to NBC.Bitcoin Backing?</p><p class=\"\">The fund could be potentially used to acquire strategic assets such as a potential takeover of the Chinese social media platformTikTok, alluded Lutnick. It could also leverage the US government’s massive purchasing power to gain equity in companies.</p><p class=\"\">“The extraordinary size and scale of the U.S. government and the business it does with companies … should create value for American citizens,” Lutnick said. Other countries with large sovereign wealth funds include Norway, China, Saudi Arabia, Australia, Iran, and Russia.</p><p class=\"\">In reaction to the news, Wyoming Senator Cynthia Lummis hinted that the fund could be used to buy Bitcoin.</p><p class=\"\">This is a ₿ig deal. https://t.co/ZShfQcEGwc</p><p class=\"\">— Senator Cynthia Lummis (@SenLummis) February 3, 2025</p><p class=\"\">However, if the fund does include BTC, it is likely to come from the stash that the United States already holds rather than buying more.</p><p class=\"\">According to Blockchain.com, an FBI-owned address linked toSilk Road seizuresstill holds 69,370 BTC worth around $6.8 billion at current market prices. Total US holdings exceed 207,000 BTC worth more than $20 billion, according to BiTBO.</p><p class=\"\">The US will buy Bitcoin.</p><p class=\"\">Trump just announced the creation of a US Sovereign Wealth Fund.</p><p class=\"\">It will be headed by Secretary of Commerce @howardlutnick and Treasury Secretary @ScottBessent528. Both like Bitcoin.</p><p class=\"\">I’d say there’s a 100% probability they buy Bitcoin.</p><p class=\"\">— Wayne Vaughan (@WayneVaughan) February 3, 2025</p><p class=\"\">BTC Price Recovers</p><p class=\"\">Crypto markets have recovered since the Trump tariffs weresuspendedon Monday. BTC reclaimed $102,000 in an intraday high but has since retreated back to around $99,000 at the time of writing, as the bounce may have been short-lived.</p><p class=\"\">AI and real-world asset tokenization altcoins were also surging, but Ethereum remained lackluster, failing to top $3,000 despite an endorsement from Eric Trump.</p></span></div>",
            "link": "https://www.tradingview.com/news/cryptopotato:9ebd02c8a094b:0-trump-approves-us-sovereign-wealth-fund-will-it-buy-bitcoin/",
            "pub_date": "2025-02-04 14:44:02",
            "source": "CryptoPotato",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0C5:0",
            "title": "Dassault Systemes signs strategic partnership with Volkswagen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">French software group Dassault Systemes  on Tuesday announced a long-term partnership with Volkswagen  to accelerate the German carmaker's transition towards software defined vehicles.</p><p class=\"\">Dassault's flagship software platform 3DEXPERIENCE was selected by Volkswagen as its main engineering and manufacturing platform, the French company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0C5:0-dassault-systemes-signs-strategic-partnership-with-volkswagen/",
            "pub_date": "2025-02-04 14:44:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463249:0",
            "title": "Tata Chemicals Swings to Loss in Fiscal Q3; Shares Down 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tata Chemicals  posted a consolidated attributable loss of 530 million Indian rupees in the fiscal third quarter, reversing a profit of 1.58 billion rupees a year ago. </p><p class=\"\">Loss per share came in at 2.08 rupees, compared with the year-ago earnings per share of 6.20 rupees, according to a Monday filing to the Indian stock exchanges. </p><p class=\"\">Revenue in the third quarter ended Dec. 31, 2024, declined to 35.9 billion rupees from 37.3 billion rupees a year earlier. </p><p class=\"\">Shares of the company were down over 4% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463249:0/",
            "pub_date": "2025-02-04 14:44:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001216:0",
            "title": "Mitsubishi Electric Announces Consolidated Financial Results for the Third Quarter (First 9 Months) of Fiscal 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mitsubishi Electric Announces Consolidated Financial Results for the Third Quarter (First 9 Months) of Fiscal 2025</p><p class=\"\">TOKYO--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Mitsubishi Electric Corporation (TOKYO: 6503) announced today its consolidated financial results for the third quarter (first 9 months), ended December 31, 2024, of the current fiscal year ending March 31, 2025 (fiscal 2025).</p><p class=\"\">The full document on Mitsubishi Electric's financial results can be viewed at the following link:</p><p class=\"\">www.MitsubishiElectric.com/news</p><p class=\"\">Consolidated Financial Results</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Billions of yen                         Q3 FY24  Q3 FY25      YoY <br/>-------------------------------------   -------  -------  ------------ <br/>Revenue                                 1,243.9  1,356.7  +112.8  109% <br/>Operating profit                           86.4    126.8   +40.3  147% <br/>%                                          7.0%     9.4%  +2.4pt     - <br/>Profit before income taxes                 89.2    167.8   +78.6  188% <br/>Net profit attributable to Mitsubishi <br/> Electric Corp. stockholders               65.8    129.4   +63.5  197% <br/>--------------------------------------  -------  -------  ------  ---- <br/> </pre><p class=\"\">Key Points</p><p class=\"\">1. Q3(*1) FY25(*2) : Revenue Yen1,356.7 bn (+Yen112.8 bn YoY), Operating Profit Yen126.8 bn (+Yen40.3 bn YoY)</p><p class=\"\">- Both revenue and operating profit achieved a new record high for Q3 due primarily to the impact of the weaker yen, increases in the Infrastructure and Life segments, and the partial share-transfer of MD LOGIS CORPORATION shares(*3) .</p><p class=\"\">- Continuous efforts are being made to improve profitability in the Infrastructure segment, including improvements in contract terms for orders.</p><p class=\"\">2. FY25 forecast: Revenue Yen5,400.0 bn (+Yen10.0 bn compared to the previous announcement), Operating Profit Yen400.0 bn (unchanged from the previous announcement)</p><p class=\"\">- Due mainly to foreign exchange rates reconsidered in line with the weaker yen, revenue is expected to exceed the previous announcement.</p><p class=\"\">- Mitsubishi Electric Group will steadily implement ongoing initiatives to improve profitability and efficiency in each business.</p><p class=\"\">3. Q1-Q3 FY25: Free cash flow improved by Yen174.2 bn YoY</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/> <br/>(*1)  Q3: Third quarter of the fiscal year (October--December) <br/>(*2)  FY25: April 1, 2024--March 31, 2025 <br/>(*3)  As a result of the transaction, the company has recorded approximately <br/>      Yen24.0 bn as operating profit, Yen5.0 bn as market valuation of <br/>      investments accounted for using the equity method, and Yen29.0 bn as <br/>      profit before income taxes. <br/> <br/> <br/> <br/>Note:  The results forecast above is based on assumptions deemed reasonable by <br/>       Mitsubishi Electric at the present time, and actual results may differ <br/>       significantly from forecasts. Please refer to the cautionary statement <br/>       in the full document. <br/>-----  ----------------------------------------------------------------------- <br/> </pre><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250203099638/en/</p><p class=\"\">CONTACT:    Investor Relations Inquiries</p><p class=\"\">Corporate IR&amp;SR Division</p><p class=\"\">Mitsubishi Electric Corporation</p><p class=\"\">Cad.Irg@rk.MitsubishiElectric.co.jp</p><p class=\"\">Media Inquiries</p><p class=\"\">Madoka Iwanaga</p><p class=\"\">Public Relations Division</p><p class=\"\">Mitsubishi Electric Corporation</p><p class=\"\">Tel: +81-3-3218-2332</p><p class=\"\">prd.gnews@nk.MitsubishiElectric.co.jp</p><p class=\"\">www.MitsubishiElectric.com/news/</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001216:0/",
            "pub_date": "2025-02-04 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr31XFzs:0",
            "title": "Year-end report January - December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Inwido<p class=\"\"><strong class=\"root-Tkn6WL2y\">Strong order intake in challenging markets</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fourth quarter</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales amounted to SEK 2,423 million (2,273), up 7 percent. Organic growth amounted to 5 percent.</li><li class=\"listItem-bmN0_SHH\">Total order intake adjusted for currency increased by 20 percent (up 19 percent organically) and the order backlog as of December 31 rose by 29 percent to SEK 2,490 million (1,937).</li><li class=\"listItem-bmN0_SHH\">Operating EBITA rose to SEK 296 million (290) and the operating EBITA margin amounted to 12.2 percent (12.7).</li><li class=\"listItem-bmN0_SHH\">EBIT amounted to SEK 261 million (272) and the EBIT margin amounted to 10.8 percent (12.0).</li><li class=\"listItem-bmN0_SHH\">Earnings per share before and after dilution amounted to SEK 3.17 (3.20) and SEK 3.16 (3.20) respectively.</li><li class=\"listItem-bmN0_SHH\">Net debt amounted to a multiple of 1.0 in relation to operating EBITDA (0.7 excluding IFRS 16).</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">January–December 2024</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales amounted to SEK 8,838 million (8,970), down 1 percent. Organic growth amounted to negative 6 percent.</li><li class=\"listItem-bmN0_SHH\">Operating EBITA totaled SEK 953 million (1,027) and the operating EBITA margin amounted to 10.8 percent (11.4).</li><li class=\"listItem-bmN0_SHH\">EBIT amounted to SEK 850 million (978) and the EBIT margin amounted to 9.6 percent (10.9).</li><li class=\"listItem-bmN0_SHH\">Return on operating capital amounted to 12.7 percent (15.4).</li><li class=\"listItem-bmN0_SHH\">Earnings per share before and after dilution amounted to SEK 9.29 (11.72) and SEK 9.26 (11.72) respectively.</li><li class=\"listItem-bmN0_SHH\">The Board of Directors proposes a dividend of SEK 5.50 (6.50).</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">CEO comments:</strong></p><p class=\"\">I am pleased to say that Inwido is growing again. For the first time since the fourth quarter of 2022, we are witnessing organic sales growth. The fact that this growth is also taking place in all business areas, despite challenges in several markets, and while maintaining good margins, is a show of strength.</p><p class=\"\">During the fourth quarter of the year, net sales increased by 7 percent (up 5 percent organically) to SEK 2,423 million (2,273). Order intake remained strong and increased for the third consecutive quarter, this time organically by 19 percent, mainly driven by the project market in Business Area Western Europe. Order intake also increased in all business areas except for Scandinavia, where order intake remained unchanged. In our assessment, Inwido is continuing to win market share in its main markets. Although leading macroeconomic indicators have become more positive and demand in some market segments has started to rise, several of our business units are still facing challenges in the form of low demand and fierce price pressure, above all in Finland, Norway, and the UK. In light of this, Inwido is maintaining good margins thanks to our increasingly efficient operational platform, our leading market positions and our governance model.</p><p class=\"\">In order to provide external stakeholders with a clearer picture of the Group’s sales, order intake and order book, Inwido is introducing a new market segment split as from the fourth quarter: Consumer/Project. This change, which was announced in connection with the Capital Markets Day in December, is mainly due to the large project orders that Sidey Group in particular, within Business Area Western Europe, wins from time to time. These orders, unlike the majority of the rest of the Group, are often significant in size and run for several years. A good example is the record order for North Lanarkshire Council, initially amounting to SEK 300 million over two years, that Sidey Group won in December 2024. With the new market split, we are better able to illustrate the fluctuations that occur within Project Sales, while Consumer Sales tend to be more stable.</p><p class=\"\">The focused work aimed at reducing the Group’s climate impact and achieving the established SBTi goals is proceeding well. An important milestone has now been reached, with scope 3, greenhouse gas emissions that take place outside the company’s direct control and operations, being reported for the first time. Overall for Scope 1, 2, and 3, greenhouse gas emissions fell by 15 percent relative to the base year, 2022. All key performance indicators for Health and Safety are developing positively, which is pleasing to note. The number of accidents decreased significantly as a result of an effective and well-established process.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area Scandinavia</strong> is continuing to deliver high margins. Higher sales combined with improved gross margins and cost control raised the operating EBITA margin to 17.1 percent (15.0). Our larger Danish units delivered at a high level, while the Swedish consumer market also began to show signs of a cautious recovery.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area Eastern Europe</strong> is still being affected by low volumes within new build, which is the primary reason for the margins having more than halved. On the other hand, the renovation market appears to have bottomed out, as can be seen from order intake, which increased by 10 percent during the quarter. At the end of the period, the order backlog was 26 percent higher compared with the same period last year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area e-Commerce</strong> is growing and its profitability is increasing. Sales for the fourth quarter rose to SEK 270 million, up 10 percent compared with the corresponding period in the preceding year. Operating EBITA almost doubled to SEK 23 million (12) and the operating EBITA margin rose to 8.6 percent (5.0) during the quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area Western Europe</strong> performed well in the fourth quarter, with a record order in Scotland and strong performance in Ireland. During the fourth quarter, profitability increased and operating EBITA ended up at SEK 54 million (46), while the operating EBITA margin rose to 11.6 percent (10.8).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Outlook:</strong></p><p class=\"\">Inwido is on an exciting journey of growth towards sales of SEK 20 billion by 2030. Step by step, we are moving in the right direction, strengthened by factors such as increased sales and order intake, as well as an ever more efficient operational platform. The main external drivers of Inwido’s profitable growth, both in the short and the long term, are a normalization of demand within renovation, the management of pent-up demand within new build, and the green transition to energy-efficient housing in the EU. In addition to these external factors, the Group is focusing on product development, internal cost and sales synergies, as well as value-creating acquisitions.</p><p class=\"\">In an uncertain environment, our outlook is supported by leading macro economic indicators and the positive momentum we have enjoyed since the second quarter of last year. All in all, this gives us confidence for the year we have just started.</p><p class=\"\">MALMÖ, FEBRUARY 4, 2025</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fredrik Meuller, </strong>President and CEO</p><p class=\"\">This information is such that Inwido AB (publ) is obliged to publish in accordance with the EU market abuse regulation and the Swedish Securities Market Act. The information was submitted by the below contact persons for publication on February 4, 2025 at 7:45 a.m. CET.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Fredrik Meuller, President and CEO</p><p class=\"\">Tel. +46 (0) 734 22 70 11</p><p class=\"\">Peter Welin, CFO and deputy CEO</p><p class=\"\">Tel. +46 (0) 703 24 31 90</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Inwido:</strong></p><p class=\"\">Inwido improves people's lives indoors with windows and doors. As Europe's leading window group, Inwido's business concept is to develop and sell the market's best customized window and door solutions through a decentralized structure and with a focus on the consumer-driven market in order to create long-term sustainable growth, organically and through acquisitions. Inwido consists of 35 business units with approximately 4,700 employees in twelve countries. In 2024 group sales amounted to SEK 8.8 billion with an operating EBITA margin of 10.8 percent. Inwido has been listed on Nasdaq Stockholm since 2014. Follow Inwido on LinkedIn.</p><p class=\"\">https://news.cision.com/inwido/r/year-end-report-january---december-2024%2Cc4099811</p><p class=\"\">Inwido_Q42024_ENG</p><p class=\"\">Strandhus Ålborg Danmark</p><p class=\"\">Fredrik Meuller cropped</p><p class=\"\">Peter Welin Inwido AB</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr31XFzs:0-year-end-report-january-december-2024/",
            "pub_date": "2025-02-04 14:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV00B:0",
            "title": "Unicaja Q4 Net Profit At 122 Mln Euros",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Unicaja Banco SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 NET PROFIT 122 MILLION EUROS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 NET INTEREST INCOME 634 MILLION EUROS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">BAD LOAN RATIO 2.7% AT END-DEC</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CET 1 FULLY LOADED 15.1% AT END-DEC</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV00B:0-unicaja-q4-net-profit-at-122-mln-euros/",
            "pub_date": "2025-02-04 14:45:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0HG:0",
            "title": "TomTom revenue drops; sees lower 2025 earnings on automotive market slowdown",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Dutch digital mapping specialist TomTom  reported a 2% drop in its annual revenue on Tuesday, slightly above estimates and said it expects lower 2025 earnings on continued challenges due to a slowdown in the global automotive market.</p><p class=\"\">The Amsterdam-based company posted a revenue of 574.4 million euros ($591.17 million) for the year ended Dec. 31, marginally above the 573 million euros expected in a company-provided consensus.</p><p class=\"\">The company, which makes 57% of its sales from automotive location technology applications, has been impacted by a slowdown in the automotive market, with an increase of 0.9% in new car sales in Europe, compared with a 13.9% jump a year earlier.</p><p class=\"\">Due to the market headwinds, TomTom suspended its 2025 location technology revenue outlook in July 2024. </p><p class=\"\">\"Given market conditions in Automotive, we continue to have limited visibility for 2025,\" CFO Taco Titulaer said in a release on Tuesday.</p><p class=\"\">The group expects lower revenue in 2025, between 505 million euros and 565 million euros. It sees location technology revenue between 440 million euros and 490 million euros, and free-cash flow at break-even in 2025.</p><p class=\"\">($1 = 0.9716 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0HG:0-tomtom-revenue-drops-sees-lower-2025-earnings-on-automotive-market-slowdown/",
            "pub_date": "2025-02-04 14:45:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204001018:0",
            "title": "Raiffeisen Bank: AO Raiffeisenbank Russia Booked EUR840M Legal Provision",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204001018:0/",
            "pub_date": "2025-02-04 14:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463238:0",
            "title": "Chinese Venture Capital Firm Signs 1.1 Billion-Euro Deal to Buy Majority Stake in Audio Equipment Maker Marshall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chinese venture capital and private equity firm HongShan Capital Group or HSC agreed to acquire a majority stake in Marshall Group in a 1.1 billion euro deal, Marshall said in a Jan. 24 press release on its webpage. </p><p class=\"\">Under the deal, the Marshall family will retain over 20% of the Sweden-based audio equipment manufacturing company, the release said. </p><p class=\"\">HSC will buy the 9.6% stake in Marshall from Swedish telecommunication company Telia for 101 million euros, according to a same-dated press release on Telia's webpage.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463238:0/",
            "pub_date": "2025-02-04 14:37:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0E9:0",
            "title": "Racing Force Q4 2024 Revenues At EUR 14.8 Mln, Up 15.5% Y/Y",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Racing Force SpA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 2024 REVENUES AT EUR 14.8 MLN, UP 15.5% Y/Y</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0E9:0-racing-force-q4-2024-revenues-at-eur-14-8-mln-up-15-5-y-y/",
            "pub_date": "2025-02-04 14:37:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:7abefe19c094b:0",
            "title": "Hold IndusInd Bank; target of Rs 1031: KR Choksey",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KR Choksey's research report on IndusInd Bank</p><p class=\"\">In Q3FY25, Net Interest Income (NII) decreased by 1.3% YoY (-2.2% QoQ) to INR 52,281 Mn. The NII was lower by 3.6%. Pre-Provision Operating Profits (PPOP) declined by 10.9% YoY (flat QoQ) in Q3FY25 to INR 36,007 Mn. The PPOP was a 2.6% miss compared to our estimates. The net profit for Q3FY25 stood at INR 14,023 Mn, a decline of 39.1% YoY (+5.3% QoQ). Near-term growth remains constrained by macroeconomic stress, elevated credit costs, and cautious lending in unsecured and microfinance segments, impacting margins and asset quality.</p><p class=\"\">Outlook</p><p class=\"\">We revise our Adjusted Book Value (ABV) downward by 4.3% for FY26E and 6.0% for FY27E, factoring in multiple stress points and a slower-than-anticipated recovery in the near to medium term. Rolling forward our valuation to FY27E, we assign a P/B multiple of 0.95x to the FY27E ABVPS of INR 1,084.8, leading to a revised target price of INR 1,031 (earlier INR 1,305). Given the current risk-reward dynamics, we maintain our “HOLD” rating on IndusInd Bank.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">IndusInd Bank - 04022025 - kr</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:7abefe19c094b:0-hold-indusind-bank-target-of-rs-1031-kr-choksey/",
            "pub_date": "2025-02-04 14:37:23",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        }
    ]
}