{
    "data": [
        {
            "id": "DJN_DN20250205005482_20250205005485:0",
            "title": "Starboard Value Nominates Four Director Candidates to Kenvue Board >KVUE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005482_20250205005485:0/",
            "pub_date": "2025-02-05 20:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309836:0",
            "title": "Piper Sandler Initiates Opera at Overweight With $25 Price Target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Opera  has an average rating of buy and mean price target of $24.29, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309836:0/",
            "pub_date": "2025-02-05 20:49:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309840:0",
            "title": "Loop Capital Downgrades Aspen Technology to Hold From Buy, Adjusts Price Target to $265 From $260",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aspen Technology  has an average rating of Hold and mean price target of $261, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309840:0/",
            "pub_date": "2025-02-05 20:49:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW19R:0",
            "title": "Investment manager T Rowe misses quarterly profit estimates on persistent capital outflows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Asset manager T Rowe Price  missed Wall Street estimates for fourth-quarter profit on Wednesday as capital outflows countered the gains from a rallying equities market.</p><p class=\"\">Investors have been opting for the low-cost offerings of passively managed funds over active managers such as T Rowe, resulting in 15 consecutive quarters of capital outflows for the firm.</p><p class=\"\">The Federal Reserve's 100-basis-point rate cuts in the later half of 2024 have boosted investor interest in passive offerings further, as it becomes harder for active managers to beat booming benchmark index returns.</p><p class=\"\">The equity rally boosted Baltimore, Maryland-based company's average assets under management (AUM), which determine its investment advisory fees, by 19.2% to $1.64 trillion in the quarter, despite $19.3 billion of net outflows. Total net outflows for the year were $43.2 billion.</p><p class=\"\">T Rowe's investment advisory fees, the primary driver of its revenue, rose 16.1% to $1.67 billion for the three months ended Dec. 31.</p><p class=\"\">Adjusted profit rose to $484.8 million, or $2.12 per share, for the quarter, compared with analysts' expectations of $2.20 per share.</p><p class=\"\">The company had posted an adjusted profit of $394.7 million, or $1.72 per share, a year earlier.</p><p class=\"\">Peers Invesco  and Franklin Templeton  beat profit estimates last week, helped by rising investment fees as their AUM expanded.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW19R:0-investment-manager-t-rowe-misses-quarterly-profit-estimates-on-persistent-capital-outflows/",
            "pub_date": "2025-02-05 20:49:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309780:0",
            "title": "ValOre Metals Affiliate Acquires Uranium Properties in Saskatchewan from Skyharbour Resources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ValOre Metals  said Wednesday that its affiliate Hatchet Uranium agreed to acquire interests in two Skyharbour Resources  projects in Saskatchewan. </p><p class=\"\">Hatchet could acquire an 80% stake in Skyharbour's Highway uranium property and a 100% interest, subject to a \"claw-back\" provision, in the Genie, Usam and CBX/Shoe uranium projects. </p><p class=\"\">As part of the deal, Hatchet is required to raise $1.5 million in equity from external investors. ValOre said this financing requirement has been completed. </p><p class=\"\">Hatchet will also pay $25,000 cash and issue 1,452,013 units to Skyharbour. Upon closing, ValOre will hold a 51.5% equity ownership interest in Hatchet, decreasing from 56.8%. </p><p class=\"\">ValOre's share price gained 3.9% on Tuesday to $0.0675 on the TSXV.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309780:0/",
            "pub_date": "2025-02-05 20:49:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309831:0",
            "title": "FirstService Q4 Adjusted Earnings, Revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FirstService  reported Q4 adjusted earnings Wednesday of $1.34 per diluted share, up from $1.11 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.37. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $1.37 billion, up from $1.08 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $1.31 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309831:0/",
            "pub_date": "2025-02-05 20:49:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309843:0",
            "title": "TD Cowen Initiates Palvella Therapeutics at Buy With $44 Price Target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309843:0/",
            "pub_date": "2025-02-05 20:49:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005490:0",
            "title": "Tempur Sealy Raised to Outperform From Market Perform by William Blair",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005490:0/",
            "pub_date": "2025-02-05 20:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005482_20250205005488:0",
            "title": "Starboard Value's Kenvue Nominatees Include Starboard CEO Jeffrey Smith >KVUE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005482_20250205005488:0/",
            "pub_date": "2025-02-05 20:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Tnw84YxNz:0",
            "title": "Cytophage Launches Incubator Egg Trials for OvaPhage in Partnership with Leading Canadian Hatchery",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\">WINNIPEG, MB – February 5,2025 – TheNewswire -Cytophage Technologies (‘Cytophage’ or‘the Company’) (TSXV: CYTO; FSE: 70G) is proud to announce a newpartnership with one of Canada’s leading poultry hatcheries to beginincubator egg trials for OvaPhage, an innovative bacteriophage productdesigned to only target harmful bacteria on the surface of eggs, whilepreserving the natural protective cuticle of eggs. The trials areexpected to be completed by the third quarter of this year, and arethe next steps in proving the efficacy of OvaPhage. Cytophage’searly lab tests have demonstrated a 99% reduction in bacterial load onthe surface of eggs, setting the stage for this critical new phase ofreal-world validation.  </p><p class=\"\">Upon completion of the trials, Cytophage plans toprepare regulatory submissions, paving the way for OvaPhage’sinitial market launch in Canada, with global expansion tofollow.</p><p class=\"\">There are over 200 hatching egg producers in Canada. In2023, hatching egg farmers produced approximately 868 million broilerhatching eggs according to theCanadian Hatching Egg Producers,generating $500 million in farm revenues. Cytophage’s partnerhatchery represents a key segment of this market, and is recognized asa leader in advanced poultry management systems. The hatchery’sstaff are working closely with Cytophage to improve resiliency andproductivity in the poultry industry. OvaPhage addresses key industrypriorities, such as reducing bacterial contamination and increasinghatch rates. </p><p class=\"\">“This moment marks a turning point for our company.Moving from the lab to incubator egg trials is a key milestone inproving OvaPhage’s real-world efficacy,” said Cytophage CEO Dr.Steven Theriault. “We are excited to demonstrate how this technologycan redefine standards for the industry.”  </p><p class=\"\">OvaPhage Trials Process </p><p class=\"\">The OvaPhage trials advance in three stages, each onemoving the product towards broader commercialization:   </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Trial Stage </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Objective </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Outcome </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Timeline </p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Stage #1: Feasibility </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Assess OvaPhage’s compatibility with hatcheryprocesses.  </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Demonstrate OvaPhage’s readiness for large-scaleapplication by verifying its adherence properties andefficacy. </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Q1 2025 </p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Stage #2: Optimization </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Determine the most effective phage concentration andmethods.  </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Defined conditions for optimal performance. </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Q1-Q2 2025  </p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Stage #3: Validation </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Demonstrate OvaPhage’s performance.  </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Confirmed productivity enhancements and measurablebenefits. </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Q2-Q3 2025 </p></td></tr></tbody></table></div><p class=\"\">“This is an exciting moment for Cytophage and ourinvestors,” said Julius Kalcevich, CFO of Cytophage. “The pathahead for OvaPhage is clear, and each milestone brings us closer totransforming poultry production and commercializing our innovativephage products.”  </p><p class=\"\">About Cytophage </p><p class=\"\">Cytophage Technologies (TSXV:CYTO / FSE: 70G) is a pioneeringbiotechnology company dedicated to bacteriophage research, productdevelopment and commercialization. </p><p class=\"\">Bacteriophages are viruses that only infect and killbacteria. These natural killers of bacteria can overcome cellular ororganism-level defences. They are nature’s version ofantibiotics. </p><p class=\"\">Cytophage is improving bacteria’s natural predatorswith environmental as well as genetic modifications to bring safe andtoxin free killer solutions to large addressable markets with aninitial focus on animal health which offers a fast-track to near-termrevenue. As a leading bacteriophage manufacturer in Canada and poweredby a large library of strains, Cytophage is committed to addressingthe global challenge of antibiotic resistance (AMR). The WHO predictsthat AMR will be the leading cause of human mortality by 2050. Manycountries have already banned or limited preventative antibiotic usein animal production including 27 EU countries, US, Canada, Brazil,Bangladesh, India and Mexico. In addition to that, consumers all overthe world are demanding organic and antibiotic-free products. </p><p class=\"\">Cytophage is using a de-risked and patented technologyto advance innovative and cost competitive products that harness thepower of bacteriophages to combat bacterial infections affecting humanhealth, animal health, and food security.  </p><p class=\"\">About OvaPhage </p><p class=\"\">At its core, OvaPhage represents a novel approach tobiosecurity for poultry hatcheries. Its advanced formulation enablesbacteriophages to adhere to eggshells, providing protection againstharmful bacteria like Salmonella, Escherichia andShigella species throughout the production process.  </p><p class=\"\">OvaPhage is part of the Company’s flagship suite ofanimal health products designed to target harmful bacteria without thetoxic effects of traditional chemicals. Key features willinclude:  </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Non-toxic and safe: Proven safe for animals, humans,and the environment.   </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Cuticle preservation: Maintains the egg’s naturalprotective barrier, improving hatch rates.   </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Easy to Use: Seamlessly integrates with existinghatchery systems.   </p></li></ul><p class=\"\">For further information please contact:  </p><p class=\"\">Heather Medwick, Chief Operating Officer </p><p class=\"\">heather@cytophage.com | 431 388 8873 </p><p class=\"\">For media inquiries, please contact: </p><p class=\"\">Simon Bredin, PR Advisor (media@cytophage.com)  </p><p class=\"\">Cautionary Statement on Forward-LookingInformation </p><p class=\"\">This news release contains“forward-looking information” and “forward-looking statements”(collectively, “forward-looking statements”) within the meaning ofthe applicable Canadian securities legislation. All statements, otherthan statements of historical fact, are forward-looking statements andare based on expectations, estimates and projections as at the date ofthis news release. Anystatement that involves discussions with respect to predictions,expectations, beliefs, plans, projections, objectives, assumptions,future events or performance (often but not always using phrases suchas “expects”, or “does not expect”, “is expected”,“anticipates” or “does not anticipate”, “plans”,“budget”, “scheduled”, “forecasts”, “estimates”,“believes” or “intends” or variations of such words andphrases or stating that certain actions, events or results “may”or “could”, “would”, “might” or “will” be taken tooccur or be achieved) are not statements of historical fact and may beforward-looking statements. Forward-looking statements involve knownand unknown risks, uncertainties and other factors which may cause theactual results, performance or achievements of Cytophage to bematerially different from any future results, performance orachievements expressed or implied by the forward-looking statements.Factors that could cause actual results to differ materially fromthose anticipated in these forward-looking statements are described under the caption “RiskFactors” in Cytophage’s Filing Statement dated January 30, 2024,which is available for view on SEDAR+ at www.sedarplus.ca. These risksinclude but are not limited to, the risks associated with thebacteriophage industry, such as operational risks in development orcapital expenditures, the uncertainty of extensive regulatory approvalrequirements, government regulations, protection of intellectualproperty, product liability and rapid technological advancements.Forward-looking statements contained herein are made as of the date ofthis press release, and Cytophage disclaims, other than as required bylaw, any obligation to update any forward-looking statements whetheras a result of new information, results, future events, circumstances,or if management’s estimates or opinions should change, orotherwise. There can be no assurance that forward-looking statementswill prove to be accurate, as actual results and future events coulddiffer materially from those anticipated in such statements.Accordingly, the reader is cautioned not to place undue reliance onforward-looking statements.  </p><p class=\"\">Neither the TSXV nor its RegulationServices Provider (as that term is defined in the policies of theTSXV) accepts responsibility for the adequacy or accuracy of this newsrelease. </p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Tnw84YxNz:0-cytophage-launches-incubator-egg-trials-for-ovaphage-in-partnership-with-leading-canadian-hatchery/",
            "pub_date": "2025-02-05 20:50:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSwdqsBa:0",
            "title": "Polaris Renewable Energy Declares Quarterly Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">TORONTO, ON / ACCESS Newswire / February 5, 2025 /</strong> Polaris Renewable Energy Inc.  (\"Polaris Renewable Energy\" or the \"Company\"), is pleased to announce that its board of directors has declared a quarterly dividend of US$0.15 per common share outstanding.</p><p class=\"\">This dividend will be paid on February 28th to shareholders of record at the close of business on February 17th. The dividend is an \"eligible dividend\" as designated for Canadian federal, provincial, and territorial income tax purposes.</p><p class=\"\">The board of directors of Polaris Renewable Energy remains committed to paying a quarterly dividend and will evaluate further dividend increases, as appropriate, going forward.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Polaris Renewable Energy Inc.</strong></p><p class=\"\">Polaris Renewable Energy Inc. is a Canadian publicly traded company engaged in the acquisition, development, and operation of renewable energy projects in Latin America &amp; the Caribbean. We are a high-performing and financially sound contributor to the energy transition.</p><p class=\"\">The Company's operations include a geothermal plant (~82 MW), four run-of river hydroelectric plants (~40 MW), three solar (photovoltaic) projects in operation (~35 MW) and one wind park (26 MW) following closing of the Puerto Rico acquisition.</p><p class=\"\">For more information, contact:</p><p class=\"\">Investor Relations</p><p class=\"\">Polaris Renewable Energy Inc.</p><p class=\"\">Phone: +1 647-245-7199</p><p class=\"\">Email: info@PolarisREI.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Cautionary Statements</strong></p><p class=\"\">This press release contains certain \"forward-looking information\" which may include, but is not limited to, statements with respect to future events or future performance, the expected use of proceeds or rating(s) of any such issuance, the Company's acquisition and other investment plans, any benefits to the Company's financial or business performance, the settlement date of the bonds and the listing of the bonds on the Oslo Alternative Bond Market. Such forward-looking information reflects management's current beliefs and is based on information currently available to management. Often, but not always, forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"predicts\", \"intends\", \"targets\", \"aims\", \"anticipates\" or \"believes\" or variations (including negative variations) of such words and phrases or may be identified by statements to the effect that certain actions \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. A number of known and unknown risks, uncertainties and other factors may cause the actual results or performance to materially differ from any future results or performance expressed or implied by the forward-looking information. Such factors include, among others, the ability of the Company to satisfy any interest payments, which may be affected by such factors as general business, economic, competitive, political and social uncertainties; the actual results of current geothermal, solar and hydro energy production, development and/or exploration activities and the accuracy of probability simulations prepared to predict prospective geothermal resources; changes in project parameters as plans continue to be refined; possible variations of production rates; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes and other risks of the geothermal and hydro power industries; political instability or insurrection or war; labour force availability and turnover; delays in obtaining governmental approvals or in the completion of development or construction activities, or in the commencement of operations; the ability of the Company to continue as a going concern and general economic conditions, as well as those factors discussed in the section entitled \"Risk Factors\" in the Company's Annual Information Form. These factors should be considered carefully and readers of this press release should not place undue reliance on forward-looking information.</p><p class=\"\">Although the forward-looking information contained in this press release is based upon what management believes to be reasonable assumptions, there can be no assurance that such forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, readers should not place undue reliance on forward-looking information. The information in this press release, including such forward-looking information, is made as of the date of this press release and, other than as required by applicable securities laws, Polaris assumes no obligation to update or revise such information to reflect new events or circumstances.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Polaris Renewable Energy Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSwdqsBa:0/",
            "pub_date": "2025-02-05 20:50:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0JM:0",
            "title": "US futures knocked by Alphabet earnings; gold strikes record",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar loses out to yen, Treasury yields ease</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Wall St futures dip after Alphabet earnings disappoint</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold at record; Europe stocks helped by Novo Nordisk beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">        U.S. stock futures fell on Wednesday after disappointing earnings from Alphabet, while the dollar took a dive against the yen, which rallied sharply after Japanese wage data upped the chances of another rate hike.  </p><p class=\"\">Investors shrugged off comments from President Donald Trump that the U.S. would like to take over the <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/israel-hamas/\" rel=\"nofollow\" target=\"_blank\">war-ravaged Gaza Strip</a> and develop it economically.</p><p class=\"\">The suggestion came out of the blue and underlined the risk of more policy uncertainty and market volatility ahead. Gold hit another record high, driven mostly by a weaker dollar.</p><p class=\"\">    S&amp;P 500 futures  fell 0.5% and Nasdaq futures  lost 0.9%.      </p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area,\" said Paul Donovan, chief economist at UBS Global Wealth Management.</p><p class=\"\">Volatility across markets has run high in the last few trading days since Trump announced he would slap <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/tariffs/\" rel=\"nofollow\" target=\"_blank\">tariffs</a> on Canada and Mexico, only to backpedal within hours and agree to a one-month delay.</p><p class=\"\">Some sense of calm returned by Wednesday, leaving investors to focus on more micro-led events such as company earnings, where Google parent Alphabet missed forecasts as it ramped up spending on capex. Its shares fell 7% in premarket trading, suggesting a heavy fall at the opening bell later.    </p><p class=\"\">    Other stocks in focus were Walt Disney , which rose 0.8%, while those in ride-hailing app Uber  dropped 4%.  </p><p class=\"\">In Europe, activity was dominated by a heavy day for earnings, where shares in Novo Nordisk , the most valuable company in the region, rose 1.6% after beating fourth-quarter expectations, which helped lift the STOXX 600  by 0.1% on the day.</p><p class=\"\">The delays to tariffs have eased concern about how much scope the Federal Reserve might have to cut interest rates this year, pushing Treasury yields lower, although with China and Europe still in Trump's sights, the mood was cautious.</p><p class=\"\">\"The period of doubt - during which worries about 'tariff risk' prevails in the market - is not over yet,\" Thierry Wizman, global FX and rates strategist at Macquarie, said in a note.</p><p class=\"\">\"Traders may revisit those doubts in 30 days, as Trump tries to extract more concessions from Mexico and Canada, and then the EU.\" </p><p class=\"\">DOLLAR SOFTENS</p><p class=\"\">Yields on two-year Treasuries (US2YT=RR) eased 2 basis points on the day to below 4.2%, which in turn took some sheen off the dollar. The U.S. currency is relatively flat so far this year against a basket of major currencies, having risen 7% in 2024.</p><p class=\"\">Chinese markets returned from a week-long break for the Lunar New Year holidays. China has, so far, made a relatively restrained response to Trump's additional 10% in tariffs, announcing levies that cover just $14 billion of U.S. exports.</p><p class=\"\">Beijing set a firm fix for its yuan, countering concerns that it might allow the currency to slide to offset the impact of tariffs on its exports.</p><p class=\"\">Elsewhere in Asia, the Japanese yen  strengthened sharply against a range of currencies, after upbeat data on wages supported expectations of further tightening by the Bank of Japan this year.</p><p class=\"\">    The dollar fell 1% against the yen to 152.785, while the euro  was down 0.6% at 159.09.  </p><p class=\"\">Against the dollar, the euro rose 0.3% to $1.041 , having pulled off a two-year trough of $1.0125 at the start of the week. The dollar also fell 0.2% against the Canadian dollar to C$1.4293 , below this week's 22-year high at C$1.4792.</p><p class=\"\">In commodities, gold hit a fresh all-time high at $2,877 an ounce , buoyed in part by the pullback in the dollar and Treasury yields.</p><p class=\"\">Oil prices were weighed down by China's tariffs on imports of U.S. oil, which offset a potential boost from reports Trump had restored his \"maximum pressure\" campaign on Iran in a bid to drive Iranian oil exports to zero. </p><p class=\"\">Brent crude futures  fell 1.2% to $75.29 a barrel, while U.S. crude  fell 1.2% to $71.84.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0JM:0-us-futures-knocked-by-alphabet-earnings-gold-strikes-record/",
            "pub_date": "2025-02-05 20:50:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309844:0",
            "title": "JPMorgan Downgrades Federated Hermes to Underweight From Neutral, Adjusts Price Target to $41 From $42",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Federated Hermes  has an average rating of Hold and mean price target of $42, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309844:0/",
            "pub_date": "2025-02-05 20:50:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005432:0",
            "title": "Advanced Micro Devices Is Maintained at Neutral by B of A Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:43 GMT) </strong>Advanced Micro Devices Price Target Cut to $135.00/Share From $155.00 by B of A Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005432:0/",
            "pub_date": "2025-02-05 20:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b5fc1ba9b9da5:0",
            "title": "Lucky Strike Entertainment Corp SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lucky Strike Entertainment Corp, a leading provider of entertainment venues featuring bowling, food, and amusement activities, has released its Form 10-Q report for the fourth quarter of 2024. The report highlights the company's financial performance and operational activities, providing insights into its revenue streams, profitability, and future growth plans.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Total Revenues:</strong> $300.1 million, a decrease of 2% compared to the same period last year due to a decline in same-store sales, partially offset by new locations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $46.9 million, representing 16% of total revenues, a decrease of 5% from the previous year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income:</strong> $28.3 million, a significant improvement from a net loss of $63.5 million in the prior year, driven by a decrease in the fair value of the earnout liability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income Per Share, Basic:</strong> $0.17, compared to a loss of $0.44 per share in the previous year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income Per Share, Diluted:</strong> $0.16, compared to a loss of $0.44 per share in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong></p> <p class=\"\">The company reported a slight decrease in bowling revenue by 4% for the three months ended December 29, 2024, compared to the same period last year. Food and beverage revenue remained relatively stable, while amusement and other revenue increased by 2%. For the six months ended December 29, 2024, food and beverage revenue increased by 7%, and amusement and other revenue saw a significant increase of 17%.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">New Production Launches</strong></p> <p class=\"\">The company completed and opened four newly built Lucky Strike locations in prime markets, with two others underway, indicating an expansion in production capacity and market presence.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">The company remains focused on creating long-term shareholder value through continued organic growth, conversion and upgrading of locations to more upscale entertainment concepts, opening new locations, and acquisitions. The company anticipates an increased acquisition environment during the 2025 fiscal year to further diversify its location-based entertainment offerings.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1840572/000162828025003930/bowl-20241229.htm\" rel=\"nofollow\" target=\"_blank\">Lucky Strike Entertainment Corp [ BOWL ] - 10-Q - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:b5fc1ba9b9da5:0-lucky-strike-entertainment-corp-sec-10-q-report/",
            "pub_date": "2025-02-05 20:43:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW12T:0",
            "title": "Nasdaq futures stumble on bleak Alphabet, AMD forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Chipotle falls after tepid sales forecast</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Disney gains after Q1 results beat estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Futures down: Dow 0.04%, S&amp;P 500 0.45%, Nasdaq 0.84%</li></ul></span></div><span><p class=\"\">    U.S. stock index futures declined on Wednesday, with the tech-heavy Nasdaq leading losses after disappointing forecasts from Alphabet and AMD in a busy day for corporate earnings.</p><p class=\"\">Google-parent Alphabet  dropped 7.1% in premarket trading after posting downbeat cloud revenue growth and earmarking a higher-than-expected $75 billion for its AI buildout this year, fanning concerns about its hefty investments into the technology.</p><p class=\"\">\"While some investors may have hoped that Silicon Valley would exercise caution in the wake of China's AI innovations, the opposite is occurring,\" Jochen Stanzl, chief market analyst at CMC Markets, said in a mailed statement.</p><p class=\"\">Advanced Micro Devices  lost 9.1% after CEO Lisa Su said the company's current-quarter data center sales - a proxy for its AI revenue - would fall about 7% from the previous quarter. </p><p class=\"\">Meanwhile, Apple  shed 2.6% after Bloomberg News reported that China's antitrust regulator was preparing for a possible investigation of the iPhone maker.</p><p class=\"\">At 07:08 a.m. ET, Dow E-minis  were down 20 points, or 0.04%, S&amp;P 500 E-minis  were down 27.25 points, or 0.45%, and Nasdaq 100 E-minis  were down 181.25 points, or 0.84%.</p><p class=\"\">All three major Wall Street indexes closed higher on Tuesday, with energy shares outperforming, while an earnings-driven jump in Palantir  boosted technology shares. </p><p class=\"\">A January private payrolls reading is due at 8:15 a.m. ET on Wednesday, while a survey on U.S. services activity for the month is due shortly after markets open.</p><p class=\"\">The all-important January nonfarm payrolls report is expected to be released on Friday.</p><p class=\"\">Markets also looked for developments on the tariffs front.</p><p class=\"\">U.S. President Donald Trump said on Tuesday he was in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the countries, sparked by sweeping 10% U.S. tariffs on all Chinese imports.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:817.658349328215px;aspect-ratio:1.3627639155470248\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW12T-30b95821f61fdb612ad90ae5923497be-resized.webp\" type=\"images/webp\"/><img alt=\"Wall Street's &quot;fear gauge&quot; has moved sharply recently due to several factors like tariffs, inflation worries and questions about AI spending\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW12T-30b95821f61fdb612ad90ae5923497be-resized.jpeg\" style=\"background-color:#2a2928\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Volatility spiked in US markets for the last month</span></figcaption></figure></span></p><p class=\"\">Morgan Stanley joined Barclays and Macquarie in forecasting a single 25-basis-point interest rate cut by the U.S. Federal Reserve this year, citing uncertainty from Trump's tariff policy.</p><p class=\"\">Fed Vice Chair Philip Jefferson as well as San Francisco Fed President Mary Daly on Tuesday reiterated the central bank's message that policymakers need not rush into easing rates further.</p><p class=\"\">Comments from four Fed heads including Richmond Fed President Thomas Barkin will be on the radar through the day.</p><p class=\"\">In other moves, FMC Corp  plunged 21.3% after the agrichemicals producer forecast first-quarter revenue below estimates.</p><p class=\"\">Chipotle Mexican Grill  slid 5.6% after the burrito maker forecast tepid annual comparable sales growth and said if Trump's proposed tariffs against Mexico went into full effect, the company would take a roughly 60-basis-point impact on its raw material costs this year.</p><p class=\"\">U.S.-listed shares of Chinese e-commerce firm PDD Holdings  dropped 6.6% after a report that the U.S. was considering whether to add PDD's Temu to Homeland Security's \"forced labor\" list.</p><p class=\"\">        Walt Disney  gained 1.4% after sharply outperforming quarterly earnings estimates.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW12T:0-nasdaq-futures-stumble-on-bleak-alphabet-amd-forecasts/",
            "pub_date": "2025-02-05 20:43:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005441:0",
            "title": "InMode Is Maintained at Overweight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:44 GMT) </strong>InMode Price Target Raised to $29.00/Share From $26.00 by Barclays</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005441:0/",
            "pub_date": "2025-02-05 20:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Obi1yVnFa:0",
            "title": "Verd Boligkreditt AS - Covered bond mandate VEBK30",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Verd Boligkreditt AS (Aaa Moody's) has mandated Danske Bank, DNB Markets andSEBfor a possible tap issue of VEBK30 PRO (NO0013329276), maturing September 282029, subject to market conditions. Tap size minimum NOK 3 billion, increasingoutstanding amount to min NOK 6bn (LCR lvl 1b).</p><p class=\"\">Contact persons at Verd Boligkreditt AS:</p><p class=\"\">Sigve Husebø, CEO, Tel: +47 971 26 494Ola Engelsen, Risk Manager, Tel: +47 992 71 524</p><p class=\"\">This information is subject to disclosure requirements under Section 5-12 oftheNorwegian Securities Trading Act.</p><p class=\"\">https://newsweb.oslobors.no/message/637776</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Obi1yVnFa:0-verd-boligkreditt-as-covered-bond-mandate-vebk30/",
            "pub_date": "2025-02-05 20:44:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309811:0",
            "title": "Dayforce Down 3% In US Premarket As Reports Q4 Beat, But Forecasts Lower Than Expected Revs To Come",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dayforce  on Tuesday reported higher adjusted profit and revenue for its fourth quarter that beat estimates. </p><p class=\"\">The company, which provides human resource software, said adjusted net income rose to US$97.1 million, or US$0.60 per adjusted diluted share, from US$80.3 million, or US$0.50 per share, the previous year. The result beat the consensus forecast from FactSet of US$0.45. </p><p class=\"\">Fourth-quarter revenue rose 16% to US$465.2 million. The FactSet estimate was for US$455.1 million. Dayforce said recurring revenue was US$347.9 million, up 19.1%. </p><p class=\"\">The company is forecasting first-quarter revenue, excluding float, of US$421 million, to US$427 million. </p><p class=\"\">It is anticipating total revenue of US$1.75 billion to US$1.76 billion, for 2025. Analysts surveyed by FactSet expect US$1.96 billion. </p><p class=\"\">\"The fourth quarter of 2024 was the strongest sales quarter in our history - helping us close out a successful year with robust growth across both new business and add-on sales,\" said Dayforce President Stephen Holdridge. \"We saw a healthy mix of enterprise, major-market, and global sales on top of annual gross retention rate of 98% - another company record. This momentum, alongside the strength of our sales pipeline, gives us great confidence in our right to continue winning in 2025.\"</p><p class=\"\">Dayforce was last seen down US$2.24 to US$69.50, in New York trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309811:0/",
            "pub_date": "2025-02-05 20:44:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309830:0",
            "title": "RBC Raises Price Target on Celestica to $160 From $140, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Celestica  has an average rating of buy and mean price target of $138.91, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309830:0/",
            "pub_date": "2025-02-05 20:44:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA7LHTJ6:0",
            "title": "ValOre Affiliate Hatchet Uranium Corp. Closes $1,500,000 Financing Related to Saskatchewan Uranium Properties Acquisitions",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ValOre Metals Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">VALORE AFFILIATE HATCHET URANIUM CORP. CLOSES $1,500,000 FINANCING RELATED TO SASKATCHEWAN URANIUM PROPERTIES ACQUISITIONS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA7LHTJ6:0-valore-affiliate-hatchet-uranium-corp-closes-1-500-000-financing-related-to-saskatchewan-uranium-properties-acquisitions/",
            "pub_date": "2025-02-05 20:44:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr7kyBmh:0",
            "title": "Year-end report January - December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Hemsö Fastighets AB<ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Rental income increased 6 per cent to SEK 5,130 million (4,818).</li><li class=\"listItem-bmN0_SHH\">Profit from property management increased 7 per cent to SEK 2,498 million (2,345).</li><li class=\"listItem-bmN0_SHH\">Operating cash flow increased 3 per cent to SEK 2,391 million (2,329).</li><li class=\"listItem-bmN0_SHH\">Changes in the value of properties amounted to SEK -99 million (-5,287).</li><li class=\"listItem-bmN0_SHH\">Changes in the value of financial instruments amounted to SEK -234 million (-225).</li><li class=\"listItem-bmN0_SHH\">Profit after tax for the year amounted to SEK 1,886 million (-2,721).</li><li class=\"listItem-bmN0_SHH\">The market value of the properties amounted to SEK 85,973 million (82,624).</li><li class=\"listItem-bmN0_SHH\">During the year, SEK 3,490 million (2,825) was invested in the existing property portfolio.</li><li class=\"listItem-bmN0_SHH\">During the year, 5 properties (8) were acquired for SEK 276 million (351) and 16 properties (2) were divested for SEK 1,367 million (93).</li></ul><p class=\"\">“In 2024, we completed development projects that provided 82 new nursing home beds and 4,700 new school places to society. We also signed lease agreements for refurbishment and new development projects totaling 70,000 square meters and SEK 190 million in annual rent, and we continue to experience strong tenant demand. I am proud of Hemsö's contribution to the development of society, and my colleagues who make it possible”, says Nils Styf, CEO, Hemsö.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Nils Styf, CEO                                                                                 +46 8-501 170 01</p><p class=\"\">Rutger Källén, CFO and Deputy CEO                                            +46 8-501 170 35</p><p class=\"\">This information is information that Hemsö Fastighets AB is obliged to make public pursuant to the EU Market Abuse Regulation and the Swedish Securities Market Act. The information was submitted for publication, through the agency of the contact persons set out above, on 5 February 2025 at 13:45 CET.</p><p class=\"\">Hemsö is Sweden’s leading owner of properties for public use. The business is based on sustainably owning, managing and developing properties for nursing home, education, health care and the judicial system. Hemsö has properties in Sweden, Germany and Finland. The hallmarks of Hemsö’s business are long-term leases and stable tenants. The Third Swedish National Pension Fund (AP3) is the majority owner. The total value of Hemsö’s property portfolio is SEK 86 billion. Hemsö has had a credit rating of A- from Standard &amp; Poor’s since March 2015, AA- from Fitch Ratings since March 2024 and A3 from Moody's since February 2025. More information can be found at: www.hemso.se.</p><p class=\"\">https://news.cision.com/hemso-fastighets-ab/r/year-end-report-january---december-2024%2Cc4099044</p><p class=\"\">Financial Report in PDF format</p><p class=\"\">Press release in PDF format</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr7kyBmh:0-year-end-report-january-december-2024/",
            "pub_date": "2025-02-05 20:45:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309833:0",
            "title": "RBC Trims Price Target on Chipotle Mexican Grill to $70 From $75, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chipotle Mexican Grill  has an average rating of overweight and mean price target of $66.39, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309833:0/",
            "pub_date": "2025-02-05 20:45:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1VZ:0",
            "title": "Europe steps out from US shadow in 2025, but for how long",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    European stocks have staged their best performance in a decade against Wall Street in the first six weeks of 2025, but hopes among some they can finally end years of underperformance could yet be dashed by long-standing structural challenges.</p><p class=\"\">Seizing on extreme company valuation gaps, investors are piling into European equities, eyeing several potential catalysts that might mean this rally is different from those before, which have typically fizzled fairly quickly.    </p><p class=\"\">Fund inflows into European stocks reached their second-highest in 25 years in January and major benchmarks continue to hit record highs, beating their U.S. counterparts, as investors look for the region's stars to finally align.</p><p class=\"\">The hope is that Germany might loosen its fiscal policy after elections this month, tensions in Ukraine could subside and U.S. tariffs might end up being less severe than feared. </p><p class=\"\">And the recent rout in stocks of Wall Street's artificial intelligence megacaps on the emergence of cheaper Chinese rivals suggests market leadership could expand to neglected sectors, in which Europe is particularly strong.</p><p class=\"\">Gains in Frankfurt, Zurich, London, Milan and Paris so far this year have propelled the broader STOXX 600  up by more than 5.5%, while the S&amp;P 500 has risen only 2.7%.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:797.7464788732394px;aspect-ratio:1.3295774647887324\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV1VZ-c69066dda428cdc1dfb1e077e9abf48d-resized.webp\" type=\"images/webp\"/><img alt=\"snapshot\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV1VZ-c69066dda428cdc1dfb1e077e9abf48d-resized.jpeg\" style=\"background-color:#1f1f1d\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Wall Street trails Europe</span></figcaption></figure></span></p><p class=\"\">LEG UP </p><p class=\"\">Marc Halperin, portfolio manager at Edmond de Rothschild AM, is upbeat, especially given the stretched investor positioning. </p><p class=\"\">\"Where is the marginal seller? It's hard to find because everyone is today largely underweight on Europe,\" said Halperin, who in December increased his euro zone cyclical stock holdings. </p><p class=\"\">Halperin anticipates a rebound in leading indicators, potential interest rate cuts from the European Central Bank and the U.S. Federal Reserve pausing, as well as a possible Ukraine ceasefire reducing energy costs.    </p><p class=\"\">\"Europe is focused on sectors like automotive, which have significant room to grow because they are depressed. This strong performance seen since the start of the year could last a little more in the weeks and months to come,\" he added. </p><p class=\"\">Research firm SentimenTrader notes that several technical metrics that reflect how broad a rally is - such as the 10-day advance/decline ratio and stocks that are trading above their 50-day moving averages - have spiked.</p><p class=\"\">This draws a pattern that historically has preceded a period of gains over the next one to three months, it said.</p><p class=\"\">Nordea strategist Hertta Alava, meanwhile, also anticipates further outperformance in the coming months as valuations are attractive and earnings growth is accelerating, which will narrow the gap with U.S. companies. </p><p class=\"\">At 14 times expected earnings, the MSCI Europe (.dMIEU00000NEU) trades at a near record discount of 37.5% to the MSCI USA (.dMIUS00000PUS), LSEG data shows. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:798.5915492957747px;aspect-ratio:1.3309859154929577\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV1VZ-3c9882f900e92a0f5488458d247d5297-resized.webp\" type=\"images/webp\"/><img alt=\"snapshot\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV1VZ-3c9882f900e92a0f5488458d247d5297-resized.jpeg\" style=\"background-color:#2e251c\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Europe discount to US</span></figcaption></figure></span></p><p class=\"\">Since the late 1980s, U.S. stocks have increased by 25 times, while European stocks have risen by less than six.</p><p class=\"\">However, any further surge is unlikely to truly challenge Wall Street's long-term dominance. Europe has seen occasional rallies over the past 40 years, but these have tended to be short-lived, especially after the global financial crisis.</p><p class=\"\">Michele Morganti, strategist at Generali Investments, also notes lower growth in U.S. tech earnings and possible bolder China stimulus measures might allow for a shift towards Europe.</p><p class=\"\">But structural challenges remain, he said, adding: \"Europe still faces issues, such as less energy independence, poor governance ... fragmented energy and capital markets, lower population growth, and lower tech investments\".  </p><p class=\"\">European earnings growth this year is expected to accelerate significantly, to 7.9% from just 1% last year and following a 3.9% decline in 2023, LSEG IBES forecast show.</p><p class=\"\">In contrast, while U.S. earnings growth is expected to increase at a slower rate this year, it is still anticipated to be higher than Europe's, at 14.1%, from over 10% last year </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1VZ:0-europe-steps-out-from-us-shadow-in-2025-but-for-how-long/",
            "pub_date": "2025-02-05 20:45:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1OG:0",
            "title": "Capri Holdings Ltd reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Capri Holdings Ltd  reported quarterly adjusted earnings of 45 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $1.20.  The mean expectation of fifteen analysts for the quarter was for earnings of 66 cents per share. Wall Street expected results to range from 54 cents to 85 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 11.6% to $1.26 billion from a year ago; analysts expected $1.26 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Capri Holdings Ltd's reported EPS for the quarter was a loss of $4.61​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported a quarterly loss of $547 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Capri Holdings Ltd shares had risen by 14.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 33.7% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, three analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 12 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the apparel &amp; accessories retailers peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Capri Holdings Ltd is $24.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 12:45 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.66</p></td><td><p class=\"\">0.45</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.75</p></td><td><p class=\"\">0.65</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.59</p></td><td><p class=\"\">0.04</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.65</p></td><td><p class=\"\">0.42</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1OG:0-capri-holdings-ltd-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 20:46:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN4ZVP7V:0",
            "title": "BeammWave Adopts English as the Primary Language for Public Disclosures",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BeammWave has decided to adopt English as the primary language for public disclosures.</p><p class=\"\">The change takes effect immediately as of today, February 5, 2025. This means that the company will henceforth communicate all public information in English. However, certain information will still be published in Swedish in accordance with applicable regulations.</p><p class=\"\">The decision to switch languages is based on the company’s increasing international presence and the growing interest from global stakeholders, including customers and business partners.</p><p class=\"\">Sign up for BeammWave's newsletter at:</p><p class=\"\">BeammWave Newsletter</p><p class=\"\">Follow us on</p><p class=\"\">LinkedIn</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN4ZVP7V:0-beammwave-adopts-english-as-the-primary-language-for-public-disclosures/",
            "pub_date": "2025-02-05 20:46:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005391:0",
            "title": "Johnson Controls Names Weidemanis CEO, Logs 1Q Income Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Rob Curran</p><p class=\"\">Johnson Controls named Danaher executive Joakim Weidemanis as chief executive to succeed George Oliver, who last year divulged plans to step down following pressure from activist investment firm Elliott Investments.</p><p class=\"\">Separately, the maker of heating, ventilation and air-conditioning machinery posted fiscal first-quarter earnings growth and boosted its earnings projection for the year ending in September.</p><p class=\"\">Weidemanis is slated to start as CEO on March 12. Oliver will remain as nonexecutive chairman until July 31, at which point he will be succeeded in that role by Mark Vergnano, who has sat on the board since 2016. Oliver will then serve as an adviser, supporting the leadership transition until the end of 2025.</p><p class=\"\">Weidemanis had a 13-year career as an executive at industrial conglomerate Danaher, most recently as executive vice president, diagnostics and China, and he previously worked at Swiss industrial firm ABB.</p><p class=\"\">Johnson posted earnings of $419 million, or 63 cents a share, for the quarter ended in December, up from $374 million, or 55 cents a share, a year earlier.</p><p class=\"\">On an adjusted basis, the Ireland-based company logged earnings of 64 cents a share, compared with the mean analyst estimate of 59 cents a share, per FactSet.</p><p class=\"\">Sales rose 4% to $5.43 billion, surpassing the mean analyst estimate of $5.29 billion.</p><p class=\"\">For the fiscal second quarter, Johnson targeted adjusted earnings between 77 cents and 79 cents a share.</p><p class=\"\">For the fiscal year, the company boosted its forecast for adjusted earnings to a range between $3.50 and $3.60 a share from a previous target of $3.40 to $3.50 a share.</p><p class=\"\">Johnson started a chief-executive search in July, when Oliver disclosed plans to step down in response to an activist-investor campaign from Elliott. Oliver noted the company's tightening of its focus during his tenure.</p><p class=\"\">Write to Rob Curran at rob.curran@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005391:0/",
            "pub_date": "2025-02-05 20:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005396:0",
            "title": "Intuitive Machines Initiated at Underperform by B of A Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:39 GMT) </strong>Intuitive Machines Price Target Announced at $16.00/Share by B of A Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005396:0/",
            "pub_date": "2025-02-05 20:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005383:0",
            "title": "Dayforce 4Q Profit Declines Despite Revenue Increase, Outlook Below Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Denny Jacob</p><p class=\"\">Dayforce posted lower profit in fourth quarter despite higher revenue, while its outlook for the current quarter and year came in below what Wall Street expected.</p><p class=\"\">The company, whose offerings include providing human resources, payroll and benefits, recorded net income of $10.8 million, or 7 cents a share, compared to $45.6 million, or 29 cents a share, a year earlier.</p><p class=\"\">Stripping out certain one-time items, earnings came in at 60 cents a share. Analysts polled by FactSet expected 58 cents a share.</p><p class=\"\">Revenue rose to $465.2 million from $399.7 million. Analysts polled by FactSet expected $482.3 million.</p><p class=\"\">\"The fourth quarter of 2024 was the strongest sales quarter in our history — helping us close out a successful year with robust growth across both new business and add-on sales,\" said Chief Operating Officer Stephen Holdridge.</p><p class=\"\">Dayforce guided for revenue, excluding float, between $421 million and $427 million in the first quarter. Analysts polled by FactSet expected $482.3 million.</p><p class=\"\">For 2025, Dayforce forecast revenue growth excluding float to come in between $1.75 billion and $1.76 billion. Analysts polled by FactSet expected $1.96 billion.</p><p class=\"\">Write to Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005383:0/",
            "pub_date": "2025-02-05 20:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005394:0",
            "title": "8X8 Is Maintained at Equal-Weight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005394:0/",
            "pub_date": "2025-02-05 20:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}