{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX4FwZzB:0",
            "title": "FirstBank Reports Strong Q4 Results and a Record-Setting Colorado Gives Day",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LAKEWOOD, Colo., Feb.  05, 2025  (GLOBE NEWSWIRE) — FirstBank, one of the nation’s largest privately held banks with a focus on “banking for good,” announced its 2024 fourth-quarter summary of the company’s holdings and activities. The bank reported the following year-end and quarter-over-quarter results:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net income for 2024 was $226.1 million</li><li class=\"listItem-bmN0_SHH\">Total deposits increased by 0.4% in the fourth quarter to $24 billion</li><li class=\"listItem-bmN0_SHH\">Net loan balance remained unchanged during Q4 at $16.1 billion</li><li class=\"listItem-bmN0_SHH\">Total assets decreased by 0.7% to $27.2 billion from Sept. 30, 2024 to Dec. 31, 2024</li></ul><p class=\"\">In addition to growing both customer relationships and deposits in the fourth quarter, the bank reported over $3 billion in loan originations throughout the 2024 calendar year and recently expanded its instant payment offerings to include the FedNow Service. FirstBank now offers multiple instant payment options that are transmitted instantaneously and are available 24 hours a day, 365 days a year.</p><p class=\"\">The bank and Colorado Gives Foundation also helped raise a record-setting $54.6 million for Colorado Gives Day this past December, benefiting more than 4,200 area nonprofits. To promote the online giving movement, FirstBank surprised several deserving individuals, who were encouraged to “Give It Forward” to their favorite Colorado Gives Day nonprofits.</p><p class=\"\">“We’re committed to long-term, sustainable success, and sound financial management,” says Kevin Classen, CEO of FirstBank. “Our focus on smart, strategic growth not only ensures a stronger financial foundation, it allows us to reinvest in the well-being of our customers, communities, and employees, so everyone can thrive.”</p><p class=\"\">As part of FirstBank’s commitment to increased affordable housing, the bank financed $23.8 million in Q4 to support Habitat for Humanity of Roaring Fork Valley’s efforts to make homeownership more accessible. The loan will help bring nearly 100 deed-restricted, for-sale units to Glenwood Springs.</p><p class=\"\">FirstBank closed out 2024 as Colorado’s second-largest bank by deposits, capturing over 12% of the state’s deposit market share. It was also ranked among <em>Forbes’ </em>“World’s Best Banks” and “Best-in-State-Banks.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About FirstBank</strong></p><p class=\"\">FirstBank began providing banking services in 1963. Today, it’s known as an industry leader in digital banking. It has grown to be one of the top-performing and largest privately held banks in the United States. FirstBank offers a variety of consumer deposit accounts, home equity loans, mortgages, rental property loans, and a full range of commercial banking services, including business financing, commercial real estate loans, treasury management, and more. Since 2000, FirstBank has been recognized as a top corporate philanthropist, contributing more than $90 million and thousands of volunteer hours to charitable organizations. The company is also unique in that a large portion of its stock is owned by management and employees, giving employees a financial stake in the bank’s success through its Employee Stock Ownership Program. For more information, visit www.efirstbank.com. Member FDIC.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\">Chandra Brin</p><p class=\"\">303.235.1402</p><p class=\"\">Chandra.Brin@efirstbank.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX4FwZzB:0-firstbank-reports-strong-q4-results-and-a-record-setting-colorado-gives-day/",
            "pub_date": "2025-02-06 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007923:0",
            "title": "Enphase Energy Is Maintained at Buy by Craig-Hallum",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:00 GMT) </strong>Enphase Energy Price Target Cut to $101.00/Share From $123.00 by Craig-Hallum</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007923:0/",
            "pub_date": "2025-02-06 00:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX3nmzWw:0",
            "title": "BitMart Introduces Credit/Debit Card Payment for Crypto Purchases with Zero Fees & Exclusive Rewards",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mahe, Seychelles , Feb.  05, 2025  (GLOBE NEWSWIRE) — BitMart, a leading global cryptocurrency exchange, is excited to announce the launch of its new <strong class=\"root-Tkn6WL2y\">Credit/Debit Card Buy Crypto</strong> feature. This new service allows users worldwide to purchase cryptocurrencies directly using fiat currencies such as USD, EUR, and GBP, providing a seamless and efficient way to enter the crypto market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Key Features &amp; Benefits</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Convenient Transactions</strong>: BitMart Users can buy crypto directly with their credit or debit cards without navigating complex deposit processes. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Multi-Currency Support</strong>: A wide range of fiat currencies are accepted, catering to global users. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Broad Crypto Selection</strong>: Supports the purchase of major cryptocurrencies, including BTC, ETH, USDT, and more. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Faster &amp; Cheaper</strong>: Instant transaction confirmation with lower fees compared to traditional payment methods. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Integrated Experience</strong>: No need to switch to third-party services—users can complete transactions smoothly and efficiently within BitMart’s platform. </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Global Reach &amp; Enhanced Security</strong></strong></p><p class=\"\">This feature enables BitMart users from regions including EEA, North America, South America, and Asia to fund their accounts effortlessly. BitMart has partnered with leading global payment service providers to ensure <strong class=\"root-Tkn6WL2y\">top-tier security</strong> for all transactions, giving users peace of mind when purchasing digital assets.</p><p class=\"\">Limited-Time Zero Fee Promotion &amp; Exclusive Rewards – Share 15,000 USDT</p><p class=\"\">To celebrate the launch, BitMart is introducing an exclusive <strong class=\"root-Tkn6WL2y\">Zero-Fee Promotion</strong> along with additional incentives from Feb. 05 - March 04:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Zero Processing Fees</strong>: Users who buy crypto with a credit or debit card during the promotion period will enjoy <strong class=\"root-Tkn6WL2y\">zero transaction fees</strong>. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Referral Bonus</strong>: The first 100 users daily who purchase at least <strong class=\"root-Tkn6WL2y\">100 USDT</strong> in crypto and invite a friend to do the same will receive a <strong class=\"root-Tkn6WL2y\">5 USDT</strong> reward each. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">3% Cashback for Futures Trading</strong>: Users who transfer funds to their futures account can earn up to <strong class=\"root-Tkn6WL2y\">3% cashback</strong> on transferred assets. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">VIP Savings Privilege</strong>: Users who accumulate at least <strong class=\"root-Tkn6WL2y\">500 USDT</strong> in crypto purchases will gain <strong class=\"root-Tkn6WL2y\">VIP access</strong> to exclusive savings products for seven days. </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Total Rewards Pool: 15,000 USDT</strong> available for participants, distributed on a first-come, first-served basis.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Join the Future of Crypto Transactions Today</strong></strong></p><p class=\"\">BitMart’s new <strong class=\"root-Tkn6WL2y\">Credit/Debit Card Buy Crypto</strong> feature simplifies crypto purchases, lowers entry barriers, and enhances user experience. Don’t miss out on this opportunity to trade seamlessly with zero fees and exciting rewards.</p><p class=\"\">For more details, visit BitMart’s official website.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About BitMart</strong></p><p class=\"\">BitMart is the premier global digital asset trading platform. With millions of users worldwide and ranked among the top crypto exchanges on CoinGecko, it currently offers 1,600+ trading pairs with competitive trading fees. Constantly evolving and growing, BitMart is interested in crypto’s potential to drive innovation and promote financial inclusion. To learn more about BitMart, visit their Website, follow their X (Twitter), or join their Telegram for updates, news, and promotions. Download BitMart App to trade anytime, anywhere.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Disclaimer:</em></strong></p><p class=\"\">Use of BitMart services is entirely at your own risk. All crypto investments, including earnings, are highly speculative in nature and involve substantial risk of loss. Past, hypothetical, or simulated performance is not necessarily indicative of future results. The value of digital currencies can go up or down and there can be a substantial risk in buying, selling, holding, or trading digital currencies. You should carefully consider whether trading or holding digital currencies is suitable for you based on your personal investment objectives, financial circumstances, and risk tolerance. BitMart does not provide any investment, legal, or tax advice.</p><p class=\"\">chenkai.ni at bitmart.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX3nmzWw:0-bitmart-introduces-credit-debit-card-payment-for-crypto-purchases-with-zero-fees-exclusive-rewards/",
            "pub_date": "2025-02-06 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007886:0",
            "title": "Are We Ready for an RV in Retirement? We Decided to Find Out — Journal Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Karen Kreider Yoder and Stephen Kreider Yoder</p><p class=\"\">The first few years in retirement are often the most difficult. But they also can set the stage for how you'll fill the years ahead — both financially and psychologically. Stephen Kreider Yoder, 67, a longtime Wall Street Journal editor, joined his wife, Karen Kreider Yoder, 68, in retirement in late 2022. In this monthly  Retirement Rookies  column, they chronicle some of the issues they are dealing with early in retirement .</p><p class=\"\">Karen</p><p class=\"\">We were uneasy when we pulled into our windy coastal campground in December. It was already dark, the kind of timing we try to avoid when bicycle touring. It's harder to pitch the tent at night, unpleasant to cook in the cold and a little creepy to head to the facilities.</p><p class=\"\">But this time, we had only to plug in to the electrical outlet. The lights came on, the heater kicked in and we sat down at the dining table.</p><p class=\"\">For the first time in our married lives, we were traveling in a recreational vehicle. We cracked the window to hear the waves crashing not far off, then closed it to keep out the wind. Steve opened a bottle of wine.</p><p class=\"\">\"I'm beginning to understand,\" I said, and we chuckled sheepishly.</p><p class=\"\">We'd been dismissive of RVs. For decades, we vacationed on the rough side, with backpacks on buses and trains abroad, on our tandem bicycle loaded with camping gear on rides across America.</p><p class=\"\">Could RVers enjoy nature and local color as we did, we asked? How relaxing could it be in those big expensive things?</p><p class=\"\">But in our past few years of bicycle travel we've encountered dozens of retirees in campgrounds who seem pretty happy with their rigs, extolling the joys of a solid roof and stable furnishings.</p><p class=\"\">So we did a test run. We rented a 25-foot RV with a queen-size bed, kitchenette, table for four, shower, propane tank, potable water supply, waste tanks and, importantly, a bathroom. We picked routes we had traveled before, down California's Highway 1 along the Pacific, inland into the Salinas Valley, through the mountains to the Central Valley and back up to the Sacramento River delta.</p><p class=\"\">We soon began to see the light. RV travel may be the ticket, we agreed, especially for our slow-go years down the road when we aren't as agile and grow more fond of creature comforts.</p><p class=\"\">Creature comforts were an obvious draw from our first stop at one of our favorite bike-camping spots, in Half Moon Bay south of San Francisco. We listened to the surf from the comfort of an actual bed with actual sheets, not on a pad on the ground. In the morning, I read my book at the table with a cup of coffee kept hot thanks to the microwave. I cooked breakfast on a three-burner stove that I didn't have to pack away.</p><p class=\"\">And did I mention the clean private bathroom a few steps away?</p><p class=\"\">\"You're never going to want to go back now,\" said the man sitting under an awning next door in the morning, camped there with his wife in their restored 1959 travel trailer. They had been tenters until they retired eight years earlier and switched to the 16-foot camper.</p><p class=\"\">Another retiree walked up and cheerily recounted how he used to rent RVs and finally bought his own. When Steve asked about costs, the man laughed: \"You don't buy an RV to save money.\"</p><p class=\"\">The next revelation came after we unplugged and drove south to Pigeon Point Lighthouse. The sky was blue, the seascape was breathtaking, and we pulled off the road to position the RV with its picture window facing the ocean. Imagine that: We could stop for lunch at the best table in the house, the one with a view of our choosing.</p><p class=\"\">A two-night stay at a KOA campground gave us the opportunity to relax and chat with more retirees in RVs, including a couple who had recently traded tents for a tiny Airstream. We did some grilling and had the energy to hike miles into the coastal hills, things we rarely do after a day's cycling.</p><p class=\"\">Another revelation: Who needs a campground? We'd heard over the years that Walmarts allowed overnight RV parking, but that option wasn't available, judging from phone calls to stores along our route. \"But you can park at the truck stop!\" a friendly Walmart employee offered. Indeed, the cashier at a truck stop along I-5 welcomed us to park along the outer edge. We ate delicious pea soup at the restaurant next door and had a surprisingly good night's sleep to the hum of the semis we were tucked between.</p><p class=\"\">We spent our final night in another of our favorite bike-camping spots, in the Sacramento River delta, where we plugged in and stayed up a little late despite a cold snap, enjoying the electric heater.</p><p class=\"\">We dropped off the rig and spent our trip home on the train talking about where we might go next in an RV.</p><p class=\"\">Steve</p><p class=\"\">The first sounds that our rig emitted took me back a half-century, reminding me of a reason I've always distrusted RVs.</p><p class=\"\">As I drove out of the rental lot, the cabinets creaked, the camper body made odd rumbling sounds and the V-8 roared without accelerating us much. Refueling later revealed 8.5 miles a gallon.</p><p class=\"\">Just as I remembered. My prior relationship with RVs was in the mid-1970s, when I had part-time jobs driving them to dealerships from Elkhart County, Ind., a U.S. RV-manufacturing hub. It was a dream job for a college student, paying me to drive as far as Salisbury, Md., and San Francisco with beds to sleep in.</p><p class=\"\">But these vehicles had issues. A large rig I drove to California had windows that leaked in the rain, cabinets that slammed open and closed while driving and a gas gauge that was wildly optimistic. The fuel pump died in Wyoming.</p><p class=\"\">Some RV owners are still dealing with the same issues 50 years later, judging from the reports I see online. My guilty pleasure last fall was binge-watching YouTube channels featuring RV owners with horror stories of brand-new lemons.</p><p class=\"\">As we pulled out of the lot in our 25-footer, I figured it would be a one-time adventure, something we would do ironically.</p><p class=\"\">The first miles weren't promising. Aside from the noises and elephantine acceleration, the thing was wide. Really wide. As we drove across the Golden Gate Bridge in the right lane admiring the scenery, there was suddenly a \"zing, zing\" noise. Whoah. I later concluded it was the tailpipe, sticking out to the right and scraping against the bridge's steel curb.</p><p class=\"\">But I softened soon after we lumbered into camp after dark. Karen and I kept looking at each other, nodding as we realized we were discovering another joy we hadn't expected. The RV made it simpler to just \"be\" in a place — a campground, a pull-off by the ocean, a highway rest area.</p><p class=\"\">We began discussing the challenges we might face in retirement that would make an RV even more attractive. We could still travel even if one of us were disabled or fell into dementia, or if we simply got tired of rougher travel. And we could camp with friends who didn't cotton to cycling or tents.</p><p class=\"\">One encounter on the road did give us pause. As we drove with the morning sun glinting on the waves to our right down Highway 1 toward Santa Cruz, we passed a cyclist riding our direction laden with touring bags. We pulled over a quarter mile further and waited for him.</p><p class=\"\">He was Paul, a 67-year-old retiree on a bike-camping tour along the coast. We swapped stories about our cycling tours before waving goodbye a bit wistfully as he pedaled away.</p><p class=\"\">\"This is really nice,\" I told Karen, gesturing back from the driver's seat toward our mobile living room. \"But I think I'd still rather be out there.\" She agreed.</p><p class=\"\">The Yoders live in San Francisco. They can be reached at reports@wsj.com.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007886:0/",
            "pub_date": "2025-02-06 00:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX9wNNwF:0",
            "title": "Anitian and A-LIGN Partner to Simplify and Accelerate FedRAMP Compliance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PALO ALTO, Calif., Feb.  05, 2025  (GLOBE NEWSWIRE) — Anitian, a leader in Continuous Compliance Automation (CCA), today announced its strategic partnership with A-LIGN, a trusted provider of cybersecurity and compliance services, to launch a bundled offering that revolutionizes the FedRAMP compliance process. This partnership empowers SaaS providers to achieve FedRAMP audit-readiness faster, with greater efficiency, and at a reduced cost.</p><p class=\"\">The complexities of FedRAMP compliance often create significant hurdles for SaaS providers, including lengthy timelines, high costs, and operational inefficiencies. Together, Anitian and A-LIGN address these challenges by combining Anitian’s cloud-native compliance automation platform with A-LIGN’s expert 3PAO auditing services.</p><p class=\"\">“Anitian and A-LIGN share a commitment to helping organizations succeed in today’s demanding compliance landscape,” said Andrew Steioff, VP Global Strategic Alliances at A-LIGN. “Together, we are delivering an end-to-end solution that eliminates inefficiencies, accelerates audit-readiness, and ensures customers maintain full control of their compliance journey.”</p><p class=\"\">“With Anitian’s automation platform and A-LIGN’s auditing expertise, SaaS providers now have a clear, simplified pathway to achieve FedRAMP compliance and enter the federal market,” said Chris Finan, CEO at Anitian. “This partnership reduces time-to-compliance by up to 50% while delivering unmatched efficiency and cost savings.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key Benefits of the Anitian + A-LIGN Partnership:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Accelerated Compliance:</strong> Reduce FedRAMP readiness timelines by up to 50% with seamless automation and expert audit preparation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Increased Efficiency:</strong> Eliminate redundancies and streamline workflows with pre-configured tools and a unified compliance approach.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cost Savings:</strong> Access discounted bundled pricing to reduce compliance and audit costs while maximizing ROI.</li></ul><p class=\"\">The bundled offering is available immediately and is designed for SaaS providers seeking FedRAMP Moderate or High authorizations. By combining automation, auditing, and advisory services, Anitian and A-LIGN deliver a comprehensive solution that helps customers focus on innovation and growth while ensuring compliance success.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Anitian</strong></p><p class=\"\">Anitian, a leader in the Continuous Compliance Automation (CCA) space, simplifies the journey to FedRAMP authorization. SaaS companies achieve audit-readiness in as few as three months while reducing preparation costs by up to 50%. Anitian empowers organizations to accelerate secure cloud adoption, maintain technical control of their infrastructure, and confidently unlock federal market growth. Learn more at anitian.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About A-LIGN</strong></p><p class=\"\">A-LIGN is the leading provider of high-quality, efficient cybersecurity compliance programs. Combining experienced auditors and audit management technology, A-LIGN provides the widest breadth and depth of services including SOC 2, ISO 27001, HITRUST, FedRAMP, and PCI. A-LIGN is the number one issuer of SOC 2 and HITRUST and a top three FedRAMP assessor. To learn more, visit a-lign.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong>:</p><p class=\"\">Emily Bertrand</p><p class=\"\">Head of Marketing</p><p class=\"\">emily.bertrand@anitian.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX9wNNwF:0-anitian-and-a-lign-partner-to-simplify-and-accelerate-fedramp-compliance/",
            "pub_date": "2025-02-06 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXbkKrc9:0",
            "title": "AVIDLOVE’s 2025 Valentine’s Day Campaign: \"Unwrap Love, Unleash Yourself\" - A Celebration of Self-Expression and Empowerment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New York, NY, Feb.  05, 2025  (GLOBE NEWSWIRE) — AVIDLOVE is kicking off its Valentine’s Day campaign from January 3 to February 14, 2025, under the theme \"Unwrap Love, Unleash Yourself.\" With the slogan \"Every Moment is a Gift of Love,\" this campaign is all about celebrating love, self-expression, and empowerment. AVIDLOVE encourages women to embrace their confidence, passion, and individuality this season, whether in romantic relationships or in their own personal journey. Through a series of engaging activities, exclusive offers, and a beautifully curated lingerie collection, AVIDLOVE invites women to unwrap love in all its forms and unleash the best version of themselves.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:500px;max-width:1200px;aspect-ratio:2.4\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXbkKrc9-9c782968dc7a705053e1392402333d75-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNXbkKrc9-9c782968dc7a705053e1392402333d75-resized.jpeg\" style=\"background-color:#d58d8d\"/></picture></div></figure></span></p><p class=\"\">AVIDLOVE’s Valentine’s Day campaign is packed with exciting activities and exclusive giveaways designed to celebrate the many facets of love. Here's what’s in store:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Giveaway (Feb 1 - Feb 5): Participants can enter by sharing their Valentine’s Day plans on social media. Three winners will receive $100 each in gift cards. </li><li class=\"listItem-bmN0_SHH\">\"What is the Color of Love?\" Quiz (Jan 6 - Feb 3): AVIDLOVE is inviting Participants to take part in an interactive love style quiz, running over four weeks. The quiz helps participants discover which color represents their love personality, such as passionate (red), romantic (purple), or playful (yellow). </li><li class=\"listItem-bmN0_SHH\">\"Love Languages in Lingerie\" Campaign: This initiative connects lingerie with the five love languages, offering Participants the chance to explore and purchase items that reflect their love language. AVIDLOVE collaborates with influencers and Reddit communities to explore love languages through intimate apparel. participants can enjoy a 15% discount on select \"Love Language\" collections with the code VDAY15. </li></ul><p class=\"\">AVIDLOVE’s 2025 Valentine’s Day collection brings you a stunning assortment of lingerie designed to inspire confidence, romance, and elegance:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">AVIDLOVE Lace Bralette for Women V Neck Camisoles: Its flattering fit enhances your natural curves, making it ideal for layering under a blazer or wearing as a statement piece on its own, whether for a casual outing or a special evening. </li><li class=\"listItem-bmN0_SHH\">Women's Underwire Bra Lace Full Coverage Push-Up T-Shirt Bralette: This lace bralette offers soft, breathable comfort with a deep V plunging neckline that showcases your cleavage. The floral lace and wide camisole straps provide both support and a touch of sophistication, making it ideal for everything from casual streetwear to a sexy evening out. </li><li class=\"listItem-bmN0_SHH\">AVIDLOVE Lace Cheeky Panties for Women: Featuring a delicate lace design and sexy criss-cross back, these panties highlight your curves while offering comfort and breathability—ideal for a confident, seductive look. </li><li class=\"listItem-bmN0_SHH\">AVIDLOVE Nursing Bras for Breastfeeding: This seamless, wireless maternity bra offers exceptional comfort, breathable fabric, and double support technology, making it perfect for new moms who need a versatile, comfortable bra during pregnancy and breastfeeding </li><li class=\"listItem-bmN0_SHH\">AVIDLOVE G String Thongs for Women: Crafted from soft, breathable cotton and spandex, these sexy thong panties offer a flattering fit with a Y-shaped back that perfectly outlines your hips, making them ideal for a romantic evening or a special night in </li></ul><p class=\"\">AVIDLOVE’s collection covers every need, from maternity wear and everyday comfort to seductive pieces. The AVIDLOVE Nursing Bras offer seamless, wireless support for new mothers, while the AVIDLOVE Women's Satin Half Slip adds luxury with lace trim. For a romantic touch, the AVIDLOVE Women’s Lace Waist Thongs and Lace Bow Panties provide alluring lace designs. Shoppers can explore featured products through the AVIDLOVE Valentine’s Day storefront on Amazon and the brand’s official website.</p><p class=\"\">Valentine's Day Executive Offers</p><p class=\"\">AVIDLOVE is offering a range of special discounts this Valentine’s Day. Enjoy up to 50% off on select items, with additional offers like buy 2, get 35% off the 3rd item, and buy 3, get 70% off the 4th. For those shopping in bulk, buy 4 and get the 5th free. The Valentine’s Day Blind Box is also available for just $9.99. Plus, get 15% off the Love Language Collection and 25% off when you sign up as a member with code VIP25. AVIDLOVE is also offering e-gift cards, making it easy to share the love.</p><p class=\"\">Don’t miss out—shop now and make this Valentine’s Day unforgettable</p><p class=\"\">Empower Every Moment with AVIDLOVE</p><p class=\"\">This Valentine’s Day, AVIDLOVE is more than just a celebration—it’s an invitation for every woman to embrace her power, beauty, and unique expression of love. This campaign is a reminder that you are worthy of all the love you give and that each moment is an opportunity to celebrate yourself.</p><p class=\"\">Let AVIDLOVE inspire you to unwrap your own brand of love—whether passionate, nurturing, or mysterious—and unleash your inner confidence. Celebrate your love, your strength, and your beauty.</p><p class=\"\">Dana LI</p><p class=\"\">AVIDLOVE</p><p class=\"\">Dana(at)ekouaer.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXbkKrc9:0-avidlove-s-2025-valentine-s-day-campaign-unwrap-love-unleash-yourself-a-celebration-of-self-expression-and-empowerment/",
            "pub_date": "2025-02-06 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN5fzYv6:0",
            "title": "Íslandsbanki hf.: Share repurchase and reduction of share capital authorised by the Financial Supervisory Authority of the Central Bank of Iceland",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On 5 February 2025 the Financial Supervisory Authority of the Central Bank of Iceland (FSA) granted Íslandsbanki hf. (the Bank) authorisation of an amount up to ISK 15 billion market value , to buy back own shares and reduce its share capital.</p><p class=\"\">At the close of business on 4 February 2025 the Bank held 115,584,211 own shares, representing 5.78% of issued shares in the Bank.</p><p class=\"\">The Bank will use the authorisation to set up a formal share repurchase program or for the purpose of offering shareholders generally to sell their shares to the Bank e.g., through auction where equal treatment of shareholders is ensured. The Bank will announce the timing and execution of the repurchase of own shares under the aforementioned authorisation once a decision to that effect has been made.</p><p class=\"\">It should be noted that the ongoing share repurchase by the Bank, announced on June 14 2024, is carried out based on the previous authorisation from the FSA granted in 2024. In addition to the current round of repurchases, the Bank is authorised, according to the same FSA authorisation, to repurchase own shares up to an amount of approximately ISK 2 billion.</p><p class=\"\">Furthermore, the FSA has granted the Bank authorisation to reduce share capital by the amount of the own shares purchased based on authorisations granted by the FSA in 2023 and 2024. The reduction of share capital based on such authorisation is subject to the approval of the Bank's shareholders' meeting.</p><p class=\"\">This announcement is released by Íslandsbanki hf. and contains information that qualified or may have qualified as inside information for the purposes of Article 7 of the Market Abuse Regulation (EU) 596/2014 (MAR), encompassing information relating to the share repurchase and reduction of share capital authorised by the FSA as described above. For the purposes of MAR and Article 2 of Commission Implementing Regulation (EU) 2016/1055, this announcement is made by Ellert Hlöðversson, CFO of Íslandsbanki hf.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN5fzYv6:0-slandsbanki-hf-share-repurchase-and-reduction-of-share-capital-authorised-by-the-financial-supervisory-authority-of-the-central-bank-of-iceland/",
            "pub_date": "2025-02-06 00:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310185:0",
            "title": "Pure Storage Updates Reseller Partner Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pure Storage  said Wednesday it has updated its reseller partner program to enable partners to accelerate the transition of their customers to the Pure Storage platform. </p><p class=\"\">The technology company said it is introducing enhanced training to give partners the needed resources to \"accelerate\" a path to profitability and growth. The program also provides new incentives and rebates focused on making customer transition to the Pure Storage platform faster, the company said. </p><p class=\"\">Shares were up 2.6% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310185:0/",
            "pub_date": "2025-02-06 00:00:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr9XgS0F:0",
            "title": "Elisa: Notification of the Managers' Transactions - Tapio",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Elisa Oyj<p class=\"\">ELISA MANAGERS' TRANSACTIONS RELEASE 5 FEBRUARY 2025 AT 6:00 PM</p><p class=\"\">The following notification is made according to Article 19 of the Market Abuse Regulation.</p><p class=\"\">Elisa Oyj - Managers' Transactions</p><p class=\"\">____________________________________________</p><p class=\"\">Person subject to the notification requirement</p><p class=\"\">Name: Tapio Eliisa</p><p class=\"\">Position: Other senior manager</p><p class=\"\"> Issuer: Elisa Oyj</p><p class=\"\">LEI: 743700TU2S3DXWGU7H32</p><p class=\"\">Notification type: INITIAL NOTIFICATION</p><p class=\"\">Reference number: 95060/5/4</p><p class=\"\">____________________________________________</p><p class=\"\">Transaction date: 2025-02-05</p><p class=\"\">Outside a trading venue</p><p class=\"\">Instrument type: SHARE</p><p class=\"\">ISIN: FI0009007884</p><p class=\"\">Nature of transaction: RECEIPT OF A SHARE-BASED INCENTIVE</p><p class=\"\">Transaction details</p><p class=\"\">(1): Volume: 709 Unit price: 0 EUR</p><p class=\"\">Aggregated transactions (1):</p><p class=\"\">Volume: 709 Volume weighted average price: 0 EUR</p><p class=\"\">Elisa's Management holdings: https://elisa.com/corporate/governance/management-holdings/  </p><p class=\"\">ELISA CORPORATION</p><p class=\"\">Vesa Sahivirta</p><p class=\"\">IR Director</p><p class=\"\">tel. +358 50 520 5555</p><p class=\"\">Distribution:</p><p class=\"\">Nasdaq Helsinki</p><p class=\"\">Principal media</p><p class=\"\">elisa.com</p><p class=\"\">http://publish.ne.cision.com//Release/ViewReleaseHtml/39FFF657DC0D3BEDE0C856B0705FC7D6</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr9XgS0F:0-elisa-notification-of-the-managers-transactions-tapio/",
            "pub_date": "2025-02-06 00:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr1l6TJ3:0",
            "title": "Elisa: Notification of the Managers' Transactions - Nikula",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Elisa Oyj<p class=\"\">ELISA MANAGERS' TRANSACTIONS RELEASE 5 FEBRUARY 2025 AT 6:00 PM</p><p class=\"\">The following notification is made according to Article 19 of the Market Abuse Regulation.</p><p class=\"\">Elisa Oyj - Managers' Transactions</p><p class=\"\">____________________________________________</p><p class=\"\">Person subject to the notification requirement</p><p class=\"\">Name: Nikula Vesa-Pekka</p><p class=\"\">Position: Other senior manager</p><p class=\"\"> Issuer: Elisa Oyj</p><p class=\"\">LEI: 743700TU2S3DXWGU7H32</p><p class=\"\">Notification type: INITIAL NOTIFICATION</p><p class=\"\">Reference number: 95036/5/4</p><p class=\"\">____________________________________________</p><p class=\"\">Transaction date: 2025-02-05</p><p class=\"\">Outside a trading venue</p><p class=\"\">Instrument type: SHARE</p><p class=\"\">ISIN: FI0009007884</p><p class=\"\">Nature of transaction: RECEIPT OF A SHARE-BASED INCENTIVE</p><p class=\"\">Transaction details</p><p class=\"\">(1): Volume: 5319 Unit price: 0 EUR</p><p class=\"\">Aggregated transactions (1):</p><p class=\"\">Volume: 5319 Volume weighted average price: 0 EUR</p><p class=\"\">Elisa's Management holdings: https://elisa.com/corporate/governance/management-holdings/  </p><p class=\"\">ELISA CORPORATION</p><p class=\"\">Vesa Sahivirta</p><p class=\"\">IR Director</p><p class=\"\">tel. +358 50 520 5555</p><p class=\"\">Distribution:</p><p class=\"\">Nasdaq Helsinki</p><p class=\"\">Principal media</p><p class=\"\">elisa.com</p><p class=\"\">http://publish.ne.cision.com//Release/ViewReleaseHtml/6F75347CE9B014B6E0C856B0705FC7D6</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr1l6TJ3:0-elisa-notification-of-the-managers-transactions-nikula/",
            "pub_date": "2025-02-06 00:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr1TynjZ:0",
            "title": "Elisa: Notification of the Managers' Transactions - Nieminen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Elisa Oyj<p class=\"\">ELISA MANAGERS' TRANSACTIONS RELEASE 5 FEBRUARY 2025 AT 6:00 PM</p><p class=\"\">The following notification is made according to Article 19 of the Market Abuse Regulation.</p><p class=\"\">Elisa Oyj - Managers' Transactions</p><p class=\"\">____________________________________________</p><p class=\"\">Person subject to the notification requirement</p><p class=\"\">Name: Nieminen Antti</p><p class=\"\">Position: Other senior manager</p><p class=\"\"> Issuer: Elisa Oyj</p><p class=\"\">LEI: 743700TU2S3DXWGU7H32</p><p class=\"\">Notification type: INITIAL NOTIFICATION</p><p class=\"\">Reference number: 95059/5/4</p><p class=\"\">____________________________________________</p><p class=\"\">Transaction date: 2025-02-05</p><p class=\"\">Outside a trading venue</p><p class=\"\">Instrument type: SHARE</p><p class=\"\">ISIN: FI0009007884</p><p class=\"\">Nature of transaction: RECEIPT OF A SHARE-BASED INCENTIVE</p><p class=\"\">Transaction details</p><p class=\"\">(1): Volume: 1950 Unit price: 0 EUR</p><p class=\"\">Aggregated transactions (1):</p><p class=\"\">Volume: 1950 Volume weighted average price: 0 EUR</p><p class=\"\">Elisa's Management holdings: https://elisa.com/corporate/governance/management-holdings/  </p><p class=\"\">ELISA CORPORATION</p><p class=\"\">Vesa Sahivirta</p><p class=\"\">IR Director</p><p class=\"\">tel. +358 50 520 5555</p><p class=\"\">Distribution:</p><p class=\"\">Nasdaq Helsinki</p><p class=\"\">Principal media</p><p class=\"\">elisa.com</p><p class=\"\">http://publish.ne.cision.com//Release/ViewReleaseHtml/C2D447B0B8F0E6D1E0C856B0705FC7D6</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr1TynjZ:0-elisa-notification-of-the-managers-transactions-nieminen/",
            "pub_date": "2025-02-06 00:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr1z7GJc:0",
            "title": "Elisa: Notification of the Managers' Transactions - Manner",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Elisa Oyj<p class=\"\">ELISA MANAGERS' TRANSACTIONS RELEASE 5 FEBRUARY 2025 AT 6:00 PM</p><p class=\"\">The following notification is made according to Article 19 of the Market Abuse Regulation.</p><p class=\"\">Elisa Oyj - Managers' Transactions</p><p class=\"\">____________________________________________</p><p class=\"\">Person subject to the notification requirement</p><p class=\"\">Name: Manner Topi</p><p class=\"\">Position: Chief Executive Officer</p><p class=\"\"> Issuer: Elisa Oyj</p><p class=\"\">LEI: 743700TU2S3DXWGU7H32</p><p class=\"\">Notification type: INITIAL NOTIFICATION</p><p class=\"\">Reference number: 95033/5/4</p><p class=\"\">____________________________________________</p><p class=\"\">Transaction date: 2025-02-05</p><p class=\"\">Outside a trading venue</p><p class=\"\">Instrument type: SHARE</p><p class=\"\">ISIN: FI0009007884</p><p class=\"\">Nature of transaction: RECEIPT OF A SHARE-BASED INCENTIVE</p><p class=\"\">Transaction details</p><p class=\"\">(1): Volume: 1271 Unit price: 0 EUR</p><p class=\"\">(2): Volume: 2271 Unit price: 0 EUR</p><p class=\"\">Aggregated transactions (2):</p><p class=\"\">Volume: 3542 Volume weighted average price: 0 EUR</p><p class=\"\">Elisa's Management holdings: https://elisa.com/corporate/governance/management-holdings/  </p><p class=\"\">ELISA CORPORATION</p><p class=\"\">Vesa Sahivirta</p><p class=\"\">IR Director</p><p class=\"\">tel. +358 50 520 5555</p><p class=\"\">Distribution:</p><p class=\"\">Nasdaq Helsinki</p><p class=\"\">Principal media</p><p class=\"\">elisa.com</p><p class=\"\">http://publish.ne.cision.com//Release/ViewReleaseHtml/18FA15D0652FFF4AE0C856B0705FC7D6</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr1z7GJc:0-elisa-notification-of-the-managers-transactions-manner/",
            "pub_date": "2025-02-06 00:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr3nW2BV:0",
            "title": "Elisa: Notification of the Managers' Transactions - Korpi",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Elisa Oyj<p class=\"\">ELISA MANAGERS' TRANSACTIONS RELEASE 5 FEBRUARY 2025 AT 6:00 PM</p><p class=\"\">The following notification is made according to Article 19 of the Market Abuse Regulation.</p><p class=\"\">Elisa Oyj - Managers' Transactions</p><p class=\"\">____________________________________________</p><p class=\"\">Person subject to the notification requirement</p><p class=\"\">Name: Henri Korpi</p><p class=\"\">Position: Other senior manager</p><p class=\"\"> Issuer: Elisa Oyj</p><p class=\"\">LEI: 743700TU2S3DXWGU7H32</p><p class=\"\">Notification type: INITIAL NOTIFICATION</p><p class=\"\">Reference number: 94942/5/4</p><p class=\"\">____________________________________________</p><p class=\"\">Transaction date: 2025-02-04</p><p class=\"\">Venue: NASDAQ HELSINKI LTD (XHEL)</p><p class=\"\">Instrument type: SHARE</p><p class=\"\">ISIN: FI0009007884</p><p class=\"\">Nature of transaction: DISPOSAL</p><p class=\"\">Transaction details</p><p class=\"\">(1): Volume: 4635 Unit price: 41.5 EUR</p><p class=\"\">(2): Volume: 5861 Unit price: 41.52 EUR</p><p class=\"\">(3): Volume: 1614 Unit price: 41.54 EUR</p><p class=\"\">(4): Volume: 724 Unit price: 41.56 EUR</p><p class=\"\">(5): Volume: 2475 Unit price: 41.58 EUR</p><p class=\"\">(6): Volume: 3747 Unit price: 41.6 EUR</p><p class=\"\">(7): Volume: 944 Unit price: 41.62 EUR</p><p class=\"\">Aggregated transactions (7):</p><p class=\"\">Volume: 20000 Volume weighted average price: 41.54556 EUR</p><p class=\"\">Elisa's Management holdings: https://elisa.com/corporate/governance/management-holdings/    </p><p class=\"\">ELISA CORPORATION</p><p class=\"\">Vesa Sahivirta</p><p class=\"\">IR Director</p><p class=\"\">tel. +358 50 520 5555</p><p class=\"\">Distribution:</p><p class=\"\">Nasdaq Helsinki</p><p class=\"\">Principal media</p><p class=\"\">elisa.com</p><p class=\"\">http://publish.ne.cision.com//Release/ViewReleaseHtml/99B4A90FF267CA87E0C856B0705FC7D6</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr3nW2BV:0-elisa-notification-of-the-managers-transactions-korpi/",
            "pub_date": "2025-02-06 00:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464072:0",
            "title": "Clean Motion AB to Start Sales Operations in Marbella, Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clean Motion AB  will establish sales operations in Marbella, Spain, as part of its European expansion. </p><p class=\"\">The Swedish electric vehicles maker said Wednesday the new office's initial focus is on the local market and then expand across southern Europe.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464072:0/",
            "pub_date": "2025-02-05 23:52:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310150:0",
            "title": "Valneva Gets Marketing Authorization in UK for Chikungunya Vaccine; Shares Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Valneva  secured marketing authorization in the UK for its Ixchiq vaccine for chikungunya, a mosquito-borne viral disease. </p><p class=\"\">The vaccine, manufactured at the company's leading production site in Livingston, Scotland, got the approval from the Medicines and Healthcare products Regulatory Agency,</p><p class=\"\">The single-dose vaccine is for active immunization for the prevention of disease caused by the chikungunya virus in people 18 years of age and older, Valneva said Wednesday in a statement. </p><p class=\"\">The vaccine is approved in the US, Europe and Canada in adults, and Valneva expects to get marketing approval in Brazil in Q1. </p><p class=\"\">Valneva submitted label extension applications in the US, Europe and Canada to possibly extend the use of Ixchiq to adolescents aged 12 to 17 years and plans to submit a label extension application in the UK. </p><p class=\"\">The company's shares rose 14% in recent Wednesday trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310150:0/",
            "pub_date": "2025-02-05 23:52:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007864:0",
            "title": "The Cooling Stock Heated Up After Earnings. Google Is Helping. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Al Root</p><p class=\"\">Shares of heating, ventilation, and air conditioning provider Johnson Controls soared after a solid quarterly earnings report. Guidance, and maybe even Google, helped too.</p><p class=\"\">Wednesday morning, Johnson Controls reported adjusted fiscal first-quarter earnings per share of 64 cents on sales of $5.4 billion. (The company's fiscal year ends in September.)</p><p class=\"\">Wall Street had expected earnings per share of 59 cents on sales of $5.4 billion, according to FactSet.</p><p class=\"\">For fiscal 2025, management now expects earnings per share of $3.50 to $3.60. That's up a dime from recent guidance. Wall Street currently projects $3.47 a share.</p><p class=\"\">Johnson Controls stock was up 12.7% in early trading at $87.09, while the S&amp;P 500 and Dow Jones Industrial Average were down about t0.4% and 0.2%, respectively.</p><p class=\"\">Johnson Controls shares are trading at a record high, according to Dow Jones Market Data.</p><p class=\"\">Jefferies analyst Stephen Volkmann noted orders were up 16% year over year and called profit margin performance \"solid\" in a Wednesday report. He rates Johnson Controls stock at Buy with a $95 target price.</p><p class=\"\">Along with the quarter, Google parent Alphabet might be helping Johnson Control shares. Alphabet said it plans to spend $75 billion on new capital in 2025. That's up from about $53 billion in 2024, and more than the $59 billion Wall Street was projecting.</p><p class=\"\">A lot of that spending will be for building artificial-intelligence data centers, benefiting a host of companies including Johnson Controls. Those data centers need to be cooled off.</p><p class=\"\">Full-year \"order growth of 7% in the year was led by data-center demand and contributed to our record backlog,\" said Johnson Controls CEO George Oliver on the earnings conference call.</p><p class=\"\">Data-center revenue, which isn't specifically disclosed, doubled year over year, according to the CEO.</p><p class=\"\">Oliver's comments and Alphabet's spending are a relief to investors who feared that the emergence of the Chinese AI app DeepSeek might lead to lower spending from data-center companies. DeepSeek was allegedly developed for a fraction of the cost of other AI models, creating the impression that useful AI might not cost as much to develop as previously expected.</p><p class=\"\">So far, that fear hasn't come to fruition. There is no slowdown in spending yet — or in business momentum at Johnson Controls.</p><p class=\"\">Write to Al Root at allen.root@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007864:0/",
            "pub_date": "2025-02-05 23:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW218:0",
            "title": "Fugro Acquires Mapping And Monitoring Firm EOMAP",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fugro NV :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACQUIRES EOMAP, ADDING UNIQUE SATELLITE ANALYTICS TO ITS WATER MARKET SOLUTIONS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW218:0-fugro-acquires-mapping-and-monitoring-firm-eomap/",
            "pub_date": "2025-02-05 23:54:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW265:0",
            "title": "Wall Street shows its 'bouncebackability': McGeever",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    \"Bouncebackability.\"</p><p class=\"\">This Britishism is usually associated with cliche-prone soccer managers trumpeting their teams' ability to respond to defeat. It's unlikely to find its way across the pond into the Wall Street crowd's lexicon, but it perfectly sums up the U.S. stock market's resilience to all the setbacks, shocks and everything else that's been thrown at it recently.</p><p class=\"\">And there have been a lot: U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a> tariff flip-flops, stretched valuations, extreme concentration in Big Tech and the <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/technology/deepseek/\" rel=\"nofollow\" target=\"_blank\">DeepSeek</a>-led turmoil that recently cast doubt on America's \"exceptionalism\" in the global AI arms race.</p><p class=\"\">Any one of those issues still has the potential to snowball, causing an avalanche of selling that could push U.S. equities into a correction or even bear-market territory.</p><p class=\"\">But Wall Street has become remarkably resilient since the 2022 rout, especially in the last six months. </p><p class=\"\">Just look at the artificial intelligence-fueled turmoil on Jan. 27, spurred by Chinese startup DeepSeek's revelation that it had developed a large language model that could achieve similar or better results than U.S.-developed LLMs at a fraction of the cost. By many measures, the market move was seismic.</p><p class=\"\">Nvidia shares fell 17%, slicing nearly $600 billion off the firm's market cap, the biggest one-day loss for any company ever. The value of the wider U.S. stock market fell by around $1 trillion. </p><p class=\"\">Drilling deeper, analysts at JPMorgan found that the rout in \"long momentum\" - essentially buying stocks that have been performing well recently, such as tech and AI shares - was a near \"seven sigma\" move, or seven times the standard deviation. It was the third-largest fall in 40 years for this trading strategy.</p><p class=\"\">But this epic move didn't crash the market. Rotation into other sectors accelerated, and around 70% of S&amp;P 500-listed stocks ended the day higher, meaning the broader index fell only 1.45%. And buyers of tech stocks soon returned.</p><p class=\"\">U.S. equity funds attracted nearly $24 billion of inflows last week, technology fund inflows hit a 16-week high, and momentum funds attracted positive flows for a fifth-consecutive week, according to EPFR, the fund flows tracking firm.</p><p class=\"\">\"Investors saw the DeepSeek-triggered selloff as an opportunity rather than an off-ramp,\" EPFR director of research Cameron Brandt wrote on Monday. \"Fund flows ... suggest that many of those investors kept faith with their previous assumptions about AI.\" </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1038.9610389610389px;aspect-ratio:1.7316017316017316\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OW265-144e642ff4ceaf5e8f585151f7680c54-resized.webp\" type=\"images/webp\"/><img alt=\"Weekly flows into US equity sector funds in $ million\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OW265-144e642ff4ceaf5e8f585151f7680c54-resized.jpeg\" style=\"background-color:#f3f2f1\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Fund flows: U.S. equity sector funds</span></figcaption></figure></span></p><p class=\"\">PANIC MODE?</p><p class=\"\">Remember \"yenmageddon,\" the yen carry trade volatility of last August? The yen's sudden bounce from a 33-year low against the dollar sparked fears that investors would be forced to sell assets in other markets and countries to cover losses in their huge yen-funded carry trades.</p><p class=\"\">The yen's rally was extreme, on par with past financial crises, and the Nikkei's 12% fall on Aug. 5 was the biggest one-day drop since October 1987 and the second-largest on record. </p><p class=\"\">The panic, if it can be called that, spread. The S&amp;P 500 lost 8% in two days. But it vanished quickly. The S&amp;P 500 recouped its losses within two weeks, and the Nikkei did likewise within a month. </p><p class=\"\">So Wall Street has passed two big tests in the last six months, a period that included the U.S. presidential election and Trump's return to the White House.</p><p class=\"\">What explains the resilience? There's no one obvious answer. Investors are broadly bullish about Trump's economic agenda, the Fed still seems to be in easing mode (for now), the AI frenzy and U.S. exceptionalism narratives are still in play, and liquidity is plentiful.</p><p class=\"\">Perhaps one key driver is a well-worn one: the Fed put. Investors – many of whom have spent a good chunk of their working lives in the era of extraordinarily loose monetary policy – may still feel that, if it really comes down to it, the Fed will have their backs. </p><p class=\"\">There will be more pullbacks, and risks of a more prolonged downturn do seem to be growing. But for now, the rebounds keep coming. That's bouncebackability.</p><p class=\"\">(The opinions expressed here are those of the author, a columnist for Reuters.)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW265:0-wall-street-shows-its-bouncebackability-mcgeever/",
            "pub_date": "2025-02-05 23:54:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310169:0",
            "title": "Update On Calibre Mining; National Bank Looks At Leprechaun RC Drilling Shows Positive Reconciliation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Calibre Mining  on Wednesday released additional drill results from its Leprechaun open pit at the Valentine gold mine in Newfoundland and Labrador, adding 30% to contained gold. </p><p class=\"\">The results of drilling have so far demonstrated 29% more ore tonnes at a 1% higher grade for 30% more gold than the comparable area in the 2022 mineral reserve model at an ore-waste cut-off of 0.38 grams per tonne (g/t) gold. </p><p class=\"\">The grade distribution indicates that applying a higher cut-off grade will result in processing higher grade material, Calibre CEO Darren Hall said in a release. </p><p class=\"\">At a 0.7 g/t cut-off, the reserve model estimated 660,000 tonnes at 2.02 g/t but the ore control model for a similar tonnage results in 18% higher grade by increasing the cut-off to 1.0 g/t. </p><p class=\"\">The findings could result in increased metal production and extend the mine life, Hall noted. </p><p class=\"\">Meanwhile, the company has kept its Outperform rating and $3.40 price target at National Bank of Canada after the news. The price target was based on 5.00x EV/EBITDA NTM. </p><p class=\"\">National Bank said its thesis for Calibre is supported by its peer-leading 75% production growth over the next three years as Valentine commences commercial production (near Q3 2025), strong cash flow generation, and exploration/resource accretion given spare mill capacity. The thesis is tempered by short mine life at Nicaragua. </p><p class=\"\">CXB was at last look up more than 6% on the TSX.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310169:0/",
            "pub_date": "2025-02-05 23:54:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446792:0",
            "title": "US Crude Stocks Rise Most in Near a Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US crude stocks increased for the first time in ten weeks, along with a rise in gasoline inventories, while distillate stocks fell during the week ending January 24, according to the Energy Information Administration.</p><p class=\"\">Crude inventories grew by 3.463 million barrels, exceeding market expectations of a 3.2 million-barrel build, marking the first increase after nine consecutive weeks of declines.</p><p class=\"\">Crude stocks at the Cushing, Oklahoma, delivery hub also rose by 0.326 million barrels.</p><p class=\"\">Gasoline stocks climbed by 2.957 million barrels, surpassing the expected 1.5 million-barrel increase.</p><p class=\"\">However, distillate inventories, which include diesel and heating oil, fell by 4.994 million barrels, exceeding the anticipated 2.1 million-barrel decline.</p><p class=\"\">Meanwhile, net US crude imports rose by 0.532 million barrels per day.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446792:0-us-crude-stocks-rise-most-in-near-a-year/",
            "pub_date": "2025-02-05 23:54:24",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310161:0",
            "title": "Advanced Micro Devices' Proposed ZT Systems Deal Under Review by EU Regulators",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Advanced Micro Devices'  proposed acquisition of ZT Systems was placed under a routine merger review by the European Commission Wednesday, with a provisional deadline of March 12, according to a filing. </p><p class=\"\">AMD's proposed cash and stock deal for the server maker was valued at $4.9 billion when it was announced in August 2024. </p><p class=\"\">AMD and ZT didn't immediately respond to requests for comment from MT Newswires.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310161:0/",
            "pub_date": "2025-02-05 23:54:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446793:0",
            "title": "Heating Oil Extends Downturn",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US heating oil futures dropped to around $2.40 per gallon in February, marking a near one-month low as crude oil feedstocks continued to decline amid rising concerns over a potential US-China trade war and growing fears about global demand.</p><p class=\"\">These concerns were compounded by increased supply, with the latest EIA report revealing a significant 8.7 million barrel build, far exceeding the expected 2.6 million barrel increase for the week ending January 31st. Additionally, unseasonably warm temperatures in key heating oil-consuming regions, including the Midwest and Northeast, contributed to weaker demand, alleviating concerns about potential winter shortages, further pressuring heating commodities.</p><p class=\"\">However, the same report also highlighted a 5.5 million barrel draw in distillate inventories, a reduction more than three times the anticipated decline, which restricted the availability of refined products and moderated the fall in heating oil prices.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446793:0-heating-oil-extends-downturn/",
            "pub_date": "2025-02-05 23:54:54",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310180:0",
            "title": "Bio-Techne Keeps Quarterly Dividend at $0.08 a Share, Payable Feb. 28 to Investors of Record Feb. 17",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310180:0/",
            "pub_date": "2025-02-05 23:54:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007868:0",
            "title": "U.S. Ethanol Production Jumps Back to Near-Record Highs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kirk Maltais</p><p class=\"\">Average daily production of ethanol in the U.S. soared in the last week of January, returning to the near-record levels of November.</p><p class=\"\">In its latest report Wednesday, the Energy Information Administration said that average daily production of ethanol for the week ended Jan. 31 was 1.112 million barrels a day. That's up 97,000 barrels a day from last week's figure, and well beyond the forecasts of analysts surveyed by Dow Jones this week.</p><p class=\"\">Inventories of ethanol in the U.S. also posted a big jump, rising 690,000 barrels to 26.41 million barrels. This figure is also well above the forecasts of analysts surveyed this week.</p><p class=\"\">Surveyed analysts had projected average daily production to land between 1.015 million barrels a day and 1.073 million barrels a day. Stocks were projected between 25.5 million barrels and 26.19 million barrels.</p><p class=\"\">The record high for average daily ethanol production is 1.119 million barrels a day, set in late November of last year.</p><p class=\"\">Corn futures trading on the CBOT are down 0.8%. While higher ethanol production is typically seen as a positive thing for futures, as is the mixed outlook for weather in Argentina over the next two weeks, the net long held by fund traders in corn makes futures' movements unpredictable.</p><p class=\"\">\"We have a near record net long held by speculators and it's anyone's guess when new headlines will hit the market,\" said Doug Bergman of RCM Alternatives in a note Wednesday.</p><p class=\"\">To see related data, search \"U.S. DOE Oil Data: PADD Breakdown\" in Dow Jones NewsPlus.</p><p class=\"\">Write to Kirk Maltais at kirk.maltais@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007868:0/",
            "pub_date": "2025-02-05 23:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007866:0",
            "title": "EU LNG Imports to Rise This Year, Kpler Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The European Union's need to rapidly replenish dwindling gas reserves is expected to boost imports of liquefied natural gas by more than 20% this year, Kpler analysts say. According to the data provider, imports are estimated to increase to 102.3 million tons from 84.4 million tons in 2024. \"LNG will play a crucial role in Europe's efforts to offset the loss of Russian gas supply via Ukraine, particularly during the restocking season, given that underground storage levels are expected to end this winter significantly lower than in the past two years,\" the analysts say. In January, imports to the bloc's 27 members rose to 8.35 million tons, up from 7.30 million tons the previous month due to colder temperatures and lower wind power generation. (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007866:0/",
            "pub_date": "2025-02-05 23:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310170:0",
            "title": "Beyond Air Gets 180-Day Extension to Regain Nasdaq Compliance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Beyond Air  said Wednesday that it secured a 180-day extension, through Aug. 4, to regain compliance with Nasdaq's minimum bid price requirement for continued listing. </p><p class=\"\">The company was notified of its non-compliance with the listing rule in August 2024 and was initially given until Tuesday to cure the deficiency, according to the statement. Beyond Air subsequently requested for the extension. </p><p class=\"\">Beyond Air said the extension does not affect its Nasdaq listing and its shares continue to trade on the bourse. </p><p class=\"\">Beyond Air shares were up nearly 1% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310170:0/",
            "pub_date": "2025-02-05 23:55:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007828:0",
            "title": "Mondelez Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007828:0/",
            "pub_date": "2025-02-05 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007824:0",
            "title": "Market Talk Roundup: Latest on U.S. Politics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering U.S. politics. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1047 ET - Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p><p class=\"\">1034 ET - As the U.S. and Mexico grapple over tariff threats, Mexico is continuing to purchase U.S. corn exports — with the USDA confirming sales of 330,000 metric tons of corn for delivery to Mexico during the 2025/26 marketing year. Corn and soybean futures on the CBOT are lower in early trading, with the last-minute nature of agreements to delay implementing tariffs keeping investors in markets on edge. \"[His] eleventh-hour decision to delay the 25% tariffs he had threatened to impose on Canada and Mexico is a good reminder of his unpredictable nature,\" says Paul Ashworth of Capital Economics in a note, adding that the firm expects the Trump administration to move forward on a 10% universal tariff, as well as higher tariffs on Chinese goods. (kirk.maltais@wsj.com)</p><p class=\"\">1029 ET - GSK has to prove its pipeline is packed with new blockbuster treatments to withstand investors' concerns over its vaccine business slowdown in China and the U.S., AJ Bell investment director Russ Mould says. Further worries over the likely appointment of vaccine-sceptic Robert F Kennedy Jr. as Secretary of Health and Human Services in the U.S. still linger, he says. The British pharma giant's posted a second consecutive drop in sales in the fourth quarter, driven by a 19% decline in sales of its flu shots and a 52% plunge for its respiratory treatment Arexvy. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">0942 ET - U.S. farmers may see a significant price hike for fertilizer if Trump tariffs are implemented, as the materials used for fertilizer are often imported into the U.S, says Farmdoc Daily in a note. Potassium-based fertilizers may take the brunt, as 90% of U.S. consumption of potassium comes from imports. Canada is the leading producer of potash globally, and a tariff could add over $100 per ton for U.S. farmers to the current price tag around $450 a ton, says Farmdoc. Nitrogen fertilizers would also be impacted, although imports account for far less consumption, according to data from the U.S. Geological Survey. Nitrogen fertilizers are the most important for U.S. corn, while U.S. soybeans are often grown using potassium-based products. (kirk.maltais@wsj.com)</p><p class=\"\">0921 ET - U.S. ag traders are taking the lack of retaliatory tariffs from China on U.S. grain exports as a sign that a window for negotiations is open--but the lack of urgency coming from President Trump about negotiating with Chinese President Xi has grain traders nervous. \"Uncertain trade policy between the world's largest soybean importer and the world's second largest soybean exporter are in full display,\" says AgResource in a note. CBOT soybean futures are down 0.6% premarket. (kirk.maltais@wsj.com)</p><p class=\"\">0857 ET - Goldman Sachs economists think the risks of tariff escalation remain very real. The bank's team now projects that the U.S. will enact a 10% global tariff on critical imports such as semiconductors and pharmaceuticals as its baseline forecast, as well as a tariff on cars from the EU. If its current expected scenario is implemented, the tariffs could erase most progress on inflation otherwise expected this year, leaving core PCE inflation at 2.6% over the 12 months through December, Goldman projects. If Canada and Mexico tariffs are implemented after all, inflation would instead increase, peaking just above 3%, Goldman writes. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0847 ET - Oil futures are losing ground after an industry report of a large build in U.S. crude stocks, while the prospect of a trade war fuels concerns about demand. \"All of this tariff talk and general confusion that it's generating is bearish demand as companies can't expand if they don't know what their costs are or what they can sell their goods for,\" Scott Shelton of TP ICAP says in a note. The API reported a 5 million barrel increase in U.S. stocks for last week, analysts note. EIA data inventory are due later this morning, with a Wall Street Journal survey predicting a 1.3 million barrel build. WTI is off 1% at $71.97 a barrel and Brent is down 1.1% at $75.38 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0844 ET - Treasury yields and the dollar weaken as Trump's Gaza takeover proposal squeezes the trade war out of today's headlines. ADP reports 183,000 jobs created by private employers in January, up from an upwardly revised 176,000 in December and higher than consensus of 150,000 in a Wall Street Journal survey. Meanwhile, U.S. trade deficit widens to $98.4 billion in December from November's revised $78.9 billion and versus a forecast of $96.8 billion in a WSJ survey. Yields and the WSJ Dollar Index moved up after the ADP data, before weakening again. The 10-year is at 4.458% and the two-year at 4.187%. The WSJ Dollar Index falls 0.3%.(paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0812 ET - European fixed income markets offer better value than bond markets in the U.S., given the high risk of inflation in the latter, Edmond de Rothschild Asset Management's Benjamin Melman says in a note. \"The global inflation no longer appears to be retreating, notably in the U.S., due to uncertainties surrounding the Trump administration's programme,\" the global chief investment officer says. In fixed income markets, there is more value to be found in Europe, on account of the much higher risks on inflation forecasts in the U.S., he says. Edmond de Rothschild Asset Management has a preference for 'carry' strategies in the current environment, as the yields on money market instruments are expected to fall this year, he says. (emese.bartha@wsj.com)</p><p class=\"\">0705 ET - Euro credit looks more attractive and has more value to offer investors than U.S. credit, Benjamin Melman, global chief investment officer at Edmond de Rothschild Asset Management, says in a note. The risk of inflation reaccelerating in the U.S. makes euro credit more attractive, Melman says. \"The new Trump administration has added an extra layer of uncertainty over the future path of inflation with its tariff and deportation policies,\" he says. (miriam.mukuru@wsj.com)</p><p class=\"\">0606 ET - Gold futures rise, holding ground after setting a fresh record earlier in the session. Futures are up 0.6% at $2,892.70 a troy ounce, having reached $2,901.50 an ounce earlier in the day. The precious metal is gaining on a weaker U.S. dollar and growing concerns of an escalating U.S.-China trade war, and the likely hit to global economic growth prospects, ActivTrades' Ricardo Evangelista says in a note. The weaker dollar follows President Trump's last minute U-turn on imposing additional tariffs on Mexico and Canada, and disappointing U.S. labor and industrial data, Evangelista writes. At the same time, U.S. tariffs on China--and Beijing's response--are ominous for the global economy, increasing gold's safe-haven appeal. Demand is reinforced by further Middle East uncertainty, after Trump's comments about taking over Gaza and displacing the Palestinian population, Evangelista adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0519 ET - Bitcoin rises slightly but trades below the key $100,000 level amid uncertainty over President Trump's tariff plans. China's plans for retaliatory tariffs after Trump imposed a new 10% levy on Chinese imports add uncertainty to risky assets including cryptocurrencies, Saxo Bank analysts say in a note. Market sentiment is also muted after the Trump administration discussed the potential inclusion of bitcoin in a newly proposed U.S. sovereign wealth fund, sparking speculation over institutional adoption, they say. \"Traders remain focused on regulatory developments and macroeconomic shifts.\" Bitcoin rises 1.1% to $97,523, according to LSEG. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007824:0/",
            "pub_date": "2025-02-05 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007822:0",
            "title": "Bunge Shares Fall With Uncertainty Ahead in Ag Markets — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007822:0/",
            "pub_date": "2025-02-05 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007842:0",
            "title": "Banco Santander Up Over 8%, on Track for Highest Close Since May 2018 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Banco Santander S.A. Sponsored ADR (SAN) is currently at $5.54, up $0.42 or 8.09%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since May 25, 2018, when it closed at $5.60</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Oct. 4, 2022, when it rose 9.09%</li><li class=\"listItem-bmN0_SHH\">Currently up two consecutive days; up 12.02% over this period</li><li class=\"listItem-bmN0_SHH\">Best two day stretch since the two days ending Oct. 4, 2022, when it rose 13.79%</li><li class=\"listItem-bmN0_SHH\">Up 21.6% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 73.98% from its all-time closing high of $21.31 on May 15, 2008</li><li class=\"listItem-bmN0_SHH\">Up 39.67% from 52 weeks ago (Feb. 7, 2024), when it closed at $3.97</li><li class=\"listItem-bmN0_SHH\">Would be a new 52-week closing high</li><li class=\"listItem-bmN0_SHH\">Up 42.91% from its 52-week closing low of $3.88 on Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $5.58; highest intraday level since May 25, 2018, when it hit $5.60</li><li class=\"listItem-bmN0_SHH\">Up 8.77% at today's intraday high; largest intraday percent increase since Oct. 4, 2022, when it rose as much as 9.09%</li></ul><p class=\"\">All data as of 10:45:44 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007842:0/",
            "pub_date": "2025-02-05 23:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}