{
    "data": [
        {
            "id": "DJN_DN20250205005733:0",
            "title": "Bitdeer Techs Group Is Maintained at Buy by Rosenblatt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:03 GMT) </strong>Bitdeer Techs Group Price Target Raised to $30.00/Share From $22.00 by Rosenblatt</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005733:0/",
            "pub_date": "2025-02-05 21:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309881:0",
            "title": "RBC Trims Price Target on Xylem to $160 From $162, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Xylem  has an average rating of overweight and mean price target of $150.14, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309881:0/",
            "pub_date": "2025-02-05 21:03:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0KK:0",
            "title": "Italy's Anima reports 50% increase in 2024 profit, shares hit highest since 2016",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Italian asset manager Anima Holding  on Wednesday reported a 50% rise to 276.5 million euros ($288 million) in its 2024 adjusted consolidated net profit as acquisitions of new businesses pushed revenue higher.</p><p class=\"\">The group, which is the target of a 1.6 billion euros buyout offer from shareholder Banco BPM , has proposed a dividend of 0.45 euro per share, up from the 0.25 euro per share it paid the previous year.</p><p class=\"\">By 1250 GMT, the stock was up 3.6% at 7 euros per share, hitting its highest level since January 2016.</p><p class=\"\">The company results were bolstered by the contribution of real estate management company Vita, acquired in August 2024, as well as the businesses of Kairos and Castello SGR, purchased in May 2024 and in 2023, respectively.</p><p class=\"\">\"Positive inflows, growing profitability, business diversification, strong capital generation, and attention to shareholder remuneration were the key elements for Anima in 2024,\" Chief Executive Officer Alessandro Melzi d'Eril said in a statement.</p><p class=\"\">Total revenue rose 44% from a year earlier to 530 million euros mainly due to higher commissions. Excluding the effect from acquisitions, revenue rose 33% compared to 2023.</p><p class=\"\">Total assets under management reached 204.2 billion euros at the end of December 2024 thanks to the addition of Kairos Partners and the positive performance of managed assets.</p><p class=\"\">($1 = 0.9605 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0KK:0-italy-s-anima-reports-50-increase-in-2024-profit-shares-hit-highest-since-2016/",
            "pub_date": "2025-02-05 21:03:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309880:0",
            "title": "UBS Adjusts Price Target on Popular to $105 From $104, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Popular  has an average rating of overweight and mean price target of $114.89, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309880:0/",
            "pub_date": "2025-02-05 21:03:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005605_20250205005740:0",
            "title": "Illinois Tool Works 4Q Operating Margin 26.2% >ITW",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005605_20250205005740:0/",
            "pub_date": "2025-02-05 21:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005605_20250205005743:0",
            "title": "Illinois Tool Works 4Q Operating Cash Flow $1.1B, Free Cash Flow $1B >ITW",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005605_20250205005743:0/",
            "pub_date": "2025-02-05 21:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309878:0",
            "title": "GUIDANCE: (ITW) Illinois Tool Works Expects Full Year 2025 EPS Range $10.15 - $10.55, vs. FactSet Est of $10.59",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309878:0/",
            "pub_date": "2025-02-05 21:04:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309876:0",
            "title": "Earnings Flash (ITW) Illinois Tool Works Posts Q4 EPS $2.54, vs. FactSet Est of $2.49",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309876:0/",
            "pub_date": "2025-02-05 21:04:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446756:0",
            "title": "Brazil Private Sector Activity Contracts After Nearly 4 Years of Expantion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Composite PMI for Brazil fell to 48.2 in January 2025 from 51.5 in December, marking the first private sector contraction since April 2021.</p><p class=\"\">Both services and manufacturing sectors declined, with services driving the downturn and manufacturing output contracting slightly.</p><p class=\"\">New business fell overall, ending a yearlong expansion, as modest growth in goods orders was outweighed by a drop in services.</p><p class=\"\">Cost inflation hit a two-and-a-half-year high across sectors, with services facing steeper pressures.</p><p class=\"\">Selling price inflation accelerated to its highest since mid-2022, as firms raised prices to counter rising costs.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446756:0-brazil-private-sector-activity-contracts-after-nearly-4-years-of-expantion/",
            "pub_date": "2025-02-05 21:04:56",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005605_20250205005748:0",
            "title": "Illinois Tool Works: 2025 EPS View Includes 30c Foreign Currency Translation Headwind >ITW",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005605_20250205005748:0/",
            "pub_date": "2025-02-05 21:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:02fde4c902ebb:0",
            "title": "Reservoir Media Announces Third Quarter Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reservoir Media, Inc., an independent music company, has released its financial results for the third quarter of fiscal 2025, ending December 31, 2024. The company reported strong performance across both its Music Publishing and Recorded Music segments, leading to significant revenue growth and improved profitability.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Reservoir Media reported a total revenue of $42.3 million for the third quarter, marking a 19% increase compared to the same period last year. This growth was driven by a 16% rise in Music Publishing revenue and a 20% increase in Recorded Music revenue. The company also reported a net income of $5.3 million, or $0.08 per share, compared to a net loss of $2.9 million, or $0.05 per share, in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Key business highlights for the quarter include the acquisition of the publishing catalog of Lastrada Entertainment, which features multiple chart-topping and Grammy Award-winning titles. Additionally, Reservoir expanded its relationship with producer and songwriter Serban Cazan and signed a publishing catalog deal with composer Lebohang Morake, known for his work on The Lion King franchise.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Reservoir Media has been active in strategic acquisitions, including the Lastrada Entertainment catalog. The company also focused on disciplined cost controls, which contributed to margin growth. These strategic moves are part of Reservoir's ongoing efforts to enhance its catalog and talent roster.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Golnar Khosrowshahi, Founder and CEO of Reservoir Media, commented on the results, stating, \"Our third fiscal quarter marks another strong period of growth across both the top and bottom lines of our business. With our team’s expertise and strong relationships across the industry, Reservoir consistently ushers in accretive opportunities that further shape our catalog and roster of talent into a diverse and valuable portfolio.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Reservoir Media has raised its financial outlook for fiscal 2025, now expecting revenue between $155 million and $158 million, and Adjusted EBITDA between $61.5 million and $64.5 million. CFO Jim Heindlmeyer expressed confidence in the company's performance and future opportunities, highlighting the resiliency of cash flows and the strength of the roster.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1824403/000110465925009381/tm255373d1_8k.htm\" rel=\"nofollow\" target=\"_blank\">Reservoir Media, Inc. [ RSVR ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:02fde4c902ebb:0-reservoir-media-announces-third-quarter-fiscal-2025-results/",
            "pub_date": "2025-02-05 21:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:3c9051b3da9b5:0",
            "title": "American Financial Group, Inc. Announces Fourth Quarter and Full Year Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">American Financial Group, Inc., an insurance holding company based in Cincinnati, Ohio, has released its financial results for the fourth quarter and full year of 2024. The company, primarily engaged in property and casualty insurance through its Great American Insurance Group, reported notable financial performance and strategic developments.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, American Financial Group (AFG) reported net earnings of $255 million, or $3.03 per share, compared to $263 million, or $3.13 per share, in the same period of 2023. Core net operating earnings were $262 million, or $3.12 per share, up from $238 million, or $2.84 per share, in the fourth quarter of 2023. The full year net earnings per share stood at $10.57, with core net operating earnings per share at $10.75.</p><p class=\"\">AFG's return on equity (ROE) for the full year 2024 was 19.0%, with a core operating ROE of 19.3%. The company also achieved an overall average renewal rate increase of 8%, excluding workers' compensation.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">AFG's Specialty Property and Casualty (P&amp;C) insurance operations reported a combined ratio of 89.0% for the fourth quarter of 2024, slightly higher than the 87.7% reported in the prior year quarter. The Property and Transportation Group saw an underwriting profit of $82 million, while the Specialty Casualty Group reported an underwriting profit of $82 million, despite adverse prior year reserve development in certain businesses. The Specialty Financial Group achieved an underwriting profit of $54 million.</p><p class=\"\">Gross and net written premiums for the full year 2024 increased by 9% and 7%, respectively, establishing new records for premium production. The company also reported a 21% increase in property and casualty net investment income for the fourth quarter, driven by improved returns on alternative investments and rising interest rates.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">AFG returned approximately $791 million to shareholders in 2024, including $545 million in special dividends. The company also increased its quarterly dividend by 12.7% and paid special dividends of $6.50 per share. AFG's book value per share was $53.18 at the end of 2024, with book value per share excluding accumulated other comprehensive income (AOCI) at $56.03.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Carl H. Lindner III and S. Craig Lindner, AFG’s Co-Chief Executive Officers, expressed satisfaction with the company's performance, highlighting the annual core operating return on equity exceeding 19% and a 7% growth in net written premiums. They emphasized the company's strong underwriting results, record P&amp;C net investment income, and effective capital management as key factors in creating long-term value for shareholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, AFG expects core operating earnings per share of approximately $10.50, with a core operating return on equity excluding AOCI of around 18%. The company anticipates 5% growth in net written premiums and a 92.5% calendar year combined ratio. AFG also estimates losses related to the Southern California wildfires to be between $60 and $70 million.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1042046/000119312525020439/d919412d8k.htm\" rel=\"nofollow\" target=\"_blank\">AMERICAN FINANCIAL GROUP INC [ AFG ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:3c9051b3da9b5:0-american-financial-group-inc-announces-fourth-quarter-and-full-year-results/",
            "pub_date": "2025-02-05 21:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309839:0",
            "title": "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Wednesday Amid Tech Earnings Misses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The broad market exchange-traded fund SPDR S&amp;P 500 ETF Trust  was down 0.5% and the actively traded Invesco QQQ Trust  retreated 0.8% in Wednesday's premarket activity amid disappointing earnings reports from major technology companies. </p><p class=\"\">US stock futures were mixed, with S&amp;P 500 Index futures down 0.5%, Dow Jones Industrial Average futures slipping 0.04%, and Nasdaq futures retreating 0.8% before the start of regular trading. </p><p class=\"\">US mortgage applications rose 2.2% in the week ended Jan. 31 as the average 30-year fixed mortgage rate fell below 7% for the first time in six weeks, Mortgage Bankers Association data showed Wednesday. </p><p class=\"\">The January ADP private-sector employment report will be released at 8:15 am ET. </p><p class=\"\">The international trade in goods and services bulletin for December posts at 8:30 am ET, followed by the S&amp;P Global PMI composite final for January at 9:45 am ET, and then the ISM services index for January at 10 am ET. </p><p class=\"\">The weekly EIA domestic petroleum status report posts at 10:30 am ET. </p><p class=\"\">Richmond Federal Reserve President Thomas Barkin speaks at 9 am ET, Chicago Federal Reserve President Austan Goolsbee at 2:30 pm ET, Governor Michelle Bowman at 3 pm ET, and Vice Chair Philip Jefferson at 7:30 pm ET. </p><p class=\"\">In premarket activity, bitcoin was down by 0.2% and the cryptocurrency fund ProShares Bitcoin Strategy ETF  was 0.2% lower. </p><p class=\"\">Power Play:</p><p class=\"\">Technology</p><p class=\"\">Technology Select Sector SPDR Fund  retreated 0.5%, and the iShares US Technology ETF  slipped 0.4%, while the iShares Expanded Tech Sector ETF  was down 0.8%. Among semiconductor ETFs, SPDR S&amp;P Semiconductor ETF  fell 1.1%, while the iShares Semiconductor ETF  declined by 0.4%. </p><p class=\"\">Advanced Micro Devices  shares were down more than 9% in recent Wednesday premarket activity after the chipmaker forecast a sequential decline in Q1 revenue, while the company's weaker-than-expected artificial intelligence figures overshadowed top- and bottom-line beats in the prior period. </p><p class=\"\">Winners and Losers:</p><p class=\"\">Financial</p><p class=\"\">Financial Select Sector SPDR Fund  advanced 0.2%. Direxion Daily Financial Bull 3X Shares  was up 0.4%, while its bearish counterpart Direxion Daily Financial Bear 3X Shares  was 0.4% lower. </p><p class=\"\">Banco Santander  shares were up 7.6% pre-bell Wednesday after the company reported higher Q4 earnings that exceeded analyst estimates. </p><p class=\"\">Health Care</p><p class=\"\">The Health Care Select Sector SPDR Fund  advanced 0.3%. The Vanguard Health Care Index Fund  was up 0.2%, while the iShares US Healthcare ETF  and the iShares Biotechnology ETF  were inactive. </p><p class=\"\">Novo Nordisk  stock was up 3.2% premarket after the company reported higher Q4 earnings and sales that beat FactSet analyst estimates. </p><p class=\"\">Consumer</p><p class=\"\">The Consumer Staples Select Sector SPDR Fund  was up 0.1%, while the Vanguard Consumer Staples Fund  was inactive. The iShares US Consumer Staples ETF  was inactive, and the Consumer Discretionary Select Sector SPDR Fund  lost 0.7%. The VanEck Retail ETF  and the SPDR S&amp;P Retail ETF  were inactive. </p><p class=\"\">Toyota Motor  shares were up 3% pre-bell after the company raised its operating profit and revenue guidance for fiscal 2025. </p><p class=\"\">Industrial</p><p class=\"\">Industrial Select Sector SPDR Fund  advanced 0.1% while the Vanguard Industrials Index Fund  and the iShares US Industrials ETF (IYJ) were inactive. </p><p class=\"\">Timken  stock was down 1.8% before the opening bell after the company reported lower Q4 adjusted earnings and net sales. </p><p class=\"\">Energy</p><p class=\"\">The iShares US Energy ETF  was inactive, while the Energy Select Sector SPDR Fund  was up by 0.1%. </p><p class=\"\">TotalEnergies  stock was up 1.6% before Wednesday's opening bell after the company reported higher-than-expected Q4 adjusted earnings and revenue. </p><p class=\"\">Commodities</p><p class=\"\">Front-month US West Texas Intermediate crude oil fell 1% to $71.97 per barrel on the New York Mercantile Exchange. Natural gas was down 1.6% at $3.20 per 1 million British Thermal Units. United States Oil Fund  declined by 1%, while the United States Natural Gas Fund  slipped by 0.8%. </p><p class=\"\">Gold futures for April gained 0.6% to reach $2,892.20 an ounce on the Comex, while silver futures slipped 0.3% to $32.94 an ounce. SPDR Gold Shares  were up 0.8%, and the iShares Silver Trust  was 0.8% higher.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309839:0-exchange-traded-funds-equity-futures-lower-pre-bell-wednesday-amid-tech-earnings-misses/",
            "pub_date": "2025-02-05 21:05:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX26Qmjy:0",
            "title": "BitMEX Launches 20 New Altcoin Options Featuring LTC, SUI, LINK, and More",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Traders can now access 20 new altcoin options contracts for Litecoin, Sui, Chainlink, Aave, and more on BitMEX</p><p class=\"\">MAHE, Seychelles, Feb.  05, 2025  (GLOBE NEWSWIRE) — BitMEX, the OG crypto derivatives exchange, is excited to announce the launch of 20 new option contracts, offering traders one of the first-ever opportunities to engage with a diverse range of altcoin options across Litecoin (LTC), SUI (Sui), LINK (Chainlink), AAVE (Aave), and more.</p><p class=\"\">BitMEX Options delivers on deep liquidity and low slippage through an Orderbook and a Request-for-Quote (RFQ) interface, allowing users to trade single-leg or multi-leg options with the lowest minimum sizes in the industry. This combined with the Strategies Dashboard that enables traders to execute advanced options strategies with a single click, makes trading altcoin options accessible to any type of user.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stephan Lutz, CEO of BitMEX </strong>said, “With the markets showing more volatility than ever, traders have an opportunity to push their strategies further, and we want to ensure they have every advantage. With this expansion, BitMEX is delivering what traders demand - a wider range of assets whilst empowering them with cutting-edge features that make executing sophisticated strategies effortless. With the addition of 20 new altcoin pairs, it reinforces our commitment to making BitMEX the go-to platform for options trading.”</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:847.2868217054264px;aspect-ratio:1.4121447028423773\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX26Qmjy-4c3387ad6a3d11c5c7b0186b725b032d-resized.webp\" type=\"images/webp\"/><img alt=\"BitMEX Options User Interface\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX26Qmjy-4c3387ad6a3d11c5c7b0186b725b032d-resized.jpeg\" style=\"background-color:#1d232a\"/></picture></div></figure></span></p><p class=\"\">Options traders can now access options pairs for BTC, ETH, AAVE, ADA, APT, AVAX, BCH, DOGE, FIL, ICP, LDO, LINK, LTC, MMPEPE, MMSHIB, MNT, OP, ORDI, SOL, SUI, TON, TRX, UNI, WLD, and XRP – totalling 26 pairs available for trading on BitMEX Options.</p><p class=\"\"><em>Ready to Trade?</em> Sign up for BitMEX today and explore the full suite of options trading at https://www.bitmex.com/app/options. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About BitMEX</strong></p><p class=\"\">BitMEX is the OG crypto derivatives exchange, providing professional crypto traders with a platform that caters to their needs through low latency, deep crypto native liquidity and unmatched reliability.</p><p class=\"\">Since its founding, no cryptocurrency has been lost through intrusion or hacking, allowing BitMEX users to trade safely in the knowledge that their funds are secure. So too that they have access to the products and tools they require to be profitable.</p><p class=\"\">BitMEX was also one of the first exchanges to publish their on-chain Proof of Reserves and Proof of Liabilities data. The exchange continues to publish this data twice a week – proving assurance that they safely store and segregate the funds they are entrusted with.</p><p class=\"\">For more information on BitMEX, please visit the BitMEX Blog or www.bitmex.com, and follow Telegram, Twitter, Discord, and its online communities. For further inquiries, please contact press@bitmex.com.</p><p class=\"\">Photos accompanying this announcement are available at: </p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/c35a0026-3fd6-4578-b911-24f3b3aed0ff</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/d07afd47-2728-4646-9a2f-85d7c091d824</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BitMEX Launches 20 New Altcoin Options </strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Traders can now access a total of 26 altcoin options contracts for Litecoin, Sui, Chainlink, Aave, and more on BitMEX</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BitMEX Options User Interface</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">BitMEX Options offers 20 new altcoin pairs </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX26Qmjy:0-bitmex-launches-20-new-altcoin-options-featuring-ltc-sui-link-and-more/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX87sNgy:0",
            "title": "Asia Broadband’s Nears Completion Of Its Next-Generation AABB Wallet’s On/Off Ramp To Facilitate Users to Buy and Sell the AABBG Token",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LAS VEGAS, Feb.  05, 2025  (GLOBE NEWSWIRE) — Asia Broadband Inc.  (“AABB” or the “Company”) is pleased to announce that the Company is nearing completion of incorporating an On/Off ramp mechanism in the next-generation AABB Wallet to facilitate users AABBG token and cryptocurrency transactions. The On/Off ramp integration is a collaborative process that is in the final stages of completion and necessary for Google Play and Apple App stores approval. Additionally, with the current favourable cryptocurrency environment, the Company is adding the official TrumpCoin (TRUMP) and Elon Musk Coin (MUSK) to the new AABB Wallet and will continue to add more tokens and features going forward.</p><p class=\"\">The new next generation AABB Wallet has been built as a leading Algorand wallet for multi-chain management powered by AI. Using advanced algorithms, its AI can analyze market trends and historical data to forecast potential price movements, helping traders make smarter decisions about when to buy or sell cryptocurrencies. By reducing the risk of losses and providing profit insights, this AI-driven approach aims to empower traders to navigate the crypto market transactions with confidence and success. Designed for users with diverse portfolios and DeFi activities across various blockchains, the new AABB Wallet offers a seamless user experience through features like WalletConnect and a browser extension, allowing all assets to be brought into one streamlined interface. Users can also customize their experience by adding unique ID’s, further enhancing their control and flexibility. With robust cross-chain capabilities and exceptional support for Algorand ASA’s, the new next generation AABB Wallet exemplifies and shines as the ideal multi-chain wallet.</p><p class=\"\">\"We are very close to the finish line now to launch our new next generation AABB Wallet app with its high level functionality and AI integrated and merchant payment features. The KOINFOLD team has been instrumental in creating innovative wallet tools for mass-market appeal and use through KYN Capital’s blue-chip relationship networks. We are striving to take our AABBG gold-backed token and digital assets business segment to the next level of expansion with the new AABB Wallet,\" expressed Chris Torres, AABB President and CEO.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Asia Broadband</strong></p><p class=\"\">Asia Broadband Inc.  is a resource company focused on the production of precious metals and the accumulation of physical gold holdings. The Company utilizes its specific geographic expertise, experience and extensive industry contacts to facilitate the expansion of precious metals property holdings and production in Mexico. The Company's industry and business integration in Mexico and its asset diversification are unique strengths of AABB that differentiate it from other companies and creates distinctive value for shareholders. Additionally, the Company has a digital assets business segment with its AABBG mine-to-token gold-backed cryptocurrency within its own proprietary AABB Wallet and the unique Golden Baboons Mining Club and Shorts Rascal Club Non-Fungible Token (NFT) collections. AABB expects its token to become a world-wide standard of exchange that is stable, secured and trusted with gold backing, while having the added benefit of demand based price appreciation. These are unique and outstanding qualities relative to other cryptocurrencies and digital asset developers.</p><p class=\"\">Contact the Company at:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>General Email:</td><td>ir@asiabroadbandinc.com</td></tr><tr><td>Token Support:</td><td>support@aabbgmine2token.com</td></tr><tr><td>Company Websites:</td><td>www.asiabroadbandinc.comwww.aabbgmine2token.comwww.goldenbaboons.com</td></tr><tr><td>Phone: </td><td>702-866-9054</td></tr></tbody></table></div><p class=\"\">Forward-Looking Statements are contained in this press release within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are based on the Asia Broadband Inc.’s (the “Company”) expected current beliefs about the Company’s business, which are subject to uncertainty and change. The operations and results of the Company could materially differ from what is expressed or implied by the statements made above when industry, regulatory, market and competitive circumstances change. Further information about these risks can be found in the annual and quarterly disclosures the Company has published on the OTC Markets website. The Company is under no obligation to update or alter its forward-looking statements as future circumstances, events and information may change.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX87sNgy:0-asia-broadband-s-nears-completion-of-its-next-generation-aabb-wallet-s-on-off-ramp-to-facilitate-users-to-buy-and-sell-the-aabbg-token/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX63T3vP:0",
            "title": "Aprea Therapeutics Announces Strategic IP Portfolio Evolution in DNA Damage Response (DDR) Cancer Therapeutics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DOYLESTOWN, Pa., Feb.  05, 2025  (GLOBE NEWSWIRE) — Aprea Therapeutics, Inc.  (“Aprea”, or the “Company”), a clinical-stage biopharmaceutical company developing innovative treatments that exploit specific cancer cell vulnerabilities while minimizing damage to healthy cells, today provided an update on its existing patent portfolio.</p><p class=\"\">“Our strong patent portfolio reflects our commitment to innovation and leadership in the field of DNA Damage Response therapeutics,” said Oren Gilad, Ph.D., President and Chief Executive Officer of Aprea. “Intellectual property is an essential component of Aprea’s strategy, enabling us to advance first in class and best in class oncology treatments while protecting the value of our assets. Our commitment to securing global intellectual property rights underscores our long-term vision to develop and commercialize breakthrough therapies for difficult to treat cancers.”</p><p class=\"\">Aprea’s ATR inhibitor program is protected by a strong patent estate, including four granted U.S. patents, one pending U.S. application, and one pending provisional application. There are 19 granted non-U.S. patents and 16 pending non-U.S. patent applications. The granted patents will expire 2035-2037 and the pending applications, if granted, could extend exclusivity into 2044. Additional regulatory exclusivities up to five years may also be available. This portfolio comprehensively covers the program’s proprietary compounds, pharmaceutical compositions, and methods of use. The Company’s lead ATR inhibitor, ATRN-119, is currently being evaluated in the ABOYA-119 clinical trial as monotherapy in patients with advanced solid tumors having at least one mutation in a defined panel of DNA damage response (DDR)-related genes.</p><p class=\"\">The intellectual property covering Aprea’s WEE1 kinase inhibitor program includes one pending U.S. patent application and 12 pending non-U.S. patent applications. The WEE1 family of applications, if granted, will expire in 2043, not including any regulatory exclusivities that may be awarded. The WEE1-portfolio covers key aspects of the program, including proprietary compounds, pharmaceutical compositions, and methods of use. The Company’s lead WEE1 inhibitor, APR-1051, is currently being evaluated in the ACESOT-1051 Phase 1 clinical trial in advanced/metastatic solid tumors harboring certain cancer-associated gene alterations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aprea</strong></p><p class=\"\">Aprea is pioneering a new approach to treat cancer by exploiting vulnerabilities associated with cancer cell mutations. This approach was developed to kill tumors but to minimize the effect on normal, healthy cells, decreasing the risk of toxicity that is frequently associated with chemotherapy and other treatments. Aprea’s technology has potential applications across multiple cancer types, enabling it to target a range of tumors, including ovarian, colorectal, prostate, and breast cancers. The company’s lead programs are APR-1051, an oral, small-molecule inhibitor of WEE1 kinase, and ATRN-119, a small molecule ATR inhibitor, both in clinical development for solid tumor indications. For more information, please visit the company website at www.aprea.com.</p><p class=\"\">The Company may use, and intends to use, its investor relations website at https://ir.aprea.com/ as a means of disclosing material nonpublic information and for complying with its disclosure obligations under Regulation FD.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statement</strong></p><p class=\"\">Certain information contained in this press release includes “forward-looking statements”, within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended related to our study analyses, clinical trials, regulatory submissions, and projected cash position. We may, in some cases use terms such as “future,” “predicts,” “believes,” “potential,” “continue,” “anticipates,” “estimates,” “expects,” “plans,” “intends,” “targeting,” “confidence,” “may,” “could,” “might,” “likely,” “will,” “should” or other words that convey uncertainty of the future events or outcomes to identify these forward-looking statements. Our forward-looking statements are based on current beliefs and expectations of our management team and on information currently available to management that involve risks, potential changes in circumstances, assumptions, and uncertainties. All statements contained in this press release other than statements of historical fact are forward-looking statements, including statements regarding our ability to develop, commercialize, and achieve market acceptance of our current and planned products and services, our research and development efforts, including timing considerations and other matters regarding our business strategies, use of capital, results of operations and financial position, and plans and objectives for future operations. Any or all of the forward-looking statements may turn out to be wrong or be affected by inaccurate assumptions we might make or by known or unknown risks and uncertainties. These forward-looking statements are subject to risks and uncertainties including, without limitation, risks related to the success, timing, and cost of our ongoing clinical trials and anticipated clinical trials for our current product candidates, including statements regarding the timing of initiation, pace of enrollment and completion of the trials (including our ability to fully fund our disclosed clinical trials, which assumes no material changes to our currently projected expenses), futility analyses, presentations at conferences and data reported in an abstract, and receipt of interim or preliminary results (including, without limitation, any preclinical results or data), which are not necessarily indicative of the final results of our ongoing clinical trials, our understanding of product candidates mechanisms of action and interpretation of preclinical and early clinical results from its clinical development programs, and the other risks, uncertainties, and other factors described under “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and elsewhere in the documents we file with the U.S. Securities and Exchange Commission. For all these reasons, actual results and developments could be materially different from those expressed in or implied by our forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which are made only as of the date of this press release. We undertake no obligation to update such forward-looking statements for any reason, except as required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor and Media Contact:</strong></p><p class=\"\">Mike Moyer</p><p class=\"\">LifeSci Advisors</p><p class=\"\">mmoyer@lifesciadvisors.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX63T3vP:0-aprea-therapeutics-announces-strategic-ip-portfolio-evolution-in-dna-damage-response-ddr-cancer-therapeutics/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXbWwC6P:0",
            "title": "Alice Group USA Announces Acquisition Strategy and Transformation of TFLM",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WEST HOLLYWOOD, Calif., Feb.  05, 2025  (GLOBE NEWSWIRE) — Alice Group USA, LLC announces the acquisition of the controlling shareholder block of Tofla Megaline Inc. (OTCQB: TFLM) as the <!-- -->first major step in the capitalization of its ambitious strategy to transform TFLM into a real estate, financial services, and tech group aimed at improving inclusion, asset ownership, and access to technology for entrepreneurs, startups, and business owners in the United States. TFLM’s development strategy will include providing co-working spaces, financial services, and IT support, including AI-driven office solutions.</p><p class=\"\">In the coming weeks, Alice Group USA intends to bring on a world-class management team with deep expertise in AI, technology development, and real estate. This new leadership team, is expected to have a robust background in artificial intelligence, machine learning, and innovative financial technologies, with the goal of providing a significant core advantage to Alice in executing its transformative business plan. </p><p class=\"\">The integration of AI-driven solutions across the real estate and financial platforms with the goal of enabling TFLM to streamline operations, enhance data-driven decision-making, and drive unparalleled value for entrepreneurs, startups, and underserved communities. The team’s technological expertise will be utilized in driving TFLM’s growth, improving efficiency, and expanding market opportunities within the emerging AI and real estate sectors. This strong technological foundation positions TFLM to be a leader in the next generation of AI-powered financial services and real estate management.</p><p class=\"\">As the first stage of its strategic development, TFLM is seeking to acquire equity interests in Nexus Workspaces, a leading coworking brand in Florida and Georgia. The assets to be acquired, in a series of transactions subject to entering definitive agreements and various closing convictions, include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Nexus’s proprietary technology, designed to streamline commercial property management, enhance operational efficiency, and automate workspace and support solutions for use within the Nexus workspaces. This acquisition will enable TFLM to develop additional suites of services for growing entrepreneurs, start-ups, and minority businesses, including the provision of financial products and venture capital.</li><li class=\"listItem-bmN0_SHH\">The acquisition of Boundary Midtown Atlanta, a Class A office portfolio strategically located in Midtown Atlanta. The $75 million asset features a 75%+ occupancy rate and is expected to generate consistent income while allowing TFLM to repurpose select vacancies for Nexus-branded operations.</li><li class=\"listItem-bmN0_SHH\">The acquisition of five additional commercial office properties under the Nexus Workspaces brand, covering 251,622 square feet across Florida and Atlanta. With 90% occupancy and over 800 tenants, this portfolio offers a prime opportunity for revenue growth through AI-enhanced commercial real estate management.</li></ul><p class=\"\">Upon completion of these acquisitions, TFLM will have acquired a diverse set of high-value real estate assets. TFLM has identified additional real estate assets and has begun negotiations to acquire and add to its real estate portfolio, with a focus on Florida and other targeted markets. It is the intent of these strategic acquisitions to further enhance TFLM’s long-term growth and operational capabilities, expanding its market presence and fostering sustained revenue generation.</p><p class=\"\">TFLM is seeking to become the U.S. operating company for a group of businesses aimed at democratizing capital access and enhancing financial efficiency, especially for minority-owned businesses, real estate owners, and start-up companies. We are in advanced discussions with businesses in the U.S. involved in neo-banking, provision of AI-enhanced services, and investment risk assessment to complete a powerful and compelling suite of products that will harness the power of American entrepreneurialism while providing investors with the security derived from a grounding in the long-term growth and stable cash flow of prime real estate holdings.</p><p class=\"\">Alice Group USA believes that the suite of products being developed and acquired by TFLM will have international application, and has hired Brigg Macadam Capital, an international corporate finance firm with a track record of providing access to capital for companies’ global business objectives. Tim Murray, CEO of Brigg Macadam Capital, commented:</p><p class=\"\">“We are incredibly excited to work with Alice Group USA and TFLM. By merging AI-driven financial services with strategic real estate acquisitions, Alice’s management team is seeking to build a next-generation ecosystem that has huge relevance in international markets.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Alice Group USA, LLC</strong></p><p class=\"\">Alice Group USA is an innovative <strong class=\"root-Tkn6WL2y\">investment and technology firm</strong> specializing in AI-powered financial solutions, real estate acquisitions, and market-defining investment strategies. With a strong emphasis on <!-- -->capital access, wealth creation, and inclusive finance, the company is <!-- -->pioneering the future of AI-driven financial ecosystems.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About TFLM (Tofla Megaline Inc.)</strong></p><p class=\"\">TFLM is an <strong class=\"root-Tkn6WL2y\">OTCQB-listed public entity</strong> undergoing a <strong class=\"root-Tkn6WL2y\">strategic transformation</strong> which commenced with Alice Group USA’s acquiring its control position. By integrating <!-- -->high-value real estate, AI-driven solutions, and fintech innovations, TFLM is set to emerge as a <strong class=\"root-Tkn6WL2y\">leading diversified company</strong>.</p><p class=\"\">Cautionary Statement Regarding Forward Looking Statements </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">The discussions in this press release contain forward-looking statements reflecting our current expectations that involve risks and uncertainties. These statements are made under the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. When used in this press release, the words “anticipate,” “expect,” “plan,” “believe,” “seek,” “estimate,” and similar expressions are intended to identify forward-looking statements and relate to future periods. Forward-looking statements are statements that are not historical facts and speak only as of the date hereof. We expressly disclaim any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in our expectations with regard thereto or any change in events, conditions, or circumstances on which any such statement is based, except as required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">Alice Group USA</p><p class=\"\">info@alicegroup.ai</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXbWwC6P:0-alice-group-usa-announces-acquisition-strategy-and-transformation-of-tflm/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX8Phyh7:0",
            "title": "Akoya Biosciences Unveils Strategic Product Roadmap, Powered by the New IO60 and Upcoming Neurobiology Panels",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rapid menu expansion with new high-plex human and mouse neurobiology panels joining the recently launched Human IO60 and Mouse FFPE IO Panels</p><p class=\"\">The new offerings solidify leadership in spatial biology and broaden reach to new verticals</p><p class=\"\">MARLBOROUGH, Mass., Feb.  05, 2025  (GLOBE NEWSWIRE) — Akoya Biosciences, a spatial proteomics leader, announced its reagent product roadmap today, featuring new ultrahigh-plex neurobiology panels for human and mouse applications. Building on the success of the Human IO60 and Mouse FFPE IO panels, which debuted at the Society for Immunotherapy of Cancer (SITC) Annual Meeting in November 2024, this roadmap represents the next step in the company’s mission to provide cutting-edge tools for advancing research across multiple market including oncology, inflammatory disease and neurobiology.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Transforming Spatial Proteomics with IO60</strong></p><p class=\"\">Since its launch, the PhenoCode™ Discovery IO60 panel has been celebrated by key opinion leaders (KOLs) and contract research organizations (CROs) for its ability to generate deep insights into immune landscapes and tumor-immune interactions. Early adopters have highlighted its transformative potential:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Dr. Simon Knott, Assistant Professor at Cedars-Sinai, stated, “The IO60 Panel has the potential to reshape spatial proteomics, opening new possibilities for immune research.”</li><li class=\"listItem-bmN0_SHH\">Dr. Suzuki Yutaka, Professor at the University of Tokyo, added, “With the IO60 Panel, we’re uncovering patterns in immune responses that were previously inaccessible, positioning it as a game-changer for understanding tumor-immune interactions at a deeper level.”</li><li class=\"listItem-bmN0_SHH\">Strategic alliances with leading CROs—including Precision for Medicine, BostonGene, and Infinity Scope—have further propelled the adoption of IO60 by integrating it into their core service offerings, making advanced spatial proteomics accessible to all researchers.</li></ul><p class=\"\">Ultrahigh-Plex Neurobiology Panels: A Major Step Forward</p><p class=\"\">Expanding on the success of IO60, the company is set to release PhenoCode Human and Mouse FFPE Neurobiology panels at the end of Q1 and Q2 2025 respectively. These panels will address the critical need for comprehensive spatial insights in neuroscience research, enabling advancements in understanding neurodegenerative diseases, disease modeling, and therapeutic development.</p><p class=\"\">Key Features of the New Human and Mouse Neurobiology Panels:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Human Neurobiology Panel: </strong>This high-plex spatial proteomics panel features an extensive set of biomarkers to study neurodegenerative diseases, neuroinflammation, vascular integrity, and key therapeutic targets, making it a vital tool for advancing neuroscience research.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Mouse Neurobiology Panel: </strong>Specifically optimized for preclinical studies, this panel offers unparalleled biomarker depth to support disease modeling, neurodevelopmental research, and translational applications, bridging the gap between discovery and clinical insights.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Seamless Integration with PhenoCycler®-Fusion: </strong>Fully automated and optimized for the PhenoCycler-Fusion platform, the fastest spatial proteomics discovery tool, enabling unprecedented speed and resolution in insight generation.</li></ul><p class=\"\">“The rapid expansion of our PhenoCycler-Fusion content menu is a by-product of the efficiency and robustness of our fully operational Manufacturing Center of Excellence,” said Brian McKelligon, CEO of Akoya Biosciences. “Our new ready-to-use high-plex panels in oncology and neurobiology enable us to capture a continuously expanding market segment and drive discoveries and breakthroughs from discovery to translational research.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements that are based on management’s beliefs and assumptions and on information currently available to management. All statements contained in this release other than statements of historical fact are forward-looking statements, including statements concerning our expectations about the potential and capabilities of our products, our ability to achieve market acceptance, and drive adoption of, our products, our ability to expand relevant market segments, our projections regarding timing of our future product launches, and other statements regarding our business operations and future performance. </p><p class=\"\">In some cases, you can identify forward-looking statements by the words “may,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “anticipate,” “believe,” “estimate,” “predict,” “project,” “potential,” “continue,” “ongoing” or the negative of these terms or other comparable terminology, although not all forward-looking statements contain these words. These statements involve risks, uncertainties and other factors that may cause actual results, levels of activity, performance, or achievements to be materially different from the information expressed or implied by these forward-looking statements. These risks, uncertainties and other factors are described under \"Risk Factors,\" \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and elsewhere in the documents we file with the Securities and Exchange Commission from time to time. We caution you that forward-looking statements are based on a combination of facts and factors currently known by us and our projections of the future, about which we cannot be certain. As a result, the forward-looking statements may not prove to be accurate. The forward-looking statements in this press release represent our views as of the date hereof. We undertake no obligation to update any forward-looking statements for any reason, except as required by law. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Akoya Biosciences</strong></p><p class=\"\">As The Spatial Biology Company®, Akoya Biosciences’ mission is to bring context to the world of biology and human health through the power of spatial phenotyping. The Company offers comprehensive single-cell imaging solutions that allow researchers to phenotype cells with spatial context and visualize how they organize and interact to influence disease progression and response to therapy. Akoya offers a full continuum of spatial phenotyping solutions to serve the diverse needs of researchers across discovery, translational and clinical research: PhenoCode™ Panels and PhenoCycler®, PhenoImager® Fusion and PhenoImager HT Instruments. To learn more about Akoya, visit www.akoyabio.com.</p><p class=\"\">Investor Contact:</p><p class=\"\">Priyam Shah</p><p class=\"\">investors@akoyabio.com</p><p class=\"\">Media Contact:</p><p class=\"\">Christine Quern</p><p class=\"\">media@akoyabio.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX8Phyh7:0-akoya-biosciences-unveils-strategic-product-roadmap-powered-by-the-new-io60-and-upcoming-neurobiology-panels/",
            "pub_date": "2025-02-05 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX40cX4t:0",
            "title": "Xsolis Ranked No. 1 Best in KLAS for Physician Advisory Services for Fourth Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FRANKLIN, Tenn., Feb.  05, 2025  (GLOBE NEWSWIRE) — Xsolis, an AI-driven technology company that reduces administrative waste by enabling collaboration between healthcare providers and payers, announced today a No. 1 ranking for Physician Advisory (PA) Services in the 2025 Best in KLAS awards.  This is the fourth year Xsolis has achieved first place in the category, which recognizes services that help organizations with their physician and utilization review. </p><p class=\"\">“The education and knowledge of Xsolis’ PAs are unmatched,” said Cindy Neumany, senior vice president of clinical operations for population health at Hackensack Meridian Health, a leading not-for-profit health care organization with 18 hospitals and more than 500 patient care locations in New Jersey. “Xsolis’ AI and its flexible models for clients have been invaluable to meet our unique goals.”</p><p class=\"\">Hackensack Meridian Health has been an Xsolis customer since 2021. In 2024, Xsolis’ PA Services achieved a 71% peer-to-peer success rate for Hackensack Meridian Health.</p><p class=\"\">Xsolis’ PA Services consistently receives positive feedback from clients about its flexibility – offering comprehensive external services or by supplementing hospitals’ internal models with review and peer-to-peer coverage – its high-quality reviews, responsiveness and its consultative, partnership approach. Serving clients since 2016, the Xsolis PA Services team undergoes rigorous training to support these goals. When paired with the company’s technology platform, Dragonfly, Xsolis’ PA Services also stands apart for its data insights capabilities, helping customers identify trends and areas for further improvement.</p><p class=\"\">“Receiving Best in KLAS is one of the most rewarding honors our team can receive because it is based on provider feedback,” said Heather Bassett, M.D., Xsolis chief medical officer and head of physician advisor services. “We are honored that Xsolis’ people, processes, and technology have been recognized for the collective value they bring our clients as we navigate industry challenges together.”</p><p class=\"\">According to the Hospital Financial Management Association, hospitals and health systems struggle with cost containment due to staffing shortages and rising operational costs. A lack of integration between documentation and care delivery can lead to significant rework or denials, with dire financial consequences. Physician advisors play a critical role in creating more resiliency in today’s healthcare ecosystem due to their abilities to bridge the gap between clinical practice and administrative needs for hospitals.</p><p class=\"\">\"Congratulations to the 2025 winners of the Best in KLAS awards! Winning a Best in KLAS award signifies a commitment to delivering outstanding value and innovation to healthcare providers and patients alike,” said Adam Gale, KLAS CEO. “It is my hope that these awards inspire the winners and other companies to reach new heights.”</p><p class=\"\">Xsolis has been leveraging human-in-the-loop AI practices to develop AI solutions that streamline medical necessity decision-making in healthcare for over a decade, improving level of care authorizations, length-of-stay management, and payer-provider alignment. Xsolis’ collaborative AI platform is used in more than 500 hospitals nationwide, with more than two-thirds having shared access with their networked health plans.</p><p class=\"\">To learn more about Xsolis’ Physician Advisor Services, click here. To learn more about Xsolis’ AI solutions, click here.</p><p class=\"\">To explore the full 2025 Best in KLAS Physician Advisory Services category, click here.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Xsolis </strong></p><p class=\"\">Xsolis is an AI-driven technology company that reduces administrative waste by enabling collaboration between healthcare providers and payers. Dragonfly®, its AI-driven proprietary platform, is the first and only solution to use real-time predictive analytics to continuously assign an objective medical necessity score and assess the anticipated level of care for every patient, enabling more efficiency across the healthcare system. Xsolis is headquartered in Franklin, Tennessee. For more information, visit www.xsolis.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About KLAS </strong></p><p class=\"\">KLAS helps healthcare providers make informed technology decisions by offering accurate, honest, and impartial vendor performance information. KLAS monitors vendor performance through interviewing thousands of healthcare providers representing healthcare organizations throughout the US and here and there across the globe. KLAS uses a simple methodology to ensure all data and ratings are accurate, honest and impartial to help create market moving moments. Learn more at klasresearch.com.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/186e7992-0295-4262-a390-11e79c0870f6</p><p class=\"\">Media Contact for Xsolis</p><p class=\"\">Stacy Callahan, Astonish Media Group for Xsolis</p><p class=\"\">stacy@astonishmediagroup.com</p><p class=\"\">917-972-1101</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025 Best in KLAS Physician Advisory Services logo</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Xsolis awarded No. 1 spot for 2025 Best in KLAS Physician Advisory Services</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX40cX4t:0-xsolis-ranked-no-1-best-in-klas-for-physician-advisory-services-for-fourth-year/",
            "pub_date": "2025-02-05 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX29HNTv:0",
            "title": "TransUnion Introduces TruVision Alternative Bank Risk Score to Help Lenders Better Assess Consumers with Limited Credit Histories",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CHICAGO, Feb.  05, 2025  (GLOBE NEWSWIRE) — Despite a strong employment picture, some consumers are still struggling financially due to elevated inflation and higher than normal interest rates. The lowest income households (those earning less than $50,000) face another challenge, with only 35% indicating they have sufficient access to credit and lending products.i In an effort to provide lenders with a clearer picture of thin- or no- file consumers, including those who may not be gaining sufficient access to credit, TransUnion  introduced today the TruVision Alternative Bank Risk Score.</p><p class=\"\">This score includes checking and banking data applicable to the short-term lending space and can be used to enhance lenders’ existing underwriting scores. It offers a more holistic view of a consumer’s financial behavior and enhances the accuracy of credit risk decisions. The TruVision Alternative Bank Risk Score is enabled by TransUnion’s OneTru™ solution enablement platform, which now houses the company’s short-term lending data.</p><p class=\"\">This solution evaluates a consumer’s banking activities to assist in predicting their future financial behavior, particularly their likelihood of defaulting on loans or other credit obligations. The score complements the existing suite of tools that TransUnion already provides to lenders to help them in determining credit risk. It can be used with existing risk scores or as a standalone tool for underwriting.</p><p class=\"\">“The addition of the TruVision Alternative Bank Risk Score to TransUnion’s existing Alternative Lending suite of credit risk scores offers lenders a deeper look at potential borrowers who may otherwise have no, or very limited, credit history, as well as subprime borrowers,” said Liz Pagel, senior vice president of consumer lending at TransUnion. “It can aid in improving the predictive power of risk models, helping to identify potential risks that might be missed when relying on a single data source.”</p><p class=\"\">In addition to helping lenders make more informed decisions, this score can potentially offer some consumers with limited credit histories an alternate pathway to credit, by providing a more comprehensive view of their financial behavior, identifying those creditworthy consumers who may lack a traditional credit history but demonstrate responsible banking behavior.</p><p class=\"\">A recent report from the Federal Deposit Insurance Corporation (FDIC) revealed that one in six households had no mainstream credit, and this percentage was significantly higher among lower-income households, those with a lower educational ceiling, and minority households. The report also indicated that those households without mainstream credit likely did not have a credit score with credit bureaus, making it that much harder to obtain credit moving forward.</p><p class=\"\">TransUnion’s Q4 2024 Consumer Pulse found that lower-income consumer households have a much more difficult time accessing credit.</p><p class=\"\">Lower Income Households Do Not Feel They Have Sufficient Access to Credit and Lending Products. </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> </td><td colspan=\"2\">Low (&lt;$50K)</td><td colspan=\"2\">Medium ($50-99K)</td><td colspan=\"2\">High ($100k+)</td></tr><tr><td>Have Sufficient Access</td><td colspan=\"2\">35%</td><td colspan=\"2\">64%</td><td colspan=\"2\">80%</td></tr><tr><td>Neither Agree nor Disagree </td><td colspan=\"2\">31%</td><td colspan=\"2\">21%</td><td colspan=\"2\">11%</td></tr><tr><td>Do Not Have Sufficient Access</td><td colspan=\"2\">34%</td><td colspan=\"2\">15%</td><td colspan=\"2\">8%</td></tr></tbody></table></div><p class=\"\">Source: TransUnion Consumer Pulse, November 2024</p><p class=\"\">“TransUnion has long provided lenders with access to a wide range of tools, resources, and data with which informed lending decisions can be made,” said Jason Laky, executive vice president and head of financial services at TransUnion. “In this increasingly complex economic environment, many consumers, lower income or otherwise, are seeking credit with limited or non-existent traditional credit histories. The use of a broad suite of alternative credit data tools offers lenders a new and important tool in assessing risk among these consumers.”</p><p class=\"\">To learn more about how TransUnion gives lenders a Tru picture of consumers - helping them better assess creditworthiness and expand access to credit, click here.</p><p class=\"\">For consumers looking to learn more about how to build their credit, click here.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About TransUnion  </strong></p><p class=\"\">TransUnion is a global information and insights company with over 13,000 associates operating in more than 30 countries. We make trust possible by ensuring each person is reliably represented in the marketplace. We do this with a Tru™ picture of each person: an actionable view of consumers, stewarded with care. Through our acquisitions and technology investments we have developed innovative solutions that extend beyond our strong foundation in core credit into areas such as marketing, fraud, risk and advanced analytics. As a result, consumers and businesses can transact with confidence and achieve great things. We call this Information for Good® — and it leads to economic opportunity, great experiences and personal empowerment for millions of people around the world.</p><p class=\"\">http://www.transunion.com/business</p><p class=\"\">i Q4 2024 TransUnion Consumer Pulse study</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Contact</td><td>Dave Blumberg</td></tr><tr><td> </td><td>TransUnion</td></tr><tr><td>E-mail</td><td>david.blumberg@transunion.com</td></tr><tr><td>Telephone</td><td>312-972-6646</td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX29HNTv:0-transunion-introduces-truvision-alternative-bank-risk-score-to-help-lenders-better-assess-consumers-with-limited-credit-histories/",
            "pub_date": "2025-02-05 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX8WYxmC:0",
            "title": "Protara Therapeutics to Present at the Oppenheimer 35th Annual Healthcare Life Sciences Conference",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NEW YORK, Feb.  05, 2025  (GLOBE NEWSWIRE) — Protara Therapeutics, Inc.<strong class=\"root-Tkn6WL2y\"> </strong>, a clinical-stage company developing transformative therapies for the treatment of cancer and rare diseases, today announced that management will participate in a virtual fireside chat at the Oppenheimer 35th Annual Healthcare Life Sciences Conference on Wednesday, February 12, 2025, at 12:40 pm ET.</p><p class=\"\">A live webcast of the fireside chat can be accessed by visiting the Events and Presentations section of the Company’s website: https://ir.protaratx.com. The webcast will be archived for a limited time following the presentation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Protara Therapeutics, Inc.</strong></p><p class=\"\">Protara is a clinical-stage biotechnology company committed to advancing transformative therapies for people with cancer and rare diseases. Protara’s portfolio includes its lead candidate, TARA-002, an investigational cell-based therapy in development for the treatment of non-muscle invasive bladder cancer (NMIBC) and lymphatic malformations (LMs). The Company is evaluating TARA-002 in an ongoing Phase 2 trial in NMIBC patients with carcinoma in situ (CIS) who are unresponsive or naïve to treatment with Bacillus Calmette-Guérin (BCG), as well as a Phase 2 trial in pediatric patients with LMs. Additionally, Protara is developing IV Choline Chloride, an investigational phospholipid substrate replacement for patients on parenteral nutrition who are otherwise unable to meet their choline needs via oral or enteral routes. For more information, visit www.protaratx.com.</p><p class=\"\">Company Contact:</p><p class=\"\">Justine O'Malley</p><p class=\"\">Protara Therapeutics</p><p class=\"\">Justine.OMalley@protaratx.com</p><p class=\"\">646-817-2836</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX8WYxmC:0-protara-therapeutics-to-present-at-the-oppenheimer-35th-annual-healthcare-life-sciences-conference/",
            "pub_date": "2025-02-05 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX66kbYB:0",
            "title": "PDS Biotech Reaffirms Guidance for First Quarter Initiation of VERSATILE-003 Phase 3 Clinical Trial in HPV16-Positive Recurrent/Metastatic Head and Neck Squamous Cell Carcinoma",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PRINCETON, N.J., Feb.  05, 2025  (GLOBE NEWSWIRE) — PDS Biotechnology Corporation  (“PDS Biotech” or the “Company”), a late-stage immunotherapy company focused on transforming how the immune system targets and kills cancers, today reaffirmed the Company’s guidance of initiating its VERSATILE-003 Phase 3 clinical trial of Versamune® HPV plus pembrolizumab for first-line treatment of recurrent and/or metastatic (R/M) HPV16-positive head and neck squamous cell cancer (HNSCC) in the first quarter of this year.</p><p class=\"\">PDS Biotech submitted its updated clinical protocol on November 15, 2024, amending the Investigational New Drug (IND) application. The window for comments from the U.S. Food and Drug Administration (FDA) has passed, and the Company is on track to initiate site activation in the first quarter of 2025. The Company has received Fast Track designation from the FDA for the combination of Versamune® HPV and pembrolizumab in R/M HNSCC. (See VERSATILE-002 Phase 2 clinical results here.)</p><p class=\"\">“The integral elements for trial initiation are ready, including alignment with the FDA,” said Frank Bedu-Addo, PhD, President and Chief Executive Officer of PDS Biotech. “We look forward to initiating VERSATILE-003 this quarter and advancing the combination of Versamune® HPV plus pembrolizumab to potentially provide improved outcomes for patients with HPV16-positive R/M HNSCC.”</p><p class=\"\">HPV16-positive patients represent a large, fast-growing subgroup in need of targeted therapies to treat the underlying cause of the cancer. A recently validated companion diagnostic to confirm HPV16-positive HNSCC will be utilized during the patient screening process of the VERSATILE-003 trial.</p><p class=\"\">“HPV16-positive HNSCC is poised to become the dominant type of HNSCC in the US and EU,” said Kirk Shepard, M.D., PDS Biotech’s Chief Medical Officer. “Confirming HPV16 status with a potentially commercializable test is essential to effectively identifying the patients suitable to receive Versamune HPV. This will be the first investigational use of this type of companion diagnostic in a Phase 3 clinical trial in HNSCC.”</p><p class=\"\">For more information on VERSATILE-003, visit ClinicalTrials.gov (Identifier: NCT06790966).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About PDS Biotechnology</strong>PDS Biotechnology is a late-stage immunotherapy company focused on transforming how the immune system targets and kills cancers. The Company plans to initiate a pivotal clinical trial to advance its lead program in advanced HPV16-positive head and neck squamous cell cancers. PDS Biotech’s lead investigational T-cell stimulating immunotherapy Versamune® HPV is being developed in combination with a standard-of-care immune checkpoint inhibitor, and also in a triple combination including PDS01ADC, an IL-12 fused antibody drug conjugate (ADC), and a standard-of-care immune checkpoint inhibitor.</p><p class=\"\">For more information, please visit www.pdsbiotech.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward Looking Statements</strong></p><p class=\"\">This communication contains forward-looking statements (including within the meaning of Section 21E of the United States Securities Exchange Act of 1934, as amended, and Section 27A of the United States Securities Act of 1933, as amended) concerning PDS Biotechnology Corporation (the “Company”) and other matters. These statements may discuss goals, intentions and expectations as to future plans, trends, events, results of operations or financial condition, or otherwise, based on current beliefs of the Company’s management, as well as assumptions made by, and information currently available to, management. Forward-looking statements generally include statements that are predictive in nature and depend upon or refer to future events or conditions, and include words such as “may,” “will,” “should,” “would,” “expect,” “anticipate,” “plan,” “likely,” “believe,” “estimate,” “project,” “intend,” “forecast,” “guidance”, “outlook” and other similar expressions among others. Forward-looking statements are based on current beliefs and assumptions that are subject to risks and uncertainties and are not guarantees of future performance. Actual results could differ materially from those contained in any forward-looking statement as a result of various factors, including, without limitation: the Company’s ability to protect its intellectual property rights; the Company’s anticipated capital requirements, including the Company’s anticipated cash runway and the Company’s current expectations regarding its plans for future equity financings; the Company’s dependence on additional financing to fund its operations and complete the development and commercialization of its product candidates, and the risks that raising such additional capital may restrict the Company’s operations or require the Company to relinquish rights to the Company’s technologies or product candidates; the Company’s limited operating history in the Company’s current line of business, which makes it difficult to evaluate the Company’s prospects, the Company’s business plan or the likelihood of the Company’s successful implementation of such business plan; the timing for the Company or its partners to initiate the planned clinical trials for Versamune® HPV, PDS01ADC and other Versamune® based product candidates; the future success of such trials; the successful implementation of the Company’s research and development programs and collaborations, including any collaboration studies concerning Versamune® HPV, PDS01ADC and other Versamune® based product candidates and the Company’s interpretation of the results and findings of such programs and collaborations and whether such results are sufficient to support the future success of the Company’s product candidates; the success, timing and cost of the Company’s ongoing clinical trials and anticipated clinical trials for the Company’s current product candidates, including statements regarding the timing of initiation, pace of enrollment and completion of the trials (including the Company’s ability to fully fund its disclosed clinical trials, which assumes no material changes to the Company’s currently projected expenses), futility analyses, presentations at conferences and data reported in an abstract, and receipt of interim or preliminary results (including, without limitation, any preclinical results or data), which are not necessarily indicative of the final results of the Company’s ongoing clinical trials; any Company statements about its understanding of product candidates mechanisms of action and interpretation of preclinical and early clinical results from its clinical development programs and any collaboration studies; the Company’s ability to continue as a going concern; and other factors, including legislative, regulatory, political and economic developments not within the Company’s control. The foregoing review of important factors that could cause actual events to differ from expectations should not be construed as exhaustive and should be read in conjunction with statements that are included herein and elsewhere, including the other risks, uncertainties, and other factors described under “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and elsewhere in the documents we file with the U.S. Securities and Exchange Commission. The forward-looking statements are made only as of the date of this press release and, except as required by applicable law, the Company undertakes no obligation to revise or update any forward-looking statement, or to make any other forward-looking statements, whether as a result of new information, future events or otherwise.  </p><p class=\"\">Versamune® is a registered trademark of PDS Biotechnology Corporation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contact:</strong></p><p class=\"\">Mike Moyer</p><p class=\"\">LifeSci Advisors</p><p class=\"\">Phone +1 (617) 308-4306 </p><p class=\"\">Email: mmoyer@lifesciadvisors.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact:</strong></p><p class=\"\">Janine McCargo</p><p class=\"\">6 Degrees</p><p class=\"\">Phone +1 (646) 528-4034</p><p class=\"\">Email: jmccargo@6degreespr.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX66kbYB:0-pds-biotech-reaffirms-guidance-for-first-quarter-initiation-of-versatile-003-phase-3-clinical-trial-in-hpv16-positive-recurrent-metastatic-head-and-neck-squamous-cell-carcinoma/",
            "pub_date": "2025-02-05 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX7zNVQr:0",
            "title": "Eric Herzog Named a CRN Channel Chief for the Third Time",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WALTHAM, Mass., Feb.  05, 2025  (GLOBE NEWSWIRE) — Infinidat, a leading provider of enterprise storage solutions, today announced that CRN®, a brand of The Channel Company, has named Eric Herzog, CMO at Infinidat, to the prestigious 2025 CRN® Channel Chiefs list, which recognizes the IT vendor and distribution executives who are driving strategy and setting the channel agenda for their companies. This special distinction is the third time that Herzog has been recognized as a CRN Channel Chief during his extensive career as a senior executive for enterprise storage solutions through the channel.</p><p class=\"\">“I’m honored to be named a CRN Channel Chief again and to have the opportunity to work closely with Infinidat’s partners to make a significant impact through the channel,” said Eric Herzog, CMO at Infinidat. “I love the strong commitment, relentless effort, and competitiveness of our channel partners. Being recognized on the prestigious CRN Channel Chiefs list for the third time reflects positively on our power collaboration to drive large-scale deployments of next-generation enterprise storage. It’s important to keep the proverbial ‘finger on the pulse’ of the channel, and I am happy to report that there are many, many new opportunities for partners to grow their businesses with Infinidat in 2025.”</p><p class=\"\">Herzog has four decades of experience and proven success in the enterprise storage industry, managing all aspects of marketing, product management, sales, worldwide channels, and business development in both start-ups and Global Fortune 500 companies. Herzog was also named a CRN 2022 Channel Chief and a CRN 2015 Channel Chief. Prior to joining Infinidat in October 2021, he was CMO and VP of Global Storage Channels for IBM’s Storage Division. He was the executive sponsor for IBM Storage at Sirius Computer Solutions/CDW and Mainline Information Systems, as well as the executive sponsor for IBM Storage and EMC at Arrow.</p><p class=\"\">The channel is instrumental to Infinidat’s go-to-market strategy. Infinidat has invested heavily in building up its channel partner program to a 5-star rating (as recognized by CRN), increasing partner revenue, margins, co-op/marketing development funding (MDF), and joint events. Infinidat is dedicated to help channel partners grow their business, receive the best training available, and have easy access to experienced partner account managers.</p><p class=\"\">The Channel Chiefs list, released annually by CRN, showcases the top leaders throughout the IT channel ecosystem who work tirelessly to ensure mutual success with their partners and customers. As a Channel Chief, Herzog continues to be one of the top people in the storage industry, driving profitability-building channel agendas.</p><p class=\"\">“This year’s honorees exemplify dedication, innovation, and leadership that supports solution provider success and fosters growth across the channel,” said Jennifer Follett, VP, U.S. Content, and Executive Editor, CRN, at The Channel Company. “Each of these exceptional leaders has made a lasting channel impact by championing partnerships and designing creative strategies that get results. They’ve set a high bar in the channel, and we’re thrilled to recognize their standout achievements.”</p><p class=\"\">CRN’s 2025 Channel Chiefs list will be featured in the February 2025 print issue of CRN® Magazine and online at www.CRN.com/ChannelChiefs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About The Channel Company</strong></p><p class=\"\">The Channel Company (TCC) is the global leader in channel growth for the world’s top technology brands. We accelerate success across strategic channels for tech vendors, solution providers, and end users with premier media brands, integrated marketing and event services, strategic consulting, and exclusive market and audience insights. TCC is a portfolio company of investment funds managed by EagleTree Capital, a New York City-based private equity firm. For more information, visit thechannelco.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Infinidat</strong></p><p class=\"\">Infinidat provides enterprises and service providers with a platform-native primary and secondary storage architecture that delivers comprehensive data services based on InfiniVerse®. This unique platform delivers outstanding IT operating benefits, support for modern workloads across on-premises and hybrid multi-cloud environments. Infinidat's cyber resilient-by-design infrastructure, consumption-based performance, 100% availability, and cyber security guaranteed SLAs align with enterprise IT and business priorities. Infinidat’s award-winning platform-native data services and acclaimed white glove service are continuously recommended by customers, as recognized by Gartner® Peer Insights reviews. For more information, visit www.infinidat.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Connect with Infinidat</strong></p><p class=\"\">About Infinidat</p><p class=\"\">Read our blog</p><p class=\"\">Follow us on X</p><p class=\"\">Join us on LinkedIn</p><p class=\"\">Visit us on Facebook</p><p class=\"\">See us on YouTube</p><p class=\"\">Be our partner</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Infinidat</strong></p><p class=\"\">Sapna Capoor</p><p class=\"\">Director of Global Communications</p><p class=\"\">scapoor@infinidat.com | Mobile: +44 (0) 7789684159</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX7zNVQr:0-eric-herzog-named-a-crn-channel-chief-for-the-third-time/",
            "pub_date": "2025-02-05 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX3QzT1:0",
            "title": "AXIL Brands to Debut its MX Series of Over-the-Ear Hearing Protection Products at NASCAR Daytona 500",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LOS ANGELES, Feb.  05, 2025  (GLOBE NEWSWIRE) — AXIL Brands, Inc. (“AXIL” or the “Company”)(NYSE American: AXIL), a leader in innovative hearing protection, hearing enhancement, and Bluetooth®/wireless technology, will showcase its recently unveiled MX Series hearing protection lineup at the NASCAR Daytona 500 trackside event being held from Thursday, February 13, to Sunday, February 16, 2025 at the Daytona International Speedway. AXIL will also feature all of its latest innovations at this prestigious showcase event, including the new \"X Series\" Earplugs.</p><p class=\"\">AXIL’s presence at the Daytona 500 underscores its dedication to the NASCAR community, ensuring that fans, pit crews, and industry professionals have access to cutting-edge hearing protection and enhancement technology with exciting new customizable features. The NASCAR environment offers an unparalleled platform for AXIL, fostering direct consumer engagement while also creating strategic opportunities for retail, B2B, and strategic partnerships.</p><p class=\"\">“The value NASCAR places on its fan base aligns perfectly with our mission to enhance the race experience through innovative hearing solutions,” said Jeff Toghraie, AXIL’s CEO and Chairman. “We see 2025 as a pivotal year for the growth of the AXIL brand, and we look forward to helping NASCAR fans further immerse themselves into the thrilling world of racing through our unique technologies and hearing solutions.”</p><p class=\"\">AXIL is proud to be at the forefront of hearing protection and enhancement, delivering industry-leading solutions that empower NASCAR fans and professionals alike. Join the Company trackside at the 2025 Daytona 500 to experience the next generation of AXIL technology and products.</p><p class=\"\">For more information about AXIL and to explore its full range of hearing enhancement, hearing protection, communication, and wireless audio solutions, visit www.goaxil.com or connect with the Company on social media at https://www.facebook.com/goaxil and https://www.instagram.com/axilofficial/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About NASCAR</strong></p><p class=\"\">The National Association for Stock Car Auto Racing (NASCAR) is the sanctioning body for the No. 1 form of motorsports in the United States and owner of 14 of the nation’s major motorsports entertainment facilities. NASCAR sanctions races in three national series (NASCAR Cup Series™, NASCAR Xfinity Series™, and NASCAR CRAFTSMAN Truck Series™), four international series (NASCAR Brasil Series, NASCAR Canada Series, NASCAR Mexico Series, NASCAR Whelen Euro Series), four regional series (ARCA Menards Series, ARCA Menards Series East &amp; West and the NASCAR Whelen Modified Tour) and a local grassroots series (NASCAR Advance Auto Parts Weekly Series). The International Motor Sports Association™ (IMSA®) governs the IMSA WeatherTech SportsCar Championship™, the premier U.S. sports car series. NASCAR also owns Motor Racing Network, Racing Electronics, and ONE DAYTONA. Based in Daytona Beach, Florida, with offices in five cities across North America, NASCAR sanctions more than 1,200 races annually in 11 countries and more than 30 U.S. states.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About AXIL Brands</strong>AXIL Brands (NYSE American: AXIL) is an emerging global consumer products company. The Company is a manufacturer and marketer of premium hearing enhancement and protection products, including ear plugs, earmuffs, and ear buds, under the AXIL® brand and premium hair and skincare products under its in-house Reviv3® brand - selling products in the United States, Canada, the European Union, and throughout Asia.</p><p class=\"\">To learn more, please visit the Company's AXIL® website at www.axilbrands.com and its Reviv3® website at www.reviv3.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains a number of forward-looking statements within the meaning of the federal securities laws. The use of words such as “anticipate,” “believe,” “expect,” “continue,” “will,” “prepare,” “should,” and “focus,” among others, generally identify forward-looking statements. These forward-looking statements are based on currently available information, and management’s beliefs, projections, and current expectations, and are subject to a number of significant risks and uncertainties, many of which are beyond management’s control and may cause the Company’s results, performance or achievements to differ materially from any future results, performance or achievements expressed or implied by these forward-looking statements. Factors that could cause actual results to differ materially from those in the forward-looking statements include, among other things: (i) the Company’s ability to grow its net sales and operations, including developing new products and expanding internationally, and perform in accordance with any guidance; (ii) our ability to generate sufficient revenue to support the Company’s operations and to raise additional funds or obtain other forms of financing as needed on acceptable terms, or at all; (iii) potential difficulties or delays the Company may experience in implementing its cost savings and efficiency initiatives; (iv) the Company’s ability to compete effectively with other hair and skincare companies and hearing enhancement and protection companies; (v) the concentration of the Company’s customers, potentially increasing the negative impact to the Company by changing purchasing or selling patterns; (vi) changes in laws or regulations in the United States and/or in other major markets, such as China, in which the Company operates, including, without limitation, with respect to taxes, tariffs, trade policies or product safety, which may increase the Company product costs and other costs of doing business, and reduce the Company’s earnings; (vii) the Company’s ability to engage in strategic partnerships and expand its distribution and retail channels; and (viii) the impact of unstable market and general economic conditions on the Company’s business, financial condition and stock price, including inflationary cost pressures, the possibility of an economic recession and other macroeconomic factors, geopolitical events, and uncertainty, decreased discretionary consumer spending, supply chain disruptions and constraints, labor shortages, ongoing economic disruption, including the effects of the Ukraine-Russia conflict and the Israel-Hamas conflict, and other downturns in the business cycle or the economy. There can be no assurance as to any of these matters, and potential investors are urged to consider these factors carefully in evaluating the forward-looking statements. Other important factors that may cause actual results to differ materially from those expressed in the forward-looking statements are discussed in the Company’s filings with the U.S. Securities and Exchange Commission. These forward-looking statements speak only as of the date hereof. Except as required by law, the Company does not assume any obligation to update or revise these forward-looking statements for any reason, even if new information becomes available in the future.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations:</strong></p><p class=\"\">CORE IR </p><p class=\"\">(516) 222-2560</p><p class=\"\">investors@goaxil.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX3QzT1:0-axil-brands-to-debut-its-mx-series-of-over-the-ear-hearing-protection-products-at-nascar-daytona-500/",
            "pub_date": "2025-02-05 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX3KWv1w:0",
            "title": "ITW Reports Fourth Quarter and Full Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fourth Quarter 2024 Highlights</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $3.9 billion, a decrease of 1.3% as organic growth declined 0.5%; Organic growth of 0.4% turned positive excluding Product Line Simplification (PLS) reduction of 0.9%</li><li class=\"listItem-bmN0_SHH\">Record operating margin of 26.2%, an increase of 140 bps as enterprise initiatives contributed 120 bps</li><li class=\"listItem-bmN0_SHH\">Operating cash flow of $1.1B; record free cash flow of $1B, an increase of 10% with a conversion of 133%</li><li class=\"listItem-bmN0_SHH\">GAAP EPS of $2.54, an increase of 7%</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">2024 Highlights</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $15.9 billion, a decrease of 1.3% as organic growth declined 0.7% in markets that were down low to mid-single digits</li><li class=\"listItem-bmN0_SHH\">Record operating margin of 26.8% as enterprise initiatives contributed 130 bps</li><li class=\"listItem-bmN0_SHH\">Record GAAP EPS of $11.71, an increase of 20%</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025 Guidance</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Above-market organic growth of 0 to 2% based on current levels of demand; Organic growth of 1 to 3% excluding PLS reduction of approximately 1%-point</li><li class=\"listItem-bmN0_SHH\">Enterprise initiatives contributing approximately 100 bps to margin improvement</li><li class=\"listItem-bmN0_SHH\">GAAP EPS of $10.15 to $10.55 including foreign currency translation headwind of $0.30</li></ul><p class=\"\">GLENVIEW, Ill., Feb.  05, 2025  (GLOBE NEWSWIRE) — Illinois Tool Works Inc.  today reported its fourth quarter and full year 2024 results and initiated guidance for full year 2025.</p><p class=\"\">“ITW delivered a solid finish to the year as we outperformed underlying end markets, expanded operating margin by 140 basis points, generated record free cash flow, and delivered seven percent earnings per share growth in the fourth quarter,” said Christopher A. O’Herlihy, President and Chief Executive Officer.</p><p class=\"\">“Throughout 2024, the ITW team delivered a year of solid operational and financial performance, achieving record financial results by consistently exceeding market growth and significantly improving profitability and margins. Building on this momentum, we will continue to outperform our key end markets in 2025 as we build above-market organic growth, driven by continuous improvement in Customer-Back Innovation, into a core ITW strength. I extend my sincere gratitude to our global colleagues for their unwavering dedication to serving our customers and executing our strategy with excellence,” O’Herlihy concluded.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fourth Quarter 2024 Results</strong></p><p class=\"\">Fourth quarter revenue of $3.9 billion decreased by 1.3 percent as organic revenue declined 0.5 percent. Organic revenue growth was positive 0.4 percent adjusted for PLS reduction of 0.9 percent. Foreign currency translation reduced revenue by one percent and acquisitions added 0.2 percent.</p><p class=\"\">GAAP EPS of $2.54 increased seven percent. Operating margin of 26.2 percent increased 140 basis points as enterprise initiatives contributed 120 basis points. Operating cash flow was $1.1 billion, and free cash flow grew 10 percent to $1.0 billion, with a conversion of 133 percent to net income. During the quarter, the company repurchased $375 million of its own shares and the effective tax rate was 23.7 percent.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Full Year 2024 Results</strong></p><p class=\"\">Full year revenue of $15.9 billion declined 1.3 percent as organic revenue declined 0.7 percent. Organic revenue growth was essentially flat adjusted for PLS reduction of 0.6 percent. Foreign currency translation reduced revenue by 0.7 percent and acquisitions contributed 0.1 percent to revenues.</p><p class=\"\">GAAP EPS of $11.71 included two previously disclosed favorable one-time items; $0.30 from a LIFO inventory accounting change in the first quarter, and $1.26 from the sale of the Company’s equity interest in Wilsonart in the third quarter. Excluding these items, EPS was $10.15.</p><p class=\"\">Operating income of $4.3 billion grew six percent, and operating margin increased 170 basis points to 26.8 percent with enterprise initiatives contributing 130 basis points. Excluding 70 basis points of favorable impact from the above-mentioned LIFO inventory accounting change, operating margin increased 100 basis points to 26.1 percent. Six of seven segments expanded margins in 2024 with two segments achieving margins above 30 percent.</p><p class=\"\">Operating cash flow was $3.3 billion and free cash flow was $2.8 billion, with a conversion of 94 percent to adjusted net income. The company invested approximately $0.8 billion to support the long-term profitable growth of its businesses and returned $3.2 billion to shareholders through dividends and share repurchases. The effective tax rate was 21.1 percent.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025 Guidance</strong></p><p class=\"\">The company is initiating 2025 guidance including GAAP EPS in the range of $10.15 to $10.55 per share which includes a foreign currency translation headwind of $0.30. The company projects above-market organic growth of zero to two percent based on current levels of demand, including an expected PLS reduction of approximately one percentage point. Organic revenue growth is projected to be one to three percent adjusted for the above-mentioned PLS. Based on current foreign exchange rates, foreign currency translation is expected to reduce revenue by three percent, resulting in a projected total revenue decline of one to three percent.</p><p class=\"\">Operating margin is projected to be in the range of 26.5 to 27.5 percent, an improvement of approximately 100 basis points excluding the above-mentioned 2024 LIFO inventory accounting change, with enterprise initiatives contributing approximately 100 basis points.</p><p class=\"\">Free cash flow is projected to be greater than 100 percent of net income, and the company plans to repurchase approximately $1.5 billion of its own shares. The projected effective tax rate is 24 to 24.5 percent.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Non-GAAP Measures </strong></p><p class=\"\">This earnings release contains certain non-GAAP financial measures. A reconciliation of these measures to the most directly comparable GAAP measures is included in the attached supplemental reconciliation schedule. The estimated guidance of free cash flow to adjusted net income conversion rate is based on assumptions that are difficult to predict, and estimated guidance for the most directly comparable GAAP measure and a reconciliation of this forward-looking estimate to its most directly comparable GAAP estimate have been omitted due to the unreasonable efforts required in connection with such a reconciliation and the lack of reliable forward-looking cash flow information. For the same reasons, the company is unable to address the potential significance of the unavailable information, which could be material to future results.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-looking Statements</strong></p><p class=\"\">This earnings release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements may include, without limitation, statements regarding global supply chain challenges, expected impact of inflation including raw and specialty material inflation and fluctuating interest rates, the impact of enterprise initiatives, future financial and operating performance, free cash flow and free cash flow to net income conversion rate, organic and total revenue, operating and incremental margin, price/cost impact, statements regarding diluted income per share, restructuring expenses and related benefits, expected dividend payments, after-tax return on invested capital, effective tax rates, exchange rates and the impact of foreign currency translation, expected access to liquidity sources, expected capital allocation, expected timing and amount of share repurchases, end market economic and regulatory conditions, the impact of recent or potential acquisitions and/or divestitures, and the Company’s 2025 guidance. These statements are subject to certain risks, uncertainties, assumptions, and other factors, which could cause actual results to differ materially from those anticipated. Important risks that could cause actual results to differ materially from the Company’s expectations include those that are detailed in ITW’s Form 10-K for 2023 and subsequent reports filed with the SEC.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Illinois Tool Works</strong></p><p class=\"\">ITW  is a Fortune 300 global multi-industrial manufacturing leader with revenue of $15.9 billion in 2024. The company’s seven industry-leading segments leverage the unique ITW Business Model to drive solid growth with best-in-class margins and returns in markets where highly innovative, customer-focused solutions are required. ITW’s approximately 44,000 dedicated colleagues around the world thrive in the company’s decentralized and entrepreneurial culture. www.itw.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations &amp; Media Contact:</strong></p><p class=\"\">Erin Linnihan</p><p class=\"\">Tel: 224.661.7431</p><p class=\"\">investorrelations@itw.com | mediarelations@itw.com</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"16\"> </td></tr><tr><td colspan=\"16\">ILLINOIS TOOL WORKS INC. and SUBSIDIARIESSTATEMENT OF INCOME (UNAUDITED)</td></tr><tr><td colspan=\"16\"> </td></tr><tr><td> </td><td colspan=\"7\">Three Months Ended</td><td> </td><td colspan=\"7\">Twelve Months Ended</td></tr><tr><td> </td><td colspan=\"7\">December 31,</td><td> </td><td colspan=\"7\">December 31,</td></tr><tr><td>In millions except per share amounts</td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td>Operating Revenue</td><td>$</td><td>3,932</td><td> </td><td> </td><td>$</td><td>3,983</td><td> </td><td> </td><td>$</td><td>15,898</td><td> </td><td> </td><td>$</td><td>16,107</td><td> </td></tr><tr><td>Cost of revenue</td><td> </td><td>2,221</td><td> </td><td> </td><td> </td><td>2,312</td><td> </td><td> </td><td> </td><td>8,858</td><td> </td><td> </td><td> </td><td>9,316</td><td> </td></tr><tr><td>Selling, administrative, and research and development expenses</td><td> </td><td>655</td><td> </td><td> </td><td> </td><td>658</td><td> </td><td> </td><td> </td><td>2,675</td><td> </td><td> </td><td> </td><td>2,638</td><td> </td></tr><tr><td>Amortization and impairment of intangible assets</td><td> </td><td>25</td><td> </td><td> </td><td> </td><td>25</td><td> </td><td> </td><td> </td><td>101</td><td> </td><td> </td><td> </td><td>113</td><td> </td></tr><tr><td>Operating Income</td><td> </td><td>1,031</td><td> </td><td> </td><td> </td><td>988</td><td> </td><td> </td><td> </td><td>4,264</td><td> </td><td> </td><td> </td><td>4,040</td><td> </td></tr><tr><td>Interest expense</td><td> </td><td>(68</td><td>)</td><td> </td><td> </td><td>(70</td><td>)</td><td> </td><td> </td><td>(283</td><td>)</td><td> </td><td> </td><td>(266</td><td>)</td></tr><tr><td>Other income (expense)</td><td> </td><td>20</td><td> </td><td> </td><td> </td><td>9</td><td> </td><td> </td><td> </td><td>441</td><td> </td><td> </td><td> </td><td>49</td><td> </td></tr><tr><td>Income Before Taxes</td><td> </td><td>983</td><td> </td><td> </td><td> </td><td>927</td><td> </td><td> </td><td> </td><td>4,422</td><td> </td><td> </td><td> </td><td>3,823</td><td> </td></tr><tr><td>Income taxes</td><td> </td><td>233</td><td> </td><td> </td><td> </td><td>210</td><td> </td><td> </td><td> </td><td>934</td><td> </td><td> </td><td> </td><td>866</td><td> </td></tr><tr><td>Net Income</td><td>$</td><td>750</td><td> </td><td> </td><td>$</td><td>717</td><td> </td><td> </td><td>$</td><td>3,488</td><td> </td><td> </td><td>$</td><td>2,957</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Net Income Per Share:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Basic</td><td>$</td><td>2.55</td><td> </td><td> </td><td>$</td><td>2.39</td><td> </td><td> </td><td>$</td><td>11.75</td><td> </td><td> </td><td>$</td><td>9.77</td><td> </td></tr><tr><td>Diluted</td><td>$</td><td>2.54</td><td> </td><td> </td><td>$</td><td>2.38</td><td> </td><td> </td><td>$</td><td>11.71</td><td> </td><td> </td><td>$</td><td>9.74</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Cash Dividends Per Share:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Paid</td><td>$</td><td>1.50</td><td> </td><td> </td><td>$</td><td>1.40</td><td> </td><td> </td><td>$</td><td>5.70</td><td> </td><td> </td><td>$</td><td>5.33</td><td> </td></tr><tr><td>Declared</td><td>$</td><td>1.50</td><td> </td><td> </td><td>$</td><td>1.40</td><td> </td><td> </td><td>$</td><td>5.80</td><td> </td><td> </td><td>$</td><td>5.42</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Shares of Common Stock Outstanding During the Period:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Average</td><td> </td><td>294.7</td><td> </td><td> </td><td> </td><td>300.1</td><td> </td><td> </td><td> </td><td>296.8</td><td> </td><td> </td><td> </td><td>302.6</td><td> </td></tr><tr><td>Average assuming dilution</td><td> </td><td>295.8</td><td> </td><td> </td><td> </td><td>301.1</td><td> </td><td> </td><td> </td><td>297.8</td><td> </td><td> </td><td> </td><td>303.6</td><td> </td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"8\"> </td></tr><tr><td colspan=\"8\">ILLINOIS TOOL WORKS INC. and SUBSIDIARIESSTATEMENT OF FINANCIAL POSITION (UNAUDITED)</td></tr><tr><td colspan=\"8\"> </td></tr><tr><td>In millions</td><td colspan=\"3\">December 31, 2024</td><td> </td><td colspan=\"3\">December 31, 2023</td></tr><tr><td>Assets</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Current Assets:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Cash and equivalents</td><td>$</td><td>948</td><td> </td><td> </td><td>$</td><td>1,065</td><td> </td></tr><tr><td>Trade receivables</td><td> </td><td>2,991</td><td> </td><td> </td><td> </td><td>3,123</td><td> </td></tr><tr><td>Inventories</td><td> </td><td>1,605</td><td> </td><td> </td><td> </td><td>1,707</td><td> </td></tr><tr><td>Prepaid expenses and other current assets</td><td> </td><td>312</td><td> </td><td> </td><td> </td><td>340</td><td> </td></tr><tr><td>Total current assets</td><td> </td><td>5,856</td><td> </td><td> </td><td> </td><td>6,235</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Net plant and equipment</td><td> </td><td>2,036</td><td> </td><td> </td><td> </td><td>1,976</td><td> </td></tr><tr><td>Goodwill</td><td> </td><td>4,839</td><td> </td><td> </td><td> </td><td>4,909</td><td> </td></tr><tr><td>Intangible assets</td><td> </td><td>592</td><td> </td><td> </td><td> </td><td>657</td><td> </td></tr><tr><td>Deferred income taxes</td><td> </td><td>369</td><td> </td><td> </td><td> </td><td>479</td><td> </td></tr><tr><td>Other assets</td><td> </td><td>1,375</td><td> </td><td> </td><td> </td><td>1,262</td><td> </td></tr><tr><td> </td><td>$</td><td>15,067</td><td> </td><td> </td><td>$</td><td>15,518</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Liabilities and Stockholders' Equity</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Current Liabilities:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Short-term debt</td><td>$</td><td>1,555</td><td> </td><td> </td><td>$</td><td>1,825</td><td> </td></tr><tr><td>Accounts payable</td><td> </td><td>519</td><td> </td><td> </td><td> </td><td>581</td><td> </td></tr><tr><td>Accrued expenses</td><td> </td><td>1,576</td><td> </td><td> </td><td> </td><td>1,663</td><td> </td></tr><tr><td>Cash dividends payable</td><td> </td><td>441</td><td> </td><td> </td><td> </td><td>419</td><td> </td></tr><tr><td>Income taxes payable</td><td> </td><td>217</td><td> </td><td> </td><td> </td><td>187</td><td> </td></tr><tr><td>Total current liabilities</td><td> </td><td>4,308</td><td> </td><td> </td><td> </td><td>4,675</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Noncurrent Liabilities:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Long-term debt</td><td> </td><td>6,308</td><td> </td><td> </td><td> </td><td>6,339</td><td> </td></tr><tr><td>Deferred income taxes</td><td> </td><td>119</td><td> </td><td> </td><td> </td><td>326</td><td> </td></tr><tr><td>Noncurrent income taxes payable</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>151</td><td> </td></tr><tr><td>Other liabilities</td><td> </td><td>1,015</td><td> </td><td> </td><td> </td><td>1,014</td><td> </td></tr><tr><td>Total noncurrent liabilities</td><td> </td><td>7,442</td><td> </td><td> </td><td> </td><td>7,830</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Stockholders' Equity:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Common stock</td><td> </td><td>6</td><td> </td><td> </td><td> </td><td>6</td><td> </td></tr><tr><td>Additional paid-in-capital</td><td> </td><td>1,669</td><td> </td><td> </td><td> </td><td>1,588</td><td> </td></tr><tr><td>Retained earnings</td><td> </td><td>28,893</td><td> </td><td> </td><td> </td><td>27,122</td><td> </td></tr><tr><td>Common stock held in treasury</td><td> </td><td>(25,375</td><td>)</td><td> </td><td> </td><td>(23,870</td><td>)</td></tr><tr><td>Accumulated other comprehensive income (loss)</td><td> </td><td>(1,877</td><td>)</td><td> </td><td> </td><td>(1,834</td><td>)</td></tr><tr><td>Noncontrolling interest</td><td> </td><td>1</td><td> </td><td> </td><td> </td><td>1</td><td> </td></tr><tr><td>Total stockholders' equity</td><td> </td><td>3,317</td><td> </td><td> </td><td> </td><td>3,013</td><td> </td></tr><tr><td> </td><td>$</td><td>15,067</td><td> </td><td> </td><td>$</td><td>15,518</td><td> </td></tr></tbody></table></div><p class=\"\">ILLINOIS TOOL WORKS INC. and SUBSIDIARIESSEGMENT DATA (UNAUDITED)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"9\">Three Months Ended December 31, 2024</td></tr><tr><td>Dollars in millions</td><td colspan=\"3\">Total Revenue</td><td colspan=\"3\">Operating Income</td><td colspan=\"2\">Operating Margin</td></tr><tr><td>Automotive OEM</td><td>$</td><td>785</td><td> </td><td>$</td><td>156</td><td> </td><td>19.8</td><td>%</td></tr><tr><td>Food Equipment</td><td> </td><td>672</td><td> </td><td> </td><td>182</td><td> </td><td>27.2</td><td>%</td></tr><tr><td>Test &amp; Measurement and Electronics</td><td> </td><td>747</td><td> </td><td> </td><td>202</td><td> </td><td>27.0</td><td>%</td></tr><tr><td>Welding</td><td> </td><td>447</td><td> </td><td> </td><td>139</td><td> </td><td>31.2</td><td>%</td></tr><tr><td>Polymers &amp; Fluids</td><td> </td><td>430</td><td> </td><td> </td><td>120</td><td> </td><td>27.9</td><td>%</td></tr><tr><td>Construction Products</td><td> </td><td>438</td><td> </td><td> </td><td>123</td><td> </td><td>28.0</td><td>%</td></tr><tr><td>Specialty Products</td><td> </td><td>416</td><td> </td><td> </td><td>118</td><td> </td><td>28.4</td><td>%</td></tr><tr><td>Intersegment</td><td> </td><td>(3</td><td>)</td><td> </td><td>—</td><td> </td><td>—</td><td>%</td></tr><tr><td>Total Segments</td><td> </td><td>3,932</td><td> </td><td> </td><td>1,040</td><td> </td><td>26.5</td><td>%</td></tr><tr><td>Unallocated</td><td> </td><td>—</td><td> </td><td> </td><td>(9</td><td>)</td><td>—</td><td>%</td></tr><tr><td>Total Company</td><td>$</td><td>3,932</td><td> </td><td>$</td><td>1,031</td><td> </td><td>26.2</td><td>%</td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"8\">Twelve Months Ended December 31, 2024</td></tr><tr><td>Dollars in millions</td><td colspan=\"3\">Total Revenue</td><td colspan=\"2\">Operating Income</td><td colspan=\"2\">Operating Margin</td></tr><tr><td>Automotive OEM</td><td>$</td><td>3,188</td><td> </td><td>$</td><td>625</td><td>19.6</td><td>%</td></tr><tr><td>Food Equipment</td><td> </td><td>2,647</td><td> </td><td> </td><td>719</td><td>27.2</td><td>%</td></tr><tr><td>Test &amp; Measurement and Electronics</td><td> </td><td>2,818</td><td> </td><td> </td><td>703</td><td>24.9</td><td>%</td></tr><tr><td>Welding</td><td> </td><td>1,851</td><td> </td><td> </td><td>597</td><td>32.3</td><td>%</td></tr><tr><td>Polymers &amp; Fluids</td><td> </td><td>1,764</td><td> </td><td> </td><td>484</td><td>27.4</td><td>%</td></tr><tr><td>Construction Products</td><td> </td><td>1,909</td><td> </td><td> </td><td>559</td><td>29.3</td><td>%</td></tr><tr><td>Specialty Products</td><td> </td><td>1,743</td><td> </td><td> </td><td>528</td><td>30.3</td><td>%</td></tr><tr><td>Intersegment</td><td> </td><td>(22</td><td>)</td><td> </td><td>—</td><td>—</td><td>%</td></tr><tr><td>Total Segments</td><td> </td><td>15,898</td><td> </td><td> </td><td>4,215</td><td>26.5</td><td>%</td></tr><tr><td>Unallocated</td><td> </td><td>—</td><td> </td><td> </td><td>49</td><td>—</td><td>%</td></tr><tr><td>Total Company</td><td>$</td><td>15,898</td><td> </td><td>$</td><td>4,264</td><td>26.8</td><td>%</td></tr></tbody></table></div><p class=\"\">ILLINOIS TOOL WORKS INC. and SUBSIDIARIESSEGMENT DATA (UNAUDITED)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"25\">Q4 2024 vs. Q4 2023 Favorable/(Unfavorable)</td></tr><tr><td>Operating Revenue</td><td colspan=\"2\">Automotive OEM</td><td> </td><td colspan=\"2\">Food Equipment</td><td> </td><td colspan=\"2\">Test &amp; Measurement and Electronics</td><td> </td><td colspan=\"2\">Welding</td><td> </td><td colspan=\"2\">Polymers &amp; Fluids</td><td> </td><td colspan=\"2\">Construction Products</td><td> </td><td colspan=\"2\">Specialty Products</td><td> </td><td colspan=\"2\">Total ITW</td><td> </td></tr><tr><td>Organic</td><td colspan=\"1\">(2.3</td><td>)</td><td>%</td><td>3.4</td><td> </td><td>%</td><td>1.7</td><td> </td><td>%</td><td colspan=\"1\">(0.4</td><td>)</td><td>%</td><td>0.8</td><td> </td><td>%</td><td colspan=\"1\">(4.5</td><td>)</td><td>%</td><td colspan=\"1\">(3.6</td><td>)</td><td>%</td><td colspan=\"1\">(0.5</td><td>)</td><td>%</td></tr><tr><td>Acquisitions/Divestitures</td><td>—</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>0.9</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>0.2</td><td> </td><td>%</td></tr><tr><td>Translation</td><td colspan=\"1\">(1.4</td><td>)</td><td>%</td><td colspan=\"1\">(0.7</td><td>)</td><td>%</td><td colspan=\"1\">(0.4</td><td>)</td><td>%</td><td colspan=\"1\">(0.6</td><td>)</td><td>%</td><td colspan=\"1\">(3.2</td><td>)</td><td>%</td><td colspan=\"1\">(0.2</td><td>)</td><td>%</td><td colspan=\"1\">(1.0</td><td>)</td><td>%</td><td colspan=\"1\">(1.0</td><td>)</td><td>%</td></tr><tr><td>Operating Revenue</td><td colspan=\"1\">(3.7</td><td>)</td><td>%</td><td>2.7</td><td> </td><td>%</td><td>2.2</td><td> </td><td>%</td><td colspan=\"1\">(1.0</td><td>)</td><td>%</td><td colspan=\"1\">(2.4</td><td>)</td><td>%</td><td colspan=\"1\">(4.7</td><td>)</td><td>%</td><td colspan=\"1\">(4.6</td><td>)</td><td>%</td><td colspan=\"1\">(1.3</td><td>)</td><td>%</td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"17\">Q4 2024 vs. Q4 2023 Favorable/(Unfavorable)</td></tr><tr><td>Change in Operating Margin</td><td colspan=\"2\">Automotive OEM</td><td colspan=\"2\">Food Equipment</td><td colspan=\"2\">Test &amp; Measurement and Electronics</td><td colspan=\"2\">Welding</td><td colspan=\"2\">Polymers &amp; Fluids</td><td colspan=\"2\">Construction Products</td><td colspan=\"2\">Specialty Products</td><td colspan=\"2\">Total ITW</td></tr><tr><td>Operating Leverage</td><td colspan=\"2\">(50) bps</td><td colspan=\"2\">70 bps</td><td colspan=\"2\">50 bps</td><td colspan=\"2\">(10) bps</td><td colspan=\"2\">20 bps</td><td colspan=\"2\">(100) bps</td><td colspan=\"2\">(70) bps</td><td colspan=\"2\">(10) bps</td></tr><tr><td>Changes in Variable Margin &amp; OH Costs</td><td colspan=\"2\">140 bps</td><td colspan=\"2\">(60) bps</td><td colspan=\"2\">160 bps</td><td colspan=\"2\">150 bps</td><td colspan=\"2\">(60) bps</td><td colspan=\"2\">200 bps</td><td colspan=\"2\">260 bps</td><td colspan=\"2\">130 bps</td></tr><tr><td>Total Organic</td><td colspan=\"2\">90 bps</td><td colspan=\"2\">10 bps</td><td colspan=\"2\">210 bps</td><td colspan=\"2\">140 bps</td><td colspan=\"2\">(40) bps</td><td colspan=\"2\">100 bps</td><td colspan=\"2\">190 bps</td><td colspan=\"2\">120 bps</td></tr><tr><td>Acquisitions/Divestitures</td><td colspan=\"2\">—</td><td colspan=\"2\">—</td><td colspan=\"2\">(50) bps</td><td colspan=\"2\">—</td><td colspan=\"2\">—</td><td colspan=\"2\">—</td><td colspan=\"2\">—</td><td colspan=\"2\">(10) bps</td></tr><tr><td>Restructuring/Other</td><td colspan=\"2\">130 bps</td><td colspan=\"2\">10 bps</td><td colspan=\"2\">10 bps</td><td colspan=\"2\">20 bps</td><td colspan=\"2\">(20) bps</td><td colspan=\"2\">10 bps</td><td colspan=\"2\">(10) bps</td><td colspan=\"2\">30 bps</td></tr><tr><td>Total Operating Margin Change</td><td colspan=\"2\">220 bps</td><td colspan=\"2\">20 bps</td><td colspan=\"2\">170 bps</td><td colspan=\"2\">160 bps</td><td colspan=\"2\">(60) bps</td><td colspan=\"2\">110 bps</td><td colspan=\"2\">180 bps</td><td colspan=\"2\">140 bps</td></tr><tr><td>Total Operating Margin % *</td><td colspan=\"2\">19.8%</td><td colspan=\"2\">27.2%</td><td colspan=\"2\">27.0%</td><td colspan=\"2\">31.2%</td><td colspan=\"2\">27.9%</td><td colspan=\"2\">28.0%</td><td colspan=\"2\">28.4%</td><td colspan=\"2\">26.2%</td></tr><tr><td>* Includes unfavorable operating margin impact of amortization expense from acquisition-related intangible assets</td><td colspan=\"2\"> 30 bps </td><td colspan=\"2\"> 50 bps </td><td colspan=\"2\"> 160 bps </td><td colspan=\"2\"> 10 bps </td><td colspan=\"2\"> 150 bps </td><td colspan=\"2\"> 10 bps </td><td colspan=\"2\"> 20 bps </td><td colspan=\"2\"> 70 bps ** </td></tr><tr><td colspan=\"17\">** Amortization expense from acquisition-related intangible assets had an unfavorable impact of ($0.06) on GAAP earnings per share for the fourth quarter of 2024.</td></tr></tbody></table></div><p class=\"\"></p><p class=\"\">ILLINOIS TOOL WORKS INC. and SUBSIDIARIESSEGMENT DATA (UNAUDITED)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"25\">Full Year 2024 vs Full Year 2023 Favorable/(Unfavorable)</td></tr><tr><td>Operating Revenue</td><td>Automotive OEM</td><td> </td><td> </td><td colspan=\"2\">Food Equipment</td><td> </td><td colspan=\"2\">Test &amp; Measurement and Electronics</td><td> </td><td colspan=\"2\">Welding</td><td> </td><td colspan=\"2\">Polymers &amp; Fluids</td><td> </td><td colspan=\"2\">Construction Products</td><td> </td><td colspan=\"2\">Specialty Products</td><td> </td><td colspan=\"2\">Total ITW</td><td> </td></tr><tr><td>Organic</td><td>(0.4</td><td>)</td><td>%</td><td>1.1</td><td> </td><td>%</td><td>(1.0</td><td>)</td><td>%</td><td>(2.4</td><td>)</td><td>%</td><td>0.9</td><td> </td><td>%</td><td>(6.1</td><td>)</td><td>%</td><td>3.5</td><td> </td><td>%</td><td>(0.7</td><td>)</td><td>%</td></tr><tr><td>Acquisitions/Divestitures</td><td>—</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>0.9</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>—</td><td> </td><td>%</td><td>(0.6</td><td>)</td><td>%</td><td>0.1</td><td> </td><td>%</td></tr><tr><td>Translation</td><td>(1.1</td><td>)</td><td>%</td><td>(0.1</td><td>)</td><td>%</td><td>(0.4</td><td>)</td><td>%</td><td>(0.3</td><td>)</td><td>%</td><td>(3.1</td><td>)</td><td>%</td><td>—</td><td> </td><td>%</td><td>(0.2</td><td>) </td><td>%</td><td>(0.7</td><td>)</td><td>%</td></tr><tr><td>Operating Revenue</td><td>(1.5</td><td>)</td><td>%</td><td>1.0</td><td> </td><td>%</td><td>(0.5</td><td>) </td><td>%</td><td>(2.7</td><td>) </td><td>%</td><td>(2.2</td><td>) </td><td>%</td><td>(6.1</td><td>)</td><td>%</td><td>2.7</td><td> </td><td>%</td><td>(1.3</td><td>) </td><td>%</td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"17\">Full Year 2024 vs Full Year 2023 Favorable/(Unfavorable)</td></tr><tr><td>Change in Operating Margin</td><td colspan=\"2\">Automotive OEM</td><td colspan=\"2\">Food Equipment</td><td colspan=\"2\">Test &amp; Measurement and Electronics</td><td colspan=\"2\">Welding</td><td colspan=\"2\">Polymers &amp; Fluids</td><td colspan=\"2\">Construction Products</td><td colspan=\"2\">Specialty Products</td><td colspan=\"2\">Total ITW</td></tr><tr><td>Operating Leverage</td><td colspan=\"2\">(10) bps</td><td colspan=\"2\">20 bps</td><td colspan=\"2\">(20) bps</td><td colspan=\"2\">(40) bps</td><td colspan=\"2\">20 bps</td><td colspan=\"2\">(110) bps</td><td colspan=\"2\">70 bps</td><td colspan=\"2\">(20) bps</td></tr><tr><td>Changes in Variable Margin &amp; OH Costs</td><td colspan=\"2\">190 bps</td><td colspan=\"2\">(10) bps</td><td colspan=\"2\">150 bps</td><td colspan=\"2\">80 bps</td><td colspan=\"2\">60 bps</td><td colspan=\"2\">220 bps</td><td colspan=\"2\">280 bps</td><td colspan=\"2\">190 bps</td></tr><tr><td>Total Organic</td><td colspan=\"2\">180 bps</td><td colspan=\"2\">10 bps</td><td colspan=\"2\">130 bps</td><td colspan=\"2\">40 bps</td><td colspan=\"2\">80 bps</td><td colspan=\"2\">110 bps</td><td colspan=\"2\">350 bps</td><td colspan=\"2\">170 bps</td></tr><tr><td>Acquisitions/Divestitures</td><td colspan=\"2\">—</td><td colspan=\"2\">—</td><td colspan=\"2\">(50) bps</td><td colspan=\"2\">—</td><td colspan=\"2\">—</td><td colspan=\"2\">—</td><td colspan=\"2\">10 bps</td><td colspan=\"2\">(10) bps</td></tr><tr><td>Restructuring/Other</td><td colspan=\"2\">50 bps</td><td colspan=\"2\">(10) bps</td><td colspan=\"2\">(10) bps</td><td colspan=\"2\">10 bps</td><td colspan=\"2\">(10) bps</td><td colspan=\"2\">(20) bps</td><td colspan=\"2\">20 bps</td><td colspan=\"2\">10 bps</td></tr><tr><td>Total Operating Margin Change</td><td colspan=\"2\">230 bps</td><td colspan=\"2\">—</td><td colspan=\"2\">70 bps</td><td colspan=\"2\">50 bps</td><td colspan=\"2\">70 bps</td><td colspan=\"2\">90 bps</td><td colspan=\"2\">380 bps</td><td colspan=\"2\">170 bps</td></tr><tr><td>Total Operating Margin % *</td><td colspan=\"2\">19.6%</td><td colspan=\"2\">27.2%</td><td colspan=\"2\">24.9%</td><td colspan=\"2\">32.3%</td><td colspan=\"2\">27.4%</td><td colspan=\"2\">29.3%</td><td colspan=\"2\">30.3%</td><td colspan=\"2\">26.8%</td></tr><tr><td>* Includes unfavorable operating margin impact of amortization expense from acquisition-related intangible assets</td><td colspan=\"2\"> 30 bps </td><td colspan=\"2\"> 40 bps </td><td colspan=\"2\"> 180 bps </td><td colspan=\"2\"> 10 bps </td><td colspan=\"2\"> 160 bps </td><td colspan=\"2\"> 10 bps </td><td colspan=\"2\"> 20 bps </td><td colspan=\"2\"> 70 bps ** </td></tr><tr><td colspan=\"17\">** Amortization expense from acquisition-related intangible assets had an unfavorable impact of ($0.26) on GAAP earnings per share for 2024.</td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"16\"> </td></tr><tr><td colspan=\"16\">ILLINOIS TOOL WORKS INC. and SUBSIDIARIESGAAP to NON-GAAP RECONCILIATIONS (UNAUDITED)</td></tr><tr><td colspan=\"16\"> </td></tr><tr><td colspan=\"16\">AFTER-TAX RETURN ON AVERAGE INVESTED CAPITAL (UNAUDITED)</td></tr><tr><td> </td><td colspan=\"7\"> </td><td> </td><td colspan=\"7\"> </td></tr><tr><td> </td><td colspan=\"7\">Three Months Ended</td><td> </td><td colspan=\"7\">Twelve Months Ended</td></tr><tr><td> </td><td colspan=\"7\">December 31,</td><td> </td><td colspan=\"7\">December 31,</td></tr><tr><td>Dollars in millions</td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td><td> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td></tr><tr><td>Numerator:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Net income</td><td>$</td><td>750</td><td> </td><td> </td><td>$</td><td>717</td><td> </td><td> </td><td>$</td><td>3,488</td><td> </td><td> </td><td>$</td><td>2,957</td><td> </td></tr><tr><td>Net discrete tax benefit related to the third quarter 2024</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>(121</td><td>)</td><td> </td><td> </td><td>—</td><td> </td></tr><tr><td>Discrete tax benefit related to the second quarter 2023</td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>—</td><td> </td><td> </td><td> </td><td>(20</td><td>)</td></tr><tr><td>Interest expense, net of tax (1)</td><td> </td><td>51</td><td> </td><td> </td><td> </td><td>54</td><td> </td><td> </td><td> </td><td>215</td><td> </td><td> </td><td> </td><td>204</td><td> </td></tr><tr><td>Other (income) expense, net of tax (1)</td><td> </td><td>(16</td><td>)</td><td> </td><td> </td><td>(7</td><td>)</td><td> </td><td> </td><td>(336</td><td>)</td><td> </td><td> </td><td>(38</td><td>)</td></tr><tr><td>Operating income after taxes</td><td>$</td><td>785</td><td> </td><td> </td><td>$</td><td>764</td><td> </td><td> </td><td>$</td><td>3,246</td><td> </td><td> </td><td>$</td><td>3,103</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Denominator:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Invested capital:</td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Cash and equivalents</td><td>$</td><td>948</td><td> </td><td> </td><td>$</td><td>1,065</td><td> </td><td> </td><td>$</td><td>948</td><td> </td><td> </td><td>$</td><td>1,065</td><td> </td></tr><tr><td>Trade receivables</td><td> </td><td>2,991</td><td> </td><td> </td><td> </td><td>3,123</td><td> </td><td> </td><td> </td><td>2,991</td><td> </td><td> </td><td> </td><td>3,123</td><td> </td></tr><tr><td>Inventories</td><td> </td><td>1,605</td><td> </td><td> </td><td> </td><td>1,707</td><td> </td><td> </td><td> </td><td>1,605</td><td> </td><td> </td><td> </td><td>1,707</td><td> </td></tr><tr><td>Net plant and equipment</td><td> </td><td>2,036</td><td> </td><td> </td><td> </td><td>1,976</td><td> </td><td> </td><td> </td><td>2,036</td><td> </td><td> </td><td> </td><td>1,976</td><td> </td></tr><tr><td>Goodwill and intangible assets</td><td> </td><td>5,431</td><td> </td><td> </td><td> </td><td>5,566</td><td> </td><td> </td><td> </td><td>5,431</td><td> </td><td> </td><td> </td><td>5,566</td><td> </td></tr><tr><td>Accounts payable and accrued expenses</td><td> </td><td>(2,095</td><td>)</td><td> </td><td> </td><td>(2,244</td><td>)</td><td> </td><td> </td><td>(2,095</td><td>)</td><td> </td><td> </td><td>(2,244</td><td>)</td></tr><tr><td>Debt</td><td> </td><td>(7,863</td><td>)</td><td> </td><td> </td><td>(8,164</td><td>)</td><td> </td><td> </td><td>(7,863</td><td>)</td><td> </td><td> </td><td>(8,164</td><td>)</td></tr><tr><td>Other, net</td><td> </td><td>264</td><td> </td><td> </td><td> </td><td>(16</td><td>)</td><td> </td><td> </td><td>264</td><td> </td><td> </td><td> </td><td>(16</td><td>)</td></tr><tr><td>Total net assets (stockholders' equity)</td><td> </td><td>3,317</td><td> </td><td> </td><td> </td><td>3,013</td><td> </td><td> </td><td> </td><td>3,317</td><td> </td><td> </td><td> </td><td>3,013</td><td> </td></tr><tr><td>Cash and equivalents</td><td> </td><td>(948</td><td>)</td><td> </td><td> </td><td>(1,065</td><td>)</td><td> </td><td> </td><td>(948</td><td>)</td><td> </td><td> </td><td>(1,065</td><td>)</td></tr><tr><td>Debt</td><td> </td><td>7,863</td><td> </td><td> </td><td> </td><td>8,164</td><td> </td><td> </td><td> </td><td>7,863</td><td> </td><td> </td><td> </td><td>8,164</td><td> </td></tr><tr><td>Total invested capital</td><td>$</td><td>10,232</td><td> </td><td> </td><td>$</td><td>10,112</td><td> </td><td> </td><td>$</td><td>10,232</td><td> </td><td> </td><td>$</td><td>10,112</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Average invested capital (2)</td><td>$</td><td>10,511</td><td> </td><td> </td><td>$</td><td>10,096</td><td> </td><td> </td><td>$</td><td>10,419</td><td> </td><td> </td><td>$</td><td>10,214</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td></tr><tr><td>Net income to average invested capital (3)</td><td> </td><td>28.6</td><td>%</td><td> </td><td> </td><td>28.4</td><td>%</td><td> </td><td> </td><td>33.5</td><td>%</td><td> </td><td> </td><td>29.0</td><td>%</td></tr><tr><td>After-tax return on average invested capital (3)</td><td> </td><td>29.9</td><td>%</td><td> </td><td> </td><td>30.3</td><td>%</td><td> </td><td> </td><td>31.2</td><td>%</td><td> </td><td> </td><td>30.4</td><td>%</td></tr><tr><td colspan=\"16\"> </td></tr></tbody></table></div><p class=\"\">(1) Effective tax rate used for interest expense and other (income) expense for the three months ended December 31, 2024 and 2023 was 23.7% and 22.6%, respectively, and 23.8% and 23.2% for the twelve months ended December 31, 2024 and 2023, respectively.</p><p class=\"\">(2) Average invested capital is calculated using the total invested capital balances at the start of the period and at the end of each quarter within each of the periods presented.</p><p class=\"\">(3) Returns for the three months ended December 31, 2024 and 2023 were converted to an annual rate by multiplying the calculated return by 4.</p><p class=\"\">A reconciliation of the 2024 effective tax rate excluding the third quarter 2024 net discrete tax benefit of $121 million, which included favorable discrete tax benefits of $107 million related to the utilization of capital loss carryforwards upon the sale of Wilsonart and $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions, is as follows:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> </td><td colspan=\"5\"> </td></tr><tr><td> </td><td colspan=\"5\">Twelve Months Ended</td></tr><tr><td> </td><td colspan=\"5\">December 31, 2024</td></tr><tr><td>Dollars in millions</td><td colspan=\"2\">Income Taxes</td><td> </td><td colspan=\"2\">Tax Rate</td></tr><tr><td>As reported</td><td>$</td><td>934</td><td> </td><td>21.1</td><td>%</td></tr><tr><td>Net discrete tax benefit related to the third quarter 2024</td><td> </td><td>121</td><td> </td><td>2.7</td><td>%</td></tr><tr><td>As adjusted</td><td>$</td><td>1,055</td><td> </td><td>23.8</td><td>%</td></tr></tbody></table></div><p class=\"\">A reconciliation of the 2023 effective tax rate excluding the second quarter 2023 discrete tax benefit of $20 million related to amended 2021 U.S. taxes is as follows:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> </td><td colspan=\"5\"> </td></tr><tr><td> </td><td colspan=\"5\">Twelve Months Ended</td></tr><tr><td> </td><td colspan=\"5\">December 31, 2023</td></tr><tr><td>Dollars in millions</td><td colspan=\"2\">Income Taxes</td><td> </td><td colspan=\"2\">Tax Rate</td></tr><tr><td>As reported</td><td>$</td><td>866</td><td> </td><td>22.6</td><td>%</td></tr><tr><td>Discrete tax benefit related to the second quarter 2023</td><td> </td><td>20</td><td> </td><td>0.6</td><td>%</td></tr><tr><td>As adjusted</td><td>$</td><td>886</td><td> </td><td>23.2</td><td>%</td></tr></tbody></table></div><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> </td><td colspan=\"7\"> </td><td> </td><td colspan=\"8\"> </td></tr><tr><td colspan=\"17\">FREE CASH FLOW (UNAUDITED)</td></tr><tr><td> </td><td colspan=\"7\"> </td><td> </td><td colspan=\"8\"> </td></tr><tr><td> </td><td colspan=\"7\">Three Months Ended</td><td> </td><td colspan=\"8\">Twelve Months Ended</td></tr><tr><td> </td><td colspan=\"7\">December 31,</td><td> </td><td colspan=\"8\">December 31,</td></tr><tr><td>Dollars in millions</td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2023</td><td> </td><td> </td><td> </td><td>2024</td><td> </td><td colspan=\"2\"> </td><td> </td><td>2023</td><td> </td></tr><tr><td>Net cash provided by operating activities</td><td>$</td><td>1,114</td><td> </td><td> </td><td>$</td><td>1,039</td><td> </td><td> </td><td>$</td><td>3,281</td><td> </td><td colspan=\"2\"> </td><td>$</td><td>3,539</td><td> </td></tr><tr><td>Less: Additions to plant and equipment</td><td> </td><td>(118</td><td>)</td><td> </td><td> </td><td>(131</td><td>)</td><td> </td><td> </td><td>(437</td><td>)</td><td colspan=\"2\"> </td><td> </td><td>(455</td><td>)</td></tr><tr><td>Free cash flow</td><td>$</td><td>996</td><td> </td><td> </td><td>$</td><td>908</td><td> </td><td> </td><td>$</td><td>2,844</td><td> </td><td colspan=\"2\"> </td><td>$</td><td>3,084</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td colspan=\"2\"> </td><td colspan=\"3\"> </td></tr><tr><td>Net income</td><td>$</td><td>750</td><td> </td><td> </td><td>$</td><td>717</td><td> </td><td> </td><td>$</td><td>3,488</td><td> </td><td colspan=\"2\"> </td><td>$</td><td>2,957</td><td> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td colspan=\"2\"> </td><td colspan=\"3\"> </td></tr><tr><td>Net cash provided by operating activities to net income conversion rate</td><td> </td><td>149</td><td>%</td><td> </td><td> </td><td>145</td><td>%</td><td> </td><td> </td><td>94</td><td>%</td><td colspan=\"2\"> </td><td> </td><td>120</td><td>%</td></tr><tr><td>Free cash flow to net income conversion rate</td><td> </td><td>133</td><td>%</td><td> </td><td> </td><td>127</td><td>%</td><td> </td><td> </td><td>82</td><td>%</td><td>(1</td><td>)</td><td> </td><td>104</td><td>%</td></tr><tr><td colspan=\"17\"> </td></tr></tbody></table></div><p class=\"\">(1) Excluding the impact of the cumulative effect of the change from the LIFO method of accounting to the FIFO method for certain U.S. businesses ($117 million pre-tax, or $88 million after-tax), the $363 million pre-tax gain on the sale of noncontrolling interest in Wilsonart and related taxes, and a discrete tax benefit of $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions, the free cash flow to net income conversion rate would have been 94% for the twelve months ended December 31, 2024.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> </td><td colspan=\"12\"> </td><td colspan=\"2\"> </td></tr><tr><td> </td><td colspan=\"12\">Three Months Ended</td><td colspan=\"2\"> </td></tr><tr><td> </td><td colspan=\"3\">March 31,</td><td colspan=\"2\"> </td><td colspan=\"3\">June 30,</td><td> </td><td colspan=\"3\">September 30,</td><td colspan=\"2\"> </td></tr><tr><td>Dollars in millions</td><td> </td><td>2024</td><td> </td><td colspan=\"2\"> </td><td> </td><td>2024</td><td> </td><td> </td><td> </td><td>2024</td><td> </td><td colspan=\"2\"> </td></tr><tr><td>Net cash provided by operating activities</td><td>$</td><td>589</td><td> </td><td colspan=\"2\"> </td><td>$</td><td>687</td><td> </td><td> </td><td>$</td><td>891</td><td> </td><td colspan=\"2\"> </td></tr><tr><td>Less: Additions to plant and equipment</td><td> </td><td>(95</td><td>)</td><td colspan=\"2\"> </td><td> </td><td>(116</td><td>)</td><td> </td><td> </td><td>(108</td><td>)</td><td colspan=\"2\"> </td></tr><tr><td>Free cash flow</td><td>$</td><td>494</td><td> </td><td colspan=\"2\"> </td><td>$</td><td>571</td><td> </td><td> </td><td>$</td><td>783</td><td> </td><td colspan=\"2\"> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td colspan=\"2\"> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td colspan=\"2\"> </td></tr><tr><td>Net income</td><td>$</td><td>819</td><td> </td><td colspan=\"2\"> </td><td>$</td><td>759</td><td> </td><td> </td><td>$</td><td>1,160</td><td> </td><td colspan=\"2\"> </td></tr><tr><td> </td><td colspan=\"3\"> </td><td colspan=\"2\"> </td><td colspan=\"3\"> </td><td> </td><td colspan=\"3\"> </td><td colspan=\"2\"> </td></tr><tr><td>Net cash provided by operating activities to net income conversion rate</td><td> </td><td>72</td><td>%</td><td colspan=\"2\"> </td><td> </td><td>91</td><td>%</td><td> </td><td> </td><td>77</td><td>%</td><td colspan=\"2\"> </td></tr><tr><td>Free cash flow to net income conversion rate</td><td> </td><td>60</td><td>%</td><td>(1</td><td>)</td><td> </td><td>75</td><td>%</td><td> </td><td> </td><td>68</td><td>%</td><td>(2</td><td>)</td></tr></tbody></table></div><p class=\"\">(1) Excluding the impact of the cumulative effect of the change from the LIFO method of accounting to the FIFO method for certain U.S. businesses ($117 million pre-tax, or $88 million after-tax), the free cash flow to net income conversion rate would have been 68% for the three months ended March 31, 2024.</p><p class=\"\">(2) Excluding the $363 million pre-tax gain on the sale of noncontrolling interest in Wilsonart and related taxes, and a discrete tax benefit of $87 million related to a reorganization of the Company's intellectual property, partially offset by a $73 million discrete tax expense related to the remeasurement of unrecognized tax benefits associated with various intercompany transactions, the free cash flow to net income conversion rate would have been 102% for the three months ended September 30, 2024.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td> </td><td colspan=\"3\"> </td></tr><tr><td colspan=\"4\">ADJUSTED NET INCOME PER SHARE - DILUTED (UNAUDITED)</td></tr><tr><td> </td><td colspan=\"3\"> </td></tr><tr><td> </td><td colspan=\"3\">Twelve Months Ended</td></tr><tr><td> </td><td colspan=\"3\">December 31, 2024</td></tr><tr><td>As reported</td><td>$</td><td>11.71</td><td> </td></tr><tr><td>Impact of sale of noncontrolling interest in Wilsonart (1)</td><td> </td><td>(1.26</td><td>)</td></tr><tr><td>Cumulative effect of change in inventory accounting method, net of tax (2)</td><td> </td><td>(0.30</td><td>)</td></tr><tr><td>As adjusted</td><td>$</td><td>10.15</td><td> </td></tr></tbody></table></div><p class=\"\">(1) Includes the $363 million pre-tax gain on the sale of noncontrolling interest in Wilsonart and related taxes.</p><p class=\"\">(2) Represents the cumulative effect of the change from the LIFO method of accounting to the FIFO method for certain U.S. businesses ($117 million pre-tax, or $88 million after-tax).</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX3KWv1w:0-itw-reports-fourth-quarter-and-full-year-2024-results/",
            "pub_date": "2025-02-05 21:00:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309870:0",
            "title": "JMP Securities Downgrades Snap to Market Perform From Market Outperform, $16 Price Target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Snap  has an average rating of Hold and mean price target of $12.97, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309870:0/",
            "pub_date": "2025-02-05 21:00:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309857:0",
            "title": "Raymond James Initiates Robinhood Markets at Market Perform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Robinhood Markets  has an average rating of overweight and mean price target of $50.88, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309857:0/",
            "pub_date": "2025-02-05 20:53:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005511:0",
            "title": "Johnson Controls Names Weidemanis CEO, Logs 1Q Income Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Rob Curran</p><p class=\"\">Johnson Controls named Danaher executive Joakim Weidemanis as chief executive to succeed George Oliver, who last year divulged plans to step down following pressure from activist investment firm Elliott Investments.</p><p class=\"\">Separately, the maker of heating, ventilation and air-conditioning machinery posted fiscal first-quarter earnings growth and boosted its earnings projection for the year ending in September.</p><p class=\"\">Weidemanis is slated to start as CEO on March 12. Oliver will remain as nonexecutive chairman until July 31, at which point he will be succeeded in that role by Mark Vergnano, who has sat on the board since 2016. Oliver will then serve as an adviser, supporting the leadership transition until the end of 2025.</p><p class=\"\">Weidemanis had a 13-year career as an executive at industrial conglomerate Danaher, most recently as executive vice president, diagnostics and China, and he previously worked at Swiss industrial firm ABB.</p><p class=\"\">Johnson posted earnings of $419 million, or 63 cents a share, for the quarter ended in December, up from $374 million, or 55 cents a share, a year earlier.</p><p class=\"\">On an adjusted basis, the Ireland-based company logged earnings of 64 cents a share, compared with the mean analyst estimate of 59 cents a share, per FactSet.</p><p class=\"\">Sales rose 4% to $5.43 billion, surpassing the mean analyst estimate of $5.29 billion.</p><p class=\"\">For the fiscal second quarter, Johnson targeted adjusted earnings between 77 cents and 79 cents a share.</p><p class=\"\">For the fiscal year, the company boosted its forecast for adjusted earnings to a range between $3.50 and $3.60 a share from a previous target of $3.40 to $3.50 a share.</p><p class=\"\">Johnson started a chief-executive search in July, when Oliver disclosed plans to step down in response to an activist-investor campaign from Elliott. Oliver noted the company's tightening of its focus during his tenure.</p><p class=\"\">Write to Rob Curran at rob.curran@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005511:0-johnson-controls-names-weidemanis-ceo-logs-1q-income-growth/",
            "pub_date": "2025-02-05 20:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309858:0",
            "title": "HSBC Downgrades H World Group to Hold From Buy, Adjusts Price Target to $32.40 From $50.30",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">H World Group  has an average rating of Buy and mean price target of $43.76, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309858:0/",
            "pub_date": "2025-02-05 20:54:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1UW:0",
            "title": "Boston Scientific sees higher-than-expected 2025 profit on strong demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Medical device maker Boston Scientific  forecast annual profit above Wall Street estimates on Wednesday, banking on steady demand for its heart devices.</p><p class=\"\">Manufacturers of medical devices have been benefiting from the elevated demand for elective surgical procedures in the United States, especially among older adults.</p><p class=\"\">Boston Scientific, which generates most of its revenue from sales of heart devices such as pacemakers and stents, also produces equipment for diagnosing and treating a range of gastrointestinal and pulmonary conditions.    </p><p class=\"\">The company expects its 2025 adjusted earnings to be in the range of $2.80 to $2.87 per share, above analysts' average expectation of $2.81 at the midpoint, according to data compiled by LSEG.</p><p class=\"\">Boston Scientific projected full-year revenue growth between 12.5% and 14.5%, compared with the prior year.    </p><p class=\"\">The company's key growth drivers include its stroke prevention device, Watchman, and Farapulse, which uses short high-voltage pulses to treat certain abnormal heart rhythm conditions. </p><p class=\"\">The initial 2025 guide is \"strong out of the gates and we see room for the company to beat and raise through the year with PFA (Farapulse) as a key driver,\" RBC Capital analyst Shagun Singh said.</p><p class=\"\">The results and the forecast \"continue to point to a positive read-through to the rest of the sector,\" Singh added.</p><p class=\"\">Boston Scientific's revenue increased 22.4% to $4.56 billion for the fourth quarter, surpassing expectations of $4.43 billion.</p><p class=\"\">Sales at the company's cardiovascular unit rose nearly 29% to $2.94 billion in the three months ended Dec. 31, beating estimates of $2.83 billion.</p><p class=\"\">The company's endoscopy unit, which includes devices used in surgical procedures that aid in weight loss, reported a 7% rise in its quarterly revenue of $690 million. Analysts were expecting the unit to report sales of $695.9 million.</p><p class=\"\">Boston Scientific earned 70 cents per share on an adjusted basis in the fourth quarter, topping estimates of 66 cents. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1UW:0-boston-scientific-sees-higher-than-expected-2025-profit-on-strong-demand/",
            "pub_date": "2025-02-05 20:54:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}