{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM3N0:0",
            "title": "Ready Capital Corp reports results for the quarter ended September 30 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ready Capital Corp </span><span> reported a quarterly adjusted loss of 94 cents​​ per share for the quarter ended September 30, lower than the same quarter last year, when the company reported EPS of -3 cents.  The mean expectation of eight analysts for the quarter was for a loss of 12 cents per share. Wall Street expected results to range from -66 cents to 23 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 74.3% to $13.12 million from a year ago; analysts expected $13.65 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ready Capital Corp's reported EPS for the quarter was a loss of 13 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $22.74 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Ready Capital Corp shares had fallen by 23.9% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 13.4% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no negative revisions of earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy,\" 7 \"hold\" and 1 \"sell\" or \"strong sell.\" The average consensus recommendation for the specialized reits peer group is  \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Ready Capital Corp is $2.50, about 34.8% above its last closing price of $1.63</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 11:58 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-0.12</span></p></td><td><p class=\"\"><span>-0.94</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>-0.12</span></p></td><td><p class=\"\"><span>-0.94</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.12</span></p></td><td><p class=\"\"><span>-0.09</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.20</span></p></td><td><p class=\"\"><span>-0.09</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM3N0:0-ready-capital-corp-reports-results-for-the-quarter-ended-september-30-earnings-summary/",
            "pub_date": "2026-02-27 07:58:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2CB:0",
            "title": "Investigator Silver Seeks Trading Halt",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Investigator Silver Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SEEKS TRADING HALT PENDING ANNOUNCEMENT ON  CAPITAL RAISING, OTHERS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2CB:0-investigator-silver-seeks-trading-halt/",
            "pub_date": "2026-02-27 07:59:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZM2GZ:0",
            "title": "Venture Global signs 20-year LNG supply deal with Korea's Hanwha Aerospace",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    U.S.-based LNG company Venture Global </span><span> said on Thursday it had signed a 20-year sales and purchase agreement with Korea's Hanwha Aerospace (012450KS) for 1.5 million metric tons per annum (mtpa) of liquefied natural gas starting in 2030.</span></p><p class=\"\"><span>The agreement brings Venture Global's total long-term contracted portfolio to more than 46 million tons per annum, the company said in a press release.</span></p><p class=\"\"><span>In late November, Venture Global signed a separate 20-year agreement to supply Japan’s top city gas provider Tokyo Gas </span><span> with 1 million metric tons per annum of LNG beginning in 2030.</span></p><p class=\"\"><span>Venture Global is the second-largest LNG exporter in the U.S., the leading nation for LNG exports.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZM2GZ:0-venture-global-signs-20-year-lng-supply-deal-with-korea-s-hanwha-aerospace/",
            "pub_date": "2026-02-27 08:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019173:0",
            "title": "Union Bankshares Names Jeffery Weidley as Incoming CEO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Katherine Hamilton</span></p><p class=\"\"><span>Union Bankshares named Jeffery Weidley as its next chief executive.</span></p><p class=\"\"><span>Weidley will succeed David Silverman when he retires in July, the Vermont-based parent of Union Bank said Thursday.</span></p><p class=\"\"><span>Weidley will be president of both the bank and its parent company starting May 4. Silverman will continue as CEO through the transition period until July 3.</span></p><p class=\"\"><span>Weidley will also be appointed to the board, Union said.</span></p><p class=\"\"><span>Weidley, 42, is joining from the Reston, Va., bank MVB Bank, where he has been chief deposit officer since January 2025.</span></p><p class=\"\"><span>Union's board has been looking for Silverman's successor since May. Silverman, 65, has been chief executive since 2012 and joined the bank 39 years ago.</span></p><p class=\"\"><span>Silverman is expected to continue to serve on the boards of both the bank and its parent after his retirement.</span></p><p class=\"\"><span>Union plans to pay Weidley a base salary of $500,000, plus equity awards and a $25,000 relocation allowance.</span></p><p class=\"\"><span>Write to Katherine Hamilton at katherine.hamilton@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019173:0/",
            "pub_date": "2026-02-27 08:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019157:0",
            "title": "How JPMorgan's Bankers Stayed Close to Epstein After Bank Fired Him as a Client — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Alexander Saeedy</span></p><p class=\"\"><span>JPMorgan Chase has said it fired Jeffrey Epstein as a client in 2013. Newly released documents show how its bankers maintained ties with the convicted sex offender for years as he helped manage Apollo Global Management co-founder Leon Black's fortune.</span></p><p class=\"\"><span>Two JPMorgan managing directors, Justin Nelson and Paul Barrett, used their connection to Epstein to develop a commercial relationship between the bank and Black's family office starting in 2014, recently released documents show. Nelson had been Epstein's banker before the bank kicked Epstein out in 2013, while Barrett had helped find investments for him.</span></p><p class=\"\"><span>The Journal reported in 2023 that Nelson and Barrett had scheduled multiple meetings with Epstein from 2014 to 2017. JPMorgan said at the time that any meeting held with Epstein after 2013 was regarding other JPMorgan bank clients whom Epstein represented. Nelson remains a senior banker at JPMorgan, while Barrett left in 2017 to work directly for Epstein.</span></p><p class=\"\"><span>Documents released in the past several months by the Justice Department and Congress show the extent of the two senior bankers' interactions with Epstein. Dozens of emails show the crucial role that Epstein played in helping the bankers pitch business to Black and meet wealthy individuals.</span></p><p class=\"\"><span>Joseph Evangelisti, a JPMorgan spokesman, reiterated in a statement that the bank \"fired\" Epstein as a client in August 2013. \"To the extent our bankers subsequently interacted with him, it was because other clients — not JPMorgan — chose to use him as an advisor,\" he said.</span></p><p class=\"\"><span>Evangelisti said that JPMorgan flagged Epstein's suspicious activity to the federal government both before and after pushing him out as a client.</span></p><p class=\"\"><span>JPMorgan dropped Epstein as a client in 2013 after compliance officers raised concerns about his high cash withdrawals and possible implication in human trafficking crimes.</span></p><p class=\"\"><span>In 2015, Barrett offered to give Epstein advice on his own investments, which were no longer at the bank. He gave advice to Epstein for his personal portfolio on at least three occasions between 2016 and 2017, emails show.</span></p><p class=\"\"><span>Barrett \"appears to have developed a personal relationship with Epstein that he did not disclose to the bank,\" Evangelisti said. He said JPMorgan \"did not sanction or authorize this conduct.\"</span></p><p class=\"\"><span>A lawyer representing Barrett declined to comment, and Barrett didn't respond to a request for comment.</span></p><p class=\"\"><span>Barrett left JPMorgan in 2017 to work even more closely with Epstein, managing his money directly through a fund called Alpha Group Capital. He later worked at Citigroup, which fired him in 2023 after learning of his ties to Epstein. Citigroup declined to comment.</span></p><p class=\"\"><span>Barrett has said in legal filings he did \"nothing inappropriate involving Mr. Epstein or his accounts\" and he wasn't aware of any illicit activity.</span></p><p class=\"\"><span>Nelson, a more than 25-year employee who advises high-net-worth clients from an office in Greenwich, Conn., still works at the bank. The JPMorgan spokesman said Nelson is \"an employee in good standing whose interactions were only in the context of his work with Leon Black and related entities.\" Nelson declined to comment.</span></p><p class=\"\"><span>Chasing Elysium</span></p><p class=\"\"><span>For some 15 years, Epstein was a top client of JPMorgan, with dozens of accounts and tens of millions of dollars at its private bank. He communicated often with bank executives including its former head of investment banking, Jes Staley, and connected them to his network of wealthy contacts. Staley has said he regrets his relationship with Epstein.</span></p><p class=\"\"><span>Epstein pleaded guilty to procuring a minor for prostitution in 2008. Staley left the bank in early 2013, and JPMorgan decided to close Epstein's accounts later that year. After Epstein's death in 2019, JPMorgan agreed to pay $290 million to settle a suit brought on behalf of his accusers that claimed the bank had ignored red flags about him. The bank has denied any wrongdoing.</span></p><p class=\"\"><span>The recently released documents reveal how Epstein's vast network kept him enmeshed with the world's most powerful people and institutions for more than a decade after he pleaded guilty to a sex crime.</span></p><p class=\"\"><span>Epstein had taken on a greater role at Elysium Management, Black's family office, in 2012.</span></p><p class=\"\"><span>Nelson, who had been assigned Epstein as a client in 2012, asked Epstein for help getting closer to Black and his fortune both before and after the bank said it removed Epstein as a client, emails show.</span></p><p class=\"\"><span>Nelson arranged to meet Epstein at his townhouse in April 2014, emails show. He followed up a day later asking Epstein's assistant for contact information for top managers at Black's family office to try to pitch them on the private bank. Elysium opened an account with the private bank weeks later, emails show.</span></p><p class=\"\"><span>Evangelisti said Black and his office directed JPMorgan's bankers to work with Epstein on Black's investments. \"There was nothing improper about Mr. Nelson's limited interactions with Epstein\" after the bank pushed out Epstein as a client, he said.</span></p><p class=\"\"><span>Whit Clay, a spokesman for Elysium and Black, said Elysium \"had a limited investment\" with JPMorgan. He also said the Black family had a relationship with JPMorgan \"that predates Epstein's involvement.\"</span></p><p class=\"\"><span>Black has previously said he paid Epstein for estate planning, tax work, structuring of art entities and philanthropic advice from 2012 to 2017. He stepped down from the CEO role at Apollo in 2021. He has said he didn't engage in wrongdoing, decided to give Epstein a second chance after his 2008 conviction and regrets his involvement with Epstein.</span></p><p class=\"\"><span>Back in the fold</span></p><p class=\"\"><span>Once Elysium began working with JPMorgan in 2014, Epstein enlisted Barrett, who had previously helped Epstein invest his money. Barrett \" will do as i say,\" Epstein wrote in a June 2014 email to an executive working for Black's family office.</span></p><p class=\"\"><span>The recently disclosed emails suggest that Nelson and Barrett saw Epstein as key to getting in on managing Black's wealth, which stood at $5 billion in March 2013, according to other documents.</span></p><p class=\"\"><span>After Black canceled a meeting with JPMorgan, Barrett emailed Epstein and asked if he could help get it rescheduled, a July 2014 email shows. Six days later, Barrett told Nelson that Epstein hadn't come back yet, prompting Nelson to say, \"I need to figure out some way to get this going ... maybe I should go see JE?\"</span></p><p class=\"\"><span>In August, Epstein told Barrett that $10 million had been wired to JPMorgan that he could start investing on Black's behalf.</span></p><p class=\"\"><span>Barrett started to pitch Epstein directly and made a number of investments with Elysium's capital, including a currency investment and roughly $820,000 of Western Digital securities, emails between 2014 and 2017 show.</span></p><p class=\"\"><span>Evangelisti said that banking clients get to choose their advisers and the bank \"did not choose to work with Epstein.\"</span></p><p class=\"\"><span>One of Epstein's projects at Elysium involved getting Black more favorable terms for a variety of loans.</span></p><p class=\"\"><span>\"Jeffrey, I would like to take a shot at the line of credit (art and plane if you are open to it),\" Nelson wrote in a May 2015 email to Epstein asking him to send Black's financial details.</span></p><p class=\"\"><span>Clay, the Elysium spokesman, said there was no record of any loans made by JPMorgan to the family office.</span></p><p class=\"\"><span>Barrett arranged to bring Monica DiCenso, then one of the private bank's equity research strategists, to Epstein's townhouse to meet him, according to an email the following month.</span></p><p class=\"\"><span>Evangelisti had no comment on the meeting. DiCenso, who now oversees JPMorgan's Global Investment Opportunities Group, declined to comment.</span></p><p class=\"\"><span>'We both wish I could cover you'</span></p><p class=\"\"><span>The emails show the relationship between Epstein and Barrett extended beyond Elysium. One 2016 email shows Epstein's assistant telling Epstein that Barrett's nephew and his mother thank him for \"use of apt 10B\" and are \"leaving for home today.\"</span></p><p class=\"\"><span>In 2017, Epstein introduced Barrett to Nicole Junkermann, a German countess and entrepreneur who Epstein said in an email wanted to invest $100 million through JPMorgan.</span></p><p class=\"\"><span>Evangelisti said the bank wasn't aware if Barrett's family members used Epstein's apartment and if it occurred, it was \"personal conduct not sanctioned by JPMorgan.\" He said Epstein's introduction to Junkermann was unsolicited and that the bank doesn't see evidence of it having gone anywhere.</span></p><p class=\"\"><span>Junkermann didn't respond to a request for comment. A spokesman for Junkermann recently told The Telegraph that she \"deeply regrets\" her conversations with Epstein.</span></p><p class=\"\"><span>Barrett also gave Epstein financial advice on his own investments after Epstein was kicked out of JPMorgan. In 2015, Barrett sent an email to Richard Kahn, Epstein's longtime accountant, offering to review some of Epstein's portfolio that had been moved to another bank.</span></p><p class=\"\"><span>In 2016, Kahn sent Epstein an email summarizing several suggestions Barrett had made regarding Epstein's bond portfolio.</span></p><p class=\"\"><span>\"We both wish I could cover you,\" Barrett told Kahn in an email, apparently referring to how he wished he could still work with Epstein as a JPMorgan client. In 2017, Barrett took an options trade directly to Epstein, who told his accountant to make a $200,000 bet on his recommendation.</span></p><p class=\"\"><span>\"Based on the emails you identified, the employee appears to have developed a private relationship with Epstein in advance of going to work for him,\" Evangelisti said of Barrett's interactions. \"He did not transact any business for Epstein after we fired him as a client in 2013.\"</span></p><p class=\"\"><span>Write to Alexander Saeedy at alexander.saeedy@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019157:0/",
            "pub_date": "2026-02-27 08:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSC84dTa:0",
            "title": "BioNxt Announces Closing of Shares for Debt Settlement",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>VANCOUVER, BC / ACCESS Newswire / February 26, 2026 / BioNxt Solutions Inc. (\"</span><strong class=\"root-Tkn6WL2y\"><span>BioNxt</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\") </span><strong class=\"root-Tkn6WL2y\"><span>(OTCQB:BNXTF)(FSE:BXT)</span></strong><span> is pleased to announce that, further to its news release dated January 23, 2026, the Company has issued an aggregate of 6,008,883 common shares in the capital of the Company (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Debt Shares</span></strong><span>\") at a deemed price of $0.45 per Debt Share to settle $2,704,000 in debt (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Debt</span></strong><span>\") owed to certain arm's length creditors (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Debt Settlement</span></strong><span>\"). The Debt was comprised of a principal amount of $2,600,000 and accrued interest of $104,000 pursuant to 8% convertible debentures issued by the Company on December 7, 2022.</span></p><p class=\"\"><span>In connection with the Debt Settlement, the Company issued 300,444 common shares in the capital of the Company (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Compensation Shares</span></strong><span>\") to Canaccord Genuity Corp. at a deemed price of $0.63 per Compensation Share as compensation for facilitating the Debt Settlement.</span></p><p class=\"\"><span>Each of the Debt Shares and the Compensation Shares are subject to a statutory four month and one day hold period in accordance with applicable Canadian securities laws.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About BioNxt Solutions Inc.</span></strong></p><p class=\"\"><span>BioNxt Solutions Inc. is a bioscience innovator focused on next‐generation drug delivery technologies, diagnostic screening systems, and active pharmaceutical ingredient development. The Company's proprietary platforms-Sublingual (Thin‐Film), Transdermal (Skin Patch), and Oral (Enteric‐Coated Tablets)-target key therapeutic areas, including autoimmune diseases, neurological disorders, and longevity. With research and development operations in North America and Europe, BioNxt is advancing regulatory approvals and commercialization efforts, primarily focused on European markets. BioNxt is committed to improving healthcare by delivering precise, patient‐centric solutions that enhance treatment outcomes worldwide.</span></p><p class=\"\"><span>BioNxt is listed on the Canadian Securities Exchange: BNXT, OTCQB Markets: BNXTF and trades in Germany under WKN: A3D1K3. To learn more about BioNxt, please visit www.bionxt.com.</span></p><p class=\"\"><span>Investor Relations &amp; Media Contact</span></p><p class=\"\"><span>Hugh Rogers, Co‐Founder, CEO and Director</span></p><p class=\"\"><span>Email: investor.relations@bionxt.com</span></p><p class=\"\"><span>Phone: +1 778.598.2698</span></p><p class=\"\"><span>Web: www.bionxt.com</span></p><p class=\"\"><span>LinkedIn: https://www.linkedin.com/company/bionxt‐solutions</span></p><p class=\"\"><span>Instagram: https://www.instagram.com/bionxt</span></p><p class=\"\"><span>THIS NEWS RELEASE DOES NOT CONSTITUTE AN OFFER TO SELL OR THE SOLICITATION OF ANY OFFER TO BUY, NOR SHALL THERE BE ANY SALE OF THESE SECURITIES IN ANY JURISDICTION IN WHICH SUCH OFFER, SOLICITATION OR SALE WOULD BE UNLAWFUL. THE SHARES ISSUED HAVE NOT BEEN AND WILL NOT BE REGISTERED UNDER THE UNITED STATES SECURITIES ACT OF 1933, AS AMENDED (THE \"</span><strong class=\"root-Tkn6WL2y\"><span>U.S. SECURITIES ACT</span></strong><span>\") AND MAY NOT BE OFFERED OR SOLD IN THE UNITED STATES ABSENT REGISTRATION OR AN APPLICABLE EXEMPTION FROM THE REGISTRATION REQUIREMENTS OF THE U.S. SECURITIES ACT AND APPLICABLE STATE SECURITIES LAWS.</span></p><p class=\"\"><span>Neither the CSE nor its Regulation Services Provider accepts responsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> BioNxt Solutions Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSC84dTa:0/",
            "pub_date": "2026-02-27 08:00:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1d7a1d80fc779:0",
            "title": "Krystal Biotech Director Janney Daniel Sells Over $16 Million in Company Stock",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Krystal Biotech Director, Janney Daniel, completed 20 transactions selling a total of 60,161 shares of Common Stock, with sales totaling approximately $16,149,383. The transactions occurred over three days, from February 24 to February 26, 2026, with prices per share ranging and reflecting weighted average sale prices. Following these transactions, Daniel no longer directly owns any shares but indirectly owns 85,096 shares through Alta Bioequities, L.P.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Janney Daniel</span></td></tr><tr><td><span>Relationship</span></td><td><span>Director</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$16,149,383</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1711279/000171127926000021/xslF345X05/wk-form4_1772149785.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1711279/000171127926000021/xslF345X05/wk-form4_1772149785.xml\" rel=\"nofollow\" target=\"_blank\">Krystal Biotech, Inc. [ KRYS ] - Form 4 - Feb. 26, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:1d7a1d80fc779:0-krystal-biotech-director-janney-daniel-sells-over-16-million-in-company-stock/",
            "pub_date": "2026-02-27 08:00:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:d4b619188e59a:0",
            "title": "BlackRock Senior Managing Director Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BlackRock's Senior Managing Director, Kushel J. Richard, sold a total of 2,385 shares of common stock on February 24, 2026, for a total sale amount of $2,583,790. The sales included 385 shares sold at $1,084.9101 per share through indirect ownership by The Kushel Family 2018 Trust and 2,000 shares sold directly at $1,083.05 per share. Following these transactions, Richard directly owns 61,980 shares and indirectly owns 78,793 shares of BlackRock's common stock.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Kushel J. Richard</span></td></tr><tr><td><span>Relationship</span></td><td><span>Senior Managing Director</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$2,583,790</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2012383/000201238326000926/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2012383/000201238326000926/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">BlackRock, Inc. [ BLK ] - Form 4 - Feb. 26, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:d4b619188e59a:0-blackrock-senior-managing-director-sells-shares/",
            "pub_date": "2026-02-27 08:00:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw8QKCyy:0",
            "title": "Prismo Metals to Advance Hot Breccia Toward Drilling Through Strategic Transaction",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>Secures Equity, Cash, and OngoingUpside Exposure</span></p><p class=\"\"><span>Vancouver, British Columbia, February26th, 2025 – TheNewswire- Prismo Metals Inc. (“Prismo” or the“Company”) </span><span> (OTCQB: PMOMF) is</span><br/><span>pleased to announce that it has entered into a definitive  assignment</span><br/><span>agreement (the “Agreement”) with Blade Resources Inc.(“Blade”) pursuant to which Prismo has agreed to assign all of itsrights, interests and obligations in the Hot Breccia copper project,located  in the heart of the Arizona copper belt (the “Transaction”), toBlade. The Transaction is expected to close on or about March 2, 2026,or such other date as the Company and Blade may agree.</span></p><p class=\"\"><span>In consideration for the Transaction, Prismo will beissued 6,755,000 common shares of Blade and will receive a cashpayment of $185,000. Followingcompletion of the Transaction, Prismo will own approximately 24% ofBlade’s issued and outstanding shares and will be Blade’s largestsingle shareholder (see additional early warning disclosurebelow).</span></p><p class=\"\"><span>Alain Lambert, CEO of Prismo, commented: “In ouropinion, Hot Breccia is one of the best copper explorationopportunities in North America. Since optioning the project in January2023, we have remained committed to advancing it toward drilling.After carefully evaluating our options - including funding a drillprogram internally, partnering with a major, or joining forces withlike-minded explorers - we have concluded that the best way forwardfor Prismo is the latter hence this partnership with Blade.” Headded: “The principals and financial backers of Blade have a longhistory and strong track record in raising significant capital forexploration programs of the scale required at Hot Breccia.” </span></p><p class=\"\"><span>Strategic Rationale</span></p><p class=\"\"><span>The Transaction provides several strategicbenefits:</span></p><p class=\"\"><span>Value Creation: Prismo is leveraging its investments in Hot Breccia into asignificant stake in a company dedicated to advancing the Hot Brecciaproject.</span></p><p class=\"\"><span>Access to Capital with LimitedDilution: The structure providesenhanced access to capital for the Hot Breccia drill program throughBlade, without direct dilution to Prismo shareholders.</span></p><p class=\"\"><span>Strategic Focus: Prismo will focus on advancing its remainingArizona projects — Silver King and Ripsey Gold — while Bladededicates its efforts to advancing Hot Breccia.</span></p><p class=\"\"><span>Enhanced Attractiveness to StrategicPartners: With the potential for100% ownership of Hot Breccia, Blade will be in a better position topossibly attract majors or strategic buyers.</span></p><p class=\"\"><span>Prismo’s Investment in Blade</span></p><p class=\"\"><span>Regarding Prismo’s investment in Blade, Mr. Lambertsaid: “We see several potential pathways for our investment: holdingit long term, monetizing a portion to fund other projects,distributing shares to our shareholders, or a combination of theselast two approaches. At this time, we are entering this transactionwith a long-term perspective. Successful development at Hot Brecciawould have meaningful implications for shareholder value.”</span></p><p class=\"\"><span>Additional Prismo Rights under theTransaction</span></p><p class=\"\"><span>Under the terms of the Transaction:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Prismo has the right to nominate one representative toBlade’s board of directors. The Company has not yet determined itsinitial nominee. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Blade has granted Prismo participation rights in futureequity offerings, allowing Prismo to subscribe for shares onsubstantially the same terms as other investors in order to maintainits undiluted ownership percentage in Blade. </span></p></li></ul><p class=\"\"><span>Dr. Linus Keating, manager of Walnut Mines LLC, theunderlying landowner of Hot Breccia enthusiastically commented:“Walnut Mines strongly supports any initiativethat advances Hot Breccia toward a serious drill program. We areoptimistic that this transaction will help achieve that objective in2026. In our view, this property continues to represent an excellentcopper exploration opportunity in North America.”</span></p><p class=\"\"><span>Early Warning Disclosure</span></p><p class=\"\"><span>This news release is issued in accordance with NationalInstrument 62-103 – TheEarly Warning System and Related Take-Over Bid and Insider ReportingIssues. Prior to the Transaction, Prismo did notown any common shares of Blade. The common shares of Blade will beacquired by Prismo for a total consideration of $2,364,250 and will beacquired for investment purposes with a view to Blade's potentiallisting on a Canadian stock exchange.</span></p><p class=\"\"><span>Except as described in this news release, Prismo has nopresent plans or intentions that relate to or would result in any ofthe matters enumerated in paragraphs (a) through (k) of Item 5 of Form62-103F1. </span></p><p class=\"\"><span>Prismo will file an early warning report in accordancewith applicable securities laws, which will be available underBlade’s profile on SEDAR+ at www.sedarplus.ca . A copy ofthe early warning report may be obtained by contacting Gordon Aldcornat the contact details below. </span></p><p class=\"\"><span>About the Hot Breccia Project</span></p><p class=\"\"><span>The Hot Breccia project lies at the heart of theArizona Copper Belt, which hosts several globally significant porphyrycopper deposits.  Examples of these significant deposits are FreeportMcMoRan's Miami-Inspiration mining complex, BHP's San Manuelmine, Rio Tinto and BHP's Resolution deposit and others (seeFigure 1).  </span></p><p class=\"\"><span>Figure 1. Location of the Hot Breccia Project inthe Arizona Copper Belt.</span></p><p class=\"\"><span>Note that the Company and its qualified person have notbeen able to independently verify the information on these producingmines, and that the information is not necessarily indicative of themineralization on the Hot Breccia project.</span></p><p class=\"\"><span>About Prismo Metals Inc.</span></p><p class=\"\"><span>Prismo (CSE: PRIZ, OTCQB: PMOMF) is a miningexploration company focused on advancing its Silver King, Ripsey andHot Breccia projects in Arizona and its Palos Verdes silver project inMexico. </span></p><p class=\"\"><span>About Blade Resources Inc.</span></p><p class=\"\"><span>Blade Resources is a private mining exploration companyfocused on development of North American copper and precious metalsprojects.</span></p><p class=\"\"><span>Please follow @PrismoMetals on Twitter,Facebook, LinkedIn, Instagram, andYouTube</span></p><p class=\"\"><span>Prismo Metals Inc.</span></p><p class=\"\"><span>1100 - 1111 Melville St., Vancouver, British ColumbiaV6E 3V6  Phone: (416) 361-0737</span></p><p class=\"\"><span>Contact:</span></p><p class=\"\"><span>Alain Lambert, Chief Executive Officeralain.lambert@prismometals.com </span></p><p class=\"\"><span>Gordon Aldcorn, Presidentgordon.aldcorn@prismometals.com </span></p><p class=\"\"><span>Cautionary NoteRegarding Forward-Looking Information </span></p><p class=\"\"><span>This release includescertain statements and information that may constitute forward-lookinginformation within the meaning of applicable Canadian securities laws.Forward-looking information relates to future events or futureperformance and reflect the expectations or beliefs of management ofthe Company regarding future events. Generally, forward-lookingstatements and information can be identified by the use offorward-looking terminology such as “intends” or “anticipates”, or variations of suchwords and phrases or statements that certain actions, events orresults “may”, “could”, “should”, “would” or “occur”. This information and thesestatements, referred to herein as \"forward‐lookingstatements\", are not historical facts, are made as of the date ofthis news release and include without limitation, statements regardingdiscussions of future plans, estimates and forecasts and statements asto management's expectations and intentions with respect to,among other things: the anticipated closing and closing date of theTransaction; the strategic rationale and potential upside of thetransaction with Blade,  the future development of the Hot Brecciaproject and Blade’s ability of Blade to successfully implement itsstrategic and business objectives, including potentially attractingmajors or strategic buyers; and the ability of Prismo to fund itsexploration activities on its other projects.</span></p><p class=\"\"><span>Theseforward‐looking statements involve numerous risks and uncertainties,and actual results might differ materially from results suggested inany forward-looking statements. These risks and uncertainties include,among other things: that the Transaction may not close as anticipated,or at all; delays incurred by Blade in obtaining or failure to obtainappropriate funding to finance the exploration program at Hot Breccia;the inability of Blade to successfully acquire a 100% interest on theHot Breccia project; delays incurred by the Company in obtaining orfailure to obtain appropriate funding to finance exploration programsfor its other projects; the risk that mineralization will not be asanticipated at the Hot Breccia project or at the Company’s otherprojects; metal prices; market uncertainty; and other risks anduncertainties application to exploration activities and theCompany’s business as set forth in the Company’s disclosuredocuments available for viewing under the Company’s profile onSEDAR+ at www.sedarplus.com. </span></p><p class=\"\"><span>In making theforward-looking statements in this news release, the Company hasapplied several material assumptions, including without limitation,that: the timeline for closing the Transaction will be as anticipated;the Transaction will close; the ability to raise capital to fundexploration programs at Hot Breccia or on the Company’s otherprojects, and the timing of such exploration programs; the ability ofBlade to complete the option to acquire a 100% interest in the HotBreccia project and to successfully carry out its business andstrategic objectives following completion of the transaction; and thatthe Hot Breccia project and the Company’s other projects will havethe anticipated mineralization and other qualities.</span></p><p class=\"\"><span>Although managementof the Company has attempted to identify important factors that couldcause actual results to differ materially from those contained inforward-looking statements or forward-looking information, there maybe other factors that cause results not to be as anticipated,estimated or intended. There can be no assurance that such statementswill prove to be accurate, as actual results and future events coulddiffer materially from those anticipated in such statements.Accordingly, readers should not place undue reliance onforward-looking statements and forward-looking information. Readersare cautioned that reliance on such information may not be appropriatefor other purposes. The Company does not undertake to update anyforward-looking statement, forward-looking information orfinancial out-look that are incorporated by reference herein, exceptin accordance with applicable securities laws. We seek safeharbor.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw8QKCyy:0-prismo-metals-to-advance-hot-breccia-toward-drilling-through-strategic-transaction/",
            "pub_date": "2026-02-27 08:00:03",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S8N3YL05L:0",
            "title": "UK consumer morale unexpectedly dips to 3-month low in February, GfK survey shows",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    British consumer confidence unexpectedly fell to a three-month low in February, as rising unemployment increased people's worries about their personal financial situation, a long-running survey showed on Friday.</span></p><p class=\"\"><span>GfK's monthly Consumer Confidence Index sank to -19 in February from -16 in January, below all economists' forecasts in a Reuters poll that had pointed to a modest rise to -15.</span></p><p class=\"\"><span>\"This decline is mainly driven by weaker perceptions of personal finances,\" said GfK Consumer Insights Director Neil Bellamy. \"Unemployment has now reached its highest level in nearly five years, and this is increasing concerns about job security,\" he added.</span></p><p class=\"\"><span>Following are further details:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Consumers' assessment of their personal financial situation over the past 12 months and next 12 months, as well as their willingness to make major purchases, all dropped by 4 points </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Consumers' assessment of the general economic outlook for the next 12 months was unchanged</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Households' willingness to save dropped by 7 points</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Britain's household savings rate has remained unusually high since the COVID-19 pandemic and some economists think a fall here could boost domestic demand</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Official data last week showed the unemployment rate rose to 5.2% in the final quarter of 2025, its highest since the three months to January 2021</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Other data has shown stronger business activity and retail sales at the start of this year after a weak end to 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The GfK survey was based on 2,003 responses between February 2 and February 16</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S8N3YL05L:0-uk-consumer-morale-unexpectedly-dips-to-3-month-low-in-february-gfk-survey-shows/",
            "pub_date": "2026-02-27 08:01:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM122:0",
            "title": "UK car production drops in January as exports falter",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Britain's car production fell 8.2% to 65,249 units in January, as exports declined due to weak demand in key global markets, industry data showed on Friday. </span></p><p class=\"\"><span>Car exports from the UK fell 10.1% to 51,396 units during the month, marking a disappointing start to the year. </span></p><p class=\"\"><span>\"It reinforces the need for a forward-looking trade agenda that secures existing preferential access – notably with the biggest market on our doorstep, given protectionist ‘Made in Europe’ proposals – and builds new ones with markets worldwide,\" said Mike Hawes, CEO of the Society of Motor Manufacturers and Traders.</span></p><p class=\"\"><span>The EU, U.S. and China are among the biggest export destinations for British automobiles.   </span></p><p class=\"\"><span>Overall UK vehicle production, including that of commercial vehicles, fell 13.6% to 67,415 units, data from SMMT showed.</span></p><p class=\"\"><span>Commercial vehicle production extended its decline for the tenth straight month following a major plant restructuring, falling 68.6% to 2,166 units. </span></p><p class=\"\"><span>However, the latest independent outlook has reaffirmed prior expectations of overall UK car production growing to about 790,000 units in 2026, SMMT added.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM122:0-uk-car-production-drops-in-january-as-exports-falter/",
            "pub_date": "2026-02-27 08:01:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019177:0",
            "title": "U.K. Consumer Mood Darkens Amid Lingering Cost-Of-Living Squeeze",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Don Nico Forbes</span></p><p class=\"\"><span>U.K. consumer sentiment fell unexpectedly in February as cost-of-living pressures continue to weigh on households.</span></p><p class=\"\"><span>Consumer confidence fell three points to minus 19 in the month, according to research group GfK's index, published with the Nuremberg Institute for Market Decisions on Friday.</span></p><p class=\"\"><span>The result of the survey, which gauged sentiment of around 2,000 consumers, fell short of a consensus of economists polled by The Wall Street Journal, which had expected an improvement to minus 15.</span></p><p class=\"\"><span>\"This decline is mainly driven by weaker perceptions of personal finances--both looking back a year and ahead,\" said Neil Bellamy, consumer insights director at GfK.</span></p><p class=\"\"><span>Consumers in the U.K. continue to bear the brunt of a cost-of-living crisis gripping the country. While sentiment had begun to stabilize in recent months, February's reading shows the fragility of a recovery. Inflation is set to fall to target this year, but prices are in many cases still outpacing wage growth, leaving households hesitant to spend.</span></p><p class=\"\"><span>Economists also fear repeated trade shocks could leave scars on consumer sentiment. Uncertainty over prices is likely to continue this year after U.S. President Trump recently sidestepped a Supreme Court decision, which struck down his tariff agenda, by imposing a blanket 10% global tariff. This levy could be raised to 15% at any point in the next 150 days.</span></p><p class=\"\"><span>U.K. retail sales proved surprisingly strong in December and January. But as prices continue to rise, households are prioritizing day-to-day spending over major purchases, Bellamy said.</span></p><p class=\"\"><span>Unemployment concerns are also hitting confidence. The jobless rate reached its highest level in nearly five years in the final quarter of 2025, according to data published last week. GfK's employment expectations indicator fell on month in February.</span></p><p class=\"\"><span>\"Unemployment has now reached its highest level in nearly five years, and this is increasing concerns about job security, particularly given the backdrop of weak wage growth,\" Bellamy said.</span></p><p class=\"\"><span>On the bright side, a loosening labor market should support the call for interest-rate cuts at the Bank of England's upcoming meetings, which could support sentiment longer term.</span></p><p class=\"\"><span>Write to Don Nico Forbes at don.forbes@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019177:0/",
            "pub_date": "2026-02-27 08:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019181_20260226019181:0",
            "title": "Nikkei Stock Average Opens 0.25% Lower at 58606.03",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019181_20260226019181:0/",
            "pub_date": "2026-02-27 08:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2940428:0",
            "title": "CRNX: Strong PALSONIFY launch, robust cash, and advancing pipeline drive growth outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>2025 marked a pivotal year with the successful U.S. launch of PALSONIFY, strong early uptake, and expanding payer coverage. Robust financials, a $1.4B cash position, and advancing late-stage pipeline position the company for continued growth and innovation.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2940428:0-crnx-strong-palsonify-launch-robust-cash-and-advancing-pipeline-drive-growth-outlook/",
            "pub_date": "2026-02-27 07:51:56",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2940429:0",
            "title": "ICFI: 2026 outlook projects renewed growth, led by strong commercial energy and non-federal expansion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>2025 results were resilient despite federal headwinds, with non-federal revenues up 14% and commercial energy leading growth. 2026 guidance anticipates a return to revenue and EPS growth, driven by double-digit gains in non-federal segments and ongoing margin improvement.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2940429:0-icfi-2026-outlook-projects-renewed-growth-led-by-strong-commercial-energy-and-non-federal-expansion/",
            "pub_date": "2026-02-27 07:51:58",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013875:0",
            "title": "Redfin Will Display Compass's Exclusive Home Listings — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Nicole Friedman</span></p><p class=\"\"><span>Broker Redfin will now display information about Compass's exclusive home listings on its website, offering buyers their first chance to view these listings on a major real estate portal.</span></p><p class=\"\"><span>Compass, the biggest U.S. brokerage by sales volume, encourages many sellers to list their homes privately with a Compass agent before eventually advertising them widely. This strategy allows sellers to get feedback and adjust their listing price before going public, Compass says.</span></p><p class=\"\"><span>The practice has been hotly debated within the industry, with some of Compass's competitors arguing that sellers should always advertise their listings as widely as possible to reach more buyers and maximize their sales price. Most homes are listed using local real estate databases that distribute the listings to the major portals.</span></p><p class=\"\"><span>Under a new three-year agreement between Compass and Rocket, Compass's \"coming soon\" listings will be shown on Redfin starting immediately. Redfin has about 50 million monthly visitors, according to Rocket.</span></p><p class=\"\"><span>Those listings won't display days on market or price-cut history, and they will only be available on Compass websites and Redfin until the seller decides to advertise more widely. Redfin will also alert home shoppers when there are other private Compass listings that meet their search criteria, which they can view by contacting Compass.</span></p><p class=\"\"><span>Compass's agreement with Redfin is a sign that its push to make the exclusive listings more of an industry standard is gaining traction. Redfin for years opposed exclusive listings before being acquired by mortgage lender Rocket in July, but the company said its view on the matter has evolved.</span></p><p class=\"\"><span>The partnership includes all nine brokerage brands owned by Compass, including Coldwell Banker and Sotheby's International Realty. As part of the partnership, Redfin will direct some buyer leads to Compass agents. Rocket, one of the biggest U.S. mortgage lenders, will offer a discount to buyers who work with a Compass agent and take out a mortgage with Rocket.</span></p><p class=\"\"><span>\"It's all really focused around increasing inventory, which we know is key to stimulating the housing market,\" said Varun Krishna, Rocket's chief executive, in an interview.</span></p><p class=\"\"><span>The partnership is also part of Rocket's efforts to offer home buyers one-stop shopping, from searching for a home and securing a mortgage to closing the deal.</span></p><p class=\"\"><span>\"Compass represents brokerage, agents and inventory. Rocket represents mortgage, servicing and traffic,\" Krishna said. \"And we are putting all of those pieces together.\"</span></p><p class=\"\"><span>Compass agents will pay Rocket for leads, and Rocket will pay Compass an annual fee to have its mortgage-application process integrated into Compass's technology, according to a person familiar with the arrangement.</span></p><p class=\"\"><span>Redfin isn't paying Compass to display its exclusive listings, this person said.</span></p><p class=\"\"><span>The partnership sets Redfin apart from rival Zillow, which created a policy last year designed to discourage exclusive listings. Compass sued Zillow over this policy in June in a case that is ongoing.</span></p><p class=\"\"><span>Write to Nicole Friedman at nicole.friedman@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013875:0/",
            "pub_date": "2026-02-27 07:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019119_20260226019119:0",
            "title": "Light & Wonder Target Price Cut 4.3% to A$220.00/Share by Macquarie>LNW.AU",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019119_20260226019119:0/",
            "pub_date": "2026-02-27 07:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019103_20260226019122:0",
            "title": "Japan Cos Forecast Feb Indus Output -0.5% on Month",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019103_20260226019122:0/",
            "pub_date": "2026-02-27 07:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2940430:0",
            "title": "FIGR: Record Q4 growth with $2.7B loan volume, 51.6% EBITDA margin, and $200M buyback plan",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 saw record $2.7B loan volume (+131% YoY), $158M adjusted net revenue (+106% YoY), and $81.3M adjusted EBITDA (+426% YoY). Product mix is shifting toward first lien and auto loans, with a 3.5%-4% take rate outlook and a $200M share repurchase program announced.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2940430:0-figr-record-q4-growth-with-2-7b-loan-volume-51-6-ebitda-margin-and-200m-buyback-plan/",
            "pub_date": "2026-02-27 07:52:00",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2940431:0",
            "title": "PCRX: Record 2025 revenue and margins set the stage for steady growth and global expansion in 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>2025 saw record revenue and gross margins, driven by EXPAREL growth, expanded payer coverage, and strategic partnerships. 2026 guidance projects continued steady growth, with new pipeline milestones and ex-U.S. revenues expected in 2027.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2940431:0-pcrx-record-2025-revenue-and-margins-set-the-stage-for-steady-growth-and-global-expansion-in-2026/",
            "pub_date": "2026-02-27 07:52:02",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019126_20260226019126:0",
            "title": "Jumbo Interactive Target Price Cut 3.4% to A$14.10/Share by Macquarie>JIN.AU",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019126_20260226019126:0/",
            "pub_date": "2026-02-27 07:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019103_20260226019125:0",
            "title": "Japan Cos Forecast Mar Indus Output -2.6% on Month",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019103_20260226019125:0/",
            "pub_date": "2026-02-27 07:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019129_20260226019129:0",
            "title": "Growthpoint Target Price Raised 2.0% to A$2.58/Share by Macquarie>GOZ.AU",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019129_20260226019129:0/",
            "pub_date": "2026-02-27 07:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019131:0",
            "title": "Cohen & Steers Quality Income Realty Fund, Inc. (RQI) Notification of Sources of Distribution Under Section 19(a)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>NEW YORK, Feb. 26, 2026 /PRNewswire/ --This press release provides shareholders of Cohen &amp; Steers Quality Income Realty Fund, Inc. </span><span> (the \"Fund\") with information regarding the sources of the distribution to be paid on February 27, 2026 and cumulative distributions paid fiscal year-to-date.</span></p><p class=\"\"><span>In December 2012, the Fund implemented a managed distribution policy in accordance with exemptive relief issued by the Securities and Exchange Commission. The managed distribution policy seeks to deliver the Fund's long-term total return potential through regular monthly distributions declared at a fixed rate per common share. The policy gives the Fund greater flexibility to realize long-term capital gains throughout the year and to distribute those gains on a regular monthly basis to shareholders. The Board of Directors of the Fund may amend, terminate or suspend the managed distribution policy at any time, which could have an adverse effect on the market price of the Fund's shares.</span></p><p class=\"\"><span>The Fund's monthly distributions may include long-term capital gains, short-term capital gains, net investment income and/or return of capital for federal income tax purposes. Return of capital includes distributions paid by the Fund in excess of its net investment income and net realized capital gains and such excess is distributed from the Fund's assets. A return of capital is not taxable; rather, it reduces a shareholder's tax basis in his or her shares of the Fund. In addition, distributions from the Fund's investments in real estate investment trusts (REITs) may later be characterized as capital gains and/or a return of capital, depending on the character of the dividends reported to the Fund after year end by REITs held by the Fund. The amount of monthly distributions may vary depending on a number of factors, including changes in portfolio and market conditions.</span></p><p class=\"\"><span>At the time of each monthly distribution, information will be posted to cohenandsteers.com and mailed to shareholders in a concurrent notice. However, this information may change at the end of the year because the final tax characteristics of the Fund's distributions cannot be determined with certainty until after the end of the calendar year. Final tax characteristics of all of the Fund's distributions will be provided on Form 1099-DIV, which is mailed after the close of the calendar year.</span></p><p class=\"\"><span>The following table sets forth the estimated amounts of the current distribution and the cumulative distributions paid this fiscal year-to-date from the sources indicated. All amounts are expressed per common share.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>                                                        YEAR-TO-DATE (YTD) </span><br/><span>DISTRIBUTION ESTIMATES          February 2026            February 28, 2026* </span><br/><span>-------------------------  ------------------------  ------------------------- </span><br/><span>                           Per Share  % of Current   Per Share    % of 2026 </span><br/><span>Source                       Amount    Distribution    Amount    Distributions </span><br/><span>-------------------------  ---------  -------------  ---------  -------------- </span><br/><span>Net Investment Income       $0.0000      0.00 %       $0.0000       0.00 % </span><br/><span>-------------------------  ---------  -------------  ---------  -------------- </span><br/><span>Net Realized Short-Term </span><br/><span> Capital Gains              $0.0000      0.00 %       $0.0000       0.00 % </span><br/><span>-------------------------  ---------  -------------  ---------  -------------- </span><br/><span>Net Realized Long-Term </span><br/><span> Capital Gains              $0.0900     100.00 %      $0.1800      100.00 % </span><br/><span>-------------------------  ---------  -------------  ---------  -------------- </span><br/><span>Return of Capital (or </span><br/><span> other Capital Source)      $0.0000      0.00 %       $0.0000       0.00 % </span><br/><span>-------------------------  ---------  -------------  ---------  -------------- </span><br/><span>Total Current </span><br/><span> Distribution               $0.0900     100.00 %      $0.1800      100.00 % </span><br/><span>-------------------------  ---------  -------------  ---------  -------------- </span><br/><span> </span></pre><p class=\"\"><span>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution policy. The amounts and sources of distributions reported in this Notice are only estimates, are likely to change over time, and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The amounts and sources of distributions year-to-date may be subject to additional adjustments.</span></p><p class=\"\"><span>*THE FUND WILL SEND YOU A FORM 1099-DIV FOR THE CALENDAR YEAR THAT WILL TELL YOU HOW TO REPORT THESE DISTRIBUTIONS FOR FEDERAL INCOME TAX PURPOSES.</span></p><p class=\"\"><span>The Fund's Year-to-date Cumulative Total Return for fiscal year 2026 (January 1, 2026 through January 31, 2026) is set forth below. Shareholders should take note of the relationship between the Year-to-date Cumulative Total Return with the Fund's Cumulative Distribution Rate for 2026. In addition, the Fund's Average Annual Total Return for the five-year period ending January 31, 2026 is set forth below. Shareholders should note the relationship between the Average Annual Total Return with the Fund's Current Annualized Distribution Rate for 2026. The performance and distribution rate information disclosed in the table is based on the Fund's net asset value per share (NAV). The Fund's NAV is calculated as the total market value of all the securities and other assets held by the Fund minus the total liabilities, divided by the total number of shares outstanding. While NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's individual investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.</span></p><p class=\"\"><span>Fund Performance and Distribution Rate Information:</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>Year-to-date January 1, 2026 to January 31, 2026 </span><br/><span>--------------------------------------------------- </span><br/><span>Year-to-date Cumulative Total Return(1)      2.90 % </span><br/><span>-------------------------------------------  ------ </span><br/><span>Cumulative Distribution Rate(2)              1.46 % </span><br/><span>-------------------------------------------  ------ </span><br/><span> </span><br/><span>Five-year period ending January 31, 2026 </span><br/><span>--------------------------------------------------- </span><br/><span>Average Annual Total Return(3)               7.38 % </span><br/><span>-------------------------------------------  ------ </span><br/><span>Current Annualized Distribution Rate(4)      8.74 % </span><br/><span>-------------------------------------------  ------ </span><br/><span> </span><br/><span> </span><br/><span>1.  Year-to-date Cumulative Total Return is the percentage change in the </span><br/><span>    Fund's NAV over the year-to-date time period including distributions paid </span><br/><span>    and assuming reinvestment of those distributions. </span><br/><span>2.  Cumulative Distribution Rate for the Fund's current fiscal period (January </span><br/><span>    1, 2026 through February 28, 2026) measured on the dollar value of </span><br/><span>    distributions in the year-to-date period as a percentage of the Fund's NAV </span><br/><span>    as of January 31, 2026. </span><br/><span>3.  Average Annual Total Return represents the compound average of the Annual </span><br/><span>    NAV Total Returns of the Fund for the five-year period ending January 31, </span><br/><span>    2026. Annual NAV Total Return is the percentage change in the Fund's NAV </span><br/><span>    over a year including distributions paid and assuming reinvestment of </span><br/><span>    those distributions. </span><br/><span>4.  The Current Annualized Distribution Rate is the current fiscal period's </span><br/><span>    distribution rate annualized as a percentage of the Fund's NAV as of </span><br/><span>    January 31, 2026. </span><br/><span> </span></pre><p class=\"\"><span>Investors should consider the investment objectives, risks, charges and expense of the Fund carefully before investing. You can obtain the Fund's most recent periodic reports, when available, and other regulatory filings by contacting your financial advisor or visiting cohenandsteers.com. These reports and other filings can be found on the Securities and Exchange Commission's EDGAR Database. You should read these reports and other filings carefully before investing.</span></p><p class=\"\"><span>Shareholders should not use the information provided here in preparing their tax returns. Shareholders will receive a Form 1099-DIV for the calendar year indicating how to report Fund distributions for federal income tax purposes.</span></p><p class=\"\"><span>About Cohen &amp; Steers. Cohen &amp; Steers is a leading global investment manager specializing in real assets and alternative income, including listed and private real estate, preferred securities, infrastructure, resource equities, commodities, as well as multi-strategy solutions. Founded in 1986, the firm is headquartered in New York City, with offices in London, Dublin, Hong Kong, Tokyo and Singapore.</span></p><p class=\"\"><span>Forward-Looking Statements</span></p><p class=\"\"><span>This press release and other statements that Cohen &amp; Steers may make may contain forward looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, which reflect the company's current views with respect to, among other things, its operations and financial performance. You can identify these forward-looking statements by the use of words such as \"outlook,\" \"believes,\" \"expects,\" \"potential,\" \"continues,\" \"may,\" \"will, \" \"should,\" \"seeks,\" \"approximately,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates,\" or the negative versions of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties.</span></p><p class=\"\"><span>Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. The company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise.</span></p><p class=\"\"><span>Website: https://www.cohenandsteers.com</span></p><p class=\"\"><span>Symbol: </span></p><p class=\"\"><span>View original content:https://www.prnewswire.com/news-releases/cohen--steers-quality-income-realty-fund-inc-rqi-notification-of-sources-of-distribution-under-section-19a-302699119.html</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019131:0/",
            "pub_date": "2026-02-27 07:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019136:0",
            "title": "Gold Edges Higher as Traders Digest U.S.-Iran Talks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Gold edges higher in the early morning Asian session as traders digest U.S.-Iran talks held overnight. The latest round of talks over Iran's nuclear program ended Thursday without a deal and both sides remained far apart on key issues. The U.S. increased pressure by presenting tough demands and sending more jets and warships to the region. Continuing tensions in the Middle East and Eastern Europe fuel risk aversion, FXEM's Abdelaziz Albogdady says in an email. This could direct investment flows toward the precious metal, he adds. Spot gold is 0.1% higher at $5,185.27/oz. (ronnie.harui@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019136:0/",
            "pub_date": "2026-02-27 07:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019135_20260226019135:0",
            "title": "Art Group Guides for Swing to 6-Mos Loss on Credit Loss on Rental Deposits, Absence of One-Off Gain",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019135_20260226019135:0/",
            "pub_date": "2026-02-27 07:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:cf65814c23908:0",
            "title": "JAPAN FEB TOKYO CORE-CORE CPI +2.5% Y/Y; JAN +2.4%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:cf65814c23908:0-japan-feb-tokyo-core-core-cpi-2-5-y-y-jan-2-4/",
            "pub_date": "2026-02-27 07:47:56",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:a63b53163315e:0",
            "title": "JAPAN FEB SERVICES PRICES +1.5% Y/Y; JAN +1.4%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:a63b53163315e:0-japan-feb-services-prices-1-5-y-y-jan-1-4/",
            "pub_date": "2026-02-27 07:47:56",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019093:0",
            "title": "Lithium Royalty Corp. Shareholders Approve Arrangement with Altius Minerals Corporation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>TORONTO, Feb. 26, 2026 /CNW/ - Lithium Royalty Corp. (the \"Company\" or \"LRC\") </span><span> is pleased to announce that at a special meeting of shareholders held earlier today (the \"Meeting\"), shareholders of the Company (\"Shareholders\") voted overwhelmingly in favour of the special resolution (the \"Arrangement Resolution\") approving the previously announced plan of arrangement under the Canada Business Corporations Act (the \"Arrangement\"), whereby Altius Minerals Corporation (\"Altius\") will acquire all of the outstanding common shares and convertible common shares of LRC, for a choice of consideration per share of either, (i) 0.240 common shares of Altius, (ii) C$9.50 in cash or (iii) if no choice is made, 0.160 common shares of Altius and C$3.166666 in cash, in each case subject to pro-ration.</span></p><p class=\"\"><span>In order to be passed, the Arrangement Resolution required approval of (i) at least two-thirds of the votes cast by Shareholders present in-person or by proxy at the Meeting, and (ii) a majority of the votes cast by holders of common shares present in-person or by proxy at the Meeting, excluding votes from certain Shareholders as required under Multilateral Instrument 61-101 — Protection of Minority Security Holders in Special Transactions (the \"Minority Approval\"). Detailed voting results for the Arrangement Resolution, with over 96% of shares having been voted, are as follows:</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>                    Votes For   %         Votes Against  % </span><br/><span>                    ----------  --------  -------------  ------- </span><br/><span>All Shareholders    52,606,530  99.806 %        102,500  0.194 % </span><br/><span>Minority Approval   21,469,224  99.525 %        102,500  0.475 % </span><br/><span> </span></pre><p class=\"\"><span>For additional details of the voting results on the Arrangement Resolution, see the Company's Report of Voting Results to be filed pursuant to Section 11.3 of National Instrument 51-102 — Continuous Disclosure Obligations filed under its issuer profile on SEDAR+ at www.sedarplus.ca.</span></p><p class=\"\"><span>Consideration Election Update</span></p><p class=\"\"><span>Under the terms of the Arrangement, registered Shareholders were able to elect their choice of consideration described above prior to 5:00 p.m. (Toronto time) on February 24, 2026. Based on preliminary data, the aggregate consideration to be paid by Altius to Shareholders will consist of approximately 9.63 million common shares of Altius and cash of approximately C$140 million. We anticipate that no Shareholder who elected to receive all-share or all-cash consideration will have its election pro-rated.</span></p><p class=\"\"><span>Court Approval and Anticipated Closing Date</span></p><p class=\"\"><span>Subject to the granting of the final order (the \"Final Order\") by the Ontario Superior Court of Justice (Commercial List) (the \"Court\") and the satisfaction or waiver of certain other customary closing conditions in the arrangement agreement dated December 21, 2025 among the Company and Altius (the \"Arrangement Agreement\"), the parties currently anticipate that the closing of the Arrangement will occur on or about March 6, 2026. The hearing in respect of the Final Order is scheduled to take place on Tuesday, March 3, 2026 at 10:30 a.m. (Toronto time), or as soon after such time as counsel may be heard, by videoconference.</span></p><p class=\"\"><span>Action by Registered Shareholders</span></p><p class=\"\"><span>In order to receive the consideration from Altius, registered Shareholders who have not already done so must complete the letter of transmittal previously mailed to them (which is also available on the Company's website at www.lithiumroyaltycorp.com and under its issuer profile on SEDAR+ at www.sedarplus.com) and return it, together with the certificates or DRS advices representing their shares and any other required documents and instruments, in accordance with the procedures set out in the letter of transmittal. These Shareholders will receive per share the default consideration 0.160 common shares of Altius and cash of C$3.166666.</span></p><p class=\"\"><span>About Lithium Royalty Corp.</span></p><p class=\"\"><span>LRC is a lithium-focused royalty company organized in Canada, which has established a globally diversified portfolio of 38 royalties on mineral properties that are related to the electrification and decarbonization of the global economy. The Company's royalty portfolio is focused on the battery supply chain for the transportation and energy storage industries and is underpinned by mineral properties that produce or are expected to produce lithium, critical minerals, and other energy transition materials.</span></p><p class=\"\"><span>Forward Looking Statements</span></p><p class=\"\"><span>This press release contains \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable Canadian securities laws, which may include, but are not limited to, statements with respect to the proposed Arrangement, closing of the proposed Arrangement, the timing of various steps to be completed in connection with the Arrangement, including the timing and effects of the Arrangement, the ability of Shareholders to choose their form of consideration and potential pro-ration and the ability of the parties to satisfy the other conditions to the closing of the Arrangement. Often, but not always, forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budgets\", \"potential for\", \"scheduled\", \"estimates\", \"forecasts\", \"predicts\", \"projects\", \"intends\", \"targets\", \"aims\", \"anticipates\" or \"believes\" or variations (including negative variations) of such words and phrases or may be identified by statements to the effect that certain actions \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Forward-looking statements involve known and unknown risks, uncertainties and other factors, which may cause the actual results, performance or achievements of LRC to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Forward-looking information is based on management's beliefs and assumptions and on information currently available to management. The forward-looking statements herein are made as of the date of this press release only and LRC does not assume any obligation to update or revise them to reflect new information, estimates or opinions, future events or results or otherwise, except as required by applicable law.</span></p><p class=\"\"><span>A number of risks could cause actual events or results to differ materially from any forward-looking statement, including, without limitation: the possibility that the Arrangement will not be completed on the terms and conditions, or on the timing, currently contemplated, and that it may not be completed at all due to a failure to obtain or satisfy, in a timely manner or otherwise, required Shareholder and Court approvals and other conditions of closing necessary to complete the Arrangement or for other reasons; the possibility of adverse reactions or changes in business relationships resulting from the announcement or completion of the Arrangement; risks relating to the retention of key personnel during the interim period; the possibility of litigation relating to the Arrangement; risks related to the diversion of management's attention from the Company's ongoing business operations; and the other risk factors disclosed in the Company's most recent Annual Information Form and Management's Discussion &amp; Analysis filed with the Canadian securities regulatory authorities on www.sedarplus.ca. The forward-looking statements contained in this press release are based upon assumptions management believes to be reasonable, including, without limitation: that the Arrangement will be well-received by Shareholders and other market participants, that the Company will be able to achieve the expected timeline, that approvals will be forthcoming without challenge and on a timely basis, that the Company will comply with its obligations under the Arrangement Agreement and that no material adverse effect will occur with respect to the Company or Altius. Investors are cautioned that forward-looking statements are not guarantees of future performance. LRC cannot assure investors that actual results will be consistent with these forward-looking statements. Accordingly, investors should not place undue reliance on forward-looking statements due to the inherent uncertainty therein.</span></p><p class=\"\"><span>SOURCE Lithium Royalty Corp.</span></p><p class=\"\"><span>/CONTACT:</span></p><p class=\"\"><span>Copyright CNW Group 2026</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019093:0/",
            "pub_date": "2026-02-27 07:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019096_20260226019096:0",
            "title": "IDP Education Target Price Cut 8.9% to A$5.45/Share by Macquarie>IEL.AU",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019096_20260226019096:0/",
            "pub_date": "2026-02-27 07:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}