{
    "data": [
        {
            "id": "DJN_DN20260301000555_20260301000556:0",
            "title": "Powerlong: Cai Erchao Has Been Appointed as CEO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000555_20260301000556:0/",
            "pub_date": "2026-03-01 21:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000555_20260301000555:0",
            "title": "Powerlong Commercial Management: Xu Meng Has Tendered Resignation as CEO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000555_20260301000555:0/",
            "pub_date": "2026-03-01 21:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_ACN105366:0",
            "title": "Unisound U1-OCR: The First Industrial-Grade Document Intelligence Foundation Model, Ushering in the OCR 3.0 Era",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>BEIJING, Feb 28, 2026 - (ACN Newswire) - Feb 26, Unisound has officially launched its Unisound U1-OCR, the world's first industrial-grade foundation model for document intelligence, a groundbreaking release that ushers in the OCR 3.0 era and sets a new industry standard with five core strengths: SOTA performance, verifiable results, out-of-the-box functionality, efficient deployment, and robust adaptability.</span></p><p class=\"\"><span>Document intelligence leverages AI to automatically read, understand, classify digitized documents and extract key information. OCR 1.0 only enabled basic text recognition, while OCR 2.0 added preliminary layout understanding capabilities. U1-OCR takes a quantum leap to OCR 3.0, moving far beyond layout recognition to deliver deep semantic insight, automatic document classification and business-level information extraction-marking a transformative shift from \"character perception\" to \"document cognition\".</span></p><p class=\"\"><span>As a SOTA-level document intelligence model, U1-OCR resolves the longstanding bottleneck of traditional models that \"recognize text but fail to grasp layout\", enabling it to interpret complex documents like human experts. It pioneers a \"semantic-driven + dynamic focus\" strategy, first mapping a document's hierarchical structure of headings and structural metadata before extracting content on demand, and builds a semantic map to identify the relationship between titles, charts and text-even in disorganized layouts. Its enhanced spatial alignment module leverages positional data to accurately restore document structure for dense tables and mixed text-image content, effectively mitigating spatial recognition errors. Equipped with Multi-Token Prediction technology and full-task reinforcement learning, it boosts reasoning efficiency by over 80%, ensuring logical coherence for long documents.</span></p><p class=\"\"><span>Trained with multi-task collaborative reinforcement learning and optimized for both semantics and coordinates, U1-OCR suppresses spatial hallucinations for reliable outputs, and achieves SOTA results across major authoritative benchmarks: scoring 95.1 in OmniDocBench V1.5, outperforming leading models like GLM-OCR and Gemini-3-Pro; hitting an F1 score of 90.8 in D4LA and 95.9 in DocLayNet, excelling in table recognition and cross-page association; and outperforming models such as Gemini-2.5-Flash and Qwen-2.5-VL in internal business tests, with standout performance in medical document processing such as admission and discharge records.</span></p><p class=\"\"><span>Figure: Comparison of Unisound U1-OCR Evaluation Scores on OmniDocBench V1.5</span></p><p class=\"\"><span>Built for real-world industrial applications, U1-OCR features four key capabilities that bridge the gap between document understanding and business action. Its proprietary \"coordinate-text-semantics\" architecture enables pixel-level positioning and full evidence traceability, making audit processes transparent and efficient. Integrated with Unisound's industry expertise in healthcare and finance, it achieves over 99% classification accuracy for more than 50 common business documents, supporting cross-field logical verification with zero-shot capabilities. It supports private on-premise and offline deployment while delivering highly efficient document processing, meeting strict data privacy requirements for government, healthcare, and finance sectors while lowering hardware costs. Most notably, it delivers stable, high-precision performance in extreme scenarios-including non-standard photos, blurred documents, complex formatting and multilingual text-freeing businesses from reliance on standardized document formats.</span></p><p class=\"\"><span>Validated in real-world use cases, U1-OCR enables visual traceability of extracted information, automatic classification of mixed documents, performing intelligent image purification for cluttered layouts, and accurate recognition of complex nested tables with full structural retention.</span></p><p class=\"\"><span>The launch of U1-OCR marks AI's evolution from simple text recognition to business logic comprehension, a key step for Unisound toward AGI. By taking multimodal documents as a knowledge entry point, Unisound is empowering machines with autonomous reasoning and evidence traceability capabilities, driving AI from perceptual intelligence to cognitive intelligence-with the vision to build a general intelligent agent that reads, thinks and solves complex problems like humans, turning every document into a stepping stone to AGI.</span></p><p class=\"\"><span>CONTACT: june@intelligentjoy.com</span></p><p class=\"\"><span>Source: UNISOUND AI TECHNOLOGY CO., LTD</span></p><p class=\"\"><span>Copyright 2026 ACN Newswire . All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_ACN105366:0-unisound-u1-ocr-the-first-industrial-grade-document-intelligence-foundation-model-ushering-in-the-ocr-3-0-era/",
            "pub_date": "2026-03-01 20:51:40",
            "source": "Asian Corporate Newswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_ACN105370:0",
            "title": "CALB (3931.HK) Announced a Positive Profit Alert",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>HONG KONG, Feb 28, 2026 - (ACN Newswire) - CALB Group Co., Ltd. (\"CALB\" or \"the Company,\" stock code: 3931.HK) published a positive profit announcement. The Company is expected to record a net profit ranging from approximately RMB2,025 million to RMB2,193 million for the year ended 31 December 2025, representing an increase ranging from approximately 140% to 160% as compared to the net profit of RMB844 million for the same period last year. The expected growth is primarily driven by the continuous high growth of leading-edge technology products across business sectors, including passenger applications and commercial applications as well as ESS cells.</span></p><p class=\"\"><span>CALB stated that, the Company adheres to a dual-drive strategy focusing on EV and ESS while actively promoting its global expansion. In 2025, all business segments of the Company achieved rapid growth, with both EV and ESS businesses ranking among the global top four, continuously increasing market share, and further solidifying its position as a leading industry player. In the power battery sector, leveraging its exceptional product capabilities, CALB successfully secured orders from multiple leading international automakers and achieved remarkable growth in the high-end passenger vehicle market. Delivery volumes for commercial vehicle power batteries saw dramatic growth, significantly exceeding expectations, and the successful strategic deployment in the commercial vehicle, including heavy trucks, further strengthened the Company's competitive advantage in the market. The ESS cells sector also maintained strong momentum, with cell shipments again achieving multiple-fold growth and securing several benchmark projects in key global markets. In response to accelerating global expansion and rapidly growing customer demand, the Company has been swiftly implementing a new round of capacity planning, providing robust support for its global delivery capabilities. The substantial business expansion and the deepening of the Company's global footprint were the key drivers behind the significant revenue growth.</span></p><p class=\"\"><span>As a battery expert, CALB has been adhering to the philosophy of technological innovation, maintaining its leading position in both product and technology. During the year, the Company maintained its leadership in cutting-edge battery technology with the 'UP' battery. Its 5C super-charged LFP battery successfully supported XPeng's entire new vehicle lineup. The 400Wh/kg semi-solid battery has entered the vehicle trial phase. The all-solid-state battery has achieved superior performance, with the commissioning of a dedicated production line. The high-power LFP R46 cylindrical cell achieved mass production for PHEV models. The 314Ah Gen2 long-cycle ESS cells, with its ultra-long service life of 15,000 cycles, has earned high recognition from global customers. The next-generation \"ZHIJIU\" of 588Ah and 600Ah+ large ESS cells have successfully entered the mass production stage. Concurrently, the Company has actively been exploring emerging markets. Leveraging its technological platform, CALB has achieved mass production of its high energy density, high-safety high-nickel cylindrical battery for leading eVTOL models, while simultaneously expanding the application of its all-solid-state battery into the robotics and eVTOL sectors.With a global footprint and a steadfast commitment to innovation-led growth, CALB has built an all-scenario business layout, injecting strong momentum for sustained future profit growth.</span></p><p class=\"\"><span>About CALB</span></p><p class=\"\"><span>CALB is a new energy enterprise specializing in the research, production, sales, and market application development of lithium batteries, battery management systems, and related integrated products and lithium battery materials. As Battery Expert, we aim to build a comprehensive energy operation system, to provide complete product solutions and full life-cycle management for the new energy application market, represented by power and energy storage.</span></p><p class=\"\"><span>Currently, CALB has completed an all-round layout in domestic by setting up industrial bases in Changzhou, Xiamen, Wuhan, Chengdu, Hefei, Jiangmen and Meishan. Meanwhile, CALB has set up bases in Europe and ASEAN, vigorously expanding the layout all over the world to become a global leading enterprise with large-scale intelligent manufacturing capabilities.</span></p><p class=\"\"><span>Source: CALB Group Co Ltd</span></p><p class=\"\"><span>Copyright 2026 ACN Newswire . All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_ACN105370:0-calb-3931-hk-announced-a-positive-profit-alert/",
            "pub_date": "2026-03-01 20:51:40",
            "source": "Asian Corporate Newswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZP025:0",
            "title": "Investors seek harbour in gold as US and Israel strike Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Anmol Choubey and Anushree Mukherjee</span></p><p class=\"\"><span>The </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/iran-crisis-live-explosions-tehran-israel-announces-strike-2026-02-28/\" rel=\"nofollow\" target=\"_blank\">U.S. and Israeli strikes on Iran</a><span> have intensified uncertainty across global markets, with investors closely watching potential safe-haven flows into bullion. Here is some reaction from investors, traders and analysts:</span></p><p class=\"\"><span>EDWARD MEIR, ANALYST AT MAREX</span></p><p class=\"\"><span>    \"I think you’re going to see a knee jerk spike up in most commodity markets, including gold and oil. This will be a natural response to the outbreak of hostilities, which was rather unexpected in terms of scale and scope.”</span></p><p class=\"\"><span>\"I think we could open up by about $200/ounce on gold, but then drift lower over the course of the day. The markets are rather dispassionate when it comes to military conflicts; the only thing investors are ultimately focused on is whether the oil flows will be interrupted so once the initial spike is over, the initial rally tends to fade.”  </span></p><p class=\"\"><span>HUGO PASCAL, A PRECIOUS METALS TRADER AT INPROVED</span></p><p class=\"\"><span>\"With traditional exchanges closed, tokenised gold is currently trading at a premium, signalling a bullish 'flight to safety' ahead of the week's open. Our digital proxies are showing a strong weekend bid.\"</span></p><p class=\"\"><span>     \"PAX Gold (PAXG) is currently leading the charge at $5,344/oz (+2.2% since Friday), while Tether Gold (XAUt) has climbed to $5,292/oz (+1.2%).\"</span></p><p class=\"\"><span>However, \"that weekend proxy premiums often overstate the initial gap but accurately reflect the direction\".</span></p><p class=\"\"><span>    TIM WATERER, CHIEF MARKET ANALYST AT KCM TRADE</span></p><p class=\"\"><span>\"Gold is likely to be in higher demand than usual when markets open on Monday. Given the risks regarding how long the conflict may last, which other nations could be dragged in, and inflation fears, gold is expected to assume its mantle as the safe haven asset of choice.\"</span></p><p class=\"\"><span>\"Stock markets and other risk assets will probably be sold off and investors will be looking for the best place to park their funds, and gold will likely be atop that list.\"</span></p><p class=\"\"><span>    FAWAD RAZAQZADA, MARKET ANALYST AT CITY INDEX AND FOREX.COM</span></p><p class=\"\"><span>\"There will be extra haven demand for gold which could see prices rise to around $5,500 again, and possibly a new record high above January's peak of around $5,600.\"</span></p><p class=\"\"><span>\"However, gold's gains beyond that level could be capped by a potential rebound in the U.S. dollar, especially if crude oil stays sharply higher.\"</span></p><p class=\"\"><span>    TAI WONG, AN INDEPENDENT METALS TRADER</span></p><p class=\"\"><span>\"I think gold and silver could sell off 'on the fact' on the open but any significant sell off will find buyers as the picture in Iran will unlikely be clear for weeks to months.\"</span></p><p class=\"\"><span>\"I think a U.S. attack has been priced in but the timing was a bit uncertain. It's certainly in the oil market. And the fact that crypto is higher might be a harbinger.\"</span></p><p class=\"\"><span>    ANZ ANALYST SONI KUMARI</span></p><p class=\"\"><span>\"Tomorrow, the price reaction will be positive initially, though there could be some retracement later in the session depending on how events unfold.\" </span></p><p class=\"\"><span>\"Our overall view has not changed, we remain positive on gold ... Geopolitics has been very different this year, with tensions more intense, and after this attack there could also be macro implications, especially if oil prices rise sharply.\"</span></p><p class=\"\"><span>JOSHUA ROTBART, FOUNDER AND MANAGING PARTNER AT J. ROTBART &amp; CO</span></p><p class=\"\"><span>\"It is safe to assume that precious metals will experience enhanced volatility with upward movement.\"</span></p><p class=\"\"><span>\"As the risk of a war with Iran was somewhat priced in the rally gold price had already, the extent of the movement will depend on the effect the conflict will have on the energy market, and on whether regime change in Iran is within reach.\"</span></p><p class=\"\"><span>    OLE HANSEN, HEAD OF COMMODITY STRATEGY AT SAXO BANK</span></p><p class=\"\"><span>\"There is no doubt this is a worrying escalation and one that will drive investors into precious metals and the energy sector. How big the impact will be is anyone's guess but given last week's momentum I would not be surprised if gold prints a fresh record high.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZP025:0-investors-seek-harbour-in-gold-as-us-and-israel-strike-iran/",
            "pub_date": "2026-03-01 20:52:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0C6:0",
            "title": "Aslak Updates On SpA For Acquiring 40% Of Al Raeda Industrial Investment Co",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>UNITED WIRE FACTORIES COMPANY (ASLAK) </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>UPDATES ON SPA FOR ACQUIRING 40% OF OF AL RAEDA INDUSTRIAL INVESTMENT CO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ISSUANCE OF A NON-OBJECTION CERTIFICATE BY GAC ON COMPLETING ECONOMIC CONCENTRATION RESULTING FROM ACQUISITION TRANSACTION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0C6:0-aslak-updates-on-spa-for-acquiring-40-of-al-raeda-industrial-investment-co/",
            "pub_date": "2026-03-01 20:54:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0C5:0",
            "title": "Ma’Aden Appoints Gilberto Antoniazzi As CFO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SAUDI ARABIAN MINING </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MA’ADEN - ANNOUNCES APPOINTMENT OF CFO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MA’ADEN - APPOINTS GILBERTO ANTONIAZZI AS CFO</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0C5:0-ma-aden-appoints-gilberto-antoniazzi-as-cfo/",
            "pub_date": "2026-03-01 20:38:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000531_20260301000531:0",
            "title": "Mokingran Jewellery Group Guides for Rise in FY Revenue, Drop in Net Profit",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000531_20260301000531:0/",
            "pub_date": "2026-03-01 20:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000531_20260301000532:0",
            "title": "Mokingran Jewellery: Growth Primarily Driven by Refinement of Overseas Footprint, Regional Market Expansion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000531_20260301000532:0/",
            "pub_date": "2026-03-01 20:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00X:0",
            "title": "Gulf International Chemicals FY Dividend 3.9 Baizas Per Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>GULF INTERNATIONAL CHEMICALS (GICI.OM):</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GULF INTERNATIONAL CHEMICALS FY CASH DIVIDEND 3.9 BAIZAS PER SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00X:0-gulf-international-chemicals-fy-dividend-3-9-baizas-per-share/",
            "pub_date": "2026-03-01 20:43:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZP04X:0",
            "title": "BYD February vehicle sales fall at steepest pace since pandemic",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Chinese electric vehicle maker BYD </span><span> recorded the biggest fall in global sales in six years last month against a backdrop of fierce competition in the world's largest auto market.</span></p><p class=\"\"><span>BYD's February sales dropped 41.1% from a year earlier, the sixth consecutive month of decline, according to a stock market filing on Sunday. The fall last month was the biggest since February 2020 when the economy was hit by the COVID-19 pandemic.</span></p><p class=\"\"><span>Car sales and other economic indicators tend to show big swings in the first two months due to the timing of Lunar New Year, which could be particularly notable this year as China extended the annual holiday to a record-breaking nine days.</span></p><p class=\"\"><span>But BYD's sales downtrend goes beyond seasonal factors. Its sales were down 35.8% year-on-year globally in the first two months, the biggest drop during the period since 2020.</span></p><p class=\"\"><span>While its overseas shipments maintained robust growth from the year before, at 100,600 vehicles in February, sales in the home market fell 65% to 89,590 vehicles, worsening from a 53.2% drop in January when Geely </span><span> unseated BYD as the top carmaker in China.</span></p><p class=\"\"><span>To fend off competition, BYD has joined other domestic and foreign peers in launching a seven-year low-interest financing plan that was first introduced by Tesla </span><span> in January.</span></p><p class=\"\"><span>Under pressure from a narrowing technology gap, BYD is expected to roll out major tech innovations later this month.</span></p><p class=\"\"><span>Bruising competition has prompted Chinese regulators to introduce new pricing rules and tighten oversight of new cars exported as used vehicles, as part of efforts to shift the auto sector's focus to value-based competition.</span></p><p class=\"\"><span>The biggest Chinese rival to Tesla has also led a push into overseas markets to offset domestic challenges.</span></p><p class=\"\"><span>BYD and Geely are among the finalists bidding to buy a Nissan-Mercedes-Benz plant in Mexico, Reuters reported last month.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZP04X:0-byd-february-vehicle-sales-fall-at-steepest-pace-since-pandemic/",
            "pub_date": "2026-03-01 20:45:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000519_20260301000528:0",
            "title": "Xinyi Glass Optimistic About Automobile Glass Aftermarket, OEM Business as Number of Vehicles Globally Rises in 2026 >0868.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000519_20260301000528:0/",
            "pub_date": "2026-03-01 20:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZP04X:0",
            "title": "Oil jumps 10% on Iran conflict and could spike to $100 a barrel, analysts say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Brent jumps to $80 a barrel in over-the-counter trade</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Gulf oil flows disrupted after US and Israeli attacks on Iran</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>OPEC+ agrees to raise output by 206,000 bpd</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Saudi Arabia and UAE raise exports, sources say</span></li></ul></span></div><span><p class=\"\"><span>By Seher Dareen and Dmitry Zhdannikov</span></p><p class=\"\"><span>    Brent crude jumped 10% to about $80 a barrel over the counter on Sunday, oil traders said, while analysts predicted that prices could climb as high as $100 after U.S. and Israeli strikes on Iran plunged the Middle East into a new war.</span></p><p class=\"\"><span>\"While the military attacks are themselves supportive for oil prices, the key factor here is the closing of the Strait of Hormuz,\" said Ajay Parmar, director of energy and refining at ICIS.</span></p><p class=\"\"><span>Most tanker owners, oil majors and trading houses have suspended crude oil, fuel and liquefied natural gas shipments via the Strait of Hormuz, trade sources said, after Tehran warned ships against moving through the waterway. More than 20% of global oil is moved through the Strait of Hormuz.</span></p><p class=\"\"><span>\"We expect prices to open (after the weekend) much closer to $100 a barrel and perhaps exceed that level if we see a prolonged outage of the Strait,\" Parmar said. </span></p><p class=\"\"><span>Middle East leaders have warned Washington that a war on Iran could lead to oil prices jumping to more than $100 a barrel, said RBC analyst Helima Croft. Barclays analysts also said prices could hit $100.</span></p><p class=\"\"><span>The OPEC+ group of oil producers agreed on Sunday to raise output by 206,000 barrels per day (bpd) from April, a modest increase representing less than 0.2% of global demand.</span></p><p class=\"\"><span>While some alternate infrastructure could be used to bypass the Strait of Hormuz, the net impact from its closure would be a loss of 8 million to 10 million bpd of crude oil supply even after diverting some flows through Saudi Arabia's East-West pipeline and Abu Dhabi pipeline, said Rystad energy economist Jorge Leon. </span></p><p class=\"\"><span>Rystad expects prices to rise by $20 to about $92 a barrel when trade opens.</span></p><p class=\"\"><span>The Iran crisis also prompted Asian governments and refiners to assess oil stockpiles and alternative shipping routes and supplies.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZP04X:0-oil-jumps-10-on-iran-conflict-and-could-spike-to-100-a-barrel-analysts-say/",
            "pub_date": "2026-03-01 20:40:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000519_20260301000520:0",
            "title": "Xinyi Glass FY Net CNY2.73B Vs. Net CNY3.37B >0868.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000519_20260301000520:0/",
            "pub_date": "2026-03-01 20:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000519_20260301000521:0",
            "title": "Xinyi Glass Declares Dividend of HK$0.215 Vs. HK$0.10 >0868.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000519_20260301000521:0/",
            "pub_date": "2026-03-01 20:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000519_20260301000524:0",
            "title": "Xinyi Glass: Products Faced Headwinds From Factors Like U.S. Tariffs, High Rates, China Anti-Involution >0868.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000519_20260301000524:0/",
            "pub_date": "2026-03-01 20:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZP08O:0",
            "title": "Three dead, 14 injured after shooting in Austin, Texas",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>At least three people died and 14 were injured following a mass shooting at a bar in Austin, Texas, early on Sunday, police said.</span></p><p class=\"\"><span>The suspect was killed in an exchange of fire with police at the scene, police said, adding that 14 people were in hospital, three of whom were in a critical condition.</span></p><p class=\"\"><span>Police did not release the identity of the shooter or make any comment on the shooter's motive.</span></p><p class=\"\"><span>Mass shootings in the United States, which has some of the most permissive gun laws in the developed world, are more common than in most other countries.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZP08O:0-three-dead-14-injured-after-shooting-in-austin-texas/",
            "pub_date": "2026-03-01 20:34:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000519_20260301000527:0",
            "title": "Xinyi Glass: Selling Prices of Float Glass Products, Sales of Architectural Glass Products Fell in China and Overseas >0868.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000519_20260301000527:0/",
            "pub_date": "2026-03-01 20:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000519_20260301000519:0",
            "title": "Xinyi Glass FY Rev CNY20.83B Vs. CNY22.32B >0868.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000519_20260301000519:0/",
            "pub_date": "2026-03-01 20:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_Zaw25t7Kj:0",
            "title": "ZAWYA-PRESSR: Vivienda Developments launches 2nd phase of JAÉN Villas in West Cairo after the first phase sells out",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Vivienda Developments, a subsidiary of AM Group, has announced the launch of the second phase of its residential project, JAÉN, in west Cairo, following strong demand and the complete sell-out of the first phase in record time, reflecting customer confidence and robust interest in the project.</span></p><p class=\"\"><span>JAÉN is strategically located in New Zayed – Green Belt – Basin 8, spanning over a total area of 10 feddans, with total investments of EGP 900m.</span></p><p class=\"\"><span>The project offers an integrated residential model centered on privacy, green spaces, and refined architectural designs, while incorporating the latest technological solutions to transform it into a smart compound.</span></p><p class=\"\"><span>Eng. Amr Pasha, Chairman of Vivienda Developments, said that the launch of the second phase was driven by strong customer demand for the project.</span></p><p class=\"\"><span>He explained that the company relies on comprehensive feasibility studies for all its projects, factoring in economic shifts and potential market volatility to safeguard sustainability and minimize future risks.</span></p><p class=\"\"><span>He added that real estate remains the leading investment in Egypt, not merely a savings vehicle, particularly amid ongoing market changes.</span></p><p class=\"\"><span>Pasha noted that selecting a prime location is a key factor in creating long-term added value for clients, especially in light of the state’s extensive urban expansion and the development of new cities across the country.</span></p><p class=\"\"><span>The Chairman of Vivienda disclosed that the company conducts comprehensive market studies before launching any project, including an analysis of the location, main access roads, and proximity to key squares, services, and established residential communities, ensuring a balance between customer needs and promising investment opportunities.</span></p><p class=\"\"><span>Selecting New Zayed City reflects the company’s commitment to continuous development and elevating its projects. JAÉN enjoys a high level of privacy, as the entire area is dedicated exclusively to villas, featuring expansive green spaces and an upscale, fully integrated community.</span></p><p class=\"\"><span>The project is characterized by a low building footprint, with only about 15% of the total land area developed, with expansive green spaces across the project This allows for generous spacing between villas, ensures maximum privacy, and eliminates high-rise structures, ultimately enhancing the overall quality of life within the compound.</span></p><p class=\"\"><span>JAÉN offers a diverse range of residential units, including standalone villas, twin houses, and townhouses, with spaces starting from 250 sqm. The units feature well-planned architectural designs that optimize interior space distribution, alongside fully integrated services and amenities.</span></p><p class=\"\"><span>Vivienda collaborated with a distinguished team of leading consultants for the project, led by Eng. Yasser El Beltagy of YBA as architectural and landscape consultant. The designs embrace an Andalusian architectural style, combining heritage character with refined elegance.</span></p><p class=\"\"><span>The company also appointed Huawei and Protech as technology consultants, alongside AMG as engineering consultant and Hosny Consulting Engineers.</span></p><p class=\"\"><span>Founded in 2007, Vivienda Developments continues to strengthen its position in the Egyptian market through a portfolio of successful projects in prime areas of New Cairo, including Andalus, Banafseg, Investors Area, and Gardenia Heights, while maintaining a firm commitment to the highest standards of quality, finishing, and on-time delivery.</span></p><p class=\"\"><span>The launch of the second phase of JAÉN underscores Vivienda’s strategy of delivering integrated residential communities that combine distinctive design, innovation, and sustainable investment value in one of west Cairo’s most promising locations.</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_Zaw25t7Kj:0-zawya-pressr-vivienda-developments-launches-2nd-phase-of-ja-n-villas-in-west-cairo-after-the-first-phase-sells-out/",
            "pub_date": "2026-03-01 20:21:20",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:0a7c8f0d2094b:0",
            "title": "HYPE Rallies While Traders Flood Oil, Gold And Bitcoin Perps Amid Iran Tensions",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>HYPE’s price rose amid recent U.S.-Israel strikes on Iran and subsequent market shifts.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Perpetual contracts linked to oil prices on Hyperliquid’s decentralized exchange climbed, reflecting hedging behavior by traders in response to supply-related geopolitical risk.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The macro backdrop included coordinated strikes on Iran and elevated oil prices, with oil futures reaching multi-month highs amid geopolitical concerns.</span></li></ul></span></div><span><p class=\"\"><span>Global central banks now hold the largest share of gold reserves this century, as gold prices traded higher alongside rising activity in commodity-linked crypto derivatives. </span></p><p class=\"\"><span>Hyperliquid’s HYPE token rallied on Saturday as traders rushed to the decentralized exchange to trade perpetual contracts on oil and precious metals.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/hyperliquid\" rel=\"nofollow\" target=\"_blank\">Hyperliquid (HYPE)</a><span> was trading at $30.77, up roughly 12.5% on the day and with high 24-hour volume. On Stockwits, the retail sentiment around HYPE moved from ‘extremely bearish’ to ‘bearish’ as chatter levels around it improved from ‘extremely low’ to ‘low’ over the past day.</span></p><p class=\"\"><span>Oil-linked perpetual futures on Hyperliquid rose after the U.S. and Israel launched coordinated missile strikes on Iran. Oil-USDH climbed more than 5% to $71.26, while USOIL-USDH traded above $86.00. The two contracts recorded nearly $4 million in volume and over $5 million in notional open interest, according to Hyperliquid data. Silver-linked perpetuals led commodity derivatives activity on the platform with more than $227 million in 24-hour volume, followed by gold contracts at roughly $173 million.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin Perp Activity Surges</span></strong></p><p class=\"\"><span>At press time, Bitcoin perpetual futures trading also picked up speed at the same time. There was a rise in trading activity for Bitcoin perpetual futures, with open interest of $1.39 billion and volume of $3.38 billion in 24 hours. BTC perps also saw about $41 million in long liquidations and $25 million in short liquidations. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Iran Retaliates</span></strong></p><p class=\"\"><span>The gains in oil-linked contracts followed coordinated U.S. and Israeli missile strikes on Iran that triggered explosions across Tehran and multiple other cities. Iran retaliated shortly after, targeting multiple U.S. airbases in the region.</span></p><p class=\"\"><span>Iran is a major oil producer and controls access to the Strait of Hormuz, a maritime chokepoint roughly 33 kilometers wide at its narrowest point. Nearly 20% of the global oil supply, about 17 million barrels per day, passes through the strait.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:0a7c8f0d2094b:0/",
            "pub_date": "2026-03-01 20:24:31",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cnbctv:0de34769f094b:0",
            "title": "Iran Conflict: These stocks have significant exposure to the Middle East",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Global equity markets will be reacting to developments from over the weekend on Monday morning, with the attacks by the US and Israel on Iran, the death of Iran's supreme leader Khamenei, and the subsequent retaliation by Iran on major gulf countries, including Saudi Arabia, and the reported closure of the Strait of Hormuz.</span></p><p class=\"\"><span> There are multiple Indian companies that have a significant exposure to the Middle East in terms of project execution and topline being generated from the region.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Here's a look at the stocks that have a significant exposure to the Middle East:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Larsen &amp; Toubro</span></strong></strong></p><p class=\"\"><span> India's largest infrastructure company has a significant exposure to the Middle East. Out of its consolidated order book, nearly ₹3.6 lakh crore or 49% came from the international business. Out of the total international order book, more than 80% came from Saudi Arabia and the UAE and the Middle Eastern region. It recently won major orders in the region as well.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Kalyan Jewellers</span></strong></strong></p><p class=\"\"><span> The jeweller also has exposure to the middle east, with 12% of its consolidated topline coming from that region. As of December, the company operated 36-38 stores in the middle east and also has plans for further expansion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>KEC International</span></strong></strong></p><p class=\"\"><span> The transmission and distribution services provider has major presence in Saudi Arabia and the United Arab Emirates. It recently won a ₹1,064 crore order for a 380 kV line and a ₹1,038 crore GIS substation order from Saudi Arabia. During the Q3 earnings call, the management had said that it has emerged as the lowest bidder for multiple orders in the Middle East, which could be awarded in the ongoing Q4.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Welspun Corp</span></strong></strong></p><p class=\"\"><span> While the company has not disclosed the exact exposure of its order book to the Middle East, it has significant presence in Saudi Arabia, a geography from where it has won multiple orders. It is also investing nearly ₹1,700 crore in the region as capex, most of which is for setting up a new 2,50,000 MTPA Ductile Iron pipe facility, which is expected to be operational by March 2026. It is also setting up a 3,50,000 MTPA longitudinal Submedged Arc Welded (LSAW) line pipe plant aimed at supporting orders from Saudi Aramco and local infrastructure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Sterling &amp; Wilson Renewables</span></strong></strong></p><p class=\"\"><span> While the company has not disclosed actual numbers, it does have operations in Saudi Arabia, the UAE and Oman, as per its investor presentation for the third quarter.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>VA Tech Wabag</span></strong></strong></p><p class=\"\"><span> In its third quarter earnings call, the management disclosed that it is currently executing a 200 MLA Al Haer STP project in Saudi Arabia, a 300 MLD Yanbu Mega Desalination Plant in Saudi, where the effective date of commencement is expected soon, early works like basic engineering is ready and key personnel have been deployed. \"The Middle East presents sustained opportunities in desalination, wastewater treatment and reuse, backed by strong infrastructure investments across the GCC and our disciplined bidding approach,\" the management had said in the call.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:0de34769f094b:0/",
            "pub_date": "2026-03-01 20:09:42",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "sharecast:0ede84fd3094b:0",
            "title": " Iran confirms Ayatollah Ali Khamenei assassinated by US-Israel ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>US President Donald Trump had late on Saturday claimed the 86-year-old ayatollah had been killed. Meanwhile the bombing continued into a second day, although the immediate purpose post the assassination of the Khamenei was not clear.</span></p><p class=\"\"><span>Global oil markets were braced for volatility on Monday after the key Strait of Hormuz was closed to shipping. Opec+ nations were reportedly considering increasing output to offset any disruption to deliveries.</span></p><p class=\"\"><span>Iranian media reported on Sunday that the Khamenei's daughter, son-in-law and granddaughter had also been killed in Saturday’s missile strikes.</span></p><p class=\"\"><span>“After establishing contact with informed sources in the supreme leader’s household, the news of the martyrdom of the daughter, son-in-law and granddaughter of the revolutionary leader has unfortunately been confirmed,\" the Fars news agency reported.</span></p><p class=\"\"><span>Iran's head national security official, Ali Larijani, said the country would hit Israeli and American targets “with a force they have never experienced before”. Speaking to state media, he said an interim committee would run the country until a new leader was chosen.</span></p><p class=\"\"><span>The surprise war came after officials from Tehran and Washington met on Thursday to discuss Iran’s nuclear programme but failed to achieve a breakthrough.</span></p><p class=\"\"><span>“Khamenei, one of the most evil people in History, is dead,” Trump wrote in a social media post as he claimed the Iranian leader's death, adding: “This is the single greatest chance for the Iranian people to take back their Country,” Trump.</span></p><p class=\"\"><span>In response, Iran launched missile and drone strikes against US bases, including the headquarters of the US navy’s fifth fleet in Bahrain, Israeli residential areas, and targets in other Gulf countries including Dubai, Saudi Arabia, Qatar and Kuwait.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Reporting by Frank Prenesti for Sharecast.com</span></strong></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/sharecast:0ede84fd3094b:0/",
            "pub_date": "2026-03-01 19:59:16",
            "source": "ShareCast",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZP04I:0",
            "title": "Chery Automobile's February Sales Volume Falls 14.8% Y/Y",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Chery Automobile Co Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAYS FEB SALES VOLUME FALLS 14.8% Y/Y TO 146,173 UNITS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZP04I:0-chery-automobile-s-february-sales-volume-falls-14-8-y-y/",
            "pub_date": "2026-03-01 20:01:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_Zaw2QHqTz:0",
            "title": "ZAWYA-PRESSR: LG Electronics accelerates growth in key strategic markets",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>LG Electronics is accelerating expansion in high-growth strategic markets –  Saudi Arabia, India and Brazil – with a goal to double revenue by 2030.</span></li><li class=\"listItem-bmN0_SHH\"><span>Combined revenue in the three countries reached KRW 6.2 trillion in 2025, increasing more than 20 percent compared to 2023.</span></li><li class=\"listItem-bmN0_SHH\"><span>LG is strengthening localized production, region-specific products and market-tailored business models to unlock long-term growth.</span></li><li class=\"listItem-bmN0_SHH\"><span>Investments include expanded B2B and government-led opportunities in Saudi Arabia, a new production facility in Brazil and localized “LG Essential Series” appliances in India.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Riyadh, Saudi Arabia</span></strong><span> — LG Electronics (LG) is accelerating its growth strategy in key strategic markets, focusing on Saudi Arabia, India and Brazil as central pillars of its mid- to long-term expansion. The company aims to double its combined revenue in these three countries by 2030 through localized products, regional production and market-specific business strategies.</span></p><p class=\"\"><span>Combined revenue in Saudi Arabia, India and Brazil reached KRW 6.2 trillion last year, increasing more than 20 percent compared to 2023 – more than twice LG’s overall corporate growth rate during the same period. Despite global economic uncertainty and delayed demand recovery in some regions, these markets continue to show strong momentum driven by structural demand and large-scale development.</span></p><p class=\"\"><span>LG’s goal to double revenue in these markets by 2030 was reaffirmed by CEO Lyu Jae-cheol in his first message to employees following his appointment at the end of 2025. The strategy aims to maximize growth in high-potential regions while strengthening portfolio balance beyond mature markets such as Korea, North America and Europe.</span></p><p class=\"\"><span>Localized Products and Market-Specific Infrastructure to Drive Growth</span></p><p class=\"\"><span>LG is reinforcing its local business capabilities by expanding region-specific production, product development and partnerships.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Saudi Arabia: Expanding B2B and Government-Led Opportunities</span></li></ul><p class=\"\"><span>LG has maintained a long-standing partnership with leading appliance distributor Shaker since entering Saudi Arabia in 1995. Over nearly three decades, the collaboration has expanded to include joint development of HVAC technologies optimized for extreme climate conditions.</span></p><p class=\"\"><span>These localized capabilities are translating into new business opportunities. Over the past year, LG has signed large-scale supply agreements tied to Saudi government-led development projects, including cooling solutions for one of the Middle East’s largest net-zero AI data centers within a smart city project, and AI home and smart solution deployments for a major premium residential development.</span></p><p class=\"\"><span>Saudi Arabia continues to present growing B2B and B2G opportunities driven by national development initiatives under Vision 2030.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Brazil: Expanding Local Production Capacity</span></strong></li></ul><p class=\"\"><span>Brazil, the world’s 11th-largest economy, continues to see improving consumer purchasing power. To meet growing demand and enhance cost competitiveness, LG is expanding its local manufacturing footprint.</span></p><p class=\"\"><span>The company is investing more than USD 200 million to build a new manufacturing facility in Paraná state, with the goal of beginning operations in 2026. Covering 767,000 square meters with a total floor space of 70,000 square meters, the site will produce premium and region-specific home appliances.</span></p><p class=\"\"><span>The new facility will strengthen local production competitiveness, support domestic demand growth, and serve as an export base for neighboring South American markets. Combined with LG’s existing production site in Manaus, Amazonas, annual local production capacity for premium appliances and components in Brazil is expected to reach approximately 7.2 million units.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>India: LG Essential Series Designed for Local Needs</span></li></ul><p class=\"\"><span>India remains a core growth market where LG holds leading market share across major home appliance categories. With appliance penetration still at only 20–30 percent, the country offers significant long-term growth potential.</span></p><p class=\"\"><span>LG recently introduced its India-exclusive LG Essential Series, designed around local lifestyle patterns, climate conditions and purchasing power. The lineup includes washing machines, air conditioners and refrigerators positioned as essential household appliances for India’s expanding young middle class.</span></p><p class=\"\"><span>Localized features include washing machines that operate reliably under low water pressure and hard water conditions; air conditioners engineered for stable cooling performance in extreme summer temperatures up to 55 degrees Celsius; and refrigerators with expanded fresh-food storage tailored to vegetarian dietary preferences, complemented by designs that reflect local aesthetics.</span></p><p class=\"\"><span>By focusing on localized production and supply chain optimization, region-specific product innovation, and expanded B2B and infrastructure solutions, LG aims to strengthen its presence in high-growth markets and build a more resilient, diversified foundation for sustained global growth.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About LG Electronics, Inc.</span></strong></p><p class=\"\"><span>LG Electronics is a global innovator in technology and consumer electronics with a presence in almost every country and an international workforce of more than 75,000. LG’s four Companies – Home Appliance Solution, Media Entertainment Solution, Vehicle Solution and the Eco Solution – combined for global revenue of over KRW 89 trillion in 2025. LG is a leading manufacturer of consumer and commercial products ranging from TVs, home appliances, air solutions, monitors, automotive components and solutions, and its premium LG SIGNATURE and intelligent LG ThinQ brands are familiar names world over. Visit www.LGnewsroom.com for the latest news.</span></p><p class=\"\"><span>Media Contacts:</span></p><p class=\"\"><span>LG Electronics, Inc.                                                  LG Electronics, Inc.</span></p><p class=\"\"><span>Lea Lee                                                                    Jiyoung Bang</span></p><p class=\"\"><span>lea.lee@lge.com                                                       jiyoung.bang@lge.com</span></p><p class=\"\"><span>www.LGnewsroom.com                                           www.LGnewsroom.com</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_Zaw2QHqTz:0-zawya-pressr-lg-electronics-accelerates-growth-in-key-strategic-markets/",
            "pub_date": "2026-03-01 20:04:21",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_P8N3YE07V:0",
            "title": "BYD February vehicle sales fall at steepest pace since pandemic",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Chinese electric vehicle maker BYD </span><span> recorded the biggest fall in global sales in six years last month.</span></p><p class=\"\"><span>BYD's February sales plunged by 41.1% from a year earlier, the sixth consecutive month of decline, according to a stock market filing on Sunday. The fall last month was the biggest since February 2020 when the economy was hit by the pandemic.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_P8N3YE07V:0-byd-february-vehicle-sales-fall-at-steepest-pace-since-pandemic/",
            "pub_date": "2026-03-01 19:45:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000508:0",
            "title": "Table: Ichia Technologies Feb Rev NT$829.0M Vs NT$749.5M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>   Ichia Technologies Inc. - Taiwan </span><br/><span>   Figures in New Taiwan dollars. </span><br/><span>                                     2026               2025 </span><br/><span>Revenue                    NT$829,047,000     NT$749,482,000 </span><br/><span>Jan-Feb Revenue          NT$1,802,733,000   NT$1,543,443,000 </span><br/><span> </span><br/><span>Source: Taiwan Stock Exchange This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com. </span><br/><span> </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000508:0/",
            "pub_date": "2026-03-01 19:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S8N3UR08L:0",
            "title": "Russia seeks information on oil tanker seizure by Belgium",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    The Russian embassy in Belgium was not notified about the facts and reasons for the seizure of the Ethera oil tanker, it said on Sunday, adding that it was seeking information on whether any Russian nationals were on board.</span></p><p class=\"\"><span>Belgian Defence Minister Theo Francken said earlier that Belgium seized an oil tanker belonging to the Russian shadow fleet.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S8N3UR08L:0-russia-seeks-information-on-oil-tanker-seizure-by-belgium/",
            "pub_date": "2026-03-01 19:37:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:3a9797a9f094b:0",
            "title": "Tokenized gold leads ‘100% of weekend price discovery’ while CME futures are closed",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Gold pricing shifts onto blockchain networks once US futures markets close for the weekend, according to Iggy Ioppe, former chief investment officer at Credit Suisse and now chief investment officer (CIO) at liquidity infrastructure firm Theo.</span></p><p class=\"\"><span>CME gold futures stop trading at 5:00 pm ET on Friday and reopen at 6:00 pm ET on Sunday. During that interval, regulated futures markets are inactive and most remaining activity occurs through private over-the-counter deals in Asia that are not publicly reported. As a result, tokenized gold assets such as PAX Gold (PAXG) and Tether Gold (XAUt) become the only continuously available trading venues.</span></p><p class=\"\"><span>“In terms of publicly visible price formation, onchain markets are responsible for virtually 100% of weekend price discovery,” Ioppe told Cointelegraph.</span></p><p class=\"\"><span>He added that when futures trading resumes, prices often align with movements that already occurred on blockchain markets. “We are seeing weekend moves reflected when CME reopens,” he said. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Tokenized gold market cap jumps to $4.4 billion</span></strong></p><p class=\"\"><span>The shift comes amid rising trading volume for tokenized gold. As Cointelegraph reported, tokenized gold expanded rapidly over the past year, adding nearly $2.8 billion in value and growing from about $1.6 billion to $4.4 billion in market capitalization. </span></p><p class=\"\"><span>The sector’s market cap rose 177%, far outpacing the broader gold market and most major spot gold ETFs, while the number of holders nearly tripled with more than 115,000 new wallets. The growth represented roughly a quarter of all net inflows into the real-world asset (RWA) sector and exceeded the combined expansion of tokenized stocks, corporate bonds and non-US Treasurys. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1025.6794751640114px;aspect-ratio:1.709465791940019\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:3a9797a9f094b-78c57d8205adada0d0b834210628842d-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:3a9797a9f094b-78c57d8205adada0d0b834210628842d-resized.webp\" style=\"background-color:#eef6f5\"/></picture></div></button></figure><p class=\"\"><span>Trading activity also surged, with tokenized gold recording about $178 billion in 2025 volume and peaking above $126 billion in the fourth quarter. That level would make it the second-largest gold investment product globally by trading volume after SPDR Gold Shares. </span></p><p class=\"\"><span>Ioppe said that market makers and cross-venue liquidity providers dominate participation, arbitraging price differences between digital and traditional markets. Crypto-native macro traders also play a major role, using tokenized gold not only for exposure to bullion prices but also for collateral, hedging and yield strategies during periods of geopolitical or macroeconomic uncertainty.</span></p><p class=\"\"><span>“Some institutions are monitoring weekend onchain gold markets, particularly macro and cross-asset desks that track gap risk ahead of the CME reopen,” he said, noting that most institutions treat the signal as informational rather than a basis for active positioning. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>24/7 tokenized gold trading lets investors manage risk</span></strong></p><p class=\"\"><span>Tokenized gold markets allow for continuous trading, which offers a practical risk management advantage. If a geopolitical event occurs while futures markets are closed, traditional participants cannot adjust positions. Tokenized markets allow immediate rebalancing. </span></p><p class=\"\"><span>On Saturday, tokenized gold rallied as geopolitical tensions escalated following US and Israeli strikes on Iran, with investors moving into XAUT and PAXG while Bitcoin (BTC) and Ether (ETH) fell. XAUT briefly climbed above $5,450 and PAXG neared $5,536 during the day before trimming gains, according to data from CoinMarketCap.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:546.1351819757366px;max-width:1200px;aspect-ratio:2.197258187357197\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:3a9797a9f094b-e41043445cc2a404b9acca1c85e35950-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:3a9797a9f094b-e41043445cc2a404b9acca1c85e35950-resized.webp\" style=\"background-color:#f5f8f9\"/></picture></div></button></figure><p class=\"\"><span>However, Ioppe said adoption still faces obstacles. Liquidity remains smaller than in futures or exchange-traded funds (ETFs), making large trades harder to execute without moving prices. “Regulatory clarity is improving, but fragmentation across jurisdictions slows institutional deployment. Custody, accounting, and capital rules still vary widely,” he said. </span></p><p class=\"\"><span>For now, tokenized gold is expected to operate alongside traditional products rather than replace them. “The most likely near-term evolution is that of tokenized and traditional markets existing in parallel, each serving a different function,” Ioppe concluded. </span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Magazine: </span></strong></em><span>Bitcoin’s ‘biggest bull catalyst’ would be Saylor’s liquidation — Santiment founder</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:3a9797a9f094b:0-tokenized-gold-leads-100-of-weekend-price-discovery-while-cme-futures-are-closed/",
            "pub_date": "2026-03-01 19:48:52",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_Zaw2ctTjZ:0",
            "title": "ZAWYA-PRESSR: Oriental Weavers secures independent carbon footprint certifications",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Cairo </span></strong><span>– Oriental Weavers, the world’s leading manufacturer of woven carpets, has achieved a new milestone in its sustainability and climate action journey, following the successful completion of independent verification and certification for its carbon footprint and renewable energy initiatives. This achievement reinforces the company’s position as a leader in applying best practices in sustainable industrial operations both locally and globally.</span></p><p class=\"\"><span>The verification was conducted by an EGAC-accredited Validation and Verification Body in line with ISO 14064 standards and the GHG Protocol, confirming the accuracy of the company’s carbon accounting. Results show an annual footprint of approximately 102,000 tons of CO₂e for Scope 1 and 2 emissions and around 486,000 tons of CO₂e for Scope 3 emissions across the value chain. The inclusion of Scope 3 emissions marks a significant milestone, as most traditional industrial companies don’t independently measure or disclose these emissions.</span></p><p class=\"\"><span>Commenting on this, </span><span>Ms.  Yasmine Khamis, Chair of Oriental Weavers Carpets, said: “This achievement reflects Oriental Weavers’ commitment to transparency and environmental responsibility, as only a limited number of industrial companies in Egypt have reached this level of independent carbon footprint verification and disclosure. Through precise measurement, certification, and investment in solar energy, the company has achieved measurable emissions reductions as part of a broader decarbonization plan to generate 20% of the company’s energy consumption from solar power within five years across 27 factories, supporting Egypt’s renewable energy targets and contributing to national emissions reduction goals.”</span></p><p class=\"\"><span>The certifications also highlight the measurable impact of the company’s renewable energy projects. The 2.5 MWp on-site solar photovoltaic plant has already achieved a verified annual reduction of 1,815 tons of CO₂ equivalent, while the 5 MWp plant, soon to become operational, is projected to reduce 3,101 tons of CO₂ equivalent per year. These results represent tangible progress toward a lower-carbon future, demonstrating the industrial sector’s ability to adopt clean energy without compromising productivity.</span></p><p class=\"\"><span>This performance not only demonstrates the company’s dedication to sustainability but also strengthens its leadership regionally and globally and enhances its competitiveness in export markets, particularly in Europe and North America, where international buyers increasingly demand environmental transparency and verified reductions in emissions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Oriental Weavers Group:</span></strong></p><p class=\"\"><span>Founded in 1979 by visionary industrialist Mohamed Farid Khamis, Oriental Weavers has built over 45 years of legacy, growing from a single loom operation into the world’s leading manufacturer of woven carpets. Drawing on Egypt’s rich textile heritage of over 5,000 years, the company is driven by a purpose to spread happiness and comfort through every piece it creates worldwide.</span></p><p class=\"\"><span>Employing over 19,000 people across 28 factories in Egypt and the U.S., OW produces more than 150 million square meters of carpet annually. It sells 48 carpets every minute, operates over 260 showrooms in Egypt, and exports to more than 118 countries. Its portfolio includes over 4.5 million unique designs, reflecting unmatched variety, innovation, and craftsmanship. OW is also a trusted partner for global hospitality leaders and numerous office and government buildings worldwide. From local roots to global impact, Oriental Weavers continues to set the standard—weaving comfort, quality, and creativity into every space.</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_Zaw2ctTjZ:0-zawya-pressr-oriental-weavers-secures-independent-carbon-footprint-certifications/",
            "pub_date": "2026-03-01 19:34:01",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        }
    ]
}