{
    "data": [
        {
            "id": "te_news:446526:0",
            "title": "UK 10-Year Gilt Yield Up from 7-Week Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UK’s 10-year gilt yield rose above 4.5%, rebounding from a seven-week low after Mexico and Canada delayed planned US tariffs by a month.</p><p class=\"\">Earlier concerns over tariffs on these countries and potential levies on the EU had pushed UK yield to as low as 4.442%.</p><p class=\"\">Trade tensions remain high as China retaliated with tariffs on US goods and launched an investigation into Google following Trump’s 10% tariff on Chinese imports, reigniting fears of a deepening trade war.</p><p class=\"\">Amid market uncertainty, investors increasingly expect the Bank of England to cut rates multiple times this year to support the economy.</p><p class=\"\">Futures now price in 81 basis points of BoE rate cuts by December, with a 95% chance of a 25bps cut to 4.5% at the upcoming meeting.</p><p class=\"\">Meanwhile, the Federal Reserve kept rates unchanged last week, signaling caution on future cuts, while the European Central Bank lowered rates by 25bps and hinted at further easing if needed.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446526:0-uk-10-year-gilt-yield-up-from-7-week-low/",
            "pub_date": "2025-02-04 18:01:52",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463398:0",
            "title": "Nippon Densetsu Kogyo's Fiscal Nine-Month Profit Jumps 15%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nippon Densetsu Kogyo's  attributable profit rose 15% to 2.89 billion yen in the nine months ended Dec. 31, 2024, from 2.52 billion yen in the year-ago period. </p><p class=\"\">Basic earnings per share at the construction company increased to 49.02 yen from 40.96 yen in the previous year, according to a Jan. 31 filing with the Tokyo Stock Exchange. </p><p class=\"\">Net sales grew 6.4% to 125 billion yen from 117.5 billion yen a year earlier. </p><p class=\"\">For fiscal 2025, attributable profit is seen to rise 4.6% to 10.5 billion yen or 178.05 yen per share, while revenue is forecast to increase 5.7% to 205.2 billion yen. </p><p class=\"\">The company is seen to declare a total of 50 yen per share at year-end.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463398:0/",
            "pub_date": "2025-02-04 18:01:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1DM:0",
            "title": "Sterling Tools Dec-Quarter Consol Net Profit 136 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sterling Tools Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET PROFIT 136 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 2.61 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1DM:0-sterling-tools-dec-quarter-consol-net-profit-136-mln-rupees/",
            "pub_date": "2025-02-04 18:02:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463402:0",
            "title": "Coro Energy Conditionally Raises Capital via Retail Offer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coro Energy  conditionally raised 126,009 pounds sterling through a retail offer, according to a Tuesday filing. </p><p class=\"\">The UK-based energy company will issue 8,400,616 shares at 0.015 pound apiece. Net proceeds will be used to repay an existing convertible loan, develop a pipeline of renewable energy projects, and finance general and administrative expenses related to the Duyung PSC project. </p><p class=\"\">The offer is conditional on shareholder resolution to be passed at a general meeting on Wednesday and trading of the issued shares on the London bourse's AIM segment, anticipated on Friday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463402:0/",
            "pub_date": "2025-02-04 18:02:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0BU:0",
            "title": "COMMENT-There are good reasons to be long USD in February",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FX traders expecting U.S. dollar gains this month can take comfort from seasonal trends, which are corroborated by technical factors. The market remains positioned for a rise.</p><p class=\"\">An analysis of the dollar's February performance since 2000 shows it has risen in 16 of the past 25 years, including the last eight years in a row.</p><p class=\"\">The USD index, which tracks the greenback against a basket of six major currencies, failed in recent weeks to hold the break under the 107.805 Fibo, a 23.6% retrace of the 100.150 to 110.170 (September to January) rise. That is a likely bear trap, set when a market breaks below a technical level but subsequently reverses, which is usually a bullish sign. Especially as the 14-week momentum reading is positive.</p><p class=\"\">The speculative long position - derived from net contracts of International Monetary Market speculators in the euro, yen, pound, Swiss franc, Canadian and Australian dollars - remains steadfast. For the week ending Jan. 28, the value of net positions held by speculators edged higher to $31.13 billion long from $30.73 billion a week earlier.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:784.4327176781002px;aspect-ratio:1.3073878627968336\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-3d7012da782dcdaa7c0546246650b5d1-resized.webp\" type=\"images/webp\"/><img alt=\".\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-3d7012da782dcdaa7c0546246650b5d1-resized.jpeg\" style=\"background-color:#fbf4e7\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Seasonality Chart</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1116.4705882352941px;aspect-ratio:1.8607843137254902\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-c7650c46bf4306c29a0cb1372cc28403-resized.webp\" type=\"images/webp\"/><img alt=\".\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-c7650c46bf4306c29a0cb1372cc28403-resized.jpeg\" style=\"background-color:#1c202b\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Weekly Chart</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:846.9200524246396px;aspect-ratio:1.4115334207077326\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-8c7515bc84ef85fbaff0196346a950cf-resized.webp\" type=\"images/webp\"/><img alt=\".\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0BU-8c7515bc84ef85fbaff0196346a950cf-resized.jpeg\" style=\"background-color:#ddf2f9\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Speculative Dollar Chart</span></figcaption></figure></span></p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0BU:0-comment-there-are-good-reasons-to-be-long-usd-in-february/",
            "pub_date": "2025-02-04 18:02:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463387:0",
            "title": "Fuji Media Sees Leadership Changes Amid Major Shareholder Dalton's Push for Reform and Hieda's Resignation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dalton Investment urges the board of Fuji Media Holdings  to demand director Hisashi Hieda's resignation from both the group and subsidiary Fuji Television Network (Fuji TV) due to poor governance. </p><p class=\"\">Despite Fuji Media's Prime Market listing, the governance of both Fuji Media and Fuji TV is \"completely dysfunctional\", according to the investment arm's statement on Monday. </p><p class=\"\">Dalton said while it supports the establishment of a Management Reform Committee of outside directors, the directors must insist on Hieda's resignation and \"all the other directors appointed by him\" to safeguard shareholder value. </p><p class=\"\">In a separate Monday filing, Fuji Media said chairman Shuji Kanoh and Director Koichi Minato have resigned from their positions at FMH and Fuji TV, effective immediately. </p><p class=\"\">Kenji Shimizu has been appointed as President and Representative Director of Fuji TV, effective Jan. 28. </p><p class=\"\">Both Fuji Media and Fuji TV will cooperate with a third-party investigation and are committed to fair management and regaining stakeholder trust.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463387:0/",
            "pub_date": "2025-02-04 18:03:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0RB:0",
            "title": "From Johnnie Walker to Corona beer, major alcohol firms could face tariff hit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Makers of alcoholic beverages such as Johnnie Walker whisky and Corona beer could be caught in the crosshairs of a potential trade war after U.S. President Donald Trump imposed sweeping new tariffs on goods from Mexico, Canada and China.</p><p class=\"\">Although Trump agreed to a 30-day pause on the tariffs on Canada and Mexico on Monday, the U.S. went ahead with the 10% levy on Chinese imports on Tuesday, prompting swift tit-for-tat tariffs from the country.</p><p class=\"\">Canada and Mexico had both initially announced retaliatory tariffs had Trump gone ahead with 25% tariffs on their imports.</p><p class=\"\">Here is a list of global beverage companies likely to see an impact:</p><p class=\"\">DIAGEO  </p><p class=\"\">The British beverage company, known for brands such as Johnnie Walker and Smirnoff vodka, withdrew its medium-term organic sales growth target on Tuesday as it took steps to try and mitigate the impact of U.S. tariffs.</p><p class=\"\">Diageo expects a gross impact of around $200 million on operating profit for the current financial year, mostly from tequila, if tariffs are implemented from March 1.</p><p class=\"\">The company has about 46% exposure to imports from Mexico and Canada, according to a Jefferies note. It has end-to-end tequila production is in Mexico. </p><p class=\"\">PERNOD RICARD SA </p><p class=\"\">The French company, which produces well-known spirits such as Absolut Vodka and Jameson Irish Whiskey, has production sites in Canada, Mexico and China with about 6.3% of sales from Mexico and Canada imports, according to Jefferies.</p><p class=\"\">Affected brands include Codigo 1530 tequila and Jefferson's bourbon whiskey. </p><p class=\"\">CAMPARI </p><p class=\"\">The company, whose products include the popular Aperol aperitif, faces reasonable risk as tequila sold in the U.S. accounts for 7% of group sales and has been a key driver to its performance in the country, according to J.P. Morgan.</p><p class=\"\">Campari has a production facility in Canada, and its facility in Mexico produces spirits brands like Gran Centenario and Espolon, according to its website.  </p><p class=\"\">ANHEUSER-BUSCH INBEV </p><p class=\"\">Budweiser and Stella Artois owner AB InBev could see growth in its market share at the cost of its peers since a major portion of its portfolio is sourced from within the U.S., according to J.P. Morgan.</p><p class=\"\">However, the brokerage noted that a significant percentage of its earnings before interest and tax (EBIT) comes from Mexico, which could be impacted by tariffs, weakening demand for some of its products.</p><p class=\"\">BROWN-FORMAN </p><p class=\"\">The American spirits company, which produces Jack Daniel's Tennessee Whiskey, faces tariffs on its tequila portfolio in Mexico, accounting for a mid-single digit percentage of U.S. sales, according to J.P. Morgan.</p><p class=\"\">Brown-Froman is also subject to retaliatory tariffs from Canada and Mexico, which will weigh on its American whiskey portfolio, including its flagship brand Jack Daniel's.    </p><p class=\"\">Canada and Mexico make up 1% and 7% of its 2024 total sales, according to the company's 2024 annual report.</p><p class=\"\">CONSTELLATION BRANDS  </p><p class=\"\">The Corona and Modelo Especial beer maker has a total production capacity of about 48 million hectoliters in Mexico, which is anticipated to rise to about 65 million hectoliters by fiscal 2028, according to the latest annual report for the year ending February 2024</p><p class=\"\">J.P. Morgan noted that about 85% of Constellation Brands' consolidated sales are derived from Mexican beer and could potentially see a mid-20's percentage impact to earnings per share if no pricing or cost savings initiatives is taken.     </p><p class=\"\">MOLSON COORS BEVERAGE  </p><p class=\"\">Miller Lite maker Molson Coors has exposure to tariffs through Molson Canadian, although J.P. Morgan believes the impact would be \"de minimis.\" </p><p class=\"\">The brokerage added that Canada's retaliatory tariff impact on American beer would be limited too as the company produces Coors Light and Miller Lite locally in Canadian breweries. </p><p class=\"\">HEINEKEN  </p><p class=\"\">Dutch brewer Heineken could see some modest impact as Mexican imports for the company are around low-single digit percentage of the group's sales, according to Jefferies. </p><p class=\"\">BECLE </p><p class=\"\">Jose Cuervo owner Becle, a Mexican-based company and one of the world's biggest tequila maker, along with Diageo, dominates the U.S. market for the agave-based drinks and rely heavily on tequila sales in the U.S. for growth.</p><p class=\"\">Becle's U.S. shipments of eight tequila or mezcal brands had a sales value of almost $1.6 billion, according to a Reuters analysis.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0RB:0-from-johnnie-walker-to-corona-beer-major-alcohol-firms-could-face-tariff-hit/",
            "pub_date": "2025-02-04 18:04:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002759:0",
            "title": "Market Talk Roundup: Latest on U.S. Politics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering U.S. politics. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0505 ET - The dollar could suffer a further pullback if the U.S. and China move towards a de-escalation in their trade dispute, ING analyst Francesco Pesole says in a note. A new 10% U.S. tariff on China took effect Tuesday and China has announced retaliatory tariffs. Markets seem to price in a good chance of the U.S. and China striking a deal and delaying tariffs after Trump agreed to pause planned 25% tariffs on Canada and Mexico. However, the case for significant dollar depreciation is weak as the tariff threat remains, Pesole says. Trump has \"more concretely introduced the tariff threat into daily market news.\" The DXY dollar index falls 0.5% to 108.484. (renae.dyer@wsj.com)</p><p class=\"\">0457 ET - U.S. tariffs are likely to end up not as bad as markets had feared, says Jefferies' Mohit Kumar in a note. Jefferies is therefore positive on risky assets over a 3-month to 6-month horizon. The macroeconomic backdrop remains supportive and positioning is light, the global economist says. That said, the coming days are likely to be dominated by headlines around negotiations with China, while Europe is likely the next in the tariffs and negotiations story, he says. (emese.bartha@wsj.com)</p><p class=\"\">0448 ET - Sterling falls on the day but remains comfortably above Monday's lows against the dollar when U.S. President Trump's tariffs on Canada and Mexico--which he later agreed to pause--unsettled markets. ING analyst Francesco Pesole says any sterling losses should be limited because tariffs shouldn't unduly harm the U.K. economy. Exports to the U.S. are less than 2% of gross domestic product, while Trump \"seems in no rush to hit the U.K. with tariffs,\" he says in a note. U.K. Prime Minister Keir Starmer's trip to Brussels to discuss security and defence is positive for sterling as it signals intent to repair EU relations, he says. Sterling falls 0.3% to $1.2409, still well above Monday's low of $1.2248. EUR/GBP rises 0.1% to 0.8322. (renae.dyer@wsj.com)</p><p class=\"\">0432 ET - Beiersdorf's sales in the U.S. are expected to be hit by Trump's tariff proposals should they come into force, as about two-thirds of the sales in the country are sourced from or manufactured in other countries, a company spokesperson says. The owner of Nivea skincare products is monitoring the international backdrop as it plans potential measures to \"adapt to new developments\", the spokesperson adds, without disclosing further details. \"The U.S. market remains a strategic growth market for Beiersdorf, which we intend to expand further in the coming years. We have already invested in the U.S. market in recent years and continue to build on this\". Beiersdorf's sales in North America in 2023 represented nearly 13% of its total sales. Shares are down 1.2% and more than 10% over a 52-week period. (michael.susin@wsj.com)</p><p class=\"\">0426 ET - Gold futures slide as Canada and Mexico came to a last-minute deal with the U.S. Futures are down 0.5% at $2,842.30 a troy ounce, but remain elevated, having hit a record high of $2,872 an ounce in the prior session. Gold prices are correcting after the countries made a deal that will postpone U.S. tariffs by at least a month, ING analysts say in a note. However, the uncertainty over trade and tariffs continue to keep the price relatively well supported, they say. Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING says. Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING says. (joseph.hoppe@wsj.com)</p><p class=\"\">0408 ET - The yields on U.K. government bonds, or gilts, rise, tracking moves in their U.S. and eurozone counterparts after U.S. President Trump paused tariffs on Canada and Mexico for a month, sparking a shift away from safe-haven bonds for now. Tariffs remain a risk and investors are concerned about the harm this could do to the U.K. economy, dampening growth while lifting inflation, Pantheon Macroeconomics economists say in a note. \"We think President Trump's tariffs, by fracturing supply chains, will be stagflationary for the U.K.\" Tariffs could potentially mean fewer interest-rate cuts by the Bank of England as inflation rebounds, the economists say. The 10-year gilt yield climbs 4 basis points to last trade at 4.520%, Tradeweb data show. (miriam.mukuru@wsj.com)</p><p class=\"\">0359 ET - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">0349 ET - U.K. investors are on edge as trade jitters continue, Hargreaves Lansdown's Matt Britzman writes. Trade tensions are dictating the market mood, especially in Europe where U.S. President Trump keeps the continent guessing with lingering threats, the senior equity analyst writes. With volatility set to remain, there may be chances for investors to cash in on market overreactions, especially if Trump's tariff threats are a bluff, the analyst says. The U.K.'s FTSE 100 trades down 0.4%. (adam.whittaker@wsj.com)</p><p class=\"\">0343 ET - The euro remains under pressure as tariff risks remain heightened even after President Trump agreed to pause tariffs on Canada and Mexico, Danske Bank analyst Stefan Mellin says in a note. Tariff headlines will likely remain the primary driver of price action in the coming weeks, with a risk of Trump announcing measures against Europe, he says. Still, Trump looks to be using tariff announcements \"primarily as a negotiating tool\" and this could help the euro to recover back into a $1.04-$1.05 range. \"We believe Trump is ultimately likely to under-deliver on maintaining tariffs for an extended period,\" Mellin says. The euro falls 0.2% on the day to $1.0323. It hit a three-week low of $1.0213 Monday, according to FactSet. (renae.dyer@wsj.com)</p><p class=\"\">0254 ET - Eurozone 10-year government bond yields edge higher, tracking U.S. Treasury yields after the latest twist in President Trump's tariff policy. Trump agreed to postpone the tariffs on Mexico and Canada for a month after talks with the leaders of both countries. Ten-year eurozone bond yields rise about 3 basis points across the board, with the Bund yield up at 2.417%, according to Tradeweb. Eurozone rates are likely to continue to be sensitive to growth risks, ING's Padhraic Garvey and Michiel Tukker say in a note. \"Especially the front end may find itself even lower in the near term,\" the rates strategists say. (emese.bartha@wsj.com)</p><p class=\"\">0231 ET - The FTSE 100 is expected to open 14 points lower, or 0.2%, according to IG. The index closed down 90 points, or 1%, to 8583 points on Monday. U.S. President Trump on Monday agreed to postpone his threatened 25% tariffs on Canada and Mexico following talks with the leaders of the two countries. However, a new 10% tariff on China took effect Tuesday. China has retaliated with new tariffs on select U.S. imports and said it was opening an antitrust probe into Google. \"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies economist Mohit Kumar says in a note. \"Our view remains that eventually tariffs will end up not as bad as feared.\" (renae.dyer@wsj.com)</p><p class=\"\">0133 ET - China's retaliation to Trump's tariffs doesn't seem aggressive, says Zhiwei Zhang, president and chief economist at Pinpoint Asset Management. Beijing's measures only target some U.S. products, whereas the U.S. tariffs apply to all Chinese exports to the country, says Zhang. \"This is likely only the beginning of a long process for the two countries to negotiate,\" the economist says. The negotiations between the U.S. and its neighbors suggest that there is some hope of de-escalation at some point, though the road ahead is likely to be bumpy, Zhang says. Washington postponed tariffs on Canada and Mexico after reaching border-related deals. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002759:0/",
            "pub_date": "2025-02-04 18:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002756:0",
            "title": "Dollar Could Fall Further if U.S.-China Trade Dispute Eases — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The dollar could suffer a further pullback if the U.S. and China move towards a de-escalation in their trade dispute, ING analyst Francesco Pesole says in a note. A new 10% U.S. tariff on China took effect Tuesday and China has announced retaliatory tariffs. Markets seem to price in a good chance of the U.S. and China striking a deal and delaying tariffs after Trump agreed to pause planned 25% tariffs on Canada and Mexico. However, the case for significant dollar depreciation is weak as the tariff threat remains, Pesole says. Trump has \"more concretely introduced the tariff threat into daily market news.\" The DXY dollar index falls 0.5% to 108.484. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002756:0/",
            "pub_date": "2025-02-04 18:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0PN:0",
            "title": "Unicaja shares rise, Jefferies says 2025-27 targets imply upside to consensus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Unicaja  rise more than 5% as the Spanish bank's 2025-2027 strategic plan implies a \"backend-loaded upside\" to consensus, according to Jefferies</p><p class=\"\">** \"Newly presented 2025-2027 strategic targets imply c150m EUR upside to cumulative net profits over the 3-year period and &gt;350m EUR upside to cumulative capital returns over the period,\" Jefferies says</p><p class=\"\">** This year's outlook, however, is in line with consensus, the analysts add</p><p class=\"\">** Unicaja's NII dips 0.8% in Q4 vs Q3, but comes above market expectations</p><p class=\"\">** Q4 profit misses expectations, but Jefferies notes this includes a one-off cost related to restructuring; adjusted for this, the profit would have been a 15% beat, the broker adds</p><p class=\"\">** If the gains hold, the Unicaja shares will see their best day since early February 2024</p><p class=\"\">** Including Tuesday's rise, the stock has gained around 14% YTD​</p><p class=\"\">($1 = 0.9675 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0PN:0-unicaja-shares-rise-jefferies-says-2025-27-targets-imply-upside-to-consensus/",
            "pub_date": "2025-02-04 18:05:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0QQ:0",
            "title": "Rupee ends higher tracking peers, US-China trade tensions in focus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Indian rupee ended higher in a choppy trading session on Tuesday, mirroring gains in regional currencies, but concerns over an escalating U.S.-China trade war kept investors on edge.</p><p class=\"\">The rupee  ended at 87.0675 against the U.S. dollar, against a record closing low of 87.1850 in the previous session, when it also fell to an all-time low of 87.28.</p><p class=\"\">Most Asian currencies rose amid the ongoing tit-for-tat escalation of a global trade war between the world's two largest economies, the U.S. and China.</p><p class=\"\">China retaliated with a package of tariffs on a range of U.S. products in an immediate response to a 10% tariff on Chinese imports announced by U.S. President Donald Trump.</p><p class=\"\">Trump's press secretary said the president would speak with Chinese President Xi Jinping in the next couple of days.</p><p class=\"\">Meanwhile, Trump delayed 25% tariffs against Mexico and Canada, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighbouring countries.</p><p class=\"\">\"The tit-for-tat tariff regime has left investors cautious, with concerns that the potential for a protracted tariff war could stoke inflationary pressures in the U.S.,\" said Jigar Trivedi, a senior analyst at Reliance Securities.</p><p class=\"\">Trivedi expects the rupee to fall to 87.30 as the trade war adds to market volatility.</p><p class=\"\">The dollar index , having rallied to nearly 110 on Monday, pulled back sharply to 108.48 on the day. </p><p class=\"\">The offshore Chinese yuan  recovered to 7.29 to the U.S. dollar.</p><p class=\"\">From now on, markets could handle tariff threats even more cautiously, but \"a new layer of unpredictability\" argues against big dollar depreciation for now, ING Bank said in a note.</p><p class=\"\">\"...markets need to follow a rationale, and we think the conclusion is that Trump is ready to bluff his way into transactional victories, whether on border security or trade,\" the bank said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0QQ:0-rupee-ends-higher-tracking-peers-us-china-trade-tensions-in-focus/",
            "pub_date": "2025-02-04 18:05:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463406:0",
            "title": "Great Southern Copper Extends Copper Mineralization at Chile Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Great Southern Copper  said Tuesday the first phase diamond drilling program at the Mostaza mine in its Cerro Negro project in Chile confirmed visible copper, silver, and gold mineralization. </p><p class=\"\">The program verified the width of mineralization reported in historical drill holes, confirmed mineralization extending at depth and along the strike of historical holes below the mine, and proved the extension of copper mineralization along a trend to the south of the mine, according to Chief Executive Officer Sam Garrett. </p><p class=\"\">The British mineral exploration company added that samples from the holes were sent to the ALS laboratories for assay results.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463406:0/",
            "pub_date": "2025-02-04 18:05:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463311:0",
            "title": "Exports Propel January Factory Boom in India: PMI Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Boosted by a robust upturn in exports, India's manufacturers in January enjoyed strong order growth, expanded production and ramped up hiring, reported S&amp;P Global on Monday. </p><p class=\"\">The seasonally adjusted India manufacturing purchasing managers index (PMI) for January rose to 57.7 from 56.4 in December, rising further above the 50-marker that separates growth from contraction, said S&amp;P Global, citing its own monthly survey. </p><p class=\"\">\"International demand for Indian goods strengthened in January, with panelists noting gains from across the globe. Notably, the rate of expansion in new export orders was the best seen in just under 14 years,\" advised S&amp;P Global. </p><p class=\"\">Domestic demand in India in January was also strong, provoking manufacturers to go on on a hiring spree: \"The extent to which employment expanded was the greatest seen in nearly 20 years of data collection,\" explained S&amp;P Global. </p><p class=\"\">In additional good news for India's factory managers, input cost inflation was tempered in January. \"Input costs increased in January, amid reports of greater outlays on freight, labor and materials. The rate of inflation was modest overall and the weakest since February 2024, however,\" said S&amp;P Global</p><p class=\"\">India's manufacturers were optimistic in January. Looking ahead, a scant 1% of India factory managers expected to decrease production in the next 12 months, while 32% forecast expansion, according to the PMI survey. </p><p class=\"\">The India manufacturing PMI for January was compiled by S&amp;P Global surveys sent to 400 manufacturers from January 8 through January 27.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463311:0/",
            "pub_date": "2025-02-04 18:05:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OU0OX:0",
            "title": "PREVIEW: Merck earnings, revenue expected to rise in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Merck  shares up 1.1% at $99.94 ahead of Q4 results due before the opening bell on Tues</p><p class=\"\">** Last Thurs, co said it plans to stop a late-stage study testing its pulmonary arterial hypertension (PAH) drug ahead of time based on strong efficacy data</p><p class=\"\">** Analysts on avg expect Merck to post adj EPS of $1.62 on revenue of $15.49 bln, per LSEG data, vs yr-ago results of 3 cents/sh and $14.63 bln in revenue</p><p class=\"\">** Merck has met or beaten EPS and revenue expectations for at least the past eight quarters</p><p class=\"\">** Of the 28 analysts that cover Merck, the breakdown of recommendations is 19 \"strong buy\" or \"buy,\" 9 \"hold\"</p><p class=\"\">** Median price target of $121.66 is down from $130 a month ago</p><p class=\"\">** MRK shares up 0.5% YTD stock performance vs 4.6% YTD gain in Dow Industrials  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OU0OX:0-preview-merck-earnings-revenue-expected-to-rise-in-q4/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002722:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">China Retaliates With Levies, Antitrust Probe Into Google</strong></p><p class=\"\">The actions include 15% tariffs on U.S. coal and liquefied natural gas imports, as well as raising levies on crude oil, agricultural machinery and certain vehicles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Asia Markets Jittery as Traders Gauge First Trade War Salvos</strong></p><p class=\"\">Markets across Asia began the day with a relief rally after the U.S. struck last-minute deals with Mexico and Canada to delay tariffs, but the mood took a turn when China hit back with new tariffs on the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Pauses Tariffs on Mexico, Canada. China Levies Are Still Happening-for Now.</strong></p><p class=\"\">Tariffs on Canada and China are still going ahead for now.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</strong></p><p class=\"\">The department said it began the year with more cash on hand than planned.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump's threatened tariffs might not hit clothing retailers much now, but analysts warn price increases could backfire</strong></p><p class=\"\">Lots of clothes on store shelves could get a bit more expensive if new tariffs announced by President Donald Trump over the weekend eventually take hold. But after three years of price increases and higher costs of living, some Wall Street analysts say shoppers might be too worn out to buy any of it.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</strong></p><p class=\"\">Manufacturers anticipate higher costs for steel and aluminum would arise from Trump administration tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Futures Set New Record on Safe-Haven Demand</strong></p><p class=\"\">Gold futures set a fresh record in volatile trading as traders digested U.S. President Trump's tariff plans.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed interest-rate cuts might not come anytime soon, two top officials say</strong></p><p class=\"\">Two senior Federal Reserve officials said Monday that they are in no rush to cut interest rates further given the uncertainty surrounding the U.S. economic outlook and the White House's new policies, including tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002722:0/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002721:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Offer Price for Fuji Soft in Bid to End Takeover Battle</strong></p><p class=\"\">The U.S. investment company bought a more than one-third stake in Fuji Soft in November and has said it is best positioned to work with the company to take it private.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS to Boost Buybacks as Net Profit Beats Expectations</strong></p><p class=\"\">The group plans to repurchase $1 billion of its stock in the first half and buy back up to an additional $2 billion in the second.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BNP Paribas Earnings Grow; Raises Dividend</strong></p><p class=\"\">The French lender intends to buy back more than 1 billion euros worth of shares after posting an earnings rise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tequila has to be made in Mexico. Diageo offers no financial outlook on tariff uncertainty.</strong></p><p class=\"\">The maker of Don Julio tequila and Crown Royal whisky said on Tuesday it can't provide financial guidance because of the uncertainty over tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nintendo Cuts Earnings, Switch Sales Guidance</strong></p><p class=\"\">The Japanese videogame maker said Tuesday that net profit dropped 42% from a year earlier to 237.19 billion yen, for the nine-month period.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apple escaped tariffs last time. This time, it may have to raise prices.</strong></p><p class=\"\">Apple was one of the luckier consumer-electronics companies when it got exemptions on the tariffs imposed by the first Trump administration on many goods made in China. But this time, it might not be quite as fortunate.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Alphabet Earnings Could Provide Answers on AI and Cloud Concerns</strong></p><p class=\"\">Analysts surveyed by FactSet expect Alphabet to report a jump in earnings and revenue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ADM's Outlook Is a Worry. Earnings Are Today.</strong></p><p class=\"\">Last week, the chip maker's rival, Intel,gave a softer-than-expected forecast for its March quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Big Endeavor Group Holders Likely to Battle Silver Lake Over Buyout Price, $6 Billion Windfall</strong></p><p class=\"\">Since the $13 billion, take-private deal was unveiled in April 2024, TKO's stock has surged almost 75% to $156.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gardasil Worries Loom as Merck Reports Earnings</strong></p><p class=\"\">Merck shares are down more than 20% over the past 12 months after trouble with sales of its Gardasil vaccine in China</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002721:0/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002715:0",
            "title": "House Republicans Are Split on How Deeply to Cut Federal Spending — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Richard Rubin and Olivia Beavers</p><p class=\"\">WASHINGTON — House Republicans are sharply divided over how much government spending they should cut, and the dispute is slowing their plans to reduce taxes and increase border enforcement.</p><p class=\"\">On one side: Conservatives who see a rare chance to use full Republican government control to scale back programs such as Medicaid, the health-insurance program covering more than 70 million people. At times, they have been seeking trillions of dollars in spending cuts over the next decade and say they want Republicans' major fiscal legislation to reduce budget deficits.</p><p class=\"\">On the other side: Moderates who are wary about blowback from states, hospitals and the GOP's emerging working-class base. They are looking for smaller minimum spending cuts attached to the \"one big beautiful bill\" that President Trump wants to extend expiring tax cuts, pay for his immigration restrictions and boost the military.</p><p class=\"\">Party leaders are stuck in the middle. Because of the party's tiny House majority, they must keep virtually all House Republicans together on a budget blueprint and a subsequent detailed bill. One early proposal circulating among lawmakers and lobbyists lays out about $300 billion in spending cuts and a roughly equal amount in spending increases. Under that approach, Trump's 2017 tax cuts — $4 trillion or more over a decade — could potentially be extended without accompanying spending cuts.</p><p class=\"\">House Republicans must resolve or postpone the fight before taking the first major step forward — a Budget Committee vote on a resolution setting minimum spending cuts and a maximum deficit increase for Trump's big bill. Even though the ultimate bill could produce smaller deficits than the maximum set in the budget, this moment is an important leverage point in setting the terms for the year's debate. Some Republicans pushed back against that early blueprint, and they haven't reached agreement among themselves yet.</p><p class=\"\">Congress is moving on a different track than the Trump administration's Department of Government Efficiency. The effort led by billionaire Elon Musk has targeted some spending, and canceled contracts and employee resignations might reduce agencies' costs. But the real money is in the federal programs that provide incomes and healthcare for low-income households and retirees. and changing those requires Congress.</p><p class=\"\">House Speaker Mike Johnson (R., La.) had said a budget vote would happen this week, but aides said late Monday that the committee wouldn't act this week. It is the first public slippage in the party's aggressive schedule.</p><p class=\"\">House Republicans \"are working right now to negotiate what that looks like,\" Johnson said on Fox News. \"We don't want to blow a hole in the deficit by extending the Trump-era tax cuts, for example, but we're definitely going to get that extended. So, we got to find those savings, \" he said.</p><p class=\"\">The budget resolution is the crucial first step in the process that lets Republicans get their fiscal agenda through Congress without needing Democratic votes. The process, called budget reconciliation, allows lawmakers to bypass the usual 60-vote filibuster threshold in the Senate.</p><p class=\"\">\"It's always going to be a battle, but that's fine,\" said Rep. Ralph Norman (R., S.C.), a member of the conservative Freedom Caucus, who also sits on the Budget Committee and is pushing for deep cuts. \"Shoot for the stars, and if you have to come down, that's fine. Don't shoot at the lowest number and then expect to go up.\"</p><p class=\"\">Brutal math</p><p class=\"\">Over the next decade, the U.S. government is projected to collect $67.5 trillion in taxes and spend $89.3 trillion, sending publicly held debt as a share of gross domestic product to record levels. Republicans say they want to start closing the gap. But the math is brutal.</p><p class=\"\">Extending Trump's expiring tax cuts and adding his new ideas — like no tax on tips — would subtract more than $5 trillion from revenue. Agency spending and Social Security are generally outside the bounds of one-party reconciliation bills. Paying interest on the debt isn't optional, and Trump also has taken Medicare largely off the table.</p><p class=\"\">With those categories protected, that leaves about $16 trillion in spending that could be eyed for cuts. About half of that is Medicaid, the healthcare program largely for low-income people that is largely run by states.</p><p class=\"\">Republicans have floated several ideas to lower Medicaid's costs. One would lower the minimum share of a state's costs that the federal government pays, a change that could affect states including California and New York. Another possible change would prevent states from imposing taxes on Medicaid providers in ways that raise federal reimbursements. Republicans might also consider creating work requirements for able-bodied Medicaid recipients.</p><p class=\"\">\"Every member of Congress represents a state with a governor and state legislators who will absolutely pressure them to essentially not dump the budget deficit on states,\" said Brian Riedl, a former Senate GOP aide now at the Manhattan Institute.</p><p class=\"\">Riedl said he was dubious Republicans could make trillions of dollars of spending cuts, especially with a House majority of 220-215 at most. \"There is more overlap with Democrats on the tax-cut extensions than there is unanimity about cutting trillions,\" he said.</p><p class=\"\">Centrist Republicans worry that steep cuts could cost the party voters in the 2026 election.</p><p class=\"\">\"If you cut Medicaid, you're, like, pissing off the people who put you in office — who Trump resonates with, right?\" said one House Republican. \"So you got to be careful about how you do it, if you do it.\"</p><p class=\"\">'Different pain thresholds'</p><p class=\"\">Another House Republican recalled a colleague standing up during the GOP's recent Florida retreat and arguing, to applause, that they didn't want to let the tax-writing Ways and Means Committee expand budget deficits.</p><p class=\"\">\"There are different views on tax, there's different pain thresholds on spending,\" this lawmaker said. \"So maybe this does fall apart. Maybe this notion that there's going to be an all-Republican thing on tax, maybe it's a bridge too far.\"</p><p class=\"\">Republicans should seek a middle ground, one that makes progress on deficits while preventing tax increases that would occur in 2026 if they do nothing, said Don Schneider, a former House GOP aide now at investment firm Piper Sandler.</p><p class=\"\">The best path, he said, sets a reasonable floor for the size of the spending cuts and relies on Trump's ability to unify the party.</p><p class=\"\">\"He can be the guy that tips the scales in favor of spending cuts but he's going to need to give members the cover to accept these difficult choices,\" Schneider said.</p><p class=\"\">Republicans will look for other ways to claim that their plans reduce deficits without major spending cuts. One way is to point to revenue from Trump's tariffs.</p><p class=\"\">The other is by arguing that the extension of expiring tax cuts doesn't actually cost anything. The Republican Study Committee, a core group of conservative members, said any tax bill must reduce the deficit — but didn't specify whether that was being measured before or after extending $5 trillion in tax cuts.</p><p class=\"\">Ultimately, the important numbers won't be measured in the trillions but in the votes needed to get majorities in the House and Senate.</p><p class=\"\">\"The numbers that I always tell people you have to keep in mind are 218 and 51,\" Senate Majority Leader John Thune (R., S.D.) said on Fox News Radio.</p><p class=\"\">Write to Richard Rubin at richard.rubin@wsj.com and Olivia Beavers at Olivia.Beavers@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002715:0/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002718:0",
            "title": "Grab-GoTo's Potential Merger Could Improve Margins, Citi Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A potential merger between Grab and GoTo would improve margins, Citi Research analyst Alicia Yap writes in a note. Bloomberg reported Tuesday that talks between the ride-hailing companies over a possible combination have recently intensified. They would likely save costs on competing user subsidies, as well as see faster new user acquisition with broader product offerings and better reach to lower-tier cities, Yap says. There could also be better user targeting, cross-selling of financial services and increased advertising revenue on both platforms, Yap adds. Both brands would likely continue running independently, but there could be back-end integration of systems and more collaboration regarding merchant management and sharing their rider and vehicle pool, Yap adds. Citi retains a buy rating on Grab with a target of $5.90. Shares last closed at $4.54. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002718:0/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2k4l8P:0",
            "title": "Decentralized Privacy Centric Search Engine Presearch Launches “NSFW” Spicy Mode Search Experience",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toronto, Feb.  04, 2025  (GLOBE NEWSWIRE) — Presearch (www.presearch.io), the privacy-centric, non-profiling meta-search engine, announced today the launch of a free “Spicy” NSFW adult search service. Building on the successful Presearch Takeover Advertising (PTA) format, this new offering creates a privacy-focused space where adult products, services, and creators can connect with audiences. It’s already achieving click-through rates 10 times higher than those of traditional takeover ads. Established industry leaders have already enthusiastically joined the platform<em> </em>including Lovense, Stripchat, Subseeker, OnlyFinder, Creatr.uk and OnlyTraffic.</p><p class=\"\">By toggling the chili-pepper icon in the Presearch search bar and confirming they are the legal age of consent, users can select the NSFW “after hours” search experience with adult-oriented registered wallpaper style takeover ads that rotate in the background.  The “Spicy” feature, available now for Presearch users, empowers those who opt in to access curated content from advertisers in the adult industry, including OnlyFans creators, cam models, dating platforms, adult toys and sexual wellness products.  A dedicated OnlyFans creator search feature, unavailable directly on the OnlyFans platform, will also be seamlessly integrated. </p><p class=\"\">This initiative upholds Presearch’s commitment to user empowerment, anonymity and ethical advertising by providing a non-judgmental, non-profiling, tracker free space for adult-focused brands to promote their offerings free from stigma or restrictive policies commonly found. </p><p class=\"\">“The history of the internet wouldn’t be possible without adult brands, from Minitel Rose to OnlyFans,” said Presearch.com CEO Tim Enneking. “The new spicy ‘NSFW’ option for Presearch allows qualified users to engage with this sex-positive content if they wish, while finally providing a safe-space for adult content creators, products and services to advertise freely and thrive.”</p><p class=\"\">Presearch ensures age safety through periodic age verification while adhering to privacy-respecting practices that never associate user behavior with identity or IP addresses. Additionally, Presearch complies with the RTA (Restricted to Adults) industry standard. </p><p class=\"\">“I’m 1,000% confident that once users—especially remote workers and digital nomads—experience this new search paradigm, they’ll never want to go back to basic, boring search again,” said Brenden Tacon, Business Development Lead at Presearch. “We’re offering users a unique, enticing, and pleasurable search experience while fostering inclusivity and freedom of expression, which all aligns with the Presearch Ethos. At the same time, we’re addressing a major void in the market and meeting a significant demand by providing advertisers in the adult industry with a critical platform.”</p><p class=\"\">Presearch Takeover Advertising has become a game-changer in the industry, empowering brands by eliminating invasive tracking methods and offering advertisers a unique opportunity to reach privacy-conscious users. By expanding into the NSFW space, Presearch opens new doors for adult brands often excluded from mainstream advertising platforms, ensuring they can reach their audience without compromising ethical standards.</p><p class=\"\">The “Spicy” NSFW feature is available now. Advertisers and users interested in learning more can visit Presearch’s Advertising page: https://presearch.io/advertise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Presearch</strong></p><p class=\"\">Presearch.com offers a privacy-focused, non-profiling search experience with results comparable to leading search engines. Its search-to-earn model rewards users with PRE tokens for every search, creating a unique value proposition. Powered by a decentralized node infrastructure, Presearch promotes fairness and mitigates biases in search outcomes unlike conventional platforms that may prioritize self-serving content and suppress others. With a loyal community, the platform serves nearly 12 million searches per month.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">MEDIA CONTACT: </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">presearch@transformgroup.com</strong></p><p class=\"\">Lynessa@PR1</p><p class=\"\">presearch (at) transformgroup.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2k4l8P:0-decentralized-privacy-centric-search-engine-presearch-launches-nsfw-spicy-mode-search-experience/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L3N3OR1ET:0",
            "title": "Corporate division generates problematic quotients",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Simplicity is hard. For all the breezy and cavalier rhetoric that pushy investors, bankers and CEOs use to tout the benefits of breaking up companies, such efforts often fail to generate the anticipated or promised results. With a fresh wave of spinoffs in the works, it’s a good time to brush up on some harsh financial realities.</p><p class=\"\">Whether for reasons related to ego, pay or simplistic growth, most bosses want to enlarge their empires, not shrink them. It’s also usually easier to buy a peer and hack out costs than it is to extract a business already tangled up inside a bigger enterprise. Although conglomerates have fallen out of favor, the ability to create value over the long term by splitting them into more narrowly focused operations sounds as dubious as the notion of one plus one making three in an acquisition.</p><p class=\"\">There are plenty of historic examples for the latest crop of cleavers to consider. Over the past decade, CEOs worldwide have unveiled nearly $1.7 trillion of spinoffs and similar separations, where a unit started trading independently with a market capitalization of at least $1 billion. That’s according to Dealogic data which excludes divisional sales to corporate or private equity buyers. And plenty more are being teed up. Common rationales include streamlining operations, helping bosses focus, highlighting faster growing or more profitable divisions, and taking advantage of valuation discrepancies.</p><p class=\"\">Pork producer WH Group  last week spun off its U.S.-based Smithfield subsidiary for many of those reasons, as well as to draw geographic distinctions with its China business. Holcim , the Swiss building-materials maker, is doing the same with its North American arm. Cable operator Comcast  plans to create a new publicly traded company for a stable of networks including CNBC, while diversified manufacturer Honeywell International  faces pressure from aggressive shareholder Elliott Investment Management to sever aerospace and defense from industrial automation. DuPont, the chemicals company that already divided itself into three units under Ed Breen’s stewardship, intends to splinter yet again.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1097.9381443298969px;aspect-ratio:1.8298969072164948\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OR1ET-0463315b7c51aa683815e0a1fa70e18f-resized.webp\" type=\"images/webp\"/><img alt=\"Line chart comparing the 10-year performances of the Invesco S&amp;P Spin-off ETF and the S&amp;P 500 Index.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OR1ET-0463315b7c51aa683815e0a1fa70e18f-resized.jpeg\" style=\"background-color:#f5f3f5\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Spinoff stocks have lagged the broader market</span></figcaption></figure></span></p><p class=\"\">The logic of such moves often sounds compelling, but the outcomes are mixed at best. Separations led to a blended excess return about 6% higher than for their respective sector indices, research conducted by Goldman Sachs and consultancy EY found. Morgan Stanley strategists discovered, after studying some 400 deals over two decades, that parent companies underperformed the market by about 8% and the spinoffs outperformed by more than 10%. It’s questionable, however, whether two years, which both Morgan Stanley and Goldman use as their cutoff point, is enough time to judge the performance. Since its 2015 debut, the S&amp;P U.S. Spin-off Index has lagged the S&amp;P 500 Index .</p><p class=\"\">Further analysis, conducted by Breakingviews, presents additional cause for skepticism. The sample covered 60 chunky U.S. examples since 2015 where both parent and SpinCo are still publicly listed. More than a third of the time, one of the two companies has generated a negative total shareholder return, after factoring in reinvested dividends. In eight cases, both destroyed value following a split, as has occurred with Xerox  and Conduent  since they separated in 2017 and Bath &amp; Body Works  and Victoria’s Secret  since 2021.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:934.2105263157895px;aspect-ratio:1.557017543859649\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OR1ET-96ca3b48d441585fb4a9bba48b1ddcfa-resized.webp\" type=\"images/webp\"/><img alt=\"A scatter plot chart which compares the total shareholder returns by parent companies (orange squares) and their spinoffs (blue squares), by the date of each spinoff up to Jan. 7, 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OR1ET-96ca3b48d441585fb4a9bba48b1ddcfa-resized.jpeg\" style=\"background-color:#f5f5f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Split decisions: spinoffs deliver patchy returns</span></figcaption></figure></span></p><p class=\"\">Even some of the seemingly strong stories are inconsistent. For example, after e-commerce giant eBay  capitulated in mid-2015 to billionaire investor Carl Icahn’s demand that it spin off PayPal , both companies trounced the broader market’s returns over the ensuing five years. The outperformance vanished, and then some, in the near decade through January, however. Hewlett Packard’s split in the same year as eBay’s represents a rare instance of both companies keeping up with the S&amp;P 500 Index.</p><p class=\"\">Despite the patchy results, aggressive hedge funds routinely turn to the breakup chapter in their playbooks to target corporate sprawl. Most recently, Elliott put $5 billion into Honeywell, the single biggest investment in its nearly five-decade history, as part of a campaign to convince boss Vimal Kapur to split the company. As part of its pitch projecting an up to 75% share-price boost over two years, the firm cherry-picked examples such as General Electric  and United Technologies, now called RTX , and “countless others that have found success through simplification.”</p><p class=\"\">It’s fair to say that the breakups at GE and United Technologies have served shareholders well so far. The duo also capitalized on big uplifts in demand and valuation multiples for power providers like GE Vernova  and cooling-system installers such as Carrier Global . Those conditions are hard to replicate, especially considering how long it often takes to pull apart the various components. Moreover, GE’s healthcare arm has generated lower returns than the S&amp;P 500, as has RTX’s separated elevator business, Otis Worldwide .</p><p class=\"\">Like the conglomerates themselves, it takes many smoothly moving parts to get a split right. They include the respective capital structures, management, division of assets and customer experiences. Finding the right fund managers and brokers to cover the two pieces can also be make or break. The prospect of a corporate cleanup always holds appeal, but it’s often hard to cut clearly through the spin.</p><p class=\"\">Follow @jgfarb on X</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L3N3OR1ET:0-corporate-division-generates-problematic-quotients/",
            "pub_date": "2025-02-04 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463400:0",
            "title": "Shell Restores Production at Penguins Field in UK North Sea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">British energy giant Shell  said Tuesday it resumed production at its Penguins field in the UK North Sea. </p><p class=\"\">The field now operates with a modern floating, production, storage and offloading facility, which is expected to extend the field's life by up to 20 years. It will also have 30% lower operational emissions than the previous export route through the Brent Charlie platform. </p><p class=\"\">Shell is the operator of the field with a 50% interest, while HitecVision-backed Neo Energy owns the remaining half. The field is expected to reach a peak output of 45,000 barrels of oil equivalent per day.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463400:0/",
            "pub_date": "2025-02-04 18:00:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Ind9pwTR5:0",
            "title": "Inderes Oyj's Financial Statements and the Board of Directors report for 2024 have been published",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Inderes Oyj,Company announcement 4 February 2025, at 12:00 pm EET</p><p class=\"\">Inderes Oyj's Financial Statements and the Board of Directors report for 2024 have been published</p><p class=\"\">Inderes Oyj has published its Financial Statements and the Board of Directors report for the year 2024 in Finnish. The Financial Statements and the Board of Directors report are available as pdf-file attached to this release and on the company's website at: https://group.inderes.com/en</p><p class=\"\">Mikael RautanenCEO, Inderes Oyjmikael.rautanen@inderes.fitel. +358 50 346 0321Jori-Pekka Rautalahtitel. +358 50 382 9323 <strong class=\"root-Tkn6WL2y\">Contact information:</strong> <strong class=\"root-Tkn6WL2y\">Certified Adviser:Sisu Partners Oy</strong></p><p class=\"\">jori-pekka.rautalahti@sisupartners.com</p><p class=\"\">Juha Karttunentel. +358 40 555 4727</p><p class=\"\">juha.karttunen@sisupartners.com</p><p class=\"\">Inderes is a Nordic investor media connecting investors and listed companies. We provide in-depth equity research and investor relations solutions to help over 400 listed companies better serve the Nordic investor community. Inderes operates in Sweden, Finland, Denmark, and Norway and is listed on Nasdaq First North Growth Market. Read more:  <strong class=\"root-Tkn6WL2y\">Inderes in brief</strong></p><p class=\"\">https://group.inderes.com/en/</p><strong class=\"root-Tkn6WL2y\">Attachments</strong>Tilinpäätös ja toimintakertomus 2024.pdf</span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Ind9pwTR5:0-inderes-oyj-s-financial-statements-and-the-board-of-directors-report-for-2024-have-been-published/",
            "pub_date": "2025-02-04 18:00:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9fJsLH:0",
            "title": "STARLUX Commits To Viasat With Launch Of Enhanced In-Flight Connectivity Service",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TAIPEI, Taiwan and CARLSBAD, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — STARLUX, a Taipei-headquartered luxury carrier, and Viasat Inc. , a global leader in satellite communications, today announced STARLUX aircraft has launched enhanced service with Viasat’s high performance in-flight connectivity (IFC) solution, marking an expanded relationship.</p><p class=\"\">The phased rollout of Viasat’s high-speed, reliable in-flight Wi-Fi service will span STARLUX’s entire active fleet. In total, 48 aircraft, including Airbus A330-900s, A321neos, A350-900 and A350-1000 aircraft will install or transition to Viasat's most advanced connectivity system, based on the ViaSat-3 compatible and multi-orbit ready high-performance GM-40 terminal solution. The rollout will encompass both factory installs and expedited retrofits.</p><p class=\"\">Driven by the commitment to passenger-centric innovation, STARLUX distinguishes itself as one of the first airlines in the Asia Pacific region to adopt and deploy Viasat’s cutting-edge solution and onboard enablement platform for an exceptional passenger Wi-Fi experience while in-flight. Since its launch in 2018, STARLUX has consistently prioritized a premium travel experience, and the selection of Viasat’s latest and industry-leading IFC solution, enabled by its resilient multi-orbit satellite roadmap, for the carrier’s entire fleet underscores this dedication.</p><p class=\"\">With Viasat's high-capacity Ka-band satellite network over the Asia Pacific region, expected to soon include one of Viasat’s next generation ViaSat-3 satellites, passengers on STARLUX flights will be able to stream their favorite movies and shows, browse the internet, stay connected with loved ones through messaging apps, and maintain productivity while traveling onboard any STARLUX aircraft.</p><p class=\"\">\"Viasat is proud to partner with STARLUX, an airline that shares our passion for innovation and customer satisfaction,\" said Don Buchman, Senior Vice President and GM, Commercial Aviation at Viasat. \"Through this expanded relationship, we look forward to not only providing high quality connectivity, but a comprehensive solution with the capability and flexibility to empower STARLUX to create an advanced, refined connected experience that suits its ambitions and goals.\"</p><p class=\"\">STARLUX is acclaimed for having the world’s youngest fleet, currently averaging 2.06 years old, and its unwavering focus on passenger comfort and well-being. It operates an all-Airbus fleet that seamlessly blends contemporary luxury with authentic Taiwanese heritage, for which Viasat’s enhanced connectivity services will now form a crucial part of this high-end journey.</p><p class=\"\">Initially, Viasat-enabled aircraft will service major Asian transport hubs, including: Taipei, Singapore, Jakarta, Bangkok, Kuala Lumpur, Ho Chi Minh, Hanoi, Manila, Macau, Tokyo, Osaka, Fukuoka, Nagoya, Sendai, and Hong Kong.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About STARLUX Airlines </strong></p><p class=\"\">Founded on the philosophy that luxury should be available to everyone, not just the elite, Taiwan-based STARLUX is a boutique international airline serving a total of 26 routes from Taiwan to the US, Japan, Macau, Vietnam, Thailand, Philippines, Malaysia, Singapore and Indonesia. STARLUX passengers traveling between North America and Asia are able to enjoy an easy transfer in Taipei with its three US routes: Los Angeles-Taipei, San Francisco-Taipei, and Seattle-Taipei. STARLUX prioritizes safety and offers unparalleled service with the goal of making flying a truly luxurious and un-forgettable experience. For more information, visit https://www.starlux-airlines.com/en-US, or on our US social channels Facebook and Instagram. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Viasat</strong></p><p class=\"\">Viasat is a global communications company that believes everyone and everything in the world can be connected. With offices in 24 countries around the world, our mission shapes how consumers, businesses, governments and militaries around the world communicate and connect. Viasat is developing the ultimate global communications network to power high-quality, reliable, secure, affordable, fast connections to positively impact people’s lives anywhere they are—on the ground, in the air or at sea, while building a sustainable future in space. In May 2023, Viasat completed its acquisition of Inmarsat, combining the teams, technologies and resources of the two companies to create a new global communications partner. Learn more at www.viasat.com, the Viasat News Room or follow us on Facebook, Instagram, LinkedIn, X or YouTube.</p><p class=\"\">Copyright © 2025 Viasat, Inc. All rights reserved. Viasat, the Viasat logo and the Viasat Signal are registered trademarks in the U.S. and in other countries of Viasat, Inc. All other product or company names mentioned are used for identification purposes only and may be trademarks of their respective owners. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Viasat, Inc. Contacts:</strong></p><p class=\"\">Scott Goryl, External Communications, Corporate &amp; Aviation, Scott.Goryl@viasat.com</p><p class=\"\">Lisa Curran/Peter Lopez, Investor Relations, IR@viasat.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements that are subject to the safe harbors created under the Securities Act of 1933 and the Securities Exchange Act of 1934. Forward-looking statements include among others, statements related to the introduction of Viasat’s in-flight connectivity service on Starlux’s aircraft, including Airbus A330-900, A321neo, and A350-900; the expected service entry of a ViaSat-3 satellite over the Asia Pacific region, including the timing thereof; the routes with anticipated service; the availability, capabilities and performance of the Viasat in-flight connectivity service. Readers are cautioned that actual results could differ materially and adversely from those expressed in any forward-looking statements. Factors that could cause actual results to differ include: our ability to successfully implement our business plan for our broadband services on our anticipated timeline or at all; risks associated with the construction, launch and operation of the satellite(s) used to supply these services, including the effect of any anomaly, operational failure or degradation in satellite performance; contractual problems; product defects; manufacturing issues or delays; regulatory issues; changes in relationships with, or the financial condition of, key suppliers; technologies not being developed according to anticipated schedules, or that do not perform according to expectations; and other factors affecting the aviation sector generally. In addition, please refer to the risk factors contained in Viasat's SEC filings available at www.sec.gov, including Viasat's most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q. Readers are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date on which they are made. Viasat undertakes no obligation to update or revise any forward-looking statements for any reason.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9fJsLH:0-starlux-commits-to-viasat-with-launch-of-enhanced-in-flight-connectivity-service/",
            "pub_date": "2025-02-04 18:00:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463383:0",
            "title": "UBS Launches $3 Billion Buyback, Boosts Dividend on 2024 Revenue Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group  on Tuesday posted a sharp rise in 2024 revenue, allowing it to launch the repurchase of $3 billion worth of shares and raise its full-year dividend by 29%. </p><p class=\"\">For the year ended Dec. 31, 2024, the Swiss lender posted total revenue of $48.61 billion, up from $40.83 billion a year earlier. UBS' franchise strength continued to drive client inflows, with its global wealth management division pulling in $97 billion in net new assets, while the asset management unit recorded net new money of $45 billion. </p><p class=\"\">The bank also benefited from heightened client activity in the fourth quarter, with underlying transaction-based income posting a double-digit annual increase in both global wealth management and personal and corporate banking. UBS delivered $700 million in gross cost savings in the fourth quarter, bringing total savings to $3.4 billion for the year. </p><p class=\"\">\"Strong financial performance reflects our unwavering commitment to serving our clients; the strength of our diversified global franchise; and the progress we have made on our integration. We maintained our robust momentum as we captured growth in Global Wealth and Asset Management and gained market share in the Investment Bank, in areas of strategic importance,\" said Chief Executive Officer Sergio Ermotti. </p><p class=\"\">However, net profit attributable to shareholders tumbled to $5.09 billion from $27.37 billion previously. Still, the board declared a dividend of $0.90 per share for the period, up from the year-ago payment of $0.70 per share. UBS also revealed plans to repurchase $1 billion worth of its shares in the first half and another $2 billion in the second half of 2025. </p><p class=\"\">Looking ahead, UBS expects net interest income in its global wealth management unit to decline by a low-to-mid single-digit percentage sequentially in the first quarter, with NII in personal and corporate banking to fall by around 10% in Swiss francs. Meanwhile, integration-related expenses are estimated at about $1.1 billion as the bank advances its post-merger plans. </p><p class=\"\">Deutsche Bank Research said UBS' results were \"well ahead of expectations\" but noted the divisional mix could have been stronger. \"Furthermore, capital was effectively in line, the 2025 share buyback in line with expectations though the 2H25 tranche is conditional, cost reductions are quicker than expected and net inflows were ok in Global Wealth Management and high in Asset Management,\" the analysts said. </p><p class=\"\">The stock fell almost 6% in midmorning trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463383:0/",
            "pub_date": "2025-02-04 18:00:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS9Mgxma:0",
            "title": "Volatus Aerospace Inc. Announces a Strategic Partnership with Dufour Aerospace to Enhance Aerial Cargo, Surveillance, Inspection and Mapping Missions with Advanced VTOL Aircraft Technology",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Adding 400 km range drone with 40kg payload capacity to its portfolio of drone technologies</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">TORONTO, ON /</strong> <strong class=\"root-Tkn6WL2y\">ACCESS Newswire</strong> <strong class=\"root-Tkn6WL2y\">/ February 4, 2025 /</strong> Volatus Aerospace Inc. (OTCQX:TAKOF)(Frankfurt:A2JEQU) (\"Volatus\" or \"the Company\") proudly unveils its next step toward providing a new, unmanned dimension to its clients in the cargo and aerial services markets by joining forces with Dufour Aerospace. Dufour is a Swiss-based designer and manufacturer of long-range drones. Today, the parties announced a strategic partnership. This collaboration will introduce and commercialize Dufour's long-endurance, heavy-lift Aero2 hybrid-electric drone aircraft for operations across diverse environments globally.</p><p class=\"\">By its unique tilt-wing design, the Aero2 can take off and land vertically like a helicopter but flies as fast and energy-efficient as an airplane. Designed for numerous applications, the Aero2 can transport up to 40 kg (88 lbs) of payload over 400 km (249 miles) in standard configuration making it the perfect tool for accessing remote locations in regions like Canada and Africa, for operations such as delivering time-sensitive medical supplies and conducting aerial surveillance and intelligence operations. Its ability to perform vertical takeoffs and transition to high-speed cruise flight introduces flexibility and efficiency to Volatus' services while enabling the Company to operate at the highest safety standards at low operating costs.</p><p class=\"\">\"Recently, we announced operational enhancements gained in partnering with DroneUp. Building on this momentum, the introduction of Dufour's Aero2 hybrid-electric VTOL aircraft into our expanding fleet allows us to significantly expand our operational scope and commercial focus,\" said Glen Lynch, CEO of Volatus Aerospace. \"My confidence in the technology not only comes from having seen the Aero2 in action but, even more importantly, having met the brilliant team of professionals behind the technology. Adding the Aero2 to a growing fleet of larger, more capable drones extends our capabilities and accelerates the commercialization of our Operations Control Center and remote operations capabilities.\"</p><p class=\"\">\"We are thrilled to partner with Volatus Aerospace, a collaboration that aligns Dufour's advanced VTOL technology with Volatus' extensive operational expertise and global reach. This strategic partnership enables us to harness Volatus' strong market presence to bring our innovative Aero2 aircraft to more challenging and underserved areas worldwide, particularly remote communities.\" stated Sascha Hardegger, CEO of Dufour Aerospace. \"By combining our efforts, we're not only expanding our operational horizons but also enhancing our collective ability to deliver efficient, sustainable, and critical aerial solutions on a global scale.\"</p><p class=\"\">Discover the innovation behind Dufour's Aero2 hybrid-electric VTOL. Watch this video to see it in action:</p>&lt;img height=\"0\" src=\"https://app.accessnewswire.com/api/iframe.ashx?releaseid=979071&amp;url=https%3a%2f%2fwww.youtube.com%2fembed%2fS7SvYTBQbds\" width=\"0\"/&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About Volatus Aerospace:&lt;/strong&gt;&lt;br/&gt;Volatus Aerospace is a leader in innovative global aerial solutions for intelligence and cargo. With a strong foundation of over 100 years of combined institutional knowledge in aviation, Volatus provides comprehensive solutions using both piloted and remotely piloted aircraft systems (RPAS). We serve industries such as oil and gas, utilities, healthcare, and public safety. Our mission is to enhance operational efficiency, safety, and sustainability through cutting-edge, real-world solutions.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About Dufour Aerospace:&lt;/strong&gt;&lt;br/&gt;Dufour Aerospace is pioneering drones for critical missions. Based in Switzerland, Dufour develops and manufactures efficient and sustainable aircraft for cargo transportation, logistics, and public safety. The Aero2 drone features distributed electric propulsion and a hybrid module to meet today's Advanced Air Mobility and medium-sized drone market requirements.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Forward-Looking Information&lt;/strong&gt;&lt;br/&gt;This news release contains statements that constitute \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable securities laws, including statements regarding the plans, intentions, beliefs, and current expectations of the Company with respect to future business activities and operating performance. Often, but not always, forward-looking information and forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or \"believes\" or variations (including negative variations) of such words and phrases, or statements formed in the future tense or indicating that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" (or other variations of the foregoing) be taken, occur, be achieved, or come to pass. Forward-looking information includes information regarding: (i) the anticipated benefits of, and estimated revenue to be generated by, the master service agreement; (ii) the business plans and expectations of the Company; and (iii) expectations for other economic, business, and/or competitive factors. Forward-looking information is based on currently available competitive, financial, and economic data and operating plans, strategies, or beliefs of management as of the date of this news release, but involve known and unknown risks, uncertainties, assumptions and other factors that may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors may be based on information currently available to the Company, including information obtained from third-party industry analysts and other third-party sources, and are based on management's current expectations or beliefs. Any and all forward-looking information contained in this news release is expressly qualified by this cautionary statement. Investors are cautioned that forward-looking information is not based on historical facts but instead reflects expectations, estimates or projections concerning future results or events based on the opinions, assumptions and estimates of management considered reasonable at the date the statements are made. Forward-looking information and forward-looking statements reflect the Company's current beliefs and is based on information currently available to it and on assumptions it believes to be not unreasonable in light of all of the circumstances. In some instances, material factors or assumptions are discussed in this news release in connection with statements containing forward-looking information. Such material factors and assumptions include, but are not limited to: the anticipated benefits and revenues of the master service agreement to the Company; the commercialization of drone flights beyond visual line of sight and potential benefits to the Company; meeting the continued listing requirements of the TSXV; and including, but not limited to, those factors set forth in the Company's Annual Information Form under the section \"Risk Factors\". Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. The forward-looking information contained herein is made as of the date of this news release and, other than as required by law, the Company disclaims any obligation to update any forward-looking information, whether as a result of new information, future events or results or otherwise. There can be no assurance that forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information.&lt;/p&gt;&lt;p&gt;Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this news release.&lt;/p&gt;&lt;p&gt;TSXV: FLT&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Media Contacts&lt;/strong&gt;&lt;br/&gt;Danielle Gagne&lt;br/&gt;Head of Marketing and Communications, Volatus Aerospace&lt;br/&gt;+1 833-865-2887&lt;br/&gt;&lt;a href=\"mailto:Danielle.gagne@volatusaerospace.com\" rel=\"nofollow\"&gt;Danielle.gagne@volatusaerospace.com&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Dufour Aerospace&lt;/strong&gt;&lt;br/&gt;Juliett Alpha Communications&lt;br/&gt;&lt;a href=\"mailto:dufour@juliettalpha.com\" rel=\"nofollow\"&gt;dufour@juliettalpha.com&lt;/a&gt;&lt;br/&gt;Tel. +212.518.4796&lt;/p&gt;&lt;p&gt;&lt;strong&gt;SOURCE:&lt;/strong&gt; Volatus Aerospace Corp.&lt;/p&gt;&lt;br/&gt;&lt;br/&gt;View the original &lt;a href=\"https://www.accessnewswire.com/newsroom/en/aerospace-and-defense/volatus-aerospace-inc-announces-a-strategic-partnership-with-dufour-aerospace--979071\"&gt;press release&lt;/a&gt; on ACCESS Newswire&lt;br/&gt;&lt;br/&gt;&lt;img height=\"0\" src=\"https://app.accessnewswire.com/img.ashx?id=979071\" width=\"0\"/&gt;&lt;/body&gt;&lt;/html&gt;</span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS9Mgxma:0/",
            "pub_date": "2025-02-04 18:00:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSTpyDba:0",
            "title": "Mallia Therapeutics and Northway Biotech Announce Partnership for the Manufacturing of Soluble CD83 Protein for Hair Loss Treatment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">With Northway Biotech's expertise in biologics manufacturing, Mallia aims to enter the multi-billion-dollar alopecia market by delivering a safe and effective topical sCD83 treatment designed to stimulate hair follicle formation and promote sustained hair growth.</p><p class=\"\">ERLANGEN, GERMANY AND VILNIUS, LITHUANIA / ACCESS Newswire / February 4, 2025 / Mallia Therapeutics (\"Mallia\"), a biopharmaceutical company developing novel treatments for hair loss, and Northway Biotech (\"NBT\"), a biologics Contract Development and Manufacturing Organization (CDMO), have announced a partnership for the development of the production process and manufacturing of Mallia's soluble CD83 protein (sCD83), a treatment aimed at promoting hair follicle formation and growth.</p><p class=\"\">Under the agreement, Northway Biotech will leverage its expertise in biologics manufacturing to develop the production process for the recombinant sCD83 protein for large-scale production, utilizing the Pichia pastoris expression system. This collaboration includes the development of analytical methods, technology scale-up, and the manufacturing of a cGMP Drug Substance.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Dr. Manfred Groeppel</strong>, co-founder and Managing Director of Mallia Therapeutics, said: \"With this partnership, we are advancing the development of sCD83 to turn our research into a scalable treatment for patients.\"</p><p class=\"\">\"Interestingly, sCD83's mode of action induces both the formation of new hair follicles and thus hair growth, and has the potential to redefine treatment approaches for hormone-induced androgenetic alopecia as well as immune-mediated alopecia areata,\" emphasizes <strong class=\"root-Tkn6WL2y\">Prof. Dr. Alexander Steinkasserer</strong>, co-founder and Managing Director of Mallia. \"By developing a robust production process, we are ensuring the quality required for future clinical as well as commercial applications.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Prof. Vladas Algirdas Bumelis</strong>, CEO and Chairman of Northway Biotech, expressed, \"We are excited to be working with Mallia on developing the manufacturing process of sCD83. Our priority is to ensure the highest manufacturing standards and maintain clear, open communication as we collaborate every step of the way.\"</p><p class=\"\">\"Mallia's team and their innovative solution make this project particularly appealing to us given its huge potential and the large need from people all over the world for treatment. The strong and transparent collaboration we have established allows us to support Mallia with confidence as we move forward together quickly,\"added <strong class=\"root-Tkn6WL2y\">André Markmann, PhD</strong>, VP of Business Development at Northway Biotech.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Mallia Therapeutics GmbH</strong></p><p class=\"\">Mallia Therapeutics GmbH is a biopharmaceutical company focused on developing novel treatments for patients suffering from hair loss. The Company was founded in 2023 in Erlangen, Germany, and is led by an experienced management team and worldwide leading experts in the field of CD83, with more than 60 CD83-related publications and 20 years of experience in the field.</p><p class=\"\">With sCD83, a potential treatment for hair loss in preclinical development, Mallia aims to enter the multi-billion-dollar alopecia market and provide patients with a safe and effective topical treatment.</p><p class=\"\">Connect with us on LinkedIn or find out more here: https://mallia-therapeutics.com/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Northway Biotech</strong></p><p class=\"\">Northway Biotech is a leading contract development and manufacturing organization (CDMO) supporting customers worldwide. Its highly experienced and professional team executes projects at every stage, from cell line construction and process development to cGMP manufacturing of biopharmaceutical products. The company's extensive expertise and vertically integrated service offering enable rapid execution of multiple projects from its state-of-the-art GMP facilities while ensuring full process and product compliance at all stages of research, development, and commercial manufacturing. Northway Biotech is a privately owned company founded in 2004 and operates locations in Vilnius, Lithuania; London, United Kingdom; and Waltham, MA, USA. For more information, please visit www.northwaybiotech.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mallia Therapeutics Contact:</strong></p><p class=\"\">Mallia Therapeutics GmbH</p><p class=\"\">info@mallia-therapeutics.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">International Media Contact:</strong></p><p class=\"\">MC Services AG</p><p class=\"\">Dr. Regina Lutz / Katja Arnold</p><p class=\"\">Tel.: +49 (0)89 210 228 0</p><p class=\"\">E-Mail: mallia-therapeutics@mc-services.eu</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Vladas Bumelis</p><p class=\"\"><em>CEO and Chairman of the Board</em></p><p class=\"\">vladas.bumelis@northwaybiotech.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Northway Biotech</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSTpyDba:0/",
            "pub_date": "2025-02-04 18:00:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463310:0",
            "title": "Indonesia's Factory Activity Stays in Expansionary Territory in January, S&P Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's manufacturing activity in January remains in expansionary territory for a second month amid an improvement in production and new orders, according to a private reading. </p><p class=\"\">The S&amp;P Global Indonesia Manufacturing Purchasing Manager's Index rose to 51.9 from 51.2 in the prior month. The latest PMI has been at its highest since May 2024, S&amp;P Global said in its Monday press release. </p><p class=\"\">The PMI's growth was attributed to output, which has grown for three consecutive months, paired with a higher volume of new orders amid a boost in market demand. </p><p class=\"\">Employers, confident of the growth in manufacturing, raised their staff numbers for a second month. However, input prices are pressured due to a rise in demand. </p><p class=\"\">\"Increased demand for inputs added to some upward pressure to input prices, although inflation remains comfortably below its trend level,\" Paul Smith, S&amp;P Global Market Intelligence's economics director, said. \"However, firms remained wary of passing on their higher costs to clients, with latest data showing only a limited increase in output charges over the month.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463310:0/",
            "pub_date": "2025-02-04 17:50:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0B2:0",
            "title": "COMMENT-EUR/USD to sink if EU fails to do a deal with Trump",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    EUR/USD could tumble towards 0.95 if the European Union is unable to agree a deal with Donald Trump to pause tariffs on EU goods exports to the United States which the president is expected to announce within weeks, if not days.  </p><p class=\"\">Trump has the EU in his crosshairs after announcing 25% tariffs on Mexico and Canada - which have been paused for 30 days - and a new 10% tariff on Chinese goods exports to the United States, which came into effect at 0501 GMT.   </p><p class=\"\">The EU has consistently exported more goods to the United States than it has imported and the U.S. goods trade deficit stood at 155.8 billion euros in 2023, according to Eurostat data.</p><p class=\"\">Potentially losing a chunk of those exports would negatively impact the EU economy, and could also hurt the euro. </p><p class=\"\">EUR/USD most recently threatened 0.95 in September 2022 (a month in which GBP/USD sank to a historic low of 1.0327 courtesy of \"Trussonomics\"). </p><p class=\"\">Related comments:  </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1007.8602620087337px;aspect-ratio:1.6797671033478894\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0B2-96833d713030632a6688928858c79f98-resized.webp\" type=\"images/webp\"/><img alt=\"eurusd\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0B2-96833d713030632a6688928858c79f98-resized.jpeg\" style=\"background-color:#302f2c\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">EURUSD</span></figcaption></figure></span></p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0B2:0-comment-eur-usd-to-sink-if-eu-fails-to-do-a-deal-with-trump/",
            "pub_date": "2025-02-04 17:51:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002158_20250204002671:0",
            "title": "UBS CEO, CFO Spoke During Conference Call After 4Q Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002158_20250204002671:0/",
            "pub_date": "2025-02-04 17:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002683:0",
            "title": "Vodafone Shares Fall After Revenue Declines in Biggest Market — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Najat Kantouar</p><p class=\"\">Vodafone Group shares fell after the group reported a sharp revenue decline in Germany, its biggest market, reflecting the impact from a TV law change in the country and a more competitive environment.</p><p class=\"\">In early trading in Europe, London-listed shares were down 5.4% at 66.14 pence. Year to date, shares have fallen 3.7%.</p><p class=\"\">The telecommunications company said revenue in Germany fell 7.6% on a reported basis to 3.09 billion euros ($3.20 billion). Service revenue--a closely watched metric in the telecom sector--in the country represents 34% of group service revenue and fell 6.4% to 2.89 billion euros for the quarter ended Dec. 31. This was partly due to the expected impact from German regulatory changes, which prevent landlords from bundling TV services with rental agreements, as well as lower broadband customer base.</p><p class=\"\">Germany's turnaround will take time as the group is still absorbing the impact of the law change and face a highly competitive market environment, Chief Executive Margherita Della Valle said on Tuesday.</p><p class=\"\">Meanwhile, U.K. service revenue climbed 3.3% on organic basis to 1.51 billion euros, boosted by significant investments in customer experience. On a group level, service revenue rose to 7.93 billion euros from 7.505 billion euros.</p><p class=\"\">Adjusted earnings before interest, taxes, depreciation and amortization and after lease expenses increased 2.2% on an organic basis to 2.83 billion euros. This was driven by service revenue growth in most markets and lower energy costs in Europe that offset the law impact in Germany. Revenue rose to 9.81 billion euros from 9.35 million euros.</p><p class=\"\">This represents the first set of earnings following the group's exit from Italy. Vodafone sale of the Italian business to Swisscom was approved by Italy's competition regulator in the quarter, marking the final step for getting full clearance. The proceeds, 8 billion euros in cash, have been used to reduce the group's net debt.</p><p class=\"\">Vodafone expects to complete the merger of its U.K. business with its rival operator Three during the first half of 2025, putting an end to group's reshaping plan for growth, Della Valle said.</p><p class=\"\">Separately, the group launched a share buyback of up to 480 million euros to reduce its share capital.</p><p class=\"\">Vodafone reiterated its fiscal 2025 guidance, which includes adjusted EbitdaaL of around 11.0 billion euros and adjusted free cash flow to be at least 2.4 billion euros.</p><p class=\"\">Write to Najat Kantouar at najat.kantouar@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002683:0-vodafone-shares-fall-after-revenue-declines-in-biggest-market-update/",
            "pub_date": "2025-02-04 17:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}