{
    "data": [
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Zaw3g497Q:0",
            "title": "ZAWYA-PRESSR: Hub71 startup Skipr raises at USD 10 Million valuation to scale sovereign AI infrastructure",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Abu Dhabi, UAE:</span></strong><span> Skipr, the autonomous trust fabric for the age of AI, today announced the close of its USD 2 million seed funding round at a USD 10 million valuation. The funding supports the startup’s expansion from Hub71, Abu Dhabi’s global tech ecosystem, as it scales sovereign AI infrastructure for national and enterprise deployments.</span></p><p class=\"\"><span>As intelligent systems increasingly operate autonomously across organizations, clouds, and borders, a new challenge has emerged: how these systems can safely work together. Skipr addresses this gap by providing a secure way for AI systems to communicate, coordinate, and exchange value, while ensuring governments and enterprises retain full sovereign control over their data and decision making.</span></p><p class=\"\"><span>Skipr is already working with telecommunications operators, AI and cybersecurity laboratories, and data center partners to deploy autonomous, sovereign AI digital services at national and enterprise scale. These early deployments position the company as a key enabler for governments and enterprises transitioning toward AI-ready, cross-jurisdiction digital environments.</span></p><p class=\"\"><span>Purpose-built for sovereign-grade use cases, Skipr enables organizations to connect systems, deploy applications, and enable trusted interactions between AI tools across different networks. Through cryptographic identity, policy-driven routing, and auditable interoperability, the company’s technology ensures that data, decisions, and transactions can be shared safely, transparently, and in line with regulatory and national requirements.</span></p><p class=\"\"><span>“This funding accelerates our work on what we believe is a foundational layer for the AI era,” said Andreas Hartl, CEO at Skipr Technologies. “As AI systems become autonomous and interconnected, secure AI-to-AI interoperability under sovereign control is no longer optional. We are building the trust infrastructure nations and enterprises need to deploy AI safely, confidently, and at scale.”</span></p><p class=\"\"><span>As part of the Hub71+ Digital Assets specialist ecosystem, Skipr operates within Abu Dhabi’s growing network of technology innovators, regulators, and strategic partners focused on globally relevant digital infrastructure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Skipr</span></strong></p><p class=\"\"><span>Skipr is the fabric of autonomous trust. As a sovereign Platform-as-a-Service for the age of intelligence, it enables secure, policy-governed AI-to-AI communication across borders, clouds, and organizations. Skipr empowers nations and enterprises to deploy autonomous systems with full sovereignty, compliance, and control.</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Zaw3g497Q:0-zawya-pressr-hub71-startup-skipr-raises-at-usd-10-million-valuation-to-scale-sovereign-ai-infrastructure/",
            "pub_date": "2026-02-27 16:29:27",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:4685b9f4710dd:0",
            "title": "Intertek Group To Buy QTEST To Expand Business In Latin America",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>LONDON (dpa-AFX) - Intertek Group PLC (ITRK.L), a British assurance, inspection, product testing, and certification company, said on Friday that it has inked a deal to acquire QTEST, a provider of electrical testing and certification services in Colombia.</span></p><p class=\"\"><span>'By expanding its technical capabilities and market reach through QTEST's highly specialized service offering and local proximity, Intertek ETL will accelerate its strong growth momentum in Colombia and strengthen its scale leadership across Latin America,' the Group said.</span></p><p class=\"\"><span>Post transaction, QTEST clients will gain access to Intertek's global network of laboratories in over 100 countries.</span></p><p class=\"\"><span>QTEST will also enable Intertek ETL, Intertek's Electrical division, to expand its ATIC offering and boost growth across Latin America.</span></p><p class=\"\"><span>Founded in 2006, QTEST generated revenue of GBP 2 million for 2025.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:4685b9f4710dd:0-intertek-group-to-buy-qtest-to-expand-business-in-latin-america/",
            "pub_date": "2026-02-27 16:29:34",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Obirfnr1a:0",
            "title": "Pelagic Credit Plc: Relaunch of private placement and listing on Euronext Growth Oslo",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>NOT FOR DISTRIBUTION OR RELEASE, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY,INOR INTO THE UNITED STATES OF AMERICA (INCLUDING ITS TERRITORIES ANDPOSSESSIONS,ANY STATE OF THE UNITED STATES OF AMERICA AND THE DISTRICT OF COLUMBIA) (THE\"UNITED STATES\"), AUSTRALIA, CANADA, THE HONG KONG SPECIAL ADMINISTRATIVEREGIONOF THE PEOPLE'S REPUBLIC OF CHINA OR JAPAN, OR ANY OTHER JURISDICTION IN WHICHTHE DISTRIBUTION OR RELEASE WOULD BE UNLAWFUL.</span></p><p class=\"\"><span>27 February 2026: Pelagic Credit Plc. (the \"Company\") refers to thecontemplatedprivate placement of new shares in the Company (the \"Offering\") and listing ofthe Company's shares on Euronext Growth Oslo (the \"Listing\") announced on 9February 2026, the approval of the Listing by Euronext Oslo Børs on 16February2026, and the update on the Offering and Listing announced on 17 February2026.</span></p><p class=\"\"><span>The Company hereby announces a relaunch of the Offering, targeting apost-moneyequity capitalization of approximately USD 75 million. This is based on anin-kind pre-money equity valued at USD 17.56 million. The Offering willcomprisea private placement of new shares expected to raise gross proceeds ofapproximately USD 75 million to the Company (the \"Offer Shares\"). The Offeringwill be offered at a fixed price per Offer Share of the NOK equivalent of USD2.03 (the \"Offer Price\").</span></p><p class=\"\"><span>The Company has received firm indications from a broad range of high qualityinvestors across the industrial and institutional investor universe.Furthermore, Pelagic Partners (the \"Sponsor\") will contribute up to USD 50million through its managed funds, consisting of both in-kind equity of USD17.56 million already contributed to the Company and representing thepre-moneyvaluation, and additional cash equity up to USD 32.44 million which may bescaled down depending on investor demand but not below approximately USD 27.44million. The aforementioned firm indications together with the Sponsorcontribution cover the full size of the Offering at the Offer Price.</span></p><p class=\"\"><span>The book building period in the Offering will commence on 2 March 2026 at09:00CET and close on 3 March 2026 at 16:30 CET. The Managers and the Company mayatany time resolve to shorten or extend the book building period. If the bookbuilding period is shortened or extended, any other dates referred to hereinmaybe amended accordingly.</span></p><p class=\"\"><span>The net proceeds from the Offering are expected to be used to equity-financetheacquisition of vessels pursuant to asset-backed financing transactions and forgeneral corporate purposes. In addition to the equity financing, theacquisitions are expected to be partly funded by senior secured loans.</span></p><p class=\"\"><span>The Company's largest shareholder, Marevia Holding I Co. Ltd., a wholly ownedsubsidiary of Pelagic Investment Fund RAIF V.C.I.C. PLC, and members of themanagement and the board of directors will enter into lock-up agreementspursuant to which their shares held prior to the Offering are subject tolock-upfor a period of 24 months, subject to customary terms and exemptions.</span></p><p class=\"\"><span>Euronext Oslo Børs has approved the Listing, subject to satisfaction ofapplicable admission requirements. Subject to successful completion of theOffering, the first day of Listing is expected to be on or about 9 March 2026.</span></p><p class=\"\"><span>Further announcements relating to the Offering and the Listing will be made indue course.</span></p><p class=\"\"><span>Clarksons Securities AS and Fearnley Securities AS are acting as Joint GlobalCoordinators and Joint Bookrunners in respect to the Offering and Listing (the\"Joint Global Coordinators\"). Arctic Securities AS is acting as JointBookrunnerin connection with the Offering (together with the Joint Global Coordinators,the \"Managers\"). Advokatfirmaet BAHR AS is acting as legal counsel to theCompany.</span></p><p class=\"\"><span>For further information, please contact:Atef Abou Merhi, Chairmanatef@pelagic-partners.com+357 99 405605</span></p><p class=\"\"><span>C. Tobias Backer, Chief Executive Officertobias@pelagic-credit.com+357 97 771 170 / +44 7799 815 020 / +1 917 207-8680</span></p><p class=\"\"><span>Important notice:This announcement is not and does not form a part of any offer to sell, or asolicitation of an offer to purchase, any securities of the Company. Copies ofthis announcement are not being made and may not be distributed or sent intoanyjurisdiction in which such distribution would be unlawful or would requireregistration or other measures.</span></p><p class=\"\"><span>The Offering will be directed towards Norwegian and international investors,ineach case subject to an exemption being available from offer prospectusrequirements and any other filing or registration requirements in theapplicablejurisdictions and subject to other selling restrictions. The minimumapplicationand allocation amount has been set to the NOK equivalent of EUR 100,000. TheCompany may, however, at its sole discretion, allocate shares corresponding toan amount below EUR 100,000 to the extent applicable exemptions from theprospectus requirements pursuant to Regulation (EU) 2017/1129 and ancillarylegislation are available.</span></p><p class=\"\"><span>The securities referred to in this announcement have not been and will not beregistered under the U.S. Securities Act of 1933, as amended (the \"SecuritiesAct\"), and accordingly may not be offered or sold in the United States absentregistration or an applicable exemption from the registration requirements ofthe Securities Act and in accordance with applicable U.S. state securitieslaws.The Company does not intend to register any part of the offering in the UnitedStates or to conduct a public offering of securities in the United States. Anysale in the United States of the securities mentioned in this announcementwillbe made solely to \"qualified institutional buyers\" as defined in Rule 144Aunderthe Securities Act.</span></p><p class=\"\"><span>In any EEA Member State, this communication is only addressed to and is onlydirected at qualified investors in that Member State within the meaning of theProspectus Regulation, i.e., only to investors who can receive the offerwithoutan approved prospectus in such EEA Member State. The expression \"ProspectusRegulation\" means Regulation (EU) 2017/1129 as amended (together with anyapplicable implementing measures in any Member State.</span></p><p class=\"\"><span>This communication is only being distributed to and is only directed atpersonsin the United Kingdom that are (i) investment professionals falling withinArticle 19(5) of the Financial Services and Markets Act 2000 (FinancialPromotion) Order 2005, as amended (the \"Order\") or (ii) high net worthentities,and other persons to whom this announcement may lawfully be communicated,falling within Article 49(2)(a) to (d) of the Order (all such persons togetherbeing referred to as \"relevant persons\"). This communication must not be actedon or relied on by persons who are not relevant persons. Any investment orinvestment activity to which this communication relates is available only forrelevant persons and will be engaged in only with relevant persons. Personsdistributing this communication must satisfy themselves that it is lawful todoso.</span></p><p class=\"\"><span>Matters discussed in this announcement may constitute forward-lookingstatements. Forward-looking statements are statements that are not historicalfacts and may be identified by words such as \"believe\", \"expect\",\"anticipate\",\"strategy\", \"intends\", \"estimate\", \"will\", \"may\", \"continue\", \"should\" andsimilar expressions. The forward-looking statements in this release are basedupon various assumptions, many of which are based, in turn, upon furtherassumptions. Although the Company believe that these assumptions werereasonablewhen made, these assumptions are inherently subject to significant known andunknown risks, uncertainties, contingencies and other important factors whichare difficult or impossible to predict, and are beyond their control. Actualevents may differ significantly from any anticipated development due to anumberof factors, including without limitation, changes in public sector investmentlevels, changes in the general economic, political and market conditions inthemarkets in which the Company operates, the Company's ability to attract,retainand motivate qualified personnel, changes in the Company's ability to engageincommercially acceptable acquisitions and strategic investments, and changes inlaws and regulation and the potential impact of legal proceedings and actions.Such risks, uncertainties, contingencies and other important factors couldcauseactual events to differ materially from the expectations expressed or impliedinthis release by such forward-looking statements. The Company does not make anyguarantee that the assumptions underlying the forward-looking statements inthisannouncement are free from errors nor does it accept any responsibility forthefuture accuracy of the opinions expressed in this announcement or anyobligationto update or revise the statements in this announcement to reflect subsequentevents. You should not place undue reliance on the forward-looking statementsinthis announcement.</span></p><p class=\"\"><span>The information, opinions and forward-looking statements contained in thisannouncement speak only as at its date, and are subject to change withoutnotice. The Company does not undertake any obligation to review, update,confirm, or to release publicly any revisions to any forward-lookingstatementsto reflect events that occur or circumstances that arise in relation to thecontent of this announcement.</span></p><p class=\"\"><span>Neither the Managers nor any of their affiliates makes any representation astothe accuracy or completeness of this announcement and none of them accepts anyresponsibility for the contents of this announcement or any matters referredtoherein.</span></p><p class=\"\"><span>This announcement is for information purposes only and is not to be relieduponin substitution for the exercise of independent judgment. It is not intendedasinvestment advice and under no circumstances is it to be used or considered asan offer to sell, or a solicitation of an offer to buy any securities or arecommendation to buy or sell any securities of the Company. Neither theManagers nor any of its affiliates accepts any liability arising from the useofthis announcement.</span></p><p class=\"\"><span>The distribution of this announcement and other information may be restrictedbylaw in certain jurisdictions. Persons into whose possession this announcementorsuch other information should come are required to inform themselves about andto observe any such restrictions.</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667104</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Obirfnr1a:0-pelagic-credit-plc-relaunch-of-private-placement-and-listing-on-euronext-growth-oslo/",
            "pub_date": "2026-02-27 16:30:24",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2944746:0",
            "title": "Lane Capital : Reverse acquisition and relisting drove one-off losses; focus shifts to acquisition-led growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Transformed into an active investment group after a reverse acquisition and relisting, with Q4 and full-year results heavily impacted by one-off transaction costs. Focus remains on acquisition-driven growth and portfolio expansion, with a strong equity position and no dividend for 2025.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2944746-9aa9cb4d324da15894cd9fbb38043157\" target=\"_blank\">Lane Capital  Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2944746:0-lane-capital-reverse-acquisition-and-relisting-drove-one-off-losses-focus-shifts-to-acquisition-led-growth/",
            "pub_date": "2026-02-27 16:30:32",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "sharecast:1b56c051e094b:0",
            "title": " Netflix shares surge after Warner Bros bid dumped ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The streaming giant refused to increase its $83bn, $27.75-a-share offer after Warner Bros said Paramount's latest £31-a-share bid was superior.</span></p><p class=\"\"><span>\"We've always been disciplined, and at the price required to match Paramount Skydance's latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid,\" Netflix co-chief executives Ted Sarandos and Greg Peters said in a statement.</span></p><p class=\"\"><span>Netflix’s shares surged by almost 10% in after hours trading, indicating investors were relieved the company had not ended up overpaying for Warner Bros. The Reuters news agency cited an unnamed adviser as saying they had advised the streaming service to bow out of the bidding because the deal no longer made economic sense.</span></p><p class=\"\"><span>The adviser said Netflix was bidding against a billionaire who signaled that he was willing to pay a price viewed as irrational.</span></p><p class=\"\"><span>\"There's no point in playing chicken with someone who won't turn the wheel,\" the source said, referring to billionaire Larry Ellison, co-founder, executive chairman and chief technology officer of Oracle and father of Paramount CEO David Ellison.</span></p><p class=\"\"><span>WBD had yet to formally endorse Paramount's latest proposal and any deal would still have to clear US and international regulatory hurdles.</span></p><p class=\"\"><span>If successful, Paramount would gain control of WBD’s movie studio, home of franchises including Harry Potter, Superman and Batman, as well as the HBO streaming service, which owns Game of Thrones, The White Lotus and Succession.</span></p><p class=\"\"><span>It would also gain the CNN television news channel to go with its now right-leaning CBS news service. The Ellisons are friends of US President Donald Trump, who has made no secret of his hatred for CNN, which he frequently calls \"fake news\".</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Reporting by Frank Prenesti for Sharecast.com</span></strong></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/sharecast:1b56c051e094b:0/",
            "pub_date": "2026-02-27 16:30:50",
            "source": "ShareCast",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227002071:0",
            "title": "IAG Beats Operating Profit Record — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>International Consolidated Airlines--which houses British Airways and Iberia among other carriers--posted record operating profit for 2025, strong cash generation, and lower net debt, Interactive Investor's Richard Hunter says. The strength of IAG's premium cabin offering has more than offset any weakness of demand on economy flights to the U.S., he adds. British Airways continues to deliver the highest returns within the group, Hunter notes. Tough competition and economic pressure remain as potential headwinds, alongside geopolitical concerns, he adds. Shares are up 0.85% at 4.61 pounds. (cristina.gallardo@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227002071:0/",
            "pub_date": "2026-02-27 16:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227002122:0",
            "title": "U.S. Futures, European Stocks Fall as Investor Focus Remain on Earnings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>U.S. futures for the S&amp;P 500 were down 0.2% and futures for the Dow Jones Industrial Average fell 0.4%. Changes in futures do not necessarily predict movements after the opening bell.</span></p><p class=\"\"><span>In Europe, the Stoxx Europe 600 declined 0.1% in morning trading. Freenet added 4.9% and Rightmove climbed 4.8%. On the other hand, Melrose Industries lost 9.8%, and Teleperformance dropped 7.8%. The FTSE 100 added 0.1%. Other stocks in Europe were down as France's CAC 40 decreased 0.2% and Germany's DAX dropped 0.2%.</span></p><p class=\"\"><span>The Wall Street Journal Dollar Index fell 0.1% to 94.7.</span></p><p class=\"\"><span>In commodities, Brent crude rose 1% to $71.54 a barrel, and WTI crude rose 1.2% to $65.96 a barrel. The European benchmark price for natural gas, the Dutch futures contract TTF, was down 2.2% to 31.45 euros a megawatt hour.</span></p><p class=\"\"><span>The German 10-year Bund yield held steady at 2.697%, and the yield on the 10-year U.S. Treasury was flat at 4.007%. Bond prices and yields move in opposite directions.</span></p><p class=\"\"><span>Stocks in Asia were up as Japan's Nikkei 225 index gained 0.2%, and Hong Kong's Hang Seng gained 0.9%. China's benchmark Shanghai Composite climbed 0.4%.</span></p><p class=\"\"><span>-This article was automatically generated by MarketWatch.</span></p><p class=\"\"><span>Write to Barcelona Editors at barcelonaeditors@dowjones.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227002122:0/",
            "pub_date": "2026-02-27 16:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227002096:0",
            "title": "European Indexes Mostly Edge Up in Muted Opening Trade — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>European indexes are largely higher at the open as basic-materials stocks across the continent gain. The U.K.'s FTSE 100 rises 0.35% as miners climb, with gold and silver miner Fresnillo up 5.6%. Barclays slips 1% after the collapse of a mortgage-finance company for which the bank arranged loans. Blue-chip indexes in Germany and France both struggle for direction, trading flat. Chemicals company BASF slips 3.2%, though energy stocks gain in Frankfurt, while in Paris gains for energy group Schneider Electric--up 1.3%--counter a slip in utilities. The Italian FTSE MIB edges up 0.2% as electricity infrastructure company Prysmian climbs 4%, though Banca MPS slips 2.2% after earnings. Spain's IBEX 35 is up 0.1% as construction group Acciona surges 7.4%. (josephmichael.stonor@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227002096:0/",
            "pub_date": "2026-02-27 16:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227002149:0",
            "title": "Rheinmetall to Supply Field Hospitals to Denmark",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Cristina Gallardo</span></p><p class=\"\"><span>Rheinmetall said it will supply five field hospitals to Denmark as part of a contract valued in the mid-double-digit million euro range.</span></p><p class=\"\"><span>The German arms maker said Friday that the contract was signed between its Rheinmetall Mobile Systeme subsidiary and the Danish defense ministry at the end of 2025 and booked in the fourth quarter.</span></p><p class=\"\"><span>The delivery of the Role 2 field hospitals will span two years, the company said.</span></p><p class=\"\"><span>Write to Cristina Gallardo at cristina.gallardo@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227002149:0-rheinmetall-to-supply-field-hospitals-to-denmark/",
            "pub_date": "2026-02-27 16:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN0RL:0",
            "title": "RLJ Lodging Trust reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>RLJ Lodging Trust </span><span> reported a quarterly adjusted loss of 4 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of -1 cents.  The mean expectation of six analysts for the quarter was for a loss of 6 cents per share. Wall Street expected results to range from -10 cents to -2 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 0.4% to $328.59 million from a year ago; analysts expected $319.60 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>RLJ Lodging Trust's reported EPS for the quarter was a loss of 4 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $5.85 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>RLJ Lodging Trust shares had risen by 11.3% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had fallen by about 8.1% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, one analyst negatively revised an earnings estimate</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" 5 \"hold\" and 3 \"sell\" or \"strong sell.\" The average consensus recommendation for the specialized reits peer group is  \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for RLJ Lodging Trust is $8.00, about 3.6% above its last closing price of $8.29</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 08:33 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>0.28</span></p></td><td><p class=\"\"><span>0.33</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>0.27</span></p></td><td><p class=\"\"><span>0.27</span></p></td><td><p class=\"\"><span>Met</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.46</span></p></td><td><p class=\"\"><span>0.48</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.30</span></p></td><td><p class=\"\"><span>0.31</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN0RL:0-rlj-lodging-trust-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 16:33:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ZawjCLHb:0",
            "title": "ZAWYA-PRESSR: Khaleej Times Events to reveal GCC’s most influential CFOs at the eighth edition of NAFA 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dubai</span></strong><span>: Khaleej Times Events is set to host the 8th edition of the New Age Finance &amp; Accounting (NAFA) Summit 2026 on 13th May 2026 at Address Sky View, Dubai, bringing together the UAE and GCC’s senior finance leaders for a full-day, in-person forum on enterprise finance and transformation.</span></p><p class=\"\"><span>A major highlight of this year’s summit is the launch of the GCC’s Most Influential CFOs List, recognising visionary finance leaders who are driving innovation, transformation, and sustainable growth across the region. Now in its eighth year, NAFA has cemented its position as the region’s most credible gathering for CFOs, finance directors, heads of tax, treasury, compliance, and ERP leaders, providing a platform where strategy meets execution in real-world business contexts.</span></p><p class=\"\"><span>The summit will see senior decision-makers from banking, IT, retail, manufacturing, energy, healthcare, and government sectors come together to discuss pressing topics including UAE Corporate Tax, regulatory compliance, e-invoicing readiness, AI adoption, automation, ERP transformation, and building agile finance teams. Delegates will benefit from insightful keynotes, engaging panel discussions, and meaningful networking opportunities with peers navigating similar challenges and priorities.</span></p><p class=\"\"><span>With over 30 senior finance leaders, industry experts, and policy voices participating, NAFA 2026 promises to be a high-impact forum for knowledge sharing, collaboration, and recognition of the region’s top finance talent.</span></p><p class=\"\"><span>Organisations interested in attending or exploring sponsorship opportunities can register and find more information at https://newagefinanceexpo.com/ or contact events@khaleejtimes.com.</span></p><span>Send us your press releases to pressrelease.zawya@lseg.com</span><p class=\"\"><span>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</span></p><p class=\"\"><span>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</span></p><p class=\"\"><span>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ZawjCLHb:0-zawya-pressr-khaleej-times-events-to-reveal-gcc-s-most-influential-cfos-at-the-eighth-edition-of-nafa-2026/",
            "pub_date": "2026-02-27 16:33:43",
            "source": "Zawya",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0AR:0",
            "title": "China stocks end week higher on tech, policy optimism",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    China stocks closed roughly flat on Friday but ended the week higher, as onshore investors rebuilt positions after the Lunar New Year holiday, hoping the upcoming National People's Congress will back technology and innovation. Hong Kong shares were up.</span></p><p class=\"\"><span>** China's blue-chip CSI300 Index </span><span> closed 0.3% down, while the Shanghai Composite Index </span><span> edged 0.4% higher. Hong Kong's benchmark Hang Seng Index </span><span> climbed 1%.     </span></p><p class=\"\"><span>** The CSI300 Index ended the holiday-shortened week 1.1% higher, while the Hang Seng Index has climbed 0.8%.</span></p><p class=\"\"><span>** Onshore sentiment has improved as investors rebuilt equity positions post-holiday, state-linked funds paused heavy selling, and expectations grew that the upcoming National People's Congress will unveil policies supporting technology, innovation, and domestic consumption, analysts at Morgan Stanley said in a note.</span></p><p class=\"\"><span>     ** The closely watched annual parliamentary meeting will begin on March 5, state media reported in late December.</span></p><p class=\"\"><span>** Hong Kong-listed tech majors </span><span> rebounded slightly but finished the week down 1.4%.</span></p><p class=\"\"><span>** The recent pullback in the Hang Seng Tech Index suggests some investment flows may be shifting toward consumer stocks, UBS analysts said, noting that sentiment remains positive on low valuations, reflation trades, and early strength in sectors such as baijiu (China's strong distilled liquor), dairy, and other staples.</span></p><p class=\"\"><span>** Onshore consumer staple shares </span><span> rose 0.6%.</span></p><p class=\"\"><span>** China's yuan halted a long rally on Friday after authorities made their strongest pushback yet against its gains by cutting the cost of buying dollar forwards. A weaker yuan could help money flow to the Hong Kong market via the Stock Connect scheme.  </span></p><p class=\"\"><span>** Shares of onshore semiconductor material and equipment (.CSI931743) companies fell 2.4%, following an overnight drop in U.S.-based AI darling Nvidia </span><span>. </span></p><p class=\"\"><span>** The CSI Coal Index (.CSI000820) climbed 3.5%.</span></p><p class=\"\"><span>** The U.S. International Trade Commission said on Thursday it would investigate the economic impact of revoking China's permanent normal trade status over a six-year period, a move that would likely increase tariffs on Chinese imports.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0AR:0-china-stocks-end-week-higher-on-tech-policy-optimism/",
            "pub_date": "2026-02-27 16:34:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN0MO:0",
            "title": "European shares set for eighth straight month of gains, buoyed by earnings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    European shares were steady on Friday and were set to log an eighth straight month of gains as better-than-expected corporate updates supported risk appetite despite lingering tariff and AI-disruption concerns.</span></p><p class=\"\"><span>The pan-European STOXX 600 </span><span> was up 0.1% at 634.16 points by 0820 GMT. The benchmark hovered near a record high, with mining stocks (.SXPP) trading 1.7% higher, leading sectoral gains.</span></p><p class=\"\"><span>         The benchmark is on track for its longest monthly winning run since mid-2012 to 2013.  </span></p><p class=\"\"><span>Much of February was dominated by concerns that new AI tools could disrupt traditional business and eat into their profits, along with trade ambiguities from the U.S. after President Donald Trump imposed a new global tariff.</span></p><p class=\"\"><span>However, investors took comfort from an overall improving corporate outlook in Europe, with updates from HSBC </span><span>, Nestle </span><span> and Capgemini </span><span> lifting sentiment.</span></p><p class=\"\"><span>Among early movers, online takeaway food company Delivery Hero </span><span> fell 5.2% after reporting annual gross merchandise value (GMV) slightly below market expectations, reflecting competitive pressure and a challenging economic environment.</span></p><p class=\"\"><span>Banking stocks (.SX7P), (.SX7E) slipped more than 0.4% each. Investors are monitoring developments around the sector's exposure to Market Financial Solutions, or MFS, a mortgage-finance firm that entered a UK form of insolvency this week.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN0MO:0-european-shares-set-for-eighth-straight-month-of-gains-buoyed-by-earnings/",
            "pub_date": "2026-02-27 16:34:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Edu2J2w5a:0",
            "title": "REG - Euronext Dublin - Euronext Dublin Market Cancellation Notice (EURONEXT DUBLIN) [89268]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89268</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Edu2J2w5a:0-reg-euronext-dublin-euronext-dublin-market-cancellation-notice-euronext-dublin-89268/",
            "pub_date": "2026-02-27 16:22:41",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227001965_20260227002017:0",
            "title": "Kioxia: Kawamura's Appointment Effective April 1 >285A.TO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227001965_20260227002017:0/",
            "pub_date": "2026-02-27 16:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227002016:0",
            "title": "Geely Automobile Remains Strong for Its Long-Term Value — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Geely Automobile remains strong in terms of its long-term value of its EV brands Galaxy, Zeekr and Lynk&amp;Co, says Morningstar analyst Vincent Sun. The Chinese automaker finished 2025 with vehicle sales of 1.3 million units, up 7% on year, but underperformed China's passenger vehicle growth of 9%, he says. The company's vehicle margin faces challenges as competition is leading to heavy price discounts, he says. Morningstar maintains a cautious view on the company's profitability and expect depressed vehicle margins to remain, given the competition in the domestic market, he adds. The vehicle volume growth will continue to underperform due to a lack of new model launches. That said, Geely remains Morningstar's top pick in the China auto sector on its long-term value.(jiahui.huang@wsj.com; @ivy_jiahuihuang)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227002016:0/",
            "pub_date": "2026-02-27 16:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSSLF7da:0",
            "title": "Hemogenyx Pharmaceuticals PLC Announces Total Voting Rights",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>LONDON, UK / ACCESS Newswire / February 27, 2026 /</span></strong><span> Hemogenyx Pharmaceuticals plc </span><span>, the biopharmaceutical group developing new therapies and treatments for blood diseases, announces that the total issued share capital of the Company as at 27 February 2026 consists of6,425,429ordinary shares of 1p each, none of which are held in treasury. Therefore, the total number of voting rights in the Company is 6,425,429.</span></p><p class=\"\"><span>The figure of 6,425,429 ordinary shares may be used by shareholders of the Company as the denominator for the calculations by which they will determine if they are required to notify their investment in, or a change in their interest in, the share capital of the Company under the Financial Conduct Authority's Disclosure Guidance and Transparency Rules.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Enquiries:</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Hemogenyx Pharmaceuticals plc</span></p></td><td><p class=\"\"><span>https://hemogenyx.com</span></p></td></tr><tr><td><p class=\"\"><span>Dr Vladislav Sandler, Chief Executive Officer &amp; Co-Founder</span></p></td><td><p class=\"\"><span>headquarters@hemogenyx.com</span></p></td></tr><tr><td><p class=\"\"><span>Peter Redmond, Director</span></p></td><td><p class=\"\"><span>peter.redmond@hemogenyx.com</span></p></td></tr><tr><td><p class=\"\"><span>SP Angel Corporate Finance LLP</span></p></td><td><p class=\"\"><span>Tel: +44 (0)20 3470 0470</span></p></td></tr><tr><td><p class=\"\"><span>Matthew Johnson, Vadim Alexandre, Adam Cowl</span></p></td><td></td></tr><tr><td><p class=\"\"><span>AlbR Capital Limited</span></p></td><td><p class=\"\"><span>Tel: +44 (0)20 7469 0930</span></p></td></tr><tr><td><p class=\"\"><span>Lucy Williams, Duncan Vasey, Charles Goodfellow</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Hemogenyx Pharmaceuticals plc</span></strong></p><p class=\"\"><span>Hemogenyx Pharmaceuticals is a publicly traded company </span><span> headquartered in London, with its US operating subsidiaries, Hemogenyx Pharmaceuticals LLC and Immugenyx LLC, located in New York City.</span></p><p class=\"\"><span>The Company is a clinical stage biopharmaceutical group developing new medicines and treatments to treat blood and autoimmune diseases. Hemogenyx Pharmaceuticals is developing several distinct and complementary product candidates, as well as platform technologies that it uses as engines for novel product development.</span></p><p class=\"\"><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Hemogenyx Pharmaceuticals PLC</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSSLF7da:0/",
            "pub_date": "2026-02-27 16:23:45",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN15Y:0",
            "title": "Arima Reports Real Estate Assets Valued At €563.5 Mln",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Arima Real Estate SOCIMI SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>REPORTS REAL ESTATE ASSETS VALUED AT €563.5 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN15Y:0-arima-reports-real-estate-assets-valued-at-563-5-mln/",
            "pub_date": "2026-02-27 16:24:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2944712:0",
            "title": "LASTIK: 2025 saw resilient financials and strategic progress, with 2026 guidance reflecting stable outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net sales grew 0.7% to EUR 426.6m in 2025, with adjusted EBITA at EUR 40.6m. Despite market headwinds and sector declines, profitability remained solid, supported by acquisitions, IT investments, and efficiency gains. 2026 guidance: net sales EUR 420–450m, EBITA EUR 38–44m.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2944712-c672e76e986f42820f6ccbf3657b26dd\" target=\"_blank\">Lassila &amp; Tikanoja Plc [LASTIK] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2944712:0-lastik-2025-saw-resilient-financials-and-strategic-progress-with-2026-guidance-reflecting-stable-outlook/",
            "pub_date": "2026-02-27 16:24:27",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227002026:0",
            "title": "Oil Rises With Focus on U.S.-Iran Talks, OPEC+ Meeting — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Oil prices rise as investors digest news that the U.S. and Iran will resume discussions next week after the latest round of talks wrapped up on Thursday without a deal. Brent crude rises 0.9% to $71.45 a barrel, while WTI is up 0.7% to $65.32 a barrel. Discussions \"on a technical level\" will take place next week in Vienna, Oman's Foreign Minister Badr bin Hamad al-Busaidi said in a post on X. However, markets remain on edge as any potential escalation of tensions could disrupt energy flows. Traders are also awaiting OPEC+'s meeting on Sunday for signals on future production policy. (giulia.petroni@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227002026:0/",
            "pub_date": "2026-02-27 16:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227002028:0",
            "title": "CPP Investments and Equinix to Acquire atNorth for US$4 Billion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Leading Data Center Provider in the Nordics Has Operations in Five Countries, Providing Equinix with Access to Capacity to Meet Enterprise, AI and Hyperscale Demand in Key Markets</span></p><p class=\"\"><span>TORONTO and AMSTERDAM, Feb. 27, 2026 /CNW/ - Canada Pension Plan Investment Board (CPP Investments) and Equinix, Inc. </span><span>, the world's digital infrastructure company(R) , today announced they have entered into a joint agreement to purchase atNorth--a leading Nordic high-density colocation and built-to-suit data center provider--from Partners Group, one of the largest firms in the global private markets industry.</span></p><p class=\"\"><span>The US$4 billion enterprise value transaction is subject to customary closing conditions, including regulatory approvals. The agreement between CPP Investments and Equinix will support atNorth in its continued rapid scaling, through capturing opportunities created by rising demand for data center infrastructure. CPP Investments will invest approximately US$1.6 billion, owning an approximate 60% controlling interest, and Equinix will own an approximate 40% stake. The transaction is expected to be immediately accretive upon close to Equinix's adjusted funds from operations (AFFO) per share.</span></p><p class=\"\"><span>atNorth's portfolio includes eight operational data centers alongside several sites under development across Denmark, Finland, Iceland, Norway and Sweden, as well as plans for further expansion, with 1 GW of secured power and a considerable amount of additional future capacity planned. Designed to meet increasing demand for AI and high-performance computing, several of the company's facilities are liquid cooling-enabled to support high-density workloads. Across its portfolio, atNorth integrates renewable energy sourcing, heat reuse initiatives and efficient modular design to advance circular economy principles and minimize environmental impact.</span></p><p class=\"\"><span>\"This acquisition is a powerful validation of atNorth's journey and its market position as the leading Nordics data center platform,\" said Eyjólfur Magnús Kristinsson, CEO of atNorth. \"It further illustrates the strategic importance of the region as Europe's rising AI powerhouse. I'm extremely proud to announce the next step in our chapter, welcoming this investment from CPP Investments and Equinix, which will enable access to capital, global enterprise, and hyperscale relationships, and supply chain strength required to scale at pace. Our strategy remains firmly rooted in the Nordics, and we will continue to operate independently under the atNorth brand, preserving our dedication to the communities where we operate and the culture and values that have defined our success to date.\"</span></p><p class=\"\"><span>\"This transaction builds on our long-standing and highly productive relationship with Equinix,\" said Maximilian Biagosch, Senior Managing Director &amp; Global Head of Real Assets, CPP Investments. \"It demonstrates our conviction and commitment to the data center sector, where demand continues to accelerate, fueled by continued strong enterprise demand as well as cloud and AI adoption. The Nordics are an attractive market for data center growth and the opportunity to partner with Equinix on this acquisition allows us to deploy capital at scale into a high-quality platform, helping us deliver attractive risk-adjusted returns for CPP contributors and beneficiaries.\"</span></p><p class=\"\"><span>\"The scalable sites of atNorth are very complementary to Equinix's connectivity services and global footprint. Combined with our joint focus on sustainability, this acquisition is expected to enhance our ability to help customers unlock the full potential of the Nordics' expanding digital landscape,\" explained Bruce Owen, President, EMEA, Equinix. \"For businesses looking to scale with resilience, Equinix offers a future-ready infrastructure for long-term success, maintaining the jurisdictional and data sovereignty of organizations operating in the region. We are delighted to partner with CPP Investments, whose long-term track record of investing in the sector is highly complementary to Equinix's connectivity services.\"</span></p><p class=\"\"><span>There are multiple factors contributing to the Nordics' burgeoning status as a critical hub for the next generation of digital growth. The Nordics region is widely recognized for its strong and resilient economy, supported by a long--standing emphasis on innovation, research and technical expertise. Renowned worldwide for its leadership in environmentally sustainable projects, the Nordic region provides access to renewable energy sources, bolstered by its naturally cool climates.</span></p><p class=\"\"><span>Highlights / Key Facts</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>As part of the transaction, CPP Investments and Equinix have   provisionally agreed to a financing package of US$4.2 billion (EUR3.6   billion), underwritten by a group of European and Canadian lenders to   fund the transaction as well as the capital required to fund the   expansion of the business.   </span></li><li class=\"listItem-bmN0_SHH\"><span>atNorth has an installed and active development pipeline of approximately   800 MW that will come online over the next five years. In addition, it   has plans for significant further expansion, with an additional 1 GW of   secured power and a considerable amount of future capacity planned,   providing a platform for future expansion across the Nordics.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Equinix currently operates eight data centers in the Nordics, including   five in Helsinki and three in Stockholm, contributing to a wider European   footprint of over 100 facilities across 20 countries. This regional reach   enables customers to deploy infrastructure close to end users and   directly connect with AI, cloud, network and enterprise partners anywhere   in the world.   </span></li><li class=\"listItem-bmN0_SHH\"><span>The transaction adds to CPP Investments' long-standing collaboration with   Equinix, which includes a 2024 joint venture alongside GIC to expand the   Equinix xScale(R) data center program.   </span></li><li class=\"listItem-bmN0_SHH\"><span>The investment further enhances CPP Investments' global data center   strategy and builds out its presence in Europe.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Designing for responsible operations and in line with atNorth's   sustainability focus, Equinix operates all its European facilities with   100% renewable energy coverage and is on track to achieve its global   net-zero target by 2040. The company's environmental strategy centers   around implementing energy efficiency initiatives to optimize energy   usage, piloting innovative decarbonization solutions and collaborating   with suppliers to address emissions.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Equinix delivers customer-controlled sovereignty, providing the   foundation of digital infrastructure--secure facilities, reliable power,   private connectivity--with customers keeping 100% control of their   technology stack, data and operational decisions. The company's global   infrastructure enables organizations to access comprehensive ecosystems   around the world while maintaining uncompromising local control.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Equinix was advised by Guggenheim Securities Europe Ltd. as financial   advisor as well as Slaughter and May as legal advisor. </span></li></ul><p class=\"\"><span>Additional Resources</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Sustainability at Equinix [website]   </span></li><li class=\"listItem-bmN0_SHH\"><span>Unmatched interconnection, scalable colocation and infrastructure across   Europe, the Middle East and Africa [website]   </span><br/><span> -- What's Driving the Digital Economy in the Nordic Countries? [blog] </span><br/><span> </span><br/><span> -- The Future of Autonomous Networking: How AI Is Redefining </span><br/><span> Connectivity [blog] </span></li></ul><p class=\"\"><span>About atNorth</span></p><p class=\"\"><span>atNorth is the leading Nordic data center company that offers cost-effective, scalable high-density colocation and built-to-suit services trusted by industry-leading organizations. With sustainability at its core, atNorth's data centers run on renewable energy resources and support circular economy principles. All atNorth sites leverage innovative design, power efficiency, and intelligent operations to provide long-term infrastructure and flexible colocation deployments. atNorth is headquartered in Reykjavik, Iceland and operates eight data centers in strategic locations across the Nordics, as well as a ninth under construction in Kouvola, Finland, a tenth site in Ølgod, Denmark and an eleventh campus in Stockholm, Sweden. The business has also announced a new mega-site development in the Sollefteå Municipality in Sweden.</span></p><p class=\"\"><span>For more information, visit atNorth.com or follow atNorth on LinkedIn.</span></p><p class=\"\"><span>About CPP Investments</span></p><p class=\"\"><span>Canada Pension Plan Investment Board (CPP Investments(TM)) is a professional investment management organization that manages the Canada Pension Plan Fund in the best interest of the more than 22 million contributors and beneficiaries. In order to build diversified portfolios of assets, we make investments around the world in public equities, private equities, real estate, infrastructure, fixed income and alternative strategies including in partnership with funds. Headquartered in Toronto, with offices in Hong Kong, London, Mumbai, New York City, São Paulo and Sydney, CPP Investments is governed and managed independently of the Canada Pension Plan and at arm's length from governments. At December 31, 2025, the Fund totaled C$780.7 billion. For more information, please visit www.cppinvestments.com or follow us on LinkedIn, Instagram or on X @CPPInvestments.</span></p><p class=\"\"><span>About Equinix</span></p><p class=\"\"><span>Equinix, Inc. </span><span> shortens the path to boundless connectivity anywhere in the world. Its digital infrastructure, data center footprint and interconnected ecosystems empower innovations that enhance our work, life and planet. Equinix connects economies, countries, organizations and communities, delivering seamless digital experiences and cutting-edge AI--quickly, efficiently and everywhere.</span></p><p class=\"\"><span>Forward-Looking Statements</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227002028:0/",
            "pub_date": "2026-02-27 16:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2944663:0",
            "title": "PPL: 2025 saw lower earnings but record volumes, major project progress, and a $0.71 dividend declared",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Full year 2025 earnings and adjusted EBITDA declined year-over-year, but record pipeline and facilities volumes were achieved. Major pipeline expansions and LNG projects advanced, with long-term contracts supporting future growth. Dividend declared at $0.71 per share.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2944663-e04bede7b372fbd91cba5aca32bc7498\" target=\"_blank\">Pembina Pipeline Corporation [PPL] Earnings Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2944663:0-ppl-2025-saw-lower-earnings-but-record-volumes-major-project-progress-and-a-0-71-dividend-declared/",
            "pub_date": "2026-02-27 16:25:13",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN10P:0",
            "title": "Premia FY 2025 Net Profit Up At EUR 45.5 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Premia SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY 2025 NET PROFIT EUR 45.5 MILLION VERSUS EUR 40.9 MILLION YEAR AGO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY 2025 ADJUSTED EBITDA EUR 24.1 MILLION VERSUS EUR 14.1 MILLION YEAR AGO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY 2025 REVENUE EUR 37.5 MILLION VERSUS EUR 22.4 MILLION YEAR AGO</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN10P:0-premia-fy-2025-net-profit-up-at-eur-45-5-million/",
            "pub_date": "2026-02-27 16:25:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2944662:0",
            "title": "PHM: Revenue up 27% and EBITDA up fivefold, driven by Zepzelca® milestones and licensing deals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew 27% to €221.4M in 2025, with EBITDA up fivefold and net income rising 180%. Regulatory milestones for Zepzelca® and strong R&amp;D investment position the company for further growth, pending key European approvals in 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2944662-1aa67b51fb52f604529a1501e60e2292\" target=\"_blank\">Pharma Mar SA [PHM] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2944662:0-phm-revenue-up-27-and-ebitda-up-fivefold-driven-by-zepzelca-milestones-and-licensing-deals/",
            "pub_date": "2026-02-27 16:25:31",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN0J0:0",
            "title": "Barclays shares fall on possible losses from collapse of Market Financial Solutions",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Barclays shares fell in early trade on Friday after a report in the Times said the company faces potential losses related to the collapse of UK mortgage provider Market Financial Solutions (MFS). </span></p><p class=\"\"><span>By 0822 GMT. shares were down 1.1% at 467 pence per share, underperforming the FTSE 350 index of bank stocks, which was up 0.18%. </span></p><p class=\"\"><span>    Barclays did not immediately respond to request for comment.  </span></p><p class=\"\"><span>The Times reported Barclays has 600 million pound ($809.70 million) exposure to MFS. Citi said that the figure may warrant some caution. </span></p><p class=\"\"><span>\"Arranging a loan is very different to retaining that risk on B/S (balance sheet),\" Citi said. </span></p><p class=\"\"><span>\"Also not clear if/how much could already be provisioned against (if anything).\"</span></p><p class=\"\"><span>Shares in Jefferies Financial Group </span><span> fell 3.4% on Thursday after Bloomberg reported that the company had an exposure of about 100 million pounds to MFS.  </span></p><p class=\"\"><span>($1 = 0.7410 pounds)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN0J0:0-barclays-shares-fall-on-possible-losses-from-collapse-of-market-financial-solutions/",
            "pub_date": "2026-02-27 16:25:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2944726:0",
            "title": "ETE: Strong FY25 results with €1.3b PAT, 10% fee growth, and 60% payout, supporting future growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>FY25 saw resilient profitability with PAT at €1.3b, strong fee growth, and robust capital ratios. Strategic investments in digital and technology, along with high payout ratios and additional capital distributions, support a positive outlook through 2028.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2944726-96f0381ba62b9cb072d301dfc42c0338\" target=\"_blank\">National Bank of Greece S.A. [ETE] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2944726:0-ete-strong-fy25-results-with-1-3b-pat-10-fee-growth-and-60-payout-supporting-future-growth/",
            "pub_date": "2026-02-27 16:26:40",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227001993:0",
            "title": "Dollar Edges Lower Amid Investor Caution — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The dollar falls against a basket of currencies as tensions between the U.S. and Iran and tariff uncertainty leave investors cautious. Falls are limited as a drop in U.S. tech stocks stokes risk aversion. Still, investors remain wary of buying the dollar amid concerns about tariff policies, central bank independence and geopolitical interventions, including in Iran. Demand from international investors to hedge their U.S. assets against the risk of a dollar decline still \"plays a significant role,\" says BNY's Bob Savage in a note. U.S. producer price data for January will be watched at 1330 GMT. The DXY dollar index falls 0.2% to 97.63, although it remains within its recent tight trading range. (jessica.fleetham@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227001993:0/",
            "pub_date": "2026-02-27 16:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2944661:0",
            "title": "PHM: Net profit up 187% to €75M, revenue up 27%, with strong oncology sales and new FDA approvals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net profit rose 187% to €75.0 million on 27% revenue growth, driven by strong oncology sales, milestone payments, and new FDA approvals. Cash position improved, and a €1.00 per share dividend is proposed. R&amp;D investment remains high at 43% of revenue.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2944661-cc6071354803132492527cd0cb657927\" target=\"_blank\">Pharma Mar SA [PHM] Earnings Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2944661:0-phm-net-profit-up-187-to-75m-revenue-up-27-with-strong-oncology-sales-and-new-fda-approvals/",
            "pub_date": "2026-02-27 16:17:15",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUA7XHDZJ:0",
            "title": "CPP Investments And Equinix To Acquire Atnorth For $4 Billion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Equinix Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CPP INVESTMENTS AND EQUINIX TO ACQUIRE ATNORTH FOR US$4 BILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQUINIX INC - CPP INVESTMENTS TO HOLD 60% STAKE, EQUINIX 40%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQUINIX INC - DEAL EXPECTED TO BE ACCRETIVE TO EQUINIX'S AFFO</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQUINIX INC: CPP INVESTMENTS WILL INVEST APPROXIMATELY US$1.6 BILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUA7XHDZJ:0-cpp-investments-and-equinix-to-acquire-atnorth-for-4-billion/",
            "pub_date": "2026-02-27 16:17:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227001927:0",
            "title": "Rheinmetall to Supply Field Hospitals to Denmark",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Cristina Gallardo</span></p><p class=\"\"><span>Rheinmetall said it will supply five field hospitals to Denmark as part of a contract valued in the mid-double-digit million euro range.</span></p><p class=\"\"><span>The German arms maker said Friday that the contract was signed between its Rheinmetall Mobile Systeme subsidiary and the Danish defense ministry at the end of 2025 and booked in the fourth quarter.</span></p><p class=\"\"><span>The delivery of the Role 2 field hospitals will span two years, the company said.</span></p><p class=\"\"><span>Write to Cristina Gallardo at cristina.gallardo@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227001927:0/",
            "pub_date": "2026-02-27 16:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}