{
    "data": [
        {
            "id": "DJN_DN20250205005040:0",
            "title": "News Highlights: Top Financial Services News of the Day - Wednesday at 7 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Options Traders Bet the Rally in Big Tech Stocks Has More Room to Run</strong></p><p class=\"\">They are scooping up contracts that would pay out if stocks like Apple and Amazon race higher in the next few weeks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Crypto Industry Looks to New SEC Task Force for Quick Action in Its Favor</strong></p><p class=\"\">Industry groups have a wish list they say could bring more regulatory clarity around cryptocurrencies and allow for growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Venture Firm Founded by Ex-Apollo Partner Acts as Sherpa to Startups Raising Debt</strong></p><p class=\"\">Overlap Holdings blends traditional venture investing-it just raised a $33 million fund-with lender-startup matchmaking.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Elizabeth Warren Agrees With Trump: Big Banks Discriminate</strong></p><p class=\"\">The progressive senator from Massachusetts says banks have been shutting down too many accounts without explanation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations</strong></p><p class=\"\">Spain's biggest bank by assets was also confident it would be able to boost profitability again in 2025, raising a target despite projecting broadly stable revenue for the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Credit Agricole Lifts Dividend After Hitting Growth Target a Year Early</strong></p><p class=\"\">The lender raised its dividend by 5% on year, after exceeding its medium-term growth target a year ahead of schedule.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Services Roundup: Market Talk</strong></p><p class=\"\">Find insight on Santander, BlackRock, PayPal and more in the latest Market Talks covering Financial Services.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Its Direct Stakes in Three Companies</strong></p><p class=\"\">The firm said it would increase its investment in the companies by $1.1 billion in total as part of its unusual strategy of taking long-term stakes in businesses it likes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apollo Eyes 'Industrial Renaissance' After Investing Record $222 Billion Last Year</strong></p><p class=\"\">Apollo Global Management invested a firm record of $222 billion last year as the credit specialist sees increased opportunities to finance infrastructure developers in what it calls a \"global industrial renaissance.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Department Says DOGE's Access to Payment Data Is 'Read Only'</strong></p><p class=\"\">The letter comes after people tied to billionaire Elon Musk gained unusual access to the system.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005040:0-news-highlights-top-financial-services-news-of-the-day-wednesday-at-7-am-et/",
            "pub_date": "2025-02-05 20:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005041:0",
            "title": "News Highlights: Top Energy News of the Day - Wednesday at 7 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Falls Despite Trump Reimposing 'Maximum Pressure' on Iran</strong></p><p class=\"\">Oil prices edged lower and while stricter enforcement of sanctions on Iran could put as much as 1 million barrels a day of oil supply at risk, the reduced flows from Iran won't help lower prices, according to ING.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Venezuela's Citgo Is for Sale-at a Discount</strong></p><p class=\"\">The coming auction for Venezuela's Citgo Petroleum could leave its buyer on the hook to other creditors of the South American country, a stumbling block for the court-ordered sale.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Find insight on TotalEnergies, oil and natural gas futures, and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV's Net Profit Rises Despite Weak Refining Margins</strong></p><p class=\"\">The oil-and-gas company's refining margin fell to $5.9 a barrel, compared with $9.9 a barrel a year ago.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005041:0-news-highlights-top-energy-news-of-the-day-wednesday-at-7-am-et/",
            "pub_date": "2025-02-05 20:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005043:0",
            "title": "News Highlights: Top Company News of the Day - Wednesday at 7 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Bolstered by Streaming Gains, 'Moana 2'</strong></p><p class=\"\">The entertainment company topped Wall Street expectations on core metrics; meanwhile, its streaming push continues.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda Deal to Create World's No. 3 Automaker</strong></p><p class=\"\">Shares in Nissan fell while Honda stock closed higher, reflecting investor views that Nissan was more likely to benefit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Plans to Crack Down on E-Commerce Platforms Amid Product Safety Concerns</strong></p><p class=\"\">The commission wants platforms like Shein to provide data on the products coming into the region.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Venezuela's Citgo Is for Sale-at a Discount</strong></p><p class=\"\">The coming auction for Venezuela's Citgo Petroleum could leave its buyer on the hook to other creditors of the South American country, a stumbling block for the court-ordered sale.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tesla Stock Is Falling. California Might Be Turning Against Elon Musk.</strong></p><p class=\"\">Investors are looking for evidence Musk's politics are hurting Tesla. It's hard to find, but California might be turning against Musk-slowly.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Outlook Provides Some Welcome Relief</strong></p><p class=\"\">The company's shares rose as investors breathed a sigh of relief on strong sales growth and guidance, despite ongoing capacity constraints and fears over the U.S. demand outlook for Wegovy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Toyota Boosts Earnings Guidance, to Set Up China EV Unit</strong></p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Watch Arm's Earnings for Clues on What DeepSeek Means for AI</strong></p><p class=\"\">The company makes money by licensing its chip designs to semiconductor companies and smartphone makers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005043:0-news-highlights-top-company-news-of-the-day-wednesday-at-7-am-et/",
            "pub_date": "2025-02-05 20:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005038:0",
            "title": "Jones Soda Appoints New CEO Scott Harvey and CFO Brian Meadows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:15 GMT) </strong>*Jones Soda Appoints New CEO Scott Harvey And CFO Brian Meadows &gt;JSDA.L<br/><strong class=\"root-Tkn6WL2y\">(12:15 GMT) </strong>Press Release: Jones Soda Appoints New CEO Scott Harvey and CFO Brian Meadows</p><p class=\"\">Jones Soda Appoints New CEO Scott Harvey and CFO Brian Meadows</p><p class=\"\">PR Newswire</p><p class=\"\">SEATTLE, Feb. 5, 2025</p><p class=\"\">Experienced Executives Plan to Execute Strategic Plan Focused on Driving Profitable Growth</p><p class=\"\">SEATTLE, Feb. 5, 2025 /PRNewswire/ — Jones Soda Co. (\"Jones\" or the \"Company\")  (, ) today announced the hiring of proven business executives Scott Harvey and Brian Meadows to serve as the Company's new Chief Executive Officer and Chief Financial Officer, respectively. Both are expected to be instrumental in implementing a strategic plan designed to generate profitable growth and transform Jones from a craft soda company into a full-fledged beverage company.</p><p class=\"\">\"In the last three months we have adjusted our business plan to prioritize what we believe to be the most promising segments of our portfolio, including new products in our innovation pipeline. We are confident that we now have all the pieces in place to deliver high growth and profitable performance,\" said Paul Norman, Jones' Chairman of the Board of Directors who has served as Interim Chief Executive Officer and Chief Financial Officer since late 2024. \"Both Scott and Brian have deep food and beverage experience, have successfully driven business transformation in their previous roles, and we believe will provide immediate hands-on value in implementing our strategy.\"</p><p class=\"\">\"I'm impressed with the steps that Jones has taken to expand beyond its craft soda roots by adding new product lines and formats that I believe are aligned with the preferences of today's consumer,\" said Mr. Harvey. \"I believe the Company's strategic plan provides a clear path to leveraging that foundation to achieve profitability, and I look forward to working with the team to put the plan into action.\"</p><p class=\"\">Scott Harvey most recently served as president of Dunn Brothers Coffee, a chain of coffee shops offering small-batch roast coffee in seven states. His 40-year career also includes top executive posts with Golden Krust Caribbean Bakery, Black Rifle Coffee Company, Nathan's Famous and Einstein Noah Restaurant Group, where his last position involved leading operations for 850 corporate, license and franchise restaurants. His achievements include orchestrating sustained revenue growth, aligning spending with growth objectives, and building high-performing cultures. He earned a B.S. in hotel and restaurant management from Johnson &amp; Wales University.</p><p class=\"\">Brian Meadows has over 25 years of experience as a Chief Financial Officer and senior executive in CPG, food ingredients, telecommunications and other industries, including public companies. He most recently served as Chief Financial Officer for Simply Better Brands Corporation, where he helped guide the development and growth of that company's HERO brand TRUBAR(TM) . He also has deep expertise in growth, cash flow and risk management as well as in both equity and debt capital raises, and extensive involvement in strategy and operations. He holds Certified Financials Analyst (CFA) and Certified Public Accountant (CPA) designations and earned an MBA from the University of Glasgow.</p><p class=\"\">Both appointments are effective immediately.</p><p class=\"\">Under the current strategic plan, Jones intends to concentrate on key new and legacy products in areas including modern soda, adult beverages and craft soda.</p><p class=\"\">In the craft soda category, the Company plans to emphasize newer formats such as its 7.5 oz Jones Minis and zero-sugar versions of its most popular flavors while also continuing to market its mainline 12 oz craft sodas, known for their unique flavors, pure cane sugar formulations, user-generated photo labels, and premium taste.</p><p class=\"\">In the modern soda category, the Company intends to emphasize Pop Jones, a family of all-natural, 30-calorie functional sodas with just 4 grams of sugar and generous fiber and immune support, and Fiesta Jones, a Latin-inspired collection developed for convenience stores with only 80 calories, no artificial colors or caffeine, and resealable aluminum bottles.</p><p class=\"\">In the adult beverage category, the Company expects to focus on Spiked Jones, a hard craft soda that combines six of Jones' classic pure cane sugar soda flavors with hard ciders, and Mary Jones Hemp Delta-9 (HD9) beverages, a line of hemp-derived THC-infused alcohol alternatives.</p><p class=\"\">Several of these product lines are included in the new distribution agreements covering 2,000 convenience stores that were announced last month, marking Jones' first significant presence in the convenience channel in its nearly 30-year history.</p><p class=\"\">About Jones Soda</p><p class=\"\">Jones Soda Co.(R) (, ) is a leading developer of sodas and hemp-infused beverages known for their premium taste, unique flavors, and unconventional brand personality. Launched in 1996 as the original craft soda brand, the Company today markets a diverse portfolio of sodas, mixers, spiked soda, and wellness beverages under the Jones(R) Soda brand as well as a line of award-winning hemp beverages and edibles leveraging Jones' trademark flavors under the Mary Jones brand. For more information, visit www.jonessoda.com, www.myjones.com,  or https://gomaryjones.com</p><p class=\"\">The CSE does not accept responsibility for the adequacy or accuracy of this release.</p><p class=\"\">NEITHER THE CANADIAN SECURITIES EXCHANGE NOR ITS REGULATIONS SERVICES PROVIDER HAVE REVIEWED OR ACCEPT RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.</p><p class=\"\">Cautionary Statements Regarding Forward--Looking Information</p><p class=\"\">This news release may contain both forward--looking information and forward-looking statements within the meaning of applicable securities legislation in both Canada and the United States, which reflect management's current expectations regarding future events. Such information and statements include, without limitation,  information regarding the successful implementation of the Company's updated strategic plan and the focus on specific beverage product offerings. Although the Company believes that such information and statements are reasonable, it can give no assurance that such expectations will prove to be correct.</p><p class=\"\">Both forward--looking information and forward-looking statements are typically identified by words such as: \"believe\", \"expect\", \"anticipate\", \"intend\", \"estimate\", \"postulate\" and similar expressions, or are those, which, by their nature, refer to future events. The Company cautions investors that any forward--looking information or forward-looking statements provided by the Company are not a guarantee of future results or performance and that such forward--looking information or forward-looking statements are based upon a number of estimates and assumptions of management in light of management's experience and perception of trends, current conditions and expected developments, as well as other factors that management believes to be relevant and reasonable in the circumstances, as of the date of this news release including, without limitation, that the Company's management will be able to successfully implement the Company's updated strategic in the manner intended; that the Company will be able to successfully launch the products it intends to launch; that general business and economic conditions will not change in a material adverse manner; and assumptions regarding political and regulatory stability and stability in financial and capital markets.</p><p class=\"\">Forward--looking statements also involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward--looking statements. Such risks and other factors include,  among others: the risk that the Company may not be able execute on its strategic plan as intended or focus on the products it intends to focus on; the state of the financial markets for the Company's securities; the Company's ability to raise the necessary capital or to be fully able to implement its business strategies; and other risks and factors that the Company is unaware of at this time.</p><p class=\"\">The forward--looking statements contained in this news release are made as of the date of this news release. The Company disclaims any intention or obligation to update  or revise any forward-- looking statements, whether as a result of new information, future events or otherwise, except as required by law.</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/jones-soda-appoints-new-ceo-scott-harvey-and-cfo-brian-meadows-302368652.html</p><p class=\"\">SOURCE Jones Soda</p><p class=\"\">/CONTACT: Brandon Dubinsky, JSPR, max@jillschmidtpr.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005038:0/",
            "pub_date": "2025-02-05 20:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205008403:0",
            "title": "Harley-Davidson shares slip after Q4 loss amid 'cyclical headwinds for discretionary products'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Harley-Davidson Inc.'s (HOG) stock was down 2% in premarket trading Wednesday after the iconic motorbike maker reported a worse-than-expected fourth-quarter loss. The company's chief executive Jochen Zeitz said that the high-interest rate environment has impacted consumer confidence.</p><p class=\"\">Harley-Davidson reported a fourth-quarter loss of 93 cents a share. Analysts surveyed by FactSet were looking for a loss of 66 cents a share.</p><p class=\"\">Revenue fell 35% year-over-year to $688 million, above the FactSet estimate of $462 million.</p><p class=\"\">\"In 2024, we saw our performance being significantly impacted by the continued cyclical headwinds for discretionary products, including the high-interest rate environment affecting consumer confidence,\" said Harley-Davidson CEO Jochen Zeitz, in a statement.</p><p class=\"\">(This is a developing news story with updates to come.)</p><p class=\"\">-James Rogers</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205008403:0/",
            "pub_date": "2025-02-05 20:15:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005070:0",
            "title": "Fed Vice Chair Jefferson Calls for Caution on Further Rate Cuts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fed Vice Chair Jefferson Calls for Caution on Further Rate Cuts By Vicky Ge Huang</p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said the central bank should continue to be cautious about further adjustments to interest rates as long as the economy and labor markets remain strong.</p><p class=\"\">In a lecture at Lafayette College in Easton, Pa., Jefferson said that the economy and the labor market came into 2025 with momentum after a solid 2024, supporting the Fed's move last month to hold rates steady after three straight meetings of cuts.</p><p class=\"\">Jefferson noted that inflation remains above the central bank's target, and that its path down from multi-decade highs in 2022 has been \"bumpy,\" which he said he expects to continue.</p><p class=\"\">\"I do not think we need to be in a hurry to change our stance,\" Jefferson said Tuesday night, according to a published text of his remarks.</p><p class=\"\">The Federal Reserve's Mary Daly is also in no rush to lower interest rates until inflation is closing in on the central bank's 2% target.</p><p class=\"\">A solid economic backdrop gives the Fed the luxury of time to hold policy where it is until disinflation progress resumes, the San Francisco Fed President said on Tuesday. \"[The economy] came into 2025 in a very good place,\" Daly said at an event hosted by the Commonwealth Club World Affairs of California.</p><p class=\"\">\"Growth is solid, the labor market is solid, and inflation is coming down, albeit gradually, but we're heading toward our 2% target.\"</p><p class=\"\">Top News Fed Vice Chair Philip Jefferson Urges Patience on Rate Cuts</p><p class=\"\">A solid economy and still-too-high inflation argue for holding interest rates steady until more progress is made in slowing price growth, Federal Reserve Vice Chair Philip Jefferson said on Tuesday evening, echoing recent remarks from several of his colleagues on the Federal Open Market Committee.</p><p class=\"\">\"As long as the economy and labor market remain strong, I see it as appropriate for the Committee to be cautious in making further adjustments,\" Jefferson said in prepared remarks for an address at Lafayette College in Easton, Pa., on Tuesday evening.</p><p class=\"\">\"Over the medium term, I continue to see a gradual reduction in the level of monetary policy restraint placed on the economy as we move toward a more neutral stance as the most likely outcome.\"</p><p class=\"\">Jefferson is a voting member of the Federal Open Market Committee, the Fed's policymaking body. He has served on the Fed's Board of Governors since May 2022.</p><p class=\"\">The FOMC held its target for the federal-funds rate at a range of 4.25% to 4.5% at its January meeting. It cut rates by a total of a percentage point at its final three meetings of 2024.</p><p class=\"\">\"The U.S. economy is starting the year in a good position,\" Jefferson said. \"I expect inflation's slow descent to continue, and I anticipate that economic growth and labor market conditions will remain solid.\"</p><p class=\"\">Jefferson attributed the continuing economic resilience despite widespread forecasts of a downturn over the past few years to the strength of the American consumer, with spending growth supported by a solid labor market and low unemployment. (Barron's)</p><p class=\"\">U.S. Economy Americans Kiss Job Hopping Goodbye</p><p class=\"\">The U.S. job market is still solid. But more workers are staying put, because the chance to trade up to a better job is rarer . Americans quit 39.6 million jobs in 2024, down 11% from the year before and down 22% from a recent peak in 2022, according to Labor Department data.</p><p class=\"\">How U.S. Agriculture Market Is Approaching Tariffs</p><p class=\"\">U.S. agriculture is attempting to maintain optimism in the face of President Donald Trump's threats of tariffs on its major customers - Canada, Mexico, and China.</p><p class=\"\">How U.S. Manufacturers Could Blunt the Hit From Tariffs</p><p class=\"\">Some manufacturers say they will consider bringing production to the U.S. or raising prices to mitigate the effects of potential Trump administration tariffs.</p><p class=\"\">U.S. Factory Orders Fell in December</p><p class=\"\">Orders for goods from American manufacturers fell in December, a second straight month of declines, according to Commerce Department data released Tuesday. U.S. factory orders declined by 0.9% in the last month of 2024 to $578.5 billion, from $583.7 billion in November. Economists surveyed by The Wall Street Journal had expected factory orders to fall by 0.8% month over month. The latest November figure also reflected a downward revision from the Commerce Department's initial estimate a month ago. (Dow Jones Newswires)</p><p class=\"\">Financial Regulation Elizabeth Warren Agrees With Trump: Big Banks Discriminate</p><p class=\"\">Elizabeth Warren agrees with President Trump about something. The Democratic senator from Massachusetts told Trump on Tuesday that she thinks the White House should take action to stop what she said were discriminatory practices by the country's biggest banks, according to a letter from her office that was viewed by The Wall Street Journal.</p><p class=\"\">CFTC Reorganizes Enforcement Division Into Two Task Forces</p><p class=\"\">The Commodity Futures Trading Commission is reorganizing its enforcement division in a move it said will end the practice of regulation by enforcement.</p><p class=\"\">Crypto Industry Looks to New SEC Task Force for Action in Its Favor</p><p class=\"\">Many in the cryptocurrency industry are optimistic that a new task force formed by the U.S. securities regulator will provide a road map for growth in the industry that contrasts with the regulation-by-enforcement approach under the Biden administration.</p><p class=\"\">Robinhood Yanks Super Bowl Betting Contracts</p><p class=\"\">Robinhood Markets said it was withdrawing its plans to offer betting contracts on the Super Bowl, following pushback from the Commodity Futures Trading Commission, which raised concerns that the contracts might be illegal.</p><p class=\"\">Forward Guidance Wednesday (all times ET)</p><p class=\"\">8:15 a.m.: ADP National Employment Report</p><p class=\"\">8:30 a.m.: U.S. International Trade in Goods &amp; Services</p><p class=\"\">9:45 a.m.: U.S. Services PMI</p><p class=\"\">10 a.m.: U.S. Housing Vacancies</p><p class=\"\">10 a.m.: ISM Report On Business Services PMI</p><p class=\"\">7:30 p.m.: Federal Reserve Vice Chair Philip Jefferson speaks at Swarthmore College</p><p class=\"\">Thursday</p><p class=\"\">7 a.m.: U.K. interest rate decision</p><p class=\"\">8:30 a.m.: Unemployment Insurance Weekly Claims Report - Initial Claims</p><p class=\"\">2:30 p.m.: Atlantic Council event with Federal Reserve Governor Christopher Waller on 'Navigating the Future of Payments'</p><p class=\"\">Research Morgan Stanley's Finally Given Up on Idea the Fed Will Cut in March</p><p class=\"\">Morgan Stanley has now given up on its contrarian stance the Federal Reserve will cut interest rates in March, Steve Goldstein reports for MarketWatch.</p><p class=\"\">It was an idea the firm held onto even after Fed Chair Jerome Powell's last press conference, when he made clear the central bank was in no hurry to cut interest rates.</p><p class=\"\">But what made Morgan Stanley crack wasn't Powell but President Donald Trump.</p><p class=\"\">\"Our prior outlook for two cuts in the first half of the year was based on 1) a 'fast announcement/slow implementation' tariff policy, and 2) a preference for tariffs on trade with China over other trading partners. These assumptions left room for inflation to accelerate through mid-year without much trade policy uncertainty, providing a pathway for the Fed to cut its policy rate by 25bp in March and June. We still think these views are the right ones, but we are not as confident regarding slow implementation as we were before,\" said economists led by Michael Gapen.</p><p class=\"\">Trump did pause tariffs against Mexico and Canada but left the 10% incremental tariff on China intact.</p><p class=\"\">\"We see this episode of on-again-off-again tariffs as amplifying the views expressed by the Fed at its December meeting, when most FOMC members were concerned about greater uncertainty regarding [the personal consumption expenditure price index] and saw risks to PCE inflation as tilted to the upside. That uncertainty and upside risk have arrived more quickly than we anticipated,\" said the economists.</p><p class=\"\">CME's FedWatch tool, which is based on fed funds futures trading, implies a 16.5% chance of a March cut.</p><p class=\"\">Basis Points Over the course of less than two weeks, the Trump administration largely dismantled the work of a 10,000-person, $40 billion foreign-assistance agency and the thousands of people in nonprofits and other groups that work with it. Antitrust enforcement shouldn't become a weapon in trade disputes , a European Commission spokesperson said as the U.S. and China imposed tariffs on each other this week. One country that is having a good trade war is Great Britain. At least, so far, it is managing to duck the fight . French factory production unexpectedly dropped at the end of the year, contributing to a backsliding in the eurozone's second-largest economy, with few signs of a rapid rebound at the start of 2025. A private gauge of China's service activity expanded at a slower clip in January, pointing in the same direction as official data as both demand and supply cooled at the start of the year. China reported record-high tourism revenue and travel numbers during the Lunar New Year holiday, offering a glimmer of hope for policymakers as they continue their efforts to boost domestic demand. South Korea's headline inflation accelerated at a faster-than-expected pace in the first month of the year to stay above the central bank's 2% target. The consumer-price index rose 2.2% in January from a year earlier, following a 1.9% gain in December. (Dow Jones Newswires) Gold demand hit a new record in 2024 driven by central banks and investors, according to a new report. About Us</p><p class=\"\">WSJ Pro Central Banking brings you central banking news, analysis and insights from WSJ's global team of reporters and editors. This newsletter was compiled by markets reporter Vicky Ge Huang  in New York. Send your tips, suggestions and feedback to [vicky.huang@wsj.com].</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005070:0-fed-vice-chair-jefferson-calls-for-caution-on-further-rate-cuts/",
            "pub_date": "2025-02-05 20:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV102:0",
            "title": "Brazil's farmers bet on solar energy and batteries to stabilize power supply",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brazilian farmers have been expanding their solar energy capacity and testing batteries as a storage solution, in a bid to make electricity supplies more predictable and potentially reduce diesel consumption, according to growers and experts.</p><p class=\"\">Increased use of alternative energy in Brazil, the world's largest exporter of various food staples, means greater business for equipment providers, reduced dependence on fossil fuels, and more efficient farming.</p><p class=\"\">Companies that provide energy solutions, such as WEG , say that farmers' interest in battery-based storage systems has risen in recent months, with projects coming into fruition after a sharp drop in battery prices.</p><p class=\"\">Rural properties currently account for approximately 14% of all installed solar power in Brazil, with 4.8 gigawatts distributed via small photovoltaic stations, often built on rooftops or unused land.      Solar capacity in agriculture has grown more than seven-fold since 2020, when renewable-source projects took off across the country, according to a survey by the Brazilian Association of Photovoltaic Solar Energy. The association said the number of rural consumer units using solar panels had jumped to 471,000 by the end of 2024, from 54,000 four years earlier.   Brazilian farmers use solar power for crop irrigation, air conditioning systems, lighting, pumping water into reservoirs and powering cold storage rooms.</p><p class=\"\">The use of batteries may also reduce diesel consumption on farms, where generators powered by the fuel provide electricity for irrigation and agricultural machinery on farms not connected to the power grid.</p><p class=\"\">Farm group Bom Futuro, a large grain and oilseed producer in Mato Grosso state that invests in power generation, is evaluating whether to use batteries as a means to reduce losses associated with power outages.</p><p class=\"\">Livio Costa, Bom Futuro's manager of energy, said interruption of electricity supplies disrupts cotton machines and production, causing material losses. </p><p class=\"\">\"Let's say the power goes out for 15 minutes, it will take up to two hours to resume production again,\" he said. \"This doesn't just happen once. It happens a few times during the harvest.\" </p><p class=\"\">Bom Futuro's investments in power generation reflect increased on-farm demand for drying and storage of grain and power-intensive cotton processing. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV102:0-brazil-s-farmers-bet-on-solar-energy-and-batteries-to-stabilize-power-supply/",
            "pub_date": "2025-02-05 20:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:123b1f3042f47:0",
            "title": "Fiserv Reports Fourth Quarter and Full Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fiserv, Inc., a leading global provider of payments and financial services technology solutions, has released its financial results for the fourth quarter and full year 2024. The company reported solid growth across various financial metrics, reflecting its robust business model and strategic initiatives.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Fiserv's GAAP revenue increased by 7% to $5.25 billion in the fourth quarter of 2024, compared to the same period last year. For the full year, GAAP revenue also grew by 7% to $20.46 billion. The company's GAAP earnings per share (EPS) rose by 13% in the fourth quarter to $1.64 and by 8% for the full year to $5.38. Operating cash flow for the year was $6.63 billion, while free cash flow stood at $5.23 billion.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">In terms of segment performance, the Merchant Solutions segment saw an 11% increase in GAAP revenue for the fourth quarter and a 10% increase for the full year. The Financial Solutions segment reported a 3% increase in GAAP revenue for the fourth quarter and a 4% increase for the full year. Organic revenue growth was particularly strong, with a 13% increase in the fourth quarter and a 16% increase for the full year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Fiserv repurchased 6.1 million shares of common stock for $1.3 billion in the fourth quarter and 33.9 million shares for $5.5 billion over the full year. The company also realigned its reportable segments during the first quarter of 2024 to enhance operational performance. Additionally, Fiserv was named one of Fortune® World’s Most Admired Companies™ in January 2025, a recognition it has received for 10 of the last 11 years.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Frank Bisignano, Chairman and Chief Executive Officer of Fiserv, commented, \"Fiserv’s track record of growth and consistency continued through 2024 — our fourth year in a row of double-digit organic revenue growth and 39th consecutive year of double-digit adjusted earnings per share growth. The strength and sustainability of Fiserv’s performance is a testament to our unparalleled business model which generates high recurring revenue, strong incremental margin, and healthy free cash flow.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead, Fiserv expects organic revenue growth of 10% to 12% and adjusted EPS of $10.10 to $10.30 for 2025, representing growth of 15% to 17%. The company remains confident in its ability to meet or exceed its medium-term outlook, driven by ongoing initiatives in its Merchant and Financial Solutions segments.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/798354/000079835425000018/fi-20250205.htm\" rel=\"nofollow\" target=\"_blank\">FISERV INC [ FI ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:123b1f3042f47:0-fiserv-reports-fourth-quarter-and-full-year-2024-results/",
            "pub_date": "2025-02-05 20:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:f789d9d2ebaf0:0",
            "title": "Criteo Reports Record Fourth Quarter 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Criteo S.A., a global commerce media company, has released its financial results for the fourth quarter and fiscal year ending December 31, 2024. The company reported record performance, highlighting significant growth in key financial metrics and strategic initiatives aimed at driving shareholder value.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, Criteo reported revenue of $553 million, a slight decrease of 2% year-over-year. However, gross profit increased by 9% to $301 million, and net income rose by 16% to $72 million. The diluted EPS for the quarter was $1.23, up 21% from the previous year. For the full fiscal year 2024, revenue was $1.9 billion, a 1% decrease from 2023, while gross profit increased by 14% to $983 million. Net income for the year more than doubled to $115 million, with a diluted EPS of $1.90, reflecting a 116% increase.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Criteo's Retail Media segment showed robust growth, with a 25% year-over-year increase in Contribution ex-TAC for 2024. The company expanded its platform adoption to 3,500 brands and 225 retailers, including notable names like Harrods. Performance Media also saw a positive trend, with a 3% increase in Contribution ex-TAC for Q4 2024. Criteo's media spend reached $4.3 billion for the year, growing 5% year-over-year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">In 2024, Criteo deployed $225 million for share repurchases and increased its remaining share buyback authorization to $200 million. The company also appointed Michael Komasinski as the new Chief Executive Officer, effective February 15, 2025, succeeding Megan Clarken. Komasinski brings over 20 years of AdTech expertise and a proven track record in driving growth and innovation.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Megan Clarken, the outgoing CEO, expressed pride in the company's accomplishments, noting the solidification of Criteo's position as a global leader in Commerce Media. She highlighted the company's strongest financial performance to date and expressed confidence in the future under Komasinski's leadership. Sarah Glickman, Chief Financial Officer, emphasized the record performance in 2024 and the expansion of the adjusted EBITDA margin by 500 basis points to 35%.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, Criteo is targeting mid-single-digit growth in Contribution ex-TAC at constant currency and an adjusted EBITDA margin of approximately 33% to 34%. For the first quarter of 2025, the company expects Contribution ex-TAC between $256 million and $260 million, with an adjusted EBITDA between $68 million and $72 million.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1576427/000157642725000012/crto-20250205.htm\" rel=\"nofollow\" target=\"_blank\">Criteo S.A. [ CRTO ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:f789d9d2ebaf0:0-criteo-reports-record-fourth-quarter-2024-results/",
            "pub_date": "2025-02-05 20:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464016:0",
            "title": "Carnegie Upgrades Kinnevik to Buy, Boosts PT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie Group on Wednesday upgraded investment company Kinnevik (KINV-B.ST, KINV-A.ST) to buy from hold and raised its price target to 100 kronor from 81 kronor.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464016:0/",
            "pub_date": "2025-02-05 20:15:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309767:0",
            "title": "Earnings Flash (TROW) T. Rowe Price Group Posts Q4 Adjusted EPS $2.12, vs. FactSet Est of $2.19",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309767:0/",
            "pub_date": "2025-02-05 20:15:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464014:0",
            "title": "Kongsberg Automotive Flags Price Hikes on US Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kongsberg Automotive  plans to raise its prices to counter any impact from higher US tariffs on goods from China and potentially Mexico and Canada. </p><p class=\"\">The Norway-based car parts maker said Wednesday it expects \"limited negative effects\" from the tariffs and that it will adjust its supplier sourcing strategy as needed. </p><p class=\"\">Kongsberg Automotive owns two manufacturing plants in Mexico, one in Canada, and that its US plants will be subject to tariffs due to supplies sourced from China.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464014:0/",
            "pub_date": "2025-02-05 20:15:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_PLXD7917E:0",
            "title": "BRIEF-Vishay Intertechnology Q4 Revenue USD 714.716 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 05 (Reuters) - Vishay Intertechnology Q4 pretax profit USD -58.853 million.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q4 gross margin 19.9%</li><li class=\"listItem-bmN0_SHH\">Q4 operating margin -7.9%</li><li class=\"listItem-bmN0_SHH\">Q4 net earnings USD -66.085 million</li><li class=\"listItem-bmN0_SHH\">Q4 operating income USD -56.685 million</li><li class=\"listItem-bmN0_SHH\">outlook Q1 revenue USD 710 million</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_PLXD7917E:0-brief-vishay-intertechnology-q4-revenue-usd-714-716-million/",
            "pub_date": "2025-02-05 20:15:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004118:0",
            "title": "EU Merger Watchdog Begins Probe of AMD's $5 Billion ZT Systems Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(11:38 GMT) </strong>*EU Starts Reviewing AMD's $5 Billion ZT Systems Server Builder Deal<br/><strong class=\"root-Tkn6WL2y\">(11:38 GMT) </strong>*EU Sets March 12 Deadline to End First Probe of Deal<br/><strong class=\"root-Tkn6WL2y\">(11:38 GMT) </strong>*EU: AMD, ZT Systems Notify Merger Plans for EU Review<br/><strong class=\"root-Tkn6WL2y\">(12:09 GMT) </strong>EU Merger Watchdog Begins Probe of AMD's $5 Billion ZT Systems Acquisition</p><p class=\"\">By Edith Hancock</p><p class=\"\">The European Commission started looking at Advanced Micro Devices' $5 billion acquisition of ZT Systems, setting a March 12 deadline to decide whether or not to clear the deal or launch an in-depth investigation.</p><p class=\"\">AMD notified the commission about its bid for the New Jersey, U.S.-based server builder on Tuesday, according to the regulator's website.</p><p class=\"\">The chip maker agreed to buy ZT Systems, which designs data-center equipment for cloud computing and artificial intelligence, last August in a move to take on Nvidia's dominance in the fast-growing AI space.</p><p class=\"\">AMD and ZT Systems didn't immediately respond to requests for comment.</p><p class=\"\">Write to Edith Hancock at edith.hancock@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004118:0/",
            "pub_date": "2025-02-05 20:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004957:0",
            "title": "DeepSeek Is Great, Say Google, Palantir, Nvidia. Why Stock Markets Should Worry and 5 Other Things to Know Today. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">When it comes to the artificial intelligence threat from China's DeepSeek, everyone in Silicon Valley seems to be singing from the same hymn sheet.</p><p class=\"\">Two more voices joined the choir on Tuesday. Alphabet, the parent company of search engine Google, only had good things to say about DeepSeek when it reported mixed results. \"Tremendous,\" and \"very good work\" is how CEO Sundar Pichai described the upstart, which claims to have developed an AI model that rivals those made by U.S. tech companies at a fraction of the cost. Pichai added that Google's models are still some of the best.</p><p class=\"\">Lisa Su, CEO of chip maker AMD, said DeepSeek shows how quickly the technology is innovating, which is good for business. Earlier this week, Palantir's Alex Karp said cheap AI was a plus for his company because it lowered input costs. And Microsoft CEO Satya Nadella last week referred to the obscure economic concept of Jevons Paradox — developed to show why 19th century coal use skyrocketed even as industry grew more energy efficient — to explain how DeepSeek would help bolster demand for AI services. Nvidia described it as an \"excellent AI advancement.\"</p><p class=\"\">Investors may be forgiven for feeling a little suspicious of all the positive spin. There are at least two aspects to the DeepSeek threat. One is the AI arms race between China and the U. S. — something from which Palantir, with extensive defense contracts, might be best placed to benefit. This is the side of DeepSeek that prompted comparisons with Sputnik, the 1950s Soviet Union satellite that spurred the investment that led to the U.S. landing on the moon first a decade later.</p><p class=\"\">The other side is whether Big Tech's huge spending on AI investment is worth it, purely from a perspective of returns on capital employed. Executives still think it will be — none offered hints that their plans had changed since DeepSeek jolted the market. They might be right. But with the impact yet to show up in earnings, investors have every reason to remain skeptical about the game plan.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Brian Swint</li></ul><p class=\"\">***</p><p class=\"\">Alphabet's Revenue Misses Expectations. AI Spending Accelerates.</p><p class=\"\">Alphabet was under pressure after revenue growth, while positive, slowed in the December quarter, and revenue in the closely watched cloud computing business fell short of expectations. CEO Sundar Pichai said it is accelerating spending on data centers for artificial intelligence, with $75 billion in capital expenditures this year.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">That amount of capital spending compares with just over $52 billion for   2024. Capital spending in the December quarter ran above expectations.   CFO Anat Ashkenazi said most of these investments were in technical   infrastructure, the largest component being investments in servers and   data centers.   </li><li class=\"listItem-bmN0_SHH\">The Google parent reported fourth-quarter earnings of $2.15 a share and   revenue of $96.47 billion, up 12% from a year earlier but the lowest   growth rate since 2023. The per-share number beat expectations but   revenue fell short. Cloud revenue rose 30% to $12 billion but missed   estimates.   </li><li class=\"listItem-bmN0_SHH\">Its video platform YouTube offered a bright spot for Alphabet, with   advertising revenue of $10.47 billion that beat expectations. Alphabet's   total advertising revenue was $72.5 billion, up 10.6% from a year earlier   and ahead of forecasts.   </li><li class=\"listItem-bmN0_SHH\">Google has remained top of the heap in search for years, but generative   AI-powered chatbots have put its market share in that business at risk.   Microsoft-backed OpenAI's ChatGPT and Meta Platforms' AI offering, along   with the new China-based DeepSeek's chat model compete with Google's   Gemini. </li></ul><p class=\"\">What's Next: Investors are awaiting updates on the Justice Department's antitrust case involving Google. A judge ruled in August that Google maintained a monopoly in general search services and general text advertising. The Justice Department has suggested a breakup of the company as a potential remedy.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Angela Palumbo and Liz Moyer</li></ul><p class=\"\">***</p><p class=\"\">AMD Disappoints on Data Center Revenue Despite Earnings Beat</p><p class=\"\">Advanced Micro Devices beat expectations for earnings but soft data center revenue failed to impress Wall Street analysts. CEO Lisa Su called 2024 a transformative year. Looking into 2025, Su sees clear opportunities for continued growth based on growing demand for high-performance and adaptive computing.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">AMD reported fourth-quarter adjusted earnings of $1.09 a share and   revenue of $7.7 billion. The chip maker's data-center unit generated   $3.86 billion in revenue. AMD forecast sales in the current quarter to a   range with $7.1 billion at the midpoint versus the $7 billion analysts'   estimate.   </li><li class=\"listItem-bmN0_SHH\">Personal-computing revenue rose 58%, to $2.3 billion, driven by solid   demand for its Ryzen processor chips. But its gaming unit sales dropped   59%, to $563 million, and its embedded segment fell 13%, to $923 million.   </li><li class=\"listItem-bmN0_SHH\">AMD has gotten a boost from the surge in AI demand that has lifted the   chip sector. It makes chips that help create and use tools that produce   humanlike text, images, and video. As it moves toward more AI activities,   it has cut its global workforce by more than 1,000 jobs. </li></ul><p class=\"\">What's Next: Su said artificial intelligence models such as DeepSeek and AI infrastructure buildout announcements like Stargate are highlights showing the rapid pace of AI innovation that will drive more AI compute demand and give AMD growth opportunities.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Tae Kim</li></ul><p class=\"\">***</p><p class=\"\">RFK Jr.'s Nomination Advances as Big Pharma Reports Earnings</p><p class=\"\">Robert F. Kennedy Jr., President Donald Trump's pick to head the Health and Human Services Department, is headed to a full Senate confirmation vote after Republican Sen. Bill Cassidy, a physician once seen as a potential \"no\" vote, joined other finance committee Republicans to support his nomination.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cassidy said that he would support Kennedy despite the latter's record as   a strident vaccine critic. Cassidy's decision significantly narrows the   odds that those opposed to his nomination will muster enough Republican   votes to block him, making his eventual confirmation highly likely.   </li><li class=\"listItem-bmN0_SHH\">Vaccine maker Pfizer's stock fell 2.2% after the vote despite reporting   earnings that beat expectations. CEO Albert Bourla told Barron's he has   met with Kennedy and remains optimistic about the Trump administration   and Pfizer's focus on cancer treatments. Fellow vaccine maker Moderna's   stock closed down 6.5%.   </li><li class=\"listItem-bmN0_SHH\">Pfizer maintained the 2025 guidance laid out in December. Its   fourth-quarter earnings were 63 cents a share and revenue was $17.8   billion, up 21% from a year ago. It didn't update on its closely watched   obesity pill danuglipron, but promised data by the end of the first   quarter.   </li><li class=\"listItem-bmN0_SHH\">Merck's human papillomavirus vaccine Gardasil's fourth-quarter sales fell   17%, and it paused shipments to China. Full-year guidance was below   expectations, but CEO Rob Davis said confidence about successfully   navigating the 2028 expiration of patents for its cancer drug Keytruda   remains \"unchanged.\" </li></ul><p class=\"\">What's Next: Merck expects sales of $64.1 billion to $65.5 billion in 2025. Its outlook is affected by its decision to halt shipments to China until at least midyear as business in that country remains a challenge.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Josh Nathan-Kazis, Mackenzie Tatananni, and Janet H. Cho</li></ul><p class=\"\">***</p><p class=\"\">Robinhood Markets Says Super Bowl Bets Are Off</p><p class=\"\">Robinhood Markets, the trading app favored by meme stock investors, has suspended new contracts that would have allowed users to bet on the Super Bowl. The move at the request of the Commodity Futures Trading Commission comes just days before the annual sporting event, expected to draw record legal bets.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Robinhood said it was disappointed but will comply with the request from   the CFTC, which raised concerns about legality despite the company   discussing the contracts with the agency before their launch on Monday.   Robinhood general counsel Lucas Moskowitz said they believed they were in   full compliance with regulations.   </li><li class=\"listItem-bmN0_SHH\">Robinhood started event contracts during the U.S. presidential election.   Its Pro Football Championship market launched with Kalshi, an online   prediction market, and would have let customers trade contracts based on   whether they thought the Kansas City Chiefs or Philadelphia Eagles would   win in New Orleans on Sunday.   </li><li class=\"listItem-bmN0_SHH\">Fans are expected to legally bet a record $1.39 billion on the Super Bowl,   up from $1.25 billion last year, according to the American Gaming   Association. Thirty-eight states and Washington, D.C., now allow legal   sports betting.   </li><li class=\"listItem-bmN0_SHH\">U.S. sportsbooks including DraftKings, FanDuel, and Caesars generated   roughly $150 billion in wagers in 2024, but the total amount wagered is   much higher, because of illegal offshore sportsbooks and other   off-the-books gambling. The American Gaming Association estimates that   Super Bowl betting hit $23.1 billion last year. </li></ul><p class=\"\">What's Next: New York could surpass Nevada in Super Bowl wagers this year, Eric Ramsey of LegalSportsReport, a sports-betting site that tracks states' gambling amounts, told MarketWatch. LegalSportsReport estimates Super Bowl betting will reach $183 million in New York state, $170 million in Nevada, and $147 million in New Jersey.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Andrew Welsch and Janet H. Cho</li></ul><p class=\"\">***</p><p class=\"\">Novo Nordisk Earnings Beat But There Are Growth Concerns Novo Nordisk, the maker of weight-loss drugs Ozempic and Wegovy, posted fourth-quarter earnings comfortably above estimates early Wednesday. The results looked to ease some of investors' recent concerns about the pharma giant's future trajectory amid fierce competition from Eli Lilly. Yet, it wasn't all good news for the Danish drugmaker.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Novo Nordisk reported earnings of 6.34 Danish kroner ($0.88) a share on   sales of 85.7 billion DKK ($11.9 billion) for the quarter, beating   expectations for earnings of 5.98 DKK a share on sales of 80.1 billion   DKK, according to FactSet.   </li><li class=\"listItem-bmN0_SHH\">However, it also said it sees 2025 sales growth between 16% and 24% in   2025, less than the 26% growth observed in 2024.   </li><li class=\"listItem-bmN0_SHH\">Sales of Wegovy more than doubled from the same period last year, and   came largely in line with analysts' expectations at 19.9 billion DKK.   </li><li class=\"listItem-bmN0_SHH\">Shares have taken a beating in recent months, punished by growing worries   that sales of its blood sugar and appetite controlling GLP-1 drugs   wouldn't live up to the hype. </li></ul><p class=\"\">What's Next: The coming quarters will be crucial for Novo Nordisk as the narrative around the company has recently begun to shift for the worse. Its main rival, U.S.-based Eli Lilly, is set to report earnings Thursday and investors will be on the lookout for clues on the future of the GLP-1 market, as well as how the Novo-Lilly rivalry is shaping up.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Elsa Ohlen and Josh Nathan-Kazis</li></ul><p class=\"\">***</p><p class=\"\">Dear Quentin,</p><p class=\"\">I just visited my 62-year-old friend in the hospital and am dumbfounded. He has been given a diagnosis of stage four cancer. Because he has had organ transplants, chemotherapy isn't an option. If he gets stronger and can do radiation, they may be able to extend his life from a week or two to six months, maybe longer.</p><p class=\"\">Most of our visit was spent talking about memories we had and about his end-of-life wishes. He has a 30-year-old son and two grandchildren, and his wife is stepmother to his son. He received a $250,000 inheritance last year and would like to take that money and pay off his $150,000 mortgage so that his wife will have the house paid off. I don't know the interest rate. His big wish is for his son to get the house after his wife dies. At this point, what can be done? He was weak, and it was hard to determine what his will says.</p><p class=\"\">Assuming he gets stronger and doesn't die soon, what is the best course of action? Obviously, see a lawyer. I have seen letters where one spouse dies and the children don't get what the will specifies. Is some kind of trust better? I have no reason to distrust his wife, but I don't know her very well. At this point, does he just hope everything works out OK? From what I know, I don't think his wife can afford the house on her income alone. She has worked as a waitress in a local restaurant for over 20 years.</p><p class=\"\">Without his disability checks, his wife might end up having to sell the house. She would like to retire, but I don't know how much Social Security she would get on her own or using his earnings history. They have no savings other than the $250,000 from the inheritance. I wish I had known about this months and years ago so I could have helped, but I never felt it was my place to ask. It all feels so pointless and discouraging. I feel the big lesson here isn't to put off estate planning and to ensure your wishes are followed — especially if a stepparent is involved.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A Friend</li></ul><p class=\"\">Read the Moneyist's response here.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Quentin Fottrell</li></ul><p class=\"\">***</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Newsletter edited by Liz Moyer, Patrick O'Donnell, Callum Keown</li></ul><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004957:0/",
            "pub_date": "2025-02-05 20:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004955:0",
            "title": "Advanced Micro Devices Is Maintained at Overweight by Keybanc",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:09 GMT) </strong>Advanced Micro Devices Price Target Cut to $140.00/Share From $150.00 by Keybanc</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004955:0/",
            "pub_date": "2025-02-05 20:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464024:0",
            "title": "JP Morgan Boosts Middle East Healthcare's PT, Keeps at Neutral",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JP Morgan on Wednesday raised its price target of hospital operator Middle East Healthcare (SASE:4009) to 92.30 Saudi riyals from 75.00 riyals and maintained its rating at neutral.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464024:0/",
            "pub_date": "2025-02-05 20:09:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464022:0",
            "title": "RBC Upgrades Schroders to Outperform, Raises PT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RBC on Wednesday upgraded British asset manager Schroders  to outperform from sector perform and increased its price target to 3.95 pounds sterling from 3.30 pounds.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464022:0/",
            "pub_date": "2025-02-05 20:09:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309730:0",
            "title": "Uber Technologies' Q4 Earnings, Revenue Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uber Technologies  reported Q4 earnings Wednesday of $3.21 per diluted share, up from $0.66 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.50. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $11.96 billion, up from $9.94 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $11.76 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309730:0/",
            "pub_date": "2025-02-05 20:09:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004866_20250205004983:0",
            "title": "New York Times Sees 1Q Digital-only Subscription Revenues Increasing 14% - 17% >NYT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004866_20250205004983:0/",
            "pub_date": "2025-02-05 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309750:0",
            "title": "Earnings Flash (SR) Spire Posts Fiscal Q1 Adjusted EPS $1.34, vs. FactSet Est of $1.42",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309750:0/",
            "pub_date": "2025-02-05 20:10:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464023:0",
            "title": "Brainhole Technology Purchases Further Shares in Two US Companies for $1 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brainhole Technology  purchased further shares of Affirm Holdings and Robinhood Markets for $1 million through the open market on Tuesday, a Wednesday Hong Kong bourse filing said. </p><p class=\"\">The company purchased 8,400 class A common stock of Affirm Holdings and 9,800 class A common stock of Robinhood Markets for $500,000 each. </p><p class=\"\">The company had previously purchased 20,200 Affirm Holdings shares between Jan. 29 and Jan. 31 while it had acquired 22,000 Robinhood Markets' shares on Jan. 31. </p><p class=\"\">The purchases were funded through the existing internal financial resources of the group.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464023:0/",
            "pub_date": "2025-02-05 20:10:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW11G:0",
            "title": "Uber down as Q1 bookings forecast falls short of estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of ride-hailing company Uber  fell 3.3% to $67.47 premarket</p><p class=\"\">** Uber expects Q1 gross bookings between $42 bln and $43.5 bln, with mid-point lower than analysts estimate of $43.42 bln</p><p class=\"\">** Uber sees a 5.5-percentage-point hit from a strong dollar</p><p class=\"\">** Q4 revenue stood at  $11.96 bln, surpassing the average estimate of $11.77 bln - LSEG</p><p class=\"\">** Uber says Q4 gross bookings was $44.2 bln, beating Wall Street expectations of $43.45 bln</p><p class=\"\">** Forecasts Q1 adjusted core profit between $1.79 bln and $1.89 bln, compared with est. of $1.85 bln</p><p class=\"\">** Company says Q4 net profit was $6.88 bln, including a $6.4 bln benefit from a tax valuation release</p><p class=\"\">** Up to last close, stock had risen 2.5% in the past 12 months</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW11G:0-uber-down-as-q1-bookings-forecast-falls-short-of-estimates/",
            "pub_date": "2025-02-05 20:10:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_WkrbnwDjm:0",
            "title": "Nasdaq Copenhagen has accepted Penneo's request for delisting of its shares from Nasdaq Copenhagen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Penneo<p class=\"\">Company Release no. 20/2025 </p><p class=\"\">Copenhagen, Denmark, 5 February 2025</p><p class=\"\">With reference to Penneo A/S' (\"<strong class=\"root-Tkn6WL2y\">Penneo</strong>\") announcement of 5 February 2025 (no. 19/2025), regarding Penneo's Board of Directors' decision, upon request from Visma Danmark Holding A/S, to request Nasdaq Copenhagen A/S (\"<strong class=\"root-Tkn6WL2y\">Nasdaq Copenhagen</strong>\") to have Penneo's shares (ISIN DK0061283009) removed from trading and official listing at Nasdaq Copenhagen, Nasdaq Copenhagen has today accepted to remove the shares from trading and official listing. </p><p class=\"\">The last day of trading and official listing of the shares in Penneo on Nasdaq Copenhagen will be 5 March 2025, being the last business day within the four-week compulsory acquisition period.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information - Penneo:</strong></p><p class=\"\">Jostein Vik</p><p class=\"\">Chairman of the Board of Directors at Penneo</p><p class=\"\">Mobile +47 92 22 23 92 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Enquiries – Visma:</strong></p><p class=\"\">Lage Bøhren</p><p class=\"\">Director of Communication at Visma</p><p class=\"\">Telephone: +47 92 15 78 01</p><p class=\"\">Sindre Talleraas Holden</p><p class=\"\">Head of M&amp;A at Visma</p><p class=\"\">Telephone: +47 93 05 94 69</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Penneo</strong></p><p class=\"\">Penneo combines digital signing and Know Your Customer (KYC) workflows into a single platform that streamlines critical business processes for anti-money-laundering regulated B2B companies.</p><p class=\"\">Founded in Copenhagen and operating throughout Europe, Penneo is fast becoming the go-to platform for companies looking to save time on administrative tasks while ensuring complete regulatory compliance and peace of mind for themselves and their clients. Penneo is already trusted by +3,000 companies - including the world's leading auditors.</p><p class=\"\">For information about Penneo, please visit https://penneo.com/investors.</p><p class=\"\">https://news.cision.com/penneo/r/nasdaq-copenhagen-has-accepted-penneo-s-request-for-delisting-of-its-shares-from-nasdaq-copenhagen%2Cc4101064</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_WkrbnwDjm:0-nasdaq-copenhagen-has-accepted-penneo-s-request-for-delisting-of-its-shares-from-nasdaq-copenhagen/",
            "pub_date": "2025-02-05 20:10:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004987:0",
            "title": "Sterling Rises as Dollar Falls on Reduced Tariff Fears — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sterling rises to a four-week high against the dollar, which weakens following the suspension of U.S. tariffs on Mexico and Canada, Monex Europe forex analyst Nick Rees says. \"Sterling's recent drift higher looks like a predominantly-dollar driven move,\" he says. That is demonstrated by the fact sterling is only marginally higher versus the euro. However, the prospect of more gradual Bank of England interest-rate cuts relative to the European Central Bank suggest further sterling strength against the euro. Solid underlying growth, a relative lack of political dysfunction and insulation from U.S. tariffs compared to the eurozone also provide \"good reason to be constructive.\" EUR/GBP falls 0.1% to 0.8310. GBP/USD rises 0.4% to a high of 1.2551.(renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004987:0/",
            "pub_date": "2025-02-05 20:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309755:0",
            "title": "Earnings Flash (SR) Spire Posts Fiscal Q1 Operating Revenue $669.1 Million, vs. FactSet Est of $762.8 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309755:0/",
            "pub_date": "2025-02-05 20:11:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004866_20250205004909:0",
            "title": "New York Times 4Q Net $123.7M >NYT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004866_20250205004909:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004903:0",
            "title": "Logistics Report: Tariff Fightback Begins; How Levies Are Raising Commodity Costs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sponsored by</p><p class=\"\">Tariff Fightback Begins; How Levies Are Raising Commodity Costs By Paul Berger</p><p class=\"\">Some of the U.S.'s biggest trading partners are flexing their muscles as the Trump administration escalates its trade war.</p><p class=\"\">Within minutes of the U.S. imposing a 10% tariff on China, Chinese officials hit back with tariffs on U.S. coal and liquefied natural gas imports, restrictions on exports of certain metals and by opening an antitrust probe into Google.</p><p class=\"\">The WSJ's Liza Lin and Raffaele Huang report that China's measures are largely symbolic because its tariffs, set for Feb. 10, target a narrow band of energy and machinery imports and its export controls don't go as far as a recent ban on critical minerals. Google has only a minimal presence in China.</p><p class=\"\">The tit-for-tat exchange shows how quickly tensions are escalating. The WSJ's Alexander Ward and Alex Leary write that a hoped-for phone call Tuesday between President Trump and Chinese leader Xi Jinping didn't happen . U.S. officials say a conversation between the two leaders is expected in the next week.</p><p class=\"\">European leaders have started preparing for the prospect of tariffs as well. The WSJ's Daniel Michaels and Kim Mackrael write that European Union officials are identifying imports from politically sensitive U.S. states , and French President Emmanuel Macron says Europe \"must command respect and respond\" to any tariffs.</p><p class=\"\">The U.S. Postal Service is suspending international parcels from China and Hong Kong after the U.S. closed a loophole that allows companies to avoid duties on packages worth less than $800. Spirits maker Diageo warned U.S. trade tariffs could derail its recovery . (WSJ) The U.K. is managing to avoid U.S. tariffs , for now. (WSJ)</p><p class=\"\">CONTENT FROM: PENSKE Gain Intel. Gain Ground with Penske.</p><p class=\"\">The road to the future relies on data. And we speak data. At Penske, technology is embedded in everything we do. Our apps and tools help our customers optimize their fleet by delivering real-time actionable insights straight to them.</p><p class=\"\">Learn More Quotable  Commodities</p><p class=\"\">Steelmakers are offering a glimpse at how tariffs could ripple across U.S. supply chains and raise consumer prices. Some U.S. steelmakers are raising their rates even after Trump paused tariffs on Canada and Mexico. The WSJ's Bob Tita reports that pricier steel and aluminum imports could lift consumer prices for appliances, cars and canned drinks .</p><p class=\"\">The U.S. steel industry is coming off its worst year since 2020 because of weak manufacturing demand. Steel executives have been pushing for measures that block what they see as unfairly low-price materials entering the country. Canada and Mexico accounted for 35% of steel imports last year. In the last few weeks, U.S. Steel announced a $50-a-ton price increase for flat-rolled steel, and Nucor raised its price by $25 a ton. Those price hikes are already hitting manufacturers who say they must now raise prices too.</p><p class=\"\">Number of the Day  In Other News</p><p class=\"\">The Federal Reserve's Mary Daly says the central bank is in no rush to lower interest rates. (MarketWatch)</p><p class=\"\">Job openings in the U.S. fell in December to the second-lowest level since the end of the pandemic. (MarketWatch)</p><p class=\"\">Ferrari expects revenue and earnings to rise this year after the sports-car maker reported a strong end to 2024 . (WSJ)</p><p class=\"\">Cosmetics giant Estée Lauder will cut up to 7,000 jobs and warned of a steep sales drop to start the year. (WSJ)</p><p class=\"\">Nintendo cut its annual earnings projections. (WSJ)</p><p class=\"\">Truck engine maker Cummins swung to a fourth-quarter profit of $418 million from a loss of $1.43 billion a year earlier. (Dow Jones Newswires)</p><p class=\"\">An oil tanker that was attacked by Houthi militants in Yemen last year has sailed through the Red Sea unharmed. (Reuters)</p><p class=\"\">The Singapore Navy is deploying a remotely controlled patrol boat to monitor local waters. (The Maritime Executive)</p><p class=\"\">The chief executive of Japanese shipowner K Line, Yukikazu Myochin, is stepping down . (TradeWinds)</p><p class=\"\">Almost 100,000 organic eggs valued at $40,000 were stolen from a trailer in Pennsylvania. (NBC News)</p><p class=\"\">About Us</p><p class=\"\">Follow the WSJ Logistics Report team: @bylizyoung  and @pdberger . Follow the WSJ Logistics Report on X at @WSJLogistics .</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004903:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004895:0",
            "title": "Euro Credit More Attractive Than U.S. Credit Due to Higher Inflation Risk in U.S. — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Euro credit looks more attractive and has more value to offer investors than U.S. credit, Benjamin Melman, global chief investment officer at Edmond de Rothschild Asset Management, says in a note. The risk of inflation reaccelerating in the U.S. makes euro credit more attractive, Melman says. \"The new Trump administration has added an extra layer of uncertainty over the future path of inflation with its tariff and deportation policies,\" he says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004895:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205007820:0",
            "title": "DeepSeek and tariffs have roiled the market. History says deeper pullbacks are coming, this strategist says.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Barbara Kollmeyer</p><p class=\"\">But American corporations will keep the bull market going, says Truist's Keith Lerner</p><p class=\"\">Despite the bumps for Wall Street to kick off the new year, the S&amp;P 500 SPX has held up fairly well, still positive and just over 1% away from making a new high.</p><p class=\"\">Truist Advisory Services' chief market strategist Keith Lerner says the \"carousel of tariffs\" and DeepSeek-related headlines have upended markets, but things could get much rockier as he urges clients to not react to each one.</p><p class=\"\">While his \"market uptrend remains intact...the latest tariff developments underscore the potential for disruptions and broken pieces that we expected to be part of the investment narrative in 2025.\"</p><p class=\"\">In our call of the day, Lerner also cautions against rushing into buy on market dips caused by those newsy headlines. \"With stocks not far from all-time highs and after a strong January, it's premature to say this current setback presents a great buying opportunity,\" he told clients in a new note.</p><p class=\"\">Over the past 40 years, the market has averaged a maximum intra-year pullback of around 14%, said the strategist. Stocks have also been up in 33 of 40 of those years - 83% of the time.</p><p class=\"\">Positives for stocks? Lerner said they expect the U.S. economy to stay resilient in 2025, given how it weathered the pandemic, high inflation and the fastest Fed rate-hiking cycle in decades. He also notes a more balanced performance across the stock market so far with 10 of 11 large-cap sectors up this year.</p><p class=\"\">He expects earnings will deliver - this current earnings solid has been \"solid,\" with 79% of S&amp;P 500 companies reporting beating consensus earnings estimates-and exceeding those estimates by an average of 6%, he says.</p><p class=\"\">As for where investors should be keeping their money, Lerner says he's holding on to a \"longstanding U.S. equity bias relative to international markets,\" owing to stronger economic and earnings trends.</p><p class=\"\">Lerner prefers large-cap stocks over small-caps, due to strong balance sheets and \"more levers to pull to manage through challenging periods.\" And he also likes midcaps over small-caps, owing to stronger financial footing and better earnings trends.</p><p class=\"\">And he's focused on higher quality when it comes to fixed income, with \"tension between the potential of higher inflation offset by a flight to quality in the 10-year U.S. Treasury yield.\" A modest position in gold is also something he favor right now, and for some investors, allocating to alternative strategies such as hedge funds can help smooth out the bumps  he expects.</p><p class=\"\">The markets</p><p class=\"\">Nasdaq-100 futures (NQ00) are leading declines for U.S. stock futures (ES00) (YM00), with Treasury yields BX:TMUBMUSD10Y BX:TMUBMUSD02Y down and the dollar DXY off another 0.5%.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Key asset performance                                                Last       5d      1m      YTD    1y <br/>   S&amp;P 500                                                              6037.88    -0.49%  2.18%   2.66%  21.87% <br/>   Nasdaq Composite                                                     19,654.02  -0.40%  0.84%   1.78%  25.91% <br/>   10-year Treasury                                                     4.49       -2.90   -19.80  -8.60  33.32 <br/>   Gold                                                                 2892.8     4.34%   7.94%   9.60%  41.05% <br/>   Oil                                                                  72.36      -0.89%  -1.31%  0.68%  -2.32% <br/>   Data: MarketWatch. Treasury yields change expressed in basis points </pre><p class=\"\">For more market updates plus actionable trade ideas for stocks, options and crypto, subscribe to MarketDiem by Investor's Business Daily.</p><p class=\"\">The buzz</p><p class=\"\">Alphabet's stock (GOOGL) is tumbling after a revenue miss and big plans for AI spending.</p><p class=\"\">AMD shares (AMD) are sliding after a disappointing outlook for its data-center business, as it won't give AI revenue forecasts anymore.</p><p class=\"\">Mattel (MAT) is jumping on upbeat profit and Barbie forecasts. A disappointing sales forecast is hitting Chipotle shares (CMG).</p><p class=\"\">Disney (DIS) and Uber (UBER) are due to report ahead of the open, with Ford (F) results and Costco (COST) sales coming after the close.</p><p class=\"\">The U.S. Post Office will stop accepting parcels from China, news that weighed on shares of Amazon.com (AMZN) and Temu owner PDD (PDD).</p><p class=\"\">Private-sector payroll data is coming at 8:15 a.m., the U.S. trade deficit at 8:30 a.m. and the Institute for Supply Management's services survey at 10 a.m. Among Fed speakers, we'll hear from Richmond Fed President Tom Barkin and Chicago Fed President Goolsbee.</p><p class=\"\">Best of the web</p><p class=\"\">Why central banks' hunger for gold shows 'no sign of being quelled' this year.</p><p class=\"\">Trump campaigned on ending foreign entanglements. Now he wants to own Gaza.</p><p class=\"\">The young techies assigned to help Musk slash size of U.S. government.</p><p class=\"\">The chart</p><p class=\"\">The above chart shows how gold miners continue to lag the precious metal (GC00), up 9.6% so far in 2025. TopDown Chart's head of research and founder Callum Thomas, who provided the chart, says gold miners have been in a 5-year trading range, and never caught up from a divergence with gold prices back in 2021. \"But with growth stocks looking increasingly overvalued and at risk in an environment of rising (geo)political risk, and gold prices going from strength to strength I think it's fair to expect some catch-up for miners,\" he writes.</p><p class=\"\">Top tickers</p><p class=\"\">These were the top-searched tickers on MarketWatch as of 6.a.m.:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Ticker  Security name <br/>   NVDA    Nvidia <br/>   TSLA    Tesla <br/>   AMD     Advanced Micro Devices <br/>   PLTR    Palantir Technologies <br/>   GOOGL   Alphabet <br/>   AAPL    Apple <br/>   GME     GameStop <br/>   TSM     Taiwan Semiconductor Manufacturing <br/>   AMZN    Amazon.com <br/>   MSFT    Microsoft </pre><p class=\"\">Random reads</p><p class=\"\">Egg-ceptional times: police are hunting thieves who stole $40,000 worth of eggs.</p><p class=\"\">A pig bites man story.</p><p class=\"\">No, Scotland will not ban cats, despite a recommendation to do so.</p><p class=\"\">Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern.</p><p class=\"\">-Barbara Kollmeyer</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205007820:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        }
    ]
}