{
    "data": [
        {
            "id": "DJN_DN20250204007976:0",
            "title": "RFK Jr. Clears Committee Vote, Putting Him on Track to Become Health Secretary — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kristina Peterson and Liz Essley Whyte</p><p class=\"\">WASHINGTON — The nomination of Robert F. Kennedy Jr. to lead the Health and Human Services Department advanced Tuesday after a key swing Republican voted for the nominee in the Senate Finance Committee, likely clearing his path to confirmation.</p><p class=\"\">Sen. Bill Cassidy (R., La.), a medical doctor, voted with all of the committee's Republicans to support Kennedy's confirmation.</p><p class=\"\">His vote followed an unusually intense pressure campaign from Kennedy, his supporters and the Trump administration over the weekend and up to the committee's vote.</p><p class=\"\">To secure Kennedy's support, the nominee and administration agreed to a number of concessions, Cassidy said, including promises to maintain current federal vaccine recommendations and keep intact Centers for Disease Control and Prevention website pages that say there isn't a link between vaccines and autism.</p><p class=\"\">Kennedy and the Trump administration committed to establish \"an unprecedentedly close, collaborative working relationship,\" Cassidy said, and set up safeguards to ensure the public's continued access to vaccines.</p><p class=\"\">\"I will use my authority as chairman of the Senate committee with oversight of HHS to rebuff any attempt to remove the public access to lifesaving vaccines without iron-clad causational scientific evidence,\" Cassidy said on the Senate floor after Tuesday's vote.</p><p class=\"\">The committee vote signaled that Kennedy's path to becoming the top U.S. health official was becoming smoother. The final tally was 14 to 13.</p><p class=\"\">In the full Senate vote, Kennedy can afford to lose as many as three Republican votes if all Democrats oppose him. In the event of a tie, Vice President JD Vance can cast the deciding vote.</p><p class=\"\">Potential GOP defectors include Sens. Mitch McConnell of Kentucky, a polio survivor; Lisa Murkowski of Alaska; and Susan Collins of Maine. No Republicans have said they plan to oppose Kennedy.</p><p class=\"\">The full Senate vote to confirm Kennedy hasn't been scheduled but could come as soon as next week.</p><p class=\"\">If confirmed, Kennedy would lead a powerful department with a $1.7 trillion budget regulating things as diverse as prescription medicines and food dyes and overseeing Medicare health insurance for the elderly and health services for Native Americans.</p><p class=\"\">Shares of vaccine makers Pfizer and Moderna fell after the Kennedy vote.</p><p class=\"\">Pfizer Chief Executive Albert Bourla told analysts during an earnings call Tuesday he expects Kennedy to have a \"more tempered view\" of vaccines as HHS secretary based on what he has seen from comments from Kennedy and the Trump administration.</p><p class=\"\">Bourla also said he doesn't expect the government to change vaccine manufacturers' liability protections because doing so requires congressional approval. The Trump administration doesn't want to see another health crisis. \"I feel cautiously optimistic that they will be very, very prudent,\" Bourla said.</p><p class=\"\">A scion of the famous Democratic family, Kennedy ran for president last year and then suspended his campaign last summer and endorsed Donald Trump, saying they had a joint mission to \"Make America Healthy Again.\"</p><p class=\"\">The phrase became a rallying cry picked up by many Republicans. Yet many Democrats and health authorities expressed concern over some of its tenets, because Kennedy has questioned the safety of vaccines and suggested unproven links between the shots and a range of chronic diseases, including autism.</p><p class=\"\">More than 20 large-scale studies involving hundreds of thousands of children in several countries have discredited any association between the measles, mumps and rubella vaccines and autism. Additional large studies strongly suggest that no vaccine causes autism.</p><p class=\"\">Democrats on the committee said Kennedy could undermine public health if he were confirmed. He had also struggled to answer questions about Medicare and Medicaid over two days of hearings last week.</p><p class=\"\">Sen. Ron Wyden of Oregon, the committee's top Democrat, said Kennedy was \"singularly unfit\" for the post of Health secretary and would pose \"a grave threat to the health of the American people.\"</p><p class=\"\">But Republicans hold a majority on the Finance committee, and most of the GOP committee members had coalesced around Kennedy, even though the nominee had in the past voiced support for abortion rights.</p><p class=\"\">Sen. Thom Tillis (R., N.C.) said the American Farm Bureau Federation, the National Rifle Association and groups that oppose abortion rights didn't actively oppose Kennedy.</p><p class=\"\">The partisan divide left Cassidy with the swing vote. His position was fraught. He had voted to convict Trump in his second impeachment trial. Now, Cassidy faces a primary challenger in his coming election in 2026.</p><p class=\"\">Yet Cassidy had said last week that he had been \"struggling\" over Kennedy's past comments about vaccines and the role they have played in making some parents hesitant to vaccinate their children.</p><p class=\"\">The Louisiana Republican had urged Kennedy during hearings on the nomination to make clear that he didn't believe vaccines caused autism, but Kennedy had sidestepped such an endorsement, saying he would review the data.</p><p class=\"\">Cassidy became the target of an intense persuasion campaign from Kennedy, his supporters and the Trump administration.</p><p class=\"\">\"MAHA moms packed the halls of the Senate and made thousands of calls,\" said Kennedy adviser Calley Means. \"Their voice was heard.\"</p><p class=\"\">As the committee vote neared, President Trump urged lawmakers to support Kennedy in a social-media post. \"20 years ago, Autism in children was 1 in 10,000. NOW IT'S 1 in 34. WOW! Something's really wrong. We need BOBBY!!!\" Trump wrote.</p><p class=\"\">Cassidy said he held a series of phone calls with Kennedy over the weekend and Tuesday morning before the committee's vote. During the calls, the senator said, Kennedy promised an unusually close working relationship.</p><p class=\"\">Cassidy said Kennedy, in addition to keeping federal vaccine recommendations and CDC web pages on vaccines and autism, committed to not set up alternate safety monitoring or approval systems for vaccines.</p><p class=\"\">Kennedy pledged that HHS would provide 30-day notice before any changes to vaccine-safety monitoring systems and would generally speak to Cassidy several times a month, the senator said.</p><p class=\"\">The nominee also offered Cassidy input on hiring decisions at HHS and promised Cassidy that the Senate health committee could choose a representative \"on any board or commission formed to review vaccine safety,\" Cassidy said.</p><p class=\"\">\"My support is built on assurances that this will not have to be a concern,\" Cassidy said of vaccines. \"He will be the secretary, but I believe he will also be a partner.\"</p><p class=\"\">Cassidy arrived late to the committee vote, walking into the room with Senate Majority Leader John Thune (R., S.D.).</p><p class=\"\">\"I've had very intense conversations with Bobby and the White House over the weekend and even this morning,\" Cassidy said in a social-media post shortly before the vote. \"I want to thank VP JD specifically for his honest counsel.\"</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Jared S. Hopkins contributed to this article.</li></ul><p class=\"\">Write to Kristina Peterson at kristina.peterson@wsj.com and Liz Essley Whyte at liz.whyte@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007976:0/",
            "pub_date": "2025-02-05 02:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009185:0",
            "title": "Gold Keeps Hitting Record Highs. Here's Why — and Which Stocks Could Benefit. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul R. La Monica</p><p class=\"\">Worries about tariffs are spooking many investors. But not gold bulls. Fans of the yellow metal are probably relishing all the uncertainty that President Donald Trump's tariff threats are creating.</p><p class=\"\">Gold prices are up nearly 9% already this year At just under $2,900 an ounce, the yellow metal is at a record high. And that follows a nearly 30% gain for gold in 2024.</p><p class=\"\">Investors in mining stocks are doing even better. The VanEck Gold Miners exchange-traded fund, which has big stakes in Newmont Corp., Agnico Eagle Mines and Barrick Gold, has soared 18% so far in 2025.</p><p class=\"\">Should investors be a little wary after such a big run this year on top of 2024's massive gains? Of course. That would be prudent. But it's worth noting that the mining stocks could have more room to run if gold prices keep climbing. And that seems very plausible.</p><p class=\"\">It appears that both foreign central banks and retail investors are fueling the rally. Poland, Turkey, India, and China have been big buyers, according to data from late last year from the World Gold Council.</p><p class=\"\">\"Emerging market banks are very committed to gold and well positioned to purchase more. Strategically, they will continue to be buyers,\" said Joe Cavatoni, senior markets strategist with the World Gold Council, in an interview with Barron's.</p><p class=\"\">It's all about the Trump trade war. The continued surge in gold is a bit unusual since it's happening at a time when the U.S. dollar is also strengthening.</p><p class=\"\">Frank Watson, a markets analyst for Kinesis Money, pointed out that a surging greenback is \"normally a bearish element for dollar-denominated gold prices,\" but he added that \"gold's safe haven appeal remains undiminished amid uncertainty over the economic and inflationary effects of expected US trade tariffs.\" In other words, Trump trade policies may trump the usual impact a strong dollar has on gold.</p><p class=\"\">Silver prices have been climbing too, rising about 13% so far this year. Alex Ebkarian, chief operating officer of physical precious metals dealer Allegiance Gold, said in an email to Barron's that the prices of both metals should keep climbing due to the market uncertainty.</p><p class=\"\">\"In a high-risk environment, the appeal of physical gold and silver becomes even more pronounced, as they eliminate counterparty risk and provide a reliable store of value,\" he said, adding that the recent move by JPMorgan Chase to deliver about $4 billion worth in gold futures is \"an apparent hedge against potential trade disruptions.\"</p><p class=\"\">So how much higher could gold go? Michael Arone, chief investment strategist for State Street's SPDR Business, thinks gold could top $3,000 an ounce sometime this year due to all that's happening on the worldwide landscape.</p><p class=\"\">\"Geopolitical risks and structural transitions in monetary and fiscal policies should also boost the prospects for gold,\" Arone wrote. \"Central bank purchases throughout the year will likely continue to support gold's price. All that could finally unleash some pent up investment demand from investors chasing last year's record gold prices.\"</p><p class=\"\">That should be good news as well for the mining stocks, which despite their big run already this year, remain reasonably valued. The VanEck Gold Miners ETF is trading for just 12 times 2025 earnings estimates, lower than its 5-year average of 15. It's also trading at about a price-to-earnings ratio that is 45% below the S&amp;P 500, much steeper than its usual 20% discount to the broader market.</p><p class=\"\">Write to Paul R. La Monica at paul.lamonica@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009185:0/",
            "pub_date": "2025-02-05 02:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309147:0",
            "title": "Quebec Innovative Up After Strategic Announcement With Avalio Pty",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Quebec Innovative Materials (QIMC.CN) on Tuesday said it formed a strategic collaboration with Avalio Pty, a geoscience and drilling technology firm, to advance natural hydrogen exploration and development. </p><p class=\"\">The company said this collaboration will integrate Avalio's specialized expertise with QIMC's ongoing exploration initiatives. </p><p class=\"\">Partnership will focus on the customization of drilling technologies designed for depths between 500 meters and 1.5 kilometers, joint appraisal and evaluation methodologies, and the implementation of strategic risk management frameworks. </p><p class=\"\">Shares of the company were last seen up $0.005 at $0.10 on the Canadian Securities Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309147:0/",
            "pub_date": "2025-02-05 02:51:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309155:0",
            "title": "National Bank Reviews TMX Group Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TMX Group reported adjusted fourth-quarter EPS of $0.48, up 31% and ahead of the Street $0.44</p><p class=\"\">\"This is another solid quarter for TMX. Revenues beat in the right places (e.g., Trayport, VettaFi, Issuer Services), which helped to deliver a solid 9% EPS beat,\" writes National Bank analyst Jaeme Gloyn. </p><p class=\"\">Looking ahead, TMX announced pricing increases at Trayport, Datalinx, and Listing fees that will drive 1% revenue upside in 2025. National Bank believes these results are sufficient to uphold TMX's premium valuation. </p><p class=\"\">Maintain $50 target, Sector Perform rating.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309155:0/",
            "pub_date": "2025-02-05 02:51:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009507:0",
            "title": "Psychedelic Drug Stocks Up, Vaccine Shares Down After Senate Committee Advances RFK Jr.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dean Seal</p><p class=\"\">Shares of companies developing psychedelic treatments jumped while those of vaccine makers slipped after a Senate committee advanced the nomination of Robert F. Kennedy Jr. to lead the Health and Human Services Department.</p><p class=\"\">The controversial nominee has previously said he believes psychedelic drugs could be useful therapeutics and should be decriminalized.</p><p class=\"\">Shares of Mind Medicine, the company better known as MindMed that is working on an LSD-based treatment for anxiety, were up 7.3% at $7.91 on Tuesday. Shares of Compass Pathways, which is developing a psilocybin product for depression, rose 9.9% to $4.74. Shares of ATAI Life Sciences, another developer of psychedelic therapies, surged 21% to $2.25.</p><p class=\"\">Kennedy has been a vocal skeptic of vaccines and repeatedly made false claims that they cause autism. He has refused to walk the claim back even at the urging of Sen. Bill Cassidy (R., La.). Cassidy said he struggled with Kennedy's past comments on vaccines but nonetheless cast the deciding vote in favor of his nomination.</p><p class=\"\">Shares of Moderna were down 5.2% to $34.65 while shares of Pfizer dropped 2% to $25.67, despite the company reporting better-than-expected fourth-quarter results Tuesday.</p><p class=\"\">Shares of Novavax and BioNTech, two more vaccine companies, were down about 1% each.</p><p class=\"\">A full Senate vote to confirm Kennedy hasn't been scheduled yet. He can afford to lose up to three Republican votes if all Democrats oppose him.</p><p class=\"\">Write to Dean Seal at dean.seal@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009507:0-psychedelic-drug-stocks-up-vaccine-shares-down-after-senate-committee-advances-rfk-jr/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009511:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1352 ET - Economists polled in January by the Bank of Mexico lowered their economic growth estimate for this year to 1% from 1.1% in December, while inflation expectations were virtually unchanged at 3.83% and 3.74% for core CPI. GDP slowed to 1.5% in 2024 from 3.3% the previous year, according to statistics institute Inegi. While public security remained the top perceived obstacle to growth, the percentage of analysts citing foreign trade policy rose to 13% from 7% in the previous survey. On Monday, Mexico reached agreement with President Trump to hold off imposing 25% tariffs on Mexican goods for a month while Mexico takes action to curb migration and fentanyl trafficking. (anthony.harrup@wsj.com)</p><p class=\"\">1313 ET - A few days after its quarterly launch, the Atlanta Fed's real-time estimate of 1Q GDP shows the U.S. economy growing at a 3.9% annualized pace over the three months through March. That would be a sharp step up from the 2.3% annualized rate recorded in 4Q 2024 and is well above most Wall Street analysts' forecasts. The model hasn't ingested much 1Q data yet, but recent construction-spending data and ISM manufacturing indexes have pushed the forecast in a positive direction. The first official estimates of 1Q GDP from the Commerce Department are expected to land in late April. (matt.grossman@wsj.com, @mattgrossman)</p><p class=\"\">1154 ET - Economist and market strategist David Rosenberg says he believes Canada and Mexico should have called President Trump's bluff on a 25% tariff. \"That may end up having been a mistake,\" says the head of Rosenberg Research. In a note to clients after the tariff reprieve, Rosenberg says he believes trade uncertainty overhanging Canada and Mexico will dissipate. \"The 30-day reprieve is a joke. Trump is not raising tariffs and probably was never going to,\" Rosenberg says. Canada now avoids a deep recession, Rosenberg says. The Canadian dollar has strengthened, with USDCAD at C$1.4318, or down 3.2% from a Sunday night peak. Still, Rosenberg sticks to his call for USDCAD at C$1.62, with Canada's economy set to underperform the U.S. and require more rate relief. (Paul.Vieira@wsj.com, @paulvieira)</p><p class=\"\">1127 ET - U.S. farmers carried an optimistic outlook into 2025, according to the latest Ag Economy Barometer published by Purdue University and the CME Group. Surveyed farmers say that their view of current conditions of the agricultural economy have improved, buoyed by a month of gains for row crop prices on the CBOT. Farmers are increasingly expecting to have a 'more robust' year financially than last year — although some concerns remain. Some 42% of surveyed farmers identified trade policy as their top policy concern over the next five years. Even so, 40% of farmers now say a trade war is likely or very likely, down 8 points from last month's survey. Some 29% say a trade war is unlikely or very unlikely, which is an 8 point increase from last month. (kirk.maltais@wsj.com)</p><p class=\"\">1119 ET - Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p><p class=\"\">1100 ET - Risk premia, or spreads, on euro-denominated credit are expected to tighten further in February, Societe Generale's Juan Valencia says in a note. In recent years, euro credit spreads have tightened modestly in February, excluding in 2020 due to the impact of Covid-19 and in 2022 following Russia's invasion of Ukraine. The pattern is likely to continue with slight spread tightening this February, he says. \"At the moment we don't see much evidence of a correction with spreads widening any time soon,\" Valencia says. (miriam.mukuru@wsj.com)</p><p class=\"\">1059 ET - U.S. and European high-yield bond issuers are well-equipped to cope with upcoming maturities, says MFS Investment Management's Benoit Anne in a note. Refinancing risk is therefore not a major challenge. \"In the U.S., it is not until 2028 and 2029 that the volume of maturities falling due peaks up, which leaves us with a couple of years of cushion,\" he says. In Europe, a significant number of maturies fall due in 2026 and 2027, but interest-rate cuts by the European Central Bank are likely to ease some of the refinancing pain, Anne says. (miriam.mukuru@wsj.com)</p><p class=\"\">1050 ET - Generative artificial intelligence is here to stay, and set to have a profound impact on the mergers and acquisitions market, Bain &amp; Company says in a report. \"We expect that companies that master the use of generative AI in M&amp;A over the next five years will identify targets faster than their competitors,\" the management-consulting firm says. About one in five surveyed companies currently uses generative AI in M&amp;A processes, and more than half expect to integrate it into their dealmaking by 2027, according to the report. Late followers to adopt AI will be outbid for good deals and find themselves staying too long in the process for bad deals, Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1047 ET - Duration from a long-term perspective looks attractive, although the tactical--or short-term--case for being long U.S. duration has become more challenging, says MFS Investment Management's Benoit Anne in a note. The case for fixed income is even stronger outside of the U.S., he says. In Europe, there are strong arguments in favor of both tactical and strategic exposure to fixed income given the significant monetary policy divergence between the U.S. and the eurozone, he says. The Federal Reserve paused last week, while the European Central Bank cut interest rates by 25 basis points. (emese.bartha@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1028 ET - Germany's current political turmoil, with elections to be held later this month, should have a muted impact on German government bonds, says MFS Investment Management's Annalisa Piazza in a note. \"Swap spreads have moved well in advance and are already pricing in some political and policy changes (such as more fiscal space),\" the fixed income research analyst says. MFS IM expects the German bond curve to remain the go-to safe haven among eurozone government bonds in the medium term. (emese.bartha@wsj.com)</p><p class=\"\">1008 ET - The euro has limited scope to recover even as hopes rise that the EU can avert threatened U.S. trade tariffs after President Trump postponed a levy on Canadian and Mexican imports, ING's Francesco Pesole says in a note. Trump's decision to delay tariffs on his U.S. neighbors could reflect domestic backlash over potential economic pain for U.S. consumers but the same isn't necessarily true for the EU, he says. Trump can afford to keep EU tariffs in place for a prolonged period, making the bloc feel some pain before striking a deal. \"With all this in mind, we are somewhat sceptical that the euro is bound for a major rally.\" The euro rises 0.2% to $1.0364. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009511:0/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009509:0",
            "title": "Economists Trim Mexico's 2025 Growth Outlook — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Economists polled in January by the Bank of Mexico lowered their economic growth estimate for this year to 1% from 1.1% in December, while inflation expectations were virtually unchanged at 3.83% and 3.74% for core CPI. GDP slowed to 1.5% in 2024 from 3.3% the previous year, according to statistics institute Inegi. While public security remained the top perceived obstacle to growth, the percentage of analysts citing foreign trade policy rose to 13% from 7% in the previous survey. On Monday, Mexico reached agreement with President Trump to hold off imposing 25% tariffs on Mexican goods for a month while Mexico takes action to curb migration and fentanyl trafficking. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009509:0/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204012283:0",
            "title": "Buffett's Berkshire Hathaway buys more Sirius XM stock as it continues to bounce",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tomi Kilgore</p><p class=\"\">Warren Buffett now owns more than 35% of Sirius XM shares, after spending $54 million in latest round of purchases</p><p class=\"\">Shares of Sirius XM Holdings Inc. climbed toward a two-month high Tuesday after Berkshire Hathaway Inc. disclosed that it boosted its stake in the satellite-radio company to more than 35%.</p><p class=\"\">In a Form 4 filing with the Securities and Exchange Commission, Warren Buffett's investment vehicle (BRK.B) (BRK.A) said that from Jan. 30 to Feb. 3, it spent $54 million to purchase 2,308,119 Sirius XM shares (SIRI) at a weighted average price of $23.38.</p><p class=\"\">Sirius XM's stock was up 1.1% in afternoon trading, to put it on track for its highest close since Dec. 12.</p><p class=\"\">Berkshire now owns 119.8 million shares, or 35.4% of the Sirius XM shares outstanding. That makes Berkshire by far the biggest shareholder, with Vanguard in second place at 6.6%, according to FactSet data.</p><p class=\"\">Buffett's investment vehicle started loading up on Sirius XM shares in 2024. On Sept. 10, the company became an independent public company with a simplified capital structure following the closing of q deal with Liberty Media.</p><p class=\"\">On Sept. 19, after a year-to-date plunge in the stock of 56.1%, Berkshire filed a Schedule 13G form to disclose that it owned 105.16 million Sirius XM shares, or 31% of the shares outstanding.</p><p class=\"\">Schedule 13G is used for the required disclosure when a security holder owns a stake of more than 5% in a company. Owners who file 13Gs tend to be more passive investors than those who file Schedule 13Ds, which include a section for the investor to disclose the purpose of the transaction.</p><p class=\"\">Since then, Berkshire has spent $350.76 million to buy 14.62 million shares, at a weighted average price of $23.99.</p><p class=\"\">The stock has gained 1% since Sept. 19 and 17.9% since closing at a 12-year low of $20.58 on Dec. 19. And it's trading 1.1% above the price Berkshire paid to buy the stock over the past four months.</p><p class=\"\">So far this year, the stock has gained 6.4%, while the S&amp;P 500 SPX has tacked on 2.5%. The stock had fallen for five straight years through 2024, tumbling 68.1% during that time.</p><p class=\"\">-Tomi Kilgore</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204012283:0/",
            "pub_date": "2025-02-05 02:52:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2rG2C0:0",
            "title": "REVO ZERO Launches Crowdfunding Campaign to Bring Zero-Emissions Transportation to the Masses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HERNDON, Va., Feb.  04, 2025  (GLOBE NEWSWIRE) — REVO ZERO, an innovative leader in zero-emissions transportation, is thrilled to announce the launch of its crowdfunding campaign on Netcapital. This campaign offers supporters and investors an opportunity to play a direct role in advancing the zero-emissions revolution.</p><p class=\"\">“Our mission has always been to make hassle-free, zero-emissions transportation accessible to everyone,” said Ruben Creus, CEO of REVO ZERO. “We believe that it takes a crowd to start a <em>REVO</em>lution and we wanted to invite our loyal supporters to join us in shaping the future of sustainable mobility.”</p><p class=\"\">Through this campaign, anyone can invest in REVO ZERO for as little as $250 or as much as they want. Hosted on Netcapital, a trusted crowdfunding platform, this initiative is open under Regulation CF, allowing participation from both accredited and non-accredited investors.</p><p class=\"\">As an exciting benefit, supporters can apply their investment towards the pre-order of the Model ENERGY SUV, REVO ZERO’s flagship large luxury vehicle featuring a 700-mile range and a 7-minute refueling time. The Model ENERGY leverages cutting-edge pFC Technology, coupling a plug-in battery with a hydrogen fuel cell for unmatched range, refueling time, and sustainability. This groundbreaking innovation represents a major leap forward in zero-emissions mobility and brings the next generation of zero-emissions vehicles to the market.</p><p class=\"\">Martin Kay, CEO of Netcapital Inc., emphasized the benefits of the Regulation CF framework: “Regulation CF allows companies to access a new source of capital by offering securities to a diverse group of investors, including individual retail investors that are non-accredited. In addition to raising capital, Regulation CF campaigns can help raise awareness about your business and attract potential customers or partners. We look forward to working with REVO ZERO to build a community of supporters who are interested in helping REVO ZERO succeed.\"</p><p class=\"\">The crowdfunding campaign will remain open for a limited time, and supporters are encouraged to act quickly. For more information, or to invest, visit the official campaign page on Netcapital:</p><p class=\"\">https://netcapital.com/companies/revozero</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Join the REVOlution towards ZERO-emissions</strong></p><p class=\"\">REVO ZERO’s journey is just beginning. By investing today, you’re not only supporting a company—you’re becoming part of a mission to revolutionize transportation for a sustainable future.</p><p class=\"\">For press inquiries or additional information, please contact:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">media@revozero.com</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About REVO ZERO:</strong></p><p class=\"\">REVO ZERO is a pioneering company dedicated to creating convenient, hassle-free zero-emissions transportation solutions. Committed to sustainability and innovation, REVO ZERO is leading the way toward a greener future.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2rG2C0:0-revo-zero-launches-crowdfunding-campaign-to-bring-zero-emissions-transportation-to-the-masses/",
            "pub_date": "2025-02-05 02:53:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV138:0",
            "title": "Urals diffs stable; Russia increases oil lifting plan for western ports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Urals crude differentials were steady on Tuesday while Russia's provisional February loading plan for western ports was revised up by 19% because of lower output from refiners, traders said and Reuters calculations showed.</p><p class=\"\">The revision to 1.9 million barrels per day (bpd) from the provisional plan of 1.6 million bpd follows Ukrainian drone attacks on refineries that have led to reduced processing, leaving more crude for export, the traders said.</p><p class=\"\">PLATTS WINDOW</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">No bids or offers were shown for Urals, Azeri BTC and CPC Blend in the Platts window on Tuesday.</p></li></ul><p class=\"\">NEWS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Kazakhstan will do whatever is necessary in 2025 and 2026 to fulfil its obligations under the OPEC+ agreement and compensate for oil overproduction in 2024, Kazakhstan's energy ministry said on Tuesday.</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV138:0-urals-diffs-stable-russia-increases-oil-lifting-plan-for-western-ports/",
            "pub_date": "2025-02-05 02:54:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1C6:0",
            "title": "US energy firms, Lancaster Colony, Xylem",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Eikon search string for individual stock moves:STXBZ</li></ul></span></div><span><p class=\"\">Wall Street was on track to a cautious opening on Tuesday as investor appetite for risk waned after China retaliated against new trade restrictions announced by U.S. President Donald Trump with counter tariffs. </p><p class=\"\">At  13:30 EST, the Dow Jones Industrial Average  was up 0.17% at 44,497.79. The S&amp;P 500  was up 0.60% at 6,030.77, and the Nasdaq Composite  was up 1.15% at 19,614.70.</p><p class=\"\">The top three S&amp;P 500 (.PG.INX) percentage gainers:</p><p class=\"\">** Palantir Technologies Inc , up 22.4%</p><p class=\"\">** Super Micro Computer Inc , up 7.4%</p><p class=\"\">** Marathon Petroleum Corp , up 6.7%</p><p class=\"\">The top three S&amp;P 500 (.PL.INX) percentage losers:</p><p class=\"\">** Estee Lauder Companies Inc , down 15.2%</p><p class=\"\">** PayPal Holdings Inc , down 11.7%</p><p class=\"\">** Merck &amp; Co Inc , down 10.3%</p><p class=\"\">The top three NYSE (.PG.N) percentage gainers:</p><p class=\"\">** Beyond Inc , up 26.9%</p><p class=\"\">** 3D Systems Corp , up 18.3%</p><p class=\"\">** Butterfly Network Inc , up 17.2%</p><p class=\"\">The top three NYSE (.PL.N) percentage losers:</p><p class=\"\">** Atkore Inc , down 21.2%</p><p class=\"\">** Estee Lauder Companies Inc , down 15.2%</p><p class=\"\">** Merck &amp; Co Inc , down 10.3%</p><p class=\"\">The top three Nasdaq (.PG.O) percentage gainers:</p><p class=\"\">** Captivision Inc , up 157.4%</p><p class=\"\">** Nuvve Holding Corp , up 78.9%</p><p class=\"\">** Quantum BioPharma Ltd , up 70.8%</p><p class=\"\">The top three Nasdaq (.PL.O) percentage losers:</p><p class=\"\">** Omega Therapeutics Inc , down 58.3%</p><p class=\"\">** Cloudastructure Inc , down 33.7%</p><p class=\"\">** Universe Pharmaceuticals Inc , down 33.6%</p><p class=\"\"> ** Illumina Inc :</p><p class=\"\">BUZZ - PVH slide as China retaliates after US tariffs kick in </p><p class=\"\"> ** Merck &amp; Co Inc :</p><p class=\"\">BUZZ - Earnings, revenue expected to rise in Q4 </p><p class=\"\"> ** Sirius XM Holdings Inc :</p><p class=\"\">BUZZ - Gains as Buffett's Berkshire buys more shares </p><p class=\"\"> ** Super Micro Computer Inc :</p><p class=\"\">BUZZ - To issue Q2 update next week; stock rises </p><p class=\"\"> ** Palantir Technologies Inc :</p><p class=\"\">BUZZ - Shares surge on strong forecasts; MS upgrades to 'equal-weight' </p><p class=\"\"> ** Coinbase Global Inc :</p><p class=\"\"> ** Riot Platforms Inc :</p><p class=\"\"> ** Marathon Digital Inc :</p><p class=\"\"> ** Bit Digital Inc :</p><p class=\"\">BUZZ - Crypto stocks fall tracking bitcoin weakness </p><p class=\"\"> ** CNH Industrial N.V :</p><p class=\"\">BUZZ - Down after smaller-than-expected FY profit forecast, Q4 profit miss </p><p class=\"\"> ** Apollo Global Management Inc :</p><p class=\"\">BUZZ - Rises after Q4 profit beats estimates </p><p class=\"\"> ** Marathon Petroleum Corp :</p><p class=\"\">BUZZ - Rises on Q4 profit beat </p><p class=\"\"> ** PepsiCo Inc :</p><p class=\"\">BUZZ - Down after weak annual profit forecast, Q4 revenue miss </p><p class=\"\"> ** Spotify Inc :</p><p class=\"\">BUZZ - Rises on upbeat Q1 profit estimates </p><p class=\"\"> ** Pfizer Inc :</p><p class=\"\">BUZZ - Rises on better-than-expected quarterly results </p><p class=\"\"> ** DraftKings Inc :</p><p class=\"\">BUZZ - TD Cowen cuts DraftKings PT on taxes, potential gambling losses </p><p class=\"\"> ** Archer Daniels Midland Co :</p><p class=\"\">BUZZ - Falls on Q4 profit miss </p><p class=\"\"> ** Jacobs Solutions Inc :</p><p class=\"\">BUZZ - Beats quarterly profit estimates, shares rise </p><p class=\"\"> ** PayPal Holdings Inc :</p><p class=\"\">BUZZ - Falls as Q4 margin contraction clouds upbeat 2025 profit forecast </p><p class=\"\"> ** Regeneron Pharmaceuticals Inc :</p><p class=\"\">BUZZ - Rises on new dividend program, Q4 results beat </p><p class=\"\"> ** Estee Lauder Companies Inc :</p><p class=\"\">BUZZ - Falls on gloomy quarterly profit forecast; announces job cuts </p><p class=\"\"> ** BBB Foods Inc :</p><p class=\"\">BUZZ - Falls after secondary offering unveiled </p><p class=\"\"> ** Brenmiller Energy Ltd :</p><p class=\"\">BUZZ - To launch thermal energy storage system; shares up </p><p class=\"\"> ** Intel Corp :</p><p class=\"\">BUZZ - Falls after report says China mulls formal probe into chipmaker </p><p class=\"\"> ** Cummins Inc :</p><p class=\"\">BUZZ - Rises after Q4 results beat </p><p class=\"\"> ** Crown Holdings Inc :</p><p class=\"\">BUZZ - Analysts say Trump tariffs could disrupt pulp, packaging sector </p><p class=\"\"> ** Hubbell Inc :</p><p class=\"\">BUZZ - Falls on quarterly sales miss </p><p class=\"\"> ** Newmont Corp : </p><p class=\"\"> ** Barrick Gold Corp : </p><p class=\"\"> ** Gold Fields Ltd :</p><p class=\"\"> ** Sibanye Stillwater Ltd :</p><p class=\"\">BUZZ - Gold miners up as bullion prices hit record high </p><p class=\"\"> ** Synaptics Inc :</p><p class=\"\">BUZZ - Shares tumble after CEO departs to Lumentum: LITE stock up </p><p class=\"\"> ** Ametek Inc :</p><p class=\"\">BUZZ - Shares fall after forecasting annual profit below estimates </p><p class=\"\"> ** Ball Corp :</p><p class=\"\">BUZZ - Falls after missing quarterly sales expectations </p><p class=\"\"> ** Netflix Inc :</p><p class=\"\">BUZZ - Crosses $1,000 mark for the first time </p><p class=\"\">** NextDecade Corp :</p><p class=\"\">** Cheniere Energy Inc :</p><p class=\"\">** New Fortress Energy Inc :</p><p class=\"\">** United States Natural Gas Fund LP :</p><p class=\"\">BUZZ - US natgas firms fall on lower LNG feedgas, tariff delays </p><p class=\"\"> ** Supernus Pharmaceuticals Inc :</p><p class=\"\">BUZZ - Rises after FDA approves its drug-device combination for Parkinson's disease </p><p class=\"\"> ** Centene Corp :</p><p class=\"\">BUZZ - Falls on higher Q4 Medicaid costs </p><p class=\"\">** Alibaba.com Ltd :</p><p class=\"\">** JD.com Inc :</p><p class=\"\">** Pinduoduo Inc :</p><p class=\"\">** Bilibili Inc :</p><p class=\"\">BUZZ - China ADRs recover despite tit-for-tat tariffs </p><p class=\"\"> ** GH Research PLC :</p><p class=\"\">BUZZ - Slides on planned stock sale to fund depression treatments </p><p class=\"\"> ** Moderna Inc :</p><p class=\"\"> ** BioNTech SE :</p><p class=\"\"> ** Novavax Inc :</p><p class=\"\">BUZZ - Vaccine makers fall as Kennedy moves closer to health secretary job </p><p class=\"\"> ** Advanced Micro Devices Inc :</p><p class=\"\">BUZZ - Shares up; Q4 rev, EPS seen rising </p><p class=\"\"> ** J &amp; J Snack Foods Corp :</p><p class=\"\">BUZZ - Down after first-quarter profit miss </p><p class=\"\"> ** Madison Square Garden Sports Corp :</p><p class=\"\">BUZZ - Falls after Q2 profit miss </p><p class=\"\"> ** Alphabet Inc :</p><p class=\"\">BUZZ - Shares hit fresh record as Q4 EPS, rev seen rising </p><p class=\"\"> ** PJT Partners Inc :</p><p class=\"\">BUZZ - Shares hit record high after Q4 results beat estimates </p><p class=\"\">** Exxon Mobil Corp : </p><p class=\"\">** Chevron Corp :</p><p class=\"\">** Phillips 66 :</p><p class=\"\">** Valero Energy Corp :</p><p class=\"\">BUZZ - US energy firms rise as Trump set to reimpose 'maximum pressure' on Iran </p><p class=\"\"> ** Lancaster Colony Corp :</p><p class=\"\">BUZZ - Rises on Q2 sales beat </p><p class=\"\"> ** Xylem Inc :</p><p class=\"\">BUZZ - Up after upbeat Q4 results </p><p class=\"\"> The 11 major S&amp;P 500 sectors:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Index RIC</p></td><td><p class=\"\">Index name</p></td><td><p class=\"\">Percent change %</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500</p></td><td><p class=\"\">0.6 </p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Information Technology</p></td><td><p class=\"\">1.3</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Utilities</p></td><td><p class=\"\">-0.72</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Consumer Discretionary</p></td><td><p class=\"\">0.97</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Materials</p></td><td><p class=\"\">0.32</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Industrials</p></td><td><p class=\"\">0.18</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Communication Services (Sector)</p></td><td><p class=\"\">1.24</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Financials</p></td><td><p class=\"\">-0.14</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Real Estate</p></td><td><p class=\"\">-0.08</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Health Care</p></td><td><p class=\"\">-0.41</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Consumer Staples</p></td><td><p class=\"\">-0.52</p></td></tr><tr><td><p class=\"\"></p></td><td><p class=\"\">S&amp;P 500 Energy</p></td><td><p class=\"\">1.95</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1C6:0-us-energy-firms-lancaster-colony-xylem/",
            "pub_date": "2025-02-05 02:46:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009461:0",
            "title": "Ralph Lauren Is Maintained at Buy by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:47 GMT) </strong>Ralph Lauren Price Target Raised to $268.00/Share From $258.00 by TD Cowen</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009461:0/",
            "pub_date": "2025-02-05 02:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009460:0",
            "title": "China Tariffs More a Bump Than a Roadblock for Tractor Suppliers — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Bob Tita</p><p class=\"\">China's retaliatory 10% tariff on imports of U.S.-made tractors, crop harvesters and other farm equipment is likely to have a minimal effect on U.S. equipment makers, analysts say.</p><p class=\"\">Farm equipment exported to China amounts to about $500 million a year, according to a Jefferies analysis of Census Bureau data. The firm estimated U.S.-made machinery exported to China accounts for about 1% of Deere &amp; Co.'s sales, and likely includes road paving and construction equipment as well. Deere's total equipment sales last year were nearly $45 billion.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009460:0/",
            "pub_date": "2025-02-05 02:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:5c8f59aaf094b:0",
            "title": "XRP bearish divergence raises chance of $2 retest — Here’s what bulls must do",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">XRP’s price registered a multimonth range low at $1.78 during its recent correction before swiftly recovering above $2.50 on the daily chart. <span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:592.4723247232472px;max-width:1200px;aspect-ratio:2.0254110612855007\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-9154645892dfccbc9ca8703e2775ee1f-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-9154645892dfccbc9ca8703e2775ee1f-resized.jpeg\" style=\"background-color:#f9f8f9\"/></picture></div></figure></span></p><p class=\"\">However, the altcoin faces a critical test to invalidate a key bearish signal, possibly turning the tides in the seller’s favor. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP shows bearish divergence on the daily and weekly chart</strong></p><p class=\"\">XRP’s parabolic rally over the past three months took its value from $0.50 to its all-time high range at $3.40, i.e., a 580% rise. The altcoin disrupted multi-year resistance levels, and in January, XRP recorded its highest monthly close at $3.03. </p><p class=\"\">The recent flash crash due to a non-crypto political event implied that buyers’ liquidity is slowly evaporating on the upside. With the markets riddled with volatility, XRP’s long-term chart painted the formation of a bearish divergence on both the daily and weekly charts. <span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:591.1634756995581px;max-width:1200px;aspect-ratio:2.029895366218236\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-aa5bd6f757d5eed6ebe10a08433ef0a1-resized.webp\" type=\"images/webp\"/><img alt=\"Ripple, XRP, Markets, Price Analysis, Market Analysis, Altcoin Watch\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-aa5bd6f757d5eed6ebe10a08433ef0a1-resized.jpeg\" style=\"background-color:#f6f6f7\"/></picture></div></figure></span></p><p class=\"\">As illustrated in the chart, XRP’s price has formed a higher high over the recent weeks, whereas its relative strength index (RSI) has formed a lower high. The RSI indicator on both charts also trended down from an overbought region, which means buyers are slowing down and losing momentum. </p><p class=\"\">While XRP has managed to invalidate previous divergences formed on the lower time frames (LTF), a bearish divergence on the 1-day and weekly chart raises concerns since high-time frame (HTF) charts determine a more dominant trend. </p><p class=\"\">The potential consequence of these bearish divergences is another move below $2, which is a 23% drop from its current value. The probability has also increased since the altcoin formed a new low at $1.78, where new liquidity pockets will be formed. </p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Related: Why is XRP price up today?</strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Will XRP invalidate its bearish thesis?</strong></p><p class=\"\">A fundamental part of technical analysis is that each signal or pattern has an invalidation. Likewise, XRP’s bearish divergence on the daily and weekly chart could also be dismissed if the altcoin can retain a position above $2.90 on the daily chart. <span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:592.4723247232472px;max-width:1200px;aspect-ratio:2.0254110612855007\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-2e23430ede5944f59ddf284a8766df1d-resized.webp\" type=\"images/webp\"/><img alt=\"Ripple, XRP, Markets, Price Analysis, Market Analysis, Altcoin Watch\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:5c8f59aaf094b-2e23430ede5944f59ddf284a8766df1d-resized.jpeg\" style=\"background-color:#f9f8f9\"/></picture></div></figure></span></p><p class=\"\">The $2.90 level was XRP’s previous higher high formed in December, which also acted as a support level after XRP re-tested its previous all-time high at $3.40. Binance and Coinbase spot activity was also largely concentrated around $2.90, which sent the altcoin above $3 in mid-January. </p><p class=\"\">A recovery above $2.90 would re-establish a bullish market structure, diminishing the effects of XRP’s recent bearish lows. However, time is of the essence in these conditions, as a continued lack of clear directional bias favors the bears since sellers were the market movers for the last major price move. </p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Related: Bitcoin bull trap? Watch these BTC price levels as BTC price risks $90K retrace</strong></em></p><p class=\"\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:5c8f59aaf094b:0-xrp-bearish-divergence-raises-chance-of-2-retest-here-s-what-bulls-must-do/",
            "pub_date": "2025-02-05 02:48:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009476:0",
            "title": "UNITED CORPORATIONS LIMITED ANNOUNCES DIVIDENDS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UNITED CORPORATIONS LIMITED ANNOUNCES DIVIDENDS</p><p class=\"\">Canada NewsWire</p><p class=\"\">TORONTO, Feb. 4, 2025</p><p class=\"\">TORONTO, Feb. 4, 2025 /CNW/ - The Board of Directors of United Corporations Limited     today declared the following cash dividends:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Class                      Record Date   Payable Date   Amount of Dividend <br/>First Preferred Shares     May 5, 2025   May 15, 2025               $0.375 <br/>Second Preferred Shares,   May 5, 2025   May 15, 2025               $0.375 <br/> 1959 Series <br/>Second Preferred Shares,   May 5, 2025   May 15, 2025               $0.375 <br/> 1963 Series <br/>Common Shares              May 5, 2025   May 15, 2025                $0.30 <br/> </pre><p class=\"\">United Corporations Limited advises that the above referenced dividends are eligible dividends for the purposes of the Income Tax Act (Canada) and any similar provincial legislation.</p><p class=\"\">SOURCE United Corporations Limited</p><p class=\"\">View original content: http://www.newswire.ca/en/releases/archive/February2025/04/c8256.html</p><p class=\"\">/CONTACT:</p><p class=\"\">For further information please contact: Frank J. Glosnek, Treasurer, Telephone: (416) 947-2578, Fax: (416) 362-2592, www.ucorp.ca</p><p class=\"\">Copyright CNW Group 2025</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009476:0/",
            "pub_date": "2025-02-05 02:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008163:0",
            "title": "Drug Stocks Stumble as RFK Jr.'s HHS Nomination Moves Forward to a Senate Vote — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis</p><p class=\"\">The Senate's finance committee has cleared the way for Robert F. Kennedy Jr.'s health secretary nomination to head to a full Senate vote, pushing him a major step closer to confirmation.</p><p class=\"\">The committee voted Tuesday to favorably refer Trump's Health and Human Services secretary nominee — a strident critic of vaccines and a skeptic of their vaccine — to the Senate. Drug and food stocks stumbled after the panel's vote, as the once unthinkable notion of Kennedy leading the federal government's public health bureaucracy moved closer to reality.</p><p class=\"\">Shares of Pfizer, a major vaccine maker, fell from $26.25 ahead of the vote to $25.66 immediately after, a 2.2% drop. The stock is now down on the day, though releasing earnings results Tuesday morning that beat expectations.</p><p class=\"\">Shares of the vaccine maker Moderna tumbled 9% following the vote before recovering, and are are now down 3.9% on the day.</p><p class=\"\">The S&amp;P 500 Pharmaceuticals Industry index, which tracks drug stocks in the S&amp;P 500, fell roughly 1% following the vote, and the SPDR S&amp;P Biotech ETF, which tracks biotech stocks, fell 1.5%.</p><p class=\"\">Food stocks also dropped, and the S&amp;P Food and Beverage Select Industry index was down roughly 0.6% following the vote.</p><p class=\"\">A powerful Republican, Sen. Bill Cassidy (R., La.), had directed challenging lines of questioning at Kennedy in hearings last week, leading to widespread speculation that he might eventually oppose the nominee's approval.</p><p class=\"\">On Tuesday, however, Cassidy voted to favorably approve Kennedy's nomination out of committee. The vote was split along party lines, with Sen. Bernie Sanders of Vermont, an independent, voting with the Democrats.</p><p class=\"\">Cassidy could still vote against Kennedy when the full Senate votes. He arrived late to Tuesday's committee meeting, and left without making any comments on his vote. If four Republicans vote against Kennedy on the Senate floor, his nomination would fail.</p><p class=\"\">The vote of the full Senate on the nomination has not yet been scheduled.</p><p class=\"\">Kennedy's bid to lead the U.S. Department of Health and Human Services — which has the largest budget of any federal agency — has roiled Washington more than virtually any of President Donald Trump's top nominees thus far.</p><p class=\"\">Kennedy's stance toward vaccines has been a key focus for lawmakers. In a hearing last week, under questioning by Cassidy, Kennedy declined to assert that measles and hepatitis b vaccines don't cause autism.</p><p class=\"\">\"That's kind of a yes or no question,\" Cassidy said.</p><p class=\"\">\"If the data is there, I will absolutely do that,\" Kennedy said.</p><p class=\"\">\"The data has been there for a long time,\" Cassidy said.</p><p class=\"\">Scientific consensus currently holds that vaccines  do not cause autism.</p><p class=\"\">Democrats railed against Kennedy in opening statements delivered ahead of the committee vote Tuesday morning.</p><p class=\"\">\"The question in front of us this morning is pretty simple: Do Senators want their legacy to include disregarding basic health science and instead of elevating conspiracy theorists?,\" said Sen. Ron Wyden, the Oregon Democrat who is the ranking member on the finance committee.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008163:0/",
            "pub_date": "2025-02-05 02:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309153:0",
            "title": "Sector Update: Tech Stocks Gain Tuesday Afternoon",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tech stocks were higher Tuesday afternoon, with the Technology Select Sector SPDR Fund (XLK) climbing 1.3% and the SPDR S&amp;P Semiconductor ETF (XSD) rising 1.2%. </p><p class=\"\">The Philadelphia Semiconductor index climbed 1%. </p><p class=\"\">In corporate news, Palantir  shares jumped more than 22% after the company reported late Monday higher Q4 adjusted earnings and revenue. Goldman Sachs adjusted Palantir's price target to $80 from $41. </p><p class=\"\">China's State Administration for Market Regulation opened an antitrust probe into Alphabet's  Google over suspected violations of the country's anti-monopoly law, according to media reports. Alphabet shares were rising 2.1%. </p><p class=\"\">NXP Semiconductors  issued a downbeat Q1 outlook at the midpoint after reporting better-than-expected results in the prior three-month period. Its shares were down 1.6% recently.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309153:0-sector-update-tech-stocks-gain-tuesday-afternoon/",
            "pub_date": "2025-02-05 02:48:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009490:0",
            "title": "Saia Is Maintained at Hold by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:49 GMT) </strong>Saia Price Target Raised to $478.00/Share From $456.00 by TD Cowen</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009490:0/",
            "pub_date": "2025-02-05 02:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009487:0",
            "title": "Comex Silver Settles 1.53% Higher at $32.888 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Comex Silver for February delivery gained 49.60 cents per troy ounce, or 1.53% to $32.888 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Up 76.00 cents or 2.37% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage gain since Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up five of the past six sessions</li><li class=\"listItem-bmN0_SHH\">Highest settlement value since Wednesday, Oct. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Off 5.58% from its 52-week high of $34.831 hit Tuesday, Oct. 22, 2024</li><li class=\"listItem-bmN0_SHH\">Up 48.84% from its 52-week low of $22.096 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 46.87% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Up 11.03% from its 2025 settlement low of $29.622 hit Thursday, Jan. 2, 2025</li><li class=\"listItem-bmN0_SHH\">Off 32.47% from its record high of $48.70 hit Thursday, Jan. 17, 1980</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up $3.948 or 13.64%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009487:0/",
            "pub_date": "2025-02-05 02:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009486:0",
            "title": "Comex Gold Settles 0.68% Higher at $2853.30 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Comex Gold for February delivery gained $19.40 per troy ounce, or 0.68% to $2853.30 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A new record high</li><li class=\"listItem-bmN0_SHH\">Up for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Up $40.80 or 1.45% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage gain since Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up five of the past six sessions</li><li class=\"listItem-bmN0_SHH\">Up 43.36% from its 52-week low of $1990.30 hit Wednesday, Feb. 14, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 40.25% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Up 8.15% from its 2025 settlement low of $2638.40 hit Monday, Jan. 6, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up $224.10 or 8.52%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009486:0/",
            "pub_date": "2025-02-05 02:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009488:0",
            "title": "Comex Copper Settles 1.13% Higher at $4.3425 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Comex Copper for February delivery gained 4.85 cents per pound, or 1.13% to $4.3425 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one day dollar and percentage gain since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Up 8.05 cents or 1.89% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage gain since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up five of the past six sessions</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Highest settlement value since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Off 15.17% from its 52-week high of $5.119 hit Tuesday, May 21, 2024</li><li class=\"listItem-bmN0_SHH\">Up 17.81% from its 52-week low of $3.686 hit Friday, Feb. 9, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 14.81% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.54% from its 2025 settlement high of $4.4105 hit Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.88% from its 2025 settlement low of $3.9885 hit Thursday, Jan. 2, 2025</li><li class=\"listItem-bmN0_SHH\">Off 15.17% from its record high of $5.119 hit Tuesday, May 21, 2024</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 35.65 cents or 8.94%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009488:0/",
            "pub_date": "2025-02-05 02:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_WkrbFk9WY:0",
            "title": "Fondia Plc: Notification of Holdings According to Chapter 9, Section 10 of the Finnish Securities Market Act (Johan Hammarén)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Fondia<p class=\"\">Fondia Plc</p><p class=\"\">Company release</p><p class=\"\">2025-02-04 at 8.50 p.m. EET</p><p class=\"\">Fondia Plc has received on 4 February 2025 a notification pursuant to Chapter 9, Section 5 of the Finnish Securities Markets Act, that there has been a merger in the chain of ownership of the shares controlled by Johan Hammarén. Hypericus AB, the former owner of Fondia Plc's shares, has merged into Oy Johan Hammarén &amp; Co Ab. As a result of the merger, Hypericus AB has been dissolved and its assets and liabilities, including its shares in Fondia Plc, have been transferred to Oy Johan Hammarén &amp; Co Ab. Therefore, Hypericus AB's holding in Fondia Plc's shares has fallen to zero (0%) and Oy Johan Hammarén &amp; Co Ab's holding in Fondia Plc has exceeded the 15% threshold.</p><p class=\"\">Total positions of person subject to the notification obligations</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td>Resulting situation on the date on which threshold was reached</td></tr><tr><td>% of shares and voting rights</td><td>17.07%</td></tr><tr><td>% of shares and voting rights through financial instruments</td><td>-</td></tr><tr><td>Total of both in %</td><td>17.07%</td></tr><tr><td>Total number of shares and voting rights of issuer</td><td>3,953,134(amendment by issuer)</td></tr></tbody></table></div><p class=\"\">Notified details of the resulting situation on the date on which the threshold was reached:</p><p class=\"\">A: Shares and voting rights</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td rowspan=\"2\">Class/type of sharesISIN code</td><td colspan=\"2\">Number of shares and voting rights</td><td colspan=\"2\">% of shares and voting rights</td></tr><tr><td>Direct(SMA 9:5)</td><td>Indirect(SMA 9:6 ja 9:7)</td><td>Direct(SMA 9:5)</td><td>Indirect(SMA 9:6 ja 9:7)</td></tr><tr><td>FI4000232913</td><td>-</td><td>674,764</td><td>-</td><td>17.07%</td></tr></tbody></table></div><p class=\"\">Information in relation to the person subject to the notification obligation</p><p class=\"\">Full chain of controlled undertakings through which the voting rights and/or the financial instruments are effectively held starting with the ultimate controlling natural person or legal entity:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Name</td><td>% of shares and voting rights</td><td>% of shares and voting rights through financial instruments</td><td>Total of both</td></tr><tr><td>Johan Hammarén</td><td>0.00%</td><td>-</td><td>-</td></tr><tr><td>Oy Johan Hammarén &amp; Co Ab</td><td>16.60%</td><td>-</td><td>656,250</td></tr><tr><td>(Hypericus AB, merged company)</td><td>0.00%</td><td>-</td><td>-</td></tr><tr><td>Johan Hammarén</td><td>0.00%</td><td>-</td><td>-</td></tr><tr><td>Oy Hammarén &amp; Co Ab</td><td>0.47%</td><td>-</td><td>18,514</td></tr></tbody></table></div><p class=\"\">Further information:</p><p class=\"\">The person subject to the notification obligation holds the shares through his controlling companies listed in the table above.</p><p class=\"\">The merger between the transferring company, Hypericus AB, and the acquiring company, Oy Johan Hammarén &amp; Co Ab, in the chain of control of the person subject to the notification. The merger has been registered in the Trade Register on 31 January 2025 and the shares held by the merging company have been transferred to the acquiring company.</p><p class=\"\">The total shareholding of the person subject to the notification obligation in Fondia Plc’s has remained unchanged since the previous notification.</p><p class=\"\">Fondia Plc</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact details:</strong></p><p class=\"\">Timo Lappi, Interim CEO; Chair of the Board of Directors, tel. +358 40 756 7809 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fondia in brief</strong></p><p class=\"\">Fondia solves the legal needs of companies by combining the best services from internal legal departments and law firms. Fondia operates in Finland, Sweden, Estonia, and Lithuania, and the Group’s net sales in 2023 were EUR 26.1 million. Fondia employs over 190 people. </p><p class=\"\">Aktia Alexander Corporate Finance Ltd acts as Fondia Plc’s Certified Adviser.</p><p class=\"\">www.fondia.com  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Distribution: </strong></p><p class=\"\">Nasdaq Helsinki Ltd </p><p class=\"\">Key media </p><p class=\"\">https://news.cision.com/fondia/r/fondia-plc--notification-of-holdings-according-to-chapter-9--section-10-of-the-finnish-securities-ma%2Cc4100623</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_WkrbFk9WY:0-fondia-plc-notification-of-holdings-according-to-chapter-9-section-10-of-the-finnish-securities-market-act-johan-hammar-n/",
            "pub_date": "2025-02-05 02:50:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309154:0",
            "title": "Sector Update: Health Care Stocks Decline Tuesday Afternoon",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Health care stocks were softer Tuesday afternoon, with the NYSE Health Care Index and the Health Care Select Sector SPDR Fund (XLV) both down 0.4%. </p><p class=\"\">The iShares Biotechnology ETF (IBB) rose 0.5%. </p><p class=\"\">In corporate news, Merck  issued a downbeat full-year outlook, overshadowing stronger-than-expected Q4 results. The shares fell past 10%. </p><p class=\"\">Pfizer's  Q4 results topped market expectations amid double-digit revenue growth across key segments, while the pharmaceutical giant reiterated its full-year outlook. Its shares were down 1.7%. </p><p class=\"\">Novartis  is on the hunt for next-generation obesity drug candidates, despite its main focus remaining on therapeutic areas where it has an established presence, The Wall Street Journal reported Tuesday, citing an interview with Chief Executive Vasant Narasimhan. Novartis shares were fractionally lower.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309154:0-sector-update-health-care-stocks-decline-tuesday-afternoon/",
            "pub_date": "2025-02-05 02:50:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309149:0",
            "title": "Sector Update: Consumer Stocks Mixed in Afternoon Trading",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Consumer stocks were mixed Tuesday afternoon with the Consumer Staples Select Sector SPDR Fund (XLP) down 0.9% and the Consumer Discretionary Select Sector SPDR Fund (XLY) up 0.8%. </p><p class=\"\">Redbook US same-store sales last week rose 5.7% from a year earlier after a 4.9% increase in the previous week. </p><p class=\"\">In corporate news, PepsiCo's  Q4 earnings topped Wall Street's estimates, while revenue posted a surprise decline amid weakness in the beverage and snacks company's North American businesses. The stock dropped 4.7%. </p><p class=\"\">Estee Lauder  shares fell 15% after the company reported lower fiscal Q2 results. The company expects to eliminate 5,800 to 7,000 job roles as part of a restructuring plan. </p><p class=\"\">PVH  was added to the Chinese Ministry of Commerce's unreliable entity list, the ministry said Tuesday. PVH shares fell 0.9%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309149:0-sector-update-consumer-stocks-mixed-in-afternoon-trading/",
            "pub_date": "2025-02-05 02:41:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309145:0",
            "title": "Sector Update: Energy Stocks Rise in Tuesday Afternoon Trading",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy stocks were higher Tuesday afternoon, with the NYSE Energy Sector Index adding 2.1% and the Energy Select Sector SPDR Fund (XLE) up 1.9%. </p><p class=\"\">The Philadelphia Oil Service Sector index climbed 2.5%, while the Dow Jones US Utilities index was down 0.7%. </p><p class=\"\">In sector news, China plans to impose 15% tariffs on US coal and liquefied natural gas imports and a 10% tariff on crude oil, agricultural machinery, large-displacement cars, and pickup trucks. The move follows the Trump administration's announcement of a 10% additional tariff on imports from China late Friday. </p><p class=\"\">Front-month West Texas Intermediate crude oil was declining 0.6% to $72.75 a barrel while the global benchmark Brent crude contract was up 0.3% at $76.17 a barrel. Henry Hub natural gas futures fell 1.3% lower to $3.31 per 1 million BTU. </p><p class=\"\">In corporate news, BP  is poised to spend up to $25 billion over the lifetime of a project to redevelop four oil and gas fields in Kirkuk, Iraq, Reuters reported Tuesday. Separately, BP is delaying plans to convert its former Kwinana oil refinery in Australia to produce renewable fuels, Bloomberg reported Tuesday. BP shares rose 2.1%. </p><p class=\"\">Shell  said Tuesday it has resumed production at the Penguins field in the UK North Sea with a floating production, storage, and offloading facility. Its shares added 1.8%. </p><p class=\"\">SolarBank  shares jumped nearly 11%. The company said Tuesday that construction of its first battery energy storage system project in Ontario is expected to begin next week.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309145:0-sector-update-energy-stocks-rise-in-tuesday-afternoon-trading/",
            "pub_date": "2025-02-05 02:41:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009425:0",
            "title": "Canada, Mexico Tariffs Would Raise Tractor Prices — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Bob Tita</p><p class=\"\">Though China announced tariffs on U.S.-made farm equipment, manufacturers Deere, CNH Industrial and Agco face a bigger threat from a North American trade war. The companies' sales, supply chains and manufacturing sites are enmeshed across the U.S., Canada and Mexico.</p><p class=\"\">CNH, whose brands include Case IH and New Holland, said Tuesday about $400 million of its imports would be subject to the 25% tariffs on Canada and Mexico. \"Whatever will hit us on the cost side will be priced to our customers,\" CNH Chief Executive Gerrit Marx said during a call with analysts. He said the company is assessing options for relocating some production to reduce its tariff exposure. Relocations could take as long as 18 months to complete and would not be undertaken if the tariffs are likely to be short term, Marx said.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009425:0/",
            "pub_date": "2025-02-05 02:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009429:0",
            "title": "Napco Security Techs Cut to Hold From Buy by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:43 GMT) </strong>Napco Security Techs Price Target Cut to $27.00/Share From $46.00 by TD Cowen</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009429:0/",
            "pub_date": "2025-02-05 02:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309151:0",
            "title": "Sector Update: Financial Stocks Mixed Tuesday Afternoon",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Financial stocks were mixed in Tuesday afternoon trading, with the NYSE Financial Index up 0.2% and the Financial Select Sector SPDR Fund (XLF) easing 0.1%. </p><p class=\"\">The Philadelphia Housing Index was adding 0.9%, and the Real Estate Select Sector SPDR Fund (XLRE) was 0.1% lower. </p><p class=\"\">Bitcoin (BTC/USD) was declining 0.4% to $99,135, and the yield of 10-year US Treasuries was falling 2 basis points to 4.52%. </p><p class=\"\">In economic news, China imposed retaliatory measures on Tuesday after President Donald Trump announced a 10% tariff on Chinese goods over the weekend. </p><p class=\"\">US job openings fell to 7.6 million in December, according to the Bureau of Labor Statistics, lower than the 8 million openings expected in a Bloomberg survey. </p><p class=\"\">In corporate news, PayPal  issued a strong bottom-line outlook as Q4 earnings unexpectedly rose, though its Q1 revenue guidance implied a sequential deceleration. Its shares fell nearly 12%. </p><p class=\"\">PJT Partners  shares jumped past 10% after it reported Q4 results that topped analysts' estimates. </p><p class=\"\">KKR  said Tuesday it has raised its offer for Fuji Soft to 9,850 Japanese yen ($63.45) per share, from 9,451 yen previously. KKR shares fell 8%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309151:0-sector-update-financial-stocks-mixed-tuesday-afternoon/",
            "pub_date": "2025-02-05 02:43:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009439:0",
            "title": "Caesars Entertainment Is Maintained at Buy by TD Cowen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:45 GMT) </strong>Caesars Entertainment Price Target Cut to $48.00/Share From $50.00 by TD Cowen</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009439:0/",
            "pub_date": "2025-02-05 02:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr2PWVG8:0",
            "title": "Fondia Plc: Notification of Holdings According to Chapter 9, Section 10 of the Finnish Securities Market Act (Timo Lappi)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Fondia<p class=\"\">Fondia Plc</p><p class=\"\">Company release</p><p class=\"\">2025-02-04 at 8.45 p.m. EET</p><p class=\"\">Fondia Plc has received on 4 February 2025 a notification pursuant to Chapter 9, Section 5 of the Finnish Securities Markets Act, that there has been a merger in the chain of ownership of the shares controlled by Timo Lappi. Placereri AB, the former owner of Fondia Plc's shares, has merged into Sijoittamo Oy. As a result of the merger, Placereri AB has been dissolved and its assets and liabilities, including its shares in Fondia Plc, have been transferred to Sijoittamo Oy. Therefore, Placereri AB's holding in Fondia Plc's shares has fallen to zero (0%) and Sijoittamo Oy 's holding in Fondia Plc has exceeded the 15 % threshold.</p><p class=\"\">Total positions of person subject to the notification obligations</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td>Resulting situation on the date on which threshold was reached</td></tr><tr><td>% of shares and voting rights</td><td><p class=\"\">16.60%</p></td></tr><tr><td>% of shares and voting rights through financial instruments</td><td><p class=\"\">-</p></td></tr><tr><td>Total of both in %</td><td><p class=\"\">16.60%</p></td></tr><tr><td>Total number of shares and voting rights of issuer</td><td><p class=\"\">3,953,134</p><p class=\"\">(amendment by issuer)</p></td></tr></tbody></table></div><p class=\"\">Notified details of the resulting situation on the date on which the threshold was reached:</p><p class=\"\">A: Shares and voting rights</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td rowspan=\"2\">Class/type of sharesISIN code</td><td colspan=\"2\">Number of shares and voting rights</td><td colspan=\"2\">% of shares and voting rights</td></tr><tr><td>Direct(SMA 9:5)</td><td>Indirect(SMA 9:6 ja 9:7)</td><td>Direct(SMA 9:5)</td><td>Indirect(SMA 9:6 ja 9:7)</td></tr><tr><td>FI4000232913</td><td>-</td><td>656, 250</td><td>-</td><td>16,60%</td></tr></tbody></table></div><p class=\"\">Information in relation to the person subject to the notification obligation</p><p class=\"\">Full chain of controlled undertakings through which the voting rights and/or the financial instruments are effectively held starting with the ultimate controlling natural person or legal entity:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Name</td><td>% of shares and voting rights</td><td>% of shares and voting rights through financial instruments</td><td>Total of both</td></tr><tr><td>Timo Lappi</td><td>0.00%</td><td>-</td><td>-</td></tr><tr><td>Sijoittamo Oy</td><td>16.60%</td><td>-</td><td>656,250</td></tr><tr><td>(Placereri AB, merged company)</td><td>0.00%</td><td>-</td><td>-</td></tr></tbody></table></div><p class=\"\">Further information:</p><p class=\"\">The person subject to the notification obligation holds the shares through his controlling companies listed in the table above.</p><p class=\"\">The merger between the transferring company, Placereri AB, and the acquiring company, Sijoittamo Oy, in the chain of control of the person subject to the notification. The merger has been registered in the Trade Register on 31 January 2025 and the shares held by the merging company have been transferred to the acquiring company.</p><p class=\"\">The total shareholding of the person subject to the notification obligation in Fondia Plc’s has remained unchanged since the previous notification.</p><p class=\"\">Fondia Plc</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact details:</strong></p><p class=\"\">Timo Lappi, Interim CEO; Chair of the Board of Directors, tel. +358 40 756 7809 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fondia in brief</strong></p><p class=\"\">Fondia solves the legal needs of companies by combining the best services from internal legal departments and law firms. Fondia operates in Finland, Sweden, Estonia, and Lithuania, and the Group’s net sales in 2023 were EUR 26.1 million. Fondia employs over 190 people. </p><p class=\"\">Aktia Alexander Corporate Finance Ltd acts as Fondia Plc’s Certified Adviser.</p><p class=\"\">www.fondia.com  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Distribution: </strong></p><p class=\"\">Nasdaq Helsinki Ltd </p><p class=\"\">Key media </p><p class=\"\">https://news.cision.com/fondia/r/fondia-plc--notification-of-holdings-according-to-chapter-9--section-10-of-the-finnish-securities-ma%2Cc4100240</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr2PWVG8:0-fondia-plc-notification-of-holdings-according-to-chapter-9-section-10-of-the-finnish-securities-market-act-timo-lappi/",
            "pub_date": "2025-02-05 02:45:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}