{
    "data": [
        {
            "id": "DJN_DN20250205002422:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0837 GMT - The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p><p class=\"\">0830 GMT - Yields on U.K. government bonds, or gilts, fall ahead of an anticipated interest-rate cut by the Bank of England this week. Markets price in a 98% probability of a 25 basis-point cut to 4.5% on Thursday, LSEG Refinitiv data show. \"I suspect this Thursday's BOE will be sufficiently dovish to strongly raise odds of another cut already at the March meeting,\" Saxo's John Hardy says in a note. The 10-year gilt yield falls 3 basis points to 4.488%, Tradeweb data show. (miriam.mukuru@wsj.com)</p><p class=\"\">0822 GMT - The euro's gains will likely prove limited as it remains broadly unattractive given weak macroeconomic fundamentals and President Trump's threats to impose tariffs on the EU, ING analyst Francesco Pesole says. Wide eurozone-U.S. interest rate differentials in favor of the dollar reflect these factors, he says in a note. Trade news will dominate euro price action, although it will be interesting to hear whether the unexpected acceleration in January eurozone inflation triggers some change in the narrative from European Central Bank members. The ECB's chief economist, Philip Lane, is due to speak at 1400 GMT in Washington, DC. The euro rises 0.2% to $1.0402. (renae.dyer@wsj.com)</p><p class=\"\">0811 GMT - Singapore's retail sales could strengthen this year after a soft performance in 2024, buoyed by new attractions and other tailwinds, UOB associate economist Jester Koh writes in a note. Retail sales fell again in December due to weak tourist arrival numbers. For the full year, retail sales growth fell to 1.2% from 2.3% in 2023, with eight of 14 retail sales categories declining, he notes. Looking ahead, he expects new attractions, including Singapore's fifth zoological park, to lend support to sales. The upcoming budget 2025 is likely to be expansionary and further support measures could also lift sales, he adds. (amanda.lee@wsj.com)</p><p class=\"\">0803 GMT - The 10-year French-Spanish government bond yield spread is gradually nearing the 5 basis point threshold, signalling improving sentiment over France, Natixis analysts say in a note. The spread hasn't reached this level since last November, they say, describing it \"a sign that investor perception of France is less pessimistic than before.\" The 10-year French-Spanish yield differential is 5.6 basis points, according to LSEG data. French Prime Minister Francois Bayrou used special executive powers on Monday to push the 2025 budget through parliament without a vote, while facing a no-confidence motion on Wednesday. (emese.bartha@wsj.com)</p><p class=\"\">0802 GMT - The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p><p class=\"\">0756 GMT - There are some green shoots in China's consumption spending, but caution persists, HSBC Global Research analysts write in a note. Preliminary data show the country's box office sales exceeded 9 billion yuan during the Lunar New Year holiday, while domestic travel reached a new record of over 2.33 billion cross-regional trips within China, they say. These are positive signs for consumer sentiment, but HSBC remains cautious over whether the holiday spirit can translate into more sustainable momentum without further stimulus. Another fiscal policy push is still needed to drive a sustained increase in activities in the coming months, especially given geopolitical uncertainty, HSBC adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0754 GMT - Citi expects Malaysia's minimum wage hike to boost consumer spending, with median wages projected to grow by a high single digit in 2025, analyst Huan Wen Gan writes in a note. The minimum wage was raised to MYR1,700/month from MYR1,500/month on Feb. 1. Retail trade, particularly at convenience stores and mini-markets, is likely see further support, he adds. The agriculture sector has lower median wages, but oil palm harvesters already earn above the new threshold, minimizing the impact on palm oil players, he reckons. Mr. D.I.Y. Group (M) may face higher labor costs, with an 8% wage hike factored into 2025 earnings estimates, he says. For every 1% increase in wages could result in a 0.8% cut in its 2025 net profit forecast, he adds. Given stronger consumption trends and stable earnings potential, Citi remains positive on Malaysia's consumer sector. (yingxian.wong@wsj.com)</p><p class=\"\">0732 GMT - German Bunds are running into resistance ahead of the yield lows of the year, but shaky risk sentiment and a sanguine European Central Bank wage tracker should keep the momentum going, says Commerzbank Research's Michael Leister. \"With the ongoing focus on trade wars and fragile risk sentiment we expect Bunds to stay bid,\" the head of interest rates strategy says in a note. That said, the air is getting thinner for Bunds as yields are approaching the lows recorded in the initial sessions of the year, Leister says. In addition, risk-off once again turns out to not be self-reinforcing, with equities stuck at the highs, he says. The 10-year German Bund yield falls 2.5 basis points to 2.374%, tracking U.S. Treasury yields lower, according to Tradeweb. (emese.bartha@wsj.com)</p><p class=\"\">0730 GMT - Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0717 GMT - The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002422:0/",
            "pub_date": "2025-02-05 16:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002420:0",
            "title": "Canadian Dollar Continues to Recover From Tariff Hit — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002420:0/",
            "pub_date": "2025-02-05 16:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463876:0",
            "title": "Getlink's ElecLink Interconnector Set to Come Back Online After Final Assessments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Getlink  said the ElecLink electricity interconnector between France and the UK is set to be gradually brought back into service from Wednesday, according to a same-day release. </p><p class=\"\">The tunnel and railway operator is carrying out final assessments and testing, which is scheduled to be completed on Feb. 10. The company estimates a 25 million-euro impact from the suspension of activity for the first weeks of 2025. </p><p class=\"\">The interconnector's operations have been suspended since Sept. 25, 2024, after a fault was detected.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463876:0/",
            "pub_date": "2025-02-05 16:37:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463879:0",
            "title": "Nama Chemicals Unit Terminates Wastewater Treatment Contracts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nama Chemicals (SASE:2210) subsidiary Jubail Chemical Industries, or Jana, terminated two wastewater treatment deals with Green Dimension Co. for Environmental Services and Confident Engineering International. </p><p class=\"\">The Saudi chemical manufacturer said Wednesday that the alliance breached its contracts for Jana's chloride and epoxy resins plants and failed to remedy the breaches despite a grace period. </p><p class=\"\">The company said it reserves all its legal and financial rights to pursue compensation and damages.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463879:0/",
            "pub_date": "2025-02-05 16:37:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002431:0",
            "title": "Novo Nordisk Earnings, Guidance Imply Consensus Upgrades — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Novo Nordisk's initial 2025 outlook is just ahead of Jefferies's expectations. But given a higher starting point and stronger currency effects it suggests up to 6% sales and 10% EBIT consensus upgrades, analysts at the bank write. Novo Nordisk's fourth-quarter sales beat expectations by 5%, mostly on positive U.S. gross-to-net adjustments--the discount offered between the list price and the actual net sales price--for its insulins. Sales of Wegovy were shy of expectations while Ozempic and Rybelsus were in line. A better gross margin, higher research and development costs but less selling and distribution spend helped EBIT beat by 9% and EPS by 6%. The stock will likely tick higher initially but could then fade, Jefferies says. Shares trade 4.2% higher at 617.20 Danish kroner. (dominic.chopping@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002431:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002429:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0837 GMT - GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p><p class=\"\">0834 GMT - The cancellation of the \"de minimis\" rule, which allowed low-value shipments to bypass duties and custom scrutiny, as well as the subsequent suspension of Chinese goods shipments by the U.S. Postal Services, should be manageable for PDD Holdings' Temu, says Nomura analyst Jialong Shi tells Dow Jones Newswires. Temu has been preparing for this change in the past year, Shi notes, pointing to the company introducing a half consignment model in early 2024. Under this model, merchants typically ship products to the U.S. in bulk rather than relying on the so-called \"de minimis\" exemption, which was recently revoked by President Trump, Shi notes. While Temu still has significant growth potential in the U.S. market at this stage, uncertainties remain over whether the U.S. government will introduce new regulations to these Chinese companies, he says. (tracy.qu@wsj.com)</p><p class=\"\">0830 GMT - Novo Nordisk's sales guidance is materially ahead of expectations, Intron Health's Naresh Chouhan writes. The company expects sales to grow 16%-24% this year with EBIT growing 19%-27%. Fourth-quarter EBIT beat expectations by 9% as the gross margin beat by 140 basis points and the EBIT margin beat by 170 basis points. \"Given recent concerns on growth, we expect the shares to be up strongly this morning given the sales guidance is materially higher than consensus was expecting and Wegovy was in-line,\" Chouhan says. Shares trade 4.3% higher at 617.90 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0826 GMT - Carabao Group faces earnings hit from higher competition in Thailand's energy drink market, Maybank Securities (Thailand)'s Tanida Jirapornkasemsuk says in a research report. Carabao Group's rival Osotspa plans to launch a new 'M-150 Yellow' energy drink by mid-February, the analyst notes. Osotspa's new energy drink features the drink's original flavor, which was among Thailand's most popular energy drinks, the analyst says. Carabao could lose a 0.5-percentage-point share of the energy drink market in 2025, the analyst estimates. The brokerage cuts its 2025-2026 earnings forecasts for Carabao by 5.8%-6.5%. It lowers the stock's rating to hold from buy and the target price to THB71.75 from THB95.00. Shares are 1.7% lower at THB72.75. (ronnie.harui@wsj.com)</p><p class=\"\">0812 GMT - DCC's third-quarter results were driven by growth in its key energy division, RBC Capital Markets analyst Andrew Brooke says in a note. The FTSE 100 company said its energy segment's performance remains robust despite warm weather, the analyst adds, noting that the healthcare unit's profit was flat while profit declined in technology. RBC expects a positive topline performance in the short term, along with the disposal of healthcare forecast in the next six months and further delivery of its energy strategy--including acquisitions--, Brooke says. \"Whilst energy standalone is tough to value, the division is cleaner, has positive mix drivers, is higher return and has more favorable working capital dynamics,\" he adds. Shares are down 2.2% at 53.75 pounds. (michael.susin@wsj.com)</p><p class=\"\">0812 GMT - Great Wall Motor's February sales volume will likely stay flat on month, but may recover somewhat in March, Citi analysts write in a note, citing company management. The automaker's January exports dropped on month due to the New Year holiday outside China, and it expects overseas sales growth in February and March due to postholiday promotional events. Meanwhile, the carmaker's new Tank 500 model, released this year, has secured 2,000 new orders since Jan. 2, Citi notes. Great Wall Motor will be a beneficiary of growth in the EV sector and EVs' higher market share in China, the bank says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0802 GMT - The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p><p class=\"\">0754 GMT - Citi expects Malaysia's minimum wage hike to boost consumer spending, with median wages projected to grow by a high single digit in 2025, analyst Huan Wen Gan writes in a note. The minimum wage was raised to MYR1,700/month from MYR1,500/month on Feb. 1. Retail trade, particularly at convenience stores and mini-markets, is likely see further support, he adds. The agriculture sector has lower median wages, but oil palm harvesters already earn above the new threshold, minimizing the impact on palm oil players, he reckons. Mr. D.I.Y. Group (M) may face higher labor costs, with an 8% wage hike factored into 2025 earnings estimates, he says. For every 1% increase in wages could result in a 0.8% cut in its 2025 net profit forecast, he adds. Given stronger consumption trends and stable earnings potential, Citi remains positive on Malaysia's consumer sector. (yingxian.wong@wsj.com)</p><p class=\"\">0753 GMT - Chinese shares ended mixed on their first trading day after the Lunar New Year break, as investors digest the latest trade developments between China and the U.S. The Shanghai Composite Index fell 0.65% to 3229.49, the Shenzhen Composite Index rose 0.4% and the ChiNext Price Index was flat. PMI data signaling softer services sector growth was also in focus. Still, the view that the U.S.'s initial 10% tariff is milder than expected, and that China's response also seems moderate, likely limited some losses. Tech led the gains, with Beijing Kingsoft Office Software 18% higher. Hygon Information Technology added 8.8% and iFlytek gained 7.4%. Decliners included Yonghui Superstores, which jumped 4.8%, and Midea, which was 2.3% higher. (tracy.qu@wsj.com)</p><p class=\"\">0752 GMT - China's artificial-intelligence sector will likely shift from developing foundational models to creating AI applications, Bernstein analysts write in a note. The country's AI ecosystem will likely become much more open-sourced and foundational model costs may come down, thanks to the development of DeepSeek, they add. Industry focus will now turn to application development, they say. Progress in using less advanced chips to create more advanced AI capabilities will make AI development more competitive, opening the gates to a cottage industry of models that can replicate fast and at a lower cost, they add. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0748 GMT - Santander posted a strong set of fourth-quarter results alongside guidance for 2025 and plans for capital returns to shareholders that are better than expected, Barclays's Cecilia Romero Reyes and Paola Sabbione say in a research note. The Spanish bank reported quarterly net profit and revenue that exceeded consensus forecasts, with results in Spain, Mexico, Brazil and the U.S. that were better than anticipated, Barclays says. The group's 2025 target for return on tangible equity--a profitability measure--of more than 17% is at the high end of previous guidance. Moreover, its intention to return 10 billion euros through buybacks is ahead of consensus expectations of 6 billion euros, according to Barclays. (adria.calatayud@wsj.com)</p><p class=\"\">0740 GMT - Investors could be concerned about Nissan's future as its board is planning to reject Honda's merger terms, Morningstar analyst Vincent Sun says. Nissan would face pressure surviving amid stiff competition in the U.S. and China, especially as it has a larger risk exposure to U.S. tariffs on Mexico than Honda and Toyota, the analyst says. However, even if the merger goes through, that wouldn't solve the challenges the two companies face. Both carmakers lack compelling EV offerings, and the combined entity would need to build a new EV model pipeline, he says. The two could benefit from larger scale and cost synergy, but that would take time to realize, Sun says. In any case, Nissan would find it difficult to \"play a smaller role in the new entity rather than standing on an equal footing with Honda,\" he adds. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002429:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002426:0",
            "title": "GSK Needs to Show It Can Navigate Vaccines Challenge — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002426:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002430:0",
            "title": "French Industry Ends Year in the Doldrums — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joshua Kirby</p><p class=\"\">French factory production unexpectedly dropped at the end of the year, contributing to a backsliding in the eurozone's second-largest economy, with few signs of a rapid rebound at the start of 2025.</p><p class=\"\">Total output of goods was 0.7% lower on month in December, reversing a slight increase in November, statistics agency Insee said Wednesday. That was a worse result than the stagnation forecast by economists, according to a poll compiled by The Wall Street Journal, and means output decreased in seven out of 12 months last year.</p><p class=\"\">The transportation sector saw a steep drop in December, with an 11% fall in automobile production, a fresh blow to Europe's beleaguered automakers. Other key areas including pharmaceuticals also booked heavy reductions in output over the month.</p><p class=\"\">The latest activity surveys meanwhile suggest French manufacturers remained in a deep slump in January as they brace for the impact of President Trump's promised tariffs on European goods imported into the U.S. The European Central Bank last week cut interest rates again in an effort to ease some of the burden on economic activity in the eurozone. ECB President Christine Lagarde has warned that a chillier trade backdrop could act as a brake on European growth.</p><p class=\"\">For France, there is hope that greater political stability might brighten the mood for industrial employers and investors as the year progresses. Prime Minister Francois Bayrou is expected to survive a confidence vote in the French legislature later Wednesday, having earlier this week forced through a budget after months of delays.</p><p class=\"\">But even a better-functioning government can't rescue France from its economic malaise, Commerzbank economist Vincent Stamer warned. Growth in the French economy last year was spurred by state spending  but the government must now tighten its belt drastically, he told clients in a note. That will further darken sentiment, Stamer said.</p><p class=\"\">\"Entrepreneurs and investors are not only assessing the current situation, but are also forming expectations for the future,\" he said. \"The outlook for the French economy is clearly very bleak.... for the coming years.\"</p><p class=\"\">Write to Joshua Kirby at joshua.kirby@wsj.com; @joshualeokirby</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002430:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463882:0",
            "title": "Sweden's Ericsson Names New Chief People Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ericsson (ERIC-B.ST, ERIC-A.ST) appointed Charlotte Levert as its new chief people officer, effective Feb 10. </p><p class=\"\">Levert will succeed MajBritt Arfert, who will leave the Swedish networking and telecommunications company at the end of May, according to a Wednesday release. </p><p class=\"\">Levert is currently the vice president and head of people business area cloud and software services.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463882:0/",
            "pub_date": "2025-02-05 16:39:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463875:0",
            "title": "China Greenlights HBM's Investigational New Drug for COPD",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HBM Holdings  said China's National Medical Products Administration (NMPA), through its Centre for Drug Evaluation, has granted clearance for its Investigational New Drug application for the treatment of chronic obstructive pulmonary disease (COPD). </p><p class=\"\">The drug inhibits the TSLP-mediated signaling pathway by blocking the interaction between TSLP and TSLP receptor, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463875:0/",
            "pub_date": "2025-02-05 16:39:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446703:0",
            "title": "Zambia Private Sector Growth Strengthens",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Stanbic Bank Zambia PMI rose to 50.9 in January 2025, slightly up from 50.8 in December, signaling a modest improvement in private sector conditions and the strongest expansion since July 2023.</p><p class=\"\">The increase in new orders drove the improvement, with firms citing sustained client demand as the key factor.</p><p class=\"\">However, output levels continued to decline at a marginal pace, marking a softer contraction than much of 2024.</p><p class=\"\">Meanwhile, employment saw its sharpest rise in seven years, as firms expanded hiring to meet demand, the fastest rate since January 2018.</p><p class=\"\">Regarding prices, cost pressures softened, with inflation in purchase and staff costs easing, though selling prices rose slightly as businesses passed costs to customers.</p><p class=\"\">Despite challenges, business confidence improved, with firms optimistic that rising demand, diversification, and increased marketing will drive stronger growth in 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446703:0-zambia-private-sector-growth-strengthens/",
            "pub_date": "2025-02-05 16:40:33",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW0E7:0",
            "title": "India's Tega Industries surges on higher Q3 profit, revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of India's Tega Industries  surge nearly 14% to two-month high of 1,736.5 rupees</p><p class=\"\">** Co, which makes consumable products for mining sector, posts 52% y/y rise in Q3 consolidated profit; revenue up 20%</p><p class=\"\">** Its Q3 total expenses gain 14.6%, slower than revenue growth of 20%, aiding profit rise</p><p class=\"\">** Stock up 10.9% so far in 2025; rose 36% last year </p><p class=\"\">** Analysts' average rating on stock is \"buy\"; median PT 1,980.50 rupees - data compiled by LSEG</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW0E7:0-india-s-tega-industries-surges-on-higher-q3-profit-revenue/",
            "pub_date": "2025-02-05 16:40:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463874:0",
            "title": "Market Chatter: Beijing Join-Cheer Software Develops Intelligent Entities Based on Nuwa GPT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Beijing Join-Cheer Software Co  developed multiple fields and industry-specific intelligent entities based on Nuwa GPT, Securities Times reported Wednesday. </p><p class=\"\">Nuwa GPT is a Chinese large language model developed by DeepSeek. </p><p class=\"\">Shares of the management software provider closed nearly 5% higher Wednesday. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463874:0/",
            "pub_date": "2025-02-05 16:40:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0CP:0",
            "title": "Infineon Technologies Closes EUR 2.0 Bln Revolving Credit Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">INFINEON TECHNOLOGIES AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLOSES €2.0 BILLION REVOLVING CREDIT FACILITY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0CP:0-infineon-technologies-closes-eur-2-0-bln-revolving-credit-facility/",
            "pub_date": "2025-02-05 16:32:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463872:0",
            "title": "Vinati Organics Infuses Additional INR488 Million in Wholly Owned Unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vinati Organics  has invested an additional 488.1 million Indian rupees in its wholly owned subsidiary, Veeral Organics, according to a filing to the stock exchanges on Wednesday. </p><p class=\"\">The company has subscribed to an additional 48,810,200 fully paid-up equity shares of the face value of 10 rupees each through subscription towards the rights issue of Veeral Organics. </p><p class=\"\">Veeral Organics manufactures organics fine specialty chemicals. </p><p class=\"\">Shares of the company were down over 1% in recent trade</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463872:0/",
            "pub_date": "2025-02-05 16:32:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002398_20250205002398:0",
            "title": "Infineon Technologies Signs EUR2.0B Revolving Credit Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002398_20250205002398:0/",
            "pub_date": "2025-02-05 16:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463873:0",
            "title": "Tokai Tokyo Upgrades Fujicco to Neutral from Underperform; Price Target is 1,670 Yen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463873:0/",
            "pub_date": "2025-02-05 16:33:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463870:0",
            "title": "Force Motors Posts 20% Rise in Total Sales in January, Shares Jump 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Force Motors  recorded a 20% rise in its total sales to 3,597 units in January against 2,989 units a year ago, according to a Wednesday filing to the Indian stock exchanges. </p><p class=\"\">The units sold comprised small commercial vehicles, light commercial vehicles, and utility vehicles. </p><p class=\"\">Domestic sales in January were down up 39% year-on-year to 3,493 units, while exports were down 78% to 104 units, the filing stated. </p><p class=\"\">Shares of the company were up nearly 6% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463870:0/",
            "pub_date": "2025-02-05 16:33:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463878:0",
            "title": "Abu Dhabi Airports Logs Higher FY24 Passenger Numbers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Abu Dhabi Airports logged 29.4 million passengers in the Emirate's five airports in 2024, up from 22.9 million passengers in 2023. </p><p class=\"\">Aircraft movements also rose during the period to 249,747, compared with 226,362 a year ago, according to a Wednesday release. </p><p class=\"\">Meanwhile, cargo traffic saw a 21% year-over-year increase to 678,990 tonnes.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463878:0/",
            "pub_date": "2025-02-05 16:33:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0TW:0",
            "title": "Valneva jumps on UK approval of chikungunya vaccine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Valneva  rise 8% after the French biotech company received a marketing authorization in the UK for its chikungunya vaccine Ixchiq on adults</p><p class=\"\">** \"The marketing approval (MA) in the UK completes the range of MA in regions where the vaccine has the highest added value. This is therefore positive news from the point of view of the company's future revenues,\" Portzamparc analysts say</p><p class=\"\">** Valneva expects to receive marketing approval in Brazil in Q1 2025 and has submitted label extension applications to the U.S., Canadian and European health authorities for extending the use of Ixchiq to adolescents, the company says</p><p class=\"\">** Including Wednesday's rise, the stock has gained around 32% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0TW:0-valneva-jumps-on-uk-approval-of-chikungunya-vaccine/",
            "pub_date": "2025-02-05 16:33:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002400:0",
            "title": "Temu Expected to Navigate U.S. Shipping Rule Changes, But Risks Remain — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The cancellation of the \"de minimis\" rule, which allowed low-value shipments to bypass duties and custom scrutiny, as well as the subsequent suspension of Chinese goods shipments by the U.S. Postal Services, should be manageable for PDD Holdings' Temu, says Nomura analyst Jialong Shi tells Dow Jones Newswires. Temu has been preparing for this change in the past year, Shi notes, pointing to the company introducing a half consignment model in early 2024. Under this model, merchants typically ship products to the U.S. in bulk rather than relying on the so-called \"de minimis\" exemption, which was recently revoked by President Trump, Shi notes. While Temu still has significant growth potential in the U.S. market at this stage, uncertainties remain over whether the U.S. government will introduce new regulations to these Chinese companies, he says. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002400:0/",
            "pub_date": "2025-02-05 16:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002402:0",
            "title": "Embla Medical hf: Interim Report Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Embla Medical hf: Interim Report Q4 2024</p><p class=\"\">PR Newswire</p><p class=\"\">COPENHAGEN, Denmark, Feb. 5, 2025</p><p class=\"\">Announcement no. 1/2025</p><p class=\"\">5 February 2025</p><p class=\"\">Interim report Q4 2024</p><p class=\"\">COPENHAGEN, Denmark, Feb. 5, 2025 /PRNewswire/ --</p><p class=\"\">Sveinn Sölvason, President and CEO, comments:</p><p class=\"\">\"Sales in Q4 2024 amounted to USD 225 million, where our organic sales growth was 5% for the quarter and local currency growth was 8%. The continued strong momentum we have seen throughout the year in our Prosthetics &amp; Neuro Orthotics business continued to drive our growth, supported by good growth contribution across all our regions. Bracing &amp; Supports sales growth was modest for the quarter while sales in Patient Care declined, impacted by a strong comparison. For the full year 2024, our organic sales growth was 6%, driven by a strong performance in EMEA and our Prosthetics &amp; Neuro Orthotics and Patient Care segments.</p><p class=\"\">EBITDA margin (before special items) came in strong at 21% for Q4 and 20% for the full year. We continue to see the positive effects from the cost reduction initiatives implemented in manufacturing during Q1 2024 as well as positive contributions from product mix and cost control in SG&amp;A. In addition, we also saw strong cash flow generated for the quarter with USD 34 million or equivalent to 15% of sales.</p><p class=\"\">We are very pleased with the progress on our Growth'27 strategy and ability to execute on our ambitious targets and priorities such as the Fior &amp; Gentz acquisition we completed in January 2024, unifying our Patient Care business under the ForMotion brand and delivering exciting new innovation. These initiatives are all enabling us to reach even more people with our mobility solutions. Lastly, we have issued new guidance for 2025 of 5-8% organic sales growth and 20-21% EBITDA margin.\"</p><p class=\"\">Highlights Q4 2024</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Sales amounted to USD 225 million and organic growth was 5%, compared to   9% in Q4 2023. Local currency sales growth was 8% including acquisitions   and 7% reported growth in USD. For FY 2024, organic sales growth was 6%.   </li><li class=\"listItem-bmN0_SHH\">Prosthetics &amp; Neuro Orthotics sales grew by 12% organic, Bracing &amp;   Supports sales grew by 2% organic, while Patient Care sales declined by   1% organic in Q4 2024 due to a strong comparison in Q4 2023. For FY 2024,   Prosthetics &amp; Neuro Orthotics sales grew by 9% organic, Bracing &amp;   Supports sales grew by 1% organic and Patient Care sales grew by 5%   organic. Growth is attributed to solid volume growth and positive product   mix supported by strong performance in our high-end solutions.   </li><li class=\"listItem-bmN0_SHH\">Gross profit was USD 142 million and gross profit margin was 63%,   compared to 61% in Q4 2023. For FY 2024, the gross profit margin was 63%   compared to 62% in 2023. The gross profit margin was positively impacted   by cost reduction initiatives in manufacturing implemented during the   first quarter of 2024, as well as favorable product mix and manufacturing   efficiency.   </li><li class=\"listItem-bmN0_SHH\">EBITDA amounted to USD 47 million and EBITDA margin was 21% of sales,   compared to 18% in Q4 2023. In FY 2024, EBITDA margin before special   items increased to 20% compared to 18% for FY 2023. The EBITDA margin   expansion was driven by strong sales performance, cost savings and   efficiency in manufacturing, and effective cost control in SG&amp;A.   </li><li class=\"listItem-bmN0_SHH\">Net profit was USD 19 million and net profit margin was 8% of sales,   compared to 9% of sales in Q4 2023. While stronger operating profit   contributed positively to net profit in Q4 2024, financial expenses and   net exchange rate differences due to currency fluctuations impacted net   profit negatively. In FY 2024, net profit grew by 17% and the net profit   margin increased to 8% compared to 7% in FY 2023.   </li><li class=\"listItem-bmN0_SHH\">Free cash flow amounted to USD 34 million or 15% of sales, compared to   13% of sales in Q4 2023. In FY 2024, free cash flow amounted to 9% of   sales compared to 7% of sales in FY 2023, with the increase driven by   stronger operation profit.   </li><li class=\"listItem-bmN0_SHH\">NIBD/EBITDA before special items was 2.4x at the end of Q4 2024, within   our target range of 2-3x EBITDA in line with our capital structure and   capital allocation policy. Therefore, the share buyback program is to be   reinitiated shortly. </li></ul><p class=\"\">Other highlights</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">In December 2024 Embla Medical (Össur) was ranked #41 and   highlighted as one of the World's Best Companies in Sustainable Growth   2025 by TIME Magazine. The ranking, developed by TIME and Statista, a   leading data analytics platform, names 500 companies pairing growth with   environmental stewardship. The survey evaluated companies based on their   environmental disclosure and scored them according to their revenue   growth, financial stability, and environmental impact. </li></ul><p class=\"\">2025 outlook</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Organic sales growth guidance of 5-8%, driven by strong volume growth and   moderate price increases.   </li><li class=\"listItem-bmN0_SHH\">EBITDA margin guidance of 20-21% driven by scale and efficiency coupled   with continued focus on cost control in SG&amp;A. </li></ul><p class=\"\">Conference call details</p><p class=\"\">Embla Medical will host a conference call February 5, 2025, at 9:00 CET / 7:00 GMT / 3:00 EST.</p><p class=\"\">The event will be hosted by Sveinn Solvason, President and CEO, and G. Arna Sveinsdottir, CFO. The call will include a review of the quarterly and full year results and will be held in English.</p><p class=\"\">Slides used in the presentation will be made available on the company website at the following link: https://www.emblamedical.com/investors</p><p class=\"\">To participate in the telephone conference, please use the dial-in details provided below:</p><p class=\"\">DK: +45 78 76 84 90</p><p class=\"\">SE: +46 31-311 50 03</p><p class=\"\">UK: +44 20 3769 6819</p><p class=\"\">US: +1 646 787 0157</p><p class=\"\">Participant access code: 274982</p><p class=\"\">The webcast will be available through following link:  Embla Medical Q4/FY 2024 webcast</p><p class=\"\">Further information</p><p class=\"\">Klaus Sindahl, Head of Investor Relations, KSindahl@emblamedical.com, +45 5363 0134</p><p class=\"\">Embla Medical press releases by e-mail</p><p class=\"\">If you wish to receive Embla Medical press releases by e-mail, please register at http://www.emblamedical.com/investors</p><p class=\"\">About Embla Medical</p><p class=\"\">Embla Medical (Nasdaq Copenhagen: EMBLA) was founded in Reykjavik in 1971 with the mission to improve people's mobility. Embla Medical is home to several brands renowned for positively impacting people's health and well-being. They include Össur, a leading global provider of prosthetics and bracing and supports solutions; FIOR &amp; GENTZ, an innovative developer of neuro orthotics; and College Park Industries, creators of custom-built prosthetic solutions. Embla Medical also provides patients with world-class care through a global network of Orthotic and Prosthetic (O&amp;P) facilities. Embla Medical is committed to sustainable business practices and is signatory to the UN Global Compact, UN Women's Empowerment Principles, and contributes to the UN Sustainable Development Goals. The company's climate targets have been verified by the Science Based Targets initiative. Embla Medical operates globally and has more than 4,000 employees. www.emblamedical.com</p><p class=\"\">Embla Medical was formerly listed as Össur (OSSR) on Nasdaq Copenhagen until 8 April 2024.</p><p class=\"\">This information was brought to you by Cision http://news.cision.com</p><p class=\"\">https://news.cision.com/embla-medical-hf-/r/embla-medical-hf--interim-report-q4-2024,c4100604</p><p class=\"\">The following files are available for download:</p><p class=\"\">https://mb.cision.com/Main/18404/41006  20250205 Embla Medical Company <br/>04/3246107.pdf                          Announcement Q4 2024 FINAL</p><p class=\"\">View original content:https://www.prnewswire.com/news-releases/embla-medical-hf-interim-report-q4-2024-302368614.html</p><p class=\"\">SOURCE Embla Medical hf.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002402:0/",
            "pub_date": "2025-02-05 16:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0KS:0",
            "title": "Italy's Fincantieri gets Norwegian Line cruise ship order worth $9 billion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Norwegian Line Holdings (NCL)  and Italian shipbuilder Fincantieri  said on Wednesday they had agreed a deal for four new cruise liners, which a source close to the matter said was worth around 9 billion euros ($9.34 billion).</p><p class=\"\">Fincantieri has already built two ships for NCL and a third, called the Norwegian Aqua, will be delivered in the coming months. The four new vessels are the single largest order ever signed by the Italian shipbuilder, the source said.</p><p class=\"\">\"The value of this agreement, subject to financing and other typical terms and conditions, is considered very important,\" Fincantieri said in a statement on the order, adding that an original letter of intent was signed in April 2024. </p><p class=\"\">The ships will be built at Fincantieri's Monfalcone shipyard in north-eastern Italy and the first will be delivered in 2030, it said. The others will be finished in 2032, 2034 and 2036. </p><p class=\"\">Each will be around 226,000 tonnes and will be able to accommodate more than 8,300 people, including crew, said Fincantieri, which in November raised its full-year revenue forecast to above 8 billion euros.</p><p class=\"\">While steadily pursuing its core shipbuilding business, the group is also pushing into the defence and underwater segments.</p><p class=\"\">In May it bought Leonardo's  UAS in a deal giving the submarine business an enterprise value of 415 million euros.  </p><p class=\"\">CEO Pierroberto Folgiero also said that Fincantieri was open to all types of collaboration with the warship division of conglomerate Thyssenkrupp .</p><p class=\"\">Fincantieri shares have been the fourth-best performer on the Milan bourse over the past 12 months, rising 106%. The stock rose as much as 5.6% on the Milan bourse in early trade, and was up by 2.83% at 0821 GMT. </p><p class=\"\">($1 = 0.9632 euros) </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0KS:0-italy-s-fincantieri-gets-norwegian-line-cruise-ship-order-worth-9-billion/",
            "pub_date": "2025-02-05 16:34:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFNbLtz6f:0",
            "title": "Acarix Partners with Geo-Med to Extend the Availability of the CADScor System for Veterans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OKLAHOMA CITY — Acarix, a pioneer in the development of groundbreaking acoustic-based cardiac diagnostic solutions, is proud to announce a new strategic partnership with Geo-Med, LLC, a renowned Service-Disabled Veteran-Owned Small Business that specializes in medical and surgical products for the Department of Veterans Affairs and Department of Defense.</p><p class=\"\">This partnership signifies Acarix’s dedication towards enhancing the availability of advanced medical technologies to America's veterans. Geo-Med’s deep expertise in providing high-quality medical products to the VA and Department of Defense, along with their insight into VA procurement, will be instrumental in ensuring that the CADScor System by Acarix reaches the veterans who need it most.</p><p class=\"\">Aamir Mahmood, President and CEO of Acarix, remarked, “This is a monumental win for Acarix as we unite with Geo-Med's considerable capabilities and reach. Together, we are set to drive forward the presence of innovative and life-saving cardiac diagnostic tools such as the CADScor® System, enhancing the quality of care available to these brave veterans.”</p><p class=\"\">Mike Locke, CEO of Geo-Med, added, “Our mission has always focused on delivering the best medical solutions to our servicemen and women. Partnering with Acarix aligns perfectly with our goal, leveraging their pioneering CADScor System to add exceptional value to our product offerings and ultimately to the healthcare of our veterans.”</p><p class=\"\">The CADScor System by Acarix, known for its efficiency and accurate low-risk stratification in assessing coronary artery disease (CAD) at the point of care, will now be more readily accessible within federal medical facilities, ensuring critical advancements in medical technology are within reach for the men and women who have served the United States.</p><p class=\"\">For further details about Geo-Med, please visit www.geomedsdvo.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFNbLtz6f:0-acarix-partners-with-geo-med-to-extend-the-availability-of-the-cadscor-system-for-veterans/",
            "pub_date": "2025-02-05 16:35:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463871:0",
            "title": "Fujairah Building Industries to Halt Trading in Abu Dhabi",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fujairah Building Industries (ADX:FBI) shares will temporarily pause trading on the Abu Dhabi Securities Exchange from 11 am local time on Feb. 17 due to a board meeting. </p><p class=\"\">The Abu Dhabi-listed building materials company will resume trading after it publishes the results of its meeting, according to a Wednesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463871:0/",
            "pub_date": "2025-02-05 16:35:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_APN2MRL3B:0",
            "title": "Iceland central bank cuts policy interest rate to 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Iceland's central bank on Wednesday cut its key policy interest rate to 8.0% from 8.5%, and said inflation has continued to fall.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_APN2MRL3B:0-iceland-central-bank-cuts-policy-interest-rate-to-8/",
            "pub_date": "2025-02-05 16:35:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0P7:0",
            "title": "Novo Nordisk shares shine after Q4 profit, sales beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Novo Nordisk's  rise 4.5% after the Danish drugmaker's Q4 sales and EBIT beat expectations</p><p class=\"\">** Q4 net sales amounted to DKK 85.68 billion vs DKK 81.49 billion estimate seen in a company-compiled consensus</p><p class=\"\">** Q4 EBIT of DKK 36.74 billion beat the 33.60 billion seen in the consensus</p><p class=\"\">** The maker of Wegovy obesity drug forecast sales growth in local currencies in a range of 16%-24% for 2025 vs 26% in 2024, compared to analysts expectations of just under 20%</p><p class=\"\">** The guidance implies significant upgrades to consensus beyond 2025, which should lead to significant share outperformance, J.P.Morgan analyst says</p><p class=\"\">    ** Shares of Novo and its domestic rival Zealand Pharma  (+4%) are among best performers on STOXX 600 index  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0P7:0-novo-nordisk-shares-shine-after-q4-profit-sales-beat/",
            "pub_date": "2025-02-05 16:26:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463858:0",
            "title": "Japan Services Sector Expansion Extends in January: PMI Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's services industries expanded in January, and boosted hiring to handle additional business, reported S&amp;P Global on Wednesday. </p><p class=\"\">The Japan services purchasing managers index (PMI) rose to 53.0 in January, up from 50.9 in December 2024, and rising further above the 50-marker that separates growth from contraction, reported S&amp;P Global, citing its monthly survey. </p><p class=\"\">The survey covers the consumer (excluding retail), transport, information, communication, finance, insurance, real estate and business services sectors. </p><p class=\"\">\"Rising services business activity has now been recorded in each of the last three months (including January),\" said S&amp;P Global. \"Sub-sector data indicated that the strongest growth was in transport and storage and finance and insurance.\"</p><p class=\"\">Facing rising demand, managers were hiring in January. \"Service providers increased staffing levels again in the latest</p><p class=\"\">survey period, extending the current run of job creation to 16</p><p class=\"\">months,\" noted S&amp;P Global. </p><p class=\"\">Japan's service sector managers became more optimistic in the first month of the year. \"Concurrently, business optimism remained elevated in January, and the degree of confidence ticked higher from that in December,\" advised S&amp;P Global. </p><p class=\"\">However, Japan's service sector reported experiencing higher costs and raised prices in January. \"Input price inflation strengthened since the end of 2024, and was the most pronounced since last August. Firms linked higher costs to rising wages, as well as increasing fuel and raw material prices,\" said S&amp;P Global. \"Latest data also signaled a sharp increase in average prices charged at the start of 2025.\"</p><p class=\"\">The Japan services PMI was compiled by S&amp;P Global from surveys sent to 400 service sector companies from January 9 through January 25. </p><p class=\"\">In addition, the Japan composite PMI, a combination of the services and manufacturing sectors, rose to 51.1 in January, up from 50.5 in December and above the neutral marker for the third consecutive month, reported S&amp;P Global.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463858:0/",
            "pub_date": "2025-02-05 16:26:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446700:0",
            "title": "Spain Private Sector Growth Remains Strong",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HCOB Spain Composite PMI eased to 54 in January 2025, compared to an over 1-1/2-year high of 56.8 in December, pointing to a solid pace of expansion in the country's private sector, albeit slower than in the preceding month.</p><p class=\"\">A notable slowdown in manufacturing expansion (PMI at 50.9 vs 53.3 in December) was accompanied by milder growth in the service sector (PMI at 54.9 vs 57.3).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446700:0-spain-private-sector-growth-remains-strong/",
            "pub_date": "2025-02-05 16:27:14",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463857:0",
            "title": "Malaysia Adjusts Anti-Dumping Duties on Chinese Steel Wires",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Malaysia's trade ministry revised the anti-dumping tariffs on stranded steel wires used for prestressing concrete following an administrative review. </p><p class=\"\">The new rate for Chinese general producers and exporters is set at 21.72%, according to a Malaysian government filing released Wednesday. </p><p class=\"\">The duties were set at 9.07% for Silvery Dragon Prestressed Materials Tianjin and 3.12% for Tianjin Dalu Steel Strand For Prestressed. </p><p class=\"\">The duties are effective until Dec. 24, 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463857:0/",
            "pub_date": "2025-02-05 16:27:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}