{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV16S:0",
            "title": "United Airlines to restart services to Israel",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">United Airlines  said on Tuesday it will restart its services to Tel Aviv, Israel on March 15.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV16S:0-united-airlines-to-restart-services-to-israel/",
            "pub_date": "2025-02-04 21:04:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC87S5XG:0",
            "title": "Volati Buys Clever Etiketten GmbH In Germany",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Volati AB :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">VOLATI ACQUIRES CLEVER ETIKETTEN GMBH IN GERMANY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLEVER GENERATED REVENUES OF ABOUT SEK 290 MILLION IN 2024</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACQUISITION IS FINANCED VIA VOLATI’S EXISTING CREDIT FACILITIES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC87S5XG:0-volati-buys-clever-etiketten-gmbh-in-germany/",
            "pub_date": "2025-02-04 21:04:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308780:0",
            "title": "Earnings Flash (FOX) Fox Posts Fiscal Q2 Revenue $5.08 Billion, vs. FactSet Est of $4.87 Billion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308780:0/",
            "pub_date": "2025-02-04 21:04:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308771:0",
            "title": "IES Holdings Fiscal Q1 Adjusted Earnings, Revenue Increase",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IES Holdings  reported fiscal Q1 adjusted earnings Tuesday of $2.64 per diluted share, up from $1.86 a year earlier. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $749.5 million, up from $634.4 million a year earlier. </p><p class=\"\">Comparable analyst estimates were not readily available.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308771:0/",
            "pub_date": "2025-02-04 21:04:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308785:0",
            "title": "Wells Fargo Adjusts Hilton Worldwide Price Target to $240 From $232, Maintains Equal Weight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hilton Worldwide Holdings  has an average rating of overweight and mean price target of $250.83, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308785:0/",
            "pub_date": "2025-02-04 21:04:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNEJCyG1:0",
            "title": "Rackspace Technology Teams Up with Munster Technological University to Launch Ireland’s First Quantum Cloud Platform on AWS, Advancing Collaborative Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">QCloud Connects 13 Research Institutes and Fuels 11 Major Quantum Computing Projects to Transform Ireland’s Quantum Research Landscape</p><p class=\"\">SAN ANTONIO, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">Rackspace Technology® </strong>, a leading provider of hybrid, multicloud, and AI technology solutions, today announced, working with Munster Technological University (MTU) to unveil QCloud, Ireland's first quantum cloud computing hub on Amazon Web Services (AWS). This groundbreaking initiative aims to enhance collaborative research and remove barriers to accessing cutting-edge quantum computing technologies.</p><p class=\"\">Established in 2021, MTU operates across six campuses in southwestern Ireland and is at the forefront of national cybersecurity initiatives within the European Union. QCloud was developed due to MTU’s commitment to democratizing access to quantum resources, enabling secure and scalable connectivity to genuine quantum computing power for researchers throughout Ireland. MTU partnered with Rackspace Technology on the project due to its expertise in navigating the European Open Science Cloud (EOSC) Future project, which encourages collaboration between commercial service providers and researchers.</p><p class=\"\">“Rackspace collaborated with MTU to secure essential funding to launch QCloud, enhancing research opportunities across the region,” said D K Sinha, Rackspace Technology, President Public Cloud. “We are proud of this accomplishment because, through QCloud, MTU has established Ireland as a quantum research hub, democratizing access to cutting-edge quantum computing resources and fostering the next generation of quantum innovation.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>QCloud Implementation</em></strong></p><p class=\"\">Following a successful proposal process facilitated by Rackspace, MTU launched QCloud in February 2024 with funding from the EOSC Future project. This innovative platform provides centralized access to quantum computing resources for researchers, facilitating groundbreaking work in various fields, including autonomous systems security. Through QCloud, MTU establishes Ireland as a key player in the quantum research ecosystem, fostering innovation and democratizing access to quantum computing resources.</p><p class=\"\">Collaboration between MTU, Rackspace Technology, and AWS resulted in a comprehensive quantum research environment that includes:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A centralized platform providing quantum computing access to eight universities and 13 research institutes</li><li class=\"listItem-bmN0_SHH\">AWS Control Tower landing zone with Account Factory for streamlined project management</li><li class=\"listItem-bmN0_SHH\">Custom quantum cost control dashboard for Amazon Braket using Amazon Identity and Access Management (IAM), AWS Cloud Development Kit (CDK), Amazon EventBridge and Amazon CloudWatch</li><li class=\"listItem-bmN0_SHH\">Real-time cost tracking with automated budget alerts and management systems</li></ul><p class=\"\">“Rackspace's collaboration was essential for establishing the QCloud infrastructure. Their expertise in AWS technologies was invaluable throughout this process,” said Dr. Anila Mjeda, Cybersecurity Lecturer at MTU. “QCloud opens doors for researchers to explore advanced applications while managing costs effectively, allowing for real-time monitoring and budget management. With QCloud, researchers can leverage actual quantum computers, moving beyond traditional simulators that fall short in accounting for real-world factors like quantum noise.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>QCloud Impact and Vision </em></strong></p><p class=\"\">Since its inception, QCloud has connected multiple institutions, supporting 12 startups and 11 major research projects. The platform marks a significant shift in Ireland's quantum research landscape, empowering universities to provide hands-on experiences with quantum computing.</p><p class=\"\">\"In classical computing, information is stored in binary code, represented by ones and zeroes,\" said Dr. Hazel Murray, Ph.D., Cybersecurity Lecturer and QCloud Project Lead at MTU. \"Quantum computing, however, leverages quantum particles, where information is encoded in the quantum states of electrons or photons, for instance. This enables exponentially greater flexibility in data representation, unlocking the potential to store and analyze information beyond the limitations of classical systems.\"</p><p class=\"\">The university expects to double its research projects in the coming year and welcomes new participants. \"This is a remarkable time for innovation in quantum computing. We’re finally seeing ideas evolve into commercial and societally beneficial products while exploring new possibilities,\" added Murray.</p><p class=\"\">For additional in-depth details on the groundbreaking Munster Technology University QCloud initiative, click to read the entire case study and view the video.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Rackspace Technology </strong> </p><p class=\"\">Rackspace Technology is a leading end-to-end, hybrid, multicloud, and AI solutions company. We can design, build, and operate our customers' cloud environments across all major technology platforms, irrespective of technology stack or deployment model. We partner with our customers at every stage of their cloud journey, enabling them to modernize applications, build new products, and adopt innovative technologies.  </p><p class=\"\">Media Contact: Natalie Silva, publicrelations@rackspace.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNEJCyG1:0-rackspace-technology-teams-up-with-munster-technological-university-to-launch-ireland-s-first-quantum-cloud-platform-on-aws-advancing-collaborative-research/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005915:0",
            "title": "Quantum to Release Fiscal Third Quarter 2025 Financial Results on Wednesday, February 12, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Quantum to Release Fiscal Third Quarter 2025 Financial Results on Wednesday, February 12, 2025</p><p class=\"\">SAN JOSE, Calif.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Quantum(R) Corporation  (\"Quantum\" or the \"Company\"), a leader in solutions for AI and unstructured data, today announced it will release financial results for its fiscal third quarter 2025 on Wednesday, February 12, 2025, after the markets close.</p><p class=\"\">Jamie Lerner, Chairman and Chief Executive Officer, and Kenneth Gianella, Chief Financial Officer and Chief Operating Officer, will host a conference call at 5:00 p.m. Eastern Time (2:00 p.m. Pacific Time) to discuss the Company's financial results.</p><p class=\"\">Analysts and investors are invited to join the conference call using the following information:</p><p class=\"\">Date: Wednesday, February 12, 2025</p><p class=\"\">Time: 5:00 p.m. ET (2:00 p.m. PT)</p><p class=\"\">Conference Call Number: 1-866-424-3436</p><p class=\"\">International Call Number: +1-201-689-8058</p><p class=\"\">Conference ID: 13751306</p><p class=\"\">Webcast link (listen only) and presentation slides: Click Here</p><p class=\"\">A telephone replay of the conference call will be available approximately two hours after the conference call and will be available through February 26, 2025. To access the replay dial 1-877-660-6853 and enter the conference ID 13751306 at the prompt. International callers should dial +1-201-612-7415 and enter the same conference ID. Following the conclusion of the live call, a replay of the webcast will be available on the Company's website for at least 90 days.</p><p class=\"\">About Quantum</p><p class=\"\">Quantum delivers end-to-end data management solutions designed for the AI era. With over four decades of experience, our data platform has allowed customers to extract the maximum value from their unique, unstructured data. From high-performance ingest that powers AI applications and demanding data-intensive workloads, to massive, durable data lakes to fuel AI models, Quantum delivers the most comprehensive and cost-efficient solutions. Leading organizations in life sciences, government, media and entertainment, research, and industrial technology trust Quantum with their most valuable asset — their data. Quantum is listed on Nasdaq (QMCO). For more information visit www.quantum.com.</p><p class=\"\">Quantum and the Quantum logo are registered trademarks of Quantum Corporation and its affiliates in the United States and/or other countries.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250203319767/en/</p><p class=\"\">CONTACT:    Investor Relations Contact:</p><p class=\"\">Shelton Group</p><p class=\"\">Leanne K. Sievers | Brett Perry</p><p class=\"\">E: sheltonir@sheltongroup.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005915:0/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6bd9ddb733aab:0",
            "title": "Mesa Labs Announces Third Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mesa Laboratories, Inc., a global leader in the design and manufacture of life science tools and critical quality control solutions, has released its financial results for the third fiscal quarter ended December 31, 2024. The company reported significant growth in revenues and operating income, alongside strategic initiatives aimed at reducing debt and enhancing profitability.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the third quarter of fiscal year 2025, Mesa Labs reported a 17.5% increase in revenues compared to the same period in the previous year, reaching $62.84 million. Operating income saw a substantial rise of 8,725% to $5.779 million. However, the company recorded a net loss of $1.676 million, primarily due to unrealized foreign currency losses and interest expenses. On a non-GAAP basis, core organic revenues grew by 13.2%, and adjusted operating income (AOI) excluding unusual items increased by 13.3%.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Mesa Labs operates in four divisions: Sterilization and Disinfection Control (SDC), Clinical Genomics (CG), Biopharmaceutical Development (BPD), and Calibration Solutions (CS). Each division contributed to the overall growth, with notable performances in the Calibration Solutions and Biopharmaceutical Development segments. The acquisition of GKE, completed in December 2023, also played a significant role in driving revenue growth.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">During the third quarter, Mesa Labs repaid $9.4 million in debt, reducing its total Net Leverage Ratio to 3.20. The company aims to bring this ratio below 3.0x by the end of the second quarter of fiscal year 2026. The acquisition of GKE has exceeded initial revenue and profitability expectations, contributing positively to the company's financial performance.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Gary Owens, Chief Executive Officer of Mesa Labs, highlighted the company's strong performance across all divisions, with sequential and year-over-year growth in revenues, orders, and AOI. Owens emphasized the company's commitment to reducing debt and adapting to potential market shifts, including changes in U.S. policies and economic conditions in Europe.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead, Mesa Labs anticipates continued year-over-year core revenue growth in the fourth quarter of fiscal year 2025. The company remains focused on strategic initiatives and is prepared to adapt to new policies and market conditions, including the appreciation of the U.S. dollar and rising recession risks in Europe.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/724004/000143774925002661/mlab20250203_8k.htm\" rel=\"nofollow\" target=\"_blank\">MESA LABORATORIES INC /CO/ [ MLAB ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6bd9ddb733aab:0-mesa-labs-announces-third-quarter-results/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6f6c679c13b08:0",
            "title": "Madison Square Garden Sports Corp. Reports Fiscal 2025 Second Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Madison Square Garden Sports Corp. has released its financial results for the fiscal second quarter ending December 31, 2024. The company, which owns and operates the New York Knicks and New York Rangers, reported a notable increase in revenues driven by strong demand and additional home games.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fiscal 2025 second quarter, MSG Sports reported revenues of $357.8 million, marking a 9% increase from the prior year period. Despite this revenue growth, operating income decreased by 54% to $13.3 million, and adjusted operating income fell by 45% to $20.2 million. The decline in operating income was primarily due to increased direct operating expenses and higher selling, general, and administrative expenses.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The New York Knicks and New York Rangers began their 2024-25 regular seasons, playing three more games at Madison Square Garden compared to the previous year. This contributed to higher ticket-related revenues, suite revenues, sponsorship and signage revenues, and food, beverage, and merchandise sales. Additionally, local media rights fees saw an increase due to contractual rate hikes.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">During the quarter, MSG Sports experienced higher team personnel compensation and increased provisions for league revenue sharing expenses and NBA luxury tax. The company also reported higher operating lease costs and professional fees, partially offset by lower employee compensation and related benefits.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">James L. Dolan, Executive Chairman and CEO, commented, \"In the fiscal second quarter, fan enthusiasm and robust corporate demand helped drive growth in per-game revenues across all key areas of our business. We remain confident in the fundamentals of our business and our ability to drive long-term shareholder value.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">While the company did not provide specific forward-looking statements in this report, the management's confidence in the business fundamentals suggests a positive outlook for the upcoming periods. Investors are advised to monitor future filings for more detailed guidance and projections.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1636519/000163651925000004/msgs-20250204.htm\" rel=\"nofollow\" target=\"_blank\">Madison Square Garden Sports Corp. [ MSGS ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6f6c679c13b08:0-madison-square-garden-sports-corp-reports-fiscal-2025-second-quarter-results/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX7g1vdb:0",
            "title": "IO Biotech Announces Publication of Preclinical Data Investigating Immune-Modulatory Effects of IO112, an Arginase 1-Targeting Therapeutic Cancer Vaccine Candidate",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"> – Submission of Investigational New Drug Application (IND) to US FDA expected in 2025 – </p><p class=\"\">NEW YORK, Feb.  04, 2025  (GLOBE NEWSWIRE) — IO Biotech , a clinical-stage biopharmaceutical company developing novel, immune-modulatory, off-the-shelf therapeutic cancer vaccines, today announced the publication of results from a preclinical study of its second immune-modulatory therapeutic cancer vaccine candidate, IO112, targeting arginase 1 (Arg1), in the Journal for ImmunoTherapy of Cancer.</p><p class=\"\">These preclinical data further expand upon previously reported data that IO112 treatment inhibits tumor growth through dynamic changes in the tumor microenvironment (TME). The present study showed how Arg1-specific T cells expanded by the vaccine enhance anti-tumor immunity by reprogramming tumor-associated macrophages (TAMs) and promote a proinflammatory TME. Arg1 plays a central role in immune suppression, and its overexpression has been reported in several cancers.</p><p class=\"\">“Arg1-expressing TAMs remain a major hurdle in cancer immunotherapy due to their role in creating an immunosuppressive TME,” said Ayako Wakatsuki Pedersen, PhD, Senior Vice President of Translational Research at IO Biotech. “TAMs represent one of the most abundant immune cell subsets found within the TME and it’s really exciting to learn that IO112 treatment directly impacts TAMs, changing the phenotype of TAMs completely. These findings further support the continued clinical development of Arg1-based immune-modulatory vaccines.”</p><p class=\"\">“These data published in the <em>Journal of ImmunoTherapy of Cancer</em> add to the strong body of evidence that the unique approach of our T-win® platform, designed to kill both tumor cells and immune-suppressive cells in the TME, could potentially change the treatment paradigm in the management of a number of cancers,” said Mai-Britt Zocca, Ph.D., President and CEO of IO Biotech. “We look forward to submitting an IND for IO112 in 2025 and advancing into clinical development as part of our commitment to transform the treatment of cancer patients.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IO112</strong></p><p class=\"\">IO112 is the company’s fully-owned, novel investigational product candidate containing a single Arginase 1-derived peptide designed to engage and activate Arginase 1-specific human T cells. IO112 is designed to target T cells that recognize epitopes derived from Arginase 1, which is an immunoregulatory enzyme highly expressed in difficult-to-treat tumors associated with high levels of myeloid-derived suppressor cells (MDSCs) including renal cell carcinoma, head and neck, breast, pancreatic, ovarian, colorectal and prostate cancers. Arginase overexpression is a well-documented tumor escape mechanism. IO112 has been studied in a single arm first-in-human Phase 1 trial in patients with arginase-positive solid tumors, conducted in an investigator-initiated trial at the University of Copenhagen. The company anticipates filing an IND for IO112 in 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IO Biotech</strong></p><p class=\"\">IO Biotech is a clinical-stage biopharmaceutical company developing novel, immune-modulatory, off-the-shelf therapeutic cancer vaccines based on its T-win® platform. The T-win platform is based on a novel approach to cancer vaccines designed to activate T cells to target both tumor cells and the immune-suppressive cells in the tumor microenvironment. IO Biotech is advancing its lead investigational cancer vaccine candidate, Cylembio™ (imsapepimut and etimupepimut, adjuvanted) in clinical trials, and additional pipeline candidates through preclinical development. Based on positive Phase 1/2 first line metastatic melanoma data, IO102-IO103, in combination with Merck’s anti-PD-1 therapy, KEYTRUDA® (pembrolizumab), has been granted a Breakthrough Therapy Designation for the treatment of advanced melanoma by the US Food and Drug Administration. IO Biotech is headquartered in Copenhagen, Denmark and has US headquarters in New York, New York.</p><p class=\"\">For further information, please visit www.iobiotech.com. Follow us on our social media channels on LinkedIn and X (@IOBiotech).</p><p class=\"\">Cylembio is a trademark of IO Biotech ApS.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statement</strong></p><p class=\"\">This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements, including regarding the timing of submission of an IND for IO112, other current or future regulatory submissions or clinical trials, their progress, enrollment or results, or the company’s financial position or cash runway, are based on IO Biotech’s current assumptions and expectations of future events and trends, which affect or may affect its business, strategy, operations or financial performance, and actual results and other events may differ materially from those expressed or implied in such statements due to numerous risks and uncertainties. Forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Because forward-looking statements are inherently subject to risks and uncertainties, you should not rely on these forward-looking statements as predictions of future events. These forward-looking statements speak only as of the date hereof and should not be unduly relied upon. Except to the extent required by law, IO Biotech undertakes no obligation to update these statements, whether as a result of any new information, future developments or otherwise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investors</strong></p><p class=\"\">Maryann Cimino, Director of Investor Relations </p><p class=\"\">IO Biotech, Inc.</p><p class=\"\">617-710-7305</p><p class=\"\">mci@iobiotech.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media</strong></p><p class=\"\">Julie Funesti</p><p class=\"\">Edelman</p><p class=\"\">917-498-1967</p><p class=\"\">julie.funesti@edelman.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX7g1vdb:0-io-biotech-announces-publication-of-preclinical-data-investigating-immune-modulatory-effects-of-io112-an-arginase-1-targeting-therapeutic-cancer-vaccine-candidate/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:31f9379bfc0ce:0",
            "title": "Fox Corporation Q2 Fiscal 2025 Earnings Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fox Corporation has released its financial results for the second quarter of fiscal 2025, ending December 31, 2024. The company reported significant growth in revenues and net income, driven by strong performance in its Television and Cable Network Programming segments.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the quarter ended December 31, 2024, Fox Corporation reported total revenues of $5.08 billion, a 20% increase from the $4.23 billion reported in the same period last year. Net income for the quarter was $388 million, up from $115 million in the prior year quarter. Earnings per share (EPS) attributable to Fox Corporation stockholders rose to $0.81 from $0.23. Adjusted net income was $442 million ($0.96 per share), compared to $165 million ($0.34 per share) in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The Television segment saw a 16% increase in revenues to $2.96 billion, driven by higher political advertising revenues, improved MLB postseason ratings, and NFL pricing. The Cable Network Programming segment reported a 31% increase in revenues to $2.17 billion, primarily due to higher news ratings and digital advertising revenues.</p><p class=\"\">Adjusted EBITDA for the quarter was $781 million, a 123% increase from the $350 million reported in the prior year quarter. This growth was primarily due to increased revenues, partially offset by higher expenses related to sports programming rights and production costs.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Fox Corporation declared a dividend of $0.27 per Class A and Class B share, payable on March 26, 2025. The company also continued its share repurchase program, buying back approximately $250 million of its Class A common stock during the quarter. As of December 31, 2024, Fox has repurchased approximately $5.1 billion of its Class A common stock and $1 billion of its Class B common stock, with a remaining authorization of $900 million.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Executive Chair and Chief Executive Officer Lachlan Murdoch commented on the results, stating, \"A compelling fall sports schedule combined with a record-breaking presidential election news cycle resulted in second quarter results that reflect the strength and breadth of FOX. Whether measured in terms of engagement, monetization or profitability, our focused strategy of live news and sports programming, coupled with our growing digital initiatives, continues to deliver. We remain committed to sustained long-term value creation for our shareholders through our thoughtful and disciplined strategy for growth.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">While the company did not provide specific guidance for the next reporting period, the strong performance in key segments and ongoing strategic initiatives suggest a positive outlook for the remainder of the fiscal year.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1754301/000162828025003584/fox-20250204.htm\" rel=\"nofollow\" target=\"_blank\">Fox Corp [ FOX ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:31f9379bfc0ce:0-fox-corporation-q2-fiscal-2025-earnings-report/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005909:0",
            "title": "Easterly Government Properties Schedules Fourth Quarter 2024 Earnings Release and Conference Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Easterly Government Properties Schedules Fourth Quarter 2024 Earnings Release and Conference Call</p><p class=\"\">WASHINGTON--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Easterly Government Properties, Inc.  today announced that the Company will release its fourth quarter 2024 financial results on February 25, 2025.</p><p class=\"\">A conference call will be held Tuesday, February 25, 2025 at 11:00am Eastern time. The management team will review fourth quarter performance, discuss recent events and conduct a question-and-answer session.</p><p class=\"\">Attendees that would like to join the call and ask a question may register here to receive the dial-in numbers and unique PIN to access the call. There will also be a live audio, listen-only webcast of the call on the Investor Relations section of Easterly's Investor Relations website at ir.easterlyreit.com.</p><p class=\"\">Shortly after the call, a replay of the call will be available on the Company's website for up to twelve months.</p><p class=\"\">About Easterly Government Properties, Inc.</p><p class=\"\">Easterly Government Properties, Inc.  is based in Washington, D.C. and focuses primarily on the acquisition, development and management of Class A commercial properties that are leased to the U.S. Government. With a long-stated goal of being the partner of choice to the United States Government, Easterly's experienced management team brings specialized insight into the strategy and needs of mission-critical U.S. Government agencies for properties leased to such agencies either directly or through the U.S. General Services Administration (GSA). For further information on the company and its properties, please visit www.easterlyreit.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204165378/en/</p><p class=\"\">CONTACT:    Easterly Government Properties, Inc.</p><p class=\"\">Lindsay S. Winterhalter</p><p class=\"\">Senior Vice President, Investor Relations &amp; Operations</p><p class=\"\">202-596-3947</p><p class=\"\">ir@easterlyreit.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005909:0/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308673:0",
            "title": "Microbix Receives $2.4 Million From Warrants Exercise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Microbix Biosystems  on Tuesday said it has received $2.4 million from the partial exercise of expiring share purchase warrants. </p><p class=\"\">The warrants were issued in connection with a Jan. 2020 private placement and had an exercise price of $0.36. A total of 6.7 million of the remaining 8.9 million warrants were exercised in this round. The remaining 1.45 million 2020 warrants were exercised by insiders, the company said. </p><p class=\"\">Microbix intends to use the proceeds to broaden its product development capabilities. </p><p class=\"\">There are no further Microbix warrants outstanding following the expiry of this series. </p><p class=\"\">Mirobix was last seen up US$0.60, to US$11.09, in New York trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308673:0/",
            "pub_date": "2025-02-04 21:05:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2Xp8Jg:0",
            "title": "Alpha Modus Sues Walgreens for Patent Infringement, Strengthening Its Leadership in AI-Driven Retail Innovation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CORNELIUS, N.C., Feb.  04, 2025  (GLOBE NEWSWIRE) — Alpha Modus Holdings, Inc.  (“Company”) announced today that its wholly owned subsidiary, Alpha Modus, Corp. (“Alpha Modus”), has filed a patent infringement lawsuit that also alleges willful infringement against Walgreens Co. (“Walgreens”) in the United States District Court for the Eastern District of Texas. This legal action underscores Alpha Modus’s unwavering commitment to protecting its groundbreaking AI-driven retail technology and further solidifies its leadership in the rapidly evolving retail innovation landscape.</p><p class=\"\">Championing Innovation and Protecting Shareholder Value</p><p class=\"\">Alpha Modus has transformed AI-powered retail engagement with its extensive patent portfolio, including its latest—its ninth AI patent. Alpha Modus’s patented solutions are designed to enhance consumer experiences, improve retail efficiency, and boost revenue for retailers and brands.</p><p class=\"\">“We believe our technology is currently being used by scores of brands, retailers and technology providers. Our research demonstrates that, as a result, damages due Alpha Modus far exceed an estimated $500 million and could easily run into the billions over the life of our patents. This lawsuit is a necessary step to protect our intellectual property and uphold fair competition,” said Alpha Modus CEO William Alessi.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Alleged Patent Infringement Details</strong></p><p class=\"\">Walgreens allegedly willfully infringed on Alpha Modus’s patented AI-driven retail technology, which enhances in-store shopping through data-driven insights, interactive advertising, and consumer engagement tools. Walgreens’s deployment of Cooler Screens digital smart screens in its stores mirrors the innovations protected under Alpha Modus’s patents, necessitating this legal action.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Pattern of Defending Innovation</strong></p><p class=\"\">This lawsuit follows recent actions Alpha Modus has taken against major retailers and technology providers, including Kroger, Cooler Screens, Wakefern, Shelf Nine LLC, VSBLTY Groupe Technologies, Brookshire Grocery, and Grocery TV. These cases reflect Alpha Modus’s commitment to protecting its technology and securing rightful recognition of its innovations. The first of these cases is set for trial in November 2025.</p><p class=\"\">Meanwhile, Walgreens finds itself entangled in another legal dispute, with Cooler Screens recently filing a $200 million lawsuit against the pharmacy giant over alleged contract breaches related to digital smart screens deployed by Cooler Screens. Cooler Screens was co-founded by Greg Wasson, former CEO of Walgreens Boots Alliance. The Company’s understanding is that Wasson, through Wasson Enterprises, funded the startup of Cooler Screens and helped deploy Cooler Screens technology throughout Walgreens. These ongoing legal challenges between Walgreens and Cooler Screens further reinforce the strategic importance of Alpha Modus’s claims and the value of its intellectual property.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Market Confidence and Unprecedented Momentum</strong></p><p class=\"\">Alpha Modus’s firm stance on intellectual property aligns with its broader strategic vision, as reaffirmed in a recent press release by CEO William Alessi. That announcement on January 30, 2025, which addressed Alessi's perspective on uninformed or ill-informed speculation in the Company’s stock, market volatility and Alpha Modus’s successful SPAC merger, triggered an unprecedented surge in AMOD stock trading volume, leading to AMOD stock trading over 25 times its public float—demonstrating strong investor confidence in the Company’s ability to achieve its long-term growth objectives.</p><p class=\"\">“Alpha Modus remains committed to redefining retail technology,” added Alessi. “We are dedicated to delivering shareholder value, and this lawsuit reaffirms our commitment to innovation, fairness, and growth.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Alpha Modus</strong></p><p class=\"\">Alpha Modus Holdings, Inc.  is a pioneering technology company specializing in AI-driven retail solutions. The Company’s patented technologies optimize consumer engagement, enhance in-store experiences, and drive measurable returns for retailers and brands. For more information, visit www.alphamodus.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Alpha Modus’s actual results may differ from their expectations, estimates, and projections, and, consequently, you should not rely on these forward-looking statements as predictions of future events. Words such as “expect,” “estimate,” “project,” “budget,” “forecast,” “anticipate,” “intend,” “plan,” “may,” “will,” “could,” “should,” “believes,” “predicts,” “potential,” “continue,” and similar expressions (or the negative versions of such words or expressions) are intended to identify such forward-looking statements, but are not the exclusive means of identifying these statements. These forward-looking statements include, without limitation, Alpha Modus’s expectations with respect to future performance.</p><p class=\"\">Alpha Modus cautions readers not to place undue reliance upon any forward-looking statements, which speak only as of the date made. Alpha Modus does not undertake or accept any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements to reflect any change in its expectations or any change in events, conditions, or circumstances on which any such statement is based.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts</strong></p><p class=\"\">Alpha Modus Holdings, Inc.</p><p class=\"\">Investor Relations</p><p class=\"\">ir@alphamodus.com</p><p class=\"\">+1(704)252-5050</p><p class=\"\">Follow us on LinkedIn</p><p class=\"\">Follow us on X</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2Xp8Jg:0-alpha-modus-sues-walgreens-for-patent-infringement-strengthening-its-leadership-in-ai-driven-retail-innovation/",
            "pub_date": "2025-02-04 21:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OU1GJ:0",
            "title": "AI giants’ less-is-more logic bears three caveats",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Bosses of big technology firms may find reassurance in comparing artificial intelligence to a lump of coal. Claimed cost-efficiency breakthroughs made by China’s DeepSeek have rocked markets betting on a boom in spending on the chips and servers powering silicon smarts. Analysts and executives like Microsoft’s  Satya Nadella reason that this shouldn’t be an issue by appealing to long-dead economist William Stanley Jevons’ observation that more-efficient coal-fired engines drove higher fuel demand. Scrutinizing other, more recent cases shows why that dynamic doesn’t guarantee success for today’s incumbents.</p><p class=\"\">Jevons, in an 1865 book called “The Coal Question,” laid out the seeming paradox. As steam engines improved, they needed less fuel for tasks like hauling trains. Yet coal demand in the United Kingdom kept rising. The reason is simple: railroad operators consumed less of it per train journey, increasing profits and encouraging them to run more locomotives. The trend is durable. Industrial processes keep getting more efficient, but in 2024, 159 years after the book was written, the world burned a record 8.8 billion tonnes of the stuff.</p><p class=\"\">Like energy, intelligence is a necessary input for economic activity. High-margin products from medicine to software, not to mention the day-to-day running of any big corporation, require mental effort for everything from organizational coordination to cutting-edge research. Even a wildly expensive AI that can perform some of this work will find takers where its output is valuable enough. Lower the price, and the range of tasks to which it makes sense to apply it expands.</p><p class=\"\">So when DeepSeek claimed it could train and run cutting-edge language models at a fraction of the cost of Western versions, it’s no wonder some people found comfort in coal. Sure, investors initially panicked, slicing nearly $600 billion off the market value of Nvidia , the dominant maker of chips used for AI, in one day. But Nadella, in a social media post, declared that “Jevons paradox strikes again,” adding that rising efficiency will cause AI use to “skyrocket.”</p><p class=\"\">Yet Jevons can’t help if demand isn’t there or assumptions underlying investments are wrong. Three more up-to-date industrial examples exemplify the pitfalls.</p><p class=\"\">Take hydraulic fracturing, which involves injecting shale formations with water, sand and chemicals to break open previously inaccessible deposits of natural gas and oil. Technological progress steadily reduced costs, leading to a massive rise in production. The U.S. is now the world’s largest producer of crude oil, with about two-thirds coming from fracking. Yet demand did not rise nearly as much. Companies that took on leverage to finance breakneck expansion couldn’t keep up, and waves of bankruptcies followed. Some 42 fracking companies bearing almost $26 billion in debt went under in 2019, according to the Institute for Energy Economics and Financial Analysis. Gas prices scraped along at all-time lows last year, the U.S. Energy Information Administration reported.</p><p class=\"\">This might be unfair to AI. Unlike oil – the need for which is increasingly being displaced by technologies like electric cars – intelligence seems unlikely to go out of style. But that still might not prop up, say, a mooted valuation of $300 billion for ChatGPT-maker OpenAI if competition swamps the market. Just look at solar panels.</p><p class=\"\">The cost of a U.S. solar system has fallen about 40% in a decade, according to the Solar Energy Industries Association trade group, with declines even steeper overseas. Unlike with gas, demand has exploded in response. Installed global solar power capacity increased 10-fold between 2013 and 2023.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:938.3259911894272px;aspect-ratio:1.5638766519823788\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-3b4f4ab69c7a44f90455995def2412c7-resized.webp\" type=\"images/webp\"/><img alt=\"A chart showing the annual increase in global installed solar photovoltaic power capacity\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-3b4f4ab69c7a44f90455995def2412c7-resized.jpeg\" style=\"background-color:#f8e4da\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">The world's demand for solar appears limitless</span></figcaption></figure></span></p><p class=\"\">Yet competition is fierce because panels are largely interchangeable. All that matters is price. Operating margins for the top ten manufacturers averaged roughly 0% in the third quarter of 2024, according to the National Renewable Energy Laboratory, despite record shipments.</p><p class=\"\">AI insiders like Dario Amodei, the CEO of Anthropic, however, think that competition will thin out. He claims smaller, newer companies have been able to jump into the race because novel techniques that produce big gains are still emerging so rapidly. Over time, improvements will become harder and more costly, by his reckoning. That could mean few firms – or even just one – will dominate.</p><p class=\"\">Yet limited competition and rapid growth do not guarantee extraordinary profit margins, either. Illumina , for instance, has dominated genetic sequencing for over a decade. In 2019, the Federal Trade Commission estimated it had an over-90% share of the market for advanced machines that identify the nucleotides in DNA samples.</p><p class=\"\">These machines have potential uses from telling people where their ancestors came from to designing personalized cancer treatments. Efficiency improvements have been swift and substantial. The price of sequencing one person’s genome, their entire set of DNA, has fallen from roughly $100 million in 2001 to about $200 today, according to the company.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:867.6171079429736px;aspect-ratio:1.4460285132382893\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-ec4ec5097208d4e002b39a10c6bbb183-resized.webp\" type=\"images/webp\"/><img alt=\"The price of sequencing a human genome has fallen from over $100 million in 2000 to about $200 today.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-ec4ec5097208d4e002b39a10c6bbb183-resized.jpeg\" style=\"background-color:#fbfafa\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">The price of genetic sequencing has cratered</span></figcaption></figure></span></p><p class=\"\">Yet even with nearly the entire market in its grasp, analysts expect Illumina’s revenue in 2026 to reach only $4.7 billion, according to LSEG data, not much different than in 2021. This is the result of a nasty combination that comes from having to outpace both a demand shortfall and rising competition. Genetic testing still needs to improve to be useful enough to draw in more customers; upstarts, meanwhile, are developing their own tests in an attempt to break through. Illumina must run faster just to stay in place.</p><p class=\"\">Perhaps AI will escape all these traps, proving useful enough, cheap enough, but hard enough to copy that it results in not just an explosion of usage, but profit, too. It’s just a much trickier matter than simply offering up Jevons’ paradox as some kind of proof that less is always more.</p><p class=\"\">Follow @rob_cyran on X</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OU1GJ:0-ai-giants-less-is-more-logic-bears-three-caveats/",
            "pub_date": "2025-02-04 21:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9S70l6:0",
            "title": "2025 Best of IT Services™ Award Winners Achieve Superior Ratings for Client and Employee Experience",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PORTLAND, Ore., Feb.  04, 2025  (GLOBE NEWSWIRE) — ClearlyRated®, the leading provider of client and employee satisfaction surveys and service quality benchmarking for IT Services firms, announced the winners of their inaugural Best of IT Services™ award today on ClearlyRated.com.</p><p class=\"\">“The remarkable achievements of our 2025 Best of IT Services winners deserve the highest recognition,\" said ClearlyRated CEO, Baker Nanduru. \"These industry leaders have proven through independently verified service ratings that excellence isn't just a goal—it's their standard operating procedure. As we celebrate this year's honorees, we're inspired by their commitment to consistently delivering exceptional experiences that shape the future of the IT services industry.”</p><p class=\"\">The 2025 Best of IT Services award program recognizes client and employee satisfaction leaders in the IT services industry. Participating firms use the Net Promoter® Score (NPS®) methodology to collect feedback and measure satisfaction of their clients and/or internal employees. Only firms that earned exceptional satisfaction ratings that outpace industry benchmarks for service qualified for the 2025 Best of IT Services award.</p><p class=\"\">According to ClearlyRated's latest survey data, clients of 2025 Best of IT Services winners for client satisfaction are 70% more likely to be completely satisfied with the services provided than the 2024 industry average. Fewer than 1% of all accounting firms in the U.S. and Canada achieve Best of IT Services for client or employee satisfaction.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ClearlyRated</strong></p><p class=\"\">ClearlyRated is a leading provider of client satisfaction surveys and service quality research for IT and other professional service providers. We help firms leverage the Net Promoter® Score survey methodology to gain deep insights, identify strengths and weaknesses, fuel data-driven action, build reputation and future-proof their organizations with third-party validation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Best of IT Services</strong></p><p class=\"\">The Best of IT Services Award is the only award in the U.S. and Canada that recognizes IT services firms that have proven superior service quality based entirely on ratings provided by their clients. Award winners are showcased by city and area of expertise on ClearlyRated.com—an online business directory that helps buyers of professional services find service leaders and vet prospective firms with the help of validated client ratings and testimonials.</p><p class=\"\">Net promoter, NPS, and Net Promoter Score are trademarks of Satmetrix Systems, Inc., Bain &amp; Company, and Fred Reichheld.</p><p class=\"\">Contact</p><p class=\"\">Stephen Banbury, VP of Marketing</p><p class=\"\">P (503) 977-6295</p><p class=\"\">stephen.banbury@clearlyrated.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9S70l6:0-2025-best-of-it-services-award-winners-achieve-superior-ratings-for-client-and-employee-experience/",
            "pub_date": "2025-02-04 21:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4z092g:0",
            "title": "Vivos Inc. Reports Encouraging Human Clinical Trial Results and Announces Expansion Plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Richland, WA, Feb.  04, 2025  (GLOBE NEWSWIRE) — Vivos Inc. (OTCQB: RDGL) is pleased to report that the first five patients demonstrated the safety of RadioGel Precision Radionuclide TherapyTM by satisfying the criteria in the Clinical Study Plan, including confirmation via PET imaging that the Y-90 remained at the point of injection and no adverse events reported by any of the initial five patients since the initial treatment date.</p><p class=\"\">Additionally, 30-day PET/F-18 imaging of a local patient—a young teacher with a cancerous node near the trachea—revealed an over 80% reduction in both tumor size and metastatic activity. Other treatment options would have jeopardized her voice, making this outcome particularly meaningful. While the trial’s primary objective is to establish safety, these early signs of efficacy are highly encouraging.</p><p class=\"\"><em>Expansion of Clinical Trial</em></p><p class=\"\">After completing the detailed assessment of the available data from the patients, the results will be presented to the Ethics Committee. The lead investigator intends to request authority to increase the study from 30 patients to 50 patients. The expanded trial will provide valuable data on a variety of cancers and include the utilization of new deep injection technology being installed and tested in the treatment hospital in India.</p><p class=\"\">This advanced deep-needle CT-guided precision injection device, designed for use with RadioGel®, will enable precise treatment of deeper-seated tumors, including lung and pancreatic cancer nodules.</p><p class=\"\">Under the current timeline, we anticipate completing the initial 30-patient trial by June 30 and the expanded trial by year-end. Consistent with our previous disclosure, the trial’s comprehensive data will be submitted under the guidance of the lead investigator for publication in leading medical journals. Additionally, as results emerge, they will be shared with the FDA to further support RadioGel®’s safety profile and reinforce our Investigational Device Exemption (IDE) submission and advance expanded indications for use in the United States.</p><p class=\"\"><em>Manufacturing and Global Expansion</em></p><p class=\"\">Vivos continues to collaborate with its contract manufacturer, IsoTherapeutics, recently acquired by Telix , to enhance production capacity for both Isopet™ and RadioGel®. Simultaneously, we are evaluating additional manufacturing partners in India and other regions to support global supply chain expansion.</p><p class=\"\"><em>Statement of CEO Mike Korenko</em>:</p><p class=\"\">“After years of dedicated effort, we are thrilled with these initial clinical trial results and optimistic about future findings. As the study progresses, we look forward to sharing additional updates. In parallel, we are advancing key growth initiatives to strengthen RadioGel®’s competitive position, and we will provide further updates on these technology and business developments in the coming weeks and months.”</p><p class=\"\">– <strong class=\"root-Tkn6WL2y\">Michael K. Korenko, Sc.D.</strong></p><p class=\"\">President &amp; CEO, Vivos Inc.</p><p class=\"\"><em>Follow Vivos Inc @VivosIncUSA, Radiogel</em>®<em> and Isopet</em>®<em> on X (Twitter):</em> </p><p class=\"\">For media inquiries, contact:</p><p class=\"\">Michael K. Korenko, Sc.D.</p><p class=\"\">President &amp; CEO, Vivos Inc.</p><p class=\"\">Email: MKorenko@RadioGel.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Vivos Inc. (OTCQB: RDGL)</strong></p><p class=\"\">Vivos Inc. has developed an Yttrium-90-based injectable <strong class=\"root-Tkn6WL2y\">Precision Radionuclide Therapy</strong><strong class=\"root-Tkn6WL2y\">™</strong> medical device to treat tumors in animals (IsoPet®) and humans (RadioGel®). Using the company's proprietary hydrogel technology, PRnT™ uses highly localized radiation to destroy cancerous tumors by placing a radioactive isotope directly inside the treatment area. The injection delivers therapeutic radiation from within the tumor without the entrance skin dose and associated side effects of treatment that characterize external-beam radiation therapy. This feature allows the safe delivery of higher doses needed for treating non-resectable and radiation-resistant cancers.</p><p class=\"\">RadioGel® is a hydrogel liquid containing tiny yttrium-90 phosphate microparticles that may be administered directly into a tumor. The hydrogel is a yttrium-90 carrier at room temperature that gels within the tumor interstitial spaces after injection to keep the radiation sources safely in place. The short-range beta radiation from yttrium-90 localizes the dose within the treatment area so that normal organs and tissues are not adversely affected.</p><p class=\"\">RadioGel® also has a short half-life – delivering more than 90% of its therapeutic radiation within 10 days. This compares favorably to other available treatment options requiring up to six weeks or more to deliver a full course of radiation therapy. Therapy can be safely administered as an outpatient procedure, and the patient may return home without subsequent concern for radiation dose to family members.</p><p class=\"\">University veterinary hospitals use the IsoPet® Solutions division to demonstrate animal cancers' safety and therapeutic effectiveness. Testing on feline sarcoma at Washington State University was completed in 2018, and testing on canine soft tissue sarcomas at the University of Missouri was completed in 2019. The Company has obtained confirmation from the FDA Center for Veterinary Medicine that IsoPet® is classified as a medical device according to its intended use and means by which it achieves its intended purpose. The FDA also reviewed the product labeling, which included canine and feline sarcomas as the initial indications for use. The FDA does not require pre-market approval for veterinary devices, so no additional approval was required to generate revenue through the sale of IsoPet® to University animal hospitals and private veterinary clinics.</p><p class=\"\">IsoPet® for treating animals uses the same technology as RadioGel® for treating humans. The Food and Drug Administration advised using different product names to avoid confusion and cross-use.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor Statement</strong></p><p class=\"\">This release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by the use of the words \"may,\" \"will,\" \"should,\" \"plans,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimates,\" \"projects,\" \"intends,\" and similar expressions. Forward-looking statements involve risks and uncertainties that could cause results to differ materially from those projected or anticipated. These risks and uncertainties include, but are not limited to, the Company's ability to successfully execute its expanded business strategy, including by entering into definitive agreements with suppliers, commercial partners, and customers; general economic and business conditions, effects of continued geopolitical unrest and regional conflicts, competition, changes in technology and methods of marketing, delays in completing various engineering and manufacturing programs, changes in customer order patterns, changes in product mix, continued success in technical advances and delivering technological innovations, shortages in components, production delays due to performance quality issues with outsourced components, regulatory requirements and the ability to meet them, government agency rules and changes, and various other factors beyond the Company's control.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4z092g:0-vivos-inc-reports-encouraging-human-clinical-trial-results-and-announces-expansion-plans/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6j52kL:0",
            "title": "Russell Square Breaks Ground on Delta Shores, Expanding Multifamily Housing in Sacramento",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SACRAMENTO, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Russell Square, in partnership with Jackson Square Properties, has officially broken ground on Delta Shores, a 576-unit multifamily community that will bring new housing and modern amenities to one of Sacramento’s most active growth corridors. Positioned near Interstate 5 and adjacent to the Delta Shores retail center, the development will provide residents with direct access to shopping, dining, and entertainment, as well as connectivity to the broader Sacramento region.</p><p class=\"\">“Delta Shores is a natural fit for our approach—building thoughtfully designed communities in areas primed for long-term demand,” said Andrew Schuurs, Vice President at Russell Square. “We’re bringing high-quality rental housing to a location that balances convenience, amenities, and accessibility.”</p><p class=\"\">The project includes 21 residential buildings, and two clubhouses designed in a transitional contemporary style. Residents will have access to a resort-style pool, clubhouse, fitness center, dog park, bike storage, and a golf simulator. The development is part of the larger Delta Shores master-planned community, which spans 800 acres and is entitled for more than 4,900 residential units and 1.3 million square feet of retail space.</p><p class=\"\">Russell Square serves as the general contractor for the project, delivering another high-quality, well-integrated community in California’s multifamily sector. Construction is underway, with completion expected in late 2026. Learn more about the Delta Shores project at RussellSquareInc.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Russell Square</strong></p><p class=\"\">With a focus on collaboration, vertical integration, legacy, and value, Russell Square is dedicated to creating communities that stand the test of time. Russell Square operates throughout the western United States as a licensed general contractor and real estate developer specializing in multifamily development. The company’s portfolio spans several states and includes over 2,300 apartments currently in development and construction.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/6175772d-d3fe-4e21-9f68-12799a28a7bc</p><p class=\"\">Media Contact</p><p class=\"\">Courtney Blair</p><p class=\"\">Director of Business Development</p><p class=\"\">Russell Square</p><p class=\"\">(360) 527-5349</p><p class=\"\">courtney@russellsquareinc.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Delta Shores Multifamily Property</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Designed by Jackson Square Properties in conjunction with DAHLIN Architecture | Planning | Interiors</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6j52kL:0-russell-square-breaks-ground-on-delta-shores-expanding-multifamily-housing-in-sacramento/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1MgBzv:0",
            "title": "ISC Recognized As A Saskatchewan Top Employer For 17th Consecutive Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">ISC celebrates 17 consecutive years as one of Saskatchewan’s Top Employers, highlighting its dedication to fostering an exceptional workplace.</li><li class=\"listItem-bmN0_SHH\">This recognition reflects ISC’s people-first approach, emphasizing employee well-being, career development, and work-life balance.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Key initiatives include flexible work options</strong>, robust professional development programs, and comprehensive support for employees and their families.</li></ul><p class=\"\">REGINA, Saskatchewan, Feb.  04, 2025  (GLOBE NEWSWIRE) — Information Services Corporation  (“ISC” or the “Company”) is pleased to announce its recognition as one of Saskatchewan’s Top Employers for 2025, marking the 17th consecutive year ISC has achieved this honour. This award highlights ISC's commitment to its people-first culture and reinforces its standing as a premier employer in the province.</p><p class=\"\">“Our people drive our success, and their dedication is reflected in everything we do,” said ISC President and CEO Shawn Peters. “Since the inception of ISC, we have invested in our employees’ growth and well-being, fostering an environment where they can thrive both personally and professionally.”</p><p class=\"\">The selection process, led by Canada’s Top 100 Employers, evaluates organizations across Saskatchewan based on workplace environment, health and financial benefits, employee communication, performance management, training and development, and community involvement. ISC’s commitment to its employees is reflected in its workplace programs, which promote a healthy work-life balance, encourage professional growth, and foster meaningful connections with colleagues and the community.</p><p class=\"\">Key initiatives at ISC include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A people-first culture that empowers employees to grow personally and professionally while helping our community partners extend their reach in meaningful ways;</li><li class=\"listItem-bmN0_SHH\">A comprehensive Employee Assistance Program available 24/7 to employees and their families, providing confidential support from counsellors, financial consultants, health professionals, and legal advisors;</li><li class=\"listItem-bmN0_SHH\">Flexible work arrangements and paid personal days to help employees balance their professional and personal lives effectively; and</li><li class=\"listItem-bmN0_SHH\">Robust professional development programs, including access to training, tuition reimbursement for continued education, and mentoring opportunities that support career advancement.</li></ul><p class=\"\">ISC is a proud leader in registry and information management services, with a strong commitment to fostering a supportive workplace. For more information about ISC’s employment opportunities and benefits, visit company.isc.ca/careers</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ISC</strong></p><p class=\"\">Headquartered in Canada, ISC is a leading provider of registry and information management services for public data and records. Throughout our history, we have delivered value to our clients by providing solutions to manage, secure and administer information through our Registry Operations, Services and Technology Solutions segments. ISC is focused on sustaining its core business while pursuing new growth opportunities. The Class A Shares of ISC trade on the Toronto Stock Exchange under the symbol ISC.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\">Jodi Bosnjak</p><p class=\"\">External Communications Specialist</p><p class=\"\">Toll Free: 1-855-341-8363 in North America or 1-306-798-1137</p><p class=\"\">corp.communications@isc.ca</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1MgBzv:0-isc-recognized-as-a-saskatchewan-top-employer-for-17th-consecutive-year/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6p4K9q:0",
            "title": "Duck Creek Technologies Launches End-to-End Payments Marketplace and New Integration with Paymentus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BOSTON, Feb.  04, 2025  (GLOBE NEWSWIRE) — Duck Creek Technologies, the global intelligent solutions provider defining the future of property and casualty (P&amp;C) and general insurance, announces the launch of its Payments Marketplace, a comprehensive payments ecosystem purpose-built for the global insurance industry. The Duck Creek Payments Marketplace offers seamless integration with trusted payment providers and delivers end-to-end payment management for carriers. Duck Creek announced a significant partnership with Paymentus, , a leading provider of digital payment solutions to our marketplace for ease of integration. This partnership brings billions in payment volume to the Payments Marketplace. Together, Duck Creek and Paymentus will serve several global Top 10 insurance carriers as well as large regional insurers as customers. </p><p class=\"\">Leveraging the Duck Creek Payments Orchestrator, the Payments Marketplace accelerates payment integration timelines to as little as one to two weeks—a significant improvement over the nine to 18 months typically required for direct integrations. Notably, the integration process leverages Duck Creek Payments Orchestrator, offering carriers rapid connectivity without requiring years of orchestration readiness. Duck Creek Payments Orchestrator connects insurers to global payment technologies and providers, supporting both collections and payouts, regardless of existing IT infrastructure.</p><p class=\"\">“Duck Creek continues to innovate with the launch of our Payments Marketplace, which represents a major leap forward in insurance technology and delivers security-focused, seamless payment processing for carriers and their customers,” said Allan Lacoste, Chief Payments Officer at Duck Creek Technologies. “Through strategic partnerships with industry leaders like Paymentus, we're building a robust ecosystem that empowers carriers with both payment flexibility and reliability.”</p><p class=\"\">Carriers benefit from continuous updates, robust redundancy, and enhanced customer experiences. Payments Marketplace prioritizes best practices, certifications, and a thorough vetting process for all partners. This includes adherence to rigorous security standards and seamless compatibility with Duck Creek’s SaaS core systems. </p><p class=\"\">“Through our partnership with Duck Creek, we can deliver our best-in-class electronic billing and payment solutions to a larger, more global customer base,” said Jerry Portocalis, Chief Commercial Officer of Paymentus Holdings, Inc. “Together, we’ll realize our common goal to simplify payments for carriers and help them deliver the best customer experiences for their customers.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Duck Creek Technologies</strong>  </p><p class=\"\">Duck Creek Technologies is the global intelligent solutions provider defining the future of the property and casualty (P&amp;C) and general insurance industry. We are the platform upon which modern insurance systems are built, enabling the industry to capitalize on the power of the cloud to run agile, intelligent, and evergreen operations. Authenticity, purpose, and transparency are core to Duck Creek, and we believe insurance should be there for individuals and businesses when, where, and how they need it most. Our market-leading solutions are available on a standalone basis or as a full suite, and all are available via Duck Creek OnDemand. Visit www.duckcreek.com to learn more. Follow Duck Creek on our social channels for the latest information – LinkedIn and X.   </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contacts:</strong>  </p><p class=\"\">Marianne Dempsey/Tara Stred  </p><p class=\"\">duckcreek@threeringsinc.com  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6p4K9q:0-duck-creek-technologies-launches-end-to-end-payments-marketplace-and-new-integration-with-paymentus/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX89F4YF:0",
            "title": "Cartier Announces Senior Leadership Changes as Part of a New Development Strategy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VAL-D’OR, Quebec, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">Cartier Resources Inc.</strong> (″<strong class=\"root-Tkn6WL2y\">Cartier</strong>″ or the ″<strong class=\"root-Tkn6WL2y\">Company</strong>″) (TSXV: ECR; FSE:6CA) informs that Mr. Gaétan Lavallière no longer assumes the duties of Vice-President of Cartier, effective today.</p><p class=\"\">Mr. Philippe Cloutier, President and CEO, stated: ″On behalf of the Company, I would like to sincerely thank Mr. Lavallière for his professionalism and his many contributions he has made to Cartier over the years. Mr. Lavallière led the company transition from grassroots exploration to advanced brownfields exploration and development of the Chimo Mine project. He leaves us with a solid base to continue exploring and expanding the gold potential recently acquired along the Larder Lake - Cadillac Fault Zone. We wish Mr. Lavallière continue success in his future endeavors″.</p><p class=\"\">Cartier will proceed with a reorganization of the current workload and seek candidates to fill the vacant position and contribute to execute Cartier’s new development strategy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025 Outlook:</strong></p><p class=\"\">The Company’s recent strategic planning session outlined <strong class=\"root-Tkn6WL2y\">an ambitious plan</strong> for continued exploration and development of its <strong class=\"root-Tkn6WL2y\">flagship Cadillac Project,</strong> focussed on growing the gold resources and testing the significant discovery potential along the prolific Larder Lake - Cadillac Fault Zone.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Five key elements comprise this new approach</strong>:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Apply innovative AI (Artificial Intelligence) exploration tools for target generation to complement recent high-grade gold discoveries.</li><li class=\"listItem-bmN0_SHH\">Review of the current mineral resource estimate and geological interpretation to develop a value-based targeting and development approach at the property scale.</li><li class=\"listItem-bmN0_SHH\">Reinterpret and promote the project merits within realm of recent gold price evolution.</li><li class=\"listItem-bmN0_SHH\">Design of multi-stage and aggressive exploration drill programs (100,000 m).</li><li class=\"listItem-bmN0_SHH\">Launch of key environmental baseline studies.</li></ul><p class=\"\">Additionally, and in line with the new strategy, the Company is undertaking a process to evaluate its non-core gold assets (Wilson, Fenton and Benoist), all proximal to the Windfall deposit recently acquired by Goldfields. Exploration work is on hold at these properties and Cartier is currently searching joint venture partners or buyers to maximize value creation.</p><p class=\"\">The Company would like to remind the investment community and shareholders of its<strong class=\"root-Tkn6WL2y\"> 2024 achievements</strong>, namely:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Completed the first 28,084 m exploration drilling program on the Cadillac property and<strong class=\"root-Tkn6WL2y\"> significantly increased the upside</strong> of this land package (24,679 ha), with now a minimum of <strong class=\"root-Tkn6WL2y\">10-km high-grade gold potential</strong> along the major Larder Lake – Cadillac Fault Zone.</li><li class=\"listItem-bmN0_SHH\">Discovered and/or enhanced new shallow-priority gold areas as <strong class=\"root-Tkn6WL2y\">Blue Grass</strong> <strong class=\"root-Tkn6WL2y\">(44.7 g/t Au over 0.5 m)</strong> and <strong class=\"root-Tkn6WL2y\">West Simon</strong> <strong class=\"root-Tkn6WL2y\">(7.5 g/t Au over 4.6 m)</strong>: December 17, 2024, <strong class=\"root-Tkn6WL2y\"> VG9 (11.7 g/t Au over 4.0 m) </strong>and<strong class=\"root-Tkn6WL2y\"> VG10 (173.6 g/t Au over 0.5 m)</strong>: December 3,, 2024, <strong class=\"root-Tkn6WL2y\">Portal</strong> <strong class=\"root-Tkn6WL2y\">(7.2 g/t Au over 8.0 m)</strong>: October 30, 2024, <strong class=\"root-Tkn6WL2y\">North Contact (14.7 g/t Au over 4.3 m)</strong>: October 16, 2024 and <strong class=\"root-Tkn6WL2y\">East Bateman</strong> <strong class=\"root-Tkn6WL2y\">(60.1 g/t Au over 0.5 m)</strong>: September 19, 2024.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Strengthened the Board of Directors</strong> with two strategic and leadership appointments in the mining industry, including <strong class=\"root-Tkn6WL2y\">Manuel Peiffer</strong> as Independent Director and <strong class=\"root-Tkn6WL2y\">Alain Laplante</strong> as Independent Director as well as Chair of the audit committee.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Closed</strong> a hard-cash private placement of <strong class=\"root-Tkn6WL2y\">$487,432</strong> and a flow-through private placement of <strong class=\"root-Tkn6WL2y\">$1,000,000</strong>.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Qualified Person</strong></p><p class=\"\">The scientific and technical content of this press release has been reviewed and approved by Mr. Ronan Déroff, P.Geo., M.Sc., Senior Geologist, Project Manager and Geomatician, who is a ″Qualified Person″ as defined by National Instrument 43 -101 – Standards of Disclosure for Mineral Projects.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cartier Resources Inc.</strong></p><p class=\"\">Cartier Resources Inc. was founded in 2006 and is an advanced gold project exploration company based in Val-d’Or. The company’s projects are all located in Quebec, which has consistently ranked as one of the world’s best mining jurisdictions. Cartier is advancing the development of its flagship Cadillac Project.</p><p class=\"\">For further information, contact:</p><p class=\"\">Philippe Cloutier, P. Geo.</p><p class=\"\">President and CEO</p><p class=\"\">Telephone: 819-856-0512</p><p class=\"\">philippe.cloutier@ressourcescartier.com</p><p class=\"\">www.ressourcescartier.com</p><p class=\"\">Neither the TSX Venture Exchange nor its regulatory services provider accepts responsibility for the adequacy or accuracy of this press release.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX89F4YF:0-cartier-announces-senior-leadership-changes-as-part-of-a-new-development-strategy/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6BvNcB:0",
            "title": "Athelas Strengthens Market Leadership in Strategic Partnership with Resilient Healthcare",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MOUNTAIN VIEW, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Athelas, powered by Commure, announced a strategic partnership with Resilient Healthcare Corp, a trailblazer in health-at-home solutions, to launch a groundbreaking pilot program aimed at revolutionizing outpatient care and hospital billing. By selecting Athelas as its preferred vendor for Electronic Medical Records (EMR) and Revenue Cycle Management (RCM) solutions, Resilient Healthcare is positioned to streamline acute and outpatient hospital at home programs operations, ensuring seamless integration and scalability across healthcare systems. This strategic move strengthens Resilient Healthcare's market dominance in delivering comprehensive health-at-home solutions.</p><p class=\"\">The initial phase of the partnership will involve a pilot program, where Athelas will provide RCM services, Ambient AI support, and EMR integration to Resilient Community’s AI platform, RAIN. Resilient will pilot the combined technology with various hospital clients. The goal of this pilot is to demonstrate the effectiveness of offloading outpatient services and billing from traditional hospital systems, using cutting-edge software integration and seamless data exchange while driving care delivery to patient homes. Combining Resilient Healthcare’s innovative health-at-home solutions and technology with Athelas’ advanced EMR and RCM technologies sets a new standard for integrated healthcare solutions. The partnership agreement is designed to adapt and scale with Resilient Healthcare’s expansion into new hospital systems, supporting consistent service delivery and compliance.</p><p class=\"\">For more information or to learn more about this partnership, please visit https://www.resilienthc.com or https://www.athelas.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Transforming Hospital-from-Home Care</strong></p><p class=\"\">\"Athelas is thrilled to partner with Resilient Healthcare to expand access to high-quality, innovative technology to provide the best patient care possible,\" said Tanay Tandon, CEO at Athelas. \"Together, we empower healthcare providers with the tools they need to effectively deliver health-at-home care for improved patient outcomes and operational efficiency.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Looking Ahead: A Vision for Growth</strong></p><p class=\"\">\"We are excited to partner with Athelas to bring innovative, AI-driven solutions to the forefront of patient care,\" said Dr. Jackleen Samuel-Kloes, CEO of Resilient Healthcare Corp. \"At Resilient, our mission is to provide proactive, personalized healthcare that improves patient outcomes and enhances the efficiency of care delivery in the home. This partnership with Athelas allows us to leverage cutting-edge technology to support our patients better and empower our healthcare teams to deliver exceptional care.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Athelas/Commure</strong></p><p class=\"\">Athelas/Commure is a leading healthcare technology company specializing in revenue cycle management, ambient AI, and electronic medical record solutions that streamline healthcare operations and improve patient outcomes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Resilient Healthcare Corp</strong></p><p class=\"\">Resilient Healthcare Corp is a pioneering health-at-home solutions company that provides outpatient physical therapy, primary care, and acute care services on behalf of hospitals across the U.S. Their innovative care model delivers quality healthcare in the comfort of patients' homes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\">Dr. Jackleen Samuel-Kloes</p><p class=\"\">CEO</p><p class=\"\">Resilient Healthcare Corp</p><p class=\"\">972.528.9079 </p><p class=\"\">jackleen@resilienthc.org</p><p class=\"\">Media:</p><p class=\"\">Kaila Grafeman</p><p class=\"\">Commure</p><p class=\"\">pr@augmedix.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6BvNcB:0-athelas-strengthens-market-leadership-in-strategic-partnership-with-resilient-healthcare/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXlmBTd:0",
            "title": "Aqua Metals Expands Vision for Commercial Giga-Scale Lithium Battery Recycling – More than Doubling the Output of Battery Grade Lithium at Sierra ARC Phase 1",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RENO, Nev., Feb.  04, 2025  (GLOBE NEWSWIRE) — Aqua Metals, Inc. , a pioneer in sustainable lithium battery recycling, today announced an accelerated pathway intended to increase revenue and margin at its planned commercial-scale AquaRefining™ facility at the Tahoe-Reno industrial center. To streamline market entry, optimize capital efficiency, scale core patented and licensable technology, and meet evolving customer demands, the Company intends to prioritize the production of battery grade lithium carbonate, more than doubling the initial production targets. Mixed Hydroxide Precipitate (MHP), a widely traded, high-value nickel and cobalt product, along with copper and manganese, will make up the rest of its product suite at its Sierra ARC recycling campus.</p><p class=\"\">This near-term focus should enable faster and larger revenue generation, additional technology validation at scale, and expanded industry partnership potential while maintaining a clear roadmap for scaling toward high-purity metal refining that will eventually complement the lithium carbonate production.</p><p class=\"\">Aqua Metals’ Strategy for Scaling a Low-Cost, Decarbonized Critical Minerals Supply Chain, while Creating Highly Desirable Jobs</p><p class=\"\">Aqua Metals has already proven its ability to recover battery grade lithium as well as high purity nickel and cobalt from spent batteries and manufacturing scrap at its pilot facility. By prioritizing lithium carbonate and MHP production, the Company believes it can accelerate commercialization, reduce remaining capital requirements to complete the Sierra ARC, and position itself as a key supplier of domestic, low-carbon, battery-grade materials. The scalable nature of AquaRefining™ is the basis upon which Aqua Metals believes that full metal refining remains within reach as part of future scaling. The Company will continue qualifying battery-grade materials with its pilot program and through ongoing engagements with OEMs, cell, and CAM manufacturers.</p><p class=\"\">“We are taking a smart, market-driven approach that we believe will allow us to scale faster, generate revenue sooner, and strengthen our position in the domestic critical minerals supply chain,” said Steve Cotton, CEO of Aqua Metals. “Our proven technology can already refine MHP into pure metals, but prioritizing a higher-throughput facility should allow us to increase the production of our highest margin material, battery grade lithium carbonate. This plan is designed to accelerate commercialization while maintaining full compatibility with our long-term vision for battery-grade materials that close the loop domestically.”</p><p class=\"\">Optimized Strategy for Near-Term Growth &amp; Long-Term Market Leadership</p><p class=\"\">Aqua Metals' updated strategy reflects the Company's ability to adapt to market conditions while staying focused on long-term goals:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Faster Path to Market, Lower CAPEX</strong> – Prioritizing lithium carbonate along with MHP as the product suite should reduce capital and operational intensity, enable a larger-scale facility that generates more revenue at a higher margin than our previous design – and achieve an attractive ~3 year payback even at today’s lower metals prices.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Strengthened Industry Partnerships</strong> – Aqua Metals is in active discussions with feedstock suppliers and offtake partners, aligning with this accelerated commercialization and product suite plan.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future-Ready, Modular Expansion</strong> – The Company’s scalable technology should provide an easy transition to refining battery-grade nickel and cobalt sulfates and lithium hydroxide as market conditions and partner demand evolve.</li></ul><p class=\"\">Aqua Metals is continuing its engagement with several prospective financial backers, feedstock supply, and off-take partners, and expects to be able to provide updates later in Q1.</p><p class=\"\">To listen to a Q&amp;A on this topic visit our blog here: https://aquametals.com/blog/</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:800.1863932898415px;aspect-ratio:1.3336439888164024\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNXlmBTd-adf2b56a7eca54a94aa5d53cab401cbc-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNXlmBTd-adf2b56a7eca54a94aa5d53cab401cbc-resized.jpeg\" style=\"background-color:#90948f\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"description-S5VA5POt\">Aqua Metals team standing with battery grade lithium produced at the Pilot facility in Tahoe-Reno Industrial Center</span></figcaption></figure></span></p><p class=\"\"></p><p class=\"\">Rendering of Sierra ARC campus with layout to support Lithium Carbonate and MHP production along with future AquaRefining™ to metals</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aqua Metals</strong></p><p class=\"\">Aqua Metals, Inc.  is reinventing metals recycling with its patented AquaRefining™ technology. The Company is pioneering a sustainable recycling solution for materials strategic to energy storage and electric vehicle manufacturing supply chains. AquaRefining™ is a low-emissions, closed-loop recycling technology that replaces polluting furnaces and hazardous chemicals with electricity-powered electroplating to recover valuable metals and materials from spent batteries with higher purity, lower emissions, and minimal waste. Aqua Metals is based in Reno, NV and operates the first sustainable lithium battery recycling facility at the Company’s Innovation Center in the Tahoe-Reno Industrial Center. To learn more, please visit www.aquametals.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aqua Metals Social Media</strong></p><p class=\"\">Aqua Metals has used, and intends to continue using, its investor relations website (https://ir.aquametals.com), in addition to its Twitter, Threads, LinkedIn and YouTube accounts at https://twitter.com/AquaMetalsInc (@AquaMetalsInc), https://www.threads.net/@aquametalsinc (@aquametalsinc), https://www.linkedin.com/company/aqua-metals-limited and https://www.youtube.com/@AquaMetals respectively, as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor</strong></p><p class=\"\">This press release contains forward-looking statements concerning Aqua Metals, Inc. Forward-looking statements include, but are not limited to, our plans, objectives, expectations and intentions and other statements that contain words such as \"expects,\" \"contemplates,\" \"anticipates,\" \"plans,\" \"intends,\" \"believes\", \"estimates\", \"potential\" and variations of such words or similar expressions that convey the uncertainty of future events or outcomes, or that do not relate to historical matters. The forward-looking statements in this press release include our expectations for our pilot and commercial-scale recycling plants, our acquisition of the necessary funding to fully develop the Sierra ARC facility, our ability to recycle lithium-ion batteries on a scaled and economically efficient basis and the expected benefits of recycling lithium-ion batteries. Those forward-looking statements involve known and unknown risks, uncertainties, and other factors that could cause actual results to differ materially, including, but not limited to, (1) the risk that we may not be able to successfully acquire the funding necessary to develop our Sierra ARC facility, (2) even if we are to able acquire the necessary funding, the risk we may not be able to successfully develop the Sierra ARC facility or realize the expected benefits from such facility; (3) the risk that we may not be able to acquire the funding necessary to maintain our current level of operations; and (4) those risks disclosed in the section \"Risk Factors\" included in our Annual Report on Form 10-K filed on March 28, 2024. Aqua Metals cautions readers not to place undue reliance on any forward-looking statements. The Company does not undertake and specifically disclaims any obligation to update or revise such statements to reflect new circumstances or unanticipated events as they occur, except as required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Investor Relations</p><p class=\"\">Bob Meyers &amp; Rob Fink</p><p class=\"\">FNK IR</p><p class=\"\">646-878-9204</p><p class=\"\">aqms@fnkir.com</p><p class=\"\">Media</p><p class=\"\">David Regan</p><p class=\"\">Aqua Metals</p><p class=\"\">415-336-3553</p><p class=\"\">david.regan@aquametals.com</p><p class=\"\">Photos accompanying this announcement are available at: </p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/696afff5-3463-4487-8de6-9eb1f6c27216</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/2434d814-11ab-4948-a847-c95ecbc380ff</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AQMS team with lithium</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Aqua Metals team standing with battery grade lithium produced at the Pilot facility in Tahoe-Reno Industrial Center</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sierra ARC Rendering</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Rendering of Sierra ARC campus with layout to support Lithium Carbonate and MHP production along with future AquaRefining to metals</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXlmBTd:0-aqua-metals-expands-vision-for-commercial-giga-scale-lithium-battery-recycling-more-than-doubling-the-output-of-battery-grade-lithium-at-sierra-arc-phase-1/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX88lC5y:0",
            "title": "2025 Best of Insurance™ Award Winners Achieve Superior Ratings for Client Experience",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PORTLAND, Ore., Feb.  04, 2025  (GLOBE NEWSWIRE) — ClearlyRated®, a leading provider of client and employee satisfaction surveys and service quality research for professional service providers in the U.S. and Canada, announced the winners of their second annual Best of Insurance™ award today on ClearlyRated.com.</p><p class=\"\">The 2025 Best of Insurance award recognizes service leaders in the insurance industry based exclusively on satisfaction ratings provided by their clients. Utilizing a transparent, validated, and unbiased approach to measuring the client experience, Best of Insurance winners have proven that the service they deliver outpaces the rest of the industry. Clients who work with the 2025 Best of Insurance winners are 50% more likely to be completely satisfied with the services provided than the 2024 industry average. Fewer than 1% of all insurance firms in the U.S. and Canada achieve Best of Insurance.</p><p class=\"\">\"The remarkable achievements of our 2025 Best of Insurance winners deserve the highest recognition,\" said ClearlyRated CEO, Baker Nanduru. \"These industry leaders have proven through independently verified service ratings that excellence isn't just a goal—it's their standard operating procedure. As we celebrate this year's honorees, we're inspired by their commitment to consistently delivering exceptional experiences that shape the future of the insurance industry.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ClearlyRated</strong></p><p class=\"\">ClearlyRated is a leading provider of client satisfaction surveys and service quality research for commercial insurance brokers and other professional service firms. We help firms leverage the Net Promoter® Score survey methodology to gain deep insights, identify strengths and weaknesses, fuel data-driven action, build reputation and future-proof their organizations with third-party validation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Best of Insurance</strong></p><p class=\"\">The Best of Insurance Award is the only award in the U.S. and Canada that recognizes commercial insurance providers that have proven superior service quality based entirely on ratings provided by their clients. Award winners are showcased by city and area of expertise on ClearlyRated.com—an online business directory that helps buyers of professional services find service leaders and vet prospective firms with the help of validated client ratings and testimonials.</p><p class=\"\">Net promoter, NPS, and Net Promoter Score are trademarks of Satmetrix Systems, Inc., Bain &amp; Company, and Fred Reichheld.</p><p class=\"\">Contact</p><p class=\"\">Stephen Banbury, VP of Marketing</p><p class=\"\">P (503) 977-6295</p><p class=\"\">stephen.banbury@clearlyrated.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX88lC5y:0-2025-best-of-insurance-award-winners-achieve-superior-ratings-for-client-experience/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9dD3TS:0",
            "title": "Rezolute Provides Update on its Phase 3 sunRIZE Study of Ersodetug for the Treatment of Hypoglycemia Due to Congenital Hyperinsulinism",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Open-label arm (infant participants &lt; 1 year old) has been recently reviewed by a Data Monitoring Committee (DMC) and target drug concentrations were safely reached at tested doses</p><p class=\"\"> DMC approved enrollment of infants into the double-blind portion of the study</p><p class=\"\">sunRIZE enrollment completion expected in Q2 2025, subject to outcomes from upcoming interim analysis</p><p class=\"\">REDWOOD CITY, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — <!-- -->Rezolute, Inc.  (“Rezolute” or the “Company”), a late-stage biopharmaceutical company dedicated to developing transformative therapies for rare diseases with serious unmet needs, today announced outcomes from an independent Data Monitoring Committee (DMC) review of the open label arm (OLA) portion of the sunRIZE Phase 3 study of ersodetug for the treatment of hypoglycemia due to congenital hyperinsulinism (HI) and provided additional study updates including guidance on its upcoming interim analysis (IA) by the DMC. This IA will assess the adequacy of the sample size for the primary endpoint and may recommend adjustments if necessary.</p><p class=\"\">The open label arm of 8 infant participants ages 3 months to 1 year has been fully enrolled and accrued sufficient data for the DMC to review the safety and pharmacokinetics (PK) of ersodetug, which was administered at doses of 5 or 10 mg/kg over a bi-weekly loading phase followed by a monthly maintenance phase. The task of the DMC was to independently review the safety and PK data in infants for purposes of dose confirmation, continued benefit-risk determinations, and the appropriateness of opening enrollment of the double-blind portion of the study to infant participants at the dose regimen under study. The DMC did not review glycemic efficacy and the Company remains blinded to glucose results and efficacy outcomes.</p><p class=\"\">Findings from the DMC include the following:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Ersodetug was generally safe and well-tolerated in participants 3 months to 1 year of age.</li><li class=\"listItem-bmN0_SHH\">Observed ersodetug drug levels at peak and trough were comparable to exposures in older pediatric participants in the Phase 2b RIZE study, which were demonstrated to be effective.</li><li class=\"listItem-bmN0_SHH\">Safety and exposures validate the chosen dose regimen of 5 and 10 mg/kg administered bi-weekly and monthly.</li><li class=\"listItem-bmN0_SHH\">Subsequent infant participants may now be enrolled into the double-blind, placebo-controlled study.</li></ul><p class=\"\">“We are encouraged by these preliminary outcomes from the open label arm of the sunRIZE study, particularly as it is a strong indication of the safety profile of ersodetug and provides additional validation of the selected doses in very young participants,” said Brian Roberts, M.D., Chief Medical Officer at Rezolute. “Having recently received Breakthrough Therapy Designation from the FDA, 2025 has already been an exciting year for Rezolute and we look forward to additional milestones over the course of this year as we progress in our mission to provide a safe and effective therapy for people living with hyperinsulinism.”</p><p class=\"\">Study start up activities in the U.S. have progressed and sites are expected to be activated and enrolling this quarter. Study enrollment completion is anticipated in the second quarter of 2025 and topline results are expected in the fourth quarter of 2025, pending recommendations from the DMC based on an upcoming IA.</p><p class=\"\">An IA of the study primary hypoglycemia endpoint is being conducted following the accumulation of sufficient patient data and is designed to optimize the study sample size and statistical confidence in the final analysis outcomes. The IA will be conducted at the end of this quarter and the Company plans to announce the conclusions of the DMC early in the second quarter of 2025 while also providing additional overall study updates. There are three possible outcomes from the analysis: (i) futility and the study should be stopped, (ii) continue the study as is or (iii) continue the study as is but increase the sample size by 33% (18 additional patients) to enhance statistical confidence in the final outcome.</p><p class=\"\">If the study sample size is increased, the Company estimates completion of enrollment would shift to the fourth quarter of 2025 and that top line results would be available in mid-2026. Other than for futility, the outcomes of the IA should not be viewed as a read-through to end of study efficacy, either favorably or unfavorably.</p><p class=\"\">For more information on our pipeline and the sunRIZE study, please visit www.rezolutebio.com/for-patients/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Congenital Hyperinsulinism</strong></p><p class=\"\">Congenital hyperinsulinism (HI) is the most common cause of recurrent and persistent hypoglycemia in children. Patients with congenital HI typically present with signs or symptoms of hypoglycemia within the first month of life. These episodes can result in significant brain injury and death if not recognized and managed appropriately. Additionally, recurrent, or cumulative, hypoglycemia can lead to progressive and irreversible damage over time, including serious and devastating brain injury, seizures, neuro-developmental problems, feeding difficulties, and significant impact on patient and family quality of life. In cases of congenital HI that are unresponsive to medical management, surgical removal of the pancreas may be required. More than half of children with congenital HI require long-term medical treatment for hypoglycemia that is not addressed by available therapies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Ersodetug</strong></p><p class=\"\">Ersodetug is a fully human monoclonal antibody that binds allosterically to the insulin receptor to counteract the effects of insulin receptor over-activation by insulin and related substances (such as IGF-2), thereby shifting over-signaling back into a more normalized range and improving hypoglycemia in the setting of hyperinsulinism (HI). Because ersodetug acts downstream from the pancreas, it has the potential to be universally effective at treating hypoglycemia due to any congenital or acquired form of HI.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About sunRIZE</strong></p><p class=\"\">The Phase 3 sunRIZE study is a multi-center, randomized, double-blind, placebo-controlled, parallel arm study designed to evaluate the efficacy and safety of ersodetug in patients with congenital HI who are experiencing poorly controlled hypoglycemia. Participants between the ages of 3 months to 45 years old are eligible to participate. The study is enrolling up to 56 participants in more than a dozen countries around the world.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Rezolute, Inc.</strong></p><p class=\"\">Rezolute is a late-stage rare disease company focused on significantly improving outcomes for individuals with hypoglycemia caused by hyperinsulinism (HI). The Company’s antibody therapy, ersodetug, is designed to treat all forms of HI and has shown substantial benefit in clinical trials and real-world use for the treatment of congenital HI and tumor HI. For more information, visit www.rezolutebio.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This release, like many written and oral communications presented by Rezolute and our authorized officers, may contain certain forward-looking statements regarding our prospective performance and strategies within the meaning of Section 27A of the Securities Act and Section 21E of the Securities Exchange Act of 1934, as amended. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 and are including this statement for purposes of said safe harbor provisions. Forward-looking statements, which are based on certain assumptions and describe future plans, strategies, and expectations of Rezolute, are generally identified by use of words such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"plan,\" \"project,\" \"seek,\" \"strive,\" \"try,\" “potential,” or future or conditional verbs such as \"could,\" \"may,\" \"should,\" \"will,\" \"would,\" or similar expressions. These forward-looking statements include but are not limited to statements regarding the efficacy of ersodetug in patient populations of 3 months to 1 year of age, the DMC approval of enrollment of infants into a double-blind control study of ersodetug, the FDA’s grant of the Breakthrough Therapy Designation for ersodetug, the ability of ersodetug to become an effective treatment for congenital hyperinsulinism, the effectiveness or future effectiveness of ersodetug for the treatment of congenital hyperinsulinism, statements regarding clinical trial timelines for ersodetug, the timing of the Phase 3 sunRIZE study. Our ability to predict results or the actual effects of our plans or strategies is inherently uncertain. Accordingly, actual results may differ materially from anticipated results. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this release. Except as required by applicable law or regulation, Rezolute undertakes no obligation to update these forward-looking statements to reflect events or circumstances that occur after the date on which such statements were made. Important factors that may cause such a difference include any other factors discussed in our filings with the SEC, including the Risk Factors contained in Rezolute’s Annual Report on Form 10-K and Quarterly Reports on Form 10-Q, which are available on the SEC’s website at www.sec.gov. You are urged to consider these factors carefully in evaluating the forward-looking statements in this release and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by this cautionary statement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Rezolute, Inc.</strong></p><p class=\"\">Christen Baglaneas</p><p class=\"\">cbaglaneas@rezolutebio.com</p><p class=\"\">508-272-6717</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9dD3TS:0-rezolute-provides-update-on-its-phase-3-sunrize-study-of-ersodetug-for-the-treatment-of-hypoglycemia-due-to-congenital-hyperinsulinism/",
            "pub_date": "2025-02-04 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2scVl0:0",
            "title": "REC Solar Appoints Colin Temme to General Counsel",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SAN LUIS OBISPO, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — REC Solar, a leading nationwide developer of on-site solar and storage projects, has hired Colin Temme as General Counsel. Temme brings over a decade of experience in renewable energy, sustainable infrastructure and project finance and will provide legal advice and guidance to the Company as it grows its footprint and customer base across the U.S.</p><p class=\"\">Temme joins REC Solar from Generate Capital, where he served as Associate General Counsel, structuring and negotiating mergers, acquisitions and project financing for community solar and fuel cell assets. He also led debt and equity investment strategies supporting sustainable infrastructure development, spanning community and utility-scale solar, microgrids, energy efficiency and fiber networks. Before that, Temme was Assistant General Counsel at The AES Corporation, where he played a key role in structuring and negotiating distributed generation solar and solar-plus-storage projects. He also built and led a legal team dedicated to AES’ distributed generation solar business.</p><p class=\"\">“Colin is a terrific addition to the REC Solar team and its leadership. His experience in renewable energy and sustainable infrastructure, combined with his proven track record in legal leadership, will be a huge asset as we continue to grow in the solar industry,” said Robb Jetty, CEO of REC Solar. “We’re confident his expertise will help us navigate opportunities and challenges ahead to deliver even more value to our customers.”</p><p class=\"\">\"I am thrilled to join the REC Solar team to help grow the business and shape its future,\" said Colin Temme, General Counsel. \"From my first interactions with REC Solar, I was drawn to the company’s strategy, direction and culture. The leadership team’s vision aligns with my professional experience, and I am excited to contribute from day one while embracing new challenges in this role.\"</p><p class=\"\">This appointment is pivotal for REC Solar as it grows its business in tandem with the U.S. solar market and navigates a new policy environment. With energy demand rising by 2% annually, experts predict that the U.S. solar industry will grow by 34% in 2025 and by 17% in 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About REC Solar</strong></p><p class=\"\">Founded in 1997, REC Solar is a trusted leader in solar energy integration, delivering high-quality solar and energy storage solutions to businesses, universities, municipalities and more. REC Solar offers a seamless experience, from zero-upfront-cost financing to long-term ownership, operation and maintenance of solar projects. With decades of expertise, REC Solar is committed to providing every customer the same integrity and high-quality solutions and services that have made it a trusted solar company for the past 25+ years. Learn more about REC Solar at recsolar.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media inquiries: </strong></p><p class=\"\">recsolar@fischtankpr.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2scVl0:0-rec-solar-appoints-colin-temme-to-general-counsel/",
            "pub_date": "2025-02-04 21:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308758:0",
            "title": "Citigroup Adjusts Price Target on Tyson Foods to $59 From $61, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tyson Foods  has an average rating of hold and mean price target of $64.55, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308758:0/",
            "pub_date": "2025-02-04 20:52:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308759:0",
            "title": "Stifel Adjusts Price Target on Equity Residential to $82.25 From $85, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equity Residential  has an average rating of overweight and mean price target of $77.70, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308759:0/",
            "pub_date": "2025-02-04 20:52:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:bf53642e9c01c:0",
            "title": "LANCASTER COLONY CORP SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lancaster Colony Corp, a leading manufacturer and marketer of specialty food products, has released its Form 10-Q report for the second quarter of fiscal year 2024. The report provides a comprehensive overview of the company's financial and operational performance, showcasing growth in key segments and strategic initiatives aimed at enhancing production capabilities and market reach.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Sales:</strong> $509.3 million, increased 4.8% from the prior year, driven by higher net sales in both Retail and Foodservice segments.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gross Profit:</strong> $132.8 million, increased by $11.3 million due to higher sales volumes, favorable sales mix, and cost savings initiatives.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $75.7 million, increased by $9.9 million, reflecting higher gross profit despite increased SG&amp;A expenses.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income:</strong> $48.993 million, decreased by 4.8% from the prior year, impacted by a one-time pension settlement charge.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income Per Common Share:</strong> $1.78, decreased by $0.09, affected by the pension settlement charge and costs related to the planned Atlanta plant acquisition.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Retail Segment:</strong> Saw a 6.3% increase in net sales for the three months ended December 31, 2024, driven by higher sales volumes from both licensing programs and own brands. Key contributors included Texas Roadhouse® dinner rolls, Buffalo Wild Wings® sauces, Subway® sauces, and Olive Garden® dressings.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Foodservice Segment:</strong> Experienced a 3.0% growth in net sales for the three months ended December 31, 2024, primarily due to increased demand from national chain restaurant accounts and growth in Marzetti® branded Foodservice products.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Sales Units</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Retail Segment:</strong> Sales volumes increased by 6.0% for the three months ended December 31, 2024, with a notable 7.4% increase when excluding the exited perimeter-of-the-store bakery product lines.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Foodservice Segment:</strong> Sales volumes rose by 1.5% for the three months ended December 31, 2024, reflecting increased demand from national chain restaurant accounts.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">New Product Launches</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The Retail segment benefited from the introduction of new products such as Texas Roadhouse® dinner rolls and gluten-free New York BRAND® Bakery frozen garlic bread, contributing to sales growth.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">New Production Initiatives</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The company completed a significant capacity expansion project at the Marzetti dressing and sauce facility in Horse Cave, Kentucky, in March 2023, enhancing production capabilities.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The company anticipates continued growth in Retail sales driven by an expanding licensing program and innovation in own brands. In the Foodservice segment, volume growth is expected from select national chain restaurant accounts.</li><li class=\"listItem-bmN0_SHH\">The planned acquisition of a sauce and dressing production facility in Atlanta is expected to enhance operational efficiency, provide incremental capacity, and improve proximity to core customers.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/57515/000005751525000005/lanc-20241231.htm\" rel=\"nofollow\" target=\"_blank\">LANCASTER COLONY CORP [ LANC ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:bf53642e9c01c:0-lancaster-colony-corp-sec-10-q-report/",
            "pub_date": "2025-02-04 20:53:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:e06dd279a96ce:0",
            "title": "IES Holdings, Inc. SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IES Holdings, Inc., a diversified holding company with a focus on electrical contracting and infrastructure solutions, has released its Form 10-Q report for the third quarter. The report highlights significant growth in both financial and operational metrics, driven by robust demand across various segments and improved operational efficiencies.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenues:</strong> $749.5 million, an increase of 18.1% compared to the same period last year, driven by growth across all operating segments.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gross Profit:</strong> $178.0 million, representing 23.8% of revenues, up from 22.7% in the prior year, reflecting improved project execution and reduced material costs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $74.6 million, or 10.0% of revenues, compared to 9.1% in the prior year, indicating enhanced operational efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income:</strong> $57.7 million, or 7.7% of revenues, up from 6.9% in the prior year, driven by increased revenues and improved margins.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Diluted EPS:</strong> $2.72, compared to $1.87 in the prior year, reflecting higher net income attributable to common stockholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Communications:</strong> Revenues increased by 36.4% due to heightened demand from data center customers.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Residential:</strong> Experienced a modest revenue increase of 1.3%, driven by a 10.5% rise in multi-family business revenues, despite a decline in single-family electrical revenues.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Infrastructure Solutions:</strong> Revenues surged by 71.9%, largely due to strong demand in custom engineered solutions and contributions from the acquisition of Greiner Industries.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Commercial &amp; Industrial:</strong> Revenues grew by 4.2%, reflecting strong demand and effective backlog execution.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Geographical Performance:</strong> The report highlights strong demand in key end markets such as data centers, which are likely influenced by regional economic conditions and infrastructure needs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> The company anticipates continued strong demand in data center markets, although challenges such as labor availability and capacity constraints may impact growth. The Residential segment faces potential headwinds from high mortgage rates and inflation affecting housing affordability, while the multi-family segment may see reduced revenues due to higher borrowing costs for project owners.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1048268/000104826825000031/iesc-20241231.htm\" rel=\"nofollow\" target=\"_blank\">IES Holdings, Inc. [ IESC ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:e06dd279a96ce:0-ies-holdings-inc-sec-10-q-report/",
            "pub_date": "2025-02-04 20:53:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        }
    ]
}