{
    "data": [
        {
            "id": "tradingview:542b6b30252b6:0",
            "title": "Fabrinet SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fabrinet, a leading provider of advanced optical packaging and precision optical, electro-mechanical, and electronic manufacturing services, has released its latest Form 10-Q report, showcasing robust financial and operational performance for the quarter ended December 27, 2024. The report highlights significant growth in revenue and profitability, driven by strong demand across multiple geographic regions and effective cost management strategies.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Fabrinet reported impressive financial results for the quarter, reflecting its strong market position and operational efficiency:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenues:</strong> $833.6 million, a substantial increase from $712.7 million in the same quarter last year, driven by strong demand across multiple geographic regions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Profit:</strong> $100.8 million, up from $88.3 million, indicating improved efficiency and cost management.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $79.6 million, compared to $69.0 million in the prior year, showcasing effective control over operating expenses.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income:</strong> $86.6 million, an increase from $69.1 million, highlighting strong overall financial performance.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Basic EPS:</strong> $2.40, up from $1.90, reflecting the company's ability to generate higher earnings per share.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Diluted EPS:</strong> $2.38, compared to $1.89, indicating improved profitability on a per-share basis.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\">Fabrinet's business performance for the quarter was marked by strong demand across its key segments and regions:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments:</strong> The company reported that 77.6% of its revenue for the three months ended December 27, 2024, came from optical communications, with datacom and telecom contributing significantly. Non-optical communications, including automotive and industrial lasers, accounted for 22.4% of the revenue.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance:</strong> For the three months ended December 27, 2024, 44.7% of the company's revenue was generated from North America, 47.3% from Asia-Pacific and others, and 8.0% from Europe. The increase in North American revenue was primarily due to higher sales to a customer in the United States.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance:</strong> The percentage of revenue from regions outside North America decreased to 55.3% in the three months ended December 27, 2024, compared to 66.1% in the same period the previous year, indicating a shift towards more revenue being generated from North America.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> The company expects the portion of future revenues attributable to customers in regions outside North America for the remainder of fiscal year 2025 to be in line with the portion of revenues during the six months ended December 27, 2024.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Challenges:</strong> The company anticipates continued disruptions in its supply chain and fluctuations in the availability of parts and materials, which may adversely impact revenue generation despite strong customer demand.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Challenges:</strong> The company is experiencing a near-term inventory correction among its optical communications customers, which is expected to persist and impact revenue generation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Employee Costs:</strong> The company expects employee costs to increase in Thailand and the PRC due to rising wages, which may impact its competitive advantage and profit margins.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Expansion Plans:</strong> The company plans to expand its manufacturing capacity into new geographic markets, which is expected to incur incremental costs of revenue.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Foreign Exchange Impact:</strong> The company is exposed to foreign exchange risk, primarily with respect to the Thai baht, and uses derivative instruments to manage these risks. The appreciation of the Thai baht against the U.S. dollar could negatively impact financial results.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Contracts and Supply Agreements:</strong> The company enters into supply agreements with customers that typically have an initial term of up to three years, with automatic renewals. These agreements include provisions for pricing, consignment of production equipment, and cost-saving benefit sharing.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1408710/000140871025000008/fn-20241227.htm\" rel=\"nofollow\" target=\"_blank\">Fabrinet [ FN ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:542b6b30252b6:0-fabrinet-sec-10-q-report/",
            "pub_date": "2025-02-04 19:23:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308511:0",
            "title": "Earnings Flash (CRVL) CorVel Posts Fiscal Q3 Revenue $228 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308511:0/",
            "pub_date": "2025-02-04 19:23:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003659:0",
            "title": "U.K. Grocery Inflation Slows as Supermarkets Bet on Discounts, Report Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Michael Susin</p><p class=\"\">U.K. grocery inflation fell in January as intense promotional activity provided some relief for budget-pressured households.</p><p class=\"\">Annual grocery inflation fell to 3.3% for the four weeks to Jan. 26 compared with the previous year. This followed 3.7% grocery inflation recorded in December, according to the latest report from research firm Kantar.</p><p class=\"\">Kantar said take-home grocery sales rose by 4.3% on year, and nearly one third of this spending was on promotions.</p><p class=\"\">Consumers are also ditching brand names and prioritizing keeping costs down, with private-label sales proportionally reaching a record high of more than half of sales in January.</p><p class=\"\">Following the Christmas festivities and related excesses, January's sales were also marked by an increase in wellness trends, with more than 10% of the average consumer's bill spent on fresh staples such as fruit, vegetables and salad.</p><p class=\"\">Sales of low-and-no alcohol drinks were 7% higher than the same period a year prior, as the \"dry January\" trend becomes increasingly popular among older shoppers.</p><p class=\"\">Among the top-performing grocers over the 12 weeks to Jan. 26, sales of the German discounter Lidl rose 7.4% and reached three consecutive years of growth, holding a market share of 7.2%.</p><p class=\"\">Online retailer Ocado was the fastest-growing grocer for the ninth consecutive month, with sales up 11.3% and a 1.9% market share.</p><p class=\"\">The U.K.'s largest grocer, Tesco, achieved a market share of 28.5% and saw a 5.6% rise in sales.</p><p class=\"\">Write to Michael Susin at michael.susin@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003659:0-u-k-grocery-inflation-slows-as-supermarkets-bet-on-discounts-report-says/",
            "pub_date": "2025-02-04 19:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003660:0",
            "title": "Centene 4Q Revenue Grows at Higher Clip Than Wall Street Predicted",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Denny Jacob</p><p class=\"\">Centene posted higher fourth-quarter revenue than a year earlier, with results coming in above what Wall Street had forecast.</p><p class=\"\">The St. Louis health insurer logged earnings of $283 million, or 56 cents a share, up from $45 million, or 8 cents a share, a year earlier.</p><p class=\"\">Stripping out certain one-time items, earnings came in at 80 cents a share. Analysts polled by FactSet expected 49 cents a share.</p><p class=\"\">Revenue rose to $40.81 billion from $39.46 billion. Analysts polled by FactSet expected $39.36 billion.</p><p class=\"\">Centene said premium and services revenues increased 3% to $36.3 billion, driven primarily by Medicaid rate increases and membership growth.</p><p class=\"\">Write to Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003660:0/",
            "pub_date": "2025-02-04 19:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463452:0",
            "title": "Emirati Stocks Close Higher as Global Investors Weigh Looming Trade War",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Markets in the United Arab Emirates were in the green on Tuesday's close, with investors treading cautiously amid escalating trade tensions between the world's two largest economies. </p><p class=\"\">At close of trading, the FTSE ADX General Index increased 0.091%, while the DFM General Index added 0.701%. </p><p class=\"\">US President Donald Trump's 10% duty on Chinese goods prompted Beijing to retaliate with targeted tariffs on US goods, with several US companies now under scrutiny for potential sanctions, Reuters reported. Analysts flagged concerns over Trump's broader tariff measures on Canada, Mexico, and China, warning of their impact on US economic growth. </p><p class=\"\">\"The increase in China tariffs alone makes this the biggest single tariff increase Trump has enacted in either of his presidential terms. If these tariffs fully take effect, their size will dwarf the entirety of the tariffs Trump imposed during his first term in office,\" Nomura Global Markets Research said in a note. \"Higher tariffs are likely to push up core inflation meaningfully, which reinforces our Fed call of no rate cuts this year,\" analysts added. </p><p class=\"\">Back in the UAE, Borouge (ADX:BOROUGE) posted an increase in attributable profit for full-year 2024, while revenue jumped year over year. The Abu Dhabi-listed petrochemicals company rose 0.394%. </p><p class=\"\">Meanwhile, tech-focused investor Multiply Group (ADX:MULTIPLY) closed 0.939% in the red after it swung to a loss in full-year 2024. Revenue, however, surged year over year. </p><p class=\"\">Elsewhere, Shuaa Capital (DFM:SHUAA) secured a favorable court ruling in a case brought by a former board member seeking 22 million Emirati dirhams in labor dues. The Dubai-listed financial services company fell 1.961%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463452:0-emirati-stocks-close-higher-as-global-investors-weigh-looming-trade-war/",
            "pub_date": "2025-02-04 19:24:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446536:0",
            "title": "Ghana Inflation Rate Eases for 1st Time in 5 Months",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ghana's annual consumer inflation fell slightly to 23.5% in January 2025, down from an eight-month high of 23.8% in the prior month, marking the first decrease in five months.</p><p class=\"\">Still, inflation remains well above the Bank of Ghana’s 8% target range, with a 6%-10% tolerance band.</p><p class=\"\">The central bank warned recently that inflation will take longer to return to target.</p><p class=\"\">Non-food inflation slowed (19.2% vs 20.3% in December), contributing to the decline, while food prices (28.3% vs 27.8%) continued to increase.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446536:0-ghana-inflation-rate-eases-for-1st-time-in-5-months/",
            "pub_date": "2025-02-04 19:24:40",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003662_20250204003668:0",
            "title": "Graphic Packaging Raises Dividend to 11c Vs. 10c >GPK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003662_20250204003668:0/",
            "pub_date": "2025-02-04 19:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003662_20250204003662:0",
            "title": "Graphic Packaging Holding Company Announces 10% Dividend Increase >GPK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003662_20250204003662:0/",
            "pub_date": "2025-02-04 19:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003662:0",
            "title": "Graphic Packaging Holding Company Announces 10% Dividend Increase",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(11:25 GMT) </strong>*Graphic Packaging Holding Company Announces 10% Dividend Increase &gt;GPK<br/><strong class=\"root-Tkn6WL2y\">(11:25 GMT) </strong>Press Release: Graphic Packaging Holding Company Announces 10% Dividend Increase</p><p class=\"\">Graphic Packaging Holding Company Announces 10% Dividend Increase</p><p class=\"\">PR Newswire</p><p class=\"\">ATLANTA, Feb. 4, 2025</p><p class=\"\">ATLANTA, Feb. 4, 2025 /PRNewswire/ — Graphic Packaging Holding Company  (\"Graphic Packaging\" or the \"Company\"), a global leader in sustainable consumer packaging, today announced that its Board of Directors voted to increase the quarterly dividend to $0.11 per share of common stock, a 10% increase from the prior quarterly dividend of $0.10. The increased dividend will be payable on April 5, 2025, to common stockholders of record at the close of business on March 15, 2025.</p><p class=\"\">Michael Doss, the Company's President and CEO said, \"As the last major investment of our Vision 2025 transformation program nears completion, the company's capital spending needs decline significantly. Our focus under Vision 2030 turns to strengthening and protecting our market-leading position in sustainable consumer packaging through reinvestment and tuck-under M&amp;A, and returning excess capital to stockholders. We believe that a strong and growing dividend is appropriate capital allocation, and this increase reflects our confidence in the strength of our business model. We expect to supplement a growing dividend with opportunistic share repurchase, and to pursue an investment grade credit rating when doing so provides the greatest benefit to our stockholders.\"</p><p class=\"\">About Graphic Packaging Holding Company</p><p class=\"\">Graphic Packaging designs and produces consumer packaging made primarily from renewable or recycled materials. An industry leader in innovation, the Company is committed to reducing the environmental footprint of consumer packaging. Graphic Packaging operates a global network of design and manufacturing facilities serving the world's most widely recognized brands in food, beverage, foodservice, household, and other consumer products. Learn more at www.graphicpkg.com.</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/graphic-packaging-holding-company-announces-10-dividend-increase-302366889.html</p><p class=\"\">SOURCE Graphic Packaging Holding Company</p><p class=\"\">/CONTACT: Investors, Investor.Relations@Graphicpkg.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(11:25 GMT) </strong>*Graphic Packaging Raises Dividend to 11c Vs. 10c &gt;GPK</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003662:0/",
            "pub_date": "2025-02-04 19:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:40e52eb0e8930:0",
            "title": "Amcor's Latest SEC 8-K Filing: Key Financial Insights and Developments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Amcor, a global leader in responsible packaging solutions, has released its latest SEC 8-K filing, detailing the financial performance for the second quarter and first half of fiscal 2025. The report highlights the company's continued growth and strategic initiatives, including a significant merger with Berry Global.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Amcor reported net sales of $3.24 billion for the December 2024 quarter, with a GAAP net income of $163 million and GAAP diluted earnings per share (EPS) of 11.3 cents. Adjusted EBIT for the quarter was $363 million, reflecting a 5% increase on a comparable constant currency basis. For the first half of fiscal 2025, net sales were $6.59 billion, with a GAAP net income of $354 million and GAAP diluted EPS of 24.4 cents. Adjusted EBIT for the first half was $728 million, up 4% on a comparable constant currency basis.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The company saw a sequential improvement in year-over-year volume growth, with net sales for the December quarter showing a 2.3% increase in volumes compared to the previous year. The Flexibles segment reported net sales of $2.51 billion for the quarter, up 1% from the previous year, driven by volume growth across key regions. The Rigid Packaging segment, however, saw a 5% decline in net sales to $730 million, primarily due to unfavorable price/mix impacts and lower raw material costs.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Amcor announced a highly complementary and financially compelling combination with Berry Global, expected to close by mid-2025. This merger aims to enhance the company's position in attractive categories, improve material science and innovation capabilities, and deliver significant synergies estimated at $650 million. Additionally, the Amcor Board of Directors declared a quarterly cash dividend of 12.75 cents per share, reflecting a slight increase from the previous year's 12.5 cents per share.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">CEO Peter Konieczny expressed confidence in the company's performance, stating, \"Amcor delivered a solid second quarter result aligned with the expectations we set out in October, giving us the confidence to again reaffirm our guidance for the fiscal year. We continued to execute well on our underlying business, delivering our fourth consecutive quarter of sequential volume improvement.\"</p><p class=\"\">Konieczny also highlighted the strategic merger with Berry Global, emphasizing the potential for accelerated growth and significant value creation for shareholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Amcor reaffirmed its fiscal 2025 guidance, projecting adjusted EPS of 72-76 cents per share and adjusted free cash flow of $900 million to $1 billion. The company expects leverage to be at or below 3.0x by June 30, 2025, and anticipates no material impact from exchange rate movements on reported EPS.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1748790/000174879025000005/amcr-20250204.htm\" rel=\"nofollow\" target=\"_blank\">Amcor plc [ AMCR ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:40e52eb0e8930:0-amcor-s-latest-sec-8-k-filing-key-financial-insights-and-developments/",
            "pub_date": "2025-02-04 19:25:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr2ZxKBf:0",
            "title": "Notification of transactions by person discharging managerial responsibilities in Penneo A/S",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Penneo<p class=\"\">Company Release no. 10/2025</p><p class=\"\">Copenhagen, Denmark, 4 February 2025</p><p class=\"\">In accordance with the Market Abuse Regulation, Penneo must notify the Danish Financial Supervisory Authority (Finanstilsynet) and publicly disclose transactions made by persons discharging managerial responsibilities and persons closely associated with them on trading of Penneo shares. </p><p class=\"\">Penneo hereby notify and submit the attached transactions of shares in Penneo.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information</strong></p><p class=\"\">CEO, Christian Stendevad</p><p class=\"\">Mobile (+45) 27 29 50 02</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Penneo</strong></p><p class=\"\">Penneo combines digital signing and Know Your Customer (KYC) workflows into a single platform that streamlines critical business processes for anti-money-laundering regulated B2B companies.</p><p class=\"\">Founded in Copenhagen and operating throughout Europe, Penneo is fast becoming the go-to platform for companies looking to save time on administrative tasks while ensuring complete regulatory compliance and peace of mind for themselves and their clients. Penneo is already trusted by +3,000 companies - including the world's leading auditors.</p><p class=\"\">For information about Penneo, please visit https://penneo.com/investors.</p><p class=\"\">https://news.cision.com/penneo/r/notification-of-transactions-by-person-discharging-managerial-responsibilities-in-penneo-a-s%2Cc4100241</p><p class=\"\">M ELK Holding - Sale of shares 03022025</p><p class=\"\">Morten Keneeth Elk - Sale of shares 03022025</p><p class=\"\">Morten Kenneth Elk - Sale of new shares 04022025</p><p class=\"\">Morten Kenneth Elk - Exercise of warrants 04022025</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr2ZxKBf:0-notification-of-transactions-by-person-discharging-managerial-responsibilities-in-penneo-a-s/",
            "pub_date": "2025-02-04 19:25:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463459:0",
            "title": "ProfilGruppen to Buy Equipment Company in Poland",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ProfilGruppen (PROF-B.ST) will buy an undisclosed equipment company in Poland, according to a Tuesday release. </p><p class=\"\">The Sweden-based aluminum components supplier has already invested in the target company, which it intends to restructure with the deal.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463459:0/",
            "pub_date": "2025-02-04 19:25:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX86FFZc:0",
            "title": "Mitolyn's Purple Peel Exploit: The Future of Weight Loss Innovation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PLAINVIEW, N.Y., Feb.  04, 2025  (GLOBE NEWSWIRE) — Mitolyn is paving the way for weight management innovation with the launch of its newest supplement, the Purple Peel Weight Loss Exploit. Designed to boost energy, enhance metabolism, and support overall vitality, this groundbreaking formula takes inspiration from the antioxidant powerhouse—Maqui Berry peel. By targeting key issues like weight challenges, fatigue, and the effects of aging, Mitolyn is redefining what it means to achieve holistic wellness. <strong class=\"root-Tkn6WL2y\">Mitolyn Products On Sale Now – Don’t Miss Out!</strong></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:800px;aspect-ratio:1.3333333333333333\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX86FFZc-1d1c053b723786ad100a0a1c06207731-resized.webp\" type=\"images/webp\"/><img alt=\"Mitolyn - Purple Peel Exploit\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX86FFZc-1d1c053b723786ad100a0a1c06207731-resized.jpeg\" style=\"background-color:#a988a1\"/></picture></div></figure></span></p><p class=\"\">At the core of Mitolyn's Purple Peel Exploit is a carefully crafted blend of six natural, powerhouse ingredients—Maqui Berry, Haematococcus, Rhodiola Rosea, Amla, Schisandra, and Theobroma Cacao. Each ingredient was meticulously selected for its ability to optimize mitochondrial health. These cellular energy centers are responsible for producing energy, metabolizing fat, and repairing cells, making them crucial components for improving both physical and mental performance.</p><p class=\"\">“Our goal with Mitolyn is simple but impactful,” said Peter Newman, Founder of Mitolyn. “We want to empower people to feel their best naturally. By focusing on mitochondrial health, we’re tackling the root causes of low energy, slow metabolism, and the visible signs of aging.”</p><p class=\"\">The science-backed formula is free from GMOs, stimulants, dairy, and soy, making it a clean, versatile option for anyone looking to improve their health. Each product is produced under strict quality standards in GMP-certified and FDA-registered facilities to ensure safety and premium results. Dr. Nakamura, a leading research scientist collaborating with Mitolyn, emphasized the product’s innovation, stating, “The Purple Peel Exploit highlights the incredible benefits that antioxidant-rich ingredients like Maqui Berry bring to cellular health. By improving mitochondrial efficiency, this formula naturally enhances energy levels and maximizes metabolic performance.”</p><p class=\"\">To make health improvements even more accessible, Mitolyn offers a 90-day money-back guarantee, giving customers the confidence to try it without hesitation. Additionally, every purchase from mitolyn.com comes with exclusive wellness guides. Resources like the “1-Day Detox Kickstart” and “Renew You” are designed to complement the supplement, helping users unlock its full potential. <!-- -->Click Here to Buy Mitolyn Supplements with Lowest Price Right Now!</p><p class=\"\">Early customer feedback praises the product’s transformative effects. Users have reported a noticeable boost in energy, greater mental clarity, healthier skin, and improved focus—all within just a few weeks of consistent use.</p><p class=\"\">Building on a mission to blend the best of nature and science, Mitolyn continues to innovate solutions for common health challenges. With plans already underway to create products targeting stress relief and cognitive health, the brand is setting the stage for long-term advancements in well-being.</p><p class=\"\">To learn more about the Purple Peel Weight Loss Exploit or to hear inspiring customer success stories, visit mitolyn.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Order Self-Service: mitolyn.com</li><li class=\"listItem-bmN0_SHH\">Email Support: contact@mitolyn.com</li><li class=\"listItem-bmN0_SHH\">Phone Support: 1-800-390-6035 (USA Toll Free)</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disclaimer</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Statements Not Evaluated by the FDA</strong></p><p class=\"\">The statements made in this press release and on the Mitolyn website have not been evaluated by the Food and Drug Administration (FDA). Mitolyn is not intended to diagnose, treat, cure, or prevent any disease. Always consult a healthcare professional before beginning any supplement, diet, or exercise program, especially if you have known medical conditions or are taking prescribed medications.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Individual Results May Vary</strong></p><p class=\"\">While many have experienced significant success, actual results may vary based on individual factors such as age, health history, genetics, lifestyle, and compliance with usage guidelines. Weight loss testimonials shared in this press release reflect genuine user experiences but do not guarantee similar outcomes for all.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">No Medical Advice</strong></p><p class=\"\">The information and product suggestions provided here are for informational purposes only and should not be considered medical advice. Please seek guidance from a licensed medical practitioner to address specific questions or concerns about your health and wellness.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">Any forward-looking statements or projections are based on current expectations and assumptions. Actual results may differ materially due to changes in scientific research, market conditions, or regulatory landscapes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">References to Scientific Studies</strong></p><p class=\"\">References to scientific studies and academic institutions, including Harvard and Yale, are provided solely to illustrate broader research regarding mitochondria and weight management. They do not constitute an endorsement or approval of Mitolyn by these institutions.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/e5ca5fca-299e-4039-a53e-760dfd318bd7.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> Mitolyn - Purple Peel Exploit</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\"> Mitolyn - Purple Peel Exploit</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX86FFZc:0-mitolyn-s-purple-peel-exploit-the-future-of-weight-loss-innovation/",
            "pub_date": "2025-02-04 19:25:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0WK:0",
            "title": "SailPoint seeks up to $11.48 billion valuation in US IPO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SailPoint is targeting a valuation of up to $11.48 billion in its initial public offering in the United States, the cybersecurity firm said on Tuesday.</p><p class=\"\">Private equity-backed companies are expected to lead the charge in the IPO market as sponsors look to unload holdings and return capital to investors.</p><p class=\"\">SailPoint is offering 47.5 million shares in the IPO, while its parent, private equity firm Thoma Bravo is offering 2.5 million shares priced between $19 and $21 each to raise up to $1.05 billion.</p><p class=\"\">Morgan Stanley and Goldman Sachs are the lead underwriters.</p><p class=\"\">SailPoint will list on the Nasdaq under the symbol \"SAIL.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0WK:0-sailpoint-seeks-up-to-11-48-billion-valuation-in-us-ipo/",
            "pub_date": "2025-02-04 19:16:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308501:0",
            "title": "DA Davidson Downgrades United Parcel Service to Neutral From Buy/Add, Cuts Price Target to $116 From $154",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">United Parcel Service  has an average rating of overweight and mean price target of $133.11, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308501:0/",
            "pub_date": "2025-02-04 19:16:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0VU:0",
            "title": "Health insurer Centene beats profit estimates on strength in commercial plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Centene  beat Wall Street estimates for fourth-quarter profit on Tuesday, helped by strength in its commercial health insurance plans.</p><p class=\"\">The company mostly focuses on government-backed Medicaid plans for low-income people, as well as income-based government-subsidized health insurance under the Affordable Care Act, also known as Obamacare.</p><p class=\"\">It has relied on growth in its private plans for individuals and families as it struggles with a drop in members in its government-backed Medicaid plans for lower-income groups, and a rise in costs related to those plans after the end of a pandemic-era federal policy.</p><p class=\"\">For the quarter, Centene reported a medical loss ratio — the percentage of premiums spent on medical care — of 89.6%, compared with 89.5% a year ago. Analysts on average had estimated a ratio of 89.95%, according to data compiled by LSEG.</p><p class=\"\">On an adjusted basis, the health insurer reported a profit of 80 cents per share, above analysts' average estimate of 49 cents.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0VU:0-health-insurer-centene-beats-profit-estimates-on-strength-in-commercial-plans/",
            "pub_date": "2025-02-04 19:17:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003613:0",
            "title": "The 10-Point: The Wall Street Journal's Guide to the Day's Top News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Emma Tucker</p><p class=\"\">President Trump's U-turn on some tariffs stunned markets and boardrooms across the world, underscoring his willingness to risk major economic disruptions to make a point. Just as new U.S. tariffs of 10% on China went into effect, Beijing retaliated. European leaders are prepared for their own fight with Trump over the world's most valuable trading relationship — and they prefer cooperation. And in Washington, Elon Musk's push to dismantle multiple federal agencies has lawmakers and government workers wondering who is really in charge.</p><p class=\"\">Today's Headlines</p><p class=\"\">China hit back against new U.S. tariffs with a series of moves including levies on certain American goods, an antitrust probe into Google and restrictions on Chinese exports of key minerals.</p><p class=\"\">The White House whipsawed over the timing of tariffs and the possibility of carve-outs before striking last-minute deals with Canada and Mexico.</p><p class=\"\">European leaders, bracing for a trade fight with Trump, said they are ready to strike back but prefer cooperation.</p><p class=\"\">As Musk moved with Silicon Valley velocity to shake up Washington, Trump hinted that there are curbs to keep him from doing anything in the government without the White House's blessing.</p><p class=\"\">Secretary of State Marco Rubio said El Salvador offered to accept deportees of any nationality from the U.S., including incarcerated American citizens.</p><p class=\"\">Live From The Markets</p><p class=\"\">Trump's detente with Mexico and Canada validates optimists on Wall Street, but this risks breeding complacency regarding a real trade war, writes Jon Sindreu.</p><p class=\"\">Read It Here First</p><p class=\"\">Amazon, king of online retail, can't seem to make its physical stores work.</p><p class=\"\">The company has shrunk its portfolio of Amazon Go convenience stores by about half since early 2023, and closed dozens of its other branded retail stores in recent years, including bookstores, fashion outlets and its \"4-star\" locations stocked with bestselling items from its website. After a decadelong experiment with bricks-and-mortar stores, Amazon's dominance online has yet to translate into a successful strategy for connecting with shoppers in the real world, Kate King reports.</p><p class=\"\">In 24 hours, one senator flipped from no to a crucial yes on Pete Hegseth.</p><p class=\"\">The night before Sen. Thom Tillis cast the fateful 50th \"yes\" vote to confirm Hegseth as defense secretary, he approached the Senate's new Republican leader and told him he was a \"no.\" That set off a last-minute blitz by the president, the vice president, the Republican whip team and Hegseth himself. Tillis's turnaround left witnesses who came forward as collateral damage, Lindsay Wise, Jack Gillum and Meridith McGraw report.</p><p class=\"\">Expert Take</p><p class=\"\">Q: Is USAID closing?</p><p class=\"\">Rubio notified lawmakers Monday that he intends to work with Congress to reorganize the U.S. Agency for International Development and potentially merge much of it into the State Department. Hours earlier, Musk's Department of Government Efficiency sought to exert control over USAID and shut its headquarters to agency officials. Michael R. Gordon, Ken Thomas and Alexander Ward explain where that leaves the agency.</p><p class=\"\">A: It is unclear how Rubio's promise to work with lawmakers to overhaul USAID would be reconciled with Musk's stated determination to close the agency. In his note to lawmakers, Rubio, who says he is now USAID's acting director, said he asked for a review of the agency's activities and that if some of the agency's bureaus were merged into the State Department, the rest might be abolished.</p><p class=\"\">Trump administration officials have been considering plans to merge the 10,000-person, $40 billion agency into the State Department, which would rein in its autonomy. Democratic lawmakers say that would be illegal without congressional approval, as USAID's existence is in federal statute.</p><p class=\"\">Rubio has already ordered a freeze on most foreign aid as part of a review. He later exempted \"core life saving programs\" that involve medicine, medical services, food and shelter. The immediate fate of other programs, which include those that support economic development, counterterrorist training, counternarcotics cooperation and efforts to strengthen the rule of law abroad, was left unclear.</p><p class=\"\">Meanwhile, two Democratic senators, Brian Schatz of Hawaii and Chris Van Hollen of Maryland, vowed to place holds on Trump's State Department nominees unless the administration's attack on USAID ends.</p><p class=\"\">See The Story</p><p class=\"\">Trump's tariff idol, William McKinley, abandoned his own tariff policy.</p><p class=\"\">Trump often cites the 25th president, William McKinley, as an inspiration. The \"McKinley Tariffs\" were some of the largest hikes in U.S. history, but in his second term, McKinley changed his mind, and argued for more free trade.</p><p class=\"\">Happening Today</p><p class=\"\">The Labor Department will report on December job openings at 10 a.m. ET.</p><p class=\"\">Israeli Prime Minister Benjamin Netanyahu will meet with President Trump. The future of the precarious Gaza cease-fire is expected to dominate much of the closed-door discussion.</p><p class=\"\">Earnings: Alphabet, Merck, PepsiCo, AMD, Amgen, Pfizer, KKR, Spotify, PayPal, Chipotle, Mondelez, Prudential</p><p class=\"\">Number Of The Day:</p><p class=\"\">338</p><p class=\"\">The average weight in pounds of the Philadelphia Eagles offensive linemen that will take on the Kansas City Chiefs in the Super Bowl. It's the heaviest — and with an average height of 6-foot-6, the tallest — offensive line in the game's history.</p><p class=\"\">And Finally...</p><p class=\"\">South Koreans are hooked on divorce shows — even as fewer marriages are actually ending.</p><p class=\"\">While not wholly taboo in socially conservative South Korea, divorce hasn't been normalized either. That's left a curiosity void to fill for TV shows, online testimonials and social-media creators.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003613:0/",
            "pub_date": "2025-02-04 19:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308498:0",
            "title": "Oaktree Specialty Lending's Fiscal Q1 Adjusted Net Investment Income, Revenue Fall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oaktree Specialty Lending  reported fiscal Q1 adjusted net investment income Tuesday of $0.54 per diluted share, down from $0.57 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.53. </p><p class=\"\">Total investment income for the quarter ended Dec. 31 was $86.6 million, compared with $98 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected revenue of $90.4 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308498:0/",
            "pub_date": "2025-02-04 19:18:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308492:0",
            "title": "Centene's Q4 Adjusted Earnings, Total Revenue Rise; Maintains 2025 Earnings Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Centene  reported Q4 adjusted earnings Tuesday of $0.80 per diluted share, up from $0.45 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.49. </p><p class=\"\">Total revenue for the quarter ended Dec. 31 was $40.81 billion, compared with $39.46 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $39.36 billion. </p><p class=\"\">The company maintained its 2025 adjusted diluted EPS guidance floor of greater than $7.25. Analysts surveyed by FactSet expect $7.21.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308492:0/",
            "pub_date": "2025-02-04 19:18:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308491:0",
            "title": "Earnings Flash (SPOT) Spotify Technology Posts Q4 EPS 1.76 Euros, vs. FactSet Est of 1.99 Euros",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308491:0/",
            "pub_date": "2025-02-04 19:18:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308496:0",
            "title": "Ball Q4 Comparable Earnings Rise, Sales Decline; Issues 2025 Profit Growth Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ball  reported Tuesday Q4 comparable earnings of $0.84 per diluted share, up from $0.78 per share a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.80 per share. </p><p class=\"\">Sales for the quarter ended Dec. 31 were $2.88 billion, down from $2.9 billion a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $2.91 billion. </p><p class=\"\">The company said it is \"positioned\" to grow comparable diluted earnings per share in excess of 10% in 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308496:0/",
            "pub_date": "2025-02-04 19:19:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463453:0",
            "title": "Ohsho Food Service's Nine-Month Profit Slides Nearly 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ohsho Food Service  recorded a 7.5% decline in attributable profit for the nine months ended Dec. 31, 2024, to 5.21 billion yen from 5.63 billion yen in the year-ago period, a Jan. 31 bourse filing said. </p><p class=\"\">Basic earnings per share was 92.16 yen for the three quarters, down from 99.74 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The restaurant chain operator's net sales rose 7.8% to 81.4 billion yen in the nine months from 75.5 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 7.97 billion yen, a basic EPS of 141.16 yen per share, net sales of 109.9 billion yen, and a year-end dividend of 25 yen per share for the fiscal year ending March 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463453:0/",
            "pub_date": "2025-02-04 19:19:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003632:0",
            "title": "North American Morning Briefing: Trump Tariffs: China Hits Back With U.S. Penalties",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OPENING CALL</p><p class=\"\">Stock futures declined on Tuesday as China struck back against U.S. tariffs  with levies on certain American goods, an antitrust probe into Google and restrictions on Chinese exports of key minerals.</p><p class=\"\">The moves escalated a new trade war between the world's two largest economies.</p><p class=\"\">Just after American tariffs of 10% on China went into effect early Tuesday morning, Beijing said it would retaliate. Its measures will go into effect on Feb. 10.</p><p class=\"\">Trump said the tariffs on China were just \"an opening salvo.\" He added: \"If we can't make a deal with China, then the tariffs would be very, very substantial.\"</p><p class=\"\">Premarket Movers</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%. Shares were down 1.3%.</p><p class=\"\">Kyndryl Holdings swung to a profit in its fiscal third quarter and raised its 2025 guidance. The stock declined 1.7%.</p><p class=\"\">Shares of Nvidia were rising 0.7%. It declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Palantir Technologies shares rose 18% after it reported strong sales growth and said demand for artificial-intelligence products keeps growing.</p><p class=\"\">Investors worry that new tariffs on China and the end of \"de minimis exemptions\" for small packages could hit PDD Holdings' Temu business. PDD stock ticked up.</p><p class=\"\">Super Micro Computer rose 6%. It said it would be providing a fiscal second-quarter \"business update\" on Feb. 11.</p><p class=\"\">Synaptics fell 5% after announcing CEO Michael Hurlston would be stepping down to become chief executive and president of Lumentum. Lumentum shares rose 1.7%.</p><p class=\"\">Watch For:</p><p class=\"\">Factory Orders for December; Job Openings &amp; Labor Turnover Survey for December; Earnings from Alphabet, Merck &amp; Co., Mondelez, PepsiCo, Pfizer; Fedspeak from Raphael Bostic, Mary Daly</p><p class=\"\">Today's Top Headlines/Must Reads:</p><p class=\"\">- A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</p><p class=\"\">- Apple Escaped Tariffs Last Time. This Time, It May Have to Raise Prices.</p><p class=\"\">- Alphabet Earnings Could Provide Answers on AI and Cloud Concerns</p><p class=\"\">MARKET WRAPS</p><p class=\"\">Forex:</p><p class=\"\">The dollar fell after Trump delayed tariffs on Canada and Mexico for one month, but uncertainty remains and this could soon lift the safe-haven dollar once more, Commerzbank said.</p><p class=\"\">There is a risk of new tariff announcements coming at any time, Commerzbank said.</p><p class=\"\">\"The next shock is bound to come, and this will probably be dollar-positive again.\"</p><p class=\"\">Key U.S. economic data this week--including ISM data on services Wednesday and monthly jobs data Friday--will also likely lift the dollar as long as they underpin the story of a resilient U.S. economy, it said.</p><p class=\"\">The euro remained under pressure as tariff risks remained heightened even after Trump agreed to pause tariffs on Canada and Mexico, Danske Bank said.</p><p class=\"\">Tariff headlines will likely remain the primary driver of price action in the coming weeks, with a risk of Trump announcing measures against Europe, it said.</p><p class=\"\">Still, Trump looks to be using tariff announcements \"primarily as a negotiating tool\" and this could help the euro to recover back into a $1.04-$1.05 range.</p><p class=\"\">\"We believe Trump is ultimately likely to under-deliver on maintaining tariffs for an extended period,\" Danske Bank said.</p><p class=\"\">Energy:</p><p class=\"\">Oil prices fell more than 1% as immediate concerns over supply disruptions eased after Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude.</p><p class=\"\">Meanwhile, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday.</p><p class=\"\">The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices.</p><p class=\"\">Metals:</p><p class=\"\">Gold futures slid, correcting after Canada and Mexico made a deal that will postpone U.S. tariffs by at least a month, but ING said uncertainty over trade should keep the price relatively well supported.</p><p class=\"\">Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING said.</p><p class=\"\">Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING added.</p><p class=\"\">Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research said.</p><p class=\"\">Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800 level, leaving its bullish bias intact, RHB said.</p><p class=\"\">The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900 level, it said.</p><p class=\"\">The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, RHB added.</p><p class=\"\">TODAY'S TOP HEADLINES</p><p class=\"\">KKR Raises Offer Price for Fuji Soft in Bid to End Takeover Battle</p><p class=\"\">KKR raised its tender-offer price for Japanese software company Fuji Soft in an attempt to end the takeover battle with rival Bain Capital.</p><p class=\"\">The U.S. investment company bought a more than one-third stake in Fuji Soft in November and has said it is best positioned to work with the company to take it private.</p><p class=\"\">AMD Reports Earnings Today. The Outlook Is a Worry.</p><p class=\"\">The outlook for revenue will be investors' focus when Advanced Micro Devices reports its fourth-quarter earnings after the close Tuesday.</p><p class=\"\">The consensus forecast among analysts is that AMD will report December quarter revenue of $7.5 billion with adjusted earnings per share of $1.08. For the current quarter, the consensus call is that revenue will be $7.0 billion and earnings per share will come in at 95 cents, according to FactSet.</p><p class=\"\">Pfizer Is About to Report Its Earnings. The Stock Has Been Floundering.</p><p class=\"\">When CEO Albert Bourla presents Pfizer's financial results on Tuesday morning, investors will be looking for any sign of a turnaround after another year of underperformance.</p><p class=\"\">Pfizer shares fell nearly 50% from the start of 2023 through the end of 2024, while the S&amp;P 500 climbed just over 50%. A Pfizer shareholder has halved her money over that period, while missing out on a shot at historic gains.</p><p class=\"\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</p><p class=\"\">Bitcoin was struggling for direction Tuesday as investors weighed up how President Donald Trump's trade policies will affect cryptocurrency prices.</p><p class=\"\">The world's largest token climbed when Trump paused plans for 25% tariffs on goods from Mexico and Canada, then slid after China said it would hit back with levies of its own.</p><p class=\"\">Asia Markets Jittery as Traders Gauge First Trade War Salvos</p><p class=\"\">Markets across Asia began the day with a relief rally after the U.S. struck last-minute deals with Mexico and Canada to delay tariffs, but the mood took a turn when no such reprieve materialized for China, which hit back with new tariffs on the U.S.</p><p class=\"\">The news poured cold water on hopes that there would be talks between Washington and Beijing that could also lead to a postponing of the 10% tariffs on all Chinese goods entering the U.S.</p><p class=\"\">Netanyahu, Trump to Hold Talks on Gaza Cease-Fire and Wider Middle East Strategy</p><p class=\"\">WASHINGTON-The future of the precarious Gaza cease-fire is expected to dominate much of the closed-door discussion when President Trump and Israeli Prime Minister Benjamin Netanyahu meet in the Oval Office Tuesday.</p><p class=\"\">A commitment from Netanyahu to negotiate an extension and potentially a long-term cessation of hostilities would give Trump a diplomatic win, and could secure the release of remaining hostages, including some Americans.</p><p class=\"\">El Salvador Offers to Take U.S. Deportees of Any Nationality Including Imprisoned Americans</p><p class=\"\">SAN SALVADOR, El Salvador-U.S. Secretary of State Marco Rubio said on Monday that El Salvador has offered to accept deportees of any nationality from the U.S., including incarcerated American citizens who would be held in the country's maximum-security prison.</p><p class=\"\">El Salvador President Nayib Bukele offered to \"house in his jails dangerous American criminals in custody in our country,\" Rubio said in San Salvador, the second stop on his first foreign trip, after meeting with Bukele. \"No country has ever made an offer of friendship such as this,\" he said, calling it the \"most unprecedented and extraordinary, extraordinary migratory agreement anywhere in the world.\"</p><p class=\"\">Trump Hints at Curbs on Musk's Powers After Billionaire Shakes Up Washington</p><p class=\"\">WASHINGTON-President Trump on Monday said there were curbs in place to prevent Elon Musk from doing anything in the government without the White House's blessing, responding to growing confusion about who was overseeing Musk's push to dismantle multiple agencies.</p><p class=\"\">Trump described Musk's role as advisory. \"Elon can't do-and won't do-anything without our approval and we'll give him the approval where appropriate. Where not appropriate, we won't,\" Trump said.</p><p class=\"\">Write to ina.kreutz@wsj.com TODAY IN CANADA</p><p class=\"\">Earnings:</p><p class=\"\">Canaccord Genuity 3Q</p><p class=\"\">Finning Intl 4Q</p><p class=\"\">Stingray 3Q</p><p class=\"\">Economic Indicators (ET):</p><p class=\"\">Nothing scheduled</p><p class=\"\">Stocks to Watch:</p><p class=\"\">BlackBerry Completes Sale of Cylance Endpoint Security Assets to Arctic Wolf Networks</p><p class=\"\">Expected Major Events for Tuesday</p><p class=\"\">13:55/US: 02/01 Johnson Redbook Retail Sales Index</p><p class=\"\">15:00/US: Dec Job Openings &amp; Labor Turnover Survey</p><p class=\"\">15:00/US: Dec Manufacturers' Shipments, Inventories &amp; Orders (M3)</p><p class=\"\">15:00/US: Feb RCM/TIPP Economic Optimism Index</p><p class=\"\">21:30/US: API Weekly Statistical Bulletin</p><p class=\"\">23:30/JPN: Dec Provisional Labour Survey - Earnings, Employment &amp; Hours Worked</p><p class=\"\">All times in GMT. Powered by Kantar Media and Dow Jones.</p><p class=\"\">Expected Earnings for Tuesday</p><p class=\"\">AMETEK Inc (AME) is expected to report $1.65 for 4Q.</p><p class=\"\">ATI Inc (ATI) is expected to report $0.60 for 4Q.</p><p class=\"\">Aramark (ARMK) is expected to report $0.44 for 1Q.</p><p class=\"\">Atkore Inc (ATKR) is expected to report $1.26 for 1Q.</p><p class=\"\">Ball Corp (BALL) is expected to report $0.75 for 4Q.</p><p class=\"\">CONSOL Energy Inc (CEIX) is expected to report $3.09 for 4Q.</p><p class=\"\">CTS Corp (CTS) is expected to report $0.54 for 4Q.</p><p class=\"\">Centene Corp (CNC) is expected to report $0.25 for 4Q.</p><p class=\"\">CorVel Corp (CRVL) is expected to report for 3Q.</p><p class=\"\">Cummins Inc (CMI) is expected to report $4.63 for 4Q.</p><p class=\"\">Energizer Holdings Inc (ENR) is expected to report $0.64 for 1Q.</p><p class=\"\">Enterprise Products Partners LP (EPD) is expected to report $0.71 for 4Q.</p><p class=\"\">Gartner Inc (IT) is expected to report $2.93 for 4Q.</p><p class=\"\">Hamilton Lane Inc (HLNE) is expected to report $1.07 for 3Q.</p><p class=\"\">Hubbell Inc (HUBB) is expected to report $3.73 for 4Q.</p><p class=\"\">IES Holdings Inc (IESC) is expected to report for 1Q.</p><p class=\"\">Ingredion Inc (INGR) is expected to report $2.41 for 4Q.</p><p class=\"\">Jacobs Solutions Inc (J) is expected to report $1.03 for 1Q.</p><p class=\"\">KS Bancorp Inc (KSBI) is expected to report for 4Q.</p><p class=\"\">Lancaster Colony Corp (LANC) is expected to report $1.95 for 2Q.</p><p class=\"\">MPLX LP (MPLX) is expected to report $1.02 for 4Q.</p><p class=\"\">Madison Square Garden Sports Corp (MSGS) is expected to report $0.31 for 2Q.</p><p class=\"\">Marathon Petroleum (MPC) is expected to report $0.06 for 4Q.</p><p class=\"\">Merck &amp; Co Inc (MRK) is expected to report $1.59 for 4Q.</p><p class=\"\">Mesa Laboratories Inc (MLAB) is expected to report $0.19 for 3Q.</p><p class=\"\">Mueller Industries Inc (MLI) is expected to report for 4Q.</p><p class=\"\">Oaktree Specialty Lending Corp (OCSL) is expected to report $0.52 for 1Q.</p><p class=\"\">PJT Partners Inc (PJT) is expected to report $0.78 for 4Q.</p><p class=\"\">Peoples Bancorp of North Carolina Inc (PEBK) is expected to report for 4Q.</p><p class=\"\">Pfizer Inc (PFE) is expected to report $0.26 for 4Q.</p><p class=\"\">Premier Inc (PINC) is expected to report $0.21 for 2Q.</p><p class=\"\">Regeneron Pharmaceuticals Inc (REGN) is expected to report $9.24 for 4Q.</p><p class=\"\">Silicon Laboratories Inc (SLAB) is expected to report $-0.79 for 4Q.</p><p class=\"\">Smart Share Global Ltd - ADR (EM) is expected to report for 3Q.</p><p class=\"\">Spirit AeroSystems Holdings Inc (SPR) is expected to report $-1.43 for 4Q.</p><p class=\"\">Sun Country Airlines Holdings Inc (SNCY) is expected to report $0.22 for 4Q.</p><p class=\"\">The Estee Lauder Companies Inc - A Share (EL) is expected to report $0.24 for 2Q.</p><p class=\"\">Utah Medical Products Inc (UTMD) is expected to report for 4Q.</p><p class=\"\">WEC Energy Group Inc (WEC) is expected to report $1.44 for 4Q.</p><p class=\"\">Xylem Inc (XYL) is expected to report $0.92 for 4Q.</p><p class=\"\">Powered by Kantar Media and Dow Jones.</p><p class=\"\">ANALYST RATINGS ACTIONS</p><p class=\"\">American States Water Cut to Underperform From Neutral by B of A Securities</p><p class=\"\">Aptiv Cut to Market Perform From Outperform by Raymond James</p><p class=\"\">Booz Allen Hamilton Raised to Outperform From Market Perform by Raymond James</p><p class=\"\">Brighthouse Financial Cut to Hold From Buy by Jefferies</p><p class=\"\">Caterpillar Raised to Neutral From Sell by UBS</p><p class=\"\">Cloudflare Cut to Neutral From Outperform by Baird</p><p class=\"\">Comcast Cut to Sector Perform From Sector Outperform by Scotiabank</p><p class=\"\">Constellation Brands Cut to Neutral From Overweight by Piper Sandler</p><p class=\"\">CrowdStrike Holdings Cut to Neutral From Outperform by Baird</p><p class=\"\">CSX Corp Cut to Hold From Buy by Loop Capital</p><p class=\"\">Cullen/Frost Bankers Cut to Neutral From Buy by DA Davidson</p><p class=\"\">Danaher Cut to Market Perform From Outperform by Raymond James</p><p class=\"\">DexCom Raised to Buy From Neutral by Redburn Atlantic</p><p class=\"\">FedEx Cut to Hold From Buy by Loop Capital</p><p class=\"\">Financial Institutions Raised to Outperform From Market Perform by Keefe, Bruyette &amp; Woods</p><p class=\"\">Fortinet Cut to Neutral From Outperform by Baird</p><p class=\"\">GXO Logistics Cut to Hold From Buy by Loop Capital</p><p class=\"\">Hologic Cut to Hold From Buy by Needham</p><p class=\"\">Lennox Cut to Underweight From Equal-Weight by Wells Fargo</p><p class=\"\">Lifetime Brands Cut to Neutral From Buy by DA Davidson</p><p class=\"\">News Corp Upgraded to Buy from Neutral by UBS</p><p class=\"\">Norfolk Southern Cut to Hold From Buy by Loop Capital</p><p class=\"\">Northrop Grumman Raised to Peer Perform From Underperform by Wolfe Research</p><p class=\"\">Prologis Cut to Market Perform From Outperform by Raymond James</p><p class=\"\">PVH Corp Cut to Equal-Weight From Overweight by Wells Fargo</p><p class=\"\">Reliance Worldwide Downgraded to Neutral from Buy by UBS</p><p class=\"\">SJW Group Raised to Buy From Neutral by B of A Securities</p><p class=\"\">SS&amp;C Technologies Raised to Buy From Hold by Jefferies</p><p class=\"\">Tempur Sealy Raised to Outperform From Neutral by Wedbush</p><p class=\"\">UMB Financial Cut to Neutral From Buy by Citigroup</p><p class=\"\">Union Pacific Cut to Sell From Hold by Loop Capital</p><p class=\"\">US Steel Cut to Equal-Weight From Overweight by Morgan Stanley</p><p class=\"\">Zillow Group Raised to Overweight From Sector Weight by Keybanc</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003632:0-north-american-morning-briefing-trump-tariffs-china-hits-back-with-u-s-penalties/",
            "pub_date": "2025-02-04 19:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003636:0",
            "title": "Machinery Cyclical Stock Likely Most Affected by U.S Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Machinery cyclical stock would be the most affected by U.S tariffs in the capital-goods sector, Deutsche Bank Research analyst Gael de-Bray says in a research note. Most industrial companies that have reported so far beat expectations on orders and revenue. The downturn in manufacturing activity that began in 2022 was just starting to show signs of easing, de-Bray says. However, the uncertainty, extra costs and inflation brought forth by new U.S tariffs could derail this nascent industrial recovery, the analyst says. With the risk of a global recession rising, Swedish SKF and Sandvik are likely first in line to feel the impact. (nina.kienle@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003636:0/",
            "pub_date": "2025-02-04 19:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSbmjPfa:0",
            "title": "Record Wins for Linde’s Small On-Site Solutions in 2024 Driven by Electronics and Decarbonization",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">WOKING, UK / ACCESS Newswire / February 4, 2025 /</strong> Linde  announced today that for the fifth successive year, it secured a record number of new small on-site projects for the supply of nitrogen and oxygen. During 2024, the company signed 59 new long-term agreements for which it will build, own and operate 64 plants at customer sites.</p><p class=\"\">Linde signed agreements with customers across a broad range of end markets, with demand driven by secular growth in electronics, including battery production for electric vehicles, plus glass and metal manufacturers seeking ways to reduce their emissions and improve efficiency.</p><p class=\"\">These projects will leverage Linde's proprietary ECOVAR® technology, which is engineered for exceptional efficiency, adaptability and reliability. They meet Linde's strict investment criteria and, due to their short execution timelines, will rapidly contribute to the company's growth. Additionally, they will continue to enhance Linde's network density.</p><p class=\"\">\"Linde's unwavering commitment to innovation is reflected in our leading-edge technology portfolio, which is best positioned to meet the evolving needs of our customers,\" said Sanjiv Lamba, Chief Executive Officer, Linde. \"Our small on-site plants fully leverage this and provide cost-effective solutions that help our customers enhance efficiency while reducing emissions.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Linde</strong></p><p class=\"\">Linde is a leading global industrial gases and engineering company with 2023 sales of $33 billion. We live our mission of <em>making our world more productive</em> every day by providing high-quality solutions, technologies and services which are making our customers more successful and helping to sustain, decarbonize and protect our planet.</p><p class=\"\">The company serves a variety of end markets such as chemicals &amp; energy, food &amp; beverage, electronics, healthcare, manufacturing, metals and mining. Linde's industrial gases and technologies are used in countless applications including production of clean hydrogen and carbon capture systems critical to the energy transition, life-saving medical oxygen and high-purity &amp; specialty gases for electronics. Linde also delivers state-of-the-art gas processing solutions to support customer expansion, efficiency improvements and emissions reductions.</p><p class=\"\">For more information about the company and its products and services, please visit linde.com.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Contacts:</p></td><td></td></tr><tr><td><p class=\"\">Investor Relations</p><p class=\"\">Juan Pelaez</p><p class=\"\">Phone: +1 203 837 2213</p><p class=\"\">Email: juan.pelaez@linde.com</p></td><td><p class=\"\">Media Relations</p><p class=\"\">Anna Davies</p><p class=\"\">Phone: +44 1483 244705</p><p class=\"\">Email: anna.davies@linde.com</p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Linde plc</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSbmjPfa:0/",
            "pub_date": "2025-02-04 19:20:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0WH:0",
            "title": "Estee Lauder expands restructuring plan with 7,000 job cuts, posts sales beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder  on Tuesday expanded its restructuring plan that would include up to 7,000 job cuts and posted smaller-than-expected drop in second-quarter sales.</p><p class=\"\">Shares of the company, which fell about 49% last year, were marginally down in premarket trading.</p><p class=\"\">The company said that the expanded plan is to help Estee Lauder return to sales growth and restore a solid double-digit adjusted operating margin over the next few years along with the aim to \"manage external volatility, such as potential tariff increases globally.\"</p><p class=\"\">As part of its turnaround efforts to drive profit recovery, the company has been implementing restructuring programs, which include a series of changes in the executive team after Stéphane de La Faverie took on the role of Chief Executive Officer in January.</p><p class=\"\">Estee Lauder expects to take restructuring and other charges of between $1.2 billion and $1.6 billion, before taxes, consisting of employee-related costs, contract terminations, asset write-offs, and other costs associated with implementing these initiatives.</p><p class=\"\">The company's sales fell 6% to $4 billion in the quarter, compared with analysts' estimates of 7.3% drop to $3.97 billion, as per data compiled by LSEG.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0WH:0-estee-lauder-expands-restructuring-plan-with-7-000-job-cuts-posts-sales-beat/",
            "pub_date": "2025-02-04 19:20:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003573:0",
            "title": "India's Budget Plots Path for Sustainable Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao and Fabiana Negrin Ochoa</p><p class=\"\">India's budget delivered on several items markets had been hoping for: a lowered deficit target, tax cuts, and support for the country's factories and the middle class. Focus now turns to policy execution, with economists watching to see if policymakers can deliver on their aim of supporting growth without sacrificing fiscal prudence or financial stability.</p><p class=\"\">Here's what we watched:</p><p class=\"\">FISCAL FOCUS: The 50.65 trillion rupee budget for the fiscal year starting April, equivalent to $584.22 billion, stuck to its fiscal consolidation guns, despite pressure to do more to lift the economy.</p><p class=\"\">India again cut its fiscal deficit target, lowering it to 4.4% of gross domestic product from an estimated 4.8% for the current fiscal year ending March.</p><p class=\"\">Fiscal prudence prevailed over calls to spur growth, ANZ economists said.</p><p class=\"\">With policymakers continuing to prioritize macroeconomic resilience over short-term spurts of growth, the budget shows continued focus on strengthening public sector balance sheets to \"create a long runway of high and stable growth,\" Goldman Sachs economists Santanu Sengupta, Arjun Varma and Andrew Tilton said.</p><p class=\"\">The budget targets what Nomura economists view as an \"impossible fiscal trinity\" of fiscal discipline, income tax cuts and steady capex outlay. \"Only two can hold.\"</p><p class=\"\">DOWNSIZE DEBT: The budget also laid out a medium-term fiscal strategy to keep central government debt on a downward path to 50% of GDP by FY 2031.</p><p class=\"\">Increased confidence that the government can stick to that framework and keep debt on the decline would be positive for India's sovereign rating over time, said Jeremy Zook, primary sovereign analyst for India at Fitch Ratings. \"Still, the pace of debt reduction is gradual, which leaves open downside risks from a large economic shock.\"</p><p class=\"\">While India is likely to reach its near-term policy goals, Christian de Guzman, senior vice president at Moody's Ratings, doesn't expect the debt burden to improve enough to put its fiscal strength on par with most of its investment-grade peers.</p><p class=\"\">GROWTH DRIVERS: The budget identified four key engines of development: agriculture, micro, small and medium enterprises, private sector investments and exports. Measures included financial assistance for farmers, expanded credit for startups, and job creation for manufacturing.</p><p class=\"\">The budget is largely neutral for economic growth, and is unlikely to deliver any inflationary impulse, according to Nomura economists led by Sonal Varma.</p><p class=\"\">Given the time it will take to see the impact on consumption, OCBC maintains its real GDP growth forecast for FY 2026 at 6.2%.</p><p class=\"\">TAXES: To boost consumption, the budget tabled income tax relief aimed at freeing up spending power but analysts are not fully sold on the efficacy.</p><p class=\"\">The government raised the income tax exemption limit for annual incomes up to INR1.2 million, specifically targeting the middle class. That will result in a revenue loss of about INR1 trillion in direct taxes.</p><p class=\"\">The tax cuts could raise net incomes among India's upper middle class by 2%-7%, analysts at Emkay Global said, but the \"net effect is inconspicuous.\"</p><p class=\"\">ANZ economists expect to see only a mild boost to household consumption, as the direct impacts seem limited to a narrow base. Consumption could have been boosted more widely by reducing indirect taxes on essential goods like fuel, they said.</p><p class=\"\">OCBC economist Lavanya Venkateswaran noted that there are no clear offsets to compensate for the revenue loss and though there is a shift toward greater tax compliance, implementation will be key. Reliance on nontax revenues leaves fiscal consolidation vulnerable given the uncertainty of such sources, while tax revenue assumptions depend on a growth outlook subject to downside risks, she added.</p><p class=\"\">MARKETS: The implications for markets appear largely neutral, with analysts viewing the budget as a tailwind for consumer-facing stocks.</p><p class=\"\">Yuan Yiu Tsai at Eastspring Investments flags urban consumption-related stocks  as budget winners over capex-driven ones as they can benefit from the boost to disposable income. Immediate beneficiaries include auto, hospitality and retail stocks, the portfolio manager said.</p><p class=\"\">Goldman Sachs strategists also favor consumer-retail oriented lenders, banks and financial firms, as well as urban-discretionary consumption categories.</p><p class=\"\">RBI RESCUE? Eyes now turn to the Reserve Bank of India meeting Friday--its first under a new governor. The budget's fiscal consolidation has firmed up expectations that a rate cut is coming after GDP data signaled that India's growth slowed to a four-year low.</p><p class=\"\">With a paring back of the fiscal deficit likely to impart a negative fiscal impulse on the economy, the task of lifting growth likely rests on the RBI, HSBC economists said.</p><p class=\"\">Write to Kimberley Kao and Fabiana Negrin Ochoa</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003573:0-india-s-budget-plots-path-for-sustainable-growth/",
            "pub_date": "2025-02-04 19:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003577:0",
            "title": "BOE Could Cut Rates Only Twice More, Pausing in Second Half of 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bank of England could cut interest rates only twice more, including once at this week's meeting, pausing rate reductions by the second half of the year, Berenberg's Andrew Wishart says in a note. Concerns about weak growth and rising unemployment rate are likely to result in faster initial rate reductions, but fears about a rebound in U.K. inflation could then cause the BOE to pause, he says. \"Rising government spending and rate cuts will encourage demand and allow firms to cover higher costs by raising prices.\" Berenberg expects U.K. inflation could reaccelerate to 3.0% in 2025. U.K. money markets price in three rate cuts this year, though a second reduction isn't fully priced in until June. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003577:0/",
            "pub_date": "2025-02-04 19:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308485:0",
            "title": "Enterprise Products Partners' Q4 Earnings Rise, Revenue Falls",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Enterprise Products Partners  reported Q4 earnings Tuesday of $0.74 per diluted share, up from $0.72 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.71. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $14.20 billion compared with $14.62 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $14.13 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308485:0/",
            "pub_date": "2025-02-04 19:14:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1AG:0",
            "title": "Atkore Inc Revises Full-year Adjusted Net income Per Diluted Share Outlook To A Range Of $5.75 to $6.85.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Atkore Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY ADJUSTED NET INCOME PER DILUTED SHARE OUTLOOK ADJUSTED TO $5.75-$6.85</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY2025 EARNINGS PER SHARE VIEW $8.39 — LSEG IBES DATA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1AG:0-atkore-inc-revises-full-year-adjusted-net-income-per-diluted-share-outlook-to-a-range-of-5-75-to-6-85/",
            "pub_date": "2025-02-04 19:14:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}