{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0VR:0",
            "title": "Iceland's central bank cuts policy interest rate to 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Iceland's central bank cut its key policy interest rate to 8.0% from 8.5% on Wednesday and said inflation has continued to fall.</p><p class=\"\">\"Underlying inflation has eased ... and is at its lowest in three years. The outlook is for continued disinflation in coming months,\" the bank's monetary policy committee said in a statement.</p><p class=\"\">    Wednesday's cut was the third     since October    , when the central bank began an easing cycle from a high of 9.25%.  </p><p class=\"\">    The bank had been raising the cost of borrowing since mid-2021 to tackle inflation, lifting the main rate from a low of 0.75%.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0VR:0-iceland-s-central-bank-cuts-policy-interest-rate-to-8/",
            "pub_date": "2025-02-05 16:41:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0FU:0",
            "title": "Weak macro, less contracts to hit 'volatile' Worldline, JPM says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** J.P. Morgan sees Worldline  entering H1 this year burdened by weak consumer market growth in Europe and contract losses, expecting lower earnings across the board</p><p class=\"\">** It urges the French payments group to finalise its decision on company leadership, with a new strategic plan following</p><p class=\"\">** \"Till that strategic plan is announced, the stock is going to remain volatile and is unlikely to substantially break out of its range,\" JPM says</p><p class=\"\">** Only a turnaround in consumer markets or major contract wins for Worldline can change the sentiment, it adds</p><p class=\"\">** Broker sharply cuts its TP by 40% to 8.10 euros ($8.41) from 13.50 euros to adjust to its updated near-term result forecasts</p><p class=\"\">** Out of 21 analysts that cover Worldline, five rate the stock \"strong buy\" or \"buy,\"​ 14 \"hold\" and two​ rate the stock \"strong sell\" or \"sell\"</p><p class=\"\">($1 = 0.9627 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0FU:0-weak-macro-less-contracts-to-hit-volatile-worldline-jpm-says/",
            "pub_date": "2025-02-05 16:42:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002453:0",
            "title": "LG CNS Makes Weak Debut in South Korea — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">LG CNS, an information-technology services affiliate of conglomerate LG Group, made a weak debut in South Korea after the country's biggest initial public offering in three years.</p><p class=\"\">The lackluster listing reflects South Korea's sluggish IPO market and the gloom in the wider equities market. The stock benchmark Kospi has been down more than 3% over the past 12 months.</p><p class=\"\">Shares of LG CNS fell 9.9% to close at 55,800 won, equivalent to $38.44, after opening at 60,500 won in their first day of trading on the Kospi stock exchange Wednesday. The Kospi ended 1.1% higher.</p><p class=\"\">Throughout the session, the shares remained below their IPO price of 61,900 won, the top end of their marketed price rage.</p><p class=\"\">The company, through an oversubscribed share sale in January, raised around $825 million. That marked the largest IPO in South Korea since 2022, when battery maker LG Energy Solution raised more than $10 billion.</p><p class=\"\">LG CNS's estimated market value shrank to $3.72 billion from $4.13 billion over the course of the day after the stock's poor performance.</p><p class=\"\">The IPO market has been sluggish since the second half of 2024 in South Korea, Seoul-based Samsung Securities analyst Changhe Lee said in a recent note.</p><p class=\"\">Most of the country's newly listed companies in January set their IPO prices at the bottom of marketed ranges, and their shares opened below their IPO price, he said.</p><p class=\"\">LG CNS said it plans to use the offering's proceeds for facility investments, acquisitions of other IT firms and debt repayment.</p><p class=\"\">Revenue at the company rose 13% to 5.605 trillion won in 2023, while operating profit was up 12% at 464.05 billion won.</p><p class=\"\">LG Corp., the holding company for LG Group, has a 45% stake in LG CNS.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002453:0/",
            "pub_date": "2025-02-05 16:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463866:0",
            "title": "Hanwha Ocean Delivers Wind Turbine Vessel to Denmark-based Cadeler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hanwha Ocean  delivered Wind Maker, an offshore wind turbine installation vessel (WTIV) to Denmark-based construction engineering company Cadeler on Jan. 31, a month ahead of schedule, Hanwha Ocean said in a LinkedIn post on Tuesday. </p><p class=\"\">The Wind Maker, a 148-meter-long vessel with a lifting capacity of 2,600 metric tons, can install five 15-megawatt turbines in waters up to 65 meters deep. The vessel will begin its initial operations at Taiwan's Changhua country offshore windfarm, according to the post. </p><p class=\"\">Shares of Hanwha Ocean fell more than 1% at market close on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463866:0/",
            "pub_date": "2025-02-05 16:43:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309531:0",
            "title": "Nokia Enters Four-Year Deal Extension With Orange France",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nokia  said Wednesday it has extended its partnership with Orange France with a new four-year contract to upgrade the latter's 5G radio infrastructure with Nokia's AirScale portfolio. </p><p class=\"\">Financial terms were not disclosed. </p><p class=\"\">Orange will also test Nokia's 5G cloud RAN offerings, the company said, adding that it will also provide its MantaRay NM AI-powered radio network management tool.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309531:0/",
            "pub_date": "2025-02-05 16:43:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0VL:0",
            "title": "Trump vows to take over Gaza",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    President Donald Trump said the United States would take over war-ravaged Gaza and create a \"Riviera of the Middle East\" after resettling Palestinians elsewhere, shattering decades of U.S. policy on the Israeli-Palestinian conflict.</p><p class=\"\">The shock move drew swift condemnation from regional heavyweight Saudi Arabia which Trump hopes will establish ties with Israel.</p><p class=\"\">Israel's shekel currency was largely flat against the dollar on Wednesday, trading at 3.56 versus the dollar =&gt;. Israeli and Lebanese sovereign bonds were flat to higher, while those of Jordan and Egypt were flat to lower.</p><p class=\"\">COMMENTS: </p><p class=\"\">ALEX ZABEZHINSKY, CHIEF ECONOMIST, MEITAV DASH BROKERAGE, TEL AVIV:</p><p class=\"\">    \"The markets are reacting in a subdued manner. The gap between the announced plans and their implementation is too great to react to the news in a meaningful way.\"  </p><p class=\"\">    PAUL DONOVAN, CHIEF ECONOMIST, UBS GLOBAL WEALTH MANAGEMENT, LONDON:  </p><p class=\"\">    \"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area.\"  </p><p class=\"\">YONIE FANNING, CHIEF STRATEGIST, MIZRAHI TEFAHOT BANK, TEL AVIV:</p><p class=\"\">\"We're seeing a positive market response to the initiative, this morning in the shekel, and also and at the opening of the TASE (Tel Aviv stock exchange). The equity response being primarily centred around banks gives a good example on how such a geopolitical improvement could tame local risks and support the local economy.\"</p><p class=\"\">DAVID MAKOVSKY, DIRECTOR OF THE PROGRAM ON ARAN-ISRAEL RELATIONS, WASHINGTON INSTITUTE OF NEAR EAST POLICY (ON X):</p><p class=\"\">\"Until the WH (White House) press conference, (Trump's)</p><p class=\"\">call for moving Gazans was seen largely as a negotiating ploy: maximalist opening position before reaching a deal--standard operating approach. </p><p class=\"\">\"Is this still the case? If no longer true, there will be a clamour for the WH to provide more of a blueprint of his proposal on a variety of levels so it is not dismissed. Yet, in immediate sense, Trumps remarks seems to shift media focus away from question of Phase Two of Ceasefire that is supposed to begin later this month. Overlooked, with focus on Trump, is that PM @netanyahu made clear at the press conference Israel would resume the fight against Hamas.\"</p><p class=\"\">FRANCESCO PESOLE, FX STRATEGIST, ING, LONDON:</p><p class=\"\">\"Markets are treating Trump’s announced intention to take over the Gaza Strip and evacuate Palestinians to neighbouring countries with scepticism. Should we see hints that the U.S. is planning to deploy troops in the Middle East, the market implications can be risk-off, oil-positive and dollar-positive, as Arab nations should firmly oppose the move.\"</p><p class=\"\">ALVIN TAN, HEAD OF ASIA FX STRATEGY, RBC CAPITAL MARKETS, SINGAPORE:</p><p class=\"\">\"There’s no discernible reaction. I think in general people are quite skeptical. Number one, those comments came out of nowhere. It upends long standing US policy. In general people are thinking he was just making comments off the cuff and this is not likely to be followed up as genuine U.S. foreign policy.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0VL:0-trump-vows-to-take-over-gaza/",
            "pub_date": "2025-02-05 16:44:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW0CF:0",
            "title": "TotalEnergies beats expectations for fourth-quarter profit, signals stronger 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Q4 profit of $4.4 billion beats estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Group reports stronger power sales, LNG trading</li></ul></span></div><span><p class=\"\">    French oil major TotalEnergies  beat expectations for fourth-quarter earnings on Wednesday as higher trading profits in the gas market helped it offset some of the impact of low oil prices and weak fuel demand.</p><p class=\"\">Adjusted net income for the final three months of 2024 was $4.4 billion, down 15% from $5.2 billion a year previously but slightly higher than the third quarter's $4.1 billion. The results beat expectations for $4.2 billion, according to an analyst consensus compiled by LSEG.</p><p class=\"\">The company said it expects higher gas prices, upstream production and power sales in early 2025. Its shares were up 1.3% at 0842 GMT. </p><p class=\"\">CEO Patrick Pouyanne said at a press briefing that he expects the company to be able to continue investing in renewable energy in the U.S., and added that exports of U.S. LNG are set to practically double in the coming years.</p><p class=\"\">The French firm is the U.S.'s largest LNG exporter with more than 10 million tons under contract.</p><p class=\"\">Total announced a 7% increase in the 2024 dividend to 3.22 euros per share, and for 2025 confirmed share buybacks of $2 billion per quarter.</p><p class=\"\">RBC analyst Biraj Borkhataria said Total's announced dividend growth was \"higher than we anticipated\", and added that the reported 8% gearing \"should allay any concerns around debt levels\".</p><p class=\"\">Western oil majors are facing reduced economic activity and competition from new African and Asian refineries, which caused profit margins for converting crude oil into fuel products to collapse last year. The trend is expected to continue in 2025.</p><p class=\"\">Total's European refining margin for the fourth quarter was $25.90 per metric ton — half the $50.10 realized in late 2023 — while crude oil prices were nearly $10 per barrel lower than the previous year.</p><p class=\"\">Last week Shell, Chevron and ExxonMobil all reported fourth-quarter earnings hard hit by the downturn in refining margins.</p><p class=\"\">Total was able to end the year on a higher note thanks to its integrated LNG division, where traders captured higher profits due to market volatility and boosted earnings by 35% to $1.4 billion. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:656.4617314930991px;aspect-ratio:1.0941028858218318\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L6N3OW0CF-73404401489026fa9eec9ea2a87b6ad8-resized.webp\" type=\"images/webp\"/><img alt=\"A view of quarterly adjusted net income from Paris-listed energy company TotalEnergies from 2019 to 2024.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L6N3OW0CF-73404401489026fa9eec9ea2a87b6ad8-resized.jpeg\" style=\"background-color:#f7e7dc\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">TotalEnergies' quarterly profits, 2019-2024</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW0CF:0-totalenergies-beats-expectations-for-fourth-quarter-profit-signals-stronger-2025/",
            "pub_date": "2025-02-05 16:44:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0LA:0",
            "title": "Goldman Sachs moves Generali to 'neutral' after strong price rally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Goldman Sachs cuts Italy's Generali  to \"neutral\" from \"buy\" as it says its valuation no longer stands out after a \"strong\" share price performance</p><p class=\"\">** The share price performance of Italy's top insurer has seen a 20% increase since mid Sept. 2024, outperforming the 4% increase of the FTSE World Europe (.FTAWEXUKSR) index, GS says</p><p class=\"\">** Its 2026 total capital return yield estimate is at 6.6%, below peers Allianz  and Axa , the broker notes </p><p class=\"\">** Generali's spread over home country 10-year government bond yields is the narrowest in comparison with its peers, it adds</p><p class=\"\">** Out of 21 analysts that cover Generali, seven rate the stock \"strong buy\" or \"buy\", ​nine rate \"hold\" and five​ rate the stock \"strong sell\" or \"sell\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0LA:0-goldman-sachs-moves-generali-to-neutral-after-strong-price-rally/",
            "pub_date": "2025-02-05 16:44:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463881:0",
            "title": "China's Central Bank Conducts Nearly 700-Billion-Yuan Reverse Repo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's central bank on Wednesday conducted a 697-billion-yuan reverse repo operation via a fixed-rate tender. </p><p class=\"\">The operation had a seven-day term with an interest rate of 1.50%, according to a Wednesday filing with the People's Bank of China.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463881:0/",
            "pub_date": "2025-02-05 16:44:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002465:0",
            "title": "Singapore's Retail Sales Likely to Perform Better in 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's retail sales will likely pick up this year, says OCBC's Selena Ling. Retail sales contracted 2.9% on year in December, marking its worst performance since February 2022, she writes. But with the Singapore Tourism Board expecting 17 million-18.5 million visitors this year that could generate S$29 billion to S$30.5 billion in revenue, things look brighter for the retail sector. Domestic consumption is also expected to be supported by a resilient labor market, Ling says. However, she cautions that external headwinds pose as a key risk for the retail sector, and a challenging trade environment may dampen near-term market sentiment. OCBC expects Singapore's retail sales to expand around 2% in 2025 compared to 2024's 1.2% and 2023's 2.3%.(amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002465:0/",
            "pub_date": "2025-02-05 16:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002464:0",
            "title": "Hong Kong Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in HK$ <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Aluminum Corp China             5.09       4.97      +0.12      +2.41 <br/>  Bank of China                   4.07       4.09      -0.02      -0.49 <br/>  Bank of Communications          6.29       6.29       unch       unch <br/>  Bank of East Asia               9.94       9.91      +0.03      +0.30 <br/>  BOC Hong Kong (Holdings)       25.35      25.40      -0.05      -0.20 <br/>  Cafe de Coral Holdings          7.51       7.56      -0.05      -0.66 <br/>  Cathay Pacific Airways         10.10      10.44      -0.34      -3.26 <br/>  China Coal Energy               8.94       9.06      -0.12      -1.32 <br/>  China Construction Bank         6.32       6.41      -0.09      -1.40 <br/>  China Life Insurance           14.44      14.74      -0.30      -2.04 <br/>  China Merchants Port           12.84      12.88      -0.04      -0.31 <br/>  China Mobile                   75.70      76.50      -0.80      -1.05 <br/>  China Overseas Land &amp; Inv      12.00      12.26      -0.26      -2.12 <br/>  China Petro &amp; Chem              4.29       4.30      -0.01      -0.23 <br/>  China Rscs Beer Holdings       23.55      24.25      -0.70      -2.89 <br/>  China Resources Land           22.90      23.15      -0.25      -1.08 <br/>  China Resources Power          17.24      17.28      -0.04      -0.23 <br/>  China Shenhua Energy           31.40      31.70      -0.30      -0.95 <br/>  China Unicom (Hong Kong)        7.15       7.29      -0.14      -1.92 <br/>  CITIC                           8.78       8.94      -0.16      -1.79 <br/>  CK Hutchison Holdings          38.50      39.05      -0.55      -1.41 <br/>  CLP Holdings                   63.95      64.60      -0.65      -1.01 <br/>  CNOOC                          18.56      18.76      -0.20      -1.07 <br/>  COSCO SHIPPING Ports            4.45       4.40      +0.05      +1.14 <br/>  Esprit Holdings                 0.12       0.12       unch       unch <br/>  FIH Mobile                      0.85       0.84      +0.01      +1.19 <br/>  Hang Lung Properties            6.00       6.09      -0.09      -1.48 <br/>  Hang Seng Bank                 97.90      98.85      -0.95      -0.96 <br/>  Henderson Land Devt            21.65      22.00      -0.35      -1.59 <br/>  Hong Kong &amp; China Gas           5.93       5.95      -0.02      -0.34 <br/>  HK Exchanges &amp; Clearing       305.80     312.00      -6.20      -1.99 <br/>  Hong Kong Tech Venture          1.28       1.28       unch       unch <br/>  HSBC Holdings                  80.20      80.05      +0.15      +0.19 <br/>  i-CABLE Communications          0.03       0.03       0.00      -3.45 <br/>  Ind &amp; Comml Bk of China         5.36       5.39      -0.03      -0.56 <br/>  Manulife Financial            230.00     229.00      +1.00      +0.44 <br/>  Mongolia Energy                 0.55       0.55       unch       unch <br/>  MTR                            24.35      24.65      -0.30      -1.22 <br/>  New World Development           4.08       4.18      -0.10      -2.39 <br/>  PetroChina                      6.01       6.05      -0.04      -0.66 <br/>  Ping An Ins of China           43.55      44.00      -0.45      -1.02 <br/>  Power Assets Holdings          50.05      50.25      -0.20      -0.40 <br/>  Sino Land                       7.44       7.50      -0.06      -0.80 <br/>  SINOPEC Shg Petrochem H         1.19       1.20      -0.01      -0.83 <br/>  Sun Hung Kai Properties        69.75      71.15      -1.40      -1.97 <br/>  Swire Pacific A                65.25      67.20      -1.95      -2.90 <br/>  Tencent Holdings              417.80     420.80      -3.00      -0.71 <br/>  Tsingtao Brewery               49.00      48.95      +0.05      +0.10 <br/>  VTech Holdings                 51.45      51.35      +0.10      +0.19 <br/>  Wharf (Holdings)               18.68      19.44      -0.76      -3.91 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002464:0/",
            "pub_date": "2025-02-05 16:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002466:0",
            "title": "DCC's Healthcare Disposal Could Unlock Significant Shareholder Value — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DCC's process to sell its healthcare segment, in order to focus on the energy sector, could significantly boost returns to shareholders, Davy Research analyst Colin Grant says. The Irish research firm forecasts that DCC could receive 1.365 billion pounds for the division. This is more than 15 times the FY 2025 Ebitda expectations of 88 million pounds, the analyst adds in a note. Assuming that most of the cash will be returned to shareholders, this means that the disposal will unlock significant value as the deal could be far ahead of DCC's current valuation, Grant adds. DCC said in its third-quarter update that the disposal is progressing in line with expectations, the analyst says. Shares are down 2.4% at 53.65 pounds. (michael.susin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002466:0/",
            "pub_date": "2025-02-05 16:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSX:0",
            "title": "Italian services sector growth slows, employment drops, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Italy's services sector grew marginally in January but underlying demand conditions remained weak and employment levels decreased, a survey showed on Wednesday.</p><p class=\"\">The HCOB Global Purchasing Managers' Index for services edged down to 50.4 in January from 50.7 in December, remaining just above the 50 mark that separates growth from contraction.</p><p class=\"\">That came broadly in line with a median forecast of 50.5 in a Reuters survey of 14 analysts. </p><p class=\"\">New business declined for a third consecutive month, coming in at 49.0 from a previous 49.1, while the employment index fell to 49.0 from 51.3 in December, returning to negative territory for the first time since October. </p><p class=\"\">\"Activity in the Italian service sector remains within the growth area, but only marginally,\" said HCOB economist Jonas Feldhusen. \"Underlying demand remains weak and has worsened again.\" </p><p class=\"\">A sister survey for the manufacturing sector published on Monday showed contraction for a 10th month running in January and at roughly the same pace as the month before.</p><p class=\"\">Overall, Italy's private sector continued to contract slightly, with the composite PMI at 49.7, unchanged from December and below the 50 mark for a third month running.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSX:0-italian-services-sector-growth-slows-employment-drops-pmi-shows/",
            "pub_date": "2025-02-05 16:45:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002422:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0837 GMT - The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p><p class=\"\">0830 GMT - Yields on U.K. government bonds, or gilts, fall ahead of an anticipated interest-rate cut by the Bank of England this week. Markets price in a 98% probability of a 25 basis-point cut to 4.5% on Thursday, LSEG Refinitiv data show. \"I suspect this Thursday's BOE will be sufficiently dovish to strongly raise odds of another cut already at the March meeting,\" Saxo's John Hardy says in a note. The 10-year gilt yield falls 3 basis points to 4.488%, Tradeweb data show. (miriam.mukuru@wsj.com)</p><p class=\"\">0822 GMT - The euro's gains will likely prove limited as it remains broadly unattractive given weak macroeconomic fundamentals and President Trump's threats to impose tariffs on the EU, ING analyst Francesco Pesole says. Wide eurozone-U.S. interest rate differentials in favor of the dollar reflect these factors, he says in a note. Trade news will dominate euro price action, although it will be interesting to hear whether the unexpected acceleration in January eurozone inflation triggers some change in the narrative from European Central Bank members. The ECB's chief economist, Philip Lane, is due to speak at 1400 GMT in Washington, DC. The euro rises 0.2% to $1.0402. (renae.dyer@wsj.com)</p><p class=\"\">0811 GMT - Singapore's retail sales could strengthen this year after a soft performance in 2024, buoyed by new attractions and other tailwinds, UOB associate economist Jester Koh writes in a note. Retail sales fell again in December due to weak tourist arrival numbers. For the full year, retail sales growth fell to 1.2% from 2.3% in 2023, with eight of 14 retail sales categories declining, he notes. Looking ahead, he expects new attractions, including Singapore's fifth zoological park, to lend support to sales. The upcoming budget 2025 is likely to be expansionary and further support measures could also lift sales, he adds. (amanda.lee@wsj.com)</p><p class=\"\">0803 GMT - The 10-year French-Spanish government bond yield spread is gradually nearing the 5 basis point threshold, signalling improving sentiment over France, Natixis analysts say in a note. The spread hasn't reached this level since last November, they say, describing it \"a sign that investor perception of France is less pessimistic than before.\" The 10-year French-Spanish yield differential is 5.6 basis points, according to LSEG data. French Prime Minister Francois Bayrou used special executive powers on Monday to push the 2025 budget through parliament without a vote, while facing a no-confidence motion on Wednesday. (emese.bartha@wsj.com)</p><p class=\"\">0802 GMT - The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p><p class=\"\">0756 GMT - There are some green shoots in China's consumption spending, but caution persists, HSBC Global Research analysts write in a note. Preliminary data show the country's box office sales exceeded 9 billion yuan during the Lunar New Year holiday, while domestic travel reached a new record of over 2.33 billion cross-regional trips within China, they say. These are positive signs for consumer sentiment, but HSBC remains cautious over whether the holiday spirit can translate into more sustainable momentum without further stimulus. Another fiscal policy push is still needed to drive a sustained increase in activities in the coming months, especially given geopolitical uncertainty, HSBC adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0754 GMT - Citi expects Malaysia's minimum wage hike to boost consumer spending, with median wages projected to grow by a high single digit in 2025, analyst Huan Wen Gan writes in a note. The minimum wage was raised to MYR1,700/month from MYR1,500/month on Feb. 1. Retail trade, particularly at convenience stores and mini-markets, is likely see further support, he adds. The agriculture sector has lower median wages, but oil palm harvesters already earn above the new threshold, minimizing the impact on palm oil players, he reckons. Mr. D.I.Y. Group (M) may face higher labor costs, with an 8% wage hike factored into 2025 earnings estimates, he says. For every 1% increase in wages could result in a 0.8% cut in its 2025 net profit forecast, he adds. Given stronger consumption trends and stable earnings potential, Citi remains positive on Malaysia's consumer sector. (yingxian.wong@wsj.com)</p><p class=\"\">0732 GMT - German Bunds are running into resistance ahead of the yield lows of the year, but shaky risk sentiment and a sanguine European Central Bank wage tracker should keep the momentum going, says Commerzbank Research's Michael Leister. \"With the ongoing focus on trade wars and fragile risk sentiment we expect Bunds to stay bid,\" the head of interest rates strategy says in a note. That said, the air is getting thinner for Bunds as yields are approaching the lows recorded in the initial sessions of the year, Leister says. In addition, risk-off once again turns out to not be self-reinforcing, with equities stuck at the highs, he says. The 10-year German Bund yield falls 2.5 basis points to 2.374%, tracking U.S. Treasury yields lower, according to Tradeweb. (emese.bartha@wsj.com)</p><p class=\"\">0730 GMT - Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0717 GMT - The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002422:0/",
            "pub_date": "2025-02-05 16:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002420:0",
            "title": "Canadian Dollar Continues to Recover From Tariff Hit — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002420:0/",
            "pub_date": "2025-02-05 16:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463876:0",
            "title": "Getlink's ElecLink Interconnector Set to Come Back Online After Final Assessments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Getlink  said the ElecLink electricity interconnector between France and the UK is set to be gradually brought back into service from Wednesday, according to a same-day release. </p><p class=\"\">The tunnel and railway operator is carrying out final assessments and testing, which is scheduled to be completed on Feb. 10. The company estimates a 25 million-euro impact from the suspension of activity for the first weeks of 2025. </p><p class=\"\">The interconnector's operations have been suspended since Sept. 25, 2024, after a fault was detected.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463876:0/",
            "pub_date": "2025-02-05 16:37:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463879:0",
            "title": "Nama Chemicals Unit Terminates Wastewater Treatment Contracts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nama Chemicals (SASE:2210) subsidiary Jubail Chemical Industries, or Jana, terminated two wastewater treatment deals with Green Dimension Co. for Environmental Services and Confident Engineering International. </p><p class=\"\">The Saudi chemical manufacturer said Wednesday that the alliance breached its contracts for Jana's chloride and epoxy resins plants and failed to remedy the breaches despite a grace period. </p><p class=\"\">The company said it reserves all its legal and financial rights to pursue compensation and damages.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463879:0/",
            "pub_date": "2025-02-05 16:37:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002431:0",
            "title": "Novo Nordisk Earnings, Guidance Imply Consensus Upgrades — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Novo Nordisk's initial 2025 outlook is just ahead of Jefferies's expectations. But given a higher starting point and stronger currency effects it suggests up to 6% sales and 10% EBIT consensus upgrades, analysts at the bank write. Novo Nordisk's fourth-quarter sales beat expectations by 5%, mostly on positive U.S. gross-to-net adjustments--the discount offered between the list price and the actual net sales price--for its insulins. Sales of Wegovy were shy of expectations while Ozempic and Rybelsus were in line. A better gross margin, higher research and development costs but less selling and distribution spend helped EBIT beat by 9% and EPS by 6%. The stock will likely tick higher initially but could then fade, Jefferies says. Shares trade 4.2% higher at 617.20 Danish kroner. (dominic.chopping@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002431:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002429:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0837 GMT - GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p><p class=\"\">0834 GMT - The cancellation of the \"de minimis\" rule, which allowed low-value shipments to bypass duties and custom scrutiny, as well as the subsequent suspension of Chinese goods shipments by the U.S. Postal Services, should be manageable for PDD Holdings' Temu, says Nomura analyst Jialong Shi tells Dow Jones Newswires. Temu has been preparing for this change in the past year, Shi notes, pointing to the company introducing a half consignment model in early 2024. Under this model, merchants typically ship products to the U.S. in bulk rather than relying on the so-called \"de minimis\" exemption, which was recently revoked by President Trump, Shi notes. While Temu still has significant growth potential in the U.S. market at this stage, uncertainties remain over whether the U.S. government will introduce new regulations to these Chinese companies, he says. (tracy.qu@wsj.com)</p><p class=\"\">0830 GMT - Novo Nordisk's sales guidance is materially ahead of expectations, Intron Health's Naresh Chouhan writes. The company expects sales to grow 16%-24% this year with EBIT growing 19%-27%. Fourth-quarter EBIT beat expectations by 9% as the gross margin beat by 140 basis points and the EBIT margin beat by 170 basis points. \"Given recent concerns on growth, we expect the shares to be up strongly this morning given the sales guidance is materially higher than consensus was expecting and Wegovy was in-line,\" Chouhan says. Shares trade 4.3% higher at 617.90 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0826 GMT - Carabao Group faces earnings hit from higher competition in Thailand's energy drink market, Maybank Securities (Thailand)'s Tanida Jirapornkasemsuk says in a research report. Carabao Group's rival Osotspa plans to launch a new 'M-150 Yellow' energy drink by mid-February, the analyst notes. Osotspa's new energy drink features the drink's original flavor, which was among Thailand's most popular energy drinks, the analyst says. Carabao could lose a 0.5-percentage-point share of the energy drink market in 2025, the analyst estimates. The brokerage cuts its 2025-2026 earnings forecasts for Carabao by 5.8%-6.5%. It lowers the stock's rating to hold from buy and the target price to THB71.75 from THB95.00. Shares are 1.7% lower at THB72.75. (ronnie.harui@wsj.com)</p><p class=\"\">0812 GMT - DCC's third-quarter results were driven by growth in its key energy division, RBC Capital Markets analyst Andrew Brooke says in a note. The FTSE 100 company said its energy segment's performance remains robust despite warm weather, the analyst adds, noting that the healthcare unit's profit was flat while profit declined in technology. RBC expects a positive topline performance in the short term, along with the disposal of healthcare forecast in the next six months and further delivery of its energy strategy--including acquisitions--, Brooke says. \"Whilst energy standalone is tough to value, the division is cleaner, has positive mix drivers, is higher return and has more favorable working capital dynamics,\" he adds. Shares are down 2.2% at 53.75 pounds. (michael.susin@wsj.com)</p><p class=\"\">0812 GMT - Great Wall Motor's February sales volume will likely stay flat on month, but may recover somewhat in March, Citi analysts write in a note, citing company management. The automaker's January exports dropped on month due to the New Year holiday outside China, and it expects overseas sales growth in February and March due to postholiday promotional events. Meanwhile, the carmaker's new Tank 500 model, released this year, has secured 2,000 new orders since Jan. 2, Citi notes. Great Wall Motor will be a beneficiary of growth in the EV sector and EVs' higher market share in China, the bank says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0802 GMT - The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p><p class=\"\">0754 GMT - Citi expects Malaysia's minimum wage hike to boost consumer spending, with median wages projected to grow by a high single digit in 2025, analyst Huan Wen Gan writes in a note. The minimum wage was raised to MYR1,700/month from MYR1,500/month on Feb. 1. Retail trade, particularly at convenience stores and mini-markets, is likely see further support, he adds. The agriculture sector has lower median wages, but oil palm harvesters already earn above the new threshold, minimizing the impact on palm oil players, he reckons. Mr. D.I.Y. Group (M) may face higher labor costs, with an 8% wage hike factored into 2025 earnings estimates, he says. For every 1% increase in wages could result in a 0.8% cut in its 2025 net profit forecast, he adds. Given stronger consumption trends and stable earnings potential, Citi remains positive on Malaysia's consumer sector. (yingxian.wong@wsj.com)</p><p class=\"\">0753 GMT - Chinese shares ended mixed on their first trading day after the Lunar New Year break, as investors digest the latest trade developments between China and the U.S. The Shanghai Composite Index fell 0.65% to 3229.49, the Shenzhen Composite Index rose 0.4% and the ChiNext Price Index was flat. PMI data signaling softer services sector growth was also in focus. Still, the view that the U.S.'s initial 10% tariff is milder than expected, and that China's response also seems moderate, likely limited some losses. Tech led the gains, with Beijing Kingsoft Office Software 18% higher. Hygon Information Technology added 8.8% and iFlytek gained 7.4%. Decliners included Yonghui Superstores, which jumped 4.8%, and Midea, which was 2.3% higher. (tracy.qu@wsj.com)</p><p class=\"\">0752 GMT - China's artificial-intelligence sector will likely shift from developing foundational models to creating AI applications, Bernstein analysts write in a note. The country's AI ecosystem will likely become much more open-sourced and foundational model costs may come down, thanks to the development of DeepSeek, they add. Industry focus will now turn to application development, they say. Progress in using less advanced chips to create more advanced AI capabilities will make AI development more competitive, opening the gates to a cottage industry of models that can replicate fast and at a lower cost, they add. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0748 GMT - Santander posted a strong set of fourth-quarter results alongside guidance for 2025 and plans for capital returns to shareholders that are better than expected, Barclays's Cecilia Romero Reyes and Paola Sabbione say in a research note. The Spanish bank reported quarterly net profit and revenue that exceeded consensus forecasts, with results in Spain, Mexico, Brazil and the U.S. that were better than anticipated, Barclays says. The group's 2025 target for return on tangible equity--a profitability measure--of more than 17% is at the high end of previous guidance. Moreover, its intention to return 10 billion euros through buybacks is ahead of consensus expectations of 6 billion euros, according to Barclays. (adria.calatayud@wsj.com)</p><p class=\"\">0740 GMT - Investors could be concerned about Nissan's future as its board is planning to reject Honda's merger terms, Morningstar analyst Vincent Sun says. Nissan would face pressure surviving amid stiff competition in the U.S. and China, especially as it has a larger risk exposure to U.S. tariffs on Mexico than Honda and Toyota, the analyst says. However, even if the merger goes through, that wouldn't solve the challenges the two companies face. Both carmakers lack compelling EV offerings, and the combined entity would need to build a new EV model pipeline, he says. The two could benefit from larger scale and cost synergy, but that would take time to realize, Sun says. In any case, Nissan would find it difficult to \"play a smaller role in the new entity rather than standing on an equal footing with Honda,\" he adds. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002429:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002426:0",
            "title": "GSK Needs to Show It Can Navigate Vaccines Challenge — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002426:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002430:0",
            "title": "French Industry Ends Year in the Doldrums — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joshua Kirby</p><p class=\"\">French factory production unexpectedly dropped at the end of the year, contributing to a backsliding in the eurozone's second-largest economy, with few signs of a rapid rebound at the start of 2025.</p><p class=\"\">Total output of goods was 0.7% lower on month in December, reversing a slight increase in November, statistics agency Insee said Wednesday. That was a worse result than the stagnation forecast by economists, according to a poll compiled by The Wall Street Journal, and means output decreased in seven out of 12 months last year.</p><p class=\"\">The transportation sector saw a steep drop in December, with an 11% fall in automobile production, a fresh blow to Europe's beleaguered automakers. Other key areas including pharmaceuticals also booked heavy reductions in output over the month.</p><p class=\"\">The latest activity surveys meanwhile suggest French manufacturers remained in a deep slump in January as they brace for the impact of President Trump's promised tariffs on European goods imported into the U.S. The European Central Bank last week cut interest rates again in an effort to ease some of the burden on economic activity in the eurozone. ECB President Christine Lagarde has warned that a chillier trade backdrop could act as a brake on European growth.</p><p class=\"\">For France, there is hope that greater political stability might brighten the mood for industrial employers and investors as the year progresses. Prime Minister Francois Bayrou is expected to survive a confidence vote in the French legislature later Wednesday, having earlier this week forced through a budget after months of delays.</p><p class=\"\">But even a better-functioning government can't rescue France from its economic malaise, Commerzbank economist Vincent Stamer warned. Growth in the French economy last year was spurred by state spending  but the government must now tighten its belt drastically, he told clients in a note. That will further darken sentiment, Stamer said.</p><p class=\"\">\"Entrepreneurs and investors are not only assessing the current situation, but are also forming expectations for the future,\" he said. \"The outlook for the French economy is clearly very bleak.... for the coming years.\"</p><p class=\"\">Write to Joshua Kirby at joshua.kirby@wsj.com; @joshualeokirby</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002430:0/",
            "pub_date": "2025-02-05 16:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463882:0",
            "title": "Sweden's Ericsson Names New Chief People Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ericsson (ERIC-B.ST, ERIC-A.ST) appointed Charlotte Levert as its new chief people officer, effective Feb 10. </p><p class=\"\">Levert will succeed MajBritt Arfert, who will leave the Swedish networking and telecommunications company at the end of May, according to a Wednesday release. </p><p class=\"\">Levert is currently the vice president and head of people business area cloud and software services.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463882:0/",
            "pub_date": "2025-02-05 16:39:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463875:0",
            "title": "China Greenlights HBM's Investigational New Drug for COPD",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HBM Holdings  said China's National Medical Products Administration (NMPA), through its Centre for Drug Evaluation, has granted clearance for its Investigational New Drug application for the treatment of chronic obstructive pulmonary disease (COPD). </p><p class=\"\">The drug inhibits the TSLP-mediated signaling pathway by blocking the interaction between TSLP and TSLP receptor, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463875:0/",
            "pub_date": "2025-02-05 16:39:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446703:0",
            "title": "Zambia Private Sector Growth Strengthens",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Stanbic Bank Zambia PMI rose to 50.9 in January 2025, slightly up from 50.8 in December, signaling a modest improvement in private sector conditions and the strongest expansion since July 2023.</p><p class=\"\">The increase in new orders drove the improvement, with firms citing sustained client demand as the key factor.</p><p class=\"\">However, output levels continued to decline at a marginal pace, marking a softer contraction than much of 2024.</p><p class=\"\">Meanwhile, employment saw its sharpest rise in seven years, as firms expanded hiring to meet demand, the fastest rate since January 2018.</p><p class=\"\">Regarding prices, cost pressures softened, with inflation in purchase and staff costs easing, though selling prices rose slightly as businesses passed costs to customers.</p><p class=\"\">Despite challenges, business confidence improved, with firms optimistic that rising demand, diversification, and increased marketing will drive stronger growth in 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446703:0-zambia-private-sector-growth-strengthens/",
            "pub_date": "2025-02-05 16:40:33",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW0E7:0",
            "title": "India's Tega Industries surges on higher Q3 profit, revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of India's Tega Industries  surge nearly 14% to two-month high of 1,736.5 rupees</p><p class=\"\">** Co, which makes consumable products for mining sector, posts 52% y/y rise in Q3 consolidated profit; revenue up 20%</p><p class=\"\">** Its Q3 total expenses gain 14.6%, slower than revenue growth of 20%, aiding profit rise</p><p class=\"\">** Stock up 10.9% so far in 2025; rose 36% last year </p><p class=\"\">** Analysts' average rating on stock is \"buy\"; median PT 1,980.50 rupees - data compiled by LSEG</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW0E7:0-india-s-tega-industries-surges-on-higher-q3-profit-revenue/",
            "pub_date": "2025-02-05 16:40:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463874:0",
            "title": "Market Chatter: Beijing Join-Cheer Software Develops Intelligent Entities Based on Nuwa GPT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Beijing Join-Cheer Software Co  developed multiple fields and industry-specific intelligent entities based on Nuwa GPT, Securities Times reported Wednesday. </p><p class=\"\">Nuwa GPT is a Chinese large language model developed by DeepSeek. </p><p class=\"\">Shares of the management software provider closed nearly 5% higher Wednesday. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463874:0/",
            "pub_date": "2025-02-05 16:40:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0CP:0",
            "title": "Infineon Technologies Closes EUR 2.0 Bln Revolving Credit Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">INFINEON TECHNOLOGIES AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLOSES €2.0 BILLION REVOLVING CREDIT FACILITY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0CP:0-infineon-technologies-closes-eur-2-0-bln-revolving-credit-facility/",
            "pub_date": "2025-02-05 16:32:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463872:0",
            "title": "Vinati Organics Infuses Additional INR488 Million in Wholly Owned Unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vinati Organics  has invested an additional 488.1 million Indian rupees in its wholly owned subsidiary, Veeral Organics, according to a filing to the stock exchanges on Wednesday. </p><p class=\"\">The company has subscribed to an additional 48,810,200 fully paid-up equity shares of the face value of 10 rupees each through subscription towards the rights issue of Veeral Organics. </p><p class=\"\">Veeral Organics manufactures organics fine specialty chemicals. </p><p class=\"\">Shares of the company were down over 1% in recent trade</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463872:0/",
            "pub_date": "2025-02-05 16:32:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002398_20250205002398:0",
            "title": "Infineon Technologies Signs EUR2.0B Revolving Credit Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002398_20250205002398:0/",
            "pub_date": "2025-02-05 16:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463873:0",
            "title": "Tokai Tokyo Upgrades Fujicco to Neutral from Underperform; Price Target is 1,670 Yen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463873:0/",
            "pub_date": "2025-02-05 16:33:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}