{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0N0:0",
            "title": "Norway's DNB tops quarterly profit view as economy gains steam",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Norway's largest bank DNB  reported a bigger-than-expected jump in fourth-quarter earnings on Wednesday, and said the Norwegian economy is gaining momentum, driven by increased housing market activity and rising demand for financing.</p><p class=\"\">DNB's net profit rose 34.8% to 12.68 billion crowns ($1.13 billion) during October-December, from 9.40 billion a year earlier. Analysts, on average, had expected 9.99 billion crowns, according to a company-compiled poll.</p><p class=\"\">High interest rates have bolstered Nordic banks' profit over the past two years. While other central banks in the region have started to ease their monetary policy, Norway has kept its policy rate steady to cool the economy, curb inflation and address rising business costs.</p><p class=\"\">     ($1 = 11.2314 Norwegian crowns)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0N0:0-norway-s-dnb-tops-quarterly-profit-view-as-economy-gains-steam/",
            "pub_date": "2025-02-05 14:44:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0HO:0",
            "title": "Mining and energy stocks lift Australian shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">ASX 200 gains after losing for two days</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold stocks hit record high</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Miners log best day in a month</li></ul></span></div><span><p class=\"\">    Australian shares regained some lost ground on Wednesday, helped by gains in mining and energy-focused stocks, a day after the country's top trading partner China took retaliatory measures responding to U.S. tariffs. </p><p class=\"\">The S&amp;P/ASX 200 index  closed 0.5% higher at 8416.9.</p><p class=\"\">U.S. President Donald Trump on Tuesday suspended tariffs on Mexico and Canada for a month, but imposed a 10% tariff on Chinese imports, prompting China to retaliate with levies on U.S. imports.</p><p class=\"\">Miners , which have a roughly 25% weightage on the benchmark and are heavily exposed to China, closed 1.7% higher, after clocking their biggest intra-day jump since Dec. 10.</p><p class=\"\">World's largest listed miner BHP Group  and sector heavyweights Fortescue  and Rio Tinto  all rose over 1.5%.</p><p class=\"\">\"The mining sub-index is having a snap back rally after the poor start to the year,\" said Damian Rooney, director of equity sales at Argonaut. The sub-index fell more than 18% in 2024.</p><p class=\"\">\"Iron ores led the way...on hopes that a U.S. and China trade war can be averted despite the first tariffs levied.\"</p><p class=\"\">Energy stocks  rose 1.5%, led by Karoon Energy  and Boss Energy , each up over 3%. </p><p class=\"\">Oil prices remain volatile amid trade war tensions, falling 3% on China's tariffs on Tuesday, although prices partially rebounded on Wednesday. </p><p class=\"\">Gold miners  rose as much as 1.9% to hit a record high earlier in the day, tracking strength in bullion prices. </p><p class=\"\">Northern Star  and Evolution Mining  advanced 1.7% and 2.1%, respectively.</p><p class=\"\">Meanwhile, shares in fund-manager Insignia Financial  surged to their highest in over three years after Brookfield Capital  matched rivals Bain Capital's and CC Capital's bid for the company.</p><p class=\"\">In New Zealand, the benchmark S&amp;P/NZX 50 index  fell 0.5% to end at 12,844.6.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0HO:0-mining-and-energy-stocks-lift-australian-shares/",
            "pub_date": "2025-02-05 14:44:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001068_20250205001149:0",
            "title": "Vestas Wind Systems 2024 Order Intake 17GW, EUR19B in value",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001068_20250205001149:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0M5:0",
            "title": "State Bank of India aims to raise 50 bln rupees via perpetual bonds, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The State Bank of India  is looking to raise around 50 billion rupees ($573.38 million) via Basel III-compliant additional Tier-I perpetual bonds before the end of February, three sources aware of the matter said on Wednesday.</p><p class=\"\">The country's largest lender could have a call option at the end of either five years or 10 years on the issue, the sources added.</p><p class=\"\">\"The lender has already started talking about the issue and based on investor feedback, they will take a final decision on the call option as well as the timing to launch this issue. Insurance companies are expected to be among the bidders,\" one of the sources said.</p><p class=\"\">SBI did not immediately reply to a Reuters email seeking comment. The sources declined to be named as they are not authorised to speak to the media.</p><p class=\"\">This would be the first such issuance from any lender in over three months.</p><p class=\"\">Incidentally, SBI was the last issuer that had tapped this route, when it raised 50 billion rupees at a coupon of 7.98% in October. This issue had a call option at the end of 10 years.</p><p class=\"\">Bankers also expect some mutual funds to participate in the latest issue since, earlier this year, the market regulator allowed mutual funds to value perpetual bonds based on their call option, a move that has improved appetite for such debt.</p><p class=\"\"> ($1 = 87.2025 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0M5:0-state-bank-of-india-aims-to-raise-50-bln-rupees-via-perpetual-bonds-sources-say/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000877_20250205001154:0",
            "title": "Novo Nordisk Plans to Initiate New CagriSema Phase 3 Trial in 2025 to Further Explore Weight Loss Potential",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000877_20250205001154:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001133_20250205001133:0",
            "title": "KDDI Corp Sees FY Net Y690.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001133_20250205001133:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001131_20250205001131:0",
            "title": "KDDI Corp 9-Mos Rev Y4.36T Vs Y4.27T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001131_20250205001131:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001132_20250205001132:0",
            "title": "KDDI Corp 9-Mos Oper Pft Y864.57B Vs Pft Y847.70B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001132_20250205001132:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001130_20250205001130:0",
            "title": "KDDI Corp 9-Mos Net Y536.53B Vs Net Y545.53B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001130_20250205001130:0/",
            "pub_date": "2025-02-05 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN19bw2l:0",
            "title": "Bergman & Beving's Interim Report 1 April–31 December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Third quarter (1 October–31 December 2024)</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue rose by 6 percent to MSEK 1,264 (1,187).</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 10 percent to MSEK 121 (110) and the EBITA margin improved to 9.6 percent (9.3).</li><li class=\"listItem-bmN0_SHH\">Net profit amounted to MSEK 54 (55) and earnings per share after dilution totalled SEK 1.95 (1.95).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities totalled MSEK 214 (207).</li><li class=\"listItem-bmN0_SHH\">Four acquisitions have been completed, with annual revenue of approximately MSEK 310.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nine months (1 April-31 December 2024)</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue rose by 4 percent to MSEK 3,661 (3,509).</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 12 percent to MSEK 360 (322) and the EBITA margin improved to 9.8 percent (9.2).</li><li class=\"listItem-bmN0_SHH\">Net profit rose by 10 percent to MSEK 167 (152).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities totalled MSEK 502 (562).</li><li class=\"listItem-bmN0_SHH\">Earnings per share for the most recent 12-month period amounted to SEK 7.55 after dilution, compared with SEK 7.15 for the 2023/2024 financial year.</li><li class=\"listItem-bmN0_SHH\">Six acquisitions have been completed, with total annual revenue of approximately MSEK 390.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">CEO’s comments</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Another quarter in the right direction</strong></p><p class=\"\">We have now put yet another quarter behind us with increased profit, strengthened margins, improved profitability (P/WC) and a strong cash flow. EBITA increased by 10 percent to MSEK 121 (110), while the EBITA margin rose to 9.6 percent (9.3). Our efforts to improve profitability continued to have an effect. P/WC increased by 6 percentage points to 30 percent (24) and cash flow from operating activities increased to MSEK 214 (207) during the quarter.</p><p class=\"\">The Group’s positive performance is the result of the focus, commitment and hard work of our organisation in challenging business conditions. It is encouraging to see that Division Core Solutions and Division Industrial Equipment are continuing to increase their earnings and profit margins. Division Safety Technology delivered at roughly the same level as in the preceding year, but I expect that the division – as a first step – will return to its previous profit and margin levels.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenging market – stronger results</strong></p><p class=\"\">Although the economic climate remains weak for the majority of our companies, we increased the Group’s revenue by 6 percent during the quarter due to our acquisitions. Organic revenue decreased 5 percent, which reflects the developments in the construction and manufacturing sectors in the Nordic countries, with the number of employees decreasing during the autumn. Despite these challenges, our decentralised governance model and clear capital allocation demonstrate just how adaptable our companies are. For example, ESSVE increased its revenue due to three new major customer contracts in Sweden, and Cresto Group secured its first large order for rescue equipment from yet another global wind power manufacturer. Our efforts to optimise our product range and inventory resulted in an organic decrease of MSEK 172 in working capital during 2024, of which inventory accounted for MSEK 93. Moreover, Fastit divested its operations in Asia during the quarter, and I cannot rule out that further structural measures in the Group may be necessary.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Four new companies strengthen the Group</strong></p><p class=\"\">During the quarter, we welcomed four new companies to the Group: three Finnish and one Swedish, which together generate revenue of MSEK 310 with good profitability. In Finland, we acquired Levypinta, Ovesta and Labsense. Levypinta manufactures bespoke high-pressure laminate boards, primarily for manufacturers of special furniture used in schools and public properties in Finland and Sweden. Ovesta sells primarily customised fireproof and soundproof doors to construction and real estate companies for installation in public properties. Labsense is a distributor to several leading global suppliers of technical laboratory equipment sold to the public and private sectors in Finland. In Sweden, we acquired Collinder Märksystem, a leading company in safety and industrial signage. The company strengthens our position in the growing segment of safety and industrial signage, a niche where we are already present with companies in Sweden, Norway and Denmark.</p><p class=\"\">Our strong financial position has made it possible for us to achieve our acquisition goals, which has enabled us to maintain profit growth despite challenging market conditions. The new acquisitions supplement our existing portfolio, and we look forward to seeing the companies contribute the Group’s continued progress. I would also like to take this opportunity to warmly welcome all our new employees to the B&amp;B Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">We are building for the future</strong></p><p class=\"\">In my previous CEO comments, I mentioned that diamonds form under pressure. It does not appear that this pressure will ease in the near future, but these challenging times are driving our companies to continue to increase their efficiency, develop their customer and product mix, and improve their capital efficiency – thereby allowing the companies to grow stronger and position themselves for a stronger market. I am confident that our existing companies, in combination with acquisitions, will ensure that we continue to deliver positive earnings and improvements to profitability going forward. Our trend of increased profit over 20 consecutive quarters is proof that we are on the right path.</p><p class=\"\">Stockholm, February 2025</p><p class=\"\">Magnus Söderlind</p><p class=\"\">President &amp; CEO</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN19bw2l:0-bergman-beving-s-interim-report-1-april-31-december-2024/",
            "pub_date": "2025-02-05 14:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW07M:0",
            "title": "Yuan slips on trade-war anxiety; yen jumps",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Onshore yuan falls following return from extended break</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Yen rises on upbeat Japanese wage gain, rising bets of BOJ hike</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar on the back foot, giving respite to peers</li></ul></span></div><span><p class=\"\">    The yuan sank on Wednesday as a new Sino-U.S. trade war shook Chinese markets returning from an extended Lunar New Year break, while the yen jumped on rising bets of more Bank of Japan (BOJ) rate hikes this year.</p><p class=\"\">The dollar rose more than 0.5% against the yuan  to a high of 7.2863 in onshore trade, though its gains were capped by the People's Bank of China (PBOC) setting a stronger-than-expected yuan midpoint rate, around which the currency is allowed to trade in a 2% band.</p><p class=\"\">The fixing had been closely watched by investors for clues on whether Beijing would allow the currency to weaken to blunt the impact of sweeping new tariffs imposed by U.S. President Donald Trump.</p><p class=\"\">China on Tuesday slapped tariffs on U.S. imports in a swift response to the U.S. duties on Chinese goods, and Trump said the same day he is in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the world's two largest economies.</p><p class=\"\">\"Our base case is that China will increase its tolerance for currency weakness in response to the U.S. tariffs,\" said Carol Kong, a currency strategist at Commonwealth Bank of Australia (CBA).</p><p class=\"\">\"I think ultimately, allowing the yuan to weaken will be one of the responses China takes, and I would expect further retaliation from China if the U.S. retaliates with even more tariffs.\"</p><p class=\"\">The offshore yuan  was marginally stronger at 7.2835 per dollar on Wednesday, recovering from its fall to a record low of 7.3765 per dollar at the start of the week.</p><p class=\"\">During Trump's first term as president, the yuan was allowed to weaken more than 12% against the dollar during a series of tit-for-tat U.S-Sino tariff announcements between March 2018 and May 2020.</p><p class=\"\">The Australian dollar , often used as a more liquid proxy for the yuan, was a touch weaker at $0.62565, struggling to extend its 0.47% overnight gain. Its New Zealand counterpart  last fetched $0.5661.</p><p class=\"\">In the broader market, volatility in currencies eased a little after a turbulent start to the week following Trump's imposition of steep tariffs on top U.S. trading partners, with those on Mexico and Canada having since been delayed following negotiations.</p><p class=\"\">The dollar was on the back foot, giving some respite to heavily battered currencies like the euro , which bounced back above the $1.02 level and last bought $1.0385.</p><p class=\"\">The yen  was a notable mover in the Asian session as it rose roughly 0.8% to its highest in over a month at 153.09 per dollar.</p><p class=\"\">The impetus came from data that showed Japan's December inflation-adjusted real wages rose 0.6% year-on-year thanks to a wintertime bonus bump, with government officials expressing optimism that wage hike momentum is growing.</p><p class=\"\">That left traders ramping up bets of more BOJ rate hikes this year, with just over 30 basis points priced in by the year-end.</p><p class=\"\">\"The upcoming spring wage (negotiating) rounds will be closely watched, as expectations grow of more BOJ tightening,\" said Alvin Tan, head of Asia FX strategy at RBC Capital Markets.</p><p class=\"\">\"As we have seen for more than a year, BOJ tightening by itself is not adequate to drive the yen into an appreciation trend, but that along with the yen's under-valuation might be enough to cap yen weakness particularly in a more uncertain global macro environment.\"</p><p class=\"\">Elsewhere, the Canadian dollar  rebounded from Monday's 22-year low and last stood at C$1.4328.</p><p class=\"\">The Mexican peso  was steady at 20.4896 per dollar, moving away from a trough of 21.2882 hit on Monday, its weakest level in nearly three years.</p><p class=\"\">Sterling  ticked up 0.05% to $1.2487, while the dollar index  fell 0.22% to 107.81.</p><p class=\"\">\"I am actually quite surprised at the resilience of markets. Risk sentiment ... has been quite positive despite all the tariff headlines and the resumption of the U.S.-China trade war,\" said CBA's Kong.</p><p class=\"\">\"I think part of the optimism stems from the fact that the U.S. was willing to delay tariffs as long as the other countries gave Trump what he wanted.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW07M:0-yuan-slips-on-trade-war-anxiety-yen-jumps/",
            "pub_date": "2025-02-05 14:45:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr6whgGJ:0",
            "title": "Year-end report: \"Third consecutive quarter of organic growth, continued strong sales growth from the Consumer division\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>CTEK AB<p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>October - December 2024</em></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales amounted to SEK 279 million (240). Organically, net sales increased by 16%. Adjusted for the one-time buy from General Motors the organic growth was 5%.</li><li class=\"listItem-bmN0_SHH\">The gross margin was 49.8% (53.6). Adjusted for the one-time buy from General Motors the gross margin was 54.6%.</li><li class=\"listItem-bmN0_SHH\">Adjusted EBITA amounted to SEK 25 million (31), a margin of 9.1% (12.8). Adjusted for the one-time buy from General Motors the margin was 10,2%.</li><li class=\"listItem-bmN0_SHH\">The cash flow from operating activities amounted to SEK 59 million (75).</li></ul><p class=\"\">\" The fourth quarter of the year saw continued organic growth with a stable cash flow and a reduced net debt ratio. The Consumer division, which once again had a strong quarter, made a major contribution to this.\", says Henrik Fagrenius, President and CEO of CTEK.</p><p class=\"\">During the quarter, CTEK continued to follow its strategic plan towards profitable growth.</p><p class=\"\">\"With this year's improved margins, continued stable cash flow and the reduced net debt ratio, we are well on our way in our strategic plan towards the target of profitable growth. We will provide a more detailed presentation of what the final phase of the strategic plan means for the company during a capital market day, scheduled for May 22 in Stockholm.\", says Henrik Fagrenius, President and CEO of CTEK.</p><p class=\"\">Today, 5 February at 09:00 CET, CTEK will hold an audiocast in English. CTEK is represented by CEO Henrik Fagrenius and CFO Thom Mathisen, who present the year-end report and answer questions. For further information:  https://ctek.events.inderes.com/q4-report-2024</p><p class=\"\">Before its publication, this information was inside information and is such that CTEK AB is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out below, on 5 February 2025 at 07:45 CET.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information please contact:</strong></p><p class=\"\">Marcus Korsgren, SVP Strategy &amp; Communication</p><p class=\"\">+46 72 050 42 46, marcus.korsgren@ctek.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>About CTEK</em></strong></p><p class=\"\">Established in Dalarna Sweden, CTEK is the leading global brand in battery charging solutions, most specifically vehicle charging.</p><p class=\"\">CTEK offers products ranging from 12V &amp; 24V battery chargers to charging solutions for electrical vehicles.</p><p class=\"\">Products are sold via a carefully selected network of global distributors and retailers, as original equipment, supplied to more than 50 of the world's leading vehicle manufacturers and through charge point operators, property owners as well as other organizations and individuals providing EV charging infrastructure.</p><p class=\"\">CTEK takes pride in its unique culture based on a passion for innovation and a deep commitment to supporting the transition to a greener mobility, by adhering to industry-leading ESG standards.</p><p class=\"\">CTEK's share is listed on Nasdaq Stockholm Small Cap and is traded with the ticker CTEK.</p><p class=\"\">For more information, also visit www.ctekgroup.com</p><p class=\"\">https://news.cision.com/ctek-ab/r/year-end-report---third-consecutive-quarter-of-organic-growth--continued-strong-sales-growth-from-th%2Cc4100600</p><p class=\"\">CTEK AB Q4_2024_Eng</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr6whgGJ:0-year-end-report-third-consecutive-quarter-of-organic-growth-continued-strong-sales-growth-from-the-consumer-division/",
            "pub_date": "2025-02-05 14:45:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr2JXL4l:0",
            "title": "Year-end Report 1 January - 31 December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>AddLife<p class=\"\">AddLife finishes the year with high growth, improved margins, and strong cash flow</p><p class=\"\">\"AddLife finishes 2024 with a very strong fourth quarter. Organic growth was 9%, EBITA increased by 24%, and cash flow improved by 49%. The companies within AddLife performed very well, driven by positive demand development and dedicated, long-term efficiency efforts.\"</p><p class=\"\">Fredrik Dalborg, President and CEO</p><p class=\"\">AddLife´s year-end report for Q4 2024 is now available online at the company website. The year-end report can be downloaded in pdf version. Visit reports-en.add.life/year-end-report-q4-2024</p><p class=\"\">1 OCTOBER– 31 DECEMBER 2024 (3 MONTHS)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales increased by 11% to SEK 2,818m (2,544). The organic growth, excluding exchange rate changes, was 9% and the acquired growth was 1%.</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 24% to SEK 346m (278), corresponding to an EBITA-margin of 12.3% (10.9). The EBITA margin for the previous year was 10.2%, adjusted for reversed contingent considerations and one-off costs.</li><li class=\"listItem-bmN0_SHH\">Profit after tax amounted to SEK 94m (-41).</li><li class=\"listItem-bmN0_SHH\">Earnings per share amounted to SEK 0.76 (-0.34).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities amounted to SEK 666m (448).</li></ul><p class=\"\">1 JANUARY – 31 DECEMBER 2024 (12 MONTHS)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales increased by 6% to SEK 10,286m (9,685). The organic growth, excluding exchange rate changes, was 5%.</li><li class=\"listItem-bmN0_SHH\">EBITA increased by 2% to SEK 1,159m (1,135), corresponding to an EBITA-margin of 11.3% (11.7). Adjusted for revalued contingent considerations and restructuring costs, EBITA amounted to SEK 1,165m (1,015). Excluding these, EBITA increased by 14% and the EBITA-margin amounted to 11.3% (10.5).</li><li class=\"listItem-bmN0_SHH\">Profit after tax amounted to SEK 254m (192).</li><li class=\"listItem-bmN0_SHH\">Earnings per share amounted to SEK 2.06 (1.56).</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities amounted to SEK 1,095m (773).</li><li class=\"listItem-bmN0_SHH\">The equity ratio was 41% (39).</li><li class=\"listItem-bmN0_SHH\">Return on working capital (P/WC) amounted to 51% (50).</li><li class=\"listItem-bmN0_SHH\">During the financial year an acquisition, BonsaiLab SLU, was completed. The acquisition is estimated to contribute with an annual net sale of approximately SEK 90m.</li><li class=\"listItem-bmN0_SHH\">The board proposes a dividend of SEK 0.75 per share.</li></ul><p class=\"\">Stockholm, February 5, 2025</p><p class=\"\">AddLife AB (publ)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, contact;</strong></p><p class=\"\">Fredrik Dalborg, CEO, fredrik.dalborg@add.life, +46 70 516 09 01</p><p class=\"\">Christina Rubenhag, CFO, christina.rubenhag@add.life, +46 70 546 72 22</p><p class=\"\">www.add.life</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Video conference</strong></p><p class=\"\">Investors, analysts and the media are invited to a video conference at which CEO Fredrik Dalborg and CFO Christina Rubenhag will present the year-end report . The presentation will be given in English and take about 20 minutes. after which there will be an opportunity to ask questions. The meeting will be recorded and made available online.</p><p class=\"\">The video conference will be at 9 a.m. CET on February 5, 2025.</p><p class=\"\">If you wish to participate via video conference, please follow this link&gt;&gt;</p><p class=\"\">The presentation is also available on AddLife YouTube &gt;&gt;</p><p class=\"\">AddLife is an independent player in the Life Science industry that offers high-quality products, services and advice to both the private and public sectors, mainly in the Nordic region and rest of Europe. AddLife has about 2,300 employees in some 85 operating subsidiaries. The Group currently has net sales of more than SEK 10 billion. AddLife shares are listed on Nasdaq Stockholm.</p><p class=\"\">This information is information that AddLife AB (publ) is obliged to make public pursuant to the EU Market Abuse Regulation and the Securities Markets Act. The information was submitted for publication, through the agency of the contact person set out above, at February 5, 2025 at 07:45 a.m. CET.</p><p class=\"\">https://news.cision.com/addlife/r/year-end-report-1-january---31-december-2024%2Cc4100095</p><p class=\"\">Year-end Report Q4 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr2JXL4l:0-year-end-report-1-january-31-december-2024/",
            "pub_date": "2025-02-05 14:45:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463765:0",
            "title": "Dhanlaxmi Bank's Fiscal Q3 Net Profit Rises Surges Nearly 10-Fold",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dhanlaxmi Bank  witnessed a sharp gain in its net profit to 198.5 million Indian rupees in the fiscal third quarter from 30.5 million rupees a year ago. </p><p class=\"\">Diluted earnings per share during the quarter that ended Dec. 31, 2024, climbed to 0.78 rupees from 0.12 rupees a year earlier, according to a Tuesday filing with the Indian exchanges. </p><p class=\"\">Interest earned by the lender in fiscal Q3 increased year on year to 3.35 billion rupees from 3.08 billion rupees a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463765:0/",
            "pub_date": "2025-02-05 14:38:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463788:0",
            "title": "Valiant Posts Higher FY24 Consolidated Profit; Net Result Dips",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Valiant  said Wednesday that consolidated profit for full-year 2024 increased, while net result dropped year over year. </p><p class=\"\">Consolidated profit for the 12 months ended Dec. 31, 2024, was 150.4 million francs, compared with 144.3 million francs a year ago. </p><p class=\"\">The Swiss lender's net result from interest operations was 395.9 million francs, compared with 407.5 million francs a year ago. </p><p class=\"\">Meanwhile, the board proposed a dividend of 5.80 francs per share. It paid 5.50 francs a year ago. </p><p class=\"\">For 2025, the company is expecting consolidated profit to be slightly higher.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463788:0/",
            "pub_date": "2025-02-05 14:38:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000989:0",
            "title": "Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adria Calatayud</p><p class=\"\">Banco Santander plans to buy back 10 billion euros ($10.38 billion) of its own stock and reported fourth-quarter results that exceeded expectations both at the top and bottom lines.</p><p class=\"\">The Spanish bank said Wednesday that it expects to return 10 billion euros to shareholders through stock repurchases from its earnings this year and next on top of its dividend. It also raised a key 2025 profitability target but projected broadly stable revenue for the year.</p><p class=\"\">Net profit for the fourth quarter was 3.265 billion euros, up 11% on year, Santander said.</p><p class=\"\">Total income for the quarter rose 10% to 16.03 billion euros, mainly driven by higher net fee income. Net interest income--the difference between what a bank earns on loans and what it pays clients for deposits--came to 11.99 billion euros, up 6.8% on the prior quarter.</p><p class=\"\">Analysts had expected Santander to post a net profit of 2.95 billion euros on revenue of 15.39 billion euros, according to consensus estimates provided by Visible Alpha.</p><p class=\"\">For 2025, Santander expects revenue of about 62 billion euros, mid-high single digit growth in net fee income, lower costs and a return on tangible equity--a key profitability metric for banks--of more than 17%. It had previously targeted a 2025 return on tangible equity of 15% to 17%.</p><p class=\"\">Write to Adria Calatayud at adria.calatayud@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000989:0-santander-plans-10-4-billion-in-buybacks-after-results-beat-expectations/",
            "pub_date": "2025-02-05 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000884_20250205000991:0",
            "title": "Pandora to Launch New Share Buy-Back Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000884_20250205000991:0/",
            "pub_date": "2025-02-05 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000877_20250205000986:0",
            "title": "Novo Nordisk: Sales Growth Positively Impacted by Gross-to-Net Adjustments in U.S.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000877_20250205000986:0/",
            "pub_date": "2025-02-05 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000877_20250205001007:0",
            "title": "Novo Nordisk: Sales Growth Has Resulted in Periodic Supply Constraints and Related Drug Shortage Notifications",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000877_20250205001007:0/",
            "pub_date": "2025-02-05 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446679:0",
            "title": "Palm Oil Trades Higher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Malaysian palm oil futures were above MYR 4,300 per tonne after briefly dipping to MYR 4,270 in the prior session.</p><p class=\"\">Prices found support after top producer Indonesia introduced stricter cultivation permit rules to aid smallholder farmers, a move that could reduce output from major manufacturers and tighten supply.</p><p class=\"\">Meanwhile, concerns over China’s retaliatory tariffs on US energy products, particularly LNG, fueled bets of higher demand for biodiesel alternatives, further boosting prices.</p><p class=\"\">On the other hand, falling soybean oil prices prompted India, the largest importer, to shift toward alternative oils.</p><p class=\"\">As a result, India’s palm oil imports tumbled 46% in January from the previous month, reaching a 14-year low of 272,000 tonnes.</p><p class=\"\">In Europe, palm oil imports for the 2024-25 season, which began in July 2024, fell to 1.69 million tons from 2.14 million tons a year ago.</p><p class=\"\">Additionally, some traders adopted cautious ahead of next week’s monthly data release from the Malaysian Palm Oil Board.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446679:0-palm-oil-trades-higher/",
            "pub_date": "2025-02-05 14:39:11",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0MQ:0",
            "title": "India's Apollo Micro Systems rises on robust Q3 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Indian aerospace and defence manufacturing supplier Apollo Micro Systems  up 2.1% at 131.16 rupees after robust Q3 results</p><p class=\"\">** Shares were up as much as 7.4% in pre-open trade</p><p class=\"\">** Co, which counts the Indian defence ministry as a customer, reports 83.1% y/y increase in Q3 profit after tax </p><p class=\"\">** APLL a beneficiary of Indian govt increasing defence spending to improve share of fleet produced in India</p><p class=\"\">** Co's Q3 rev from operations up 62.5% y/y</p><p class=\"\">** Shares have gained ~4% in the last 12 months</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0MQ:0-india-s-apollo-micro-systems-rises-on-robust-q3-results/",
            "pub_date": "2025-02-05 14:39:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000884_20250205001030:0",
            "title": "Pandora to Buy Back Own Shares for a Consideration of Up to DKK4.0B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000884_20250205001030:0/",
            "pub_date": "2025-02-05 14:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObiJszM3a:0",
            "title": "4th quarter report from DNB Boligkreditt AS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Please find the 4th quarter report 2024 from DNB Boligkreditt AS attached.</p><p class=\"\">https://newsweb.oslobors.no/message/637742</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObiJszM3a:0-4th-quarter-report-from-dnb-boligkreditt-as/",
            "pub_date": "2025-02-05 14:40:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr6jQpJC:0",
            "title": "Wärtsilä's Board of Directors decided on new share-based incentive plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Wärtsilä Corporation<p class=\"\">Wärtsilä Corporation, stock exchange release, 5 February 2025 at 8:40 (EET)</p><p class=\"\">Wärtsilä's Board of Directors decided on new share-based incentive plans</p><p class=\"\">The Board of Directors of Wärtsilä Corporation has resolved on the establishment of a new share-based long-term incentive scheme for the company's key employees. The incentive scheme comprises a Performance Share Plan.</p><p class=\"\">The objectives of the share-based long-term incentive scheme are to align the interests of Wärtsilä's management and key employees with those of the company's shareholders and, thus, to promote shareholder value creation in the long term, and to commit management and key employees to achieving Wärtsilä's strategic targets.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Performance Share Plan 2025-2027</strong></p><p class=\"\">The Board of Directors of Wärtsilä has resolved on the target group, the amount of the possible rewards and the performance criteria for the Performance Share Plan 2025-2027. The potential share reward, which is subject to the achievement of the set performance criteria, is paid in listed shares of Wärtsilä in spring 2028.</p><p class=\"\">During the performance period 2025-2027, the earning of rewards is based on the Economic Value Added (EVA) (80% weight) and Sustainability Targets according to decarbonisation strategy (20% weight). Wärtsilä's decarbonisation strategy is to become carbon neutral in own operations, and to have a product portfolio ready for zero carbon fuels.</p><p class=\"\">The aggregate maximum number of shares payable as a reward based on this first plan is approximately 1,850,000 shares (gross earnings before the withholding of the applicable payroll tax). The target group of the performance period 2025-2027 consists of approximately 180 key employees, including the President &amp; CEO and the Board of Management.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Restricted Share Plan 2025-2027 </strong></p><p class=\"\">The Board of Directors has also resolved on a Restricted Share Plan 2025-2027 as a share-based retention plan for individually selected key employees in specific situations.</p><p class=\"\">The Restricted Share Plan 2025-2027 comprises a retention period with an overall length of three years, extended to the first half of the fourth year, during which the company may grant fixed share rewards to individually selected key employees. The granted share rewards are paid to the selected participants in three separate share tranches annually during the retention period, unless the company resolves to pay individual share grants in one instalment. The share rewards are paid in listed shares of Wärtsilä.</p><p class=\"\">The aggregate maximum number of shares to be paid as a reward based on the plan is approximately 150,000 shares (gross earning before the withholding of the applicable payroll tax).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Other terms</strong></p><p class=\"\">The value of the reward payable to participants based on the plans is limited by a maximum cap, which is linked to a multiplier of the individual's annual gross base salary. If the individual's employment with Wärtsilä terminates before the payment of the reward, the individual is not, as a main rule, entitled to any reward based on the respective plan.</p><p class=\"\">Wärtsilä applies a share ownership recommendation to the members of the company's Board of Management. According to this recommendation, each member of Wärtsilä's Board of Management is expected to retain in his/her ownership at least half of the shares received under the share-based incentive plans of the company, until the value of his/her share ownership in the company corresponds to at least his/her annual gross base salary. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Teija Sarajärvi</p><p class=\"\">Executive Vice President, Human Resources</p><p class=\"\">Tel: +358 10 709 5010</p><p class=\"\">teija.sarajarvi@wartsila.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For investor information, please contact:</strong></p><p class=\"\">Hanna-Maria Heikkinen</p><p class=\"\">Vice President, Investor Relations</p><p class=\"\">Tel: +358 10 709 1461</p><p class=\"\">hanna-maria.heikkinen@wartsila.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Wärtsilä in brief</strong></p><p class=\"\">Wärtsilä is a global leader in innovative technologies and lifecycle solutions for the marine and energy markets. We emphasise innovation in sustainable technology and services to help our customers continuously improve environmental and economic performance. Our dedicated and passionate team of 18,300 professionals in more than 230 locations in 77 countries shape the decarbonisation transformation of our industries across the globe. In 2024, Wärtsilä's net sales totalled EUR 6.4 billion. Wärtsilä is listed on Nasdaq Helsinki. www.wartsila.com</p><p class=\"\">https://news.cision.com/wartsila-corporation/r/wartsila-s-board-of-directors-decided-on-new-share-based-incentive-plans%2Cc4100711</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr6jQpJC:0-w-rtsil-s-board-of-directors-decided-on-new-share-based-incentive-plans/",
            "pub_date": "2025-02-05 14:40:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0BF:0",
            "title": "SAS Rue La Boetie Intends To Buy Credit Agricole Shares For Up To EUR 500 Mln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Credit Agricole SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAS RUE LA BOETIE INFORMS OF ITS INTENTION TO PURCHASE CREDIT AGRICOLE SHARES FOR A MAXIMUM AMOUNT OF FIVE HUNDRED MILLION EUROS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAS RUE LA BOETIE CONFIRMS THAT IT HAS NO INTENTION TO INCREASE ITS STAKE BEYOND 65% OF THE SHARE CAPITAL OF CRÉDIT AGRICOLE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0BF:0-sas-rue-la-boetie-intends-to-buy-credit-agricole-shares-for-up-to-eur-500-mln/",
            "pub_date": "2025-02-05 14:40:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463778:0",
            "title": "Whirlpool of India Records Rise in Fiscal Q3 Consolidated Net Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Whirlpool of India's  consolidated attributable net profit increased to 439.6 million Indian rupees in the fiscal third quarter ended Dec. 31, 2024, against 279.9 million rupees a year ago. </p><p class=\"\">Earnings per share came in at 3.46 rupees compared with the year-ago figure of 2.21 rupees, according to a Tuesday filing to the Indian stock exchanges by the consumer durables company. </p><p class=\"\">Revenue from operations in fiscal Q3 rose to 17.05 billion rupees from 15.36 billion rupees a year earlier. </p><p class=\"\">Shares of the company were down over 1% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463778:0/",
            "pub_date": "2025-02-05 14:40:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000913_20250205000913:0",
            "title": "DNB Bank 4Q Net Pft NOK12.675B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000913_20250205000913:0/",
            "pub_date": "2025-02-05 14:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000913_20250205000915:0",
            "title": "DNB Bank 4Q Net Interest Income NOK16.72B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000913_20250205000915:0/",
            "pub_date": "2025-02-05 14:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463787:0",
            "title": "Fabege Signs Eight-year Office Lease Deal in Sweden",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fabege  entered into an eight-year lease deal with SBAB Bank, according to a Wednesday release. </p><p class=\"\">The deal covers the Swedish real estate company's 5,100-square-meter Barnhusväderkvarnen 36 property in Stockholm, Sweden. SBAB Bank and its Booli Search Technologies unit are expected to occupy the property in April 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463787:0/",
            "pub_date": "2025-02-05 14:34:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0MD:0",
            "title": "Indian Energy Exchange gains after monthly volumes rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Indian Energy Exchange  rise 4.7% to 181.5 rupees, their highest in over a month</p><p class=\"\">** Power trading platform says monthly volumes in Jan up 16% Y/Y</p><p class=\"\">** Avg analyst rating on the stock is \"buy\", median PT is 204 rupees - LSEG data</p><p class=\"\">** Stock rose 8% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0MD:0-indian-energy-exchange-gains-after-monthly-volumes-rise/",
            "pub_date": "2025-02-05 14:34:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}