{
    "data": [
        {
            "id": "coinpedia:4976d2d4e094b:0",
            "title": "Vitalik Buterin Says AI May Speed Up Ethereum’s Roadmap While Raising Security Standards",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The future of Ethereum development may be arriving faster than many expected.</span></p><p class=\"\"><span>Vitalik Buterin recently described an experiment in which much of Ethereum’s proposed 2030 roadmap was “vibe-coded” within just a few weeks using artificial intelligence tools. While he cautioned that the results are far from production-ready, the broader message was clear: AI is rapidly transforming how blockchain infrastructure is built.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI Coding Is Moving at Unprecedented Speed</span></strong></p><p class=\"\"><span>According to Buterin, creating a rough version of such a complex roadmap in just two weeks would have seemed unrealistic only six months ago. He said that the AI-generated code likely contains critical bugs and incomplete sections. Some components may be placeholders rather than fully implemented features.</span></p><p class=\"\"><span>Still, the speed of development itself marks a shift.</span></p><p class=\"\"><span>Buterin also shared that he recently built a version of his blog software in about an hour using an open-source AI model running locally on his laptop. More advanced systems, he suggested, could potentially complete similar tasks even faster.</span></p><p class=\"\"><span>The takeaway is not that AI can instantly produce secure blockchain infrastructure. Rather, it shows how dramatically development timelines are shrinking.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Speed Is Only Half the Story</span></strong></p><p class=\"\"><span>Buterin stressed that faster coding alone is not enough. In his view, the real opportunity lies in balancing speed with stronger security practices.</span></p><p class=\"\"><span>Instead of using AI only to write more code, developers can use it to:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Generate significantly more test cases</span></li><li class=\"listItem-bmN0_SHH\"><span>Run deeper security audits</span></li><li class=\"listItem-bmN0_SHH\"><span>Create multiple independent implementations of the same system</span></li><li class=\"listItem-bmN0_SHH\"><span>Formally verify critical components</span></li></ul><p class=\"\"><span>One collaborator from the LeanEthereum initiative reportedly used AI to help produce a machine-verifiable proof for one of the complex mathematical theorems underlying STARK-based cryptography.</span></p><p class=\"\"><span>For Ethereum, which increasingly relies on advanced zero-knowledge systems, such verification tools are essential.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Formal Verification May Become Standard Practice</span></strong></p><p class=\"\"><span>A core principle of LeanEthereum is to formally verify all components wherever possible. Formal verification means mathematically proving that code behaves exactly as intended.</span></p><p class=\"\"><span>In blockchain systems that secure billions of dollars in value, reducing even small vulnerabilities can have an outsized impact. Buterin suggested that AI is accelerating the ability to produce verified proofs and stress-test implementations at scale.</span></p><p class=\"\"><span>He was careful to add that no one should expect to enter a single prompt and receive perfectly secure code. Bugs, inconsistencies and design trade-offs will remain part of the process.</span></p><p class=\"\"><span>However, debugging and testing cycles could happen five times faster and far more thoroughly than before.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Could Ethereum’s Roadmap Finish Earlier Than Expected?</span></strong></p><p class=\"\"><span>While Buterin did not make any firm predictions, he encouraged the community to stay open to the possibility that Ethereum’s long-term roadmap could be completed faster than many anticipate.</span></p><p class=\"\"><span>More importantly, he suggested that it could reach higher security standards than traditionally expected for complex distributed systems.</span></p><p class=\"\"><span>If AI continues improving at its current pace, development bottlenecks that once slowed blockchain upgrades may become less restrictive.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/coinpedia:4976d2d4e094b:0-vitalik-buterin-says-ai-may-speed-up-ethereum-s-roadmap-while-raising-security-standards/",
            "pub_date": "2026-03-01 17:27:09",
            "source": "Coinpedia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000457:0",
            "title": "The Third-Largest Coffee Chain in the U.S. Actually Sells Very Little Hot Coffee — Journal Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Heather Haddon</span></p><p class=\"\"><span>Dutch Bros, a coffee and beverage chain still unknown in many parts of the country, is becoming a thorn in Starbucks's side.</span></p><p class=\"\"><span>Founded in 1992 by two Oregon dairy farmers transitioning away from their family business, Dutch Bros is now the third-largest coffee chain by U.S. sales and locations, behind Starbucks and Dunkin', according to market-research firm Technomic. Starbucks still accounts for around 48% of sales in the U.S coffee-chain market, but Dutch Bros and other smaller competitors have started to erode its lead.</span></p><p class=\"\"><span>Gen Z has flocked to Dutch Bros for its eye-popping energy drinks and other cold beverages that people can customize, like an OG Gummy Bear Lemonade and the Shark Attack Rebel, with layers of green, red and yellow fruit flavors — and 111 grams of sugar for an iced large. The 1,140-location chain also sells coffee, but little of it is hot, with roughly 90% of Dutch's drinks served cold. That's how young people like their beverages, chain executives say.</span></p><p class=\"\"><span>\"The market is moving that way, and that is the core to what we do,\" says Dutch Bros' chief marketing officer, Tana Davila.</span></p><p class=\"\"><span>Her job is to help the Tempe, Ariz., company maintain its edge in an increasingly competitive time for beverages. Starbucks in January announced it would introduce its own customizable energy drinks, news that drove down Dutch Bros' stock. McDonald's is introducing new cold beverages in the U.S. this year after testing crafted sodas and energy drinks in some U.S. stores, with drinks featuring Red Bull especially doing well, executives say.</span></p><p class=\"\"><span>Now, customized energy drinks account for roughly 25% of Dutch Bros' $1.6 billion business.</span></p><p class=\"\"><span>Here is how Dutch Bros intends to manage rising competition, and what's next in the beverage wars.</span></p><p class=\"\"><span>Battling the big names</span></p><p class=\"\"><span>WSJ: The energy-drink business is getting increasingly competitive, with Starbucks, McDonald's and other bigger brands moving in. How are you trying to keep your edge?</span></p><p class=\"\"><span>TANA DAVILA: I see us as the creators of customizable, made-to-order energy. It evolved from guests coming and wanting to add flavors to energy drinks. Over time, we've built our own proprietary energy-drink brand, Rebel. We flavor it, we let you add whatever toppings you want. The energy market is growing at a faster rate than coffee, so we are very well positioned to continue to lead.</span></p><p class=\"\"><span>WSJ: More beverage brands are letting their customers tailor their drinks, but it is hard to pull off and still deliver fast service. How are your drink customizations unique and why are they important to Dutch Bros?</span></p><p class=\"\"><span>DAVILA: It's been central to the brand from the very beginning. With our coffee, energy, lemonade, tea and sodas, you can basically build whatever you want. It's 40-plus flavors and you can mix and match them and build your own custom creations.</span></p><p class=\"\"><span>We're now featuring a banana-bread mocha. You can have that as a latte, you can do it as a mocha or a blended coffee freeze. You can add syrup drizzles on top, you can add soft-top cold foam. If you want to add boba or other types of toppings, or make it a protein-based drink, you can. It is pretty endless.</span></p><p class=\"\"><span>WSJ: Where do you find inspiration for flavors or trends?</span></p><p class=\"\"><span>DAVILA: We're looking at what's happening in the grocery stores, what's happening in third-wave coffee bars, what's happening in the mixology space. A good example is putting boba on an energy drink. I saw it within [teas], but really the idea came from what I was seeing in cocktails. Another example is cookie butter that was trending, especially with the younger demographic.</span></p><p class=\"\"><span>Obstacles and innovations</span></p><p class=\"\"><span>WSJ: What are some of the brand's biggest challenges right now, and how are you addressing them?</span></p><p class=\"\"><span>DAVILA: The No. 1 is just convenience. There's not a location close to me. That's table stakes [a basic requirement]. Other brands have more locations and better convenience. On our side, we do extremely well in loyalty. Our opportunity is just taking away these more-logistical aspects to allow us to better compete in the market.</span></p><p class=\"\"><span>WSJ: Only about a third of your business is in the morning, while the rest is midday and later. Chains like Starbucks and Dunkin' are fighting for more of that afternoon business. But, as a coffee chain, don't you want more morning business?</span></p><p class=\"\"><span>DAVILA: We obviously have some strength in selling treats and indulgences and our energy offering, which tends to be more afternoon. One of our opportunities is to drive that habitual routine. We asked loyalty customers what else they wanted, and ordering ahead was the No. 1 thing they requested. They didn't know if they could get in and out on their morning commute, it wasn't predictable enough for them, and they didn't have time to wait in the long line.</span></p><p class=\"\"><span>WSJ:  Starbucks has had mobile ordering for years. Can you catch up?</span></p><p class=\"\"><span>DAVILA: We honestly don't have a goal. We want to provide a different way for people to use the brand. You have to be a loyalty member to order ahead, so it serves in the broader loyalty strategy. Right now, it's about 14% of orders.</span></p><p class=\"\"><span>WSJ:  You have a low percentage of food sales compared with Starbucks. Is that a problem you are trying to address?</span></p><p class=\"\"><span>DAVILA: Food is another good example where we're trying to remove a barrier to visitation and a reason why people aren't coming to us today, particularly in the morning. Historically, it was basically a couple of flavors of muffin tops. We're adding a bakery assortment. Then there's a hot-food component, like two breakfast sliders. I've done quite a bit of work on how the assortment has the maximum reach with the least number of items.</span></p><p class=\"\"><span>WSJ: Restaurant chains are battling to attract younger consumers. What do you know about Gen Z consumers, and how are you attracting their dollars?</span></p><p class=\"\"><span>DAVILA: They buy a higher share of iced beverages. They love to customize and love friendly service. Those are all areas where we really excel. We are very focused on social media and how our brand shows up there. We also have merch drops, where we'll give away something, like straw toppers and bumper stickers, with a drink purchase.</span></p><p class=\"\"><span>WSJ:  Do people really care about bumper stickers?</span></p><p class=\"\"><span>DAVILA: People do, you would be surprised. It's something different and unexpected.</span></p><p class=\"\"><span>Spreading the reach</span></p><p class=\"\"><span>WSJ:  You grew your store count by 16% last year, faster than many competitors. Can you grow at that clip and not struggle to attract sufficient sales?</span></p><p class=\"\"><span>DAVILA: We've done it through innovation and making sure we have relevant offerings and driving innovation, like protein coffee. The second piece is the Dutch Rewards program. We're really proud that [around] 73% of our transactions go through it. We find that our best guests want to be in our program, and they want to engage with the brand. They earn points and are incentivized to come to earn free drinks. It's our way of discounting.</span></p><p class=\"\"><span>The third piece is around advertising, and specifically in new markets. There are still a large group of people that are unfamiliar with our brand.</span></p><p class=\"\"><span>WSJ: How are you trying to change that?</span></p><p class=\"\"><span>DAVILA: I certainly aspire for us to be a household name. We started on the West Coast, have been moving east and then there's opportunity to continue to move into the Midwest and the Northeast. We also are not afraid to build density in markets versus having a one-off type of approach.</span></p><p class=\"\"><span>We have over 200 shops in Texas. Most of those are basically new over the last couple of years. What we've been able to do there is introduce the market to the brand, create scale. We have density in terms of the market and the penetration.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000457:0/",
            "pub_date": "2026-03-01 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000454:0",
            "title": "The Newest Front in America's Supermarket War Is...Kentucky? — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Patrick Thomas | Photography by Jon Cherry for WSJ</span></p><p class=\"\"><span>BOONE COUNTY, Ky. — There's a battle raging in a county named for pioneer Daniel Boone. It's about territory, and one side is encroaching on the other's home turf.</span></p><p class=\"\"><span>The competitors are two of the nation's biggest supermarket chains: Publix and Kroger.</span></p><p class=\"\"><span>While they have long sparred in the Deep South, Florida-based Publix has set up a new front near Kroger's headquarters in Cincinnati. Publix, a beloved Florida grocer with about 1,400 stores, envisions a dozen locations operating in Kentucky by year's end.</span></p><p class=\"\"><span>\"It's the frontier of Publix,\" said Devin Dosher, assistant manager of the Publix in Boone County, who has spent 13 years with the company.</span></p><p class=\"\"><span>Kroger, the nation's largest supermarket operator, with about 2,700 stores, isn't standing pat. It dropped prices at its northern Kentucky stores when Publix moved in and opened a refurbished supermarket in the area last fall. In its hunt for growth, Kroger wants to open more stores in Publix's home state, including in Jacksonville.</span></p><p class=\"\"><span>Executives at Cincinnati-based Kroger said nearby stores initially took a sales hit when Publix first opened, but they have since returned to earlier levels. But Publix still has more locations to open, and that could test Kroger's dominance.</span></p><p class=\"\"><span>The battle illustrates the potential risks and rewards of spending millions on real estate and new operations to win over shoppers. Kroger and Publix aren't just competing with each other; they're facing the likes of national retailers including Walmart and other regional outposts for food.</span></p><p class=\"\"><span>Ultimately, consumers might be the big winners. Shoppers at both stores say they are enjoying increased promotions and buy-one-get-one-free deals.</span></p><p class=\"\"><span>\"This will be an interesting experiment,\" said Craig Johnson of Customer Growth Partners, a Connecticut retail consultant. Publix invests in the customer experience, from clean stores to more checkout lines that make it easier to get in and out. Kroger, while it still invests in its stores, is more focused on deals to attract shoppers, he said.</span></p><p class=\"\"><span>Supermarkets operate with razor-thin profit margins, stoking fierce competition to win as many customers as possible. That competition involves routinely monitoring rivals' prices and shifting their own accordingly.</span></p><p class=\"\"><span>Expanding service areas gives companies a chance to build leverage with suppliers and offer goods at lower prices, a potential boon to shoppers.</span></p><p class=\"\"><span>Aldi has said it plans to open 180 new U.S. stores this year, rapidly expanding into Colorado and Arizona, putting pressure on Albertsons's Safeway stores. Sprouts Farmers Market is expanding its presence in Whole Foods Market's hometown of Austin, Texas. Whole Foods has been trying to grow in the Northeast.</span></p><p class=\"\"><span>About 20 miles south of downtown Cincinnati, the new Publix sits just past a roundabout at the front entrance of a glitzy subdivision known as Triple Crown. The building with a red-brick facade and bright green letters anchors a small shopping center in the suburban area.</span></p><p class=\"\"><span>Hundreds of people lined up outside the new supermarket on opening day last May. Some superfans came in Publix-branded flip-flops and shirts, while others were eager to get a \"pub sub\" or the chain's signature key lime pie. Lines of parked cars stretched out from the parking lot for at least the following three weeks.</span></p><p class=\"\"><span>Martin Schmidlin, a Cincinnati elevator inspector, hasn't shopped at Kroger since Publix opened a store in the area. Schmidlin has often vacationed in Florida and was thrilled once he heard Publix was coming to town. He said that, while some Publix items are more expensive, the store makes up for it with buy-one-get-one-free sales.</span></p><p class=\"\"><span>'Breaking' a monopoly</span></p><p class=\"\"><span>\"Kroger long had a monopoly on the area,\" Schmidlin said.</span></p><p class=\"\"><span>The new Publix was built with bright lights and wider aisles to give customers more space to navigate with shopping carts. It has a smoothie and coffee bar and a seating area where a group of local women gathers every Wednesday to play mahjong.</span></p><p class=\"\"><span>Publix officials said that while some consumers believe it might be more expensive, its value proposition is just as competitive once its sales and store experience are factored in.</span></p><p class=\"\"><span>Debbie Caldwell, who lives in the Cincinnati area, is originally from Georgia and has been to many Publix stores. But Caldwell prefers Kroger, largely because of its discounts. Publix has strong loyalty in the Deep South, she said, but it might struggle to break into the market.</span></p><p class=\"\"><span>\"Once the newness wears off, we'll see how it goes,\" she said.</span></p><p class=\"\"><span>Kroger operates about 100 stores around the Cincinnati and Dayton, Ohio, metro areas. Jake Cannon, who oversees Kroger's stores in the region, said the rivalry with Publix only makes his Kroger stores sharper, in areas such as customer service, where Publix excels.</span></p><p class=\"\"><span>\"Publix isn't going to try to beat us on price,\" he said. \"They can't. That's not the model.\"</span></p><p class=\"\"><span>One of Kroger's newest stores in the area could serve as a competitive response to Publix. The store in Edgewood, Ky., was built with a large deli and restaurant area that rivals Publix's new format. It was meant to resemble Murray's Cheese, the famous cheesemonger in New York City's Greenwich Village, which Kroger bought in 2017. Cannon said the revamp wasn't because of Publix, but it does help the company's chances.</span></p><p class=\"\"><span>Andy Waters, who works at the University of Cincinnati, said that local supermarket prices dropped when Publix opened in the area.</span></p><p class=\"\"><span>That same month, a Kroger supermarket roughly seven miles away held a promotional event where shoppers could spin a giveaway wheel at the front of the building to win free items. Waters said his two children won free ice cream and popcorn, cementing his family's loyalty to the hometown chain. Kroger's loyalty program that allows customers to earn discounts on gasoline also helps, he said.</span></p><p class=\"\"><span>\"My kids love Kroger — they want to work there,\" Waters said while shopping for lunch items at the store.</span></p><p class=\"\"><span>Write to Patrick Thomas at patrick.thomas@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000454:0/",
            "pub_date": "2026-03-01 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "eqs:fbd8cecb5094b:0",
            "title": "Acwa Board of Directors names Dr. Samir J. Serhan Chief Executive Officer",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span> </span></p><p class=\"\"><span>ACWA/ Key word(s): Personnel </span></p><p class=\"\"><span> Acwa Board of Directors names Dr. Samir J. Serhan Chief Executive Officer </span></p><p class=\"\"><span> 01.03.2026 / 11:05 CET/CEST</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Dr. Samir J. Serhan named CEO effective today by Acwa Board of Directors.</span></li><li class=\"listItem-bmN0_SHH\"><span>Dr. Serhan was previously President of Saudi Arabia and the Middle East at Acwa, and formerly Chief Operating Officer of US-based Air Products.</span></li><li class=\"listItem-bmN0_SHH\"><span>Marco Arcelli, CEO of Acwa since March 2023, remains as an advisor to the Chairman of the Board of Directors to ensure a smooth transition.</span></li></ul><p class=\"\"><span>RIYADH, Saudi Arabia, March 1, 2026 /PRNewswire/ -- Acwa, the world's largest private water desalination company, a leader in energy transition, and a first mover into green hydrogen, announced the appointment of Dr. Samir J. Serhan as chief executive officer effective March 1, 2026. In line with the natural progression of executive leadership terms and Acwa's disciplined governance framework, the Board of Directors of the Saudi-listed company made this appointment as part of a planned and structured leadership transition and succession process overseen by the company's Board Nomination and Remuneration Committee. The Board and the former CEO Marco Arcelli agreed to implement the planned succession process to ensure continuity and stability. The company's long-term direction remains unchanged.</span></p><p class=\"\"><span>Since joining Acwa last year as President of Saudi Arabia and Middle East, Dr. Serhan has worked closely with the leadership team and is fully prepared to assume this new responsibility. Previously Dr. Serhan was chief operating officer of the US-based company Air Products where he had global responsibility for the company's operational business and project execution with P&amp;L accountability for the Americas, Asia, Europe, Africa, the Middle East, and India. He also led functions including technology, global engineering, manufacturing, and equipment at Air Products. Earlier in his career he was president, Hydrogen for Praxair. For 14 years prior, he worked for the Linde Group in leadership positions in the US and Germany, culminating in his role as managing director, Linde Engineering. Dr. Serhan brings more than three decades of global leadership experience across large-scale industrial and infrastructure organizations, with a strong track record in driving operational transformation, strengthening institutional capability, and delivering disciplined and profitable growth in complex, capital-intensive environments.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Mohammad Abunayyan, Founder and Chairman of the Board of Directors of Acwa, said</span></strong><span>: \"Acwa stands today as a Saudi national champion and a global leader in renewable energy, water desalination, and green hydrogen, and our position continues to strengthen. We are grateful for Marco's leadership in advancing Acwa's strategy and accelerating our growth trajectory. This structured leadership transition reflects the strength of our governance and the maturity of our business platform. Our strategic direction remains clear and unchanged. We are pleased to welcome Dr. Samir Serhan to his new role as CEO of Acwa.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dr. Samir J. Serhan, the incoming CEO of Acwa, said</span></strong><span>: \"Every day affords us new opportunities to help our customers and meet pressing energy and water needs around the world. I'm honored to lead Acwa at a pivotal moment as the company accelerates profitable global growth in renewable energy, water desalination, and green hydrogen solutions — including advancing green hydrogen to decarbonize heavy industries — to deliver scalable, sustainable impact worldwide. I look forward to working with our talented Acwa teams around the globe to build on the progress we have achieved and shape the next chapter of our journey.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Marco Arcelli, the outgoing CEO of Acwa, said</span></strong><span>: \"Over the past three years, Acwa's portfolio has doubled in size, and we are on track to double it again by 2030, scaling both our footprint and our impact. Acwa now produces around 25% of the world's desalinated seawater. We have expanded into new markets, including Azerbaijan, China, Kuwait, and Senegal, while advancing energy export opportunities from Saudi Arabia, and cementing our leadership in green molecules. What we have achieved reflects the scale of our ambition, the discipline of our execution, the dedication of our people, and the trust of our partners.\"</span></p><p class=\"\"><span>Acwa supports energy and water security as well as supply reliability, which are priorities that are fundamental to economic resilience and community wellbeing worldwide. Today, Acwa provides clean drinking water for nearly 34 million people and power for almost 76 million people every day.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Acwa</span></strong></p><p class=\"\"><span>Acwa (TADAWUL: 2082) is a Saudi-listed company and the world's largest private water desalination company, the first mover into green hydrogen, and a leader in the global energy transition. Registered and established in 2004 in Riyadh, Saudi Arabia, Acwa employs over 4,000 people and is currently present in 15 countries in the Middle East, Africa, Central Asia, and Southeast Asia. Acwa's portfolio comprises 111 projects in operation, advanced development, or under construction with an investment value of SAR 430 billion (USD 114.8 billion) and the capacity to generate 93 GW of power (of which 52 GW is renewables) and manage 9.3 million m3/day of desalinated water. This energy and water are delivered on a bulk basis to address the needs of state utilities and industries on long-term, off-taker contracts under utility services outsourcing and public-private partnership models.</span></p><p class=\"\"><span>Learn more: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=71c5e94a1daad573355342673c6e766a&amp;application_id=2283360&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">www.acwapower.com</a></p><p class=\"\"><span> View original content:</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=0481dc52b68f7291229bc3698d37f6b5&amp;application_id=2283360&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.co.uk/news-releases/acwa-board-of-directors-names-dr-samir-j-serhan-chief-executive-officer-302700350.html</a></p><p class=\"\"><span> 01.03.2026 CET/CEST Dissemination of a Corporate News, transmitted by </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=2be925ac0334ae7b4f51fbaee4a6daf0&amp;application_id=2283360&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS News</a><span> - a service of </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=f5d50dc7e8798b6eb177f7955e598e60&amp;application_id=2283360&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS Group</a><span>.</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><span>The EQS Distribution Services include Regulatory Announcements, Financial/Corporate News and Press Releases.</span></p><span> </span><p class=\"\"><span>2283360 01.03.2026 CET/CEST </span><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>Saving the news in databases or any forwarding of the news to third parties in a commercial context or for commercial purposes is only permitted with the prior written consent of EQS Group AG.</span></div></section></p></span></div></div>",
            "link": "https://www.tradingview.com/news/eqs:fbd8cecb5094b:0-acwa-board-of-directors-names-dr-samir-j-serhan-chief-executive-officer/",
            "pub_date": "2026-03-01 18:05:22",
            "source": "EQS",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coinpedia:fea72800c094b:0",
            "title": "Why Are Bitcoin, Ethereum and XRP Prices Going Up Today?",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The crypto market is staging a sharp comeback today, with total market capitalization climbing back above $2.3 trillion. After days of heavy selling and extreme fear, buyers have stepped in, pushing major cryptocurrencies higher across the board.</span></p><p class=\"\"><span>So what is driving the rally in Bitcoin, Ethereum, and XRP and why are altcoins suddenly flashing green?</span></p><p class=\"\"><span>Here is a simple breakdown of what is happening.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>1. A Technical Bounce From “Extreme Fear”</span></strong></p><p class=\"\"><span>The biggest reason behind today’s price jump is a technical rebound.</span></p><p class=\"\"><span>The Crypto Fear and Greed Index recently dropped to 16, deep in “extreme fear” territory. Historically, when sentiment becomes this negative, markets often see a relief rally because prices are considered oversold.</span></p><p class=\"\"><span>The total crypto market had fallen near $2.17 trillion before reclaiming its short-term moving average around $2.29 trillion. That recovery signaled that sellers were losing momentum and short-term buyers were returning.</span></p><p class=\"\"><span>This type of bounce is common after sharp liquidations.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>2. Massive Liquidations Cleared the Market</span></strong></p><p class=\"\"><span>Earlier, geopolitical tensions following US strikes on Iranian targets triggered heavy volatility across global markets. Crypto futures were hit hard.</span></p><p class=\"\"><span>Roughly $515 million worth of leveraged positions were liquidated within 24 hours, according to derivatives data.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Bitcoin saw around $187 million in liquidations</span></li><li class=\"listItem-bmN0_SHH\"><span>Ethereum and major altcoins followed</span></li><li class=\"listItem-bmN0_SHH\"><span>Open interest remains elevated near $400 billion</span></li></ul><p class=\"\"><span>When too many traders are using leverage, a sudden price move can force exchanges to automatically close positions. This creates sharp drops, but once the liquidations are flushed out, prices often rebound quickly.</span></p><p class=\"\"><span>That appears to be what we are seeing today.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>3. Bitcoin Is Leading, But Altcoins Are Catching Up</span></strong></p><p class=\"\"><span>At the time of writing:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Bitcoin </span><span> is trading near $66,400, up over 4 percent in 24 hours</span></li><li class=\"listItem-bmN0_SHH\"><span>Ethereum </span><span> is around $1,978, gaining nearly 7 percent</span></li><li class=\"listItem-bmN0_SHH\"><span>XRP is up more than 7 percent, trading around $1.37</span></li><li class=\"listItem-bmN0_SHH\"><span>Solana jumped over 9 percent</span></li><li class=\"listItem-bmN0_SHH\"><span>Cardano gained nearly 7 percent</span></li><li class=\"listItem-bmN0_SHH\"><span>Dogecoin climbed more than 5 percent</span></li><li class=\"listItem-bmN0_SHH\"><span>BNB added close to 5 percent</span></li></ul><p class=\"\"><span>Bitcoin dominance remains high at around 58%, which usually signals investors are still prioritizing larger, relatively safer assets. However, the strong gains in Layer 1 tokens show that risk appetite is slowly returning.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>4. Short Covering Is Adding Fuel</span></strong></p><p class=\"\"><span>Funding rates across major exchanges recently turned slightly negative. That means many traders were betting on further downside.</span></p><p class=\"\"><span>When prices start rising unexpectedly, short sellers are forced to buy back their positions to limit losses. This creates a “short squeeze,” pushing prices even higher in a short period of time.</span></p><p class=\"\"><span>That extra buying pressure is amplifying today’s rally.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>5. Broader Market Correlation</span></strong></p><p class=\"\"><span>Crypto has shown a strong correlation with US equities recently, particularly the S&amp;P 500. As traditional markets stabilized, digital assets followed.</span></p><p class=\"\"><span>The market is currently treating crypto as a macro risk asset. When stock sentiment improves, Bitcoin and altcoins tend to benefit.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>What Happens Next?</span></strong></p><p class=\"\"><span>The important level to watch is around $2.27 trillion in total market cap. If the market stays above this support, the next resistance zone lies between $2.41 trillion and $2.47 trillion.</span></p><p class=\"\"><span>Traders are closely monitoring:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>New headlines related to US and Middle East tensions</span></li><li class=\"listItem-bmN0_SHH\"><span>Funding rates flipping strongly positive or negative</span></li><li class=\"listItem-bmN0_SHH\"><span>Whether open interest continues to decline or rebuild</span></li><li class=\"listItem-bmN0_SHH\"><span>Bitcoin dominance trends</span></li></ul><p class=\"\"><span>If leverage rebuilds too quickly, another wave of volatility could follow. But if sentiment slowly improves without excessive speculation, this rebound could extend further.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/coinpedia:fea72800c094b:0-why-are-bitcoin-ethereum-and-xrp-prices-going-up-today/",
            "pub_date": "2026-03-01 17:08:51",
            "source": "Coinpedia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:d14255a94094b:0",
            "title": "US military used Anthropic in Iran strike despite ban order by Trump: WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The US military reportedly used Anthropic during a major air strike on Iran, only hours after President Donald Trump ordered federal agencies to halt use of the company’s systems.</span></p><p class=\"\"><span>Military commands, including US Central Command (CENTCOM) in the Middle East, used Anthropic’s Claude AI model for operational support, according to people familiar with the matter cited by The Wall Street Journal. The tool has reportedly assisted with intelligence analysis, identifying potential targets and running battlefield simulations. </span></p><p class=\"\"><span>The incident shows how deeply advanced AI systems have become embedded in defense operations. Even as the administration moved to sever ties with the company, Claude remained integrated into military workflows.</span></p><p class=\"\"><span>On Friday, the Trump administration instructed agencies to stop working with the company and directed the Defense Department to treat it as a potential security risk. The order came after contract talks broke down, with Anthropic refusing to grant unrestricted military use of its AI for any lawful scenario requested by defense officials.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><em><strong class=\"root-Tkn6WL2y\"><span>Crypto VC Paradigm expands into AI, robotics with $1.5B fund: WSJ</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Anthropic’s Claude AI used for classified operations</span></strong></p><p class=\"\"><span>Anthropic had previously secured a multiyear Pentagon contract worth up to $200 million alongside several major AI labs. Through partnerships involving Palantir and Amazon Web Services, Claude became approved for classified intelligence and operational workflows. The system was reportedly also involved in earlier operations, including a January mission in Venezuela that resulted in the capture of President Nicolás Maduro.</span></p><p class=\"\"><span>Tensions intensified after Defense Secretary Pete Hegseth demanded the company permit unrestricted military use of its models. Anthropic CEO Dario Amodei rejected the request, describing certain applications as ethical boundaries the company would not cross, even if it meant losing government business.</span></p><p class=\"\"><span>In response, the Pentagon began lining up replacement providers, reaching an agreement with OpenAI to deploy its AI models on classified military networks. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:735.3159851301115px;aspect-ratio:1.2255266418835191\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:d14255a94094b-85b25cd01bdddb41ef17949a1405effa-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:d14255a94094b-85b25cd01bdddb41ef17949a1405effa-resized.webp\" style=\"background-color:#eeefef\"/></picture></div></button></figure><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><em><strong class=\"root-Tkn6WL2y\"><span>Pantera, Franklin Templeton join Sentient Arena to test AI agents</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Anthropic CEO pushes back on Pentagon ban</span></strong></p><p class=\"\"><span>During an interview on Saturday, Anthropic CEO Dario Amodei said the company opposes the use of its AI models for mass domestic surveillance and fully autonomous weapons, responding to a US government directive that labeled the firm a defense “supply chain risk” and barred contractors from using its products. </span></p><p class=\"\"><span>He argued that certain applications cross fundamental boundaries, emphasizing that military decisions should remain under human control rather than be delegated entirely to machines.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Magazine: </span></strong></em><span>Bitcoin may take 7 years to upgrade to post-quantum — BIP-360 co-author</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:d14255a94094b:0-us-military-used-anthropic-in-iran-strike-despite-ban-order-by-trump-wsj/",
            "pub_date": "2026-03-01 18:03:38",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZP03S:0",
            "title": "Geely Automobile's Total February Sales Volume Up Approximately 1% Y/Y",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Geely Automobile Holdings Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAYS TOTAL SALES VOLUME FOR FEB UP APPROXIMATELY 1% Y/Y AT 206,160 UNITS OF VEHICLES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZP03S:0-geely-automobile-s-total-february-sales-volume-up-approximately-1-y-y/",
            "pub_date": "2026-03-01 18:07:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO068:0",
            "title": "Al-Nisr Al-Arabi Insurance Proposes FY Dividend Of 22% Of Subscribed Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>AL-NISR AL-ARABI INSURANCE COMPANY PSC (AAIN.AM):</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY DIVIDEND OF 22% OF SUBSCRIBED CAPITAL</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO068:0-al-nisr-al-arabi-insurance-proposes-fy-dividend-of-22-of-subscribed-capital/",
            "pub_date": "2026-03-01 17:57:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03N:0",
            "title": "Jordanian Duty Free Shops Proposes Dividend At A Rate Of 40% Of Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>JORDANIAN DUTY FREE SHOPS PSC (JDFS.AM):</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>JORDANIAN DUTY FREE SHOPS - CASH DIVIDEND AT A RATE OF 40% OF CAPITAL</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03N:0-jordanian-duty-free-shops-proposes-dividend-at-a-rate-of-40-of-capital/",
            "pub_date": "2026-03-01 17:51:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00W:0",
            "title": "Midddle Easte Holding Proposes Dividend Equal To 10% Paid In Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>MIDDDLE EASTE HOLDING COMPANY PLC (MEHC.AM):</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CASH DIVIDEND EQUAL TO 10% PAID IN CAPITAL</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00W:0-midddle-easte-holding-proposes-dividend-equal-to-10-paid-in-capital/",
            "pub_date": "2026-03-01 17:56:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "eqs:defe595d2094b:0",
            "title": "Huawei Launches Comprehensive U6GHz Portfolio to Unlock 5G-A Potential and Pave the Way for 6G",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span> </span></p><p class=\"\"><span> EQS Newswire / 01/03/2026 / 10:30 CET/CEST</span></p><p class=\"\"><span>BARCELONA, SPAIN - </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=dac8f0aae0dea8bcf4ec44dc1e89cb63&amp;application_id=2283358&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">Media OutReach Newswire</a><span> - 1 March 2026 - At MWC Barcelona 2026, Huawei unveiled a full suite of U6GHz products and solutions designed to fully unleash the potential of 5G-A and enable a smooth evolution towards 6G. This suite provides the large capacity, low latency, and premium user experience required for the emerging mobile AI era. </span></p><span> AI is rapidly emerging as the core engine of the intelligent world. According to IDC, AI applications and devices have seen explosive growth over the past year: global monthly active users surpassed 1 billion, AI-powered smartphones accounted for over 50% of new shipments, AI glasses and other emerging devices saw an annual growth rate of over 50%, and token consumption surged by hundreds of times. This brings great opportunities for the mobile industry but also raises multi-dimensional requirements on the network. For example, AI multimodal interactions increase uplink traffic demand by three to five times; real-time decision-making requires low latency and deterministic assurance; ubiquitous AI agents demand more secure and reliable wide-area connectivity.  Currently, 5G-A has become the mainstream commercial technology for global operators, and is also the focus of service innovation and future evolution. The U6GHz band, with its large bandwidth and superior coverage, is becoming a key band for 5G-A evolution and commercial use. Following WRC‑23, U6GHz has been designated as a key mobile communications band. China, the UAE, Brazil, and several European countries are actively promoting spectrum identification, allocation, and testing. In terms of the industry chain, mainstream CPEs and smartphones are expected to be commercially available in 2026, paving the way for large-scale commercial use of U6GHz.  Huawei's full U6GHz product suite covers a complete matrix of macro sites, micro sites, and microwave equipment, maximizing the advantages of ultra-large bandwidth in U6GHz. It precisely meets the core requirements of mobile AI applications for high capacity, low latency, and superior experience, providing a systematic solution for both the performance leap of 5G-A networks and the seamless evolution towards 6G.  To address outdoor coverage and capacity needs, Huawei has launched a series of AAU products. The U6GHz 256 TRX AAU adopts the extremely large antenna array (ELAA) design and digital-analog hybrid intelligent beamforming algorithms to deliver coverage capabilities comparable to C-band. Meanwhile, with the hyper-resolution MU-MIMO algorithm and 400 MHz ultra-large bandwidth, the product can achieve ultra-large capacity of 100 Gbps in the downlink and over 10 Gbps in the uplink, as well as optimal experience of 10 Gbps in the downlink and 1 Gbps in the uplink, to cope with the connection pressure brought by massive AI terminals and applications. To meet the network performance and deployment requirements in different scenarios, Huawei will also launch U6GHz AAUs with flexible combinations of channels and arrays, helping operators deploy 5G-A networks on a large scale in U6GHz and fully meet service requirements in the mobile AI era.  To meet the high concurrency and large capacity requirements of indoor AI applications, Huawei has launched U6GHz small cell products. They support the ultra-large bandwidth of 400 MHz in U6GHz and integrate and coordinate the U6GHz band with all sub-6 GHz bands. With simplified design and deployment, the products can help operators ensure consistent multi-dimensional experience of AI applications in both indoor and outdoor scenarios, allowing users to enjoy high-quality connections anytime and anywhere.  In terms of transmission, Huawei has launched new microwave products to meet the high‑bandwidth transmission requirements of U6GHz base stations. With industry-unique full-duplex technology, they can significantly improve the bandwidth and capacity of transport networks, meeting the peak traffic requirements of 5G-A and laying a solid foundation for evolution to 6G.  As AI adoption accelerates, U6GHz has become the key to exploring the present and unlocking the future. Huawei's full U6GHz product suite is now commercially available. It can not only address the capacity challenges of 5G-A, but also support smooth evolution to 6G. This will open up new commercial opportunities for operators and lay a robust connectivity foundation for the intelligent world. Hashtag: #Huawei</span><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><span>News Source: Huawei</span><p class=\"\"><span> 01/03/2026 Dissemination of a Financial Press Release, transmitted by </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=2be925ac0334ae7b4f51fbaee4a6daf0&amp;application_id=2283358&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS News</a><span>.</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><span>Media archive at www.todayir.com</span></p><p class=\"\"><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>Saving the news in databases or any forwarding of the news to third parties in a commercial context or for commercial purposes is only permitted with the prior written consent of EQS Group AG.</span></div></section></p></span></div></div>",
            "link": "https://www.tradingview.com/news/eqs:defe595d2094b:0-huawei-launches-comprehensive-u6ghz-portfolio-to-unlock-5g-a-potential-and-pave-the-way-for-6g/",
            "pub_date": "2026-03-01 17:30:12",
            "source": "EQS",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0C4:0",
            "title": "India's goods and services tax collections rise 7.9% in February",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>India collected 1.61 trillion rupees ($17.68 billion) in goods and services tax in February, about 7.9% higher than last year, the government said in a statement on Sunday.</span></p><p class=\"\"><span>($1 = 91.0460 Indian rupees)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0C4:0-india-s-goods-and-services-tax-collections-rise-7-9-in-february/",
            "pub_date": "2026-03-01 17:34:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0C3:0",
            "title": "Magnitude 5.8 earthquake strikes Japan, GFZ says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>An earthquake of magnitude 5.8 struck Kyushu, in Japan, the German Research Centre for Geosciences said on Sunday.</span></p><p class=\"\"><span>The quake was at a depth of 122 km (75.81 miles), GFZ said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0C3:0-magnitude-5-8-earthquake-strikes-japan-gfz-says/",
            "pub_date": "2026-03-01 17:09:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "sharecast:828d9efc1094b:0",
            "title": " Sunday newspaper round-up: Iran, Reform UK, Ukraine ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Confirmation of his death came early on Sunday, hours after US president Donald Trump announced the ayatollah's killing on social media. Khamenei had ruled Iran since 1989. </span></p><p class=\"\"><span>The conflict widened rapidly across the region, with Iran striking Dubai's Fairmont hotel, according to the Guardian, setting the building alight after a missile hit the Palm Jumeirah property, injuring four people. Dubai authorities later said debris from an intercepted drone caused a fire at the Burj Al Arab and at Dubai International Airport. Abu Dhabi Airports reported an incident at Zayed International Airport that resulted in one fatality and seven injuries, before deleting the statement. </span></p><p class=\"\"><span>Donald Trump warned that the US would respond \"with a force that has never been seen before\" if Iran retaliates following Khamenei’s death. In a social media post, Trump said Iran had signalled plans to strike back \"very hard\".</span></p><p class=\"\"><span>Iranian state media confirmed Khamenei’s death early on Sunday, according to </span><em><span>the Independent</span></em><span>, with Tasnim reporting that several members of his family were also killed.</span></p><p class=\"\"><span>Prime minister Sir Keir Starmer backed US efforts to force regime change in Iran but faced questions over why the UK had not granted the US access to British military facilities in the region.</span></p><p class=\"\"><span>Starmer said the UK had played no role in the strikes but reiterated that Iran's regime was \"utterly abhorrent\", according to </span><em><span>the Times</span></em><span>, accusing the Middle Eastern nation of murdering its own citizens, crushing dissent and destabilising the region. He added that Iran must \"never be allowed to develop a nuclear weapon\", describing that as the UK's primary objective alongside its allies. A Ministry of Defence source said no British bases were used in the operation.</span></p><p class=\"\"><span>Reform UK unveiled proposals for sweeping changes to the UK's electoral system, according to</span><em><span> the Independent</span></em><span>, including tight restrictions on postal voting and the removal of voting rights for Commonwealth citizens.</span></p><p class=\"\"><span>Nigel Farage said postal voting had turned UK elections into a \"laughing stock\" and called the participation of non‑British citizens \"absurd\". Under the proposals, postal votes would be limited to the elderly, disabled, serving armed forces personnel and those working overseas during an election.</span></p><p class=\"\"><span>The party also intends to end voting rights for Commonwealth citizens resident in the UK. A Reform UK spokesperson said the changes would not affect Irish citizens, who retain the right to vote in parliamentary elections. </span></p><p class=\"\"><span>Russia has indicated it would accept proposals for Ukraine's postwar security guarantees, said </span><em><span>the Times</span></em><span>, citing President Zelensky's chief of staff.</span></p><p class=\"\"><span>Kyrylo Budanov told Ukrainian television that, during recent talks, Russia said it would accept the security guarantees offered to Ukraine by the United States. The Kremlin has not confirmed the position, but the development could mark the most significant progress in ceasefire discussions since the full‑scale invasion began four years ago.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/sharecast:828d9efc1094b:0/",
            "pub_date": "2026-03-01 17:16:36",
            "source": "ShareCast",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO067:0",
            "title": "Adani Enterprises Says ADSTL Executed An Agreement On March 1 With Punj Lloyd Aviation To Acquire 14.2% Stake In Air Works",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Adani Enterprises Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ADANI ENTERPRISES LTD -  ADSTL EXECUTED AN AGREEMENT ON MARCH 1 WITH PUNJ LLOYD AVIATION TO ACQUIRE 14.2% STAKE IN AIR WORKS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO067:0-adani-enterprises-says-adstl-executed-an-agreement-on-march-1-with-punj-lloyd-aviation-to-acquire-14-2-stake-in-air-works/",
            "pub_date": "2026-03-01 17:14:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00U:0",
            "title": "Pyramisa Hotels And Resorts FY Consol Profit EGP 751.9 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>PYRAMISA HOTELS AND RESORTS SAE </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PYRAMISA HOTELS AND RESORTS FY CONSOL NET PROFIT ATTRIBUTABLE EGP 751.9 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PYRAMISA HOTELS AND RESORTS FY CONSOL OPERATING REVENUE EGP 3.07 BILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00U:0-pyramisa-hotels-and-resorts-fy-consol-profit-egp-751-9-million/",
            "pub_date": "2026-03-01 17:05:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZP03C:0",
            "title": "SAIC Motor's February Vehicle Sales Down 8.6% Y/Y",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SAIC Motor Corp Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAYS FEB VEHICLE SALES DOWN 8.6% AT 269,465 UNITS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZP03C:0-saic-motor-s-february-vehicle-sales-down-8-6-y-y/",
            "pub_date": "2026-03-01 16:55:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZP03N:0",
            "title": "BAIC BluePark New Energy Tech's Unit Sold 7,364 Vehicles In February",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BAIC BluePark New Energy Technology Co Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAYS UNIT SOLD 7,364 VEHICLES IN FEB, UP 18.3% Y/Y</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZP03N:0-baic-bluepark-new-energy-tech-s-unit-sold-7-364-vehicles-in-february/",
            "pub_date": "2026-03-01 16:59:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:dd60989e5094b:0",
            "title": "Senator Calls For Ban On Insider Trading After US Strike On Iran Generated $1.2 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Senator Chris Murphy said he will introduce legislation banning betting on military actions following suspicious trades in Iran strike contracts.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Bubblemaps identified six wallets that collectively made about $1.2 million on Polymarket contracts tied to the strike.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Public trading records show several accounts bought “Yes” shares shortly before the event and later redeemed large profits.</span></li></ul></span></div><span><p class=\"\"><span>Democrat Senator Chris Murphy said on Saturday that he would introduce legislation to ban betting on military actions after traders made significant profits on Polymarket ahead of a U.S. strike on Iran.</span></p><p class=\"\"><span>Murphy, who represents Connecticut, said on X that people were “profiting off war and death” and that he would be drafting a bill “ASAP” to prevent markets from allowing wagers tied to armed conflict. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:525.2225519287834px;aspect-ratio:0.8753709198813057\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:dd60989e5094b-cfd3e9a61d5ac5681ca33b2eff63f420-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-03-01 at 3.51.50 AM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:dd60989e5094b-cfd3e9a61d5ac5681ca33b2eff63f420-resized.webp\" style=\"background-color:#b5b6b8\"/></picture></div></button></figure><p class=\"\"><span>His comments came after Bubblemaps, a blockchain analytics firm, highlighted concentrated betting activity placed shortly before the strike.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>$1.2 Million In Polymarket Trades Flagged</span></strong></p><p class=\"\"><span>Bubblemaps identified six wallets that collectively generated roughly $1.2 million betting on the Polymarket contract titled “US strikes Iran by February 28, 2026?” According to the firm, most of the wallets were funded within 24 hours and accumulated “Yes” positions hours before the strike occurred.</span></p><p class=\"\"><span>Public Polymarket profiles show detailed transaction histories. The account labeled “Anon” bought approximately $10,000 worth of “Yes” shares at around 18¢ and later redeemed about 55,555 shares for more than $55,000. </span></p><p class=\"\"><span>Another profile, \"dicedicedice,\" showed nearly $150,000 redeemed from the same contract. Adding to this, a separate account displayed more than $119,000 in profit over the past month, with activity concentrated around the Iran strike market.</span></p><p class=\"\"><span>Adding to the scrutiny, US Congress representative Mike Levin pointed to another Polymarket account called “Magamyman,” which made more than $515,000 in a single day betting on the strike. Levin wrote that the account’s first trade was placed 71 minutes before the news became public and that roughly $87,000 was turned into more than half a million dollars overnight.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:344.5398773006135px;aspect-ratio:0.5742331288343558\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:dd60989e5094b-cc067a6543705f550c298ed798a73f0d-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-03-01 at 3.53.58 AM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:dd60989e5094b-cc067a6543705f550c298ed798a73f0d-resized.webp\" style=\"background-color:#dedfdf\"/></picture></div></button></figure><p class=\"\"><span>Levin also noted that President Trump was on Polymarket’s advisory board and that his firm invested double-digit millions into the platform last year. He further referenced prior DOJ and CFTC investigations into Polymarket that were later dropped.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Growing Scrutiny Of Prediction Markets</span></strong></p><p class=\"\"><span>Murphy’s proposed legislation came amid increasing political attention on prediction markets, particularly those tied to sensitive geopolitical events.</span></p><p class=\"\"><span>Last month, several Democratic lawmakers co-sponsored the Public Integrity in Financial Prediction Markets Act of 2026, which would prohibit elected officials from trading contracts tied to policies under their control.</span></p><p class=\"\"><span>The Polymarket contract centered on escalating tensions between the United States and Iran. The strike followed heightened rhetoric from former President Donald Trump, who had warned of potential military action if Iran did not curb its nuclear ambitions. Reports of coordinated U.S. and Israeli military activity intensified speculation in global markets, with crypto assets reacting sharply during the escalation.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CFTC Stands By Prediction Markets</span></strong></p><p class=\"\"><span>Mike Selig of the CFTC said that the agency </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/cryptocurrency/cftc-mike-selig-court-fight-target-prediction-markets/cZRWoHhR4uo\" rel=\"nofollow\" target=\"_blank\">filed an amicus curiae brief</a><span> in support of prediction markets to protect its unique regulatory power in the face of a rise in state-level lawsuits. Selig said that event contracts are not gambling laws, but rather federally regulated derivatives laws. He said that making federal oversight weaker could hurt the integrity of the market, make it harder to protect investors, and damage the United States' reputation as a global financial leader.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:dd60989e5094b:0/",
            "pub_date": "2026-03-01 17:04:17",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO064:0",
            "title": "Tata Motors Passenger Vehicles Says February 2026 Total Sales Stood At 63,331 Units",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Tata Motors Passenger Vehicles Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TATA MOTORS PASSENGER VEHICLES - FEBRUARY 2026 TOTAL SALES STOOD AT 63,331 UNITS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO064:0-tata-motors-passenger-vehicles-says-february-2026-total-sales-stood-at-63-331-units/",
            "pub_date": "2026-03-01 17:04:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260301000737:0",
            "title": "Here's how much you could pay for a gallon of gas by May because of the attacks on Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Myra P. Saefong</span></p><p class=\"\"><span>U.S.-Israel strikes against Iran will push up oil prices, and those at the pump: GasBuddy</span></p><p class=\"\"><span>Americans should brace for a jump in gas prices at the pump after the U.S. and Israel launched military strikes against Iran, says GasBuddy.</span></p><p class=\"\"><span>There's little doubt that the military strikes launched this weekend by the U.S. and Israel on Iran, one of the world's largest crude producers, will lead to a spike in oil prices.</span></p><p class=\"\"><span>Even more certain is the impact the conflict will have on average Americans who pay for gasoline at the pump.</span></p><p class=\"\"><span>Without a doubt, this looks to be the biggest pricing event for gasoline since the Russian invasion of Ukraine in 2022, said Patrick De Haan, head of petroleum analysis at GasBuddy.</span></p><p class=\"\"><span>It's probably one of the top five impactful events in the last decade or so, he told MarketWatch. Other major events were the Russian invasion of Ukraine and the Organization of the Petroleum Exporting Countries' decision in 2014 to keep oil (CL.1) (BRN00) output steady despite worries about a global supply glut.</span></p><p class=\"\"><span>Disruptions also swept up U.S. crude and oil-product supply when Hurricane Harvey hit in 2017, while the Trump administration's previous \"maximum pressure\" campaign against Iran, including rounds of new sanctions, led to a rally in oil prices.</span></p><p class=\"\"><span>With the new conflict, there's still a \"very cloudy outlook\" in terms of what level of retaliation Iran may pursue and what that may mean for global supply and demand balances, said De Haan.</span></p><p class=\"\"><span>Read: Iran conflict raises talk of a return to $100-a-barrel oil</span></p><p class=\"\"><span>Americans will be very anxious about what the conflict could mean for oil prices, given how President Trump made low oil prices his \"signature policy,\" he said. This certainly has potential to \"offset lower energy prices for some time, and motorists are going to feel a \"bit more a pinch\" in prices, which typically already happens in the springtime as demand and prices edge higher.</span></p><p class=\"\"><span>The average price for a gallon of regular gasoline stood at $2.957 early evening on Saturday, according to GasBuddy.</span></p><p class=\"\"><span>Prices were already seeing a \"slow, steady uptick\" with spring break travel right around the corner, said De Haan, and as temperatures warm up, fuel demand increases from now to mid- to late-July.</span></p><p class=\"\"><span>The attacks on Iran will exacerbate that increase, he said, though it's not likely to be on the level of the \"superspike\" seen in the wake of Russia's invasion of Ukraine in 2022, when retail gas prices briefly topped $5 in June of that year.</span></p><p class=\"\"><span>The national average could climb between 25 cents to 50 cents a gallon between now and April or May to the mid-$3 range, said De Haan.</span></p><p class=\"\"><span>And if things go \"bad at every turn,\" he said, consumers could potentially see prices rising by even more than 50 cents a gallon.</span></p><p class=\"\"><span>-Myra P. Saefong</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260301000737:0/",
            "pub_date": "2026-03-01 17:05:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00V:0",
            "title": "Pyramisa Hotels And Resorts Proposes FY Dividend Of EGP 4 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>PYRAMISA HOTELS AND RESORTS SAE </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PROPOSES FY CASH DIVIDEND OF EGP 4 PER SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00V:0-pyramisa-hotels-and-resorts-proposes-fy-dividend-of-egp-4-per-share/",
            "pub_date": "2026-03-01 17:05:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZP03B:0",
            "title": "Huaan Securities' Shareholder To Boost Stake",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Huaan Securities Co Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAYS CONTROLLING SHAREHOLDER PLANS TO BOOST STAKE IN CO BY UP TO 2%</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZP03B:0-huaan-securities-shareholder-to-boost-stake/",
            "pub_date": "2026-03-01 16:48:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZP02W:0",
            "title": "KLM cancels or adjusts flights across Middle East",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    KLM has cancelled or adjusted flights across the Middle East because of the </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/iran-crisis-live-explosions-tehran-israel-announces-strike-2026-02-28/\" rel=\"nofollow\" target=\"_blank\">conflict that erupted in the region</a><span> over the weekend, avoiding the airspace of Iran, Iraq, Israel and parts of the Gulf, it said on Saturday evening.</span></p><p class=\"\"><span>The Dutch arm of Air France‑KLM </span><span> said that flights to and from Dubai, Dammam and Riyadh due to take off over the weekend have been cancelled. </span></p><p class=\"\"><span>KLM had already brought forward suspension of its Amsterdam–Tel Aviv service to February 28 after strikes hit Iran.</span></p><p class=\"\"><span>The carrier said it is monitoring developments closely and will update its schedule as needed and that passengers on affected flights will be rebooked once operations resume.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZP02W:0-klm-cancels-or-adjusts-flights-across-middle-east/",
            "pub_date": "2026-03-01 16:37:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03M:0",
            "title": "Tesla Raises Price Of Cybertruck Dual Motor AWD To $69,990 - Website",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TESLA - RAISES PRICE OF CYBERTRUCK DUAL MOTOR AWD TO $69,990</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03M:0-tesla-raises-price-of-cybertruck-dual-motor-awd-to-69-990-website/",
            "pub_date": "2026-03-01 16:15:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00R:0",
            "title": "Metal And Recycling Unit Signs KWD 8.8 Million Contract With Al-Diwan Al-Amiri",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>METAL AND RECYCLING CO KSCP </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>METAL AND RECYCLING - UNIT SIGNS KWD 8.8 MILLION CONTRACT WITH AL-DIWAN AL-AMIRI</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>METAL AND RECYCLING - CONTRACT FOR MAINTENANCE OF FACILITIES AFFILIATED WITH SHEIKH JABER AL-AHMAD CULTURAL CENTRE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00R:0-metal-and-recycling-unit-signs-kwd-8-8-million-contract-with-al-diwan-al-amiri/",
            "pub_date": "2026-03-01 16:17:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0BX:0",
            "title": "Kamco Investment FY Dividend 10 Fils/Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>KAMCO INVESTMENT </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KAMCO INVESTMENT FY DIVIDEND 10 FILS/SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0BX:0-kamco-investment-fy-dividend-10-fils-share/",
            "pub_date": "2026-03-01 16:17:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03F:0",
            "title": "Warba Insurance And Reinsurance Q4 Profit 900,894 Dinars",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>WARBA INSURANCE AND REINSURANCE COMPANY KSCP </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBA INSURANCE AND REINSURANCE Q4 NET PROFIT ATTRIBUTABLE 900,894 DINARS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBA INSURANCE AND REINSURANCE Q4 TOTAL OPERATING REVENUE 950,541 DINARS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBA INSURANCE AND REINSURANCE FY CASH DIVIDEND 15%</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03F:0-warba-insurance-and-reinsurance-q4-profit-900-894-dinars/",
            "pub_date": "2026-03-01 16:17:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO061:0",
            "title": "NAPESCO Signs KWD 11.9 Million Long Term Supply Agreement With KoC",
            "description": "<div class=\"body-KX2tCBZq bodyPreview-nzzZVyQ3 body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div inert=\"\"></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO061:0-napesco-signs-kwd-11-9-million-long-term-supply-agreement-with-koc/",
            "pub_date": "2026-03-01 16:18:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO00Q:0",
            "title": "Al Safat Investment Q4 Net Profit 284,615 Dinars",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>AL SAFAT INVESTMENT </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AL SAFAT INVESTMENT Q4 NET PROFIT ATTRIBUTABLE 284,615 DINARS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AL SAFAT INVESTMENT Q4 TOTAL OPERATING REVENUE 760,945 DINARS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AL SAFAT INVESTMENT - FY STOCK DIVIDEND 5%</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO00Q:0-al-safat-investment-q4-net-profit-284-615-dinars/",
            "pub_date": "2026-03-01 16:18:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}