{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0O3:0",
            "title": "C-Mer Eye Care Sees Adjusted EBITDA To Be Around HK$300 Mln For Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">C-Mer Medical Holdings Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES ADJUSTED EBITDA TO BE AROUND HK$300 MILLION FOR YEAR</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES REVENUE TO BE AROUND HK$1,900 MILLION IN FY2024</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">EXPECTED RESULT DUE TO WEAKER THAN EXPECTED PERFORMANCE OF CERTAIN HOSPITALS AND CLINICS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES PROFIT ATTRIBUTABLE TO BE WITHIN HK$50 MILLION TO HK$60 MILLION FOR FY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0O3:0-c-mer-eye-care-sees-adjusted-ebitda-to-be-around-hk-300-mln-for-year/",
            "pub_date": "2025-02-06 01:19:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0OQ:0",
            "title": "Bangchak Corporation Posts Qtrly Total Sales Volume 4,437 Mln Liters For Refinery & Trading Business Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bangchak Corporation PCL :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">QTRLY TOTAL SALES VOLUME 4,437 MILLION LITERS FOR REFINERY &amp; TRADING BUSINESS GROUP</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0OQ:0-bangchak-corporation-posts-qtrly-total-sales-volume-4-437-mln-liters-for-refinery-trading-business-group/",
            "pub_date": "2025-02-06 01:19:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008686:0",
            "title": "Teledyne Price Target Maintained With a $585.00/Share by Needham",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008686:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008690:0",
            "title": "Tech, Media & Telecom Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Technology, Media and Telecom. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1213 ET - Apple shares are under modest pressure amid reports that Chinese regulators are considering opening a formal investigation into App Store's fees and policies, even if revenue from the App Store in China is a manageable $5 billion, Wedbush analysts say in a research note. \"So its less about revenue exposure for investors and more about building US/China tensions with US Big Tech in line for retaliatory shots across the bow,\" the analysts say, noting that China recently opened an antitrust probe into Alphabet's Google. \"This is all a game of high stakes poker between Trump and China and Apple is clearly a chip on the table,\" the analysts add. Apple shares fall 1% to $230.39. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">0933 ET - ATS thinks that its worldwide scale can help jittery customers navigate U.S. tariffs. On the earnings call, executives say they have been discussing tariffs with customers who are cautious about the situation, but the company feels secure about its ability to support client supply chain complexities. ATS points to the company's global footprint as a big factor for stability--with a substantial presence in the U.S., Germany as well as Canada. \"Conversations are more on the positive side, but clients are waiting to see how things will shake out,\" executives say. (adriano.marchese@wsj.com)</p><p class=\"\">0857 ET - Goldman Sachs economists think the risks of tariff escalation remain very real. The bank's team now projects that the U.S. will enact a 10% global tariff on critical imports such as semiconductors and pharmaceuticals as its baseline forecast, as well as a tariff on cars from the EU. If its current expected scenario is implemented, the tariffs could erase most progress on inflation otherwise expected this year, leaving core PCE inflation at 2.6% over the 12 months through December, Goldman projects. If Canada and Mexico tariffs are implemented after all, inflation would instead increase, peaking just above 3%, Goldman writes. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0755 ET - Uber says it expects gross bookings in the current quarter of $42 billion-$43.5 billion, with the top end of that range coming in line with Wall Street's consensus view, according to FactSet. The 1Q outlook assumes a currency headwind to total growth of about 5.5 percentage points, the ride-hailing company says. Shares fall 5.3% premarket, despite 4Q results otherwise coming in ahead of Street views. (mark.long@wsj.com)</p><p class=\"\">0518 ET - Google owner Alphabet reported weaker-than-expected growth at its cloud-computing business, AJ Bell's Dan Coatsworth writes in a research note. Google Cloud revenue grew to nearly $11.96 billion in the fourth quarter from $9.19 billion a year earlier, below a FactSet forecast of $12.16 billion. Weaker-than-expected growth in cloud computing suggests the AI frenzy isn't automatically translating into big bucks for infrastructure providers, Coatsworth says. Alphabet shares are down 7.4% premarket at $191.12. (mauro.orru@wsj.com)</p><p class=\"\">0452 ET - Alphabet's capital-expenditures target for the year raises fears among investors that the Google owner might be wasting money, AJ Bell's Dan Coatsworth writes in a note to clients. Alphabet Chief Executive Sundar Pichai said the group expects to invest roughly $75 billion in capex this year. Investors would have welcomed large capex in the past as a sign that Alphabet was doing everything in its power to cash in on the AI frenzy, Coatsworth says. \"Now the reverse is true,\" he says. \"There are fears it might be digging itself a big hole and potentially wasting money if rivals like DeepSeek have shown it is possible to do things a lot cheaper.\" Alphabet shares are down 7.5% premarket at $190.91. (mauro.orru@wsj.com)</p><p class=\"\">0433 ET - Shares of Google owner Alphabet are down Wednesday premarket after the tech giant posted revenue below market expectations for the fourth quarter. Alphabet stock closed 2.6% higher at $206.38 ahead of results on Tuesday. Shares fell in after-hours trading and are down 7% Wednesday premarket, touching a low of $191.10. Revenue in the fourth quarter grew 12% to $96.47 billion, below a FactSet forecast of $96.72 billion. Alphabet hasn't reported a growth rate that low since 2023. (mauro.orru@wsj.com)</p><p class=\"\">0155 ET - Chinese AI company DeepSeek's breakthrough is unlikely to hurt demand in the short-term, although the market will likely cut multiples to price on uncertainties in the longer term, according to Julius Baer analysts in an emailed commentary. The market is debating on the long-term impact, as optimists argue that a lower entry barrier would attract new players, which should boost semiconductor demand, they write. \"We do not expect much weakness in the near-term demand,\" the analysts note. They add that long-term demand will be determined by changes in AI-driven computing needs, such as inference, noting that such demand could offset the possibly lower computing demand in training. DeepSeek's development marks a major evolution, though not entirely a revolution, in artificial intelligence, they say. (tracy.qu@wsj.com)</p><p class=\"\">2237 ET - Inari Amertron's FY 2025-FY 2026 earnings my be pressured by weaker radio frequency revenue as handset sales slow down, CGS International analysts Shafiq Kadir and Dharmini Thuraisingam say in a note. Margin dilution from new packaging ventures could add pressure on earnings, they write, as CGS cuts its forecast for Inari's FY 2025-FY 2026 EPS by 19%-20%. However, margins may recover by FY 2026-FY 2027 with new businesses scaling up production, they add. CGS International lowers Inari's target price to MYR2.60 from MYR2.90, while maintaining a hold rating, citing near-term risks from a subdued automotive market and policy uncertainties under the Trump administration. Shares are 0.4% lower at MYR2.44. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008690:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008693:0",
            "title": "ICE Canola Market Weakens at Midday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WINNIPEG, Manitoba--The ICE Futures canola market was weaker at midday Wednesday, taking back Tuesday's gains as losses in outside markets weighed on values.</p><p class=\"\">Sharp declines in crude oil spilled into world vegetable oil markets on Wednesday, with Chicago soyoil, European rapeseed and Malaysian palm oil all lower.</p><p class=\"\">The temporary pause on tariff threats from the United States remained somewhat supportive, although the likelihood of continued chaos from the Trump administration kept some caution in all markets.</p><p class=\"\">Solid end user demand and tightening supply projections provided underlying support for canola, with values also holding above most major moving averages from a chart standpoint.</p><p class=\"\">An estimated 19,500 canola contracts traded as of 11:53 ET.</p><p class=\"\">Prices in Canadian dollars per metric tonne at 11:53 ET:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>           Price      Change <br/>Mar       637.60     dn 9.60 <br/>May       645.50     dn 9.00 <br/>Jul       650.50     dn 8.60 <br/>Nov       636.30     dn 6.70 <br/> </pre><p class=\"\">Source: Commodity News Service Canada, news@marketsfarm.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008693:0-ice-canola-market-weakens-at-midday/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008688:0",
            "title": "Health Care Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Health Care sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1029 ET - GSK has to prove its pipeline is packed with new blockbuster treatments to withstand investors' concerns over its vaccine business slowdown in China and the U.S., AJ Bell investment director Russ Mould says. Further worries over the likely appointment of vaccine-sceptic Robert F Kennedy Jr. as Secretary of Health and Human Services in the U.S. still linger, he says. The British pharma giant's posted a second consecutive drop in sales in the fourth quarter, driven by a 19% decline in sales of its flu shots and a 52% plunge for its respiratory treatment Arexvy. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">1025 ET - GSK's 2025 outlook is promising, fueled by the sales growth expectations for its specialty medicines, Quilter Cheviot healthcare analyst Sheena Berry says in a note. The British pharma giant's clinical results for its chronic-cough drug candidate and regulatory decisions on a potential comeback of its blood-disorder treatment Blenrep are crucial for the group's future trajectory, she says. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">0857 ET - Goldman Sachs economists think the risks of tariff escalation remain very real. The bank's team now projects that the U.S. will enact a 10% global tariff on critical imports such as semiconductors and pharmaceuticals as its baseline forecast, as well as a tariff on cars from the EU. If its current expected scenario is implemented, the tariffs could erase most progress on inflation otherwise expected this year, leaving core PCE inflation at 2.6% over the 12 months through December, Goldman projects. If Canada and Mexico tariffs are implemented after all, inflation would instead increase, peaking just above 3%, Goldman writes. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0635 ET - With anxiety running high into Novo Nordisk's results, a decent topline beat for the quarter, despite a slight Wegovy miss, coupled with strong guidance for 2025 is good enough to get the story back on track, Barclays analysts write. Sales were 5% above company consensus with Ozempic in line and Wegovy 2% below. 2025 topline guidance of 16%-24% is above Barclays expectations. \"We think this is a good enough print to get shares moving back in the right direction.\" Shares trade 3.1% higher at 611 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0347 ET - Novo Nordisk's 2025 outlook is reassuring, says Sheena Berry at Quilter Cheviot. The Danish pharmaceutical company expects a robust 16%-24% sales growth for the year, Berry says. Fourth-quarter sales rose 30%, outpacing expectations, although this was partly driven by insulin rebate adjustments, she notes. The performance of key growth drivers, Ozempic and Wegovy, remains strong, with Ozempic meeting expectations and Wegovy slightly underperforming. Novo Nordisk is set to initiate a new CagriSema Phase 3 trial in 2025 and plans to file with regulators in the first quarter of 2026, a slight delay to ensure a secure supply chain. Shares trade 4.5% higher at 619 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0338 ET - Novo Nordisk's initial 2025 outlook is just ahead of Jefferies's expectations. But given a higher starting point and stronger currency effects it suggests up to 6% sales and 10% EBIT consensus upgrades, analysts at the bank write. Novo Nordisk's fourth-quarter sales beat expectations by 5%, mostly on positive U.S. gross-to-net adjustments--the discount offered between the list price and the actual net sales price--for its insulins. Sales of Wegovy were shy of expectations while Ozempic and Rybelsus were in line. A better gross margin, higher research and development costs but less selling and distribution spend helped EBIT beat by 9% and EPS by 6%. The stock will likely tick higher initially but could then fade, Jefferies says. Shares trade 4.2% higher at 617.20 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0337 ET - GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p><p class=\"\">0330 ET - Novo Nordisk's sales guidance is materially ahead of expectations, Intron Health's Naresh Chouhan writes. The company expects sales to grow 16%-24% this year with EBIT growing 19%-27%. Fourth-quarter EBIT beat expectations by 9% as the gross margin beat by 140 basis points and the EBIT margin beat by 170 basis points. \"Given recent concerns on growth, we expect the shares to be up strongly this morning given the sales guidance is materially higher than consensus was expecting and Wegovy was in-line,\" Chouhan says. Shares trade 4.3% higher at 617.90 Danish kroner. (dominic.chopping@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008688:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008692:0",
            "title": "Financial Services Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Financial Services. Exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1153 ET - The market's stock reaction to PayPal earnings was overblown, especially considering underlying numbers such as transaction margin dollar growth, Bernstein analysts say in a research note. The digital-payments company also continued growing incrementality of many initiatives such as modern experiences, debit cards and Venmo. \"These initiatives, along with consumer habituation drivers such as debit cards, can support Branded volume growth in 2025,\" the analysts say. Overall, PayPal appears to be under more solid footing under the new management team, the analysts add, noting that they expect slightly more favorable risk-reward in the near-term. Shares rise 2.2% following a 13% drop on Tuesday. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">1002 ET - A new Redfin report reveals that nearly 70% of single, divorced, or separated individuals struggle with rent or mortgage payments, compared to over half of married people. Those living with a partner but unmarried face the highest struggle at over 75%. Single individuals often rely on one income, with 63% earning under $50,000 annually, versus 26% of married couples. Conversely, 29% of married people earn over $100,000, compared to just 7% of singles and 6% of divorced. Married couples benefit from tax advantages, enhancing financial stability. Despite these struggles, most pay on time, Redfin says.  (chris.wack@wsj.com)</p><p class=\"\">0632 ET - DNB Bank could see consensus estimates increase by a low single digit following its results, JPMorgan analysts say in a research note. The bank posted better-than-expected underlying net interest income and costs trends. Net profit for the fourth quarter came 28% ahead of a bank-provided consensus, reflecting a lower-than-expected 6% tax rate, the analysts say. Costs were also 2% better than expected, JPM says. Net interest income at 16.72 billion Norwegian kroner in 4Q rose 4% compared with the prior quarter and 5% on year, the analysts say. Shares trade 2.2% higher at 245.50 Norwegian kroner. (pierre.bertrand@wsj.com)</p><p class=\"\">0610 ET - Credit Agricole's fourth-quarter pretax profit exceeded JPMorgan's estimates, analysts say. The result was driven by contribution from Banco BPM as well as by higher revenue from the French bank's asset gathering and corporate and investment banking businesses, JPM analysts say. Corporate and investment banking, asset management, insurance and private banking revenues were stronger than expected, and JPM says it expects low single-digit EPS upgrades after the result. The upgrade is expected to be driven by the performance of Credit Agricole's asset gathering and its corporate and investment banking business, JPM says in a research note. Shares trade 1.8% higher at 14.82 euros. (pierre.bertrand@wsj.com)</p><p class=\"\">0248 ET - Santander posted a strong set of fourth-quarter results alongside guidance for 2025 and plans for capital returns to shareholders that are better than expected, Barclays's Cecilia Romero Reyes and Paola Sabbione say in a research note. The Spanish bank reported quarterly net profit and revenue that exceeded consensus forecasts, with results in Spain, Mexico, Brazil and the U.S. that were better than anticipated, Barclays says. The group's 2025 target for return on tangible equity--a profitability measure--of more than 17% is at the high end of previous guidance. Moreover, its intention to return 10 billion euros through buybacks is ahead of consensus expectations of 6 billion euros, according to Barclays. (adria.calatayud@wsj.com)</p><p class=\"\">0149 ET - Thai Credit Bank appears confident in lowering credit costs in 2025, CGS International's Weerapat Wonk-Urai says, citing management commentary at an analysts' briefing. Management highlighted the bank's improving debt collection capabilities, supported by its front office staff helping with loan collections as soon as the loans become overdue, the analyst says in a research report. Also, the bank sold non-performing loans worth THB1.9 billion last year and plans to sell THB1.4 billion worth of NPLs this year, the analyst adds. The brokerage raises the stock's target price to THB26.12 from THB26.00 with an unchanged add rating. Shares are 1.0% lower at THB19.00. (ronnie.harui@wsj.com)</p><p class=\"\">2339 ET - Japan's cash earnings jumped in December, while Moody's Analytics' Stefan Angrick sees little evidence of sustained real wage growth. At first glance, the data suggests things are turning around as monthly cash earnings rose solidly, the economist says, adding that the devil is in the details. Though nominal pay growth is picking up, the gains are uneven, and real cash earnings climbed only 0.6% on year, he says, describing it \"a far more modest gain than the glossy nominal figure.\" The pay bump was also driven significantly by temporary factors, such as bonuses. Wage growth is likely to improve despite strong headwinds expected in 2025, including, but not limited to, a potential inflation spike, he adds. Much depends on the spring wage negotiations. If pay gains come in below 5%, that could delay the rate hikes, he adds. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">2256 ET - Insurance broker and underwriter Steadfast gets upgraded to buy from hold at Goldman Sachs, where analysts think that the Australian company looks cheap compared with global peers. They think that Steadfast will maintain its annual guidance despite moderation in commercial rates for small and medium enterprises. They see limited risk from strata reviews and reckon that Steadfast was tracking well through the first fiscal quarter, albeit performance looked to be acquisition led. Steadfast is trading at less than 18 times one-year forward earnings, which they write in a note is below mid-cycle multiples. GS keeps a A$6.50 target price on the stock. Shares are up 1.7% at A$5.795. (stuart.condie@wsj.com)</p><p class=\"\">2157 ET - Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">1825 ET - BlackRock, the world's largest asset manager, last year announced a series of acquisitions of private market-focused firms that \"lay a foundation for an increased integration of public and private\" assets, Apollo's CEO Marc Rowan says during an earnings call. \"I continue to believe this convergence of public and private will be a very important source of demand for private assets,\" Rowan says. BlackRock last year acquired infrastructure-focused Global Infrastructure Partners and agreed to buy credit specialist HPS Investment Partners as well as Preqin, a provider of private-market research. \"We envision that traditional asset managers will evolve their businesses to include products that are public and private,\" Rowan adds. \"Our industry and our firm will be a supplier of products to [them].\" (luis.garcia@wsj.com; @lhvgarcia)</p><p class=\"\">1818 ET - Risks to Macquarie's balance sheet from its investments in renewable energy look manageable to Morgan Stanley. Analyst Andrei Stadnik estimates some A$2 billion of Macquarie's principal investments, or 18%, are in green energy. Still, only 10% of investments by Corio--Macquarie's unit focused on offshore wind-energy developments--are in the U.S. and exposed to policy shifts by the Trump administration. \"Elsewhere, we estimate Macquarie booked a A$50 million gain on sale of Formosa 2 offshore wind in Asia, so offshore wind transactions are continuing,\" Morgan Stanley says. \"Nonetheless, we have baked in a A$150 million 2H impairment charge for principal investments in renewables.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1232 ET - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008692:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008689:0",
            "title": "Energy & Utilities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy and Utilities. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1014 ET - Equinor cuts capital expenditure as expected, but shareholder distributions are disappointing, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. Updated guidance reflects consensus expectations in terms of the capex cut, due to lower renewables spending. However, 2025 distributions are lower than expected and the outlook for 2026 distributions remains unclear, they say. The 2025 dividend and buyback of $9 billion is below consensus at $10 billion, while Equinor has scrapped its 2026 buyback guidance. Quarterly earnings beat consensus on net income but are relatively inline on the operating line and on cash flow from operations. Shares trade 3.5% lower at 268.20 Norwegian kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0854 ET - Equinor is moderating its energy transition plans, which should in theory mean more robust cash flows over time, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. The Norwegian energy major's capital allocation plans assume a slowdown in organic offshore wind plans and a slowdown in onshore renewables, they say. Some of its low carbon solutions projects also appear to be slowing, they say. The results look like a slight beat to consensus at the net income level, but guidance for a $5 billion buyback in 2025 is slightly below the $6 billion expected. Total shareholder distributions of $9 billion marks a step down versus 2024 levels of $14.6 billion. \"We think there were some lofty expectations into the event around potential distributions.\" Shares trade 3.2% lower at 268.85 Norwegian kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0847 ET - Oil futures are losing ground after an industry report of a large build in U.S. crude stocks, while the prospect of a trade war fuels concerns about demand. \"All of this tariff talk and general confusion that it's generating is bearish demand as companies can't expand if they don't know what their costs are or what they can sell their goods for,\" Scott Shelton of TP ICAP says in a note. The API reported a 5 million barrel increase in U.S. stocks for last week, analysts note. EIA data inventory are due later this morning, with a Wall Street Journal survey predicting a 1.3 million barrel build. WTI is off 1% at $71.97 a barrel and Brent is down 1.1% at $75.38 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0435 ET - TotalEnergies' fourth-quarter results were better than expected and should lift investor sentiment after a weak third quarter, Quilter Cheviot energy and materials analyst Maurizio Carulli writes. Its earnings were boosted by the stabilization of refining margins, which were particularly low in the prior quarter, he adds. The French oil-and-gas company has navigated a challenging 2024 environment well and its attractive long-term growth profile means it is well-positioned for the future, Carulli adds. TotalEnergies shares rise 1% to 57.56 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0419 ET - TotalEnergies' integrated LNG division meant its fourth-quarter adjusted earnings beat consensus expectations, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. The French oil-and-gas company's other divisions were all broadly in line with expectations, they add. Given TotalEnergies hosted its capital markets day in October, is isn't surprising that it didn't outline any major changes to guidance, the analysts write. TotalEnergies shares rise 1% to 57.56 euros. (adam.whittaker@wsj.com)</p><p class=\"\">2350 ET - Perusahaan Gas Negara's earnings performance is likely to be solid and steady, Maybank Sekuritas Indonesia analysts say in a research report. The brokerage likes the Indonesian natural-gas distributor for its strong free cash flow generation, which offers flexibility for reinvestment, debt repayment and high dividends. The company serves industries such as power, food and chemicals, and is expanding to include households, the analysts note. The brokerage anticipates the company to deliver stable revenue of $2.9 billion per year for 2025-2026. It initiates coverage of the stock with a buy rating and a target price of IDR2,000.00. Shares are 1.6% higher at IDR1,610.00. (ronnie.harui@wsj.com)</p><p class=\"\">1517 ET - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008689:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008696:0",
            "title": "Correction to Hess Earnings Headline on Jan. 29",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hess Corp. reported fourth-quarter adjusted earnings per share of $1.76. The headline \"*Hess Corp 4Q Adj EPS $1.63 &gt;HES,\" at 7:30 a.m. ET on Jan. 29, misstated the amount.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008696:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008687:0",
            "title": "Basic Materials Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Basic Materials. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1112 ET - Home Depot and Lowe's might report a better 4Q than Wall Street expects given recent results from the home-improvement chains' suppliers, Stanley Black &amp; Decker, Sherwin-Williams and Scotts Miracle-Gro, Davidson analyst Michael Baker says in a research note. Stanley Black &amp; Decker reports 2% organic growth in tools and outdoor products, an improvement from the 4% decline last quarter and the best increase since 2Q of 2021, the analyst says. Sherwin-Williams' consumer brands business, which is Lowe's main paint supplier, was flat in North America instead of down in the high-single digit percentage range like the three prior quarters, he says. And Scotts Miracle-Gro showed an acceleration of its gains from the prior quarter, the analyst says. (dean.seal@wsj.com)</p><p class=\"\">1028 ET - U.S. growth came in surprisingly strong in 2024 versus start-of-year projections, and most economists expect the momentum to carry into 2025. But while the consumer economy and the services sector are thriving, industrial companies are complaining of a grimmer backdrop. \"Recent economic activity is primarily being led by the strength in service-related sectors,\" while the physical economy has been weaker, Dow CFO Jeff Tate tells analysts on a recent earnings call. Dow executives several times on the call referred to a \"prolonged economic downturn.\" Eastman Chemical CEO Mark Costa gave a similar take on the company's recent analyst call. \"The macro economy is certainly challenging right now as we all know,\" he said. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0942 ET - U.S. farmers may see a significant price hike for fertilizer if Trump tariffs are implemented, as the materials used for fertilizer are often imported into the U.S, says Farmdoc Daily in a note. Potassium-based fertilizers may take the brunt, as 90% of U.S. consumption of potassium comes from imports. Canada is the leading producer of potash globally, and a tariff could add over $100 per ton for U.S. farmers to the current price tag around $450 a ton, says Farmdoc. Nitrogen fertilizers would also be impacted, although imports account for far less consumption, according to data from the U.S. Geological Survey. Nitrogen fertilizers are the most important for U.S. corn, while U.S. soybeans are often grown using potassium-based products. (kirk.maltais@wsj.com)</p><p class=\"\">0200 ET - Comex gold futures are approaching $2,900/oz on strong bullish momentum, based on daily charts, RHB Retail Research's Joseph Chai says in a research report. Futures saw fresh positive price movements on Tuesday, while they remain on track to test resistance at $2,900/oz, the analyst says. If the commodity rises beyond that mark, it will likely extend gains toward the $3,000/oz level, the analyst says. The 20-day simple moving average is also trending upward, offering extra support for the bullish technical setup, the analyst adds.Spot gold is 0.7% higher at $2,861.48/oz. (ronnie.harui@wsj.com)</p><p class=\"\">1831 ET - Crop chemicals producer Nufarm's earnings likely aren't immune from tit-for-tat trade measures taken by the U.S. and China, contends Macquarie. The U.S. has imposed an additional 10% tariff on Chinese imports, prompting Beijing to respond. Macquarie highlights that 28% of Nufarm's earnings are from North America, and the company relies heavily on sourcing agricultural chemicals from China to sell into markets including the U.S. Nufarm's costs are likely to rise as the trade war unfolds. Still, Nufarm has some production in the U.S. and recently upgraded its manufacturing capacity in Australia so has \"some ability to self-source,\" says Macquarie. It retains a neutral call on Nufarm. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1828 ET - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1424 ET - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008687:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008691:0",
            "title": "Auto & Transport Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Auto and Transport sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1520 GMT - Harley-Davidson CEO Jochen Zeitz says the company's electric motorcycle spinoff \"needs to perform\" following another disappointing year. LiveWire sold 612 bikes in 2024, far below its expectation of up to 1,500 bikes, and lost $110 million. Its CEO, Karim Donnez, says the company is cutting costs and hopes to succeed in Europe with a new \"maxi-scooter.\" Harley owns nearly 90% of LiveWire, and some analysts say the spinoff's losses are dragging down Harley's financial results. Zeitz says while the slow adoption of EV vehicles has hurt LiveWire, \"we'll obviously have to look at some optionalities\" if results don't improve. (john.keilman@wsj.com)</p><p class=\"\">1155 GMT - Uber says it expects gross bookings in the current quarter of $42 billion-$43.5 billion, with the top end of that range coming in line with Wall Street's consensus view, according to FactSet. The 1Q outlook assumes a currency headwind to total growth of about 5.5 percentage points, the ride-hailing company says. Shares fall 5.3% premarket, despite 4Q results otherwise coming in ahead of Street views. (mark.long@wsj.com)</p><p class=\"\">0812 GMT - Great Wall Motor's February sales volume will likely stay flat on month, but may recover somewhat in March, Citi analysts write in a note, citing company management. The automaker's January exports dropped on month due to the New Year holiday outside China, and it expects overseas sales growth in February and March due to postholiday promotional events. Meanwhile, the carmaker's new Tank 500 model, released this year, has secured 2,000 new orders since Jan. 2, Citi notes. Great Wall Motor will be a beneficiary of growth in the EV sector and EVs' higher market share in China, the bank says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0740 GMT - Investors could be concerned about Nissan's future as its board is planning to reject Honda's merger terms, Morningstar analyst Vincent Sun says. Nissan would face pressure surviving amid stiff competition in the U.S. and China, especially as it has a larger risk exposure to U.S. tariffs on Mexico than Honda and Toyota, the analyst says. However, even if the merger goes through, that wouldn't solve the challenges the two companies face. Both carmakers lack compelling EV offerings, and the combined entity would need to build a new EV model pipeline, he says. The two could benefit from larger scale and cost synergy, but that would take time to realize, Sun says. In any case, Nissan would find it difficult to \"play a smaller role in the new entity rather than standing on an equal footing with Honda,\" he adds. (sherry.qin@wsj.com)</p><p class=\"\">0657 GMT - Grab's growth drivers are intact, and its adjusted Ebita will likely surge in 2025, driven by margin expansion, HSBC analysts write in a note. Grab is likely to strengthen its leadership position in ride-hailing and deliveries, as it invests into products to help expand its total addressable market with affordable products, they say. However, as the priority will be on new product initiatives, cross-selling and lending products, HSBC trims earlier margin estimates and reduces its adjusted Ebitda projection by 2%-5% for 2025-2026. HSBC lowers its target price to $5.45 from $5.50 but upgrades its stock rating to buy from hold as the stock offers 20% upside, and valuations have become attractive after the recent price correction. (kimberley.kao@wsj.com)</p><p class=\"\">1733 GMT - Autonomous-vehicle company Cruise confirms it will lay off about half of its workforce. \"We are grateful for their passion and contributions to help us reach this stage, and our focus is on supporting them into their next chapter with severance packages and career support,\" a company spokesperson says in an emailed statement. \"While not an easy decision, we are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles.\" The layoffs come as GM announces the completion of its acquisition of Cruise, stating the company moving forward will work collaboratively on autonomous-vehicle technology and advanced driver assistance systems for personal vehicles. GM shares rise 1.4%. (connor.hart@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008691:0/",
            "pub_date": "2025-02-06 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310338:0",
            "title": "TSX up 200 Points at Midday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Toronto Stock Exchange is up 200 points with most sectors higher. </p><p class=\"\">The biggest gainers are healthcare (+2.6%) and technology (+1.7%). Miners, down 0.3%, is the sole decliner. </p><p class=\"\">Oil prices weakened for a second session early on Wednesday after a report showed an unexpectedly large rise in U.S. inventories last week and concerns grow that Donald Trump's tariff plans will slow global growth. Natural gas prices weakened, falling for a second day on mild near-term forecasts, even as long-term forecasts see colder weather on the way. </p><p class=\"\">But gold rose for a third-straight session, pushing to a fresh record high, as Donald Trump's tariff threats boost safe-haven buying and the dollar weakened. </p><p class=\"\">Of interest, given the prospect of a trade war with the U.S., Canada released its trade figures for December. </p><p class=\"\">Canada's international trade balance moved into a surplus in December, at $0.71 billion. CIBC noted that was a smaller surplus than was expected by the consensus ($1 billion), and reflected a 5% increase in exports against a 2% rise in imports. CIBC noted exports to the US rose by 5%, and may have reflected some front-running of potential tariffs, but higher oil prices also would have boosted that figure. It noted the continued depreciation of the Canadian dollar during the month also contributed to higher trade activity in C$ terms. For the fourth quarter overall, real export volumes rose by 2.7% q/q and import volumes increased by 2.0%. </p><p class=\"\">TD Economics on the key implications said trade finished the quarter on a \"strong note\", with goods likely providing an improved trajectory for Q4 GDP growth. According to it, trade-related uncertainty has likely led companies to stockpile inventories, temporarily boosting trade. It noted Statistics Canada's ongoing transition in trade-related data means these figures should be interpreted with caution. </p><p class=\"\">It added: \"While the immediate threat of tariffs on Canadian exports has been delayed until next month, the outlook remains uncertain as tariffs are still on the table. Any future tariffs will have negative consequences for economic growth, though the ultimate effect will depend on depth, breadth, duration and retaliation.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310338:0-tsx-up-200-points-at-midday/",
            "pub_date": "2025-02-06 01:20:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:80031e845d98e:0",
            "title": "Broadridge Financial Solutions Officer Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Matlin Laura</td></tr><tr><td>Relationship</td><td>CVP, Deputy GC and CCO</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$124,180</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1658944/000122520825001235/xslF345X05/doc4.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Laura Matlin, CVP, Deputy GC and CCO of Broadridge Financial Solutions, sold 514 shares of Common Stock on February 4, 2025, at a price of $241.5968 per share, totaling $124,180. Following the transaction, Matlin directly owns 6,601 shares of the company.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1658944/000122520825001235/xslF345X05/doc4.xml\" rel=\"nofollow\" target=\"_blank\">BROADRIDGE FINANCIAL SOLUTIONS, INC. [ BR ] - Form 4 - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:80031e845d98e:0-broadridge-financial-solutions-officer-sells-shares/",
            "pub_date": "2025-02-06 01:20:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0WP:0",
            "title": "Law firm Latham continues partner hiring streak in New York",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Law firm Latham &amp; Watkins added a former senior official at the U.S. Securities and Exchange Commission to its partnership on Wednesday, extending a string of partner hires this week by the Los Angeles-founded global firm.</p><p class=\"\">Marc Berger, who served as a deputy and acting director in the SEC's enforcement division during President Donald Trump's first term, will be a New York-based partner and co-chair of Latham's white-collar defense and investigations practice, the firm said. </p><p class=\"\">Berger was most recently a partner at Simpson Thacher &amp; Bartlett since 2021, where he was global co-head of the government and internal investigations practice. </p><p class=\"\">He represents companies, financial institutions, corporate executives and boards in litigation, investigations, regulatory and enforcement work, according to Latham. </p><p class=\"\">Latham also hired New York-based Jerome McCluskey, a former Milbank partner who most recently was managing director, general counsel and chief compliance officer at private equity firm Charlesbank Capital Partners. The firm said he will also practice in Boston.</p><p class=\"\">McCluskey will join the firm's banking and private equity finance practices, advising private capital firms and their portfolio companies on leveraged finance and private credit deals, the firm said.</p><p class=\"\">        Charlesbank did not immediately respond to a request for comment.</p><p class=\"\">Latham's New York office has more than 830 lawyers and is its largest office by lawyer headcount, according to a firm spokesperson. The global firm is among the highest grossing U.S. law firms and has more than 3,500 lawyers in total.</p><p class=\"\">On Monday, former Wachtell, Lipton, Rosen &amp; Katz partner John Sobolewski joined Latham as global chair of liability management, based in New York.</p><p class=\"\">Outside of New York, the firm on Monday said it hired Paul Rosen, who most recently oversaw the Committee on Foreign Investment in the United States as assistant secretary of the U.S. Department of Treasury for investment security. Rosen will join the firm in March as a partner in Washington, D.C. and Los Angeles.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0WP:0-law-firm-latham-continues-partner-hiring-streak-in-new-york/",
            "pub_date": "2025-02-06 01:14:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446802:0",
            "title": "Uruguay Inflation Rate Eases in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The annual inflation rate in Uruguay marginally eased to 5.05% in January 2025, down from the highest rate since August of 5.49% in the previous month.</p><p class=\"\">Price increases slowed for housing and utilities (1.92% vs. 5.68% in December), and food and non-alcoholic beverages slowed (4.27% vs. 5.29%). .</p><p class=\"\">Meanwhile, the growth in costs accelerated for transportation (7.73% vs. 5.63%), restaurant and food services (7.67% vs. 7.34%),while the decline in clothing and footwear prices eased (-2.66% vs. -3.48%).</p><p class=\"\">Month-over-month, consumer prices rose by 1.1%, accelerating from the 0.34% increase seen in the previous month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446802:0-uruguay-inflation-rate-eases-in-january/",
            "pub_date": "2025-02-06 01:14:16",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310306:0",
            "title": "January Private Job Growth Tops Views as Wage Growth Stabilizes, ADP Data Show",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Employment growth in the US private sector topped expectations for January, while pay gains stabilized, Automatic Data Processing  reported Wednesday. </p><p class=\"\">Private employment advanced by 183,000 jobs last month, ADP's data showed. That was higher than the 150,000 level expected in a survey compiled by Bloomberg. December's job gains were revised upward to 176,000 from 122,000. </p><p class=\"\">Annual wage growth for job stayers came in at 4.7% in January, while pay gains for job changers was 6.8%, according to the report. </p><p class=\"\">\"We had a strong start to 2025 but it masked a dichotomy in the labor market,\" ADP Chief Economist Nela Richardson said. \"Consumer-facing industries drove hiring, while job growth was weaker in business services and production.\"</p><p class=\"\">Service-related industries added 190,000 jobs last month, led by a 56,000 jump in the trade, transportation and utilities sector, followed by leisure and hospitality with a 54,000 rise. The goods-producing sector lost 6,000 jobs, driven by a decline of 13,000 manufacturing positions. </p><p class=\"\">Large businesses added 69,000 jobs in January, while small and medium establishments logged gains of 39,000 and 92,000, respectively. </p><p class=\"\">The Bureau of Labor Statistics is expected to report on Friday that the US added 170,000 nonfarm jobs for January, which would mark a drop from the 256,000 gain posted for the month prior, according to a Bloomberg-compiled survey. </p><p class=\"\">On Tuesday, government data showed that job openings in the world's largest economy fell more than the market projected in December as quits edged higher.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310306:0/",
            "pub_date": "2025-02-06 01:14:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310310:0",
            "title": "Masco Possesses Ability to Mitigate Tariff Risks, Accelerate Earnings Growth, Oppenheimer Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Masco  could offset the impact of potential tariffs through price increases, helping it accelerate earnings growth through 2026 and drive expansion of valuation multiples, Oppenheimer said Wednesday. </p><p class=\"\">A possible pickup in repair and remodel activity in H2 this year is also seen boosting earnings, the firm said. </p><p class=\"\">\"We expect 2025 will be an inflection year with industry sales likely to grow in H2,\" it said. </p><p class=\"\">Oppenheimer is projecting 2025 earnings per share of $4.43 for the home improvement products manufacturer with sales growing by 1%, which are above consensus estimates and assume that Q3 revenue will increase after 12 straight quarters of flat to downward sales. It sees EPS growth exceeding 10% in 2026. </p><p class=\"\">The firm has an outperform rating on the stock and $89 price target.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310310:0/",
            "pub_date": "2025-02-06 01:14:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310313:0",
            "title": "Google Offers 'Cost-Efficient' Gemini AI Model",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alphabet's  Google released a new artificial intelligence model that the company called its \"most cost-efficient model yet.\"</p><p class=\"\">Gemini 2.0 Flash-Lite is in public preview in Google AI Studio and Vertex AI, according to a blog post Wednesday from the tech giant. </p><p class=\"\">The company said 2.0 Flash-Lite's quality is better than 1.5 Flash and has the same speed and cost. </p><p class=\"\">Google also said it is making an updated Gemini 2.0 Flash generally available and releasing an experimental version of Gemini 2.0 Pro, which it described as its \"best model yet for coding performance and complex prompts.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310313:0/",
            "pub_date": "2025-02-06 01:14:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008640:0",
            "title": "elf Beauty Is Maintained at Overweight by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(17:15 GMT) </strong>elf Beauty Price Target Cut to $131.00/Share From $167.00 by Piper Sandler</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008640:0/",
            "pub_date": "2025-02-06 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008635:0",
            "title": "Global Commodities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Commodities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1131 ET - Inflated cocoa costs melted into Mondelez International's earnings in 4Q, and they are likely too large to be fully offset by raising prices, Edward Jones analyst Brittany Quatrochi says. The snack maker's 2025 outlook was more disappointing than expected, with adjusted earnings per share set to fall 10%. Underlying sales growth remains solid across regions, despite cocoa prices pulling down operating income across the globe by 28%. Mondelez said in an earnings call it plans to raise prices, but low-cost distribution will be especially crucial for emerging international markets as the company generates about 70% of its sales outside of North America, Quatrochi says. Shares rise 1.7%. (katherine.hamilton@wsj.com)</p><p class=\"\">1127 ET - Livestock futures on the CME are higher, with live cattle up 1.5% and lean hogs up 1.4%. Both are getting support from strength in cutout prices, both for boxed beef and for pork cutouts. For cattle, traders are grasping a tight supply/demand dynamic for cows and lean beef extending into 2025, while for hogs traders are noticing 'better' fundamentals, StoneX says in a note. \"Spot fundamentals continue to feel a bit better dating back a couple weeks,\" the firm says. \"Production rates noted Monday still fall a touch short of expected and we're into a timeslot now where the cutout and cash hog markets normally trend firmer anyway.\" (kirk.maltais@wsj.com)</p><p class=\"\">1124 ET - Mondelez International expects adjusted earnings per share to fall 10% in 2025 due to elevated cocoa costs, after the snack maker said operating income declined 28% in the fourth quarter primarily due to that inflation. If chocolate costs remain high, Mondelez plans to gradually increase prices in the second half of this year, especially in developed markets, but the company said consumer confidence is still rocky, which could pose challenges to its pricing plan. Chief financial officer Luca Zaramella said he expects earnings per share to grow again in 2026, either from price increases or cocoa costs normalizing. (katherine.hamilton@wsj.com)</p><p class=\"\">1047 ET - Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p><p class=\"\">1034 ET - As the U.S. and Mexico grapple over tariff threats, Mexico is continuing to purchase U.S. corn exports — with the USDA confirming sales of 330,000 metric tons of corn for delivery to Mexico during the 2025/26 marketing year. Corn and soybean futures on the CBOT are lower in early trading, with the last-minute nature of agreements to delay implementing tariffs keeping investors in markets on edge. \"[His] eleventh-hour decision to delay the 25% tariffs he had threatened to impose on Canada and Mexico is a good reminder of his unpredictable nature,\" says Paul Ashworth of Capital Economics in a note, adding that the firm expects the Trump administration to move forward on a 10% universal tariff, as well as higher tariffs on Chinese goods. (kirk.maltais@wsj.com)</p><p class=\"\">0942 ET - U.S. farmers may see a significant price hike for fertilizer if Trump tariffs are implemented, as the materials used for fertilizer are often imported into the U.S, says Farmdoc Daily in a note. Potassium-based fertilizers may take the brunt, as 90% of U.S. consumption of potassium comes from imports. Canada is the leading producer of potash globally, and a tariff could add over $100 per ton for U.S. farmers to the current price tag around $450 a ton, says Farmdoc. Nitrogen fertilizers would also be impacted, although imports account for far less consumption, according to data from the U.S. Geological Survey. Nitrogen fertilizers are the most important for U.S. corn, while U.S. soybeans are often grown using potassium-based products. (kirk.maltais@wsj.com)</p><p class=\"\">0925 ET - Shifting weather forecasts continue to buffet U.S. natural gas futures, which are adding modestly to yesterday's losses. \"Winter is not yet over,\" EBW Analytics says in a note. \"The near term may see mild weather and bearish risks for Thursday's EIA report-but a subsequent bounce is probable.\" Colder temperatures ahead coupled with a storage deficit are bullish, while medium-term, higher production should be a counterweight, the firm adds. Nymex natural gas is off 0.7% at $3.229/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">0921 ET - U.S. ag traders are taking the lack of retaliatory tariffs from China on U.S. grain exports as a sign that a window for negotiations is open--but the lack of urgency coming from President Trump about negotiating with Chinese President Xi has grain traders nervous. \"Uncertain trade policy between the world's largest soybean importer and the world's second largest soybean exporter are in full display,\" says AgResource in a note. CBOT soybean futures are down 0.6% premarket. (kirk.maltais@wsj.com)</p><p class=\"\">0857 ET - Gold futures rise, keeping close to a fresh record set earlier in the session. Futures rise 0.2% to $2,880.80 a troy ounce, having hit $2,901.50 earlier in the day. Investors are increasingly seeking safe-haven in hard assets like gold, silver, copper and platinum, historically viewed as stores of value in times of financial uncertainty, Saxo Bank's Ole Hansen says in a note. The risk of sovereign debt crises, currency devaluations and systemic financial instability could further reinforce this trend, increasing the attractiveness of metals as a hedge against economic turbulence, Hansen writes. A shift away from U.S. dollar dominance is also underway as nations seek to reduce their greenback reliance for trade and reserve holdings, Hansen says. This is further supporting demand for gold and other stable commodities, as countries seek alternative to fiat currencies, he adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0847 ET - Oil futures are losing ground after an industry report of a large build in U.S. crude stocks, while the prospect of a trade war fuels concerns about demand. \"All of this tariff talk and general confusion that it's generating is bearish demand as companies can't expand if they don't know what their costs are or what they can sell their goods for,\" Scott Shelton of TP ICAP says in a note. The API reported a 5 million barrel increase in U.S. stocks for last week, analysts note. EIA data inventory are due later this morning, with a Wall Street Journal survey predicting a 1.3 million barrel build. WTI is off 1% at $71.97 a barrel and Brent is down 1.1% at $75.38 a barrel. (anthony.harrup@wsj.com)Chinese retaliatory tariffs won't be implemented until Feb. 10. \"Base Metal Prices Mixed as Trade Tensions Continue to Unnerve Market — Market Talk,\" at 0951 GMT, incorrectly said U.S. tariffs won't be implemented until Feb. 10.</p><p class=\"\">0606 ET - Gold futures rise, holding ground after setting a fresh record earlier in the session. Futures are up 0.6% at $2,892.70 a troy ounce, having reached $2,901.50 an ounce earlier in the day. The precious metal is gaining on a weaker U.S. dollar and growing concerns of an escalating U.S.-China trade war, and the likely hit to global economic growth prospects, ActivTrades' Ricardo Evangelista says in a note. The weaker dollar follows President Trump's last minute U-turn on imposing additional tariffs on Mexico and Canada, and disappointing U.S. labor and industrial data, Evangelista writes. At the same time, U.S. tariffs on China--and Beijing's response--are ominous for the global economy, increasing gold's safe-haven appeal. Demand is reinforced by further Middle East uncertainty, after Trump's comments about taking over Gaza and displacing the Palestinian population, Evangelista adds. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008635:0/",
            "pub_date": "2025-02-06 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXbM3rC7:0",
            "title": "Endeavour Announces Holding(s) in Company",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Endeavour Mining plc (“the Company”) announces that it received the following notification, today 5 February 2025, from Blackrock, Inc. of its interests in the Company as at 4 February 2025</p><p class=\"\">TR-1: Standard form for notification of major holdings</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">1. Issuer Details </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ISIN </strong></p><p class=\"\">GB00BL6K5J42</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Issuer Name </strong></p><p class=\"\">ENDEAVOUR MINING PLC</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UK or Non-UK Issuer </strong></p><p class=\"\">UK</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2. Reason for Notification </strong></p><p class=\"\">An acquisition or disposal of voting rights</p><p class=\"\">3. Details of person subject to the notification obligation </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Name </strong></p><p class=\"\">BlackRock, Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">City of registered office (if applicable) </strong></p><p class=\"\">Wilmington</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Country of registered office (if applicable) </strong></p><p class=\"\">USA</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">4. Details of the shareholder </strong></p><p class=\"\">Full name of shareholder(s) if different from the person(s) subject to the notification obligation, above </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">City of registered office (if applicable) </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Country of registered office (if applicable) </strong></p><p class=\"\">5. Date on which the threshold was crossed or reached </p><p class=\"\">04-Feb-2025</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">6. Date on which Issuer notified </strong></p><p class=\"\">05-Feb-2025</p><p class=\"\">7. Total positions of person(s) subject to the notification obligation </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>. </td><td>% of voting rights attached to shares (total of 8.A) </td><td>% of voting rights through financial instruments (total of 8.B 1 + 8.B 2) </td><td>Total of both in % (8.A + 8.B) </td><td>Total number of voting rights held in issuer </td></tr><tr><td>Resulting situation on the date on which threshold was crossed or reached </td><td>12.970000 </td><td>0.520000 </td><td>13.490000 </td><td>32906778 </td></tr><tr><td>Position of previous notification (if applicable) </td><td>13.030000 </td><td>0.440000 </td><td>13.470000 </td><td> </td></tr></tbody></table></div><p class=\"\">8. Notified details of the resulting situation on the date on which the threshold was crossed or reached </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">8A. Voting rights attached to shares </strong></p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Class/Type of shares ISIN code(if possible) </td><td>Number of direct voting rights (DTR5.1) </td><td>Number of indirect voting rights (DTR5.2.1) </td><td>% of direct voting rights (DTR5.1) </td><td>% of indirect voting rights (DTR5.2.1) </td></tr><tr><td>GB00BL6K5J42 </td><td> </td><td>31598083 </td><td> </td><td>12.970000 </td></tr><tr><td>Sub Total 8.A </td><td colspan=\"2\">31598083 </td><td colspan=\"2\">12.970000% </td></tr></tbody></table></div><p class=\"\">8B1. Financial Instruments according to (DTR5.3.1R.(1) (a)) </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Type of financial instrument </td><td>Expiration date </td><td>Exercise/conversion period </td><td>Number of voting rights that may be acquired if the instrument is exercised/converted </td><td>% of voting rights </td></tr><tr><td>Securities Lending </td><td> </td><td> </td><td>1213636 </td><td>0.490000 </td></tr><tr><td>Sub Total 8.B1 </td><td colspan=\"2\"> </td><td>1213636 </td><td>0.490000% </td></tr></tbody></table></div><p class=\"\">8B2. Financial Instruments with similar economic effect according to (DTR5.3.1R.(1) (b)) </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Type of financial instrument </td><td>Expiration date </td><td>Exercise/conversion period </td><td>Physical or cash settlement </td><td>Number of voting rights </td><td>% of voting rights </td></tr><tr><td>CFD </td><td> </td><td> </td><td>Cash </td><td>95059 </td><td>0.030000 </td></tr><tr><td>Sub Total 8.B2 </td><td colspan=\"3\"> </td><td>95059 </td><td>0.030000% </td></tr></tbody></table></div><p class=\"\">9. Information in relation to the person subject to the notification obligation </p><p class=\"\">2. Full chain of controlled undertakings through which the voting rights and/or the financial instruments are effectively held starting with the ultimate controlling natural person or legal entities (please add additional rows as necessary)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Ultimate controlling person </td><td>Name of controlled undertaking </td><td>% of voting rights if it equals or is higher than the notifiable threshold </td><td>% of voting rights through financial instruments if it equals or is higher than the notifiable threshold </td><td>Total of both if it equals or is higher than the notifiable threshold </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock (Singapore) Holdco Pte. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock HK Holdco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Lux Finco S.a.r.l. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Japan Holdings GK </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Japan Co., Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 2) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 2) </td><td>Trident Merger, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 2) </td><td>BlackRock Investment Management, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Holdco 3, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Cayman 1 LP </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Cayman West Bay Finco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Cayman West Bay IV Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Group Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Finance Europe Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Investment Management (UK) Limited </td><td>8.240000 </td><td>0.280000 </td><td>8.520000% </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Australia Holdco Pty. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Investment Management (Australia) Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Holdco 3, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Cayman 1 LP </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Cayman West Bay Finco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Cayman West Bay IV Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Group Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock International Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Holdco 4, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Holdco 6, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Delaware Holdings Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Institutional Trust Company, National Association </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Holdco 4, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Holdco 6, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Delaware Holdings Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Fund Advisors </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 8) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 8) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 8) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock (Singapore) Holdco Pte. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock HK Holdco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Asset Management North Asia Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Canada Holdings ULC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Asset Management Canada Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Capital Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Advisors, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Holdco 3, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Cayman 1 LP </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Cayman West Bay Finco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Cayman West Bay IV Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Group Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Finance Europe Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Advisors (UK) Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock (Singapore) Holdco Pte. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock (Singapore) Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Trident Merger, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>BlackRock Investment Management, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Amethyst Intermediate, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Aperio Holdings, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Aperio Group, LLC </td><td> </td><td> </td><td> </td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">10. In case of proxy voting </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Name of the proxy holder </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The number and % of voting rights held </strong></p><p class=\"\">The date until which the voting rights will be held </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">11. Additional Information </strong></p><p class=\"\">BlackRock Regulatory Threshold Reporting Team </p><p class=\"\">Jana Blumenstein </p><p class=\"\">020 7743 3650</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">12. Date of Completion </strong></p><p class=\"\">05th February 2025</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">13. Place Of Completion </strong></p><p class=\"\">12 Throgmorton Avenue, London, EC2N 2DL, U.K.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Endeavour Mining PLC_2025-02-04_GH_(Issuer) New (002)      </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXbM3rC7:0-endeavour-announces-holding-s-in-company/",
            "pub_date": "2025-02-06 01:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008638:0",
            "title": "Brussels Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  BEL-20 Index                4,286.86      +9.68      +0.23 <br/>  Index Components <br/>  Groupe Bruxelles Lambert       66.25      -0.05      -0.08 <br/>  KBC Group                      73.00      -0.08      -0.11 <br/>  Solvay                         28.72      -0.74      -2.51 <br/>  Umicore                         9.70      -0.10      -1.02 <br/>  Ackermans &amp; Van Haaren        185.60      +0.20      +0.11 <br/>  Lotus Bakeries             10,180.00     +40.00      +0.39 <br/>  Cofinimmo                      55.25      +1.25      +2.31 <br/>  D'Ieteren                     164.70      +3.10      +1.92 <br/>  Sofina                        235.00      -0.40      -0.17 <br/>  UCB                           186.90      +2.40      +1.30 <br/>  Ageas                          49.40      +0.08      +0.16 <br/>  Warehouses de Pauw             20.46      +0.20      +0.99 <br/>  Anheuser-Busch InBev           46.96      -0.11      -0.23 <br/>  Melexis                        54.10      -7.65     -12.39 <br/>  Elia Group                     66.70      -1.05      -1.55 <br/>  Aedifica                       59.40      +1.10      +1.89 <br/>  argenx                        641.20      +9.80      +1.55 <br/>  Azelis Group                   19.74       unch       unch <br/>  Syensqo                        76.35      -0.51      -0.66 <br/>  Galapagos                      21.86      -0.16      -0.73 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008638:0/",
            "pub_date": "2025-02-06 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008639:0",
            "title": "Amsterdam Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  ING Groep                       9,915,578       15.966       -0.084        -0.52 <br/>  Royal KPN                       9,402,002        3.524       +0.052        +1.50 <br/>  Shell                           5,248,859       31.975       -0.095        -0.30 <br/>  Prosus                          3,163,630       37.700       -0.240        -0.63 <br/>  Pharming Group                  2,761,614        0.840       +0.013        +1.57 <br/>  ABN AMRO Bank                   2,697,531       15.820       -0.100        -0.63 <br/>  ArcelorMittal                   2,530,007       24.360       +0.140        +0.58 <br/>  Havas                           2,348,723        1.577       +0.047        +3.07 <br/>  Ahold Delhaize                  2,298,698       34.970       +0.060        +0.17 <br/>  Aegon                           1,866,025        6.226       -0.038        -0.61 <br/>  Koninklijke Philips             1,318,918       26.260       +0.320        +1.23 <br/>  Unilever                        1,068,268       55.660       +0.240        +0.43 <br/>  TomTom                          1,046,605        4.030       -0.270        -6.28 <br/>  Universal Music Group           1,004,519       26.990       -0.110        -0.41 <br/>  Just Eat Takeaway.com             972,881       11.735       +0.020        +0.17 <br/>  Heineken                          968,337       65.080       -0.400        -0.61 <br/>  NN Group                          929,443       43.000       -0.110        -0.26 <br/>  Koninklijke BAM Groep             856,527        3.994       -0.054        -1.33 <br/>  Akzo Nobel                        673,729       55.560       +0.860        +1.57 <br/>  ASML Holding                      589,980      706.100       -6.300        -0.88 <br/>  RELX                              558,933       48.440       +0.300        +0.62 <br/>  Fugro                             532,948       14.810       -0.350        -2.31 <br/>  Signify                           507,055       20.800       +0.320        +1.56 <br/>  Allfunds Group                    466,881        4.978       -0.082        -1.62 <br/>  Ebusco Holding                    461,870        0.812       +0.020        +2.48 <br/>  Randstad                          427,926       41.730       -0.070        -0.17 <br/>  BE Semicon Industries             423,727      119.800       -0.700        -0.58 <br/>  InPost                            396,704       15.440       -0.350        -2.22 <br/>  CVC Capital Partners              395,926       23.300       +0.380        +1.66 <br/>  PostNL                            365,059        0.988       +0.001        +0.05 <br/>  OCI N.V.                          360,086       10.910       +0.010        +0.09 <br/>  DSM-Firmenich                     323,531       96.280       -0.120        -0.12 <br/>  Alfen                             298,698       14.045       -0.295        -2.06 <br/>  SBM Offshore                      281,359       18.610       +0.230        +1.25 <br/>  Avantium                          278,573        1.742       +0.034        +1.99 <br/>  Heineken Holding                  277,527       56.750       +0.100        +0.18 <br/>  Wolters Kluwer                    277,359      176.700       +1.900        +1.09 <br/>  JDE Peet's                        229,351       16.160       -0.220        -1.34 <br/>  ASR Nederland                     168,173       47.120       -0.090        -0.19 <br/>  AMG Critical Materials            162,429       13.580       -0.330        -2.37 <br/>  MKB NedSense                      147,925        0.062       +0.003        +4.20 <br/>  Koninklijke Vopak                 109,610       44.880       +0.760        +1.72 <br/>  TKH Group                         109,102       35.380       +0.320        +0.91 <br/>  Aalberts                          105,398       33.580       -0.200        -0.59 <br/>  EXOR                              101,918       91.650       -0.450        -0.49 <br/>  Flow Traders                       97,791       24.560       +0.080        +0.33 <br/>  ARCADIS                            95,979       53.200       -0.350        -0.65 <br/>  ASM International                  94,994      549.800       +0.400        +0.07 <br/>  Aperam                             90,504       26.540       +0.060        +0.23 <br/>  Basic-Fit                          75,572       24.000       +0.120        +0.50 <br/>Prices in Euros <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008639:0/",
            "pub_date": "2025-02-06 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008637:0",
            "title": "Amsterdam Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  Amsterdam AEX Index           919.45      -0.02       0.00 <br/>  Index Components <br/>  ABN AMRO Bank                  15.82      -0.10      -0.63 <br/>  Adyen                       1,601.00      +1.40      +0.09 <br/>  Aegon                           6.23      -0.04      -0.61 <br/>  Ahold Delhaize                 34.97      +0.06      +0.17 <br/>  Akzo Nobel                     55.56      +0.86      +1.57 <br/>  ArcelorMittal                  24.36      +0.14      +0.58 <br/>  ASM International             549.80      +0.40      +0.07 <br/>  ASML Holding                  706.10      -6.30      -0.88 <br/>  ASR Nederland                  47.12      -0.09      -0.19 <br/>  BE Semicon Industries         119.80      -0.70      -0.58 <br/>  DSM-Firmenich                  96.28      -0.12      -0.12 <br/>  EXOR                           91.65      -0.45      -0.49 <br/>  Heineken                       65.08      -0.40      -0.61 <br/>  IMCD                          149.35      -0.30      -0.20 <br/>  ING Groep                      15.97      -0.08      -0.52 <br/>  Koninklijke Philips            26.26      +0.32      +1.23 <br/>  NN Group                       43.00      -0.11      -0.26 <br/>  Prosus                         37.70      -0.24      -0.63 <br/>  Randstad                       41.73      -0.07      -0.17 <br/>  RELX                           48.44      +0.30      +0.62 <br/>  Royal KPN                       3.52      +0.05      +1.50 <br/>  Shell                          31.98      -0.09      -0.30 <br/>  Unilever                       55.66      +0.24      +0.43 <br/>  Universal Music Group          26.99      -0.11      -0.41 <br/>  Wolters Kluwer                176.70      +1.90      +1.09 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008637:0/",
            "pub_date": "2025-02-06 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446803:0",
            "title": "UK Stocks Close Firmly Higher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The FTSE 100 closed 0.6% higher at 8,623 on Wednesday, outperforming its major European counterparts amid a batch of strong corporate results.</p><p class=\"\">GSK soared 7.6% after delivering strong results, upgrading its sales forecast, and announcing a GBP 2 billion share buyback.</p><p class=\"\">Also among pharmaceutical giants, AstraZeneca added 0.9% ahead of its earnings call tomorrow, supported by strong results by its British rival.</p><p class=\"\">Also, precious metal miners Fresnillo and Endeavour surged 5.8% and 2.8%, respectively, as a strong Gilt auction made domestic yields lower and softer ISM PMI data pressured US borrowing costs.</p><p class=\"\">Additionally, financial stocks moved higher following a weak open, with 3i and Beazley adding more than 2%.</p><p class=\"\">On the other hand, Diageo sank 4% after giving up its guidance due to the impact that tariffs may have on its business.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446803:0-uk-stocks-close-firmly-higher/",
            "pub_date": "2025-02-06 01:15:18",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310327:0",
            "title": "Algorhythm to Implement 1-for-200 Reverse Stock Split",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Algorhythm Holdings  said Wednesday it would implement a 1-for-200 reverse stock split, effective Feb. 10. </p><p class=\"\">The reverse split will help the company meet Nasdaq's $1 minimum bid price listing requirement, the company said. </p><p class=\"\">Shares of the company fell nearly 14% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310327:0/",
            "pub_date": "2025-02-06 01:15:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464079:0",
            "title": "Woodbois Explores Funding Options to Restart Full Production",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Woodbois  is in talks with its advisers for potential funding options to secure working capital for the next few weeks. </p><p class=\"\">The forestry company said Wednesday it expects the business to be cash-generating and able to pay creditors once it resumes full production after disruptions and management changes in 2024. </p><p class=\"\">Woodbois added that it started shipping containers of existing stock from the Libreville port in Gabon and is moving supplies from its Mouila warehouse to the port.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464079:0/",
            "pub_date": "2025-02-06 01:07:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1V9:0",
            "title": "CRH to exit stake in SigmaRoc, says bookrunner",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dublin-based building materials supplier CRH's  UK unit intends to sell about 171.6 million ordinary shares in SigmaRoc , exiting its entire stake in the British quarrying company, a bookrunner said on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1V9:0-crh-to-exit-stake-in-sigmaroc-says-bookrunner/",
            "pub_date": "2025-02-06 01:08:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310326:0",
            "title": "CIBC on Economist Forecast, Markets After Canada's Merchandise Trade Data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canadian exports ended the year on a high note, with the trade balance moving into a surplus position, but the increase in demand appeared to reflect some tariff front-running and more turbulent conditions lie ahead for exporters, said CIBC. </p><p class=\"\">Canada's international trade balance moved into a surplus of C$710 million in December, which was a little lower than the C$1.0 billion surplus expected by the consensus, noted the bank. </p><p class=\"\">While tariffs on Canada are now on hold for 30 days, the uncertainty will likely continue to result in United States importers front-running potential tariffs in the near term, stated CIBC. </p><p class=\"\">The uncertainty is clearly a negative for business investment in Canada and supports CIBC's call for further Bank of Canada cuts as the weakness is occurring at a time when the economy is still operating with slack. </p><p class=\"\">There was no material market reaction to the Wednesday data, added the bank.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310326:0/",
            "pub_date": "2025-02-06 01:09:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0KP:0",
            "title": "SUBBED - What’s happened to Lloyd’s policy of succession management?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Like all venerable institutions weighed by history, Lloyd’s has taken great care over succession planning. In its case, the Corporation has for many years adroitly staggered the arrivals and exits of its most senior leaders to avoid disruption and maintain an inviolable continuity of purpose.</p><p class=\"\">Until now, that is.</p><p class=\"\">Last week’s news that Lloyd’s CFO Burkhard Keese will shortly return to Germany was the latest in a flurry of unexpected exits from the Corporation’s executive team. The question is what has caused this trend and is it a problem?</p><p class=\"\">Keese’s imminent departure (he will join German MGA Konzept &amp; Marketing on 1 May) follows the announcement last month that CEO John Neal will take up the vacant position as Aon’s global reinsurance head, and comes during a handover period for the next Lloyd’s chairman with Bruce Carnegie-Brown retiring in May after almost nine years at One Lime Street.</p><p class=\"\">Nor are these the only notable changes on the executive floor. In August 2024, Lloyd’s COO Bob James was parachuted into the London market joint venture Velonetic to directly oversee Neal’s delayed Blueprint Two modernisation project, with the vacancy since filled on an interim basis by Accenture’s AI specialist George Marcotte. </p><p class=\"\">The Corporation – the body tasked with managing the near-350-year-old market – has not experienced this level of executive turnover since at least the Lloyd's Act of 1982 and perhaps even since Edward Lloyd began percolating his coffee. It is even possible four of the five most senior Corporation leaders will have changed in under a year – assuming Neal is released early from his 12-month rolling contract to avoid any tensions emerging from his next destination (no details have been released on his leaving date – another sign, perhaps, that his departure was unexpected).</p><p class=\"\">The only constant is chief of markets Patrick Tiernan, who has returned to his post after a brief health-related absence last year. However, even that position may become vacant later this year if he is successful in his ambition to succeed Neal as CEO.</p><p class=\"\">It is certainly a far cry from the previous model of stable succession planning. Since 2000, for example, Lloyd’s has had only four chairmen (Sax Riley, Lord Levene, John Nelson and Carnegie-Brown), four CEOs (Nick Prettejohn, Richard Ward, Dame Inga Beale and Neal), four underwriting heads (Rolf Tolle, Tom Bolt, Jon Hancock and Tiernan) and five CFOs (Bob Hewes, Andrew Moss, Luke Savage, John Parry and Keese). As the timeline below demonstrates, their arrivals and departures were managed to ensure continuity of senior leadership. In any one year between 2000-2024, only one of the top four executives left. Only rarely – such as when Hancock left in 2020 for AIG – was there a significant hiatus before a replacement was announced.</p><p class=\"\">In one sense, we shouldn’t be too surprised. Under Neal’s stewardship, there appears to have been a marked increase in the turnover of Corporation senior staff. This is perhaps natural at the beginning of a CEO’s tenure – however, in Neal’s case it seemed more of a continual theme. 2023, for example, saw the sudden departure of two members of the Corporation’s managerial ranks: long-serving general counsel Peter Spires and marketing and communications head Jo Scott. Both were effectively replaced by junior Corporation colleagues (albeit Scott temporarily remained with a reduced role overseeing charitable donations) who were assumed to be closer to Neal. James – another trusted Neal lieutenant from his time at QBE – was elevated to the vacant COO role following the exit of Jennifer Rigby the previous year.</p><p class=\"\">Does all this turnover matter? </p><p class=\"\">On the face of it, the Lloyd’s market is in rude health. In March, the Corporation is expected to announce another set of strong underwriting results for the ~100 syndicates that trade on the platform. Keese’s successor has already been identified in the form of his number two, Alexandra Cliff. Lloyd’s remains an attractive place to access wholesale and specialty business and the queue of aspiring entrants is said to remain healthy. Of course, rate pressures are growing in many classes but there is no sign yet of a return to the soft market nadir of 2016-2018. The venerable ship – which celebrates its 350th anniversary next decade – is back on course after the traumatic underwriting losses of 2017-19.</p><p class=\"\">But the vicissitudes of the risk business means the waters rarely stay calm for long – as we were reminded in California only last month. Catastrophic loss events – as well as geopolitical and economic storms – occur too frequently to indulge a leadership vacuum for long at a marketplace as important as Lloyd’s.</p><p class=\"\">However, the uncertainty of when Neal will go – and who will replace him – is complicated by the impending exit of his chairman. This departure was at least planned. Carnegie-Brown’s final term of office expires in the summer and his successor, the former McKinsey senior partner and civil servant Sir Charles Roxburgh, was identified last year following a thorough process.</p><p class=\"\">However, the sudden announcement of Neal’s departure has created a dilemma. Will it be Carnegie-Brown or Roxburgh who ultimately decides Neal’s leaving date? The situation is complicated by Neal’s decision to join Aon, one of the market’s largest and most influential producers. The longer he stays, the more Lloyd’s will have to tread carefully in decisions that affect Aon’s competitors to avoid any accusations of favouritism. If he goes prematurely, Lloyd’s may need to find an interim replacement – which could also affect the process to select a permanent successor.</p><p class=\"\">Committed, long-term leadership is also required to address two of the more vexatious issues during Neal’s tenure: modernisation and culture. The former hinges on Blueprint Two, which has likely cost more than all the infamous Lloyd’s white elephants of the past – such as Kinnect and TOM – combined. Neal and Carnegie-Brown are leaving with no official costings to date published, but there are fears it exceeds £500mn all in along with continued concerns over its delivery. Should it be shelved? </p><p class=\"\">Surely not, but a clear pathway of deliverable success needs to be presented to the market following the tensions that emerged last year between the influential trade body, the Lloyd’s Market Association, and Neal. This can’t be delayed for much longer.</p><p class=\"\">On culture, Lloyd’s has recently closed a market consultation on toughening its investigation powers following the failures of the Atrium/Richard Tomlin affair. </p><p class=\"\">Neal positioned himself as a reforming culture crusader during his time at Lloyd’s. Politically, this was smart considering the damaging Bloomberg investigation alleging widespread sexual harassment shortly after he arrived. </p><p class=\"\">But the delivery didn’t always appear consistent. </p><p class=\"\">Atrium was hit with a record £1mn fine and an exposé of a “boys' night out” culture, while a few years later CFC Underwriting was allowed to discreetly change its senior management and avoid any embarrassing revelations of its own culture shortcomings. </p><p class=\"\">Closer to home, Lloyd’s quietly parted ways with a number of unnamed executives in its performance directorate in 2022 following suggestions of whistleblower complaints relating to conduct and behaviour. Shouldn’t this also have been subject to the cleansing light of transparency? And what of the Corporation’s apparent deteriorating performance in the most recent annual market culture survey?</p><p class=\"\">This is all on Neal’s watch rather than his yet-to-be found successor, but someone still has to decide whether to proceed with the proposed tougher rules despite concerns – likely to have been echoed in the consultation – that they may result in regulatory over-reach and potential injustice. Should this be an exiting chairman and CEO or the new leadership team? Surely the latter.</p><p class=\"\">In summary, it’s been a month since the market was blindsided by the news of Neal’s resignation. This – together with the chairman handover process – no doubt explains the delay in announcing an agreed exit date. But Lloyd’s needs to resolve the current leadership limbo swiftly. Once achieved, perhaps it also makes sense for the Corporation to return to the policy of stable succession planning…</p><p class=\"\">In response to some of the points raised in this article, a Lloyd's spokesperson said: “Lloyd’s executive committee remain aligned on the Corporation’s strategy for 2025 and on the execution and delivery against the key priorities of performance; digitalisation; purpose and culture.</p><p class=\"\">“Following John Neal’s decision to step down as CEO of Lloyd’s in 2025, a rigorous process to recruit has successor is now underway. A formal departure date will be agreed in due course, and John will work with incoming chair Charles Roxburgh and Lloyd’s executive committee to ensure a smooth transition.</p><p class=\"\">“Alex Cliff will take over from Burkhard Keese, following his decision to step down as CFO at the end of April as part of a well-executed succession plan. She is a well-known member of the leadership team and well-respected deputy CFO, having been at Lloyd’s for over three years.”</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0KP:0-subbed-what-s-happened-to-lloyd-s-policy-of-succession-management/",
            "pub_date": "2025-02-06 01:09:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}