{
    "data": [
        {
            "id": "DJN_DN20250204008223:0",
            "title": "Euro Credit Spreads Likely to Tighten Further in February — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Risk premia, or spreads, on euro-denominated credit are expected to tighten further in February, Societe Generale's Juan Valencia says in a note. In recent years, euro credit spreads have tightened modestly in February, excluding in 2020 due to the impact of Covid-19 and in 2022 following Russia's invasion of Ukraine. The pattern is likely to continue with slight spread tightening this February, he says. \"At the moment we don't see much evidence of a correction with spreads widening any time soon,\" Valencia says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008223:0/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1N1:0",
            "title": "De La Rue gets approaches from other entities as Edi Truell's consortium revises proposal structure",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">De La Rue  said on Tuesday it had received preliminary approaches from parties other than a consortium of British financier Edi Truell's companies for the sale of the UK banknote printer. </p><p class=\"\">De La Rue added that the Truell-led consortium, which had proposed to buy it for $301 million in January, would do so through the issuance of a debt instrument and a share buyback.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1N1:0-de-la-rue-gets-approaches-from-other-entities-as-edi-truell-s-consortium-revises-proposal-structure/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4LrQ1m:0",
            "title": "Canadian Nuclear Laboratories Expands Clean Energy Siting Invitation to Include Fusion, Hydrogen and Battery Storage",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CHALK RIVER, Ontario, Feb.  04, 2025  (GLOBE NEWSWIRE) — Canadian Nuclear Laboratories (CNL), Canada’s premier nuclear science and technology organization, is pleased to announce it has expanded the scope of its SMR siting invitation program to help organizations pursue commercial opportunities and seize a leadership position in the development and deployment of other new and innovative clean energy technologies.</p><p class=\"\">Given the continued development of other novel technologies, and CNL’s growing capabilities and expertise across other clean energy categories, the program is being expanded beyond fission based SMRs and other advanced reactor designs. Now known as CNL’s Clean Energy Siting Program, the new program will also invite vendors and technology developers interested in building prototype solutions that include fusion-based technologies, hydrogen production, battery storage and clean fuel production facilities, among others. Overall, the intent is to support the Government of Canada achieve its net-zero objectives, help Canadians businesses develop new and innovative technologies, and make CNL’s resources available to the private sector.</p><p class=\"\">“Through CNL’s ongoing engagements with clean energy leaders in Canada and around the world, it was clear there was an opportunity for us to expand and grow our SMR siting program, in order to support prototype construction and testing for other clean energy technologies,” commented Jack Craig, CNL’s President and CEO. “More importantly, Canada has set ambitious domestic targets in clean energy, and if we are to meet them, we must recognize that there is no one solution that will address a challenge of this scale and significance. To fight climate change and realize energy security, it will take all these promising technologies working in tandem with one another. That is at the heart of our renewed program, and it is our belief that we can help to accelerate the deployment of these promising technologies and maximize their full potential.”</p><p class=\"\">As a federal Crown corporation, AECL owns and oversee the sites under management by CNL. “AECL is pleased to see the expansion of the siting program to include even more approaches to clean energy production, use, and storage,” said Fred Dermarkar, AECL’s President and CEO. “This is another example of the value of Canada’s investment in its national nuclear laboratories. Our model allows us to connect commercial and academic partners with Canada’s unique nuclear science assets. This new, expanded program could not be possible without the innovative collaboration between the federal government and the private sector. AECL is proud to facilitate this new invitation process,” added Dermarkar.</p><p class=\"\">“CNL will continue to work closely with SMR vendors who are already navigating our siting program, and it is our hope that we will see an SMR sited at one of the sites we manage on behalf of AECL in the very near future,” added Dr. Stephen Bushby, CNL’s Vice-President of Science and Technology. “But given all the advances that have been realized in recent years across a number of different clean energy categories, it only makes sense that we expand our siting program to support the development of these technologies and do everything we can to bring them to the market.”</p><p class=\"\">Under the renewed program, applicants pursuing a clean energy demonstration project must still proceed through four individual stages, though these phases have been updated to align with the more collaborative approach of the renewed program. Depending on the interest and suitability of the applications, these projects could be located at the Chalk River Laboratories or the Whiteshell Laboratories site. Both sites are located on the traditional lands, waterways and ceded and unceded territories of Indigenous peoples; meaningful engagement with Indigenous peoples will be a key component of any successful project.</p><p class=\"\">While the invitation process does not include access to CNL’s research facilities or other ancillary programs, CNL is very much open to discussion with proponents regarding collaborative approaches to help advance their individual projects.</p><p class=\"\">To learn more about CNL, including its new Clean Energy Siting Program please visit www.cnl.ca.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CNL </strong></p><p class=\"\">As Canada’s premier nuclear science and technology laboratory and working under the direction of Atomic Energy of Canada Limited (AECL), CNL is a world leader in the development of innovative nuclear science and technology products and services. Guided by an ambitious corporate strategy known as Vision 2030, CNL fulfills three strategic priorities of national importance – restoring and protecting the environment, advancing clean energy technologies, and contributing to the health of Canadians.</p><p class=\"\">By leveraging the assets owned by AECL, CNL also serves as the nexus between government, the nuclear industry, the broader private sector, and the academic community. CNL works in collaboration with these sectors to advance innovative Canadian products and services towards real-world use, including carbon-free energy, cancer treatments and other therapies, non-proliferation technologies and waste management solutions.</p><p class=\"\">To learn more about CNL, please visit www.cnl.ca.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CNL Contact:</strong></p><p class=\"\">Philip Kompass</p><p class=\"\">Director, Corporate Communications</p><p class=\"\">1-866-886-2325</p><p class=\"\">media@cnl.ca</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/fb2b90fc-6df7-448e-af36-1cb5cfd85ce6</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CANADIAN NUCLEAR LABORATORIES EXPANDS CLEAN ENERGY SITING INVITATION TO INCLUDE FUSION, HYDROGEN AND BATTERY STORAGE</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">CNL’s Clean Energy Siting Program introduces collaborative approach to siting emerging energy technologies and solutions at Canada’s national nuclear laboratories.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4LrQ1m:0-canadian-nuclear-laboratories-expands-clean-energy-siting-invitation-to-include-fusion-hydrogen-and-battery-storage/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0IL:0",
            "title": "Auto File-Trump’s tariff whiplash ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Greetings from London! </p><p class=\"\">The start to Trump 2.0 has been as busy for the auto industry as expected, perhaps even busier. But before we delve into the high stakes drama of the last few days, it is worth focusing briefly on events at Stellantis.  </p><p class=\"\">After Carlos Tavares was ousted as CEO in dramatic fashion in December, some analysts and investors feared that having the world’s No. 4 automaker run by committee would lead to paralysis and indecision at a time when it faces a plethora of challenges. </p><p class=\"\">But chairman John Elkann has been busy focusing on changes throughout the organization while the search for a replacement for Tavares goes on.   </p><p class=\"\">On Monday, the company announced a series of executive moves, including naming North American boss Antonio Filosa as global head of quality and integrated software and engineering activities under Chief Engineering and Technology Officer Ned Curic. </p><p class=\"\">Stellantis also said it was giving greater product planning and development powers to regional bosses, a departure from the top-down approach criticized by insiders. </p><p class=\"\">Which brings us to today’s Auto File… </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Trump’s tariff carousel  </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">What next for EU on EVs?  </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BYD’s Brazilian mess continues </p></li></ul><p class=\"\">    Trump’s renewed tariff chaos </p><p class=\"\">U.S. President Donald Trump has wasted little time reverting to form in his second term, sowing chaos by announcing 25% tariffs on Mexican and Canadian imports on Saturday that battered carmaker shares, then jerking the rug out from everyone on Monday by postponing them a month. </p><p class=\"\">Setting aside political questions, not least of all why employ such a major blunt instrument ostensibly to stop the trade in illicit drugs, it leaves the auto industry trying to guess what next.  </p><p class=\"\">Legacy automakers have already been struggling with weak demand, a tough transition to electric vehicles and rising competition from the Chinese – who still face 10% tariffs, but a lot less than the 60% Trump promised after winning the U.S. election in November.   </p><p class=\"\">Now add Trump whiplash to automakers’ growing list of problems. </p><p class=\"\">Faced with a consistent threat of tariffs, automakers might evaluate the feasibility of moving cheap production lines to the U.S. from Mexico. </p><p class=\"\">But as former Aston Martin CEO Andy Palmer told Reuters, that is impossible when the policy can be changed tomorrow - or in this case before the tariffs even took effect. </p><p class=\"\">Trump’s on-off tariff approach also comes after he has gone after the EV-friendly policies of the Biden administration. </p><p class=\"\">So that leaves automakers faced with the question of what type of vehicle to build in the United States – combustion engine, hybrid or full EV? – where again policy could change as soon as someone else takes office. </p><p class=\"\">This leaves them making decisions “based on hunches,” Palmer says, “which is always very dangerous.” </p><p class=\"\">Recommended reading: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Scania tries to save Northvolt </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">U.S. tariffs on China hit crude  </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Volvo teams with Waabi for driverless trucks  </p></li></ul><p class=\"\">    Under pressure, the EU talks EVs  </p><p class=\"\">The European Commission met with European automakers, unions and interest groups to figure out how to breathe fresh life into efforts to make the shift to electric and help the continent’s auto industry fend off competition from U.S. and Chinese rivals.   </p><p class=\"\">The talks came at a tough time for Europe’s car industry struggling with those challenges, which have spurred factory closures and job cuts, including 54,000 job losses among auto suppliers in 2024. </p><p class=\"\">Europe’s car industry is laser focused on one issue: pushing ways for the EU to ditch or waive fines for failing to comply with tough new CO2 targets in 2025, that more than one in five cars they sell this year needs to be fully electric.  </p><p class=\"\">That is well above EVs’ 13.6% EU share of the new car market last year, which has led the industry to issue dire warnings that Europe’s automakers could face fines of up to 15 billion euros this year.    </p><p class=\"\">The European association representing EV makers, battery makers, charging companies and others that have been investing in readiness for an electric world issued research on Monday that says new lower-cost EVs will help the auto industry comply with the CO2 targets and that instead of waiving fines the EU beef up incentives to encourage consumers to buy EVs. </p><p class=\"\">    BYD’s tough contracts for workers in Brazil </p><p class=\"\">BYD used contracts for workers from China to build a new car factory in Brazil including clauses that violate labor laws in both countries, according to an exclusive report from my Reuters colleagues Fabio Teixeira, Luciana Novaes Magalhaes and Lisandra Paraguassu. You can read it here.  </p><p class=\"\">The workers who traveled from China to northeast Brazil to build the factory earned roughly $70 per 10-hour shift, more than twice the Chinese hourly minimum wage in many regions.  </p><p class=\"\">But the workers hired by BYD contractor Jinjiang in Brazil had to hand over their passports to their new employer, let most of their wages be sent directly to China, and hand over an almost $900 deposit that they could only get back after six months' work. </p><p class=\"\">The contract also gave the firm the power to unilaterally extend the labor contract for six months and issue 200-yuan fines for conduct such as swearing, quarreling or walking around shirtless at the site or in their living quarters. </p><p class=\"\">BYD says it had no knowledge of any violations until initial reports emerged in Brazilian media outlets in late November. </p><p class=\"\">    Nissan’s U.S. buyouts  </p><p class=\"\">Nissan is offering buyouts to workers and cutting back shifts at its three U.S. factories as the Japanese automaker pushes to slash $2.6 billion in costs globally. </p><p class=\"\">Nissan will offer buyout packages to workers at its vehicle assembly plants in Smyrna, Tennessee, and Canton, Mississippi, and an engine plant in Decherd, Tennessee. </p><p class=\"\">The automaker will cut one of two shifts making its Rogue sports utility vehicle in Smyrna starting in April, and for the Altima sedan in Canton from September. </p><p class=\"\">This all comes after Nissan announced a plan in November to cut 9,000 jobs worldwide and reduce the maximum capacity of its 25 vehicle production lines as it wrestles with a sales slump in China and North America. </p><p class=\"\">    Fast Laps </p><p class=\"\">    Tesla’s fourth quarter results fell short of Wall Street expectations, but insisted it was on track to roll out new, cheaper EVs in the first half of 2025 and would start testing a paid autonomous car service in June. </p><p class=\"\">    General Motors is switching from its loss-making Cruise robotaxi unit to a future focused on its Super Cruise driver assistance technology similar to Tesla's Autopilot in the search for a profitable business model. </p><p class=\"\">    Toyota sold 10.8 million vehicles in 2024 and remained the world's top-selling automaker for the fifth consecutive year, despite a 3.7% drop in sales.  </p><p class=\"\">    Porsche's supervisory board has started talks to end chief financial officer Lutz Meschke's and sales executive Detlev von Platen's contracts early as the German luxury carmaker struggles to boost flagging earnings and weak sales in China. </p><p class=\"\">    UVeye, a startup that uses AI-driven technology to inspect vehicles to avoid defects and target repairs, said it had raised $191 million in debt and equity to scale up production in North America and Europe. </p><p class=\"\">Think your friend or colleague should know about us? Forward this newsletter to them. They can also subscribe <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/newsletters/\" rel=\"nofollow\" target=\"_blank\">here</a>. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0IL:0-auto-file-trump-s-tariff-whiplash/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2WdG2N:0",
            "title": "AssetMark Appoints Alex Pape as EVP and Chief Technology and Product Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CONCORD, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — AssetMark, Inc., a leading wealth management technology platform for financial advisors, today announced the appointment of Alex Pape as its new Chief Technology and Product Officer.</p><p class=\"\">Pape will report directly to Lou Maiuri, Chairman and Group CEO of AssetMark, and will oversee AssetMark’s technology productization program, delivering advanced solutions designed to empower financial advisors. “This is a strategically important move as we continue to strengthen our leadership team to support AssetMark’s growth and innovation strategy,” said Lou Maiuri, Chairman and Group CEO of AssetMark Financial Holdings, Inc. “To achieve our strategic goals, we are further strengthening our already strong IT leadership team. Alex’s experience and vision will be invaluable as we continue to scale and innovate, ensuring that our technology and product offerings remain best-in-class.”</p><p class=\"\">Pape brings extensive experience in technology and product development, having most recently served as the Global Head of Product for BlackRock’s Aladdin Wealth Tech Business. His experience at BlackRock reinforces AssetMark’s strategic direction, particularly as advisors increasingly seek solutions that offer highly personalized portfolio management for their clients. Pape’s expertise in leveraging data analytics and technology will be key to delivering innovative solutions for financial advisors.</p><p class=\"\">Muk Mehta, Chief Information Officer, will continue to report to Maiuri, overseeing the company’s advanced infrastructure, security, and data strategy, ensuring seamless operational efficiency and technology enablement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About AssetMark</strong></p><p class=\"\">AssetMark operates a wealth management platform whose mission is to help financial advisors and their clients. AssetMark, together with its affiliates AssetMark Trust Company, Voyant, and Adhesion Wealth Advisor Solutions, serves advisors at every stage of their journey with flexible, purpose-built solutions that champion client engagement and drive efficiency. Its ecosystem of solutions equips advisors with services and capabilities to help deliver better investor outcomes by enhancing their productivity, profitability, and client satisfaction. </p><p class=\"\">With a history going back to 1996, AssetMark has over 1,000 employees, and its platform serves over 10,700 financial advisors and over 317,000 investor households. As of December 31, 2024, the Company had over $139 billion in platform assets. AssetMark, Inc. is a Registered Investment Adviser with the U.S. Securities and Exchange Commission. For more information, please visit www.assetmark.com. Follow us on LinkedIn. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contacts</strong></p><p class=\"\">Vesselina Davenport</p><p class=\"\">PR &amp; Communications, AssetMark</p><p class=\"\">vesselina.davenport@assetmark.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2WdG2N:0-assetmark-appoints-alex-pape-as-evp-and-chief-technology-and-product-officer/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX30bjGZ:0",
            "title": "Accellera Board Approves Universal Verification Methodology for Mixed-Signal (UVM-MS) 1.0 Standard for Release",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ELK GROVE, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Accellera Systems Initiative (Accellera), the electronics industry organization focused on the creation and adoption of electronic design automation (EDA) and intellectual property (IP) standards, announced today that its Board of Directors has approved the Universal Verification Methodology for Mixed-Signal (UVM-MS) 1.0 standard for release. The new standard is available for immediate download fee free.</p><p class=\"\">The UVM-MS 1.0 standard is a comprehensive and unified analog/mixed-signal (AMS) verification methodology based on the UVM IEEE Std. 1800.2™. This standard significantly enhances the verification of AMS and digital/mixed-signal (DMS) integrated circuits and systems. It defines a robust framework that facilitates the creation of AMS verification components and testbenches by extending digital-centric UVM classes and enabling interaction between class-based and structural environments.</p><p class=\"\">“I’d like to congratulate the members of the UVM-MS Working Group for their dedication and hard work in delivering this much-anticipated standard that will significantly enhance the verification of AMS products and applications,” stated Lu Dai, Chair of Accellera. “The strong industry interest in this standard underscores its importance. As an organization devoted to improving design and verification productivity for both users and vendors, we eagerly anticipate its positive impact on the industry.”</p><p class=\"\">UVM-MS 1.0 introduces the concept of the MS Bridge, a SystemVerilog module that connects UVM agents to mixed-signal DUTs. This bridge includes an MS Proxy class, which provides an API to control the bridge core. The MS Bridge Core handles datatype conversions and signal manipulations, ensuring accurate modeling of analog behaviors. This comprehensive approach standardizes methods for driving and monitoring mixed-signal nets within UVM, significantly enhancing the productivity and quality of verification processes for AMS and DMS designs.</p><p class=\"\">“The release of UVM-MS 1.0 is a game changer for the verification of AMS designs,” said Tom Fitzpatrick, Chair of the UVM-MS Working Group. “This unified approach will help to make the verification of components and subsystems much more efficient and enable the development of reusable UVM-MS verification components, similar to Verification IP available today in UVM for digital verification. I’m deeply grateful for the hard work and collaboration of our working group members whose expertise made this achievement possible.”</p><p class=\"\">The long-term goal for the UVM-MS standard is to enhance its global reach and recognition by transitioning it to the IEEE Design Automation Standards Committee (DASC) for formal standardization. This collaboration will leverage the IEEE’s extensive global network and perspective, ensuring ongoing maintenance, greater adoption, and sustained development of the standard worldwide.</p><p class=\"\">For more information about the UVM-MS standard, visit the UVM-MS Working Group page.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Accellera</strong></p><p class=\"\">Accellera Systems Initiative is an independent, not-for-profit organization dedicated to create, support, promote and advance system-level design, modeling, and verification standards for use by the worldwide electronics industry. The organization accelerates standards development and, as part of its ongoing partnership with the IEEE, its standards are contributed to the IEEE Standards Association for formal standardization and ongoing change control. For more information, please visit www.accellera.org. Find out more about membership. Follow @accellera on Twitter and LinkedIn or to comment, please use #accellera. Accellera Global Sponsors are: Cadence, Siemens EDA, and Synopsys.</p><p class=\"\">Accellera and Accellera Systems Initiative are trademarks of Accellera Systems Initiative Inc. All other trademarks and trade names are the property of their respective owners.</p><p class=\"\">For more information, contact:</p><p class=\"\">Barbara Benjamin</p><p class=\"\">Public Relations for Accellera Systems Initiative</p><p class=\"\">Phone: +1 503 209 2323</p><p class=\"\">Email: barbara@hipcom.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX30bjGZ:0-accellera-board-approves-universal-verification-methodology-for-mixed-signal-uvm-ms-1-0-standard-for-release/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN9GNnmZ:0",
            "title": "Grieg Seafood ASA - Appoints Magnus Johannesen as new CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Grieg Seafood today announced a planned Chief Financial Officer (CFO) transition, as Atle Harald Sandtorv has initiated the process of stepping down from his role. Global Finance Officer Magnus Johannesen will act as CFO effective 5 February 2025.</p><p class=\"\">“Magnus has shown a strategic mindset and analytical skills that makes me confident he will be a great contributor to the continued development of Grieg Seafood,” says CEO Andreas Kvame.</p><p class=\"\">Magnus Johannesen joined Grieg Seafood from Frydenbø Group where he was Chief Investment Officer. He also holds experience as interim CFO in the investment company Rexir Holding and from McKinsey &amp; Company. Johannesen holds a MSc in business administration from Norwegian School of Economics (NHH) with specialisation in auditing and accounting.</p><p class=\"\"><em> </em></p><p class=\"\">Johannesen replaces Atle Harald Sandtorv, who has held the position as CFO of Grieg Seafood since 2009.</p><p class=\"\">“Atle Harald has played an instrumental role in the shaping of Grieg Seafood for more than 15 years, having secured the financing and capital structure enabling our growth and development over this period. I want to thank Atle Harald for his leadership and commitment over many years,” says Andreas Kvame.</p><p class=\"\">In a mutual agreement with the company, Atle Harald Sandtorv continues to support the new transition moving forward.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further enquiries, please contact:</strong></p><p class=\"\">Andreas Kvame, CEO</p><p class=\"\">Cell phone: +47 907 71 441</p><p class=\"\">E-mail: andreas.kvame@griegseafood.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Grieg Seafood</strong></p><p class=\"\">Grieg Seafood ASA is one of the world's leading salmon farmers. Our farms are in Finnmark and Rogaland in Norway, and British Columbia as well as Newfoundland in Canada. Our headquarter is in Bergen, Norway. Grieg Seafood ASA was listed at the Oslo Stock Exchange in June 2007.</p><p class=\"\">Sustainable farming practices are the foundation of Grieg Seafood's operations. The lowest possible environmental impact and the best possible fish welfare is both an ethical responsibility and drive economic profitability.</p><p class=\"\">To learn more, please visit www.griegseafood.com</p><p class=\"\">This information is subject to the disclosure requirements pursuant to section 5-12 of the Norwegian Securities Trading Act.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN9GNnmZ:0-grieg-seafood-asa-appoints-magnus-johannesen-as-new-cfo/",
            "pub_date": "2025-02-05 00:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Nbd81K3xV:0",
            "title": "Foreign Exchange and Liquidity and Monthly Balance Sheet, January 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">THE FOREIGN-EXCHANGE RESERVE </p><p class=\"\">In January 2025, the foreign-exchange reserve decreased by kr. 0.8 billion to kr. 653.7 billion. The decrease reflects Danmarks Nationalbank's net sale of foreign exchange for kr. 2.9 billion, and the central government's net borrowing of foreign debt for kr. 2.1 billion, cf. table 1.</p><p class=\"\">For settlement in January, Danmarks Nationalbank has not intervened in the foreign exchange market.</p><p class=\"\">Danmarks Nationalbank's net foreign-exchange purchases and the change in the foreign-exchange reserve - table 1           </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr></tr><tr><th>Kr. billion</th><th>January 2025</th></tr><tr><td>Danmarks Nationalbank's interventions* to purchase foreign exchange, net</td><td>0.0</td></tr><tr><td>Other**</td><td>-2.9</td></tr><tr><td>Danmarks Nationalbank's net foreign-exchange purchases</td><td>-2.9</td></tr><tr><td>The central government's net foreign borrowing***</td><td>2.1</td></tr><tr><td>Change in the foreign-exchange reserve</td><td>-0.8</td></tr></tbody></table></div><p class=\"\"> Note: Details may not add because of rounding and previously published figure may have been revised. All transactions as per settlement date.</p><p class=\"\">** Comprises e.g. interest accrued on the foreign-exchange reserve, the central government's net payments in foreign exchange, and changes in the banks' deposits in euro-denominated accounts at Danmarks Nationalbank.</p><p class=\"\">*** Including net payments to the central government in foreign exchange as a result of currency swaps.</p><p class=\"\">VALUE ADJUSTMENT OF DANMARKS NATIONALBANK'S PORTFOLIOS FOR 2024</p><p class=\"\">Danmarks Nationalbank has calculated annual value adjustments of its holdings in connection with the preparation of the annual report for 2024.</p><p class=\"\">As a result of value adjustments, etc. the foreign exchange reserve increased by kr. 20,4 billion and amounted to kr. 654.4 billion at end-2024. Similarly, holdings of domestic bonds have increased by kr. 0,6 billion and amount to kr. 33,8 billion at end-2024.</p><p class=\"\">The monthly balance sheet is a liquidity statement, the purpose of which is that the net liquidity changes of the monetary-policy instruments as well as of the size of the foreign exchange reserve can be read directly from the balance as changes during the period. Thus the monthly balance sheet does not include value adjustments or accruals, which are solely included in Danmarks Nationalbank's annual report.</p><p class=\"\">DEVELOPMENT IN LIQUIDITY</p><p class=\"\">In January, the central government's net financing requirement amounted to kr. 0.4 billion, cf. table 2.</p><p class=\"\">The net position of the banks and mortgage-credit institutes vis-à-vis Danmarks Nationalbank decreased by kr. 3.9 billion in January, to an outstanding amount of kr. 256.6 billion. In January, Danmarks Nationalbank's net foreign-exchange purchases decreased the net position by kr. 2.9 billion.</p><p class=\"\">Impact of various factors on the net position of the banks and mortgage-credit institutes via-a-vis Danmarks Nationalbank - table 2           </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr></tr><tr><th>Kr. billion</th><th>January 2025</th></tr><tr><td>The central government's net financing</td><td>0.4</td></tr><tr><td>Redemption on domestic central-government debt*</td><td>6.5</td></tr><tr><td>Net bond purchases by the government funds and own portfolio and financing of social housing</td><td>-2.4</td></tr><tr><td>Other**</td><td>0.3</td></tr><tr><td>The central government's gross domestic financing requirement</td><td>4.9</td></tr><tr><td>The central government's gross domestic borrowing***</td><td>7.5</td></tr><tr><td>The central government's liquidity impact</td><td>-2.7</td></tr><tr><td>Danmarks Nationalbank's net foreign-exchange purchases</td><td>-2.9</td></tr><tr><td>Danmarks Nationalbank's net bond purchases</td><td>-0.2</td></tr><tr><td>Other factors****</td><td>1.9</td></tr><tr><td>Change in net position</td><td>-3.9</td></tr></tbody></table></div><p class=\"\"> Note: Details may not add because of rounding and previously published figure may have been revised. All transactions as per settlement date.</p><p class=\"\">* Including krone-denominated payments by the central government in currency swaps.</p><p class=\"\">** Comprises, inter alia, net bond purchases by the government funds and net collateral for the government’s swap portfolio.</p><p class=\"\">*** Gross long-term borrowing, net short-term borrowing and krone-denominated payments to the central government in currency swaps.</p><p class=\"\">**** Comprises e.g. changes in banknotes and coins in circulation. </p><p class=\"\">DANMARKS NATIONALBANK'S INTEREST RATES</p><p class=\"\">Since 31 January 2025 the discount rate has been 2.35 pct. p.a., since 31 January 2025 the current-account interest rate has been 2.35 pct. p.a., since 31 January 2025 the lending rate has been 2.5 pct. p.a. and since 31 January 2025 the rate of interest on certificates of deposit has been 2.35 pct. p.a.</p><p class=\"\">Enquiries can be directed to press advisor Peter Levring on tel. +45 26201809.</p><p class=\"\">BALANCE SHEET OF DANMARKS NATIONALBANK 31 JANUARY 2025</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><th>              Assets</th><th>             2025</th><th>             2024</th></tr><tr><td>1000 kr.</td><td>31/01</td><td>31/12</td></tr><tr><td>Stock of gold</td><td>40,309,044</td><td>29,762,724</td></tr><tr><td>Foreign assets</td><td>558,010,180</td><td>548,340,415</td></tr><tr><td>Claims on the International Monetary Fund</td><td>58,714,478</td><td>57,525,170</td></tr><tr><td>Claims related to banks' and mortgage credit institutes' TARGET accounts in ECB</td><td>30,579</td><td>42,982</td></tr><tr><td>Monetary-policy lending</td><td>- </td><td>- </td></tr><tr><td>Other lending </td><td>1,114,997 </td><td>1,315,889 </td></tr><tr><td>             - Banks'1) </td><td>1,114,997 </td><td>1,315,889 </td></tr><tr><td>             - Miscellaneous loans </td><td>- </td><td>- </td></tr><tr><td>Domestic bonds</td><td>33,648,312</td><td>33,225,246</td></tr><tr><td>Financial fixed assets, etc.</td><td>131,550</td><td>131,550</td></tr><tr><td>Tangible and intangible fixed assets</td><td>716,825</td><td>653,764</td></tr><tr><td>Other assets</td><td>5,138,110</td><td>3,022,031</td></tr><tr><td></td><td>697,814,075</td><td>674,019,771</td></tr></tbody></table></div><p class=\"\"> 1) Other lending to banks include loans for cash deposits. </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><th>              Liabilities</th><th>             2025</th><th>             2024</th></tr><tr><td>1000 kr.</td><td>31/01</td><td>31/12</td></tr><tr><td>Banknotes</td><td>46,956,721</td><td>48,243,034</td></tr><tr><td>Coins</td><td>6,117,406</td><td>6,125,320</td></tr><tr><td>Monetary-policy deposits</td><td>256,550,805</td><td>260,449,069</td></tr><tr><td>- Current accounts</td><td>256,550,805</td><td>260,449,069</td></tr><tr><td>             - Certificates of deposit</td><td>- </td><td>- </td></tr><tr><td>Other deposits</td><td>15,546,285</td><td>15,420,733</td></tr><tr><td>- Deposits related to banks' and mortgage credit institutes' TARGET accounts in ECB</td><td>30,579</td><td>42,982</td></tr><tr><td>             - Other deposits from banks' and mortgage credit institutes'</td><td>1,437,503</td><td>1,241,319</td></tr><tr><td>             - Miscellaneous deposits</td><td>14,078,203</td><td>14,136,432</td></tr><tr><td>Central government</td><td>216,526,715</td><td>211,734,874</td></tr><tr><td>Foreign liabilities</td><td>3,382,533</td><td>1,599,927</td></tr><tr><td>Counterpart of Special Drawing Rights allocated by the IMF (SDR)</td><td>45,039,776</td><td>43,743,945</td></tr><tr><td>Other liabilities</td><td>23,986,854</td><td>2,995,889</td></tr><tr><td>Capital and reserves</td><td>83,706,980</td><td>83,706,980</td></tr><tr><td></td><td>697,814,075</td><td>674,019,771</td></tr></tbody></table></div><p class=\"\"> Note: The monthly balance sheet is calculated at beginning of year values +/- accumulated transaction values. The monthly balance does not include value adjustments and accruals, as these are only calculated at year-end, cf. Danmarks Nationalbank's accounting principles.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Nbd81K3xV:0-foreign-exchange-and-liquidity-and-monthly-balance-sheet-january-2025/",
            "pub_date": "2025-02-05 00:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1LH:0",
            "title": "Ferrexpo's Ukrainian unit faces $3.77 billion civil claim; shares fall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">London-listed miner Ferrexpo  said on Tuesday a civil claim worth 157 billion hryvnias ($3.77 billion) was filed against its Ukrainian unit, Ferrexpo Poltava Mining (FPM), in relation to alleged illegal mining and a sale of waste products.</p><p class=\"\">Shares in the company slumped nearly 21% to a more than two-month low of 81.9 pence on the news.</p><p class=\"\">\"Initial accusations on the illegal sale of waste products have transformed into accusations that FPM is illegally mining and selling subsoil, which is said to have caused damage to the environment,\" Ferrexpo said.</p><p class=\"\">The miner said FPM has rejected the allegations on the basis that there was \"no illegal extraction of the subsoil\".</p><p class=\"\">Ferrexpo said that FPM is of the view that the accusations and claim are \"without merit\" and the unit intends to \"vigorously defend\" its position in the courts.</p><p class=\"\">The exporter of iron ore pellets said its operations were unaffected by the legal case.</p><p class=\"\">($1 = 41.6800 hryvnias)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1LH:0-ferrexpo-s-ukrainian-unit-faces-3-77-billion-civil-claim-shares-fall/",
            "pub_date": "2025-02-05 00:00:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0TT:0",
            "title": "Meta shares poised for record winning streak on Facebook's 21st birthday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Nasdaq up &gt;1%, S&amp;P 500 up ~0.5%, Dow ~flat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Energy leads S&amp;P sector gainers; Utilities weakest group</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro STOXX 600 index up ~0.1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar, crude fall; bitcoin down &gt;2%; gold up</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-Year Treasury yield flat at ~4.54%</li></ul></span></div><span><p class=\"\">META SHARES POISED FOR RECORD WINNING STREAK ON FACEBOOK'S 21ST BIRTHDAY</p><p class=\"\">Facebook.com was launched on this day in 2004. Eight years later it filed to raise $5 billion in an initial public offering. The same year Facebook bought photo-sharing app Instagram for $1 billion.</p><p class=\"\">Now called Meta Platforms , the social media behemoth is valued at $1.8 trillion. Its shares are set to rise for the 12th-straight session on Tuesday, which would be its longest stretch of gains on record.</p><p class=\"\">An investment of $10,000 at the IPO held through Monday's close would now be worth roughly $184,200, but it didn't get there in a straight line, said Justin Walters, co-founder at Bespoke Investment Group in a note.</p><p class=\"\">Facebook rebranded to \"Meta Platforms\" in 2021 reflecting its focus on an expensive experimental bet on a metaverse project which was shunned by investors. </p><p class=\"\">CEO Mark Zuckerberg \"reversed course on the metaverse to try and stop the bleeding, and he dubbed 2023 the 'year of efficiency' for the company. Around the same time, ChatGPT came along to start the AI Boom,\" Walters said.</p><p class=\"\">The stock has rallied an eye-watering 700% from the lows of 2022.</p><p class=\"\">(Medha Singh)</p><p class=\"\">     *****</p><p class=\"\">FOR TUESDAY'S EARLIER LIVE MARKETS POSTS:</p><p class=\"\">WALL STREET GAINS EARLY; PALANTIR TECHNOLOGIES RALLIES - CLICK HERE</p><p class=\"\">NASDAQ COMPOSITE: LOTS OF CHOP AS TRIES TO AVOID A BIGGER DROP - CLICK HERE</p><p class=\"\">WATCH OUT INVESTORS, IT'S THE YEAR OF THE SNAKE - CLICK HERE</p><p class=\"\">EQUITIES AND THE EURO: IT'S COMPLICATED - CLICK HERE</p><p class=\"\">A \"FASCINATING\" EARNINGS SEASON AHEAD FOR UK BANKS - CLICK HERE</p><p class=\"\">BACK TO EARNINGS - CLICK HERE</p><p class=\"\">EUROPE BEFORE THE BELL: HERE WE GO AGAIN - CLICK HERE </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0TT:0-meta-shares-poised-for-record-winning-streak-on-facebook-s-21st-birthday/",
            "pub_date": "2025-02-05 00:00:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSpyz6ta:0",
            "title": "Dolphin Companies Shore Fire Media and 42West's Clients Earn 10 Wins at the 2025 Grammy Awards",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NEW YORK, NY / ACCESS Newswire / February 4, 2025 / Dolphin  subsidiaries Shore Fire Media and 42West celebrate the leading communications firms' clients who contributed to works that received a collective 10 awards in multiple categories at the 67th Annual Grammy Awards: Shore Fire clients Sierra Ferrell, Samara Joy, Jacob Collier, Tasha Cobbs Leonard and Jonathan McReynolds as well as 42West client Andrew Watt.</p><p class=\"\">Making her Grammy debut, Sierra Ferrell topped the list - and was second only to Kendrick Lamar in total Grammys won - sweeping all four awards in the Americana category, including Best Americana Album, Best Americana Performance, Best American Roots Performance and Best American Roots Song.</p><p class=\"\">Samara Joy won two awards for Best Jazz Vocal Album and Best Jazz Performance, bringing her career tally to five and extending her perfect streak of winning every Grammy award for which she is nominated.</p><p class=\"\">Jacob Collier earned his seventh career Grammy Award, in the Best Arrangement, Instrumental or A Cappella category for \"Bridge Over Troubled Water\" featuring John Legend and Tori Kelly. He also performed on the telecast as part of the Quincy Jones tribute.</p><p class=\"\">Previous Grammy winners Tasha Cobbs Leonard and Jonathan McReynolds earned their respective third and second Grammy Awards for their collaboration with Erica Campbell, Israel Houghton and Jekalyn Carr, 2025 Best Gospel Performance/Song-winner \"One Hallelujah.\"</p><p class=\"\">Multiple Grammy Award-winning producer and songwriter Andrew Watt took home the Best Rock Album trophy for his co-writing and production work on The Rolling Stones' \"Hackney Diamonds\" - taking the stage to accept the award, representing the group during the Grammy Awards Premiere Ceremony. Watt has also been enjoying major chart success with Lady Gaga and Bruno Mars' Grammy-winning \"Die With a Smile\" - which won this year's award for Best Pop Duo/Group Performance.</p><p class=\"\">In addition to this year's trophy count, 2025 nominees and Shore Fire clients Rhiannon Giddens and Anoushka Shankar presented during the Premiere Ceremony. Also serving as a presenter, 42West client and fellow nominee Wayne Brady opened the ceremony with a moving performance of \"Bridge Over Troubled Water\" alongside Yolanda Adams, Angélique Kidjo, Deborah Cox, Taj Mahal and Scott Hoying.</p><p class=\"\">Shore Fire clients had a strong presence throughout Grammy weekend, including performances byFerrell and The War And Treaty at the MusiCares 2025 Persons of the Year Gala, and a performance by Joy at Clive Davis' Pre-Grammy Gala.</p><p class=\"\">See below for a full rundown of 2025 Grammy winners represented by Shore Fire or 42West.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Americana Album</strong></p><p class=\"\">\"Trail of Flowers\" by Sierra Ferrell (Shore Fire)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Americana Performance</strong></p><p class=\"\">\"American Dreaming\" by Sierra Ferrell (Shore Fire)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best American Roots Performance</strong></p><p class=\"\">\"Lighthouse\" by Sierra Ferrell (Shore Fire)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best American Roots Song</strong></p><p class=\"\">\"American Dreaming\" by Sierra Ferrell (Shore Fire) &amp; Melody Walker</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Jazz Performance</strong></p><p class=\"\">\"Twinkle Twinkle Little Me\" by Samara Joy (Shore Fire) featuring Sullivan Fortner</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Jazz Vocal Album</strong></p><p class=\"\">\"A Joyful Holiday\" by Samara Joy (Shore Fire)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Arrangement, Instrumental or A Cappella</strong></p><p class=\"\">\"Bridge Over Troubled Water\" by Jacob Collier (Shore Fire) featuring John Legend &amp; Tori Kelly</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Gospel Performance/Song</strong></p><p class=\"\">\"One Hallelujah\" by Tasha Cobbs Leonard (Shore Fire), Erica Campbell &amp; Israel Houghton featuring Jonathan McReynolds (Shore Fire) &amp; Jekalyn Carr</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Rock Album</strong></p><p class=\"\">\"Hackney Diamonds\" by The Rolling Stones (Andrew Watt/42West)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Best Pop Duo/Group Performance</strong></p><p class=\"\">\"Die With A Smile\" by Lady Gaga &amp; Bruno Mars (Andrew Watt/42West)</p><p class=\"\">###</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ABOUT SHORE FIRE MEDIA</strong></p><p class=\"\">Shore Fire Media represents artists, talent, creators, authors, athletes, cultural institutions, businesses, brands and entrepreneurs at the forefront of their respective fields - including some of the most exciting emerging and established voices in the arts, entertainment and beyond. With dedicated teams in New York, Los Angeles and Nashville, Shore Fire leverages extensive expertise and relationships to strategically amplify narratives and shape reputations that facilitate career advancement in an ever-evolving media landscape. To learn more, visit ShoreFire.com and follow Shore Fire on Instagram: @shorefire.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ABOUT 42WEST</strong></p><p class=\"\">42West, a subsidiary of Dolphin , is one of the entertainment industry's leading full-service public-relations firms. With offices in New York and Los Angeles, 42West has four divisions: Talent, Strategic Communications, Entertainment Marketing and Fandoms &amp; Franchises (formerly known as BHI), the award-winning firm's gaming, consumer products and publishing practice. The agency has developed and executed marketing and publicity strategies for hundreds of movies and television shows as well as countless actors, filmmakers, recording artists, personalities and authors. In addition, 42West provides strategic counsel to a wide variety of high-profile individuals and corporate clients - ranging from movie and pop stars to major studios, charitable organizations and media conglomerates - looking to raise, reposition or rehabilitate their public profiles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ABOUT DOLPHIN</strong></p><p class=\"\">Dolphin , founded in 1996 by Bill O'Dowd, has evolved from its origins as an Emmy-nominated television, digital and feature film content producer to a company with three dynamic divisions: Dolphin Entertainment, Dolphin Marketing and Dolphin Ventures.</p><p class=\"\">Dolphin Entertainment: This legacy division, where it all began, has a rich history of producing acclaimed television shows, digital content and feature films. With high-profile partners like IMAX and notable projects including The Blue Angels, Dolphin Entertainment continues to set the standard in quality storytelling and innovative content creation.</p><p class=\"\">Dolphin Marketing: Established in 2017, this division has become a powerhouse in public relations, influencer marketing, branding strategy, talent booking and special events. Comprising top-tier companies such as 42West, The Door, Shore Fire Media, Elle Communications, Special Projects, The Digital Dept., and Always Alpha, Dolphin Marketing serves a wide range of industries - from entertainment, music and sports to hospitality, fashion and consumer products.</p><p class=\"\">Dolphin Ventures: This division leverages Dolphin's best-in-class cross-marketing acumen and business development relationships to create, launch and/or accelerate innovative ideas and promising products, events and content in our areas of expertise.</p><p class=\"\">This press release contains 'forward-looking statements' within the meaning of the Private Securities Litigation Reform Act. These forward-looking statements may address, among other things, Dolphin Entertainment Inc.'s offering of common stock as well as expected financial and operational results and the related assumptions underlying its expected results. These forward-looking statements are distinguished by the use of words such as \"will,\" \"would,\" \"anticipate,\" \"expect,\" \"believe,\" \"designed,\" \"plan,\" or \"intend,\" the negative of these terms, and similar references to future periods. These views involve risks and uncertainties that are difficult to predict and, accordingly, Dolphin Entertainment's actual results may differ materially from the results discussed in its forward-looking statements. Dolphin Entertainment's forward-looking statements contained herein speak only as of the date of this press release. Factors or events Dolphin Entertainment cannot predict, including those described in the risk factors contained in its filings with the Securities and Exchange Commission, may cause its actual results to differ from those expressed in forward-looking statements. Although Dolphin Entertainment believes the expectations reflected in such forward-looking statements are based on reasonable assumptions, it can give no assurance that its expectations will be achieved, and Dolphin Entertainment undertakes no obligation to update publicly any forward-looking statements as a result of new information, future events, or otherwise, except as required by applicable law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CONTACT</strong></p><p class=\"\">James Carbonara/Hayden IR</p><p class=\"\">(646) 755-7412</p><p class=\"\">james@haydenir.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Dolphin</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSpyz6ta:0/",
            "pub_date": "2025-02-05 00:00:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSY42Fla:0",
            "title": "Leidos in 2024: Milestones, Impact, and Giving Back",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / As we start a new year, Leidos is looking back and celebrating a 2024 marked by significant achievements and transformative innovations illustrating the company's commitment to rapidly address its customers' most vexing challenges and to help them operate smarter and more efficiently. From innovative milestones to significant contract wins and meaningful community contributions, here's a look at 2024's highlights.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Milestones Achieved</strong></p><p class=\"\">MHS GENESIS Deployment Completed</p><p class=\"\">Leidos successfully completed the deployment of MHS GENESIS, the world's largest electronic health record system. With its rollout to Captain James A. Lovell Federal Health Care Center in Chicago last year, the system is now operational at over 4,000 global locations, serving more than 9.5 million beneficiaries and 200,000 medical providers.</p><p class=\"\">Enduring Shield Successful Intercept</p><p class=\"\">The Leidos Enduring Shield system was successfully tested by the U.S. Army, intercepting unmanned aircraft systems and cruise missile targets. This result led to an Initial Operational Test and Evaluation contract, underscoring the system's advanced capabilities in tracking and neutralizing airborne threats.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Team Wins</strong></p><p class=\"\">Leidos demonstrated its technological leadership through notable contract wins across diverse sectors, showcasing the company's ability to solve complex challenges.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$631M DIABLO Program Contract</p></li></ul><p class=\"\">Leidos will enhance aerial intelligence, surveillance, and reconnaissance systems for the U.S. Army, supporting lifecycle development and integration.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$738M Air Force Cybersecurity and IT Contract</p></li></ul><p class=\"\">Leidos extended its two-decade work in support of the U.S. Air Force to deliver advanced cybersecurity and IT solutions in the national capital region.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$249M Biometrics System Contract</p></li></ul><p class=\"\">Leidos is enhancing the Army's physical access control system into a more efficient, cloud-based solution as the Automated Installation Entry-Next Generation prime contractor.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$326.5M NIH eRA system Contract</p></li></ul><p class=\"\">With agile software development and AI-driven solutions, Leidos will help modernize the NIH's grants management system, the eRA, which administers over $40B annually.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Australian Joint Air Battle Management System</p></li></ul><p class=\"\">Leidos Australia is collaborating with Lockheed Martin Australia to develop an advanced integrated air and missile defense capability for the Australian Defence Force.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Giving Back to Communities</strong></p><p class=\"\">Leidos announced over $5 million in community-focused gifts and collaborations during November and December, strengthening its commitment to education and health.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$1.75M gift to enhance technical education at Drake State</p></li></ul><p class=\"\">Leidos funded the Leidos Advanced Training Complex at Drake State Community &amp; Technical College in Huntsville, Alabama, which will help enhance student learning with hands-on experience with complex technical and manufacturing projects.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$750K donation to increase tech infrastructure Hampton University</p></li></ul><p class=\"\">The Leidos contribution to Hampton University in Hampton, Virginia, will fund scholarships, enhance technology infrastructure, and provide students with opportunities to learn at Leidos facilities.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$2.5M to support pediatric medicine and research at The Children's Inn</p></li></ul><p class=\"\">The Leidos gift supports The Children's Inn's expansion, providing housing and services for families of children undergoing treatment at the National Institutes of Health.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">$50K to Hawaii Youth Impact Program</p></li></ul><p class=\"\">Leidos CEO Tom Bell presented a $50,000 donation to the Hawaii Youth Impact Program to support its STEM curriculum. The program uses innovative approaches to promote positive development for at-risk middle school students.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Enhancing Employee Experience</strong></p><p class=\"\">Leidos reiterated its commitment to offering a compelling employee experience. The company introduced new benefits to support its workforce and attract top talent, including an additional paid holiday and increased retirement matching.</p><p class=\"\">The company also shone a light on women veterans who feel invisible (around 20% of Leidos' workforce are military veterans) and supported upskilling in AI and skills-based hiring for critical cybersecurity roles.</p><p class=\"\">After such an impactful 2024, Leidos is looking forward to reaching even greater heights and smarter accomplishments in 2025.</p><p class=\"\">View additional multimedia and more ESG storytelling from Leidos on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Leidos</p><p class=\"\">Website: https://www.3blmedia.com/profiles/leidos</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Leidos</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSY42Fla:0/",
            "pub_date": "2025-02-05 00:00:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS26Ydma:0",
            "title": "With Cascale, Better Buying Legacy Lives On",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / In this latest blog Dr. Marsha Dickson, President and Co-founder of the Better Buying Institute (BBI), reflects on the organization's journey since its inception in 2015 and looks ahead to its future now that key Better Buying assets have become part of Cascale. She discusses the exciting opportunities and ambitions for advancing responsible purchasing practices at Cascale, as well as the broader impact on the industry as a whole.</p><p class=\"\">Read the full blog, titled: With Cascale, Better Buying Legacy Lives On</p><p class=\"\">View additional multimedia and more ESG storytelling from Cascale on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Cascale</p><p class=\"\">Website: https://www.3blmedia.com/profiles/cascale</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Cascale</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS26Ydma:0/",
            "pub_date": "2025-02-05 00:00:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309019:0",
            "title": "Turnstone Biologics Stops Tidal-01 Trials, Explores Strategic Alternatives; Shares Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Turnstone Biologics  said Tuesday it has decided to discontinue all clinical trials assessing Tidal-01 in solid tumors and has launched a process to explore strategic alternatives to maximize shareholder value. </p><p class=\"\">The company said it has hired an advisor to help in the review of potential alternatives that may include an acquisition, merger, sale of assets, licensing, or other deals. </p><p class=\"\">Turnstone also said it's reducing its workforce and implementing other cost-cutting and cash-preservation measures. </p><p class=\"\">The company's shares were rising past 6% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309019:0/",
            "pub_date": "2025-02-04 23:51:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309024:0",
            "title": "Movano Starts Cuffless Blood Pressure Wearable Device Clinical Study",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Movano  said Tuesday it has begun a clinical trial with its new cuffless blood pressure wrist wearable. </p><p class=\"\">The company said in the study, the device will be used to monitor pulse pressure waveforms compared with a hospital grade blood pressure device and will also collect data on pulse rate, blood oxygen saturation and other vital signs. </p><p class=\"\">The trial is expected to include at least 70 participants and be finished in the second week of February, Movano said. </p><p class=\"\">The company said the study follows three clinical trials where it used its non-invasive devices to collect pulse pressure waveform data from more than 60 participants.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309024:0/",
            "pub_date": "2025-02-04 23:52:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308996:0",
            "title": "Quantum BioPharma's Unbuzzd Proven to Accelerate Alcohol Metabolism in Clinical Trial; Shares Jump",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Quantum BioPharma  said Tuesday that a trial of its dietary supplement, Unbuzzd, confirmed it accelerates alcohol metabolism, speeds the reduction of blood alcohol concentration, and reduces symptoms of intoxication, impairment, and hangover. </p><p class=\"\">The study, which examined Unbuzzd's impact on alcohol intoxication and metabolism, found the results to be statistically significant compared to a placebo. </p><p class=\"\">The effects were noticeable within 30 minutes of consuming the dissolved powder. The supplement was well-tolerated, with no reported adverse effects. </p><p class=\"\">The shares of Quantum BioPharma surged nearly 53% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308996:0/",
            "pub_date": "2025-02-04 23:52:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463520:0",
            "title": "Viking Venture Exits Penneo Stake",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Penneo  said Tuesday that Viking Venture 29 and its founder Erik Fjellvær Hagen no longer hold shares or voting rights in the company. </p><p class=\"\">Viking Venture was an investor in the software-as-a-service group through Viking Venture 29.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463520:0/",
            "pub_date": "2025-02-04 23:52:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008120:0",
            "title": "Gevo Price Target Maintained With a $14.00/Share by HC Wainwright & Co.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008120:0/",
            "pub_date": "2025-02-04 23:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008121:0",
            "title": "Caterpillar Is Maintained at Neutral by DA Davidson",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008121:0/",
            "pub_date": "2025-02-04 23:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002817:0",
            "title": "These Stocks Are Moving the Most Today: Palantir, Alphabet, Tesla, Merck, PayPal, Super Micro, Spotify, Estee Lauder, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Woelfel</p><p class=\"\">Stocks were mixed Tuesday as China retaliated against new U.S. tariffs by unveiling levies on certain American goods and opening an investigation into Alphabet's Google for possible antitrust violations.</p><p class=\"\">These stocks were moving Tuesday:</p><p class=\"\">Palantir Technologies soared 25% after the software company reported fourth-quarter adjusted earnings that topped analysts' estimates and revenue jumped 36% to $828 million, beating expectations of $776 million. The company's U.S. business jumped 52% from a year earlier. \"Our business results continue to astound, demonstrating our deepening position at the center of the (artificial intelligence) revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,\" said CEO Alex Karp. For the first quarter, Palantir said it expects revenue of $858 million to $862 million, up 36% from 2024 at the midpoint and better than Wall Street estimates of $799 million.</p><p class=\"\">Tesla  was up 0.9% after shares of the electric-vehicle giant slumped 5.2% on Monday. The stock closed lower after it was announced that tariffs levied on Mexico by the U.S. would be delayed by a month but before President Donald Trump struck a similar deal with Canada. The electric-vehicle maker assembles all its vehicles for the U.S. market in the U.S. but about 15% of the parts in a Model Y sold in the U.S. come from Mexico.</p><p class=\"\">Shares of Nvidia, the leading maker of artificial-intelligence chips, were up 1.6%.  Nvidia declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Super Micro Computer rose 4.9%. The maker of AI servers said it would be providing a fiscal second-quarter \" business update\" on Feb. 11. The Nasdaq Stock Market told the company in November that it wasn't in compliance with a listing rule requiring timely filing of reports with the Securities and Exchange Commission. In early December, the company said it expected to file its delayed financial statements by Feb. 25.</p><p class=\"\">PepsiCo posted fourth-quarter adjusted earnings of $1.96 a share, beating analysts' estimates of $1.94 but the stock fell 1.8% after revenue declined 0.2% from a year earlier to $27.78 billion and missed expectations of $27.89 billion. Shares fell 2.6%.</p><p class=\"\">Shares of Spotify Technology jumped 11% after the audio-streaming company added more premium subscribers in the fourth quarter than Wall Street expected, helping revenue top estimates.</p><p class=\"\">Merck fell 11% after the drug maker reported fourth-quarter adjusted earnings that beat analysts' estimates but issued guidance for f2025 that missed expectations. Merck said it expects 2025 adjusted earnings of $8.88 to $9.03 a share, below consensus of $9.21.</p><p class=\"\">Pfizer was up 1.3% after fourth-quarter adjusted earnings of 63 cents a share topped analysts' forecasts of 46 cents and the company reaffirmed guidance for 2025.</p><p class=\"\">PayPal was down 9.7%. The fintech beat fourth-quarter earnings and sales estimates, and said total payment volume rose 7% in the quarter, while payment transactions decreased 3%.</p><p class=\"\">Estée Lauder, the luxury beauty brand, slumped 12% after it issued weak earnings guidance, said it expects to cut between 5,800 and 7,000 positions as part of a two-year restructuring plan, and would record more than $1 billion in pretax charges on employee-related costs.</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%, down from a prior outlook for sales to be flat to down 2%. Shares of the cleaning-products maker were down 4.1%.</p><p class=\"\">Earnings reports are expected after the closing bell Tuesday from Alphabet, Advanced Micro Devices, Chipotle Mexican Grill, and Amgen.</p><p class=\"\">Alphabet rose 1.2% ahead of fourth-quarter earnings from the parent of Google. Wall Street expects Alphabet to report earnings of $2.13 a share on revenue of $96.7 billion, up from per-share profit of $1.64 on revenue of $86.3 billion a year earlier. Cloud growth at the company and updates on its AI investments will be closely watched by investors.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002817:0/",
            "pub_date": "2025-02-04 23:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008123:0",
            "title": "EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Edith Hancock</p><p class=\"\">European officials need to manage their expectations in diplomatic negotiations against a more volatile geopolitical environment, European Commission President Ursula von der Leyen said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\">\"This is a world where we can no longer take much for granted including the rules and norms that were built over the past 70 years,\" she said at a conference on Tuesday, adding that \"in this hot-headed world, Europe's best approach is to remain level-headed.\"</p><p class=\"\">Von der Leyen--one of the European Union's most powerful officials--said negotiators need a clear and reasonable idea of the world as it really is. \"Don't think in terms of pessimism or even optimism, think about in terms of what is possible,\" she said.</p><p class=\"\">The commission president said that no other economies in the world are as integrated in the same way as the EU and the U.S.</p><p class=\"\">\"We want to make it work, and not only because of our historic ties, but because it is simply smart business,\" she said. \"So our first priority is now to work on the many areas where the interests converge.\"</p><p class=\"\">Her comments come after U.S. President Trump signed an executive order on Feb. 1 placing extra 10% tariffs on all Chinese imports, as well as threatening measures against Canada and Mexico before postponing them as both countries agreed to boost border security. Trump blasted the U.S.'s trade relationship with the EU over the weekend, calling it an \"atrocity\" and complaining that the EU exports far more to the U.S. than it imports. He said fresh tariffs on the bloc will definitely happen.</p><p class=\"\">\"We know that there will be an increased use of threats and economic coercion tools such as sanctions, export controls and tariffs,\" commission chief von der Leyen said. \"Europe will safeguard its economic and national security, but it is important that we strike the right balance,\" she said.</p><p class=\"\">Write to Edith Hancock at edith.hancock@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008123:0-eu-must-accept-transactional-global-relationships-commission-chief-von-der-leyen-says-update/",
            "pub_date": "2025-02-04 23:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309020:0",
            "title": "Update: Alpha Modus Sues Walgreens for Alleged Patent Infringement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates to include a response from Walgreens Boots Alliance and Alpha Modus Holdings stock's recent movement in the last two paragraphs.)</p><p class=\"\">Alpha Modus Holdings  said Tuesday it filed a patent infringement lawsuit against Walgreens Boots Alliance's  pharmacy store chain Walgreens in the US District Court for the Eastern District of Texas, alleging infringement of its retail technology. </p><p class=\"\">The company said the lawsuit claims Walgreens' in-store digital smart screens use technology covered by Alpha Modus's patents, including artificial intelligence tools that support in-store shopping with data insights and interactive advertising. </p><p class=\"\">Walgreens declined MT Newswires' request for comment due to the \"pending litigation.\"</p><p class=\"\">Shares of Alpha Modus were down over 6% in recent Tuesday trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309020:0/",
            "pub_date": "2025-02-04 23:54:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008144:0",
            "title": "Premier Down Nearly 13%, on Pace for Largest Percent Decrease Since May 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Premier, Inc. Class A ( PINC ) is currently at $19.55, down $2.86 or 12.75%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be lowest close since Oct. 15, 2024, when it closed at $19.37</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent decrease since May 2, 2023, when it fell 19.31%</li><li class=\"listItem-bmN0_SHH\">Currently down five of the past six days</li><li class=\"listItem-bmN0_SHH\">Currently down three consecutive days; down 15.02% over this period</li><li class=\"listItem-bmN0_SHH\">Worst three day stretch since the three days ending May 4, 2023, when it fell 20.23%</li><li class=\"listItem-bmN0_SHH\">Down 7.81% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 58.01% from its all-time closing high of $46.55 on Oct. 8, 2018</li><li class=\"listItem-bmN0_SHH\">Down 9.22% from 52 weeks ago (Feb. 6, 2024), when it closed at $21.53</li><li class=\"listItem-bmN0_SHH\">Down 16.26% from its 52-week closing high of $23.34 on Nov. 6, 2024</li><li class=\"listItem-bmN0_SHH\">Up 7.98% from its 52-week closing low of $18.10 on June 17, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as low as $19.50; lowest intraday level since Oct. 16, 2024, when it hit $19.41</li><li class=\"listItem-bmN0_SHH\">Down 12.95% at today's intraday low; largest intraday percent decrease since May 2, 2023, when it fell as much as 19.34%</li></ul><p class=\"\">All data as of 10:49:35 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008144:0/",
            "pub_date": "2025-02-04 23:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008137:0",
            "title": "Ferrari Up Nearly 8%, On Track for Largest Percent Increase Since February 2024 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ferrari NV (RACE) is currently at $462.41, up $33.47 or 7.8%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Nov. 4, 2024, when it closed at $476.05</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Feb. 1, 2024, when it rose 12.58%</li><li class=\"listItem-bmN0_SHH\">Currently up three of the past four days</li><li class=\"listItem-bmN0_SHH\">Currently up two consecutive days; up 7.91% over this period</li><li class=\"listItem-bmN0_SHH\">Best two day stretch since the two days ending Feb. 2, 2024, when it rose 9.64%</li><li class=\"listItem-bmN0_SHH\">Up 8.84% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 6.92% from its all-time closing high of $496.79 on Aug. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Up 22.16% from 52 weeks ago (Feb. 6, 2024), when it closed at $378.53</li><li class=\"listItem-bmN0_SHH\">Down 6.92% from its 52-week closing high of $496.79 on Aug. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Up 22.71% from its 52-week closing low of $376.84 on Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $470.16; highest intraday level since Nov. 4, 2024, when it hit $480.74</li><li class=\"listItem-bmN0_SHH\">Up 9.61% at today's intraday high; largest intraday percent increase since Feb. 1, 2024, when it rose as much as 13.15%</li></ul><p class=\"\">All data as of 10:36:31 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008137:0-ferrari-up-nearly-8-on-track-for-largest-percent-increase-since-february-2024-data-talk/",
            "pub_date": "2025-02-04 23:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008139:0",
            "title": "American Airlines Group Is Maintained at Neutral by Susquehanna",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:55 GMT) </strong>American Airlines Group Price Target Cut to $18.00/Share From $20.00 by Susquehanna</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008139:0/",
            "pub_date": "2025-02-04 23:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1MA:0",
            "title": "London-listed Ferrexpo plunges on $3.77 billion civil claim against Ukrainian unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Ferrexpo  down 20.9% to a two-month low of 82p, </p><p class=\"\">** Miner says Ukrainian unit faces $3.77 billion civil claim  in relation to alleged sale of waste products</p><p class=\"\">** The unit, Ferrexpo Poltava Mining, rejects allegations on basis that there was no illegal extraction of the subsoil</p><p class=\"\">** Unit intends to \"vigorously defend\" its position in the courts</p><p class=\"\">** FXPO's operations unaffected by legal case</p><p class=\"\">** Shares down ~23% so far this year</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1MA:0-london-listed-ferrexpo-plunges-on-3-77-billion-civil-claim-against-ukrainian-unit/",
            "pub_date": "2025-02-04 23:55:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008087:0",
            "title": "U.S. Duration Seen Attractive Long-Term, Less So Short-Term — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1047 ET - Duration from a long-term perspective looks attractive, although the tactical--or short-term--case for being long U.S. duration has become more challenging, says MFS Investment Management's Benoit Anne in a note. The case for fixed income is even stronger outside of the U.S., he says. In Europe, there are strong arguments in favor of both tactical and strategic exposure to fixed income given the significant monetary policy divergence between the U.S. and the eurozone, he says. The Federal Reserve paused last week, while the European Central Bank cut interest rates by 25 basis points. (emese.bartha@wsj.com)</p><p class=\"\">1028 ET - Germany's current political turmoil, with elections to be held later this month, should have a muted impact on German government bonds, says MFS Investment Management's Annalisa Piazza in a note. \"Swap spreads have moved well in advance and are already pricing in some political and policy changes (such as more fiscal space),\" the fixed income research analyst says. MFS IM expects the German bond curve to remain the go-to safe haven among eurozone government bonds in the medium term. (emese.bartha@wsj.com)</p><p class=\"\">1008 ET - The euro has limited scope to recover even as hopes rise that the EU can avert threatened U.S. trade tariffs after President Trump postponed a levy on Canadian and Mexican imports, ING's Francesco Pesole says in a note. Trump's decision to delay tariffs on his U.S. neighbors could reflect domestic backlash over potential economic pain for U.S. consumers but the same isn't necessarily true for the EU, he says. Trump can afford to keep EU tariffs in place for a prolonged period, making the bloc feel some pain before striking a deal. \"With all this in mind, we are somewhat sceptical that the euro is bound for a major rally.\" The euro rises 0.2% to $1.0364. (renae.dyer@wsj.com)</p><p class=\"\">0956 ET - As the threat of U.S. tariffs on imports from Canada continues to loom, the ongoing uncertainty makes it challenging for small business owners to plan and make decisions on their operations, warns the Canadian Federation of Independent Business. The association, which represents about 100,000 members, said that as both countries catch their breath Canada still needs to focus on critical changes needed to prepare for the future. This, the federation suggests, means taking the opportunity now to bring in policies that improve the investment climate, reduce taxes, slash red tape and break down internal trade barriers in the country to ensure Canada is prepared no matter what external threats come its way. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0940 ET - With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0931 ET - Canada-U.S. trade uncertainty has just begun, even if a 30-day reprieve on U.S. tariffs and Canadian countermeasures has been agreed to, Scotiabank's Derek Holt says. President Trump's comments that tariffs are paused to see whether or not a final economic deal with Canada can be structured suggests the countries go into USMCA negotiations with an unrealistic timeline, the economist says. If Trump pushes for a rapid trade deal and Canada digs in over important issues, the tariff threat could be repeated. Or the next issue for the White House could be a push for an unrealistic 5% of GDP to be spent on defense spending accompanied by threatened tariffs, Holt says. \"Throughout it all, whippy markets and high uncertainty will prevail and that carries a real, tangible cost to the economy and markets.\" (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0927 ET - The market doesn't look convinced that sterling is a robust hedge against the prospect of rising U.S.-EU trade tensions, Rabobank's Jane Foley says in a note. President Trump said he would \"definitely\" impose tariffs on the EU. With the U.S. maintaining a trade surplus with the U.K., the U.K. was never going to be prominent within Trump's tariff plans, Foley says. However, the U.K. is unlikely to be able to \"side-step Trump's wrath completely.\" Trump seems willing to threaten tariffs to achieve more than economic policy goals. Sterling falls against the euro after hitting a four-week high of 0.8290 pounds on Monday, according to FactSet. EUR/GBP is last up 0.1% at 0.8319. (renae.dyer@wsj.com)</p><p class=\"\">0922 ET - The dollar recovers some ground after yesterday's choppy session, which ended with a small decline in the WSJ Dollar Index as tariffs on Mexico and Canada were delayed. The trade war with China goes on and markets remain worried about the potential fallout of a prolonged period in which tariffs would loom over the global economy. BBH says in a report that investors should look through the noise and focus on the fact that the U.S. still has strong growth and elevated inflation, \"and a more hawkish Fed continues to favor higher U.S. yields and a stronger dollar.\" The greenback strengthens 0.3 against the yen and is stable versus the euro. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0918 ET - Much of the past few days has been about gauging how inflexible the Trump administration will be on tariffs; in other words, whether they're better understood as firm policy or a negotiating tool. Quick postponements of the Canada and Mexico tariffs point to the latter category, strategist Will Compernolle of FHN Financial writes. He notes China's retaliatory tariffs against the only barriers Trump has actually implemented so far don't start until Feb. 10. That \"implies room for negotiation, something traders may take as a sign these tariffs will not be long term,\" Compernolle writes. \"The trade relationship may nevertheless be scarred, but there's a sense, rightly or wrongly, the more maximalist policies will not be the equilibrium.\" (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0835 ET - Treasury yields rise as the U.S. trade war against Mexico and Canada takes a pause while China announces retaliatory tariffs on U.S. exports. Inflation concerns are rising while it remains to be seen how the Fed will react to trade tensions. December JOLTS report is due at 10 a.m. ET. ADP employment data will come tomorrow, followed by jobless claims on Thursday and nonfarm payrolls Friday. Economists surveyed by The Wall Street Journal forecast a slowdown in job creation last month, with unemployment stable at 4.1%. The 10-year is at 4.577% and the two-year at 4.257%. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0722 ET - The U.K. might have to pick a side between the U.S. and Europe in a trade conflict even if it avoids direct U.S. tariffs, Pantheon Macroeconomics economists say in a note. \"The EU has reportedly prepared retaliation should President Trump apply tariffs to the eurozone, and we doubt the U.K. could stand neutral in the middle,\" they say. Britain is highly exposed to global trade disruption because total exports and imports are worth 64% of GDP, the economists say. The U.K. might need to take Trump's other threats, including tax cuts and deportations that threaten to raise global inflation, more seriously given that other countries could respond with fiscal stimulus. Trump's actions would be hawkish for U.K. policy, they say. (edward.frankl@wsj.com)</p><p class=\"\">0631 ET - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008087:0/",
            "pub_date": "2025-02-04 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008085:0",
            "title": "Publicis Guidance Leaves Room for Upgrades — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Publicis' guidance for 2025 and the company's track record of being conservative in its initial outlook leave room for upgrades, CFRA's Danny Yeo Sze Wai says in a research note. The French advertising group ended the year with strong momentum in the fourth quarter, when organic net revenue growth of 6.3% beat expectations. \"[Publicis] is targeting 4%-5% of organic growth in net revenue for 2025, similar to its guidance for 2024. However, we still anticipate upside potential given its history of being conservative in terms of providing future projections,\" the analyst says. Shares in Publicis rise 1.6%. (adria.calatayud@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008085:0/",
            "pub_date": "2025-02-04 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008090:0",
            "title": "Okta Price Target Maintained With a $115.00/Share by Needham",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008090:0/",
            "pub_date": "2025-02-04 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204004891:0",
            "title": "10-, 30-year yields rise as China's tariff retaliation adds to inflation concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Vivien Lou Chen and Jamie Chisholm</p><p class=\"\">Yields on long-dated U.S. government debt inched higher Tuesday morning amid fears about the possible inflationary impact of a trade war between the U.S. and China.</p><p class=\"\">What's happening</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The yield on the 2-year Treasury BX:TMUBMUSD02Y slipped less than 1 basis point to 4.257%, from 4.263% on Monday.</li><li class=\"listItem-bmN0_SHH\">The yield on the 10-year Treasury BX:TMUBMUSD10Y rose 2.4 basis points to 4.566%, from 4.542% on Monday.</li><li class=\"listItem-bmN0_SHH\">The yield on the 30-year Treasury BX:TMUBMUSD30Y rose 3.3 basis points to 4.804%, from 4.771% on Monday.</li></ul><p class=\"\">What's driving markets</p><p class=\"\">Long-term Treasury yields rose from some of their lowest levels of the year on Tuesday after China raised tariffs against U.S. energy and some vehicles, bolstering concerns that a prolonged trade war between the world's two biggest economies may increase inflationary pressures.</p><p class=\"\">See also: Trump's tariff moves upend inflation expectations in financial markets and The tariff wars aren't over. China hits back over new 10% tariffs.</p><p class=\"\">The overall market reaction - in fixed income and stocks - was relatively mild during New York morning trading compared to the volatility seen on Monday, when traders reacted to President Donald Trump's weekend announcement of U.S. tariffs on Mexico and Canada. Those tariffs ended up being delayed for 30 days.</p><p class=\"\">The calmer tone may allow investors to turn their focus to the health of the U.S. economy. The rest of the week brings a fresh batch of labor data, starting with the job openings, or JOLTs report on Tuesday at 10 a.m. Eastern time, and culminating with the January nonfarm payrolls report on Friday. Other U.S. economic data on Tuesday includes factory orders for December, released at 10 a.m. Eastern.</p><p class=\"\">\"Any strength in data will further fuel the Fed hawks and help push back the expectation of the next rate cut further down the road. For now, the first rate cut is being priced in for June,\" at the earliest, said Ipek Ozkardeskaya, a senior analyst at Swissquote Bank.</p><p class=\"\">-Vivien Lou Chen -Jamie Chisholm</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204004891:0/",
            "pub_date": "2025-02-04 23:47:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        }
    ]
}