{
  "data": [
    {
      "title": "Seven & I Takeover Proposal Tests Japan’s Commitment to M&A",
      "description": "<div><p>A proposed takeover of Seven & i Holdings Co. that could result in the sale of one of Japan’s strongest brands marks the first big test of the country’s evolving investor-friendly stance.</p><p>Canadian retailer Alimentation Couche-Tard Inc.’s proposal to buy the operator of 7-Eleven convenience stores follows the introduction last year of government guidelines on mergers and acquisitions instructing companies to seriously consider takeover offers. After years of activist investors pushing for change and unconsummated attempts from abroad to buy big companies, the deal is being  at home and abroad.</p><p>“It’s an important litmus test for Japan,” said , a portfolio manager at Indus Capital Partners who holds a position in Seven & i. “It will be looked at globally by investors and strategic buyers as to the appeal and ease of doing mergers and acquisitions in Japan.”</p><p>The new M&A guideline from the economy ministry isn’t binding, but its impact has already been seen in a handful of domestic deals with multiple competitive bidders. This will be the first major one involving a foreign firm’s proposal.</p><p>A potential obstruction for the takeover is that the Japanese government can  the deal or ask for changes in the terms, because of the fact that Seven & i is on a list of companies considered important for national security. That means officials will keep a close eye on foreign investors seeking any deal. </p><p>Seven & i shares have climbed about 14% since Couche-Tard’s proposal became public. A potential deal could be worth more than ¥5.25 trillion ($36 billion), based on the retailer’s current market value, which would be the  of a Japanese company.</p><p>Japan’s greater openness to corporate dealmaking is the latest step in a years-long effort to improve corporate governance that’s coincided with a burst of investor interest in the country, including from . It’s become the world’s  activist market in past years, driven by perceptions that shares are undervalued, companies are badly-managed and more recently, that a weakening yen would boost earnings.</p><p>Although many activists tend to focus on smaller companies with straightforward requests to raise dividends or boost buybacks, a handful of larger, well-known global firms had also been targeted with more ambitious demands for change — the most high-profile of which has been Seven & i itself.</p><p>The retailer, which has more than 21,000 stores in Japan, has been embroiled in a multiyear spat with San Francisco-based ValueAct Capital Management LP, which has publicly demanded the company spin off the 7-Eleven convenience store brand, sell non-core businesses and replace top management — with mixed success. Back in 2015, the company had contended with ’s Third Point LLC.</p><p>Couche-Tard’s bid essentially rode the coattails of activist investors this time, some say. </p><p>“ValueAct’s very public campaign effectively instigated the bid because it so clearly framed Seven & i’s shortcomings and undervaluation, and highlighted its potential,” said , a broker at CLSA in London.</p><p>Regardless what happens with the takeover proposal, analysts expect the company to make further moves to boost Seven & i’s share price, UBS analysts led by wrote in a note on Aug. 21.</p><p>Ironically, Seven & i Chief Executive Officer  was appointed in 2016 with the help of a pressure campaign from Third Point, which held a stake in the firm at the time. Isaka  after weeks of boardroom drama and the resignation of his predecessor after an unsuccessful plot to oust him from the line of succession. </p><p>Couche-Tard’s proposal for the 7-Eleven operator may also serve as a reminder to to other Japanese companies that they need to improve their business to global standards or risk losing control.</p><p>“This is a very big wake-up call because it’s an extremely big company, it’s a household name,” Smith at Indus Capital said. “It’s a reminder that there’s no better defense than a high stock price. That is the best defense you can have against an activist or against a strategic buyer.” </p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-22/seven-i-takeover-proposal-tests-japan-s-commitment-to-m-a?srnd=phx-markets"
    },
    {
      "title": "Citi, BMO Assist AIIB’s Debut $300 Million Digital Bond Issuance",
      "description": "<div><p>The Asian Infrastructure Investment Bank raised $300 million in its first bond issuance underpinned by blockchain technology, aided by Citigroup Inc. and BMO Capital Markets.</p><p>The AAA-rated note offers a 4% coupon and matures in January 2027, AIIB Treasurer  said in an interview, adding the AIIB will assess secondary market demand before deciding on further such sales next year.</p><p>The bank becomes the first Asia-based institution to issue a note on Euroclear’s distributed ledger platform, and the digital bond sale is the platform’s first in US dollars, according to a statement. Citi will help distribute the bond while settling payments with the issuer and investors, said , Citi’s global product head of agency and trust for securities services.</p><p>Citi and BMO are dealers on the transaction. Citi is also the issuing and paying agent. Digital bonds are a small but growing part of fixed-income overall, with institutions such as the  and European Investment Bank participating.</p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-22/citi-bmo-assist-aiib-s-debut-300-million-digital-bond-issuance?srnd=phx-markets"
    },
    {
      "title": "Australian Government Offers RBA Reform Deal to Opposition",
      "description": "<div><p>Australian Treasurer  said he has offered the Liberal-National opposition concessions on reforms to the Reserve Bank in an effort to secure its support for legislative changes and end a monthslong deadlock.</p><p>The overhaul of the RBA includes splitting its board into a new monetary policy committee and governance board and requires amendments to the RBA Act. Chalmers has sought the backing of the opposition to pass the bills in order to avoid dealing with minority parties that might seek more radical changes.</p><p>The opposition has demanded that all current board members be transferred to the monetary policy committee to avoid giving Chalmers the opportunity to make a lot of new appointments. The treasurer, in contrast, wanted current directors to have the option of joining either the committee or the governance board.</p><p>Chalmers on Friday announced the government will “accommodate the opposition view when it comes to the make-up of the monetary policy board,” at a press conference in Brisbane.</p><p>“In the interests of getting a deal, I have proposed everyone on the current Reserve Bank board would go on the monetary policy board unless they write and indicate a willingness” to switch to the governance board, he said.</p><p>The dual board framework was originally intended to be in place by mid-2024, but differences between the Labor government and center-right opposition delayed passage of the bills.</p><p>“It has dragged on too long and we want to get cracking,” Chalmers said. “That is why I put these proposals in good faith. The ball is now in the shadow treasurer’s court.</p><p>The opposition will take its time and work through the detail of Chalmers’ proposal, Shadow Treasurer  said in response.</p><p>“It is clear from the correspondence received yesterday that the treasurer has realized his previous positions were untenable,” Taylor said in a statement. “Despite long delays, it is promising to see movement, but we will take the time to ensure issues are resolved with due diligence.”</p><p>Under the new structure, interest-rate decision will be made by the monetary policy committee, with the RBA’s post-meeting statement likely to contain unattributed votes, as recommended by an  of the central bank last year.</p><p>The RBA review was commissioned by the Labor government after its election in May 2022 and is one of Chalmers’ signature reforms. </p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-23/australian-treasurer-offers-opposition-rba-deal-to-pass-reforms?srnd=phx-markets"
    },
    {
      "title": "European Stocks Gain as Earnings, M&A Help Rebound Gather Steam",
      "description": "<div><p>European stocks gained for a fifth straight day Monday as earnings and deal-making encouraged investors ahead of a number of key economic releases later in the week.</p><p>The Stoxx Europe 600 Index rose 0.4% at 8:06 a.m. London time, with insurance, energy and travel and leisure stocks climbing the most.</p><p>The European gauge is still down 3.2% for the month because of worries that the slowing US economy could tip into recession. Those fears have led to a selloff across markets, a turbulent start to a month in which liquidity tends to be low. </p><p>A reading on US consumer inflation due Wednesday and US initial jobless claims on Thursday will be scanned for further clues as to how the economy is holding up, and could serve as the next potential catalysts. In Europe, the latest reading for Germany’s ZEW expectations index on Tuesday and UK inflation on Wednesday also will be in focus.</p><p>“European markets continue their bounce this morning but will likely be caught between diverging macro releases this week,” , head of strategy at Panmure Liberum, said. “At the end of the day, we think investors might get whipsawed several times this week based on macro data from both sides of the Atlantic.”</p><p>Among individual movers, Hannover Rueck SE shares rose as much as 6.3% after the reinsurer’s  beat expectations, while BT Group Plc shares jumped 7.6% after Bharti Global Ltd agreed to buy a  of about 25% from Altice UK in the UK telecom company.</p><p>For more on equity markets:</p><p>You want more news on this market? Click here for a curated First Word channel of actionable news from Bloomberg and select sources. It can be customized to your preferences by clicking into Actions on the toolbar or hitting the HELP key for assistance. To subscribe to a daily list of European analyst rating changes, click here.</p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-12/european-stocks-gain-as-earnings-m-a-help-rebound-gather-steam?srnd=phx-markets"
    },
    {
      "title": "Adnoc Gas Sees LNG Usage Rising as First-Timers Enter Market",
      "description": "<div><p>Global liquefied natural gas demand is expected to increase further as more countries turn to imports for the first time, Adnoc Gas’ Chief Financial Officer Peter Van Driel said. </p><p>To tap some of these new consumers, parent company Abu Dhabi National Oil Co. is building a new plant at Ruwais that will more than double the UAE’s LNG export capacity when it starts operating in 2028. Oman and Qatar are  their LNG production facilities.</p><p>“We see growth in the United Arab Emirates economy, but equally if we look in particular at LNG, we see huge demand,” Van Driel said in an interview with Bloomberg Television on Monday. “There are many markets that are upcoming and really start to convert to LNG import markets,” he said, without naming individual countries.</p><p>The UAE firm expects global gas demand to grow 14% in the next decade, according to the company’s second-quarter financial results. That’s more bullish than other forecasts. For example, the International Energy Agency sees usage peaking by the end of this decade already.</p><p>“When we took our decision to build Ruwais LNG, we were confident of three things — we were confident that we had enough gas, we understood how much it would cost to build and we had to know we could sell all of the LNG,” Van Driel said in a roundtable with reporters. </p><p>Adnoc Gas shares gained as much as 4.3% on Monday after second-quarter  rose 21% to $1.2 billion from a year earlier. </p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-12/adnoc-gas-sees-lng-demand-rising-as-first-timers-enter-market?srnd=phx-markets"
    },
    {
      "title": "Modi Opponents Want Sebi Chief Ouster Amid Hindenburg Claim",
      "description": "<div><p>India’s political opposition is calling on the head of the nation’s stock-market regulator to resign after Hindenburg Research alleged impropriety in its investigation against the Adani Group.</p><p>In a report published Saturday, the US short seller accused the Securities and Exchange Board of India chairperson  and her husband Dhaval Buch of investing in offshore entities which were allegedly part of a fund structure related to Adani. The investments were made in 2015, two years before Buch joined Sebi as a full-time member, the report said. Buch  any wrongdoing.</p><p>“Her guilt is there for everyone to see,” , a lawmaker in India’s parliament from the All India Trinamool Congress party, told Bloomberg TV. “India’s reputation as a global market investment is at stake. We cannot be seen to be non-transparent, we cannot be seen to be opaque, we cannot be seen to be slow, we have to take quick action and clean up the system.”</p><p>, leader of opposition from the Congress party, said in a statement Sunday that the integrity of Sebi had been “gravely compromised by the allegations against its chairperson.”</p><p>Gandhi and Moitra have been fierce critics of billionaire  and his closeness to Prime Minister . Moitra was  last year from parliament for sharing sensitive information from her official parliamentary account. On her way out, Moitra claimed that her critique of Adani and his dealings were a reason behind her expulsion. She was re-elected in June.</p><p>The Adani Group has labeled the latest allegations by Hindenburg as “malicious”, and  it has “absolutely no commercial relationship with the individuals or matters mentioned in this calculated deliberate effort to malign our standing.”</p><p>Adani Group stocks fell with flagship Adani Enterprises sliding as much as 5.5% in Mumbai.</p><p>The opposition is demanding a parliamentary investigation into the allegations made by the US short seller and are also hoping for direct intervention from the country’s top court to re-open its earlier investigation.</p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-12/modi-opponents-call-for-sebi-chief-ouster-amid-hindenburg-claim?srnd=phx-markets"
    },
    {
      "title": "Gold Fields to Buy Canada’s Osisko in $1.6 Billion Deal",
      "description": "<div><p>Gold Fields Ltd. agreed to buy Canada’s Osisko Mining Inc. in a deal valued at C$2.16 billion ($1.6 billion), becoming the latest producer to seek to expand amid soaring prices for the precious metal.</p><p>The acquisition, which gives Gold Fields full control of a gold project in Canada, is the latest step by the South African miner to diversify away from the country where it made its name. That included a failed bid for Yamana Gold Inc. two years ago.</p><p>The Johannesburg-listed company will use cash to acquire all outstanding shares in the Canadian miner at a price of C$4.90 each, Gold Fields said in a statement Monday. That represents a 66.7% premium to Osisko’s closing price on Friday, according to Bloomberg’s calculations.</p><p>The deal hands Gold Fields full ownership of Canada’s Windfall gold project, currently a 50:50 joint-venture with Osisko. The company – which disposed of all but one of its South African assets a decade ago – is developing the Windfall mine to add to operations that span Peru to Australia. </p><p>“The acquisition is consistent with our strategy to improve the quality of our portfolio through investment in high-quality, long-life assets, like Windfall,” Gold Fields Chief Executive Officer  said in the statement.</p><p>Osisko’s board has unanimously recommended that shareholders vote in favor of the deal.</p><p>Gold Fields has diversified away from its base in South Africa, where producers are struggling with the challenges of extracting gold from the world’s deepest mines. In the first quarter of this year, the company’s gold production fell 18% due to weather-related events and operational challenges across its portfolio of mines.</p><p>The Osisko deal comes with gold prices near a record high that has spurred producers to do more deals.</p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-12/gold-fields-buys-canada-s-osisko-in-1-6-billion-takeover?srnd=phx-markets"
    },
    {
      "title": "Chinese Brokers Curb Bond Trading Amid PBOC Warnings on Rally",
      "description": "<div><p>At least four Chinese brokerages have started fresh measures to cut back trading of domestic government bonds beginning last week, people familiar with the matter said.</p><p>The brokers reduced the trading of sovereign debt with one of them even suspending transactions in some maturities, the people said, requesting not to be named discussing private matters. While most of the firms called it a voluntary move, one person said the change came following guidance from the authorities. </p><p>China’s 10-year bonds extended recent losses Monday after the central bank also warned about potential risks arising from the relentless rally in the debt market.</p><p>The latest developments follow sweeping efforts from the authorities to fight back against the bond rally. Yields had been hitting new lows for months amid  and bets on interest-rate cuts, but have started to climb in recent days in a sign investors are finally  of the warnings. </p><p>“The PBOC hopes to limit risks from what they deem to be excessive capital flows into the bond market,” said , Greater China chief economist at ING Bank in Hong Kong. “The threat of intervention is likely the main factor driving yields higher today, but whether or not this will last will likely depend on the actual strength of intervention.”</p><p>One of the brokers has suspended so-called bridge dealing, where the firm takes the role of a mediator for transactions, one of the people said.</p><p>Trading volumes for the most active 10-year government bonds fell to 77 billion yuan ($10.7 billion) Friday, just 45% of last week’s high reached on Tuesday, according to data from the China Foreign Exchange Trade System. </p><p>Among  to rein in bond bulls last week, state banks unexpectedly  selling seven- and 10-year bonds to push up yields, while local authorities  some rural lenders to suspend trading in sovereign debt. Regulators were also reported to have slowed the approval for new bond funds. </p><p>The People’s Bank of China on Friday used a quarterly monetary policy report to  against the risks of what it considers a bond-market bubble.  </p><p>The benchmark 10-year yield climbed four basis points Monday to 2.24%, the highest level in three weeks. That followed a gain of about seven basis points last week when the authorities  to target everything from fund companies to rural banks to arrest the rally.</p><p>The PBOC’s bid to quash the bond rally come partly from a risk management perspective, said , chief China economist at Goldman Sachs Group Inc. in Hong Kong, speaking on Bloomberg Television. The policy action “is just managing the pace of long-term yield decline rather than reversing” it, she said.</p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-12/chinese-brokers-curb-bond-trading-amid-warnings-on-rally?srnd=phx-markets"
    },
    {
      "title": "Sasol Says $3 Billion of Impairments Will Hit Its Earnings",
      "description": "<div><p>South African fuel and chemical maker Sasol Ltd. said 55.1 billion rand ($3 billion) of impairments at its American and South African businesses will hurt its full-year earnings. </p><p>The basic loss per share for the year to June 30 will be in a range of 68.82 rand to 71.48 rand compared with profit of 14 rand a year earlier, the Johannesburg-based company said in a  Monday. </p><p>Sasol wrote down the value of its Chemicals America ethane value-chain unit by 45.5 billion rand net of tax, primarily due to external conditions “including prolonged softer market pricing and outlook.” </p><p>The impairment on its polyethylene, chlor-alkali and polyvinyl chloride and wax value chain in the Africa chemicals business was 3.9 billion rand net of tax, while the Secunda liquid-fuels refinery in South Africa took a 5.7 billion-rand writedown.</p><p>Sasol, which manufactures liquid fuels from coal, reported issues throughout its South African operations earlier this year.</p><p>So-called headline earnings per share likely fell to a range of 12.28 rand and 21.95 rand, representing a drop of as much as 77% from a year earlier, Sasol said. The average estimate by analysts on Bloomberg is for 40.86 rand. </p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-12/sasol-to-report-full-year-loss-on-3-billion-of-impairments?srnd=phx-markets"
    },
    {
      "title": "Adani Stocks Drop as Hindenburg Row With India Regulator Worsens",
      "description": "<div><p>Adani Group’s stocks fell after Hindenburg Research accused India’s chief market regulator of having conflicts of interest that prevented a thorough probe into fraud allegations against the conglomerate.</p><p>Shares of Adani Enterprises Ltd., the group’s flagship, slid as much as 5.5% in early trading on Monday. Adani Energy Solutions Ltd. plunged as much as 17% before paring the bulk of the loss, with all but one of the conglomerate’s 10 stocks trading lower. The benchmark NSE Nifty 50 Index recouped initial losses to trade higher in line with other Asian markets.</p><p>In a report published Saturday, Hindenburg said Madhabi Puri Buch — the chairperson of the Securities and Exchange Board of India — and her husband, Dhaval Buch, invested in offshore entities that were allegedly part of a fund structure in which Vinod Adani — the brother of billionaire Gautam Adani — also had investments. Buch denied wrongdoing.</p><p>“Short-term volatility is inevitable as investors grapple with the veracity of these claims,” said , founder and fund Manager at Wright Research. “If substantiated, the allegations could erode investor trust, deter foreign capital, and necessitate stringent regulatory overhauls.”</p><p>The investments by the couple were made in 2015, two years before Buch joined Sebi, Hindenburg said, citing whistleblower information and other documents Bloomberg wasn’t able to verify. The fund structure is managed by India Infoline, a financial services and wealth management firm. Buch was appointed a full-time member of Sebi in 2017. In 2022, she was named chair.</p><p>The face-off between Hindenburg and Sebi has escalated weeks after the US firm was queried by the Indian regulator about its report against Adani in early 2023, which erased more than $150 billion in combined market value at one point. The revelation also led India’s top court to order a Sebi probe on possible violations and any suspicious trading activity. Sebi has yet to make a case against the Adani Group.</p><p>Read: </p><p>The latest accusations come as the conglomerate embarks on a fundraising drive. Earlier this month, Adani Energy  $1 billion selling shares to institutions, and the group’s flagship is raising around 100 billion rupees ($1.2 billion) to 120 billion rupees.    </p><p>In 2023, Adani Enterprises  its $2.4 billion share sale amid a meltdown in its group firms’ shares following the release of Hindenburg’s report that accused the group of corporate malfeasance.   </p><p>“There has been much chatter and discourse over the weekend, but I don’t believe that there will be much impact given that this is an ongoing story and the element of surprise is relatively muted,” said , co-founder at First Water Capital.</p></div>",
      "link": "https://www.bloomberg.com/news/articles/2024-08-12/adani-stocks-drop-as-hindenburg-row-with-india-regulator-worsens?srnd=phx-markets"
    }
  ]
}
