{
    "data": [
        {
            "title": "韓國股市升勢48%冠全球 三大因素點燃韓大牛市 兩大巨企港股可買 今年均升逾100%",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>踏入2026年僅兩個月，韓國的綜合股價指數（KOSPI）已大升48%，同期港股恒生指數升3.9%，美股標普500指數僅升0.49%，韓股表現今年來跑贏全球大部分主要市場之外，整體市值已超越法國和德國，成為全球第九大股票市場。KOSPI指數狂飆背後，除了AI算力需求大增令重磅的半導體股急升；韓國政府推動的金融改革，以及國民資金大舉流入，也是推升韓股的主要因素。</p><p>韓股急升的行情去年已啟動，KOSPI指數從年初2400點起步，年底收報4214點，全年升逾75%，為1999年以來最大漲幅。進入2026年，韓股升勢進一步加速，周三（2月25日）首次突破6000點大關，周四（2月26日）更創下6307點的歷史新高。</p><p>半導體板塊是韓股升市功臣，當中全球最大存儲晶片商三星電子（韓股編號：005930）今年來升近七成；英偉達的主要供應商、另一存儲晶片商SK海力士（韓股編號：000660）年內亦升逾六成。除了大幅跑贏韓股大市，且兩間公司合計市值高達1.3萬億美元，佔韓股總市值的35%。</p><h2>因素一：AI需求爆發提振硬件股</h2><p>韓股過去兩年表現一枝獨秀，跑贏全球股市，全因三大利好因素疊加。首先，全球AI產業、AI技術快速發展帶動算力需求爆發，推動高帶寬內存HBM、傳統DRAM等存儲晶片的需求與價格齊升，存儲半導體行業迎來超級周期。有分析指，近期人工智能威脅各行各業的「AI恐慌交易」籠罩著華爾街，但亞洲股市卻不受影響，韓股便以硬件製造業為主、軟件股佔比較低。</p><p>相閞文章：<a href=\"https://www.stheadline.com/realtime-finance/3547808/\">Sandisk與SK海力士合作 啟動「HBF標準化」</a></p><h2>因素二：韓國金融改革提振估值</h2><p>同時，韓國政府推行的一系列金融改革，正逐步提振估值。韓國總統李在明上任後，推動建立公平的股東競爭環境、強化董事會問責制；韓國國會已於今年2月25日表決通過《商法》修正案，強制上市公司在取得庫存股後1年內進行註銷，旨在改善公司治理並提振股市估值，逐步改善長期估值偏低的局面。</p><h2>因素三：內外資金流入撐起升勢</h2><p>此外，堅實的資金面支撐亦確保了韓股升勢。本土資金方面，過去韓國家庭資產重視房地產，如今正向金融資產轉移，為韓股帶來更多增量資金入場。野村證券指出，2024年初至2026年1月，韓國投資者存款從50萬億韓元飆升至106萬億韓元，五大銀行活期存款單月減少22萬億韓元，大量資金從銀行大舉流入股市。</p><p>外資方面，2025年外國投資者對韓股的投資額增至1327萬億韓元，幾乎是2024年的兩倍，外資持股市值佔比也從2024年的27%升至2025年30.8%，其中持有546萬億韓元的美國投資者成為主要資金來源。</p><h2>大行上望8000點 料EPS升129%</h2><p>有大行看好韓股可更上一層樓。野村證券日前的報告，將2026年上半年KOSPI指數目標點位上調至7500至8000點區間，意味著KOSPI指數仍有23%至31%的上漲空間。該行預計，2026年韓股每股收益（EPS）將按年暴增129%，其中存儲半導體企業將貢獻全市場64%的淨利潤。斐波那契資產管理全球公司首席執行官Jung In Yun則認為，韓股要進一步上漲將取決於企業盈利兌現情況，以及升市能否從少數半導體巨頭，擴散至更廣泛的板塊。</p><h2>港股可買三星及SK海力士2x產品</h2><p>韓股過去兩年大升，全憑三星電子及SK海力士兩大巨頭帶動。有資產管理公司去年在港股市場推出三星電子及SK海力士的每日槓桿(2x)產品，分別是南方東英三星電子每日槓桿(2x)產品（7747）及南方東英SK海力士每日槓桿(2x)產品（7709），它們以掉期為基礎的合成模擬策略，盡量貼近相關股票每日表現的兩倍；兩隻產品今年來分別升212%及146%。</p><p>該公司亦有推出三星的兩倍反向產品，名為南方東英三星電子每日反向(-2x)產品（7347），由於是押注三星股價向下，該產品今年來大跌74.8%。<br/> </p>\n</div>",
            "link": "https://www.stheadline.com/investment/3548429/韓國股市升勢48冠全球-三大因素點燃韓大牛市-兩大巨企港股可買-今年均升逾100",
            "pub_date": "2026-03-01 06:11:42",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "1月新申請住宅按揭貸款宗數增逾15%",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>金管局公布，今年1月新申請住宅按揭貸款個案按月增加15.4%，至8785宗。另外，截至1月底，外匯基金總資產為42856億元，較去年底增加1342億元，其中外幣資產增加1070億元，主要是因為已購入但未結算證券的月底餘額增加、利息收入及投資按市價重估，以及發行負債證明書；港元資產增加272億元，主要是因為銀行存款增加及香港股票按市價重估。</p><p>今年1月新批出的按揭貸款額按月增加4.1%，至325億元。當中，涉及一手市場交易所批出的貸款減少3.1%，至113億元；二手市場交易所批出的貸款增加8.6%，至183億元；轉按交易所批出的貸款增加7.1%，至29億元。</p>\n</div>",
            "link": "https://www.stheadline.com/macroeconomics/3548361/1月新申請住宅按揭貸款宗數增逾15",
            "pub_date": "2026-02-28 09:45:50",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "伊朗局勢︱美以空襲伊朗 比特幣急挫6% OPEC+研更大幅度增產",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>據報以色列對伊朗發動襲擊，比特幣急挫逾6%，最新報63661美元。以太幣跌逾8.5%，至1861美元。</p><p>另外彭博引述消息指，在以色列對伊朗目標發動空襲後，OPEC+將在周日關鍵成員會議上考慮更大幅度的增產。</p><p>由沙地阿拉伯和俄羅斯領導的OPEC+原本預計在三個月的凍結產量後，從四月開始恢復溫和的增產，幾位代表本周較早時表示。在去年第四季度，他們曾以每日13.7萬桶的幅度逐月增加產量。</p><p>新華社報道，德黑蘭市中心傳出爆炸聲，據報伊朗最高領袖辦公室附近遭襲；以色列國防部長稱，以色列已對伊朗發動襲擊，並宣布全國進入緊急狀態。</p><p>相關文章：<a href=\"https://www.stheadline.com/realtime-world/3548402/\">伊朗局勢︱美國以色列聯手發動空襲 以色列監測到伊朗發射飛彈</a></p><p>在襲擊發生前，黃金、白銀、原油周五已率先上升，金價升近1.8%，收報每盎司5280美元，白銀升逾6%至接近93.78美元。紐約期油升2.78%至每桶67美元；倫敦期油升2.87%至72.87美元。</p><p> </p><p> </p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548408/伊朗局勢美以空襲伊朗-比特幣急挫6-OPEC研更大幅度增產",
            "pub_date": "2026-02-28 16:46:40",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "回鄉過年驚現天價「劏客」 縣城「面子型消費」推升物價 「貴的更貴，卷的更卷」",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>「廣州剪髮49元，老家卻要79元」、「海南陵水年夜飯888元一位」、「山西過年辣椒炒肉盛惠230元一碟」……春節返鄉潮期間，內地社交媒體湧現「縣城物價高於一線城市」的熱議，不少回鄉年輕人慨歎，在老家花錢竟比廣州、深圳更「肉赤」，引發廣泛共鳴。事實上，這股「逆向價差」並非春節限定。市場研究機構數據顯示，2023至2025年，縣級市快消物價指數連續3年高於全國平均，與北上廣深幾近持平。專家分析，流通效率低、「面子型消費」結構、競爭不充分及消費升級等因素，共同推高縣城物價。</p><p><strong>記者 梁秋夢</strong></p><p>在安徽合肥打工的一網友分享，回縣城數日，發現羽絨服逾千元一件，折後仍900多元；耙耙柑每斤10元，購8個需48元，蛋糕切件每件30元起，菜肉價格同樣與省城合肥相若。河南有返鄉年輕人表示，一線城市的咖啡、品牌奶茶經團購後價格相宜，反觀小城市同類消費價格偏高。</p><h2>縣城物價比肩北上廣深</h2><p>年夜飯價格同樣成為熱話，「縣城2888元一頓的年夜飯是誰在吃」等詞條登上微博熱搜。有網民分享，海南陵水縣城年夜飯不設套餐，按人頭收費888元一位；平時物美價廉的北方縣城，過年期間亦「褪去純樸面具」，山西某縣城過年菜譜上，肉菜平均168元，辣椒炒肉盛惠230元一碟，有餐廳更要指定菜譜點餐。</p><p>這種「反向價差」並非過年限定現象，市場研究機構尼爾森IQ數據顯示，2023至2025年，縣級市的快消物價指數連續3年高於全國平均水平，物價倒掛最明顯的類別為個人護理產品，縣域市場較一二線城市高出4個百分點，以牙膏為例，一線城市商超售價普遍低於縣城。</p><p>經濟學家宋清輝認為，縣城物價高企背後有4大因素。一是流通效率低加上規模效應弱，一線城市有大賣場、社區團購、即時零售平台壓價，縣城渠道層級多、銷量小，難攤薄成本。二是「面子型消費」結構，婚宴、壽宴推高酒水、禮盒類單價，消費者更看重品牌象徵而非性價比。三是競爭不充分，縣域商超集中度高，頭部經銷商議價能力強，價格相對「硬淨」。四是消費升級疊加品牌下沈，品牌將高端線產品分銷至縣城，但價格體系未完全對標一線城市的促銷力度，形成「價格倒掛」。加上物流倉儲成本、促銷資源分配不均等因素，共同推高縣城物價。</p><p>縣城物價高企，背後與當地居民悄然「超車」的購買力也息息相關。內地研究機構灼識諮詢測算，2023至2028年，三線及以下城市居民可支配收入增速為5.9%，高於一線、新一線及二線城市。國家統計局數據亦顯示，縣城級消費對整體市場的貢獻持續提升，2019至2024年，縣鄉社會消費品零售總額佔全國比重由36.8%升至38.8%。</p><p>按地域劃分，高收入縣域高度集中在東部沿海。數據顯示，高收入前百強縣城中，前30強席位幾乎由浙江（23席）與江蘇（6席）包攬，僅福建省石獅市（第13名）躋身其中。浙江義烏以88048元居民可支配收入高居榜首，領先第二近萬元，更超越北京的85415元，堪稱「縣域收入天花板」。</p><h2>居民購買力悄然「超車」</h2><p>縣城中產的強勁購買力，直接養活一批山姆代購。小紅書、抖音上關於山姆代購的話題持續走熱，就連三四線城市與縣城街頭，也出現掛著「山姆甄選店」「山姆優選」招牌的仿會員門店。</p><p>這股由縣城牽引的消費浪潮，早已被企業捕捉。百勝中國是一個典型案例，其2025年淨增門店1706家，肯德基加盟店佔淨增37%，肯悅咖啡由700家擴至2200家；必勝客WOW進入逾千城鎮。集團預計，2026年淨增門店逾1900家。從「要不要下沉」到「如何下沉更快」，連鎖巨頭的布局節奏，正是對縣城購買力最務實的背書。</p><h2>學者：消費分層更明顯</h2><p>展望未來，宋清輝認為，未來5年縣城物價大概率仍有繼續上升的潛力。一方面，若縣域收入繼續改善、宴席文化不減，酒類和個人護理等「象徵性消費」仍有溫和上升空間。另一方面，數字零售下沉、社區團購普及，亦會壓縮渠道溢價；平台直供和產地直採可能削弱傳統經銷商利潤空間。</p><p>他預測，更有可能的走勢是高端化帶來結構性漲價，但大眾品類競爭加劇、漲幅趨緩，「縣城物價未必全面飆升，但消費分層會更明顯，該貴的更貴，該卷的更卷。」</p>\n</div>",
            "link": "https://www.stheadline.com/macroeconomics/3548403/回鄉過年驚現天價劏客縣城面子型消費推升物價-貴的更貴卷的更卷",
            "pub_date": "2026-02-28 14:41:09",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "伊朗局勢︱伊朗或封鎖霍爾木茲海峽報復 恐打擊歐美中能源供應 油價料倍升至150美元",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>美國及以色列聯手空襲伊朗，有分析指伊朗或會試圖封鎖或關閉霍爾木茲海峽，作為報復。由於這條位於波斯灣口的狹窄水道承擔了全球約四分之一的海運石油貿易。如果伊朗拒絕讓巨型運油輪通行，將阻止中東石油和天然氣運往中國、歐洲、美國及其他主要能源消費國，這種中斷勢將引發油價飆升一倍，至每桶120至150美元，並動搖全球經濟。</p><h2>全球石油貿易重要通道</h2><p>霍爾木茲海峽位於伊朗與阿曼及阿聯酋之間，是全球石油貿易的重要通道。波斯灣周邊大多數供應國沒有其他海上出口路線。據彭博報道及其數據，2025年每天約有1670萬桶原油和凝析油經由此海峽運輸。沙地阿拉伯、伊拉克、科威特、阿聯酋和伊朗都依靠霍爾木茲出口石油，其中大部分運往亞洲。</p><p>這條水道對液化天然氣市場同樣至關重要。去年，全球近五分之一的液化天然氣供應經由此通道。</p><h2>船隻易受導彈或遭攔截</h2><p>霍爾木茲海峽全長近100英里（161公里），最窄處寬21英里。雙向航道各僅兩英里寬。水道淺，使船隻易受水雷威脅；而且其靠近陸地，尤其是伊朗，則使船隻容易遭受岸基導彈攻擊或被巡邏艇、直升機攔截。</p><p>據《聯合國海洋法公約》，各國可在距海岸12海里（14英里）範圍內行使主權——這一距離小於霍爾木茲最窄處的寬度。各國必須允許外國船隻「無害通過」其領海，不得阻礙用於國際航行的海峽的「無害」或「過境通行」。伊朗於1982年簽署了該條約，但尚未由議會批准。</p><p>伊朗政府在過去地緣政治緊張時期曾表示有能力實施海上封鎖。但它從未真正完全切斷海峽通行。</p><p>相關文章：<a href=\"https://www.stheadline.com/realtime-world/3548402/\">伊朗局勢︱美國以色列聯手發動空襲 內塔尼亞胡：目標推翻政權</a></p><h2>可導彈或無人機攻擊油輪</h2><p>若伊朗試圖封鎖或關閉霍爾木茲海峽，憑藉其地理優勢有多種選項，包括快艇騷擾，到更極端的使用導彈和無人機攻擊油輪，均可使商船不敢通行。伊朗亦可布置水雷，但報道指這會危及自身船隻，因此可能性較低。</p><h2>干擾船隻全球定位系統訊號</h2><p>另一破壞手段是干擾船隻全球定位系統訊號，此戰術正被世界各地的國家和組織用於來破壞航行。去年6月伊朗與以色列衝突期間，數千艘船隻在霍爾木茲海峽及周邊遭遇干擾。<br/>  <br/>報道指，如果通行霍爾木茲海峽變得危險，船隻可能只能在西方國家海軍護航下成群通過。這會減慢航運交通，但不會顯著影響全球石油供應。</p><h2>海峽關閉數日恐致油價飆升</h2><p>若海峽完全關閉超過數天，對能源市場而言是噩夢。Kpler公司的原油分析師在去年6月估計，伊朗僅封鎖一天就可能使油價飆升至每桶120至150美元。布倫特原油周五收報72.87美元，升2.87%，即較現時油價或大升一倍。</p><p>不過，封鎖霍爾木茲也會迅速打擊伊朗自身經濟，因其將無法出口石油。中東石油流動的中斷還可能影響伊朗原油最大買家的中國。</p><p>而在以色列對伊朗目標發動空襲後，彭博引述消息指OPEC+將在周日關鍵成員會議上考慮更大幅度的增產。</p><p>相關文章：<a href=\"https://www.stheadline.com/realtime-finance/3548408/\">伊朗局勢︱美以空襲伊朗 比特幣急挫6% OPEC+研更大幅度增產</a></p><p> </p>\n</div>",
            "link": "https://www.stheadline.com/macroeconomics/3548448/伊朗局勢伊朗或封鎖霍爾木茲海峽報復-恐打擊歐美中能源供應-油價料倍升至150美元",
            "pub_date": "2026-02-28 17:26:33",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "長和巴拿馬港口遭強行接管 狠批政府漠視法治 聲明指控：強闖設施檢走法律密件",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>長和（001）旗下巴拿馬港口公司（PPC）於當地時間27日，就港口業務發出措辭嚴厲的聲明，指控巴拿馬政府近期採取連串行動「強行霸佔並接管」其港口資產，當中包括強闖私人設施以檢取受法律保護的文件。PPC狠批當地官員「日復日漠視法治原則」，令外國投資者無法依賴其法律制度，並預告將尋求國際司法或仲裁，追究巴拿馬政府的責任。</p><h2>政府強闖設施 檢走法律文件</h2><p>據PPC的聲明，巴拿馬政府的行動在上週逐步升級，至本月26日更採取「極端行動」。在事前未有發出任何通知下，政府人員「強行闖入一個私人儲存設施」，並取走屬於PPC的財產。聲明特別指出，該批財產包括公司的專有資料，以及一批為正在進行的法律程序而準備、並受法律特權保護的重要材料。PPC直斥，此舉顯示巴拿馬政府為推進其接管行動，「不惜破壞正當法律程序」。</p><p>PPC續指，自上週五（23日）清晨起，政府已下令停止PPC旗下兩大主要貨櫃碼頭，即巴爾博亞港（Balboa）和克里斯托瓦爾港（Cristóbal）的營運，其後更有政府人員強行進入公司設施，干擾營運，甚至威脅對PPC的巴拿馬籍員工提出刑事檢控。</p><p>相關報道：<a href=\"https://www.stheadline.com/realtime-finance/3548187/%E5%B7%B4%E6%8B%BF%E9%A6%AC%E7%95%B6%E5%B1%80%E6%90%9C%E6%9F%A5%E9%95%B7%E5%92%8C%E6%97%97%E4%B8%8B%E5%B7%B4%E6%8B%BF%E9%A6%AC%E6%B8%AF%E5%8F%A3%E5%85%AC%E5%8F%B8\">巴拿馬當局搜查長和旗下巴拿馬港口公司</a></p><h2>質疑司法程序 斥官員預知裁決</h2><p>聲明更揭露，PPC指控巴拿馬政府的行動早有預謀，懷疑其透過「操縱法律程序」以圖摧毀其特許經營合約。PPC引述消息指，有行政部門官員曾向外界公然透露，他們「事先知悉」一項對PPC不利的法院裁決結果，而時間點遠早於該裁決正式公告前數個月，令人質疑司法程序的公正性。</p><p>PPC在聲明中強調，巴拿馬政府的行為，已未能遵守其在憲法、契約法與國際法層面所承擔的義務，當中包括關乎投資保障及法律安定性的原則。PPC及其投資者表明，就此等由巴拿馬政府一手造成的危機，「持續保留一切相關權利」，並將促使巴拿馬政府為其言行承擔全部責任。</p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548461/長和巴拿馬港口遭強行接管-狠批政府漠視法治-聲明指控強闖設施檢走法律密件",
            "pub_date": "2026-02-28 18:56:42",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "以色列襲擊伊朗 比特幣急挫6% 跌穿6.4萬美元",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>據報以色列對伊朗發動襲擊，比特幣急挫逾6%，最新報63635美元。以太幣跌逾8%，至1858美元。</p><p>新華社報道，德黑蘭市中心傳出爆炸聲，據報伊朗最高領袖辦公室附近遭襲；以色列國防部長稱，以色列已對伊朗發動襲擊，並宣布全國進入緊急狀態。</p><p>在襲擊發生前，黃金、白銀、原油周五已率先上升，金價升近1.8%，收報每盎司5280美元，白銀升逾6%至接近93.78美元。紐約期油升2.78%至每桶67美元；倫敦期油升2.87%至72.87美元。<br/> </p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548408/以色列襲擊伊朗-比特幣急挫6-跌穿64萬美元",
            "pub_date": "2026-02-28 15:05:54",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "OpenAI與美國戰爭部達協議 「模型將部署到其機密網絡」",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>OpenAI表示已與美國戰爭部達成協議，將在其機密網路中部署模型。OpenAI行政總裁奧特曼（Sam Altman）在社交平台X上發文指，OpenAI最重要的兩項安全原則是：禁止國內大規模監控，以及在人類使用武力（包括自主武器系統）時必須承擔責任。</p><p>奧特曼表示：「戰爭部同意這些原則，並在法律與政策中反映出來，我們也將其納入協議之中。」他又指OpenAI還將建立技術防護措施，以確保模型的行為符合預期，「這也是戰爭部所要求的。」</p><p>另一AI初創公司Anthropic因拒絕五角大樓要求，讓其無條件軍事使用Claude模型後，美國總統特朗普周五（27日）指示所有聯邦政府機構立即停用Anthropic技術，並說國防部等機構將有6個月的過渡汰換期，甚至威脅若該公司不配合，將面臨嚴厲的法律後果。</p><p>相關文章：<a href=\"https://www.stheadline.com/realtime-world/3548363/\">Anthropic拒解除軍用限制 特朗普下令聯邦機構立即停用Claude</a><br/><br/> </p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548380/OpenAI與美國戰爭部達協議-模型將部署到其機密網絡",
            "pub_date": "2026-02-28 12:01:00",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "OpenAI完成1100億美元融資 亞馬遜承諾出資500億美元",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>OpenAI宣布完成規模高達1100億美元的融資，使其估值達到7,300美元。亞馬遜在這輪融資中投入了500億美元，是這間電商巨頭至今對任何公司投入的最大金額。OpenAI表示，亞馬遜將先承諾150億美元，隨後在達成某些條件後再投入350億美元。</p><h2>額外投資取決於OpenAI上市</h2><p>彭博引述知情人士報道，亞馬遜的額外投資取決於OpenAI是否推進上市，或實現「通用人工智慧」（AGI）的進程。亞馬遜表示，如果OpenAI上市，它必須承諾剩餘的投資。</p><h2>軟銀英偉達各投資300億美元</h2><p>據OpenAI公佈，軟銀集團及英偉達各自投資了300億美元。不過該公司新的7,300億美元估值未包括這筆融資。在融資完成後，其估值更達到8,400億美元。</p><p>知情人士又透露，OpenAI預計隨著融資進展，還將從創投公司和主權基金籌集大約100億美元。該人士表示，計劃在3月底前完成這輪融資。</p><p>另外，來自亞馬遜的大額投資也加深了其與OpenAI的關係。根據協議，OpenAI將使用亞馬遜自研的AI晶片「Trainium」，並與亞馬遜的工程團隊共同開發定制模型。OpenAI還將在未來八年內額外在亞馬遜雲端服務（AWS）上花費1,000億美元。兩家公司在去年 11 月宣布了一項協議，OpenAI將在七年內使用約380億美元的AWS服務。</p><p>OpenAI行政總裁奧特曼（Sam Altman）周五向CNBC表示，亞馬遜能在市場需求和機會方面為公司帶來很多助力。亞馬遜行政總裁賈西（Andy Jassy）則說，這筆交易「將在長期內為亞馬遜帶來良好的回報」。至於英偉達則在聲明中表示，OpenAI計劃部署5吉瓦的Nvidia Vera Rubin 硬體，用於訓練和運行其模型。</p><h2>微軟：與OpenAI合作不變</h2><p>微軟是OpenAI之前最大的支持者之一、曾經的獨家基礎設施合作夥伴，該公司表示其與OpenAI的關係依然穩固。兩家公司在周五的聯合聲明中表示：「今天的公告不會以任何方式改變微軟與OpenAI的合作條款。」<br/> </p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548377/OpenAI完成1100億美元融資-亞馬遜承諾出資500億美元",
            "pub_date": "2026-02-28 11:35:53",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "SpaceX據報最快3月秘密提交上市草案",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>彭博引述知情人士報道，全球首富馬斯克旗下SpaceX考慮最快在3月秘密提交IPO上市文件。</p><p>知情人士指，SpaceX預計將於3月向美國證券交易委員會提交IPO註冊草案，有望在6月掛牌上市。連同OpenAI和Anthropic可能緊隨其後上市，美國今年或迎來3宗超大型IPO。</p><p>報道又指，SpaceX的IPO估值可能超過1.75萬億美元。早前有報道指，SpaceX在2月收購馬斯克旗下人工智能初創公司xAI，合併後實體的估值達到1.25萬億美元。</p><p>在秘密提交IPO程序下，公司可以先接收監管機構的回應並進行修改，之後才會公開上市資訊。</p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548365/SpaceX據報最快3月秘密提交上市草案",
            "pub_date": "2026-02-28 10:16:25",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "小朋友利是錢大豐收 父母全數買美股掀討論 理財專家︰學懂半花半儲更重要",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>農曆新年剛過，小朋友的利是「大豐收」，家長如何引導子女善用這筆資金，成為理財教育的重要一課。有年輕夫婦分享，其剛出生的嬰兒收到約一萬元的利是錢，打算全數買入美股VOO（追蹤標普500指數的ETF），並計劃日後持續月供，待孩子18歲成年後才取出，引起不少討論。究竟這種「全倉美股」的策略是否穩健？若家長「心臟不夠強大」、怕美股大幅波動，又應如何配置？認可財務策劃師李澄幸接受《星島頭條》訪問時認為，美股ETF本身已由一籃子股票組成，做法可取，但仍可進一步分散投資。</p><h2>宜分散兩至三個市場</h2><p>李澄幸指出，若假設家長是幫子女的利是錢存起來，投資相比存放家中或銀行活期戶口更為可取。因儲蓄起來不外乎幾個選擇，一是利是放在家，不然就是放銀行戶口，因此投資較為可取。</p><p>對於有新手家長將孩子的利是錢，全數押注美股ETF的VOO。他指出，VOO是一籃子股票組合，本身已相對穩健。若家長計劃持續月供，李澄幸建議可考慮進一步分散投資，除了美股外，亦可加入亞洲及歐洲市場的ETF，例如以「美股、亞洲、歐洲」各佔一定比例。</p><p>他又提醒家長需定期檢視組合，當孩子接近18歲、即將需要用錢時，應提早在幾年前開始將資產轉移至債券等較低風險、相對不太波動的資產。</p><h2>不熟美股可選債券基金 </h2><p>不過，並非所有家長都熟悉美股，亦有人擔心風險過高，李澄幸建議這類人考慮債券基金作替代品。因銀行定存雖然保本，但長遠息口未必能維持高位，債券基金風險程度相對較中性。</p><p>他又分析，「不熟悉」可分為三個層次：一是不知買甚麼股票，二是不知何時買入，三是不了解自己的風險承受能力。「如果用ETF或基金，理論上一籃子就不需要去特定挑選股票；如果真的月供又有紀律，風險相對亦較可控。」但若家長屬於第三種情況，例如見到戶口跌10%便感到焦慮，他則建議採取更保守策略。</p><h2>利是錢學儲蓄也學消費</h2><p>對於應否為子女開立銀行戶口，李澄幸非常贊成，讓小朋友認識金錢，以及學習管理自己的金錢，「儲錢在銀行戶口裡面，其實小朋友會知道有利息，雖然利息不顯著，但讓他知道真實的（銀行）運作。」</p><p>若已經擁有金錢概念的小學生，收到約1萬元利是錢可如何分配？李澄幸建議採取「一半一半」方法，可鼓勵他儲起一半的利是錢，另一半則用於消費，因利是錢對小朋友而言是一筆「比較大的錢」，是好好學習理財的第一堂課。除了學儲蓄，學習用錢「消費」這個行為也很重要。若利是金額較大，家長可因應實際情況調整作引導。例如詢問小朋友有甚麼想買，看看會用上多少錢，也是學習「財政預算」的好機會。</p><p> </p>\n</div>",
            "link": "https://www.stheadline.com/investment/3548189/小朋友利是錢大豐收-父母全數買美股掀討論-理財專家學懂半花半儲更重要",
            "pub_date": "2026-02-28 06:06:05",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "鱷王警告國際秩序或瓦解 分析大周期「第六階段」 亂世首選黃金守住財富",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>大國博弈日趨激烈，全球局勢動盪加劇，二戰後國際秩序或將面臨前所未有的瓦解危機，有「鱷王」之稱的橋水基金創辦人達里奧（Ray Dalio）早前更發出警告，世界已正式進入其「大周期」理論中的「第六階段」，亦即一個規則失效、強權即公理的混亂時期，大國之間的衝突將不再受法律約束，而是回歸原始的權力博弈。不過，達里奧口中的「六個階段」是甚麼？倘若真的來臨，投資者又該如何在動盪中守住財富？</p><h2>每輪周期或持續75至100年</h2><p>按照達里奧的世界秩序大循環理論，每一輪大循環周期大約持續75至100年，當前處於這一輪長周期的末期，也就是他所定義的第五和第六階段；若以1945年二戰結束計，即2020年至2045年將出現新一個周期，換言之，全球目前有機會已陷入一個周期的末段。</p><p>達里奧將大循環過程拆解為6個階段，第一階段是「新秩序開始」，即上一場衝突結束，新強權確立統治地位，重新建立秩序，例如二戰結束後，布雷頓森林體系確立了美元核心地位；當體系逐步穩固，來到「資源配置與體系建立」的第二階段，這時財富與權力將會集中；隨之進入第三階段，即和平的「繁榮期」 ，國家處於巔峰，和平與經濟繁榮，技術與文明發展；但繁榮最終因過度消費、高槓桿與債務積累，將走向「泡沫與債務擴張」的第四階段，金融資本的狂熱令資產價格過度偏離賬面價值，例如日本泡沫經濟、1997年和2008年多次全球金融危機等，都是這一階段的產物。</p><p>隨著貧富差距擴大、民粹主義抬頭、外部競爭力量崛起，世界進入第五階段，即「衝突與動盪期」；最終舊規則失效，大國對抗加劇，貿戰、金融戰、科技戰相互疊加，將推動全球進入舊秩序瓦解、新秩序誕生的「第六階段」。在他看來，如今世界已經進入了這一階段，規則讓位於權力博弈，國家安全將優先於市場效率。</p><h2>對抗成常態 跨國企業受衝擊</h2><p>達里奧的文章指出，人類曾試圖通過國際聯盟、聯合國等組織規範世界秩序，但當單個國家權力淩駕於整體國家之上，強權統治便難以避免，平等的財富與權力分配幾乎無法無鬥爭實現。在此背景下，國際關係將回歸「叢林法則」，大國衝突時不會尋求法律途徑，而是通過威脅或戰爭解決，意味貿易、技術、地緣政治、資本等領域的對抗將成為常態，並可能升級為軍事衝突。</p><p>參考目前形勢，部份對抗形態早有顯現，美國早對包括電動車、半導體、鋼鐵、鋁和關鍵礦產在內的多個戰略類別商品實施了301條款關稅調整，亦持續加緊對中國等國如AI晶片的先進計算及半導體製造設備實施嚴格出口管制。隨着更多技術戰或資本戰的出現，意味供應鏈成本上升，對企業成本和利潤率產生衝擊，跨境交易或會減少，跨國企業發展將受到較大阻礙。</p><h2>各國失去互信恐現愚蠢戰爭</h2><p>在達里奧看來，目前全球大國博弈正陷入「囚徒困境」，即無法確信對方不會發動攻擊，因而被迫採取針鋒相對的升級策略。他認為，雖然國家之間的衝突大多數旨在爭奪財富和權力，但一旦升級為軍事戰爭，所有維度的衝突都將被極大化。而「贏得」戰爭的關鍵是在於不失去核心利益的前提下達成目標，但歷史上往往充斥着誤判和情緒化決策的「愚蠢戰爭」。</p><p>雖然這些「愚蠢戰爭」未知是否真的會來臨，惟不少網上意見均認同其強權主導的觀點，並總結為「強者為所欲為，弱者受苦受難」；但也有聲音指其以歐洲為中心的盲點，忽略了近代史上太平天國運動及非洲殖民戰爭等非歐洲地區的衝突。同時，對於世界許多地方而言，更有指「強權即公理」的時代從未在1945年真正結束，舊秩序只是換了名字，通過制裁與代理人戰爭繼續存在。</p><h2>金價與比特幣走勢各走極端</h2><p>達里奧又提到，歷史數據顯示戰爭期間的市場表現高度依賴戰場勝算，其中德國股市初期因軍事勝利而上漲，最終隨着戰敗歸零；而美國股市則在戰爭需求刺激下走強。那麼投資者又該如何在動盪環境中守住財富？達里奧直言，戰爭時期政府政府為籌集軍費，往往會大量發行債務並將其貨幣化，導致貨幣貶值與信貸崩潰，投資者應警惕債務資產，黃金將取代美債成為新的無風險資產基準。</p><p>事實上，在危機與衝突加劇的環境下，各國多依賴擴張債務與貨幣寬鬆支撐經濟，最終將推動貨幣購買力與債務實際價值持續下行，因此單純持有現金並非穩健選擇，反而會長期面臨購買力被侵蝕的壓力。至於目前市場上普遍最看好的避險資產，亦正是黃金。各國央行亦早於2023年和2024年已增持了超過1,000噸黃金，並在2025年維持了歷史高位，表明儲備黃金已成為對沖金融分裂的結構性手段。</p><p>另一方面，在世界秩序正在崩潰之下，毋須交易對手、不依賴於銀行或政府的資產「比特幣」亦是備受看好的避險資產之一；此外，還可選擇實物資產、能源資產，比特幣亦可考慮，最後則是股票。</p><p>不過，留意近日美伊局勢持續緊張，但金價與比特幣價格卻各走極端，其中金價經過早前一輪調整後，近日出現反彈，並一度高見5,249美元，距離上月底高位5,599美元，僅相差約6%；相反，比特幣持續低迷，近日亦一度跌穿6.3萬美元關口，低見62,500美元，距離去年高位12.6萬美元，相差足足近五成。</p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3547105/鱷王警告國際秩序或瓦解-分析大周期第六階段-亂世首選黃金守住財富",
            "pub_date": "2026-02-27 17:11:45",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "新世界中期淨虧損收窄44% 黃少媚：撇除減值已轉賺 有信心市況好轉後盈利改善",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>新世界（017）去年底止中期核心經營溢利36.36億元，按年下跌17.7%，不派息。該集團淨虧損為37.3億元，按年收窄43.8%，主要因為一次性投資物業重估虧損減少、融資成本下降，以及物業交付減少令內地項目的稅項開支下降。新世界指出，淨虧損包括多項非現金撥備及一次性虧損，若撇除非現金撥備及一次性虧損，會錄得淨利潤。</p><h2>淨負債比率仍微升 總債務金額減少</h2><p>截至去年底，新世界淨負債比率為59.7%，較半年前仍升1.6個百分點；綜合債務淨額1227.2億元，仍增加2.2%。但該集團指，目前總債務約為1443億元，已在期內減少約17億元；並指可動用資金合共約374億元，包括現金及銀行結餘約215億元及可動用的銀行貸款約159億元。</p><p>該集團指出，期內繼續嚴格控制資本支出、一般行政及其他營運費用，令這些資本支出按年分別減少29%及18%。</p><h2>半年合約銷售138億 超出全年目標一半</h2><p>期內收入83.9億元，減少50%，主要由於建築收入減少，以及中國內地物業交付減少。來自物業發展項目及資產出售的應佔合約銷售合共約為138億元，超出全年目標270億元的一半，當中香港應佔合約銷售約為103億元，主要來自住宅項目，包括滶晨、瑧博、柏蔚森、天瀧、柏傲莊、皇都及天御出售等。</p>\n</div>",
            "link": "https://www.stheadline.com/stock-market/3548178/新世界中期淨虧損收窄44-黃少媚撇除減值已轉賺-有信心市況好轉後盈利改善",
            "pub_date": "2026-02-27 18:26:44",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "伊朗局勢升溫 道指早段跌500點",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>伊朗外部安全風險顯著上升，多國發出公民撤離提醒，地緣政治局勢緊張拖累環球金融市場，美股三大指數開盤集體下跌。道瓊斯工業平均指數收報49020點，跌478點；標普500指數報6847點，跌61點；納斯達克指數報22589點，跌289點。</p><p>資產配置方面，瑞銀將純股票投資組合中的美國股票評級下調至「中性」。另外，美國國債收益率跌幅收窄，10年期債券收益率最新下跌3.6個基點，報3.981%；兩年期債券收益率由低位回升，跌4.4個基點至3.404%。</p><p>經濟數據方面，美國1月生產者物價指數（PPI）按年上升2.9%，高過市場預期的2.6%，前值為增長3%。</p><p>個股方面，特斯拉股價開盤跌1.25%。創辦人馬斯克表示，特斯拉計劃20年內在月球設廠，建議投資者長線持股。另外，阿布扎比綜合交通中心宣布，特斯拉在有人員監督下，完成最新無人駕駛技術當地道路測試。</p><p>串流媒體巨頭奈飛盤前漲超10%，消息指該公司拒絕提高對華納兄弟的收購報價，並將退出有關交易。</p>\n</div>",
            "link": "https://www.stheadline.com/stock-market/3548261/伊朗局勢升溫-道指早段跌500點",
            "pub_date": "2026-02-27 22:41:06",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Netflix放棄競購華納兄弟 盤後急升逾一成 派拉蒙有望以1110億美元吞併",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>串流平台龍頭Netflix宣布放棄競購華納兄弟探索（Warner Bros. Discovery），此舉意味派拉蒙（Paramount Skydance）有望以1,110億美元收購華納兄弟。受消息刺激，Netflix股價在盤後交易急升逾13%，反映投資者樂見公司放棄此筆交易。</p><h2>Netflix嫌貴離場 專注自家內容投資</h2><p>Netflix在聲明中表示，公司一直保持紀律，雖然相信其收購方案能通過監管審查並為股東創造價值，但在考慮到派拉蒙最新提出的價格水平下，認為交易已不再具備財務吸引力。Netflix強調，未來將繼續投資自身業務，今年計劃斥資約200億美元於電影、劇集及其它娛樂內容的製作。</p><p>此前，Netflix曾於去年12月與華納兄弟達成價值827億美元的收購協議，擬收購華納兄弟的影業及串流媒體業務，但隨著派拉蒙不斷發出競購要約，最終華納兄弟董事會確認，派拉蒙最新每股31美元的出價為更優方案。</p><p>華納兄弟股東Ancora表示，華納兄弟與派拉蒙的交易，對股東與產業是雙贏局面。</p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548049/Netflix放棄競購華納兄弟-盤後急升逾一成-派拉蒙有望以1110億美元吞併",
            "pub_date": "2026-02-27 09:41:07",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "信置中期基礎溢利22億 收入增長35% 黃永光對前景樂觀：樓市將可延續動力",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>信和置業（00083）公布截至去年12月底止中期業績，期內純利15.33億元，按年跌15.8%。若撇除投資物業公平值變動影響，基礎溢利為22.2億元，按年微跌0.9%；每股基礎盈利0.24元。集團維持派發中期股息0.15元。</p><p>受惠物業銷售增長，集團中期收入按年升34.5%至51.85億元。回顧期內銷售表現，於2025年7月至今年2月13日期間，集團共售出2325個單位，應佔單位為1052個，主要受惠於市場對凱柏峰、柏瓏III及柏景峰等項目反應理想。</p><p>展望未來，集團有多個新項目可供推售，包括位於將軍澳的海瑅灣，項目已獲發預售樓花同意書。此外，集團預期將於今年內獲發土瓜灣榮光街╱崇安街發展項目的預售樓花同意書，實際推售時間將視乎獲批進度及市況而定。</p><p>信和置業主席黃永光表示，在市場預期利率進一步下調，以及旅遊業穩健復甦的帶動下，集團對整體前景依然樂觀，並預期住宅市場將可延續動力。集團將一如既往秉持審慎理財原則，致力提升營運效率和生產力。</p><h2>租金收益按年跌2.3% 酒店業務受惠旅遊復甦</h2><p>土地儲備方面，過去六個月集團購入兩幅分別位於屯門及佐敦谷的住宅地皮。截至去年底，集團在中國內地、香港、新加坡及澳洲悉尼擁有土地儲備，應佔樓面面積約1880萬平方呎。</p><p>租賃業務方面，信置中期應佔總租金收益為17.1億元，按年跌2.3%，主要由於去年初零售市道疲軟，對續租租金構成壓力。不過零售市場其後逐步改善，投資物業組合整體出租率達89.5%。期內淨租金收益為13.56億元，按年跌1.5%。</p><p>酒店業務表現則見回暖，中期酒店收入8.2億元，按年升約3.5%；經營溢利2.89億元，按年升約10.7%。受惠旅遊業復甦及審慎成本管理，期內集團旗下香港各酒店的業務表現均錄得增長。</p><h2>手持現金532億 淨現金514億</h2><p>截至去年底，信置擁有現金及銀行存款約532億元，扣除借貸總額17.99億元後，淨現金約514億元，財務狀況穩健。借貸總額中有46.2%須於一年內償還，其餘則於四至五年內到期。</p>\n</div>",
            "link": "https://www.stheadline.com/stock-market/3548196/信置中期基礎溢利22億-收入增長35-黃永光對前景樂觀樓市將可延續動力",
            "pub_date": "2026-02-27 18:01:54",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "信置中期基礎溢利22億 股息維持0.15元 黃永光對前景樂觀：樓市將可延續動力",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>信和置業（00083）公布截至去年12月底止中期業績，期內純利15.33億元，按年跌15.8%。若撇除投資物業公平值變動影響，基礎溢利為22.2億元，按年微跌0.9%；每股基礎盈利0.24元。投資物業重估虧損為6.82億元，按年擴大67.7%。集團維持派發中期股息15仙。</p><h2>中期收入按年升34.5% 黃永光：樓市將可延續動力</h2><p>受惠物業銷售增長，集團中期收入按年升34.5%至51.85億元。回顧期內銷售表現，於2025年7月至今年2月13日期間，集團共售出2325個單位，應佔單位為1052個，主要受惠於市場對凱柏峰、柏瓏III及柏景峰等項目反應理想。</p><p>展望未來，集團有多個新項目可供推售，包括位於將軍澳的海瑅灣，項目已獲發預售樓花同意書。此外，集團預期將於今年內獲發土瓜灣榮光街╱崇安街發展項目的預售樓花同意書，實際推售時間將視乎獲批進度及市況而定。</p><p>信和置業主席黃永光表示，在市場預期利率進一步下調，以及旅遊業穩健復甦的帶動下，集團對整體前景依然樂觀，並預期住宅市場將可延續動力。集團將一如既往秉持審慎理財原則，致力提升營運效率和生產力。</p><h2>租金收益按年跌2.3% 酒店業務受惠旅遊復甦</h2><p>土地儲備方面，過去六個月集團購入兩幅分別位於屯門及佐敦谷的住宅地皮。截至去年底，集團在中國內地、香港、新加坡及澳洲悉尼擁有土地儲備，應佔樓面面積約1880萬平方呎。</p><p>租賃業務方面，信置中期應佔總租金收益為17.1億元，按年跌2.3%，主要由於去年初零售市道疲軟，對續租租金構成壓力。不過零售市場其後逐步改善，投資物業組合整體出租率達89.5%。期內淨租金收益為13.56億元，按年跌1.5%。</p><p>酒店業務表現則見回暖，中期酒店收入8.2億元，按年升約3.5%；經營溢利2.89億元，按年升約10.7%。受惠旅遊業復甦及審慎成本管理，期內集團旗下香港各酒店的業務表現均錄得增長。</p><h2>手持現金532億 淨現金514億</h2><p>截至去年底，信置擁有現金及銀行存款約532億元，扣除借貸總額17.99億元後，淨現金約514億元，財務狀況穩健。借貸總額中有46.2%須於一年內償還，其餘則於四至五年內到期。<br/> </p>\n</div>",
            "link": "https://www.stheadline.com/stock-market/3548196/信置中期基礎溢利22億-股息維持015元-黃永光對前景樂觀樓市將可延續動力",
            "pub_date": "2026-02-27 17:50:55",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "英偉達績佳仍大跌三大原因 分析：7410億下游訂單暗藏危機",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>AI晶片龍頭英偉達本周公佈第四季業績，單季收入達681億美元（約5330億港幣），按年急升73%，單季收入便超過大多數晶片公司全年的總和。然而，這份業績未能平息市場恐慌，英偉達周四股價最多跌5.75%至184.31美元，收市報184.89美元。網上關於英偉達股價下跌的原因眾說紛紜，有分析師接受《星島頭條》採訪時亦表示原因不明。</p><h2>業績超預期 股價反跑輸道指</h2><p>據華爾街日報報道，英偉達上季收入增速創一年新高，對本季度的指引更大幅超出華爾街預期，但英偉達股價周四仍下跌逾5%。事實上，英偉達過去半年股價僅升不足8%，跑輸道指及多數晶片同行。</p><h2>原因一：資金輪動押注基建樽頸</h2><p>事實上，環球資金在過去一段時間正流向AI基建的「鏟子股」及傳統工業股，卡特彼勒（Caterpillar）今年累升30%領跑道指，韓國的存儲晶片股亦表現強勢，反映投資者正押注數據中心建設樽頸環節，如發電機及電纜供應商，而非單純追捧AI晶片。</p><h2>原因二：收入急升反掏空其他巨頭</h2><p>而在英偉達績後的電話會議上，有分析師問黃仁勳，對客戶繼續投入數千億美元購買英偉達晶片的能力有多大信心。黃仁勳當時回應指，他對客戶公司的現金流增長「充滿信心」。</p><p>不過，英偉達的成功亦被解讀為行業失穩的先兆，因其持續飆升的收入，正源自其他科技巨頭天量的資本支出（Capex）。有分析預計，Alphabet、微軟（Microsoft）、亞馬遜（Amazon）及Meta今年的自由現金流將顯著下降，亞馬遜甚至面臨轉負風險，令微軟及亞馬遜今年股價分別累挫17%及9%。</p><p>當其他科技巨頭的自由現金流狀況轉差，倒頭來將可能影響英偉達，皆因英偉達首席財務官Colette Kress承認，全球五大雲端巨頭貢獻了其數據中心業務逾50%營收，加劇了市場對需求過於集中的擔憂。</p><h2>原因三：採購承諾金額激增藏危機</h2><p>另外，電影《沽注一擲》主角原型、「大空頭」Michael Burry在其文章中指出英偉達另一潛在下跌原因。他表示，英偉達財報中一個關鍵數據「採購義務」，由一年前的160億美元（折合約1248億港元）飆升至950億美元（折合約7410億港元）。這意味著英偉達被迫在需求明朗前，向台積電等供應商下達不可取消的巨額訂單。一旦下游需求動搖，進一步膨脹的數字可能會對英偉達的業績健康構成巨大風險。</p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548184/英偉達績佳仍大跌三大原因-分析7410億下游訂單暗藏危機",
            "pub_date": "2026-02-27 17:21:01",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "巴拿馬當局搜查長和旗下巴拿馬港口公司",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>路透引述消息人士報道，巴拿馬政府於周四搜查了長和（001）旗下巴拿馬港口公司（PPC）。</p><p>巴拿馬政府在聲明中表示，這是巴拿馬檢察院在行使其法定權力時獨立進行的調查，但聲明沒有未指明PPC為搜查對象。路透引述消息人士表示，搜查PPC與取消該公司兩個港口經營權的決定無關。</p><p>巴拿馬總統Jose Raul Mulino於搜查行動前表示，他不知道長和失去港口經營權後，中國政府可能會採取甚麼行動，但表示如果有任何事情發生，巴拿馬將作出回應。</p><p>長和昨日（26日）發通告，表示隨著巴拿馬政府代表強行進入及接管碼頭，旗下PPC的特許經營權已在本月23日被視為終止。不過，PPC已取得意見，指巴拿馬法院的裁決、行政法令以及巴拿馬政府的行動，與相關法律框架以及批准該特許經營合約之法律並不一致。</p><p>長和強調，公司董事會對該裁決、該行政法令及巴拿馬之相應行動表示強烈反對，集團繼續聯同其法律顧問，保留集團一切權利，並擬採取一切妥善可行之法律方案以保衛集團權益，包括就該事宜訴諸進一步國內及國際法律程序。<br/> </p>\n</div>",
            "link": "https://www.stheadline.com/realtime-finance/3548187/巴拿馬當局搜查長和旗下巴拿馬港口公司",
            "pub_date": "2026-02-27 17:11:45",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "新世界中期核心經營溢利36億元 淨虧損收窄44% 稱撇除減值已轉賺 總債務減17億元",
            "description": "<div class=\"content-body\" id=\"conimg_0\" itemprop=\"articleBody\">\n<p>新世界（017）去年底止中期核心經營溢利36.36億元，按年下跌17.7%，不派息。該集團淨虧損為37.3億元，按年收窄43.8%，主要因為一次性投資物業重估虧損減少、融資成本下降，以及物業交付減少令內地項目的稅項開支下降。新世界指出，淨虧損包括多項非現金撥備及一次性虧損，若撇除非現金撥備及一次性虧損，會錄得淨利潤。</p><h2>淨負債比率仍微升 總債務金額減少</h2><p>截至去年底，新世界淨負債比率為59.7%，較半年前仍升1.6個百分點；綜合債務淨額1227.2億元，仍增加2.2%。但該集團指，目前總債務約為1443億元，已在期內減少約17億元；並指可動用資金合共約374億元，包括現金及銀行結餘約215億元及可動用的銀行貸款約159億元。</p><p>該集團指出，期內繼續嚴格控制資本支出、一般行政及其他營運費用，令這些資本支出按年分別減少29%及18%。</p><h2>半年合約銷售138億 超出全年目標一半</h2><p>期內收入83.9億元，減少50%，主要由於建築收入減少，以及中國內地物業交付減少。來自物業發展項目及資產出售的應佔合約銷售合共約為138億元，超出全年目標270億元的一半，當中香港應佔合約銷售約為103億元，主要來自住宅項目，包括滶晨、瑧博、柏蔚森、天瀧、柏傲莊、皇都及天御出售等。</p>\n</div>",
            "link": "https://www.stheadline.com/stock-market/3548178/新世界中期核心經營溢利36億元-淨虧損收窄44-稱撇除減值已轉賺-總債務減17億元",
            "pub_date": "2026-02-27 17:05:56",
            "source": "stheadline",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}