{
    "data": [
        {
            "title": "Park Hotels Ties Finance And Operations With Sean Dell’Orto Promotion",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Park Hotels &amp; Resorts (NYSE:PK) has appointed Sean M. Dell’Orto as Chief Operating Officer, adding to his existing roles as Chief Financial Officer and Treasurer.</li> <li>The expanded role gives Dell’Orto broader oversight of operations alongside his current finance responsibilities.</li> </ul> <p>For Park Hotels &amp; Resorts, which last closed at $11.31, this leadership shift puts one executive at the center of both financial and operational decisions. The stock shows mixed performance, with a 5.4% return over the past 30 days and 11.5% over 3 years, alongside a 23.5% decline over 5 years. That backdrop helps explain why investors may pay closer attention when the company adjusts its senior ranks.</p> <p>With Dell’Orto stepping into the COO role while retaining CFO and Treasurer duties, the company is concentrating more responsibility in a single, experienced insider. Investors often watch how such changes translate into capital allocation choices, portfolio actions and day to day hotel operations. The coming quarters may reveal how this new structure shapes priorities for NYSE:PK.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-pk/park-hotels-resorts/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Park Hotels &amp; Resorts</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/PK\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Park Hotels &amp; Resorts.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/real-estate/nyse-pk/park-hotels-resorts\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:PK 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/8ad76aeb-100c-4ef4-a61e-a0b78019f0b8/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:PK 1-Year Stock Price Chart</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_management\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-pk/park-hotels-resorts/management\" rel=\"noopener noreferrer\" target=\"_blank\">Does the team leading Park Hotels &amp; Resorts have what it takes? See our full breakdown of the management team's track record and compensation.</a></p> <p>The timing of Sean Dell’Orto’s expanded role comes right after a tough reporting year, with Park Hotels &amp; Resorts moving from net income of US$66 million in the fourth quarter of 2024 to a net loss of US$205 million in the fourth quarter of 2025, and from full year net income of US$212 million to a full year net loss of US$283 million. Having the same person oversee both the finance function and day to day operations could tighten the link between budgeting, capital allocation, refinancing plans and how individual hotels are run. That may matter given recent renovation disruption, asset sales and the focus on capital recycling highlighted by management. Investors can also set this appointment alongside the decision to keep returning cash through a US$0.25 per share first quarter 2026 dividend and the completion of a US$24.96 million buyback program covering about 1.03% of shares. With cautious 2026 earnings guidance and upcoming debt maturities referenced in recent commentary, Dell’Orto’s combined responsibilities put more emphasis on execution discipline, especially around refinancing, any future asset sales and the performance of key resorts such as Hilton Hawaiian Village.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>How This Fits Into The Park Hotels &amp; Resorts Narrative</h3> <ul> <li>Concentrating financial and operational oversight in one long tenured executive can support the narrative’s focus on reinvestment and portfolio reshaping by aligning capital decisions with on the ground execution at properties like Hilton Hawaiian Village and Royal Palm.</li> <li>The broader remit also highlights the pressure points raised in the narrative, such as leverage, refinancing needs and higher labor costs, which could make operational missteps more costly if execution falls short.</li> <li>The appointment formalizes Dell’Orto’s role in coordinating internal operations with strategy, which is not fully reflected in the narrative’s emphasis on assets, demand trends and debt structure rather than leadership structure.</li> </ul> <p>Knowing what a company is worth starts with understanding its story.\n<a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/narratives/27l7oe4i-renovations-and-asset-sales-will-unlock-premium-hotel-experiences-d69o\" rel=\"noopener noreferrer\" target=\"_blank\"> Check out one of the top narratives in the Simply Wall St Community for Park Hotels &amp; Resorts</a> to help decide what it's worth to you.</p> <h3>The Risks and Rewards Investors Should Consider</h3> <ul> <li>⚠️ Analysts have flagged that interest payments are not well covered by earnings, which makes the company’s refinancing plans and Dell’Orto’s capital markets background especially important.</li> <li>⚠️ An unstable dividend track record and a recent move to a full year net loss of US$283 million add pressure on management to balance shareholder returns with balance sheet strength.</li> <li>🎁 Earnings are forecast to grow at a high rate, and Dell’Orto’s combined finance and operations oversight could help align hotel level performance with those expectations.</li> <li>🎁 The company is viewed as trading at a discount to some estimates of fair value and at attractive levels compared with peers, which may appeal to investors who are comfortable with the operational and financial risks.</li> </ul> <h3>What To Watch Going Forward</h3> <p>From here, you may want to watch how quickly Dell’Orto’s expanded remit shows up in reported numbers, especially around margins at key resorts, progress on hotel renovations and any further asset sales. The next few earnings reports will give more clarity on whether the shift from net income in 2024 to a net loss in 2025 stabilizes, and how closely results track the 2026 net income guidance range of US$69 million to US$99 million. Debt refinancing activity, dividend decisions beyond the US$0.25 per share first quarter payout and any changes in capital returns policy will also be useful signals of how the new leadership structure is being used. To ensure you're always in the loop on how the latest news impacts the investment narrative for Park Hotels &amp; Resorts, head to the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/PK\" rel=\"noopener noreferrer\" target=\"_blank\"> community page for Park Hotels &amp; Resorts</a> to never miss an update on the top community narratives.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:26:49",
            "link": "https://simplywall.st/stocks/us/real-estate/nyse-pk/park-hotels-resorts/news/park-hotels-ties-finance-and-operations-with-sean-dellorto-p",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is UWM Holdings (UWMC) Pricing In Too Much After Recent Share Price Weakness",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether UWM Holdings at US$4.41 is a bargain or a value trap, you are not alone. This article walks through what the current share price might be implying.</li> <li>The stock has seen a 4.5% decline over the last 7 days, a 25.1% decline over the past month, is flat year to date at 0.0%, has a 24.1% decline over 1 year, a 12.6% return over 3 years, and a 27.0% decline over 5 years, which can change how investors think about both risk and potential upside.</li> <li>Recent moves in UWM Holdings often sit against a backdrop of sector wide headlines around mortgage activity, interest rate expectations, and investor appetite for financials. These factors can influence sentiment even when company specific news is limited. For long term holders and new investors, this mix of broader industry chatter and shifting sentiment can matter as much as stock specific events when judging price action.</li> <li>On Simply Wall St's valuation checks, UWM Holdings currently scores <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-uwmc/uwm-holdings/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">0 out of 6</a>. Next we will look at what different valuation methods say about that number, and then finish by pointing you to an even more complete way of thinking about the stock's value.</li> </ul> <p>UWM Holdings scores just 0/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-uwmc/uwm-holdings/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: UWM Holdings Excess Returns Analysis</h3> <p>The Excess Returns model looks at how much return a company is expected to earn above its cost of equity, then converts that into a per share value. It asks a simple question: after paying shareholders for the risk they take, how much value is left over each year?</p> <p>For UWM Holdings, the model uses a Book Value of $0.74 per share and a Stable EPS of $0.14 per share, based on the median return on equity from the past 5 years. The Average Return on Equity is 10.48%, while the Cost of Equity is 9.51%. That gap feeds into an estimated Excess Return of $0.04 per share.</p> <p>Analysts also expect a Stable Book Value of $1.30 per share, based on weighted future book value estimates from 4 analysts. Combining these inputs, the Excess Returns model arrives at an intrinsic value of about $2.33 per share. Compared with the current share price of US$4.41, this framework suggests UWM Holdings is 89.3% overvalued on this measure.</p> <p><strong>Result: OVERVALUED</strong></p> <p>Our Excess Returns analysis suggests UWM Holdings may be overvalued by 89.3%. <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">Discover 46 high quality undervalued stocks</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">create your own screener</a> to find better value opportunities.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-uwmc/uwm-holdings/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"UWMC Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/40322065-2f8a-4897-a1a8-1c1238d39194/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>UWMC Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-uwmc/uwm-holdings/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for UWM Holdings.</a></p> <h3>Approach 2: UWM Holdings Price vs Earnings</h3> <p>For profitable companies, the P/E ratio is a straightforward way to link what you pay for a share to the earnings that each share generates. It helps you see how many years of current earnings the market is effectively pricing in.</p> <p>What counts as a “normal” or “fair” P/E depends on how the market views a company’s growth prospects and risk. Higher expected growth or lower perceived risk can support a higher P/E, while slower growth or higher risk usually lines up with a lower P/E.</p> <p>UWM Holdings is currently trading on a P/E of 47.49x. That sits above the Diversified Financial industry average of 17.81x and above the peer average of 8.20x. Simply Wall St’s Fair Ratio for UWM Holdings is 26.09x, which is its in house estimate of a P/E that fits the company’s earnings growth profile, industry, profit margins, market cap and risk factors.</p> <p>This Fair Ratio can be more useful than a simple peer or industry comparison because it adjusts for company specific traits rather than assuming all firms should trade on the same multiple. Set against the current 47.49x P/E, the 26.09x Fair Ratio points to UWM Holdings trading above what this framework suggests is justified.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-uwmc/uwm-holdings/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:UWMC P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/40322065-2f8a-4897-a1a8-1c1238d39194/chart/pe-multiple-vs-industry?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:UWMC P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your UWM Holdings Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation. On Simply Wall St you can use Narratives, where you tell the story behind your numbers by linking your view on UWM Holdings future revenue, earnings and margins to a forecast and fair value. You can then compare that to today’s price to see if your story points to opportunity or caution.</p> <p>A Narrative is simply your written explanation of what you think is driving the business, paired with your assumptions and a resulting fair value. It keeps everything in one place rather than scattered across notes and spreadsheets.</p> <p>On the UWM Holdings Community page, you can see Narratives that already exist on the platform, including more cautious views that line up with fair values around US$5.00 and more optimistic views closer to about US$9.20. You can decide which story feels closer to your own expectations.</p> <p>As new earnings, news or sector data come in, Narratives on Simply Wall St update with fresh inputs. The fair value attached to each story moves with the information and gives you a living reference point for whether your chosen Narrative still fits the current US$4.41 share price.</p> <p>Do you think there's more to the story for UWM Holdings? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/UWMC\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-uwmc/uwm-holdings\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:UWMC 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/40322065-2f8a-4897-a1a8-1c1238d39194/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:UWMC 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 12:26:49",
            "link": "https://simplywall.st/stocks/us/diversified-financials/nyse-uwmc/uwm-holdings/news/is-uwm-holdings-uwmc-pricing-in-too-much-after-recent-share",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A Look At CDW (CDW) Valuation After Q4 Earnings Beat And Cloud AI Growth Outlook",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>CDW (CDW) shares have attracted fresh attention after the company reported Q4 results that topped analyst revenue and earnings estimates, paired with strong cash generation and increased confidence around cloud, AI, and cybersecurity demand.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/tech/nasdaq-cdw/cdw\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for CDW.</a></p> <p>Despite the upbeat Q4, CDW’s recent share price performance has been weak, with a 90 day share price return decline of 14.96% and a 1 year total shareholder return decline of 30.02%, suggesting sentiment has cooled even as interest in cloud, AI, and cybersecurity remains a key focus.</p> <p>If CDW’s AI and cloud story has caught your interest, it could be a good time to widen your search and review <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_profitable_ai\" href=\"https://simplywall.st/discover/investing-ideas/473633/profitable-ai-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">61 profitable AI stocks that aren't just burning cash</a> as potential next candidates to research.</p> <p>With CDW trading at US$122.64 and indicators such as an intrinsic value estimate implying a 17% discount and a sizeable gap to analyst targets, you have to ask: is there genuine upside here, or is the market already pricing in future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 32.1% Undervalued</h2> <p>CDW's most followed narrative puts fair value at $180.60 versus the recent $122.64 close, suggesting the current price sits well below what those forecasts imply.</p> <blockquote> <p><em>Expansion of CDW's software, professional, and managed services capabilities, which are now core to both strategy and recent M&amp;A focus, continues to elevate recurring revenue and expand margins, supporting resilient long-term earnings growth.</em></p> </blockquote> <p><em>CDW Future Earnings and Revenue Growth</em> <a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/201b8sgs-healthcare-and-commercial-gains-will-drive-earnings-momentum-amid-education-weakness\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Want to see what is driving that valuation gap? The narrative leans heavily on steadier revenue, higher margins, and a richer earnings mix. The exact forecasts might surprise you.</p> <p><strong>Result: Fair Value of $180.60 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/201b8sgs-healthcare-and-commercial-gains-will-drive-earnings-momentum-amid-education-weakness\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, you still need to weigh risks, such as softer federal and education funding and pressure from lower margin large hardware deals that could strain profitability.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/tech/nasdaq-cdw/cdw\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this CDW narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of potential upside and clear risks leaves you torn, it might be worth acting now to review the full picture yourself. You can start with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/tech/nasdaq-cdw/cdw\" rel=\"noopener noreferrer\" target=\"_blank\">5 key rewards and 2 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If CDW has sharpened your thinking, do not stop here. Use the Simply Wall St screener to uncover other opportunities that could fit your approach.</p> <ul> <li>Start building a watchlist focused on quality by checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (39 results)</a>, which can help anchor your portfolio.</li> <li>Hunt for pricing gaps with <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 high quality undervalued stocks</a>, where fundamentals and current market prices appear out of sync.</li> <li>Spot potential future winners early by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> before they attract wider attention.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 12:26:49",
            "link": "https://simplywall.st/stocks/us/tech/nasdaq-cdw/cdw/news/a-look-at-cdw-cdw-valuation-after-q4-earnings-beat-and-cloud",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Acciona (BME:ANA) Valuation After Strong 2025 Earnings And Share Price Rally",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Acciona (BME:ANA) is in focus after reporting full year 2025 results, with sales of €20,236 million, revenue of €22,441 million, and net income of €803 million compared with €422 million a year earlier.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/es/utilities/bme-ana/acciona-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Acciona.</a></p> <p>The earnings release and news of Acciona’s role in Madrid’s largest public EV charging project have coincided with a sharp shift in sentiment, with a 36.6% 1 month share price return and a 113.7% 1 year total shareholder return suggesting strong recent momentum.</p> <p>If this kind of renewed interest in infrastructure and energy names has caught your attention, it could be a good moment to see what else is moving through <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_power_grid\" href=\"https://simplywall.st/discover/investing-ideas/473750/power-grid-technology-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">23 power grid technology and infrastructure stocks</a>.</p> <p>With the share price up 36.6% over the past month and 113.7% over the past year, along with net income of €803 million for 2025, you now have to ask yourself whether there is still a buying opportunity here or whether the market is already pricing in future growth.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 41.1% Overvalued</h2> <p>Acciona's most followed narrative puts fair value at €174.88 per share, well below the recent €246.80 close. As a result, the current rally is being measured against a much lower anchor.</p> <blockquote> <p><em>ACCIONA's infrastructure backlog reached an all-time high of €54 billion, providing a strong foundation for future revenue growth through large-scale projects and concession awards. This is expected to drive an increase in revenue and operating margins as projects come to fruition.</em></p> </blockquote> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/5xcr5yr8-ana-concession-asset-optimism-will-face-downside-risk-after-sell-rating\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Want to see what drives that gap between fair value and today’s price? Revenue pressure, margin shifts and a punchy future earnings multiple all sit at the core of this narrative.</p> <p><strong>Result: Fair Value of €174.88 (OVERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/5xcr5yr8-ana-concession-asset-optimism-will-face-downside-risk-after-sell-rating\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, there is still the risk that lower renewable power prices or policy shifts, especially in the U.S., could pressure earnings and challenge this overvaluation narrative.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/es/utilities/bme-ana/acciona-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Acciona narrative.</a></p> <h2>Next Steps</h2> <p>If the mixed tone of this story leaves you undecided, now is a good time to check the numbers yourself and weigh both sides. You can start with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/es/utilities/bme-ana/acciona-shares\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 4 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If Acciona’s story has your attention, do not stop here. Broaden your watchlist with a few focused stock ideas that fit different portfolio goals.</p> <ul> <li>Target potential value opportunities by scanning companies that our filters flag as <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">221 high quality undervalued stocks</a> based on earnings, cash flows and balance sheet strength.</li> <li>Strengthen your income stream by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/global\" rel=\"noopener noreferrer\" target=\"_blank\">447 dividend fortresses</a>, a set of higher yielding names that may appeal if you want regular cash returns.</li> <li>Protect the downside by checking <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/global\" rel=\"noopener noreferrer\" target=\"_blank\">324 resilient stocks with low risk scores</a>, a collection of companies with lower risk scores that could help stabilise an otherwise volatile portfolio.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:26:49",
            "link": "https://simplywall.st/stocks/es/utilities/bme-ana/acciona-shares/news/assessing-acciona-bmeana-valuation-after-strong-2025-earning",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is Globe Life (GL) Still Attractive After Recent Share Price Gains?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Investors may be wondering whether Globe Life's current share price lines up with its underlying value, or if the market is missing something important.</li> <li>Globe Life shares last closed at US$145.26, with returns of 0.6% over 7 days, 4.8% over 30 days, 4.9% year to date, 14.9% over 1 year, 23.6% over 3 years and 55.7% over 5 years, giving investors plenty of price history to weigh against fundamentals.</li> <li>Recent coverage of Globe Life has focused on how the stock is priced relative to its peers and what that might imply for long term holders. This kind of attention often prompts investors to reassess whether current expectations are already fully reflected in the share price.</li> <li>On Simply Wall St's valuation checks, Globe Life scores <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/insurance/nyse-gl/globe-life/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">5 out of 6</a> for being assessed as undervalued. This sets up a closer look at how traditional valuation tools compare with a broader, more complete way to think about value, which we will come back to at the end of this article.</li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_industry_performance_contextual\" href=\"https://www.simplywall.st/stocks/us/insurance/nyse-gl/globe-life/past\" rel=\"noopener noreferrer\" target=\"_blank\">Globe Life delivered 14.9% returns over the last year. See how this stacks up to the rest of the Insurance industry.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Globe Life Excess Returns Analysis</h3> <p>The Excess Returns model looks at how efficiently Globe Life turns shareholder equity into earnings, after factoring in the cost of that equity. Instead of focusing on cash flows, it compares what shareholders might reasonably require as a return with what the business is estimated to earn on its equity base.</p> <p>For Globe Life, book value is estimated at $75.54 per share, with a stable book value of $90.80 per share, based on future book value estimates from 5 analysts. Stable EPS is estimated at $16.06 per share, sourced from weighted future Return on Equity estimates from 4 analysts. The average Return on Equity is 17.69%, while the cost of equity is $6.34 per share, implying an excess return of $9.72 per share.</p> <p>When these excess returns are projected and capitalised, the model arrives at an intrinsic value of about $363.36 per share. Compared with the recent share price of $145.26, this framework indicates the stock is around 60.0% undervalued.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Excess Returns analysis suggests Globe Life is undervalued by 60.0%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/insurance/nyse-gl/globe-life/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"GL Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/a9e23ace-003b-4bc2-9b5f-b8a643b5c6f8/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>GL Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/insurance/nyse-gl/globe-life/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Globe Life.</a></p> <h3>Approach 2: Globe Life Price vs Earnings</h3> <p>For profitable companies like Globe Life, the P/E ratio is a useful shorthand because it links what you pay per share to the earnings the business is already generating. Investors tend to accept a higher or lower P/E depending on what they expect for future earnings growth and how risky they believe those earnings are.</p> <p>Globe Life currently trades on a P/E of 9.84x. That sits below the Insurance industry average P/E of 12.02x and below the peer average of 12.54x. On the surface, that suggests the market is pricing Globe Life at a discount to many insurers with similar business models.</p> <p>Simply Wall St also calculates a Fair Ratio for Globe Life of 12.69x. This is a proprietary estimate of what the P/E might be given factors such as the company’s earnings growth profile, its industry, profit margins, market cap and risk characteristics. Because it incorporates these fundamentals, the Fair Ratio can give a more tailored anchor than a simple comparison to broad industry or peer averages, which may mix companies with very different risk and growth setups.</p> <p>Comparing the Fair Ratio of 12.69x with the current P/E of 9.84x suggests Globe Life trades below this reference point, indicating the shares may be undervalued on this metric.</p> <p><strong>Result: UNDERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/insurance/nyse-gl/globe-life/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:GL P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/a9e23ace-003b-4bc2-9b5f-b8a643b5c6f8/chart/pe-multiple-vs-industry?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:GL P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Globe Life Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple tool on Simply Wall St’s Community page that lets you connect Globe Life’s story to your own forecast and fair value, then compare that fair value to today’s price and see how it changes as new earnings or news arrive.</p> <p>At its core, a Narrative is your story behind the numbers. It is where you combine your assumptions about Globe Life’s future revenue, earnings and margins with your view of risk to arrive at a fair value, instead of only relying on standard ratios like P/E.</p> <p>Because Narratives sit on the same platform used by millions of investors, you can see how your view compares with others. For example, one investor might lean closer to the higher fair value estimate around US$199.00, while another might anchor on the more cautious view near US$145.00. Each Narrative spells out the assumptions required for those different outcomes in a way that is easy to review and update over time.</p> <p>For Globe Life, here are previews of two leading Globe Life Narratives to make comparison easier:</p> <p><a href=\"/us/insurance/nyse-gl/globe-life/6tr84h3x-share-repurchases-and-earnings-outlook-will-support-insurance-sector-expansion?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Globe Life Bull Case</strong></a></p> <p>Fair value in this Narrative: US$171.40 per share</p> <p>Gap to this fair value: around 15.3% undervalued versus the last close of US$145.26</p> <p>Revenue growth input: 6.31% a year</p> <ul> <li>Analysts in this camp see digital underwriting, Direct to Consumer improvements and agent headcount trends as supportive for policy sales and earnings over time.</li> <li>They incorporate revenue growth of 5.1% a year in earlier assumptions, slightly higher profit margins by 2028, and higher earnings per share supported by ongoing share repurchases.</li> <li>This view aligns with an updated consensus fair value of US$171.40, which reflects higher revenue growth assumptions, a modestly lower margin, and a slightly higher future P/E multiple.</li> </ul> <p><a href=\"/us/insurance/nyse-gl/globe-life/2mem5xdt-demographic-decline-and-digital-disruption-will-dampen-future-performance?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Globe Life Bear Case</strong></a></p> <p>Fair value in this Narrative: US$145.00 per share</p> <p>Gap to this fair value: around 0.2% overvalued versus the last close of US$145.26</p> <p>Revenue growth input: 5.86% a year</p> <ul> <li>The cautious Narrative focuses on slower long term policy growth as demographics shift, household budgets stay tight, and digital first insurers compete for Globe Life’s core customer base.</li> <li>It uses lower revenue growth, a future P/E of 9.40x and a higher discount rate than before, which together pull the valuation toward the lower end of analyst targets.</li> <li>Regulatory, litigation and reputation risks, along with dependence on a relatively narrow product set and traditional distribution, are central to this fair value of US$145.00 per share.</li> </ul> <p>If you want to see how these two stories compare side by side and where your own view fits in, <a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a> on Globe Life and stress test your assumptions before making any decisions.</p> <p>Do you think there's more to the story for Globe Life? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/GL\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/insurance/nyse-gl/globe-life\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:GL 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/a9e23ace-003b-4bc2-9b5f-b8a643b5c6f8/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:GL 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:26:49",
            "link": "https://simplywall.st/stocks/us/insurance/nyse-gl/globe-life/news/is-globe-life-gl-still-attractive-after-recent-share-price-g",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A Look At Acuity Brands (AYI) Valuation After Strong Earnings And Cautious Guidance",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Acuity (AYI) is back in focus after reporting a strong quarter, with revenue up 20.2% year on year and EBITDA and adjusted operating income ahead of estimates. However, the stock has fallen since earnings.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-ayi/acuity\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Acuity.</a></p> <p>The recent pullback, including a 17.7% 3 month share price decline and year to date share price return of negative 19.2%, contrasts with a 5 year total shareholder return of 142.2%. This suggests long term momentum while shorter term sentiment has cooled after earnings and guidance.</p> <p>If this mix of strong results and cautious sentiment has you looking around the sector, it could be a moment to check out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_power_grid\" href=\"https://simplywall.st/discover/investing-ideas/473750/power-grid-technology-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">23 power grid technology and infrastructure stocks</a> as a source of other grid focused opportunities tied to electrification and building systems.</p> <p>With shares down over the past quarter yet trading at what looks like roughly a 20% intrinsic discount and close to 30% below analyst targets, is Acuity now mispriced, or is the market already accounting for all the future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 22.9% Undervalued</h2> <p>With Acuity last closing at $301.59 and the most followed narrative pointing to a fair value of $391.25, the gap between price and projected value is hard to ignore.</p> <blockquote> <p><em>The recent acquisition of QSC, which improves Acuity's capabilities in built space management and cloud connectivity, is expected to contribute to future sales growth and margin expansion in the Acuity Intelligence Spaces segment.</em></p> </blockquote> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/9obif0ug-ayi-margin-expansion-and-operational-efficiencies-will-support-balanced-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Curious how one acquisition and a step up in electronics, pricing, and overseas reach feed into that fair value? The narrative leans on a firm earnings path and a richer margin profile than today, plus a future earnings multiple that sits below what is currently implied for the broader Electrical industry. The full story is in how those pieces add up, and what that could mean if the current discount ever closes.</p> <p><strong>Result: Fair Value of $391.25 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/9obif0ug-ayi-margin-expansion-and-operational-efficiencies-will-support-balanced-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, that upside view still hinges on tariffs not putting sustained pressure on margins and on the QSC integration delivering as planned rather than slipping.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-ayi/acuity\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Acuity narrative.</a></p> <h2>Next Steps</h2> <p>If the mix of long term momentum and recent caution leaves you unsure, act while the data is fresh and evaluate it for yourself. To see what is driving optimism, take a closer look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-ayi/acuity\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If you stop here, you risk missing other stocks that could fit your plan just as well as Acuity, so consider widening your lens before you move on.</p> <ul> <li>Target potential value opportunities by scanning our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 high quality undervalued stocks</a> that currently screen well on quality and pricing metrics.</li> <li>Strengthen your core holdings by checking out the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (39 results)</a> that pair financial resilience with straightforward, transparent fundamentals.</li> <li>Get ahead of the crowd by reviewing a <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> that may not be widely followed yet but still clear key quality filters.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:21:42",
            "link": "https://simplywall.st/stocks/us/capital-goods/nyse-ayi/acuity/news/a-look-at-acuity-brands-ayi-valuation-after-strong-earnings",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is It Time To Reassess Viavi Solutions (VIAV) After Its Recent Share Price Surge",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Viavi Solutions' share price still lines up with its fundamentals, this article will walk through what the current market price might be implying about value.</li> <li>At a last close of US$29.71, the stock has recent returns of 7.9% over 7 days, 41.3% over 30 days, 63.7% year to date, 165.7% over 1 year and 177.4% over 3 years, compared with 91.2% over 5 years.</li> <li>Recent news coverage has focused on Viavi Solutions' position within communications test and measurement and its role in supporting network build outs and technology rollouts. This helps frame how investors might think about the business backdrop to these returns. Commentary has also highlighted how investors are paying closer attention to companies exposed to connectivity and network infrastructure, which can influence how the market prices risk and potential.</li> <li>Despite these share price moves, Viavi Solutions holds a valuation score of <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/tech/nasdaq-viav/viavi-solutions/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">1 out of 6</a>, so we will look at what different approaches like P/E, multiples and cash flow based estimates suggest about the current price. We then finish with a broader way of thinking about value that can round out those numbers.</li> </ul> <p>Viavi Solutions scores just 1/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/tech/nasdaq-viav/viavi-solutions/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Viavi Solutions Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model looks at the cash Viavi Solutions is expected to generate in the future and discounts those projections back to today using a required rate of return. The idea is to estimate what all those future cash flows are worth in today's dollars.</p> <p>For Viavi Solutions, the model used is a 2 Stage Free Cash Flow to Equity approach. The latest twelve month free cash flow is about $74.64 million. Analyst and extrapolated projections, provided in the model, run out to 2035 and show free cash flow estimates reaching $536.31 million in that year, all expressed in US$ and then discounted back to the present.</p> <p>Pulling those discounted cash flows together, the model arrives at an estimated intrinsic value of about US$29.42 per share. Against a recent market price of US$29.71, the DCF suggests the stock is around 1.0% overvalued, which is a very small gap and well within any reasonable margin of error.</p> <p><strong>Result: ABOUT RIGHT</strong></p> <p>Viavi Solutions is fairly valued according to our <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/stocks/us/tech/nasdaq-viav/viavi-solutions/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Discounted Cash Flow (DCF)</a>, but this can change at a moment's notice. Track the value in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted on when to act.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/tech/nasdaq-viav/viavi-solutions/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"VIAV Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/60159ccf-24da-4367-a61f-bab4fb6b4742/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>VIAV Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/tech/nasdaq-viav/viavi-solutions/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Viavi Solutions.</a></p> <h3>Approach 2: Viavi Solutions Price vs Sales</h3> <p>For a company like Viavi Solutions, where investors often focus on revenue rather than net income, the P/S ratio is a useful way to think about what you are paying for each dollar of sales. Higher expected growth and lower perceived risk usually justify a higher P/S multiple. In contrast, slower expected growth or higher risk tend to pull that “normal” range down.</p> <p>Viavi Solutions currently trades on a P/S of 5.53x. That sits above both the Communications industry average P/S of 1.92x and the peer average of 2.91x, so the market is attaching a richer sales multiple than these broad benchmarks.</p> <p>Simply Wall St’s Fair Ratio for Viavi Solutions is 6.07x. This is a proprietary estimate of what the P/S might be given factors such as earnings growth, profit margins, industry, market cap and specific risks. Because it looks at these company level characteristics rather than just simple peer or industry comparisons, it can give a more tailored sense of what “fair” could look like.</p> <p>Putting that beside the current 5.53x P/S, Viavi Solutions is priced below the 6.07x Fair Ratio on this metric.</p> <p><strong>Result: UNDERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/tech/nasdaq-viav/viavi-solutions/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:VIAV P/S Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/60159ccf-24da-4367-a61f-bab4fb6b4742/chart/ps-multiple-vs-industry?date=2026-02-28\" width=\"746\"/></a><figcaption>NasdaqGS:VIAV P/S Ratio as at Feb 2026</figcaption></figure> <p>P/S ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Viavi Solutions Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation. On Simply Wall St's Community page you can use Narratives to write the story behind your numbers for Viavi Solutions. You can link your view of its future revenue, earnings and margins to a forecast and fair value, then compare that fair value with the current price to help decide when to buy or sell. The Narrative automatically updates when new news or earnings arrive. Different investors can, for example, plug in a more optimistic view closer to the US$26.07 fair value with higher assumed growth and margins, or a more cautious view closer to US$12.00 with tighter assumptions and a lower P/E, even though both are using the same company and data.</p> <p>Do you think there's more to the story for Viavi Solutions? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NasdaqGS/VIAV\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/tech/nasdaq-viav/viavi-solutions\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:VIAV 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/60159ccf-24da-4367-a61f-bab4fb6b4742/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>NasdaqGS:VIAV 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:21:42",
            "link": "https://simplywall.st/stocks/us/tech/nasdaq-viav/viavi-solutions/news/is-it-time-to-reassess-viavi-solutions-viav-after-its-recent",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bristol-Myers Squibb Cancer Advances Test Valuation Gap For Investors",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Bristol-Myers Squibb (NYSE:BMY) and SystImmune report highly positive Phase 3 interim results for izalontamab brengitecan in advanced triple-negative breast cancer.</li> <li>The trial shows significant gains in progression-free survival and overall survival for patients in a hard-to-treat cancer setting.</li> <li>The FDA accepts the new drug application for iberdomide for multiple myeloma, granting Breakthrough Therapy Designation and Priority Review.</li> <li>Iberdomide is described as a first-in-class cereblon E3 ligase modulator for patients with multiple myeloma.</li> </ul> <p>Bristol-Myers Squibb, traded as NYSE:BMY, is a large biopharmaceutical company focused on oncology, hematology, immunology, and cardiovascular disease. These new data on izalontamab brengitecan and the regulatory progress for iberdomide add to its presence in cancer and blood disorder treatments, areas that remain central for many global drug makers. For investors, this kind of late stage pipeline activity is often considered alongside marketed drugs when assessing a broad biopharma story.</p> <p>Readers will likely watch for full Phase 3 results on izalontamab brengitecan, the FDA’s decision on iberdomide, and any updates on potential label scope or target patient populations. These events may shape how the market views Bristol-Myers Squibb’s longer term product mix and research focus, while the fundamental risks associated with drug development and regulation remain important considerations.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Bristol-Myers Squibb</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/BMY\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Bristol-Myers Squibb.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:BMY Earnings &amp; Revenue Growth as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/4d208582-c6d4-4830-9a46-48803ea591cb/chart/earnings-and-revenue-growth?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:BMY Earnings &amp; Revenue Growth as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_risk_alert\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb\" rel=\"noopener noreferrer\" target=\"_blank\">We've flagged 3 risks for Bristol-Myers Squibb. See which could impact your investment.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Investor Checklist</h2> <h3>Quick Assessment</h3> <ul> <li><strong>⚖️ Price vs Analyst Target</strong>: At US$62.37, the share price is roughly in line with the US$62.16 analyst price target.</li> <li><strong>✅ Simply Wall St Valuation</strong>: The shares are described as trading 48.4% below estimated fair value, which suggests a wide valuation gap.</li> <li><strong>✅ Recent Momentum</strong>: The 30 day return of 14.9% indicates a strong short term move, potentially linked to positive trial and FDA news.</li> </ul> <p>There is only one way to know the right time to buy, sell or hold Bristol-Myers Squibb. Head to Simply Wall St's\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">company report for the latest analysis of Bristol-Myers Squibb's Fair Value</a>.</p> <h3>Key Considerations</h3> <ul> <li>📊 Successful Phase 3 results in advanced breast cancer and FDA Priority Review for iberdomide add two late stage assets to the story in oncology and hematology.</li> <li>📊 Watch how these programs progress to potential approvals, as well as any updates on label scope, since they could influence future revenue mix and capital allocation.</li> <li>⚠️ One major flagged risk is that earnings are forecast to decline by an average of 0.04% per year over the next 3 years, which may temper enthusiasm around the clinical headlines.</li> </ul> <h3>Dig Deeper</h3> <p>For the full picture including more risks and rewards, check out the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb\" rel=\"noopener noreferrer\" target=\"_blank\">complete Bristol-Myers Squibb analysis</a>. Alternatively, you can visit the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/BMY\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Bristol-Myers Squibb</a> to see how other investors believe this latest news will impact the company's narrative.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Bristol-Myers Squibb might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 12:21:41",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb/news/bristol-myers-squibb-cancer-advances-test-valuation-gap-for",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Bull Case For Fairfax Financial Holdings (TSX:FFH) Could Change Following C$650 Million Senior Notes Issuance - Learn Why",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Fairfax Financial Holdings has now completed a C$650 million senior unsecured notes issuance, including C$400 million 4.40% notes due 2036 and an additional C$250 million 5.10% notes due 2055, with proceeds earmarked for refinancing obligations, potential acquisitions, and general corporate purposes.</li> <li>An interesting angle is how this mix of long-dated, fixed-rate funding and flexible use of proceeds could reshape Fairfax’s balance sheet and deal-making capacity over time.</li> <li>We’ll now examine how Fairfax’s sizeable C$650 million senior notes issuance might influence its investment narrative, particularly around capital structure.</li> </ul><p>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/ca\" rel=\"noopener noreferrer\" target=\"_blank\">5 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Fairfax Financial Holdings Investment Narrative Recap</h2><p>To own Fairfax, you generally have to believe in its ability to compound value through disciplined underwriting, opportunistic investing, and thoughtful capital allocation. The new C$650 million senior notes broaden its funding options but do not obviously alter the near term balance between its key upside catalyst (capital deployment into attractive investments or buybacks) and its main risk around earnings sensitivity to interest rates and catastrophe losses; the impact looks incremental rather than transformational for now.</p> <p>In that context, Fairfax’s recent update that it repurchased 572,266 shares for about C$946.84 million under its latest buyback is particularly relevant. Together with the fresh long dated debt, this pairing of issuance and repurchases highlights how the company is actively managing its capital structure around the current catalysts and risk profile, even if the exact mix between debt reduction, new investments, and future buybacks is still to be determined.</p> <p>But investors should also be aware that if interest rates reverse, the same balance sheet that benefits Fairfax today could...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/ca/insurance/tsx-ffh/fairfax-financial-holdings-shares/bvw1rr5q-share-repurchases-and-preferred-redemptions-will-drive-outperformance-amid-currency-risks\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Fairfax Financial Holdings (it's free!)</a></p><p>Fairfax Financial Holdings' narrative projects $41.8 billion revenue and $2.9 billion earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/ca/insurance/tsx-ffh/fairfax-financial-holdings-shares/bvw1rr5q-share-repurchases-and-preferred-redemptions-will-drive-outperformance-amid-currency-risks\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Fairfax Financial Holdings' forecasts yield a CA$2708 fair value</a>, a 15% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/ca/insurance/tsx-ffh/fairfax-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSX:FFH 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/edb5d400-0098-4b2e-af68-888f673ce731/chart/quote-price\" width=\"746\"/></a><figcaption>TSX:FFH 1-Year Stock Price Chart</figcaption></figure> <p>Some of the most optimistic analysts were already assuming about US$41.9 billion of revenue and US$3.8 billion of earnings by 2028, so this fresh C$650 million in long term funding could either reinforce that upbeat story or challenge it, depending on how you feel about interest rate risk and capital deployment.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/ca/insurance/tsx-ffh/fairfax-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 5 other fair value estimates on Fairfax Financial Holdings</a> - why the stock might be worth over 2x more than the current price!</p><h2>Reach Your Own Conclusion</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Fairfax Financial Holdings research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/ca/insurance/tsx-ffh/fairfax-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/ca/insurance/tsx-ffh/fairfax-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Fairfax Financial Holdings research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Fairfax Financial Holdings' overall financial health at a glance.</li></ul><h2>Seeking Other Investments?</h2><p>These stocks are moving-our analysis flagged them today. Act fast before the price catches up:</p><ul><li>The future of work is here. Discover the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 top robotics and automation stocks</a> leading the charge in AI-driven automation and industrial transformation.</li><li>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/ca\" rel=\"noopener noreferrer\" target=\"_blank\">4 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</li><li>Find <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">8 companies with promising cash flow potential yet trading below their fair value</a>.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 12:21:41",
            "link": "https://simplywall.st/stocks/ca/insurance/tsx-ffh/fairfax-financial-holdings-shares/news/the-bull-case-for-fairfax-financial-holdings-tsxffh-could-ch-1",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CubeSmart (CUBE) Margin Compression Challenges Income Focus Narrative After FY 2025 Results",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>CubeSmart (CUBE) has just wrapped up FY 2025 with fourth quarter revenue of US$282.7 million and basic EPS of US$0.34, while trailing twelve month revenue sits at US$1.1 billion and EPS at US$1.46, giving investors a clear read on the top and bottom line heading into the new year. Over recent periods, the company has seen revenue move from US$268.5 million and EPS of US$0.45 in Q4 2024 to US$282.7 million and EPS of US$0.34 in Q4 2025, alongside trailing twelve month EPS shifting from US$1.73 in Q4 2024 to US$1.46 in Q4 2025. With that mix of higher revenue, modest EPS growth over the longer run and margin compression, this result set puts the focus firmly on how durable CubeSmart’s earnings power really is.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-cube/cubesmart\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for CubeSmart.</a> <p>With the headline numbers on the table, the next step is to see how this earnings print lines up against the prevailing narratives around CubeSmart’s growth, income appeal and margin trajectory.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/0tqe1fak-new-york-city-growth-and-sunbelt-trends-will-strengthen-portfolios-u6dh\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about CubeSmart</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-cube/cubesmart/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:CUBE Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/d7425e08-abba-470c-9072-72a4b5c67210/chart/revenue-and-expenses-breakdown?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:CUBE Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Margins Squeezed As Net Income Softens</h2> <ul> <li>On a trailing basis, net income moved from US$391.2 million at a 36.6% margin a year ago to US$333.8 million at a 29.7% margin, so more revenue is now translating into a smaller share of profit.</li> <li>Analysts' consensus view talks about stable occupancy and cost control supporting stronger earnings over time, yet\n    <ul> <li>the step down in net income from US$391.2 million to US$333.8 million sits alongside that 6.9 percentage point margin compression, which shows costs have taken a larger bite out of revenue over the last year,</li> <li>so anyone leaning on the bullish angle of gradually improving margins needs to square that with the recent data that points to pressure on profitability instead.</li> </ul> </li> </ul> <h2>Revenue Up, EPS Growth Lagging Peers</h2> <ul> <li>Trailing twelve month revenue is US$1.1b, growing 4.8% per year compared with the broader US market at 10.3% per year, while EPS growth is 0.8% per year, also well below the US market at 15.6% per year.</li> <li>Bulls highlight resilient demand in dense urban markets and a steady storage need across housing cycles, and that story lines up only partly with the numbers\n    <ul> <li>because the 4.8% revenue growth rate points to a business that is expanding, but not at the pace of the wider market at 10.3% per year,</li> <li>and EPS growth running at 0.8% per year, against 15.6% for the US market, suggests that even with occupancy support, earnings power has not kept up with broader equity benchmarks.</li> </ul> </li> </ul> On this set of figures, bulls argue CubeSmart’s slower growth still rests on sticky demand, but you can see how the recent margin squeeze complicates that story before you read the full case in <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 CubeSmart Bull Case</strong></a>. <h2>Valuation, Yield And Balance Sheet Tension</h2> <ul> <li>At a share price of US$41.14, CubeSmart is trading on a P/E of 28.1x, below a peer average of 37x and slightly below the industry at 29.7x, with a 5.15% dividend yield and a DCF fair value of about US$59.08 indicating a sizeable gap to that modelled value.</li> <li>Skeptics point to balance sheet strain and slower growth, and the data gives them some clear talking points\n    <ul> <li>since one of the key risks flagged is that debt is not well covered by operating cash flow over the last 12 months, which sits awkwardly beside a valuation case built on a DCF fair value of US$59.08 that is well above the current price,</li> <li>and when you pair modest revenue growth of 4.8% per year and 0.8% EPS growth with that 5.15% yield, it underlines that investors are being compensated with income while also taking on a balance sheet that is working harder to support the capital structure.</li> </ul> </li> </ul> Bears often focus on that debt coverage risk alongside slower growth, so if you want to see how far that concern goes, the full case is laid out in <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 CubeSmart Bear Case</strong></a>. <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/0tqe1fak-new-york-city-growth-and-sunbelt-trends-will-strengthen-portfolios-u6dh\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for CubeSmart on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>Reading this, you can probably sense a mix of optimism and concern, so if you want to move quickly and ground your own view in the numbers, take a closer look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-cube/cubesmart\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 1 important warning sign</a> that sit behind the current debate.</p> <h2>See What Else Is Out There</h2> <p>CubeSmart’s softer margins, slower EPS growth than the wider US market and debt coverage concerns all point to a business carrying more financial strain than some investors may prefer.</p> <p>If that mix of margin pressure and balance sheet stress worries you, it is worth quickly checking our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (39 results)</a> to find companies where cash flows support debt more comfortably.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 12:21:41",
            "link": "https://simplywall.st/stocks/us/real-estate/nyse-cube/cubesmart/news/cubesmart-cube-margin-compression-challenges-income-focus-na",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "O'Reilly Accelerates Store Growth As Omnichannel Push Counters DIY Pressures",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>O'Reilly Automotive plans to accelerate new store openings in 2026 to broaden its physical footprint.</li> <li>The company is pushing ahead with an expanded omnichannel offering to connect in store and online sales.</li> <li>These moves come as the DIY segment faces pressure from inflation and tariffs, alongside industry consolidation.</li> </ul> <p>For investors watching NasdaqGS:ORLY, the latest moves are coming off a share price of $93.88, with a 3.9% return year to date and 68.0% over the past 3 years. The stock has also seen a 202.3% return over 5 years, which shows how the market has historically responded to the company’s execution and capital allocation choices.</p> <p>As O'Reilly Automotive emphasizes faster store growth and a stronger omnichannel model, the key question for you is how these efforts could influence the mix between DIY and professional customers over time. The company’s response to inflation, tariffs, and consolidation trends will likely affect how resilient its revenue and margins can be across different market conditions.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/retail/nasdaq-orly/oreilly-automotive/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">O'Reilly Automotive</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NasdaqGS/ORLY\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on O'Reilly Automotive.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/retail/nasdaq-orly/oreilly-automotive/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:ORLY Earnings &amp; Revenue Growth as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/ac1f1c0b-6cec-4fee-928b-0f71e1116760/chart/earnings-and-revenue-growth?date=2026-03-01\" width=\"746\"/></a><figcaption>NasdaqGS:ORLY Earnings &amp; Revenue Growth as at Mar 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_hidden_strengths\" href=\"https://www.simplywall.st/stocks/us/retail/nasdaq-orly/oreilly-automotive\" rel=\"noopener noreferrer\" target=\"_blank\">2 things going right for O'Reilly Automotive that this headline doesn't cover.</a></p> <p>For O'Reilly Automotive, faster store openings and a heavier push into omnichannel look like a clear attempt to lean into what is working: the professional segment and its distribution strengths, while trying to steady a softer DIY customer base. Recent results show 7.8% year over year revenue growth, 5.6% comparable store sales growth, and a 12% rise in operating profit dollars, but also higher SG&amp;A from inflation in healthcare and casualty claims. When you combine that with cautious full year guidance that fell short of analyst expectations, it helps explain why management may be prioritizing scale, service reach, and digital convenience to support future comparable sales and operating margins.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>How This Fits Into The O'Reilly Automotive Narrative</h3> <ul> <li>The faster expansion and omnichannel plans line up with the narrative focus on inventory depth and distribution reach, which is framed as a way to keep service levels high and support same store sales resilience.</li> <li>Rising cost pressure in SG&amp;A, plus weaker DIY demand due to tariffs and inflation, pushes against the narrative assumption that margins can remain steady while the company continues to expand.</li> <li>The specific acceleration to 225 to 235 new stores in 2026 and the emphasis on professional strength are not fully captured in the earlier narrative, which focuses more on store growth generally and trade related sourcing shifts.</li> </ul> <p>Knowing what a company is worth starts with understanding its story.\n<a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/narratives/n8vnl9et-orly-improving-supply-chain-will-drive-resilient-same-store-sales-strength\" rel=\"noopener noreferrer\" target=\"_blank\">Check out one of the top narratives in the Simply Wall St Community for O'Reilly Automotive</a> to help decide what it is worth to you.</p> <h3>The Risks and Rewards Investors Should Consider</h3> <ul> <li>⚠️ Higher SG&amp;A from inflation in healthcare, casualty claims, and store level costs could pressure O'Reilly's 19.5% operating margin if not offset by stronger sales or efficiency gains.</li> <li>⚠️ A weakening DIY segment, influenced by tariffs and inflation, may be a drag on growth if pro demand slows or if competitors like AutoZone and Advance Auto Parts compete harder on price or service.</li> <li>🎁 Earnings grew by 6.3% over the past year and are forecast to grow 6.13% per year, which supports the idea that the dual market model and distribution network are still driving profit growth.</li> <li>🎁 The plan to add 225 to 235 stores in 2026 and the strong professional business create more touchpoints with customers, which can support same store sales and help spread fixed costs across a larger base.</li> </ul> <h3>What To Watch Going Forward</h3> <p>From here, you may want to watch whether the 2026 store cohort and omnichannel investments translate into healthy comparable store sales across both DIY and professional customers, not just headline revenue growth. Keep an eye on how SG&amp;A as a percentage of sales moves, since inflation in healthcare and other store expenses has already been a pressure point. It is also worth tracking how the DIY segment behaves if tariffs or inflation stay elevated, and how O'Reilly's execution compares with peers like AutoZone and Advance Auto Parts on inventory availability, delivery times, and digital ordering.</p> <p>To ensure you are always in the loop on how the latest news impacts the investment narrative for O'Reilly Automotive, head to the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NasdaqGS/ORLY\" rel=\"noopener noreferrer\" target=\"_blank\">community page for O'Reilly Automotive</a> to never miss an update on the top community narratives.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 12:15:56",
            "link": "https://simplywall.st/stocks/us/retail/nasdaq-orly/oreilly-automotive/news/oreilly-accelerates-store-growth-as-omnichannel-push-counter",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vipshop Holdings (VIPS) Valuation After Resilient Earnings Guidance And Shareholder Return Update",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Vipshop Holdings (VIPS) is back in focus after reporting its fourth quarter and full year 2025 results, issuing fresh revenue guidance, increasing its annual dividend, and completing a sizeable share repurchase program.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/retail/nyse-vips/vipshop-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Vipshop Holdings.</a></p> <p>The latest earnings, higher dividend and completed share repurchase come as Vipshop’s share price sits at US$17.42, with a 30 day share price return of 1.81% and a 1 year total shareholder return of 14.83%. The 5 year total shareholder return of a 55.16% decline shows longer term holders have had a tougher run even as more recent momentum has improved.</p> <p>If Vipshop’s update has you looking beyond a single stock, this could be a good moment to scan <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">19 top founder-led companies</a> for other businesses where management is heavily invested in the outcome.</p> <p>With Vipshop trading at US$17.42, sitting on a 63% intrinsic discount estimate and below the average analyst price target, the key question is whether this gap reflects a genuine value opportunity or if the market is already weighing modest revenue growth guidance correctly.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 13.8% Undervalued</h2> <p>Vipshop Holdings most followed narrative puts fair value at $20.21, above the recent $17.42 close, which frames the current valuation gap in a clear way.</p> <blockquote> <p><em>Continuous optimization in cost allocation and fulfillment efficiency, alongside disciplined shareholder returns through buybacks and dividends, underscores financial resilience and capital return capacity, boosting overall net margins and supporting sustainable long-term earnings.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/vw8avxd2-vips-share-buybacks-and-steady-financials-will-support-recovery-prospects\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>If you want to see what sits behind that fair value, the core of this narrative rests on gradual revenue growth, firmer margins and a modestly higher future earnings multiple. The numbers work together quietly but powerfully. The full narrative shows how these moving parts are expected to compound over time.</p> <p><strong>Result: Fair Value of $20.21 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/vw8avxd2-vips-share-buybacks-and-steady-financials-will-support-recovery-prospects\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this hinges on apparel demand and margins holding up. Rising competition or higher costs could quickly challenge the current fair value story.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/retail/nyse-vips/vipshop-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Vipshop Holdings narrative.</a></p> <h2>Next Steps</h2> <p>If this all sounds cautiously upbeat, it is worth checking the details yourself and acting while the information is fresh in the market. To see what is driving the optimism, take a quick look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/retail/nyse-vips/vipshop-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards</a> and decide how it fits with your own view.</p> <h2>Looking for more investment ideas?</h2> <p>If Vipshop has sharpened your focus, do not stop here. Broaden your watchlist with a few targeted idea lists that could surface names you have not considered yet.</p> <ul> <li>Target income potential by scanning <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> that may appeal if you want yields with a focus on resilience.</li> <li>Hunt for possible mispriced opportunities with <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 high quality undervalued stocks</a> and see which businesses currently trade below their fundamentals.</li> <li>Prioritise capital preservation by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">75 resilient stocks with low risk scores</a> that could suit if you prefer steadier return profiles.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:15:56",
            "link": "https://simplywall.st/stocks/us/retail/nyse-vips/vipshop-holdings/news/vipshop-holdings-vips-valuation-after-resilient-earnings-gui",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hyatt Leadership Shift Raises Governance And Reputational Questions For Investors",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Hyatt Hotels (NYSE:H) announced the retirement of Executive Chairman Thomas J. Pritzker after more than two decades in the role.</li> <li>The move comes alongside public mention of Pritzker's past association with Jeffrey Epstein and Ghislaine Maxwell.</li> <li>Hyatt has appointed current CEO Mark S. Hoplamazian as the new Chairman, concentrating leadership in a single figure.</li> <li>The transition highlights both succession planning and governance considerations for the company.</li> </ul> <p>For you as an investor, the key point is that Hyatt Hotels operates as a global hospitality company, with its results closely tied to travel demand, corporate bookings, and leisure trends. Leadership shifts at a company like this can matter because capital allocation, brand priorities, and risk oversight typically flow through the boardroom.</p> <p>The decision to move Mark S. Hoplamazian into the Chairman role suggests Hyatt is aiming for continuity while addressing reputational and governance questions head on. As you assess NYSE:H, this kind of transition is worth watching for any changes in board composition, disclosure practices, or long term direction that could affect how the company is run.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-h/hyatt-hotels/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Hyatt Hotels</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/H\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Hyatt Hotels.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/consumer-services/nyse-h/hyatt-hotels\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:H 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/27434017-c144-4ad1-8d3f-aca9ae5c07f4/chart/quote-price?date=2026-03-01\" width=\"746\"/></a><figcaption>NYSE:H 1-Year Stock Price Chart</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_management\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-h/hyatt-hotels/management\" rel=\"noopener noreferrer\" target=\"_blank\">Does the team leading Hyatt Hotels have what it takes? See our full breakdown of the management team's track record and compensation.</a></p> <p>Pritzker’s retirement brings an end to a long period of family-led oversight and places more responsibility on CEO Mark Hoplamazian, who now serves as both Chairman and Chief Executive Officer. For you as an investor, that concentrates decision making in one person, which can speed up responses on issues like capital allocation, portfolio reshaping, and expansion into markets such as India, where Hyatt has talked about a larger long term footprint. At the same time, combining the roles can raise governance questions about independent challenge in the boardroom, especially when reputational risk has just been put in the spotlight.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>How This Fits Into The Hyatt Hotels Narrative</h3> <ul> <li>The leadership handover to Hoplamazian could support execution of Hyatt’s asset light approach and development pipeline, because the same leader is setting strategy and overseeing the board that signs off on transactions and new projects.</li> <li>Concentrating the Chairman and CEO roles may challenge the governance pillar of the narrative, as some investors prefer separate roles when a company is pursuing large-scale expansion and complex acquisitions.</li> <li>Pritzker’s explicit reference to reputational issues linked to his past association with Jeffrey Epstein and Ghislaine Maxwell, and his focus on stewardship, may not be fully captured in prior narratives that center more on hotel growth and operating performance than on brand and governance risk.</li> </ul> <p>Knowing what a company is worth starts with understanding its story.\n<a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/narratives/jbrfz0ry-h-expanding-luxury-openings-and-buybacks-will-drive-hospitality-leadership\" rel=\"noopener noreferrer\" target=\"_blank\">Check out one of the top narratives in the Simply Wall St Community for Hyatt Hotels</a> to help decide what it's worth to you.</p> <h3>The Risks and Rewards Investors Should Consider</h3> <ul> <li>⚠️ The combination of Chairman and CEO roles can reduce independent oversight, which matters when the company is balancing growth projects, debt obligations, and brand risk in a competitive set that includes Marriott International, Hilton Worldwide, and IHG.</li> <li>⚠️ The public mention of Pritzker’s past association with Jeffrey Epstein and Ghislaine Maxwell introduces a reputational angle that could affect stakeholder perception and potentially influence how partners, guests, or regulators view the company.</li> <li>🎁 Leadership continuity, with a long serving CEO stepping into the Chair role, can help maintain consistency in Hyatt’s asset light approach and its push into markets such as India without a disruptive change at the top.</li> <li>🎁 The board’s emphasis on stewardship and succession planning may support long term stability, which can be important when management is managing a global pipeline and competing with other large operators for owners and franchisees.</li> </ul> <h3>What To Watch Going Forward</h3> <p>From here, keep an eye on how Hyatt’s board structure evolves, including any moves to reinforce independent oversight around Hoplamazian. Watch for disclosures on reputational and governance topics in future filings or shareholder communications, and whether the company adjusts its risk oversight frameworks. On the business side, track how consistently leadership executes on the asset light model and development goals while managing financial risks that analysts have already flagged. Comparing Hyatt’s progress against large peers over the next few years can help you judge whether this leadership setup is helping or hindering execution.</p> <p>To ensure you're always in the loop on how the latest news impacts the investment narrative for Hyatt Hotels, head to the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/H\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Hyatt Hotels</a> to never miss an update on the top community narratives.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Hyatt Hotels might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/consumer-services/nyse-h/hyatt-hotels/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 12:15:56",
            "link": "https://simplywall.st/stocks/us/consumer-services/nyse-h/hyatt-hotels/news/hyatt-leadership-shift-raises-governance-and-reputational-qu",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Scatec (OB:SCATC) Valuation After Barzalosa Solar Milestone And Recent Share Price Momentum",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Scatec (OB:SCATC) has reached a key milestone in Colombia by achieving financial close and beginning construction on its 130 MW Barzalosa solar project, which is supported by a long term power purchase agreement and project financing.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/no/utilities/ob-scatc/scatec-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Scatec.</a></p> <p>Recent announcements across Colombia, Egypt and South Africa appear to sit alongside building momentum in the shares, with a 90 day share price return of 23.22% and a 1 year total shareholder return of 51.36%. However, longer term holders still face a 5 year total shareholder return decline of 47.05%.</p> <p>If this kind of renewable build out has your attention, it could be a good moment to see what else is on the radar and review <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_power_grid\" href=\"https://simplywall.st/discover/investing-ideas/473750/power-grid-technology-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">23 power grid technology and infrastructure stocks</a> as another way to uncover potential ideas.</p> <p>With Scatec’s shares up 51.36% over the past year, trading just 5.7% below the average analyst price target and sitting on a value score of 3, is there still a buying opportunity here, or is future growth already priced in?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 5.4% Undervalued</h2> <p>Scatec last closed at NOK122.60, while the most followed narrative points to a fair value of NOK129.57, using a detailed cash flow and earnings framework built around its global project pipeline.</p> <blockquote> <p><em>The company's rapidly expanding growth portfolio including a record-high backlog of 3.2 GW, an additional 2 GW under construction, and a pipeline of 7.7 GW of mature projects across multiple technologies and geographies signals the potential for continued top-line growth and a doubling of installed capacity over the next two years, which would positively impact future revenues.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/ydn15qo8-expanded-emerging-market-projects-will-influence-profitability-and-mitigate-regulatory-uncertainty\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what kind of growth profile and margin reset need to line up with that build out, under a discount rate above 8%, to reach that fair value? The full narrative lays out the specific revenue path, profit assumptions and future earnings multiple that have to come together to support NOK129.57.</p> <p><strong>Result: Fair Value of NOK129.57 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/ydn15qo8-expanded-emerging-market-projects-will-influence-profitability-and-mitigate-regulatory-uncertainty\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, there are still clear risks, including execution challenges across its emerging market pipeline and assumptions about higher future P/E multiples that may not hold.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/no/utilities/ob-scatc/scatec-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Scatec narrative.</a></p> <h2>Another way to look at value</h2> <p>Our DCF model tells a very different story compared with the narrative fair value of NOK129.57. On that cash flow view, Scatec at NOK122.60 is trading well above an estimated future cash flow value of around NOK7.60, which points to a richly priced stock rather than an undervalued one. Which set of assumptions do you find more realistic?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/no/utilities/ob-scatc/scatec-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/no/utilities/ob-scatc/scatec-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"SCATC Discounted Cash Flow as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/6f76437d-ed38-427b-bde8-59fb8d9ed5df/chart/dcf?date=2026-03-01\" width=\"746\"/></a><figcaption>SCATC Discounted Cash Flow as at Mar 2026</figcaption></figure><p> </p><p>Simply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (<a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://www.simplywall.st/stocks/no/utilities/ob-scatc/scatec-shares\" rel=\"noopener noreferrer\" target=\"_blank\">check out Scatec for example</a>). We show the entire calculation in full. You can track the result in your <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted when this changes, or use our stock screener to discover <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">219 high quality undervalued stocks</a>. If you <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">save a screener</a> we even alert you when new companies match - so you never miss a potential opportunity.</p> <h2>Next Steps</h2> <p>With such mixed signals around value and momentum, how comfortable are you with the trade off between risk and reward here? Are you ready to form your own view based on the underlying data and assumptions, including our breakdown of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/no/utilities/ob-scatc/scatec-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a>?</p> <h2>Ready for more investment ideas?</h2> <p>If you stop with just one stock, you could miss opportunities that better fit your goals, so use the screener to widen your opportunity set with purpose.</p> <ul> <li>Target potential mispricings by scanning a curated set of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">219 high quality undervalued stocks</a> that pair solid fundamentals with room for a better market view.</li> <li>Prioritise resilience by focusing on <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/global\" rel=\"noopener noreferrer\" target=\"_blank\">323 resilient stocks with low risk scores</a> that aim to balance return potential with more controlled downside.</li> <li>Hunt for fresh opportunities that are not on every watchlist yet by reviewing a <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/global\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 566 high quality undiscovered gems</a> built around strong underlying metrics.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:15:55",
            "link": "https://simplywall.st/stocks/no/utilities/ob-scatc/scatec-shares/news/assessing-scatec-obscatc-valuation-after-barzalosa-solar-mil",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is It Time To Reassess Warby Parker (WRBY) After Its Google Partnership And Recent Rally?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Wondering if Warby Parker at around US$25.01 is priced for its brand story or for its actual fundamentals? This article breaks down what the current share price may be implying about value.</li> <li>The stock has had a mixed run, with a 5.5% return over the past week, a 2.0% decline over the last 30 days, a 10.6% return year to date and a 1.1% return over the past year, while the 3 year return sits at 100.4%.</li> <li>Recent headlines around Warby Parker have focused on its position in the US eyewear retail market and its progress as an established direct to consumer brand. This helps frame how investors are thinking about growth opportunities and business risks. These themes are often front of mind for the market when a consumer name like this sees shifts in sentiment and share price.</li> <li>On our checklist based valuation model, Warby Parker currently scores <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/retail/nyse-wrby/warby-parker/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">2 out of 6</a> on undervaluation checks. Next we will compare what different valuation approaches say about that price tag and then look at a broader way of thinking about value at the end of the article.</li> </ul> <p>Warby Parker scores just 2/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/retail/nyse-wrby/warby-parker/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Warby Parker Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model takes forecasts of a company’s future cash flows and discounts them back to today, aiming to estimate what the whole business might be worth right now.</p> <p>For Warby Parker, the model uses a 2 Stage Free Cash Flow to Equity approach, based on cash flow projections in $. The latest twelve month free cash flow is about $41.1 million. Analyst estimates and subsequent extrapolations feed into a ten year path where projected free cash flow reaches $177.2 million in 2030, with intermediate years such as 2026 to 2029 ranging from $60.6 million to $145.7 million before discounting.</p> <p>When all those projected cash flows are discounted back and added up, the DCF model arrives at an estimated intrinsic value of about $29.19 per share. Compared with the current share price of around $25.01, this implies the stock is roughly 14.3% undervalued according to this method.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Warby Parker is undervalued by 14.3%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/retail/nyse-wrby/warby-parker/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"WRBY Discounted Cash Flow as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/451a246a-a01c-44df-9a64-033f9f258c8f/chart/dcf?date=2026-03-01\" width=\"746\"/></a><figcaption>WRBY Discounted Cash Flow as at Mar 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/retail/nyse-wrby/warby-parker/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Warby Parker.</a></p> <h3>Approach 2: Warby Parker Price vs Sales</h3> <p>For companies that are still building profitability or have very high earnings multiples, the P/S ratio is often a cleaner guide because it focuses on revenue, which tends to be less volatile than earnings.</p> <p>In general, the “right” P/S ratio reflects what investors are willing to pay for each dollar of sales, given their expectations for growth and their view of the company’s risks. Higher growth and lower perceived risk usually support a higher multiple, while slower growth or higher risk often go with a lower one.</p> <p>Warby Parker currently trades at a P/S of 3.51x. That sits above the Specialty Retail industry average P/S of 0.46x and below the peer group average of 5.32x. Simply Wall St’s Fair Ratio for Warby Parker is 1.74x, which is its view of what the P/S could be based on factors such as earnings growth, profit margins, industry, market cap and company specific risks.</p> <p>This Fair Ratio is more tailored than a simple comparison to peers or the sector because it tries to line up the multiple with the company’s own profile rather than broad group averages. With the current 3.51x P/S versus a Fair Ratio of 1.74x, the shares screen as trading above that Fair Ratio.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/retail/nyse-wrby/warby-parker/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:WRBY P/S Ratio as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/451a246a-a01c-44df-9a64-033f9f258c8f/chart/ps-multiple-vs-industry?date=2026-03-01\" width=\"746\"/></a><figcaption>NYSE:WRBY P/S Ratio as at Mar 2026</figcaption></figure> <p>P/S ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Warby Parker Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives. With Narratives, you set out a clear story for Warby Parker, link that story to your own revenue, earnings and margin assumptions, and end up with a Fair Value you can compare to the current price on Simply Wall St's Community page, used by millions of investors.</p> <p>A Narrative connects what you think is happening in the business to a financial forecast and then to a Fair Value. It updates automatically when new information like earnings or news, such as the appointment of a new CFO or progress on AI glasses, is added to the platform.</p> <p>For example, one investor might build a more optimistic Warby Parker Narrative with a Fair Value of US$32.00, while another might lean on a more cautious Narrative with a Fair Value of US$18.00. Comparing either of those to the latest market price can help you judge whether the stock looks expensive, cheap, or close to your own view of fair.</p> <p>For Warby Parker however we will make it really easy for you with previews of two leading Warby Parker Narratives:</p> <p>Each one ties a clear story to specific assumptions on revenue, margins and valuation. Use them as starting points, not answers, and decide which feels closer to how you see the business.</p> <p><a href=\"/us/retail/nyse-wrby/warby-parker/ebv0lo7c-google-partnership-and-retail-expansion-will-unlock-new-market-opportunities-hp9u?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Warby Parker Bull Case</strong></a></p> <p>Fair value: US$27.25</p> <p>Implied discount to this fair value at US$25.01: around 8%</p> <p>Revenue growth used in this narrative: 18.78% per year</p> <ul> <li>Assumes expansion of retail stores, shop in shops and eye care services supports higher active customers, higher average revenue per customer and better margins over time.</li> <li>Bakes in an AI and wearable tech angle, including the Google partnership and digital tools, as a way to open up new, higher margin revenue streams and improve efficiency.</li> <li>Accepts execution and competition risks, but treats current pricing as broadly in line with analyst expectations for revenue of about US$1.2b and higher earnings over the next few years.</li> </ul> <p><a href=\"/us/retail/nyse-wrby/warby-parker/y2hgxha2-update-for-warby-parker?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Warby Parker Bear Case</strong></a></p> <p>Fair value: US$18.00</p> <p>Implied premium to this fair value at US$25.01: around 39%</p> <p>Revenue growth used in this narrative: 13.63% per year</p> <ul> <li>Focuses on the risk that AI glasses, heavy store growth and higher fixed costs do not translate into enough incremental profit, which could leave margins under pressure.</li> <li>Flags competition, insurance mix and reduced owned programs like home try on as potential headwinds for average revenue per customer and repeat engagement.</li> <li>Takes the low end of analyst price targets as a guide, viewing the current share price as baking in expectations that may be too optimistic relative to these risks.</li> </ul> <p>Both narratives use analyst style assumptions, but they reach very different conclusions on what counts as a reasonable price for the same cash flows. The real value for you is in deciding which set of assumptions feels closer to your own view of Warby Parker's growth, profitability and risk, then adjusting the numbers until the story and the valuation line up.</p> <p>Do you think there's more to the story for Warby Parker? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/WRBY\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/retail/nyse-wrby/warby-parker\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:WRBY 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/451a246a-a01c-44df-9a64-033f9f258c8f/chart/quote-price?date=2026-03-01\" width=\"746\"/></a><figcaption>NYSE:WRBY 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Warby Parker might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/retail/nyse-wrby/warby-parker/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 12:15:55",
            "link": "https://simplywall.st/stocks/us/retail/nyse-wrby/warby-parker/news/is-it-time-to-reassess-warby-parker-wrby-after-its-google-pa",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thermon Buyout By CECO Sparks Valuation Questions And Fairness Reviews",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Thermon Group Holdings (NYSE:THR) has entered into a definitive agreement to be acquired by CECO Environmental Corp. in a cash and stock deal.</li> <li>The transaction proposes different forms of consideration for existing Thermon shareholders, subject to customary approvals.</li> <li>Law firms have launched investigations into whether the terms of the acquisition are fair to Thermon shareholders.</li> </ul> <p>Thermon shares most recently closed at $50.78, with the stock showing returns of 34.9% year to date and 72.1% over the past year. Over a 3 year period, shares are up 84.6%, and over 5 years they are up 136.7%. This performance provides context as investors assess the terms of the NYSE:THR buyout.</p> <p>For current shareholders, the key considerations now include deal valuation, the mix of cash and stock on offer, and how the merged company might operate if the transaction closes. The ongoing fairness investigations add another factor to consider when evaluating whether the proposed consideration aligns with your view of Thermon's long term potential.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-thr/thermon-group-holdings/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Thermon Group Holdings</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/THR\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Thermon Group Holdings.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-thr/thermon-group-holdings/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:THR Earnings &amp; Revenue Growth as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/b3740fcd-5a08-429e-865a-96433a38068d/chart/earnings-and-revenue-growth?date=2026-03-01\" width=\"746\"/></a><figcaption>NYSE:THR Earnings &amp; Revenue Growth as at Mar 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_hidden_strengths\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-thr/thermon-group-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">3 things going right for Thermon Group Holdings that this headline doesn't cover.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Quick Assessment</h3> <ul> <li><strong>⚖️ Price vs Analyst Target</strong>: At US$50.78 versus a consensus target of US$54.67, the share price sits about 7% below where analysts model Thermon on a standalone basis.</li> <li><strong>❌ Simply Wall St Valuation</strong>: Simply Wall St estimates Thermon is trading about 64% above its fair value, which flags a rich price relative to its intrinsic model.</li> <li><strong>✅ Recent Momentum</strong>: A 30 day return of 12.2% suggests the market has already reacted strongly to the CECO Environmental acquisition news.</li> </ul> <p>There is only one way to know the right time to buy, sell or hold Thermon Group Holdings. Head to Simply Wall St's\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-thr/thermon-group-holdings/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">company report for the latest analysis of Thermon Group Holdings's Fair Value</a>.</p> <h3>Key Considerations</h3> <ul> <li>📊 The cash and stock bid, together with the share price moving close to analyst targets, makes it important to compare the offer value to where you think Thermon should trade on its own.</li> <li>📊 Keep an eye on the implied deal price versus the US$54.67 analyst target, the 28.4x P/E against a 33.3x industry average, and any updates on regulatory or shareholder approvals.</li> <li>⚠️ The ongoing legal investigations into fairness are a key watchpoint because any change to terms, timing, or deal certainty could affect Thermon’s current valuation.</li> </ul> <h3>Dig Deeper</h3> <p>For the full picture including more risks and rewards, check out the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-thr/thermon-group-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">complete Thermon Group Holdings analysis</a>. Alternatively, you can check out the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/THR\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Thermon Group Holdings</a> to see how other investors believe this latest news will impact the company's narrative.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Thermon Group Holdings might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/capital-goods/nyse-thr/thermon-group-holdings/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 12:10:51",
            "link": "https://simplywall.st/stocks/us/capital-goods/nyse-thr/thermon-group-holdings/news/thermon-buyout-by-ceco-sparks-valuation-questions-and-fairne",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HIVE Digital Technologies (TSXV:HIVE) Valuation Checked After Recent Weak Share Price Performance",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>What HIVE Digital Technologies’ recent performance means for investors</h2> <p>HIVE Digital Technologies (TSXV:HIVE) has been on many watchlists after a recent stretch of weak returns, with the share price down 4.5% in the past day and 21.6% over the past month.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/ca/software/tsxv-hive/hive-digital-technologies-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for HIVE Digital Technologies.</a></p> <p>At the current share price of CA$2.94, HIVE Digital Technologies’ recent 1 day and 30 day share price declines sit alongside a 1 year total shareholder return loss of 3.61% and a 5 year total shareholder return loss of 86.73%. These moves may point to fading momentum and shifting risk perceptions among investors.</p> <p>If crypto related moves like HIVE’s have you rethinking where you look for growth and volatility, it could be worth scanning our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_crypto\" href=\"https://simplywall.st/discover/investing-ideas/16734/cryptocurrency-and-blockchain-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">16 cryptocurrency and blockchain stocks</a> as a starting point for other ideas.</p> <p>So with the share price under pressure, annual revenue of $257.136m and a net loss of $125.056m, should you see HIVE Digital Technologies as undervalued today, or is the market already pricing in any potential future growth?</p> <h2>Most Popular Narrative: 65.2% Undervalued</h2> <p>According to the most followed narrative, HIVE Digital Technologies’ fair value of CA$8.45 sits well above the last close of CA$2.94, which frames a sharp gap between market price and narrative expectations.</p> <blockquote> <p><em>HIVE Digital Technologies Ltd. (NASDAQ:HIVE) Equities researchers at HC Wainwright raised their FY2025 EPS estimates for shares of HIVE Digital Technologies in a research note issued on Thursday, November 14th. HC Wainwright analyst M. Colonnese now forecasts that the company will post earnings per share of ($0.33) for the year, up from their prior estimate of ($0.35). HC Wainwright has a \"Buy\" rating and a $8.00 price target on the stock. The consensus estimate for HIVE Digital Technologies' current full-year earnings is ($0.27) per share. HC Wainwright also issued estimates for HIVE Digital Technologies' Q4 2025 earnings at ($0.07) EPS and Q4 2026 earnings at $0.03 EPS.</em></p> </blockquote> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/yfita2sg-buy-rating-for-hive\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Want to see what earnings path and profitability swing sit behind that fair value jump according to prajitdasani? The narrative leans heavily on shifting margins, changing EPS estimates and a future valuation multiple that assumes a very different HIVE to the one in today’s loss making numbers.</p> <p><strong>Result: Fair Value of CA$8.45 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_user_generated_narrative\" href=\"https://www.simplywall.st/narratives/yfita2sg-buy-rating-for-hive\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, you still have to weigh real risks, including ongoing net losses of $125.056m and exposure to crypto related volatility that could further pressure sentiment.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/ca/software/tsxv-hive/hive-digital-technologies-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this HIVE Digital Technologies narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of weak returns and potential upside feels finely balanced, it is worth reviewing the full picture yourself and acting while the data is fresh. This includes our breakdown of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/ca/software/tsxv-hive/hive-digital-technologies-shares\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 4 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If HIVE has sharpened your focus, do not stop here. The right shortlist of new ideas could be the most valuable part of your research today.</p> <ul> <li>Target value first and scan our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">8 high quality undervalued stocks</a> that combine solid fundamentals with prices that some investors may consider appealing.</li> <li>Prioritise resilience by checking our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/ca\" rel=\"noopener noreferrer\" target=\"_blank\">8 resilient stocks with low risk scores</a> for companies that our model flags with lower overall risk profiles.</li> <li>Hunt for future leaders before they are widely followed by reviewing our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/ca\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 6 high quality undiscovered gems</a> with strong underlying fundamentals.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if HIVE Digital Technologies might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/ca/software/tsxv-hive/hive-digital-technologies-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 12:10:51",
            "link": "https://simplywall.st/stocks/ca/software/tsxv-hive/hive-digital-technologies-shares/news/hive-digital-technologies-tsxvhive-valuation-checked-after-r",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Epiroc (OM:EPI A) Valuation Check As Automation And Electrification Story Gains Attention",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Epiroc (OM:EPI A) is back in focus after announcing plans to showcase autonomous, connected and electric mining equipment at Conexpo Con/Agg 2026, a move that ties directly into broader smart mining and emission-reduction themes.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/se/capital-goods/sto-epi-a/epiroc-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Epiroc.</a></p> <p>Against this backdrop, Epiroc’s 1 month share price return of 6.67% and 90 day share price return of 34.21% have added to a 1 year total shareholder return of 32.07%, suggesting that momentum has been building around its automation and electrification story.</p> <p>If the recent interest in smarter, lower emission mining has caught your attention, it could be worth scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_robotics\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 robotics and automation stocks</a> as another way to spot companies tied to advanced equipment and automation themes.</p> <p>With Epiroc trading at a discount to its SEK 235 analyst target and an intrinsic value implying an even richer valuation, you have to ask: is the recent strength still leaving room for upside, or is the market already pricing in future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 16.7% Overvalued</h2> <p>At a last close of SEK271.90 against a narrative fair value of SEK232.95, Epiroc is framed as priced ahead of that model, which hinges on specific long term growth and profitability assumptions.</p> <blockquote> <p><em>Ongoing growth in mining activity, especially around copper and gold, is fueled by energy transition and resource intensity trends, with multiple pipeline expansion and exploration projects cited, with the potential to support above trend equipment orders and aftermarket revenue in coming years.</em></p> </blockquote> <p><em>Read the complete narrative.</em> <a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/mh0dw7ml-autonomous-and-electric-equipment-will-revolutionize-global-mining-1tra\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Curious what kind of revenue path and profit margins are built into that fair value line. The narrative leans on steady compounding, rising returns, and a premium earnings multiple. Want to see the exact assumptions behind that story and how they stack up over the next few years.</p> <p><strong>Result: Fair Value of SEK232.95 (OVERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/mh0dw7ml-autonomous-and-electric-equipment-will-revolutionize-global-mining-1tra\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, the story could change if mining demand softens or if tariffs, supply chain shifts and currency swings continue to reduce margins and cash flow.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/se/capital-goods/sto-epi-a/epiroc-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Epiroc narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of optimism and caution around Epiroc has you thinking, now is a good time to look at the numbers yourself and decide how you feel about its potential. To see what is underpinning the more optimistic angle, take a closer look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/se/capital-goods/sto-epi-a/epiroc-shares\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward</a>.</p> <h2>Ready for more investment ideas?</h2> <p>If Epiroc has sharpened your interest, do not stop here. Put a few more names on your radar so you are not relying on a single story.</p> <ul> <li>Target stability with companies that pass tough balance sheet checks by running our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (372 results)</a> before you commit fresh capital.</li> <li>Hunt for value by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">219 high quality undervalued stocks</a> and see which companies combine quality fundamentals with prices that may not fully reflect them yet.</li> <li>Spot potential future standouts early by reviewing the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/global\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 566 high quality undiscovered gems</a> before everyone else starts talking about them.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Epiroc might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/se/capital-goods/sto-epi-a/epiroc-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 12:10:51",
            "link": "https://simplywall.st/stocks/se/capital-goods/sto-epi-a/epiroc-shares/news/epiroc-omepi-a-valuation-check-as-automation-and-electrifica",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Privia Health Group (PRVA) Is Up 8.0% After Earnings Beat And Higher 2026 Revenue Outlook – Has The Bull Case Changed?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Privia Health Group, Inc. recently reported its fourth-quarter and full-year 2025 results, with revenue rising to US$541.17 million for the quarter and US$2.12 billion for the year, alongside higher net income and earnings per share.</li> <li>The company also issued 2026 guidance calling for GAAP revenue between US$2.35 billion and US$2.45 billion, underscoring how its physician-enablement platform, acquisitions, and expanding value-based care footprint are shaping its growth profile.</li> <li>We’ll now examine how this earnings beat and higher 2026 revenue outlook affect Privia Health Group’s investment narrative and future expectations.</li> </ul><p>Uncover the next big thing with <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/472945/elite-penny-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">31 elite penny stocks</a> that balance risk and reward.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Privia Health Group Investment Narrative Recap</h2><p>To own Privia Health Group, you likely need to believe its physician‑enablement and value‑based care model can keep scaling while preserving thin margins. The latest earnings beat and 2026 revenue guidance support that thesis but do not materially change the key near term catalyst, which is continued provider growth and integration of recent acquisitions. The biggest risk remains that rising healthcare labor costs and staffing shortages could offset operating leverage and keep profitability constrained.</p> <p>The most relevant update here is management’s 2026 GAAP revenue outlook of US$2.35 billion to US$2.45 billion, issued alongside the strong 2025 results. That guidance aligns with Privia’s push to grow its provider base, integrate the acquired Evolent ACO business, and deepen its value‑based contracts, all of which tie directly into the short term catalyst of sustaining volume and earnings growth as its network expands.</p> <p>Yet investors should also be aware of how higher physician and staff costs could pressure margins if...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/healthcare/nasdaq-prva/privia-health-group/c5qcoms5-aging-us-demographics-and-ai-adoption-will-transform-healthcare-services-e65t\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Privia Health Group (it's free!)</a></p><p>Privia Health Group's narrative projects $2.7 billion revenue and $75.9 million earnings by 2028. This requires 11.8% yearly revenue growth and a $61.1 million earnings increase from $14.8 million today.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/healthcare/nasdaq-prva/privia-health-group/c5qcoms5-aging-us-demographics-and-ai-adoption-will-transform-healthcare-services-e65t\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Privia Health Group's forecasts yield a $31.37 fair value</a>, a 32% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/healthcare/nasdaq-prva/privia-health-group\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"PRVA 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/adeb4db7-c4e2-4d2f-b23d-aa88d0f4f748/chart/quote-price\" width=\"746\"/></a><figcaption>PRVA 1-Year Stock Price Chart</figcaption></figure> <p>Three fair value estimates from the Simply Wall St Community cluster between US$30.10 and US$40.82, underscoring how far opinions can diverge. You should weigh those views against Privia’s reliance on expanding its provider network into new markets, which could face higher acquisition costs and tougher competition over time.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/healthcare/nasdaq-prva/privia-health-group\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 3 other fair value estimates on Privia Health Group</a> - why the stock might be worth just $30.10!</p><h2>Reach Your Own Conclusion</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your Privia Health Group research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/healthcare/nasdaq-prva/privia-health-group\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/healthcare/nasdaq-prva/privia-health-group\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Privia Health Group research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Privia Health Group's overall financial health at a glance.</li></ul><h2>Want Some Alternatives?</h2><p>Markets shift fast. These stocks won't stay hidden for long. Get the list while it matters:</p><ul><li>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">27 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</li><li>Explore <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/282/quantum-computing-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 top quantum computing companies</a> leading the revolution in next-gen technology and shaping the future with breakthroughs in quantum algorithms, superconducting qubits, and cutting-edge research.</li><li>Capitalize on the AI infrastructure supercycle with our selection of the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473744/ai-infrastructure-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">34 best 'picks and shovels' of the AI gold rush</a> converting record-breaking demand into massive cash flow.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 12:10:51",
            "link": "https://simplywall.st/stocks/us/healthcare/nasdaq-prva/privia-health-group/news/privia-health-group-prva-is-up-80-after-earnings-beat-and-hi",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tyra Biosciences (TYRA) Valuation Under Review After ASCO Catalysts And Positive Analyst Attention",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Analyst attention and ASCO presentations put Tyra Biosciences in focus</h2> <p>Tyra Biosciences (TYRA) has moved into the spotlight after new positive analyst coverage, alongside progress in its dabogratinib program, including accepted abstracts at the 2026 ASCO Genitourinary Cancers Symposium and ongoing Phase 2 trials.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-tyra/tyra-biosciences\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Tyra Biosciences.</a></p> <p>Those ASCO and conference appearances sit against a backdrop of strong momentum, with the share price at US$33.31, a 90 day share price return of 60.07% and a 1 year total shareholder return of 184.46%. This suggests investor enthusiasm is building around Tyra’s clinical progress.</p> <p>If this biotech story has caught your eye, it could be a good moment to look at other healthcare names too. You could start with our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_healthcare_ai\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">27 healthcare AI stocks</a>.</p> <p>With Tyra trading at US$33.31 and sitting below an average analyst price target of about US$49.29, the key question is whether recent optimism leaves more upside on the table or if the market is already pricing in future growth.</p> <h2>Preferred Price-to-Book of 6.3x: Is it justified?</h2> <p>On a P/B basis, Tyra Biosciences looks expensive, with a 6.3x multiple versus a peer average around 5.1x and a wider US Biotechs industry average of 2.7x.</p> <p>The P/B ratio compares the company’s market value to its net assets on the balance sheet. For early stage biotech names with no revenue and ongoing losses, investors often lean on this multiple because traditional earnings based measures like P/E are not usable.</p> <p>With Tyra currently unprofitable, reporting a loss of $111.684m and a negative Return on Equity of 39.81%, a premium P/B suggests the market is paying more for each dollar of net assets than for many peers. Given that Tyra is also considered expensive relative to companies of similar size, this higher multiple can be seen as the market placing a higher value on its pipeline and FGFR focused platform. This is despite earnings still being negative and not forecast to turn profitable over the next 3 years.</p> <p>Compared with both its direct peer set P/B of 5.1x and the broader US Biotechs P/B of 2.7x, Tyra’s 6.3x stands out as materially higher. That is a strong relative premium that relies heavily on investor confidence in future execution rather than current financials.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-tyra/tyra-biosciences/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p><strong>Result: Price-to-Book of 6.3x (OVERVALUED)</strong></p> <p>However, the story could change quickly if clinical trial data disappoints or if funding conditions tighten, especially given the ongoing losses and lack of current revenue.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-tyra/tyra-biosciences\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Tyra Biosciences narrative.</a></p> <h2>Next Steps</h2> <p>If this feels like a bullish setup, it is worth checking the underlying data yourself and deciding how comfortable you are with the current risk profile. To help with that, you may want to review the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-tyra/tyra-biosciences\" rel=\"noopener noreferrer\" target=\"_blank\">2 important warning signs</a> before you make any decisions.</p> <h2>Looking for more investment ideas?</h2> <p>Once you have formed a view on Tyra, do not stop there. Casting a wider net of ideas could sharpen your overall portfolio decisions.</p> <ul> <li>Target consistency by reviewing companies in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">75 resilient stocks with low risk scores</a>, which focuses on businesses with more resilient profiles and fewer red flags according to our model.</li> <li>Hunt for potential bargains with the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 high quality undervalued stocks</a>, where strong fundamentals and more appealing valuations come together in one focused list.</li> <li>Strengthen your income stream by scanning the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a>, featuring companies with higher yields that might suit a more cash focused approach.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Tyra Biosciences might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/pharmaceuticals-biotech/nasdaq-tyra/tyra-biosciences/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 12:10:51",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-tyra/tyra-biosciences/news/tyra-biosciences-tyra-valuation-under-review-after-asco-cata",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        }
    ]
}