{
    "data": [
        {
            "title": "Is It Too Late To Consider OR Royalties (TSX:OR) After Its 1-Year 136% Rally?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether OR Royalties is still fairly priced after a strong run, this article walks through how its current share price stacks up against different ways of thinking about value.</li> <li>The stock last closed at C$62.66, with returns of 5.1% over 7 days, 0.4% over 30 days, 29.5% year to date, 136.2% over 1 year and 251.2% over 3 years. These figures can change how investors think about both upside potential and risk.</li> <li>Recent coverage of OR Royalties has focused on its royalty and streaming profile and how that structure can appeal to investors who want exposure to the materials sector without operating mines directly. This context helps explain why the share price performance may be drawing more attention from both existing and new shareholders.</li> <li>According to Simply Wall St's value checks, OR Royalties scores <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-or/or-royalties-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">1 out of 6</a> on undervaluation. Next we will compare several valuation approaches and then finish by looking at a broader framework that can help you judge whether the market price really matches the story.</li> </ul> <p>OR Royalties scores just 1/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-or/or-royalties-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: OR Royalties Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model projects a company’s future cash flows and then discounts them back to today’s value. The goal is to estimate what the business might be worth per share at present.</p> <p>For OR Royalties, the model used is a 2 Stage Free Cash Flow to Equity approach, based on cash flow projections in $. The latest twelve month free cash flow is about $106 million. Analysts and internal estimates project annual free cash flow rising to $513.3 million by 2035, with specific forecast points such as $288.4 million in 2026 and $391 million in 2029. Simply Wall St notes that analysts typically provide up to 5 years of estimates, and the later years are extrapolated within the model.</p> <p>Bringing all those projected cash flows back to today, the DCF produces an estimated intrinsic value of $63.24 per share, compared with the recent share price of C$62.66. That difference suggests the stock is approximately 0.9% undervalued, which is a very small gap.</p> <p><strong>Result: ABOUT RIGHT</strong></p> <p>OR Royalties is fairly valued according to our <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-or/or-royalties-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Discounted Cash Flow (DCF)</a>, but this can change at a moment's notice. Track the value in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted on when to act.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/ca/materials/tsx-or/or-royalties-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"OR Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/586d5568-d92a-420b-8bdf-8bed829971e7/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>OR Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-or/or-royalties-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for OR Royalties.</a></p> <h3>Approach 2: OR Royalties Price vs Earnings</h3> <p>For a profitable company like OR Royalties, the P/E ratio is a practical way to think about value because it connects what you pay per share to the earnings the business is already generating. Investors typically accept a higher P/E when they expect stronger growth or see the earnings as lower risk, and a lower P/E when growth expectations or risk levels are more modest.</p> <p>OR Royalties currently trades on a P/E of 41.68x. That is higher than both the Metals and Mining industry average P/E of 22.52x and the peer average of 24.97x. On the surface, that suggests the market is paying a richer price for each dollar of OR Royalties' earnings compared with many sector peers.</p> <p>Simply Wall St's Fair Ratio for OR Royalties is 20.33x. This is a proprietary estimate of what a reasonable P/E could be, given the company’s earnings growth profile, industry, profit margins, market cap and risk characteristics. Because it blends these factors, the Fair Ratio can give you a more tailored reference point than a simple comparison with peer or industry averages. With the current P/E of 41.68x sitting well above the Fair Ratio of 20.33x, the shares screen as expensive on this metric.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/ca/materials/tsx-or/or-royalties-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSX:OR P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/586d5568-d92a-420b-8bdf-8bed829971e7/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>TSX:OR P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/ca\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 3 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your OR Royalties Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple tool on Simply Wall St's Community page. Here you attach a clear story about OR Royalties to your own assumptions for future revenue, earnings and margins, link that story to a financial forecast and a Fair Value, compare that Fair Value to the current price to decide whether the stock looks attractive or not, and then see it update automatically when new news or earnings arrive. For example, one investor might build a more cautious OR Royalties Narrative that aligns with a Fair Value of about C$52.24, while another might build a more optimistic Narrative closer to C$80.37, each reflecting different views on how projects progress, margins develop and what P/E the market is likely to accept.</p> <p>For OR Royalties, here are previews of two leading OR Royalties Narratives:</p> <p><a href=\"/ca/materials/tsx-or/or-royalties-shares/2p5htw37-update-for-or-royalties?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 OR Royalties Bull Case</strong></a></p> <p>Fair value: C$80.37</p> <p>Gap to fair value: about 22% below this bullish fair value based on the recent C$62.66 share price</p> <p>Assumed revenue growth: 30.30% a year</p> <ul> <li>Analysts in this camp model faster growth in royalty volumes from Canadian Malartic, Odyssey Underground and other Tier 1 assets, supported by a mix of gold and growing silver exposure.</li> <li>The narrative focuses on a debt free balance sheet and roughly US$1b of available liquidity to support new royalty and streaming deals that could influence revenue and free cash flow per share.</li> <li>To line up with this view, you would need to be comfortable with earnings rising to US$337.1m by 2028, higher profit margins near 62.5% and a P/E of about 41.3x on those earnings.</li> </ul> <p><a href=\"/ca/materials/tsx-or/or-royalties-shares/8vp0ahtl-update-for-or-royalties?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 OR Royalties Bear Case</strong></a></p> <p>Fair value: C$52.24</p> <p>Gap to fair value: about 20% above this bearish fair value based on the recent C$62.66 share price</p> <p>Assumed revenue growth: 21.96% a year</p> <ul> <li>This view highlights execution risk at assets such as Canadian Malartic, Dalgaranga and CSA, where timelines, recoveries and mine planning could influence how quickly additional gold equivalent ounces reach OR Royalties.</li> <li>It also considers the possibility that new deals arrive more slowly if management keeps a tight filter on pricing and contract quality in a competitive royalty market.</li> <li>To agree with this stance, you would need to assume earnings of about US$281.0m by 2029, margins around 63.6% and a lower, but still elevated, P/E of about 31.8x on those earnings.</li> </ul> <p>These two Narratives show how different assumptions about growth, project execution and valuation multiples can lead to very different fair values for the same stock. The key is to decide which set of assumptions aligns more closely with your own view of OR Royalties and its royalty portfolio.</p> <p>Do you think there's more to the story for OR Royalties? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/TSX/OR\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/ca/materials/tsx-or/or-royalties-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSX:OR 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/586d5568-d92a-420b-8bdf-8bed829971e7/chart/quote-price?date=2026-02-26\" width=\"746\"/></a><figcaption>TSX:OR 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 08:21:06",
            "link": "https://simplywall.st/stocks/ca/materials/tsx-or/or-royalties-shares/news/is-it-too-late-to-consider-or-royalties-tsxor-after-its-1-ye",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is It Too Late To Consider Buying Linde (LIN) After Its Strong Multi‑Year Rally?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Linde is still reasonably priced after its recent run, this breakdown will help you see how the current share price lines up with different measures of value.</li> <li>The stock last closed at US$508.27, with returns of 4.7% over 7 days, 11.7% over 30 days, 18.4% year to date, 11.6% over 1 year, 51.0% over 3 years and 120.0% over 5 years.</li> <li>Recent coverage has focused on Linde as a large industrial gases company. Investors are paying close attention to its role in sectors such as manufacturing and energy. This backdrop has kept interest high as the market weighs how future projects, investments and long term contracts might affect the long term story and what investors are currently willing to pay for the shares.</li> <li>Right now Linde scores 1 out of 6 on our valuation checks for being undervalued. You can see the full breakdown in our <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/materials/nasdaq-lin/linde/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation score</a>. We will unpack this using several common methods before looking at a more complete way to think about what the stock is worth.</li> </ul> <p>Linde scores just 1/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/materials/nasdaq-lin/linde/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Approach 1: Linde Discounted Cash Flow (DCF) Analysis</h2> <p>A Discounted Cash Flow, or DCF, model projects a company’s future cash flows and then discounts them back to today using a required rate of return. The idea is to estimate what those future cash flows are worth in today’s dollars and compare that with the current share price.</p> <p>For Linde, the model used is a 2 Stage Free Cash Flow to Equity approach built on cash flow projections. The latest twelve month free cash flow is about $5.74b. Analyst estimates and extrapolated figures suggest projected free cash flow of $9.40b by 2030, with a series of annual projections between 2026 and 2035 that are discounted back to today.</p> <p>Pulling all of those discounted cash flows together, the DCF model arrives at an estimated intrinsic value of about $397.28 per share. Compared with the recent share price of US$508.27, this indicates the stock is roughly 27.9% overvalued based on these cash flow assumptions.</p> <p><strong>Result: OVERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Linde may be overvalued by 27.9%. <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">Discover 53 high quality undervalued stocks</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">create your own screener</a> to find better value opportunities.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/materials/nasdaq-lin/linde/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"LIN Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/eb5ee3aa-9d1a-4bb1-8127-16e0748e83af/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>LIN Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/materials/nasdaq-lin/linde/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Linde.</a></p> <h2>Approach 2: Linde Price vs Earnings</h2> <p>For a profitable company like Linde, the P/E ratio is a useful way to think about what you are paying for each dollar of current earnings. Investors usually accept a higher P/E when they expect stronger growth or see the earnings as relatively resilient, and a lower P/E when they see more risk or slower growth.</p> <p>Linde currently trades on a P/E of 34.41x. That sits above the broader Chemicals industry average P/E of 24.38x and below the peer group average of 40.17x. Simply comparing with peers or the industry gives you a rough sense of how the market is pricing Linde, but it does not adjust for the company’s specific earnings growth profile, profit margins, size or risk.</p> <p>To address that, Simply Wall St estimates a “Fair Ratio” for Linde of 28.92x. This is a proprietary P/E level that reflects factors such as the company’s earnings growth, its industry, profit margins, market capitalization and risk profile. Because it is tailored to the company, this Fair Ratio can be more informative than a simple comparison with peers or the sector. With the current P/E of 34.41x sitting above the Fair Ratio of 28.92x, the shares screen as overvalued on this metric.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/materials/nasdaq-lin/linde/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:LIN P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/eb5ee3aa-9d1a-4bb1-8127-16e0748e83af/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>NasdaqGS:LIN P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 21 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Linde Narrative</h3> <p>Earlier we mentioned that there is an even better way to think about valuation. On Simply Wall St this comes through Narratives, where you set out your own story for Linde, link that story to specific forecasts for revenue, earnings and margins, and then see a Fair Value that you can compare with the current price. All of this is available within an easy tool on the Community page that updates automatically when new earnings or news arrive. For instance, one investor might build a more optimistic Linde Narrative that lines up with a higher fair value closer to US$576, based on stronger long term project expectations. Another might build a more cautious Narrative tied to a lower fair value near US$381. By seeing those different views side by side, you can decide which story and valuation feels more realistic for you.</p> <p>Do you think there's more to the story for Linde? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NasdaqGS/LIN\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/materials/nasdaq-lin/linde\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:LIN 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/eb5ee3aa-9d1a-4bb1-8127-16e0748e83af/chart/quote-price?date=2026-02-26\" width=\"746\"/></a><figcaption>NasdaqGS:LIN 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 08:21:06",
            "link": "https://simplywall.st/stocks/us/materials/nasdaq-lin/linde/news/is-it-too-late-to-consider-buying-linde-lin-after-its-strong",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OPmobility (ENXTPA:OPM) Margin Uptick Tests Bullish Expansion Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>OPmobility (ENXTPA:OPM) Posts FY 2025 First Half Results</h2> <p>OPmobility (ENXTPA:OPM) has reported first half FY 2025 revenue of €5.3b with basic EPS of €0.63, setting the tone for how its profitability story is evolving this year. The company has seen revenue move from €5.1b and EPS of €0.49 in H2 2024 to €5.3b and EPS of €0.63 in H1 2025, compared with a prior H1 2024 reference point of €5.4b in revenue and EPS of €0.69. This gives investors a clearer view of how the top line and per share earnings are tracking through the cycle. With trailing net profit margin at 1.8% and earnings up 8.8% over the past year, the results highlight how margin quality factors into the interpretation of this latest release.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/fr/automobiles/epa-opm/opmobility-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for OPmobility.</a> <p>With the headline numbers on the table, the next step is to see how this earnings profile lines up with the key stories investors usually tell about OPmobility, including its growth potential, risks and the balance between revenue momentum and margins.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/trzoo1aa-analysts-raise-opmobility-price-target-citing-stable-margins-and-improved-risk-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about OPmobility</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/fr/automobiles/epa-opm/opmobility-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ENXTPA:OPM Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/fe6b20b0-d432-43b6-a908-30d3a5a8a02c/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>ENXTPA:OPM Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <h2>Margins Improve With 1.8% Net Profit</h2> <ul> <li>On a trailing basis, OPmobility is earning €185 million on €10.2b of revenue, which works out to a 1.8% net profit margin compared with 1.6% last year and earnings growth of 8.8% over the same period.</li> <li>Bulls argue that tighter cost control and integration of the Exterior and Lighting businesses can support higher margins over time. The margin lift from 1.6% to 1.8% partly lines up with that, yet the latest half year still shows net income of €90 million on €5.3b of revenue, which is a slim margin, so the bullish view relies on this recent margin level being a base, not a peak.\n    <ul> <li>The bullish narrative talks about margin expansion from around 1.5% to 3.5% over several years, while the trailing 1.8% margin shows some progress but is still far from that 3.5% figure.</li> <li>H1 FY 2025 net income of €90 million is below the €100 million from H1 FY 2024, so the short term pattern does not yet fully match the stronger and more resilient earnings path bulls are hoping for.</li> </ul> </li> </ul> <p>Stronger recent margins and earnings growth look like early support for the bullish story, but the gap between a 1.8% margin today and much higher targets keeps the bull case very dependent on future execution that is not yet in the half year numbers. <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/j0gp2vpb-global-electric-adoption-will-expand-connected-vehicle-ecosystems-x1jh\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 OPmobility Bull Case</strong></a></p> <h2>Valuation Gap Versus €39.56 DCF Fair Value</h2> <ul> <li>The shares trade at €17.63 with a trailing P/E of 13.6x, while the provided DCF fair value is €39.56, which is 55.4% above the current price, and the P/E sits above a 12.2x peer average but below the 14x wider European Auto Components group.</li> <li>Consensus narrative points out that the market might be baking in ambitious growth and margin gains. The tension shows up here, because the wide gap between €17.63 and the €39.56 DCF fair value looks supportive for optimists, yet the higher P/E than peers and analyst price target level of €17.94 both suggest other investors are more cautious than that DCF implies.\n    <ul> <li>Analysts expect earnings to rise to €291.9 million by around 2028 with margins moving from roughly 1.5% to 2.7%, but the current trailing earnings base of €185 million and 1.8% margin means that uplift still needs to come through.</li> <li>The consensus target of €17.94 is only slightly above the current €17.63 price and well below the €39.56 DCF fair value, which shows how differently the cash flow model and analyst targets are treating future growth and risk.</li> </ul> </li> </ul> <h2>Debt And Dividend Track Record Under Bear Scrutiny</h2> <ul> <li>Risk flags highlight a high level of debt and an unstable dividend history, alongside relatively modest forecast revenue growth of about 2% per year versus a 5.6% market benchmark, even as trailing earnings grew 8.8% and 5 year earnings growth is cited at 16.9% per year.</li> <li>Bears focus on the combination of debt, legacy product exposure and pressure from EV and ESG shifts, and the numbers give them some support, because modest revenue growth expectations alongside that debt profile and an uneven dividend record can limit flexibility if conditions stay tough, even though recent earnings growth and margin improvement mean the company is not matching the more severe earnings pressure that a very bearish view might suggest.\n    <ul> <li>Forecast earnings growth of about 15.1% per year contrasts with only 2% revenue growth, which fits with a bear concern that cost cutting and mix, rather than broad based top line growth, are doing a lot of the work.</li> <li>The unstable dividend and leverage risk do not show up directly in the half year income statement, yet they sit in the background when you weigh how sustainable a 1.8% margin and 8.8% earnings growth might be if the auto cycle or regulation turns less helpful.</li> </ul> </li> </ul> <p>If you are weighing those balance sheet and revenue risks against</p>Next Steps\n<p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/trzoo1aa-analysts-raise-opmobility-price-target-citing-stable-margins-and-improved-risk-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for OPmobility on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>If this mix of optimism and concern feels finely balanced, now is a good time to look through the numbers yourself and stress test your view. That includes weighing up the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/fr/automobiles/epa-opm/opmobility-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a> that our work has surfaced around the stock.</p> <h2>Explore Alternatives</h2> <p>OPmobility's slim 1.8% net margin, reliance on cost control instead of broad revenue growth, and concerns around leverage and dividend stability may leave you wanting a sturdier profile.</p> <p>If those balance sheet and income statement questions feel uncomfortable, take a look at our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (369 results)</a> to quickly find companies where financial strength is front and center.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 08:21:06",
            "link": "https://simplywall.st/stocks/fr/automobiles/epa-opm/opmobility-shares/news/opmobility-enxtpaopm-margin-uptick-tests-bullish-expansion-n",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Altareit (ENXTPA:AREIT) Half Year Revenue Of €859.8 Million Reinforces Cautious Investor Narratives",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Altareit (ENXTPA:AREIT) has posted its FY 2025 first half results with revenue of €859.8 million and basic EPS of €4.63 loss, setting a cautious tone for investors tracking the REIT’s latest update. The company has seen revenue shift from €1.13 billion in the first half of FY 2024 to €1.48 billion in the second half of FY 2024, before landing at €859.8 million in the first half of FY 2025. Basic EPS moved from a €6.01 loss to a €28.88 loss over FY 2024 and then to a €4.63 loss in the latest period, leaving the story centered on pressure at the earnings line and the strain that puts on margins.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/fr/real-estate-management-and-development/epa-areit/altareit-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Altareit.</a> <p>With the headline numbers on the table, the next step is to see how this earnings print lines up with the widely held narratives around Altareit’s trajectory, and where the data may support or challenge those views.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/fr/real-estate-management-and-development/epa-areit/altareit-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ENXTPA:AREIT Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/4b8aa93f-4e3f-4720-b6c9-917c7c3139e3/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>ENXTPA:AREIT Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Losses Persist At Net Income Level</h2> <ul> <li>Altareit reported net income excluding extra items of an €8.1 million loss in the first half of FY 2025, compared with losses of €10.5 million in the first half of FY 2024 and €50.5 million in the second half of FY 2024, while trailing 12 month net income stands at a €67.1 million loss.</li> <li>Critics highlight that the company is unprofitable, with net losses having grown at about 48.3% per year over five years, and the current figures back up that concern.\n    <ul> <li>The trailing 12 month net income loss of €67.1 million sits well above the latest half year loss of €8.1 million, which points to pressure persisting beyond a single reporting period.</li> <li>With no positive EPS in any of the reported halves and a trailing 12 month basic EPS of a €38.38 loss, the bearish focus on weak profitability is strongly supported by the numbers provided.</li> </ul> </li> </ul> <h2>Revenue Scale Versus Ongoing Losses</h2> <ul> <li>On a trailing 12 month basis to the second half of FY 2025, Altareit generated €1.98b of revenue but still recorded a €67.1 million net income loss, highlighting that sizeable revenue has not translated into positive bottom line results in this dataset.</li> <li>Bears argue that this disconnect between revenue and earnings points to structural pressure, and the trailing figures give them plenty to point to.\n    <ul> <li>Across the three trailing 12 month snapshots provided, revenue moves from €2.61b to €2.34b and then to €1.98b, while net income stays in loss territory between €58.6 million and €67.1 million, which does not suggest a clear path to profitability in these numbers.</li> <li>With no forward forecasts in the input and repeated losses alongside multi billion euro revenue, the cautious narrative around business efficiency is reinforced by the available data.</li> </ul> </li> </ul> <h2>Valuation Multiples Face Profitability Risk</h2> <ul> <li>Altareit trades on a P/S of 0.5x, above the stated peer average of 0.4x but well below the European Real Estate industry average of 4.7x, while the company remains loss making on a trailing 12 month basis.</li> <li>What stands out for bearish investors is that even this relatively low P/S comes with several flagged financial risks, which keeps the focus on balance sheet strength and cash flow rather than headline multiples alone.\n    <ul> <li>The analysis notes that operating cash flow does not adequately cover debt, so the company is carrying debt risk at the same time as posting a €67.1 million net income loss over the latest trailing 12 month period.</li> <li>With earnings described as having declined around 48.3% per year over five years, bears see the current 0.5x P/S as not automatically cheap when weighed against sustained losses and weak cash coverage of debt.</li> </ul> </li> </ul> <p>Curious how other investors are reading these numbers for a loss making REIT trading on a 0.5x P/S, and whether the risks around debt coverage change the story for you, check what the broader community is saying in <a class=\"company-report-links\" data-vars-link-type=\"cta_consensus_narrative_link\" href=\"https://simplywall.st/stock/ENXTPA/AREIT\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>📊 Read the what the Community is saying about Altareit.</strong></a></p> <h2>Next Steps</h2> <p>Don't just look at this quarter; the real story is in the long-term trend. We've done an in-depth analysis on Altareit's <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/fr/real-estate-management-and-development/epa-areit/altareit-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">growth</a> and its <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/fr/real-estate-management-and-development/epa-areit/altareit-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation</a> to see if today's price is a bargain. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> now so you don't miss the next big move.</p> <p>If the tone here feels cautious, that is intentional. The real test is how the numbers stack up for you personally, so take a moment to review the full risk rundown in <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_analysis\" href=\"https://www.simplywall.st/stocks/fr/real-estate-management-and-development/epa-areit/altareit-shares\" rel=\"noopener noreferrer\" target=\"_blank\">2 important warning signs</a></p> <h2>See What Else Is Out There</h2> <p>Altareit is generating multi billion euro revenue but remains loss making, with persistent net income pressure, weak earnings per share and concerns over debt coverage.</p> <p>If that combination of ongoing losses and debt risk feels uncomfortable, shift your focus to companies in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (369 results)</a> that prioritize stronger balance sheets and potentially steadier financial footing.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 08:21:06",
            "link": "https://simplywall.st/stocks/fr/real-estate-management-and-development/epa-areit/altareit-shares/news/altareit-enxtpaareit-half-year-revenue-of-8598-million-reinf",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing TPG Telecom’s Valuation As Spacetalk Software Partnership Progresses Toward Binding Agreement",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>The new Memorandum of Understanding between TPG Telecom (ASX:TPG) and Spacetalk to distribute Family Safety software to Vodafone postpaid customers puts TPG’s role in embedded software partnerships in the spotlight for shareholders.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/au/telecom/asx-tpg/tpg-telecom-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for TPG Telecom.</a></p> <p>At a share price of A$4.05, TPG Telecom has a 1 day share price return of 3.58%, adding to a 90 day share price return of 8.00% and a 1 year total shareholder return of 30.67%. This pattern suggests momentum has been building rather than fading.</p> <p>If this shift toward embedded software partnerships has your attention, it could be a good moment to broaden your watchlist with our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/au\" rel=\"noopener noreferrer\" target=\"_blank\">2 top founder-led companies</a> as another source of potential ideas.</p> <p>With TPG trading close to analyst targets and carrying an intrinsic value premium, yet showing strong recent share price momentum, should you see room for mispricing here or assume the market is already pricing in future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 5.4% Undervalued</h2> <p>With TPG Telecom's most followed narrative pointing to a fair value of A$4.28 against a last close of A$4.05, the story hinges on what its 5G and digital investments could mean for future cash generation and margins.</p> <blockquote> <p><em>Material network and IT investment cycles including 5G rollout, Huawei equipment replacement, and brand system overhauls are now largely complete, setting up a multi-year period of structurally lower capex. This will directly boost free cash flow conversion and capital returns, while also enabling cost-outs ($100m targeted by 2029) to flow through to net profit.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/idnfybif-5g-and-digital-investments-will-transform-australias-telecom-landscape-vzh1\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what earnings profile and margin shape sit behind that fair value, and how lower capex, forecast profitability and a higher future earnings multiple all fit together? The full narrative lays out the cash flow story line by line, including the trade off between modest revenue expectations and a much stronger profit base.</p> <p><strong>Result: Fair Value of A$4.28 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/idnfybif-5g-and-digital-investments-will-transform-australias-telecom-landscape-vzh1\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, there is still real execution risk, especially if intense mobile and broadband competition crimps margins or complex IT consolidation and cyber issues disrupt customer service.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/au/telecom/asx-tpg/tpg-telecom-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this TPG Telecom narrative.</a></p> <h2>Another View: Cash Flows Paint A Different Picture</h2> <p>While the popular narrative sees TPG Telecom as 5.4% undervalued with a fair value of A$4.28, our DCF model points the other way. On future cash flows, TPG is estimated at A$3.50, below the current A$4.05 share price. This frames the stock as overvalued by this method. As an investor, which story do you think better reflects the risks around execution, competition, and profitability turning around?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/au/telecom/asx-tpg/tpg-telecom-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/au/telecom/asx-tpg/tpg-telecom-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TPG Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/ae2fc5f2-ca53-4dfc-9f76-ffab1e586335/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>TPG Discounted Cash Flow as at Feb 2026</figcaption></figure><p> </p><p>Simply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (<a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://www.simplywall.st/stocks/au/telecom/asx-tpg/tpg-telecom-shares\" rel=\"noopener noreferrer\" target=\"_blank\">check out TPG Telecom for example</a>). We show the entire calculation in full. You can track the result in your <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted when this changes, or use our stock screener to discover <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/au\" rel=\"noopener noreferrer\" target=\"_blank\">9 high quality undervalued stocks</a>. If you <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">save a screener</a> we even alert you when new companies match - so you never miss a potential opportunity.</p> <h2>Next Steps</h2> <p>If this mix of upside and concern leaves you on the fence, take a moment now to weigh both sides for yourself using <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/au/telecom/asx-tpg/tpg-telecom-shares\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 1 important warning sign</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If you are weighing different stories and valuations, it makes sense to widen your opportunity set now rather than wait for headlines to force your hand.</p> <ul> <li>Spot potential value early by checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/au\" rel=\"noopener noreferrer\" target=\"_blank\">9 high quality undervalued stocks</a> that pair solid fundamentals with prices that may not fully reflect their quality.</li> <li>Prioritise resilience by scanning <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/au\" rel=\"noopener noreferrer\" target=\"_blank\">7 resilient stocks with low risk scores</a> that score well on stability so sudden surprises are less likely to catch you off guard.</li> <li>Get ahead of the crowd by reviewing our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/au\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 11 high quality undiscovered gems</a> before they attract wider attention and tighter pricing.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if TPG Telecom might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/au/telecom/asx-tpg/tpg-telecom-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:21:06",
            "link": "https://simplywall.st/stocks/au/telecom/asx-tpg/tpg-telecom-shares/news/assessing-tpg-telecoms-valuation-as-spacetalk-software-partn",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Universal Health Services Q4 EPS Strength Reinforces Bullish Margin Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Universal Health Services (UHS) has wrapped up FY 2025 with fourth quarter revenue of US$4.5b and basic EPS of US$7.19, backed by net income of US$445.9m. The company has seen quarterly revenue move from US$4.1b in Q4 2024 to US$4.5b in Q4 2025, while basic EPS stepped up from US$5.07 to US$7.19 over the same period. On a trailing twelve month view, net profit margin sits at 8.6% versus 7.2% a year earlier, giving investors a clearer view of how earnings are converting into profit.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Universal Health Services.</a> <p>With the latest numbers on the table, the next step is to see how this earnings profile lines up with the key narratives around UHS, highlighting where the story is confirmed and where expectations might need to be revisited.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/rdizidzn-lower-medicaid-payments-and-rising-costs-will-erode-margins\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Universal Health Services</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:UHS Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/dc1969cb-1517-4f94-bfaa-fe82aca6adfc/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:UHS Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>TTM earnings up 30.4% with profit margin at 8.6%</h2> <ul> <li>Over the trailing twelve months, UHS generated US$23.42 in basic EPS and US$1.5b in net income on US$17.4b of revenue, with net profit margin at 8.6% compared with 7.2% a year earlier.</li> <li>What stands out for the bullish view is that this 30.4% trailing earnings growth and higher margin line up with arguments about expanding behavioral health and outpatient capacity. At the same time, the consensus narrative also flags future Medicaid payment reductions, so current profitability and the longer term policy overhang are pulling in different directions.</li> </ul> <h2>Low 8.6x P/E against healthcare peers</h2> <ul> <li>UHS trades on a trailing P/E of 8.6x compared with 23.6x for the wider US healthcare industry and 27x for peers, even though trailing earnings have grown 30.4% year over year and have risen about 7.3% per year over the last five years according to the supplied data.</li> <li>Bulls point to this apparent valuation gap and recent earnings strength as support for their case that the company could justify higher pricing. Yet the current share price of US$204.33 still sits well below the cited DCF fair value of about US$588.00 and below the allowed analyst target of US$253.00, which means the bullish argument about underappreciated growth is being made against forecasts that show earnings and revenue growth of 3.1% and 4.2% per year respectively, both slower than the US market in the inputs.\n    <ul> <li>That tension between a low P/E and slower forecast growth is central to the bullish narrative that outpatient and behavioral expansion, plus technology efficiencies, could support higher margins than the consensus currently embeds.</li> <li>At the same time, the supplied data notes the stock trading materially below the DCF fair value and below US$253.00, which bullish investors treat as evidence that the market is not fully crediting the 30.4% trailing earnings growth and 8.6% margin achieved so far.</li> </ul> </li> </ul> <p>Bulls argue that the market is underestimating how sustained earnings growth and margin resilience could shift sentiment if current trends hold, especially with the stock on an 8.6x P/E and trading below both DCF fair value and the US$253.00 analyst target. <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/6pqkl3yw-new-outpatient-facilities-and-telehealth-will-unlock-secular-market-demand\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 Universal Health Services Bull Case</strong></a></p> <h2>High debt and policy risks against slower 3.1% EPS growth</h2> <ul> <li>The inputs highlight a high level of debt on the balance sheet alongside forecast earnings growth of about 3.1% per year and revenue growth of 4.2% per year, both cited as slower than the broader US market even though trailing net income over the last year is US$1.5b.</li> <li>Bears focus on that leverage and on regulatory items such as expected US$360m to US$400m annual cuts to Medicaid supplemental payments by 2032, arguing that slower forecast growth plus higher interest and capital needs make it harder to sustain the 8.6% margin, even though recent results show improved profitability and 30.4% trailing earnings growth that so far have run ahead of those cautious assumptions.\n    <ul> <li>Critics highlight that if net benefit from Medicaid programs falls while revenue growth tracks closer to the 4.2% forecast, the combination of debt servicing and lower reimbursement could pressure earnings even if current EPS of US$23.42 on a trailing basis remains solid today.</li> <li>What challenges the bearish stance somewhat is that, despite these risks being flagged, analysts in the supplied data still reference earnings that have grown 7.3% per year over five years and a current margin above last year, which suggests the operational picture has been resilient so far even as future policy changes are being debated.</li> </ul> </li> </ul> <p>Skeptics warn that high leverage and policy changes could matter more than recent EPS strength, especially if future growth sits near 3.1% while debt stays elevated. <a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/rdizidzn-lower-medicaid-payments-and-rising-costs-will-erode-margins\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 Universal Health Services Bear Case</strong></a></p> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/rdizidzn-lower-medicaid-payments-and-rising-costs-will-erode-margins\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Universal Health Services on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>With the bullish and bearish angles laid out, how do they stack up for you right now, and what feels most important for your own portfolio decisions? Our analysis flags both risks and rewards that investors are watching closely, so it is worth checking the full breakdown before you settle on a view, starting with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 1 important warning sign</a>.</p> <h2>Explore Alternatives</h2> <p>UHS carries high debt and faces potential Medicaid payment cuts, while forecast earnings and revenue growth in the supplied data sit at modest single digit rates.</p> <p>If that mix of leverage and policy risk feels heavy for your portfolio, take a look at our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> to find companies with steadier profiles.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 08:16:11",
            "link": "https://simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services/news/universal-health-services-q4-eps-strength-reinforces-bullish",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing BrightView Holdings (BV) Valuation After Expanded Golf Management Role At The Villages",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>BrightView Holdings (BV) shares are in focus after its BrightView Landscapes unit expanded its golf management role at The Villages in Florida, where it now oversees more than half of the community’s 400 golf holes.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for BrightView Holdings.</a></p> <p>The latest contract win comes as BrightView’s 30 day share price return of 5.39% and 90 day share price return of 10.06% point to building momentum. At the same time, the 3 year total shareholder return of about 12x contrasts with a 5 year total shareholder return decline of 12.86%.</p> <p>If this golf expansion has you thinking about longer term themes in infrastructure and services, it could be worth scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_power_grid\" href=\"https://simplywall.st/discover/investing-ideas/473750/power-grid-technology-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">23 power grid technology and infrastructure stocks</a> as another way to look for potential opportunities.</p> <p>With BrightView shares up over the past 3 months and trading at a reported discount to some analyst and intrinsic value estimates, the key question is whether there is still an opportunity here or if the market is already pricing in future growth.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 15% Undervalued</h2> <p>BrightView Holdings' most followed narrative sets a fair value of about $16.34 per share, compared with the last close at $13.89. This frames the current debate around upside versus execution risk.</p> <blockquote> <p><em>The \"One BrightView\" strategy is driving substantial cost savings and operating leverage through procurement centralization, technology investments, and large-scale fleet upgrades, which is directly impacting operating margins and net earnings, with further margin expansion expected as these initiatives scale.</em></p> </blockquote> <p><em>Read the complete narrative.</em> <a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/oxqxa3ns-expansion-into-10-branches-will-secure-urban-green-demand-d4qd\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Curious what kind of revenue growth, margin lift, and future earnings multiple need to come together to support that fair value? The projections behind this story lean heavily on improving profitability, rising recurring revenue and a lower valuation multiple than many investors might assume. The full narrative lays out how those moving parts fit together and what would need to go right for the numbers to line up.</p> <p><strong>Result: Fair Value of $16.34 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/oxqxa3ns-expansion-into-10-branches-will-secure-urban-green-demand-d4qd\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this story could look very different if macro headwinds keep delaying client projects, or if cost savings and project to maintenance conversions fall short of expectations.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this BrightView Holdings narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of potential upside and clear risks leaves you on the fence, take time while the data is fresh to shape your own view with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 4 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If BrightView has you thinking more broadly about where to put your money to work next, do not stop here; widen your search before the market moves on.</p> <ul> <li>Target quality first by checking companies that combine strong fundamentals with sturdy finances through our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (41 results)</a>.</li> <li>Hunt for potential value by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a> that filters for companies with solid business profiles trading below their assessed worth.</li> <li>Prioritise resilience by reviewing our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> that highlights businesses with lower risk scores for steadier portfolio anchors.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if BrightView Holdings might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/commercial-services/nyse-bv/brightview-holdings/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:16:11",
            "link": "https://simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings/news/assessing-brightview-holdings-bv-valuation-after-expanded-go",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Reassessing Novo Nordisk (CPSE:NOVO B) After Sharp Share Price Declines",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are looking at Novo Nordisk and wondering whether the current share price still lines up with the company’s long term story, you are not alone.</li> <li>The stock last closed at DKK 238.6, with returns of 22.4% decline over 7 days, 39.4% decline over 30 days, 27.8% decline year to date, 61.8% decline over 1 year and 50.0% decline over 3 years, while the 5 year return stands at 19.6%.</li> <li>These swings have arrived alongside ongoing attention on Novo Nordisk’s role in diabetes and weight management treatments, as well as regulatory and competitive headlines that keep the company in the spotlight. Together, these factors help explain why the share price has been so reactive, as investors reassess expectations and risk.</li> <li>Against that backdrop, Novo Nordisk currently scores 5 out of 6 on our valuation checks, as shown by our <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation score</a>. Next, we will look at how different valuation methods line up on the stock and finish with an approach that can give you an even clearer view of what the market is pricing in.</li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_industry_underperformer\" href=\"https://www.simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/future\" rel=\"noopener noreferrer\" target=\"_blank\">Find out why Novo Nordisk's -61.8% return over the last year is lagging behind its peers.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Novo Nordisk Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model estimates what a business could be worth today by projecting its future cash flows and discounting them back to the present.</p> <p>For Novo Nordisk, the model uses a 2 stage Free Cash Flow to Equity approach. The latest twelve month free cash flow is DKK 52,097.16m. Analyst and extrapolated projections suggest free cash flow reaching DKK 145,840.33m in 2030, with a path that includes DKK 41,926.80m in 2026 and DKK 207,436.58m in 2035. Simply Wall St uses analyst estimates where available, then extends them using its own growth assumptions for the later years.</p> <p>Discounting these projected cash flows back to today gives an estimated intrinsic value of DKK 1,072.30 per share. Compared with the recent share price of DKK 238.60, the DCF output suggests the market price is at a 77.7% discount to this estimate, which indicates that the stock appears materially undervalued on this model alone.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Novo Nordisk is undervalued by 77.7%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">231 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NOVO B Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/71be77aa-1311-4447-b4b8-bcb7f8815b88/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>NOVO B Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Novo Nordisk.</a></p> <h3>Approach 2: Novo Nordisk Price vs Earnings</h3> <p>For a profitable company like Novo Nordisk, the P/E ratio is a useful snapshot of how much investors are paying for each unit of earnings. It reflects what the market is willing to pay today for the company’s current profit stream.</p> <p>In simple terms, higher growth expectations and lower perceived risk tend to support a higher P/E, while slower expected growth or higher risk usually line up with a lower, more conservative P/E. Novo Nordisk currently trades on a P/E of 10.35x, compared with the Pharmaceuticals industry average of 22.54x and a peer average of 26.08x. That raw comparison alone might suggest the stock is priced more cautiously than many of its peers.</p> <p>Simply Wall St’s Fair Ratio for Novo Nordisk is 25.04x. This is a proprietary P/E level that reflects factors such as the company’s earnings growth profile, profit margins, risk characteristics, industry, and market cap. Because it builds in these company specific drivers, it can be more informative than a simple peer or industry comparison. With the current P/E of 10.35x sitting well below the Fair Ratio of 25.04x, the multiple based view points to the shares looking undervalued on earnings.</p> <p><strong>Result: UNDERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"CPSE:NOVO B P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/71be77aa-1311-4447-b4b8-bcb7f8815b88/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>CPSE:NOVO B P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/global\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 98 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Novo Nordisk Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple way for you to attach a clear story about a company to the numbers you are seeing, including your view on fair value and your own assumptions for future revenue, earnings and margins.</p> <p>A Narrative connects three pieces you already think about: what you believe is happening in the business, how that might flow through to a financial forecast, and what that implies for a fair value you can compare with today’s share price.</p> <p>On Simply Wall St, Narratives are available on the Community page and are used by millions of investors, so you can quickly see different views on Novo Nordisk and how other investors translate their thesis into numbers without needing to build a full model yourself.</p> <p>Because each Narrative pairs a user’s fair value with the current market price, it gives you a practical way to decide whether the gap between value and price is wide enough for you to consider buying, waiting, or taking some money off the table, all within a consistent framework.</p> <p>Narratives stay current because they refresh when new information such as earnings releases, regulatory updates or major news is incorporated, so the story, forecast and fair value do not sit frozen in time.</p> <p>For Novo Nordisk right now, one investor Narrative on Simply Wall St estimates fair value at DKK 287.0 while another sits at DKK 1,036.18, which shows how two people looking at the same company can reach very different conclusions once they plug in their own expectations.</p> <p>Do you think there's more to the story for Novo Nordisk? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/CPSE/NOVO%20B\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"CPSE:NOVO B 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/71be77aa-1311-4447-b4b8-bcb7f8815b88/chart/quote-price?date=2026-02-26\" width=\"746\"/></a><figcaption>CPSE:NOVO B 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Novo Nordisk might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:16:11",
            "link": "https://simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/news/reassessing-novo-nordisk-cpsenovo-b-after-sharp-share-price",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is Houlihan Lokey (HLI) Fairly Priced After Recent Share Price Softness And Strong Multi‑Year Gains",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Houlihan Lokey’s current share price reflects its true worth, you are not alone. This article is designed to help you size up what you are really paying for.</li> <li>The stock last closed at US$169.10, with returns of 1.8% over the past week, a 5.9% decline over the past month, a 4.1% decline year to date, a 0.5% gain over the past year, 86.6% over three years and 182.7% over five years, which may leave you questioning whether the recent path justifies today’s price tag.</li> <li>Recent company updates and sector news have kept Houlihan Lokey on investor watchlists, as corporate activity and advisory demand often steer sentiment around investment banks and financial advisors. These headlines give important context to the recent mix of short term softness and longer term strength in the share price.</li> <li>Right now Houlihan Lokey scores 2 out of 6 on our valuation checks, which you can see in detail in our <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation score</a>. We will walk through the usual valuation approaches next and also point you to a more complete way of thinking about value at the end of the article.</li> </ul> <p>Houlihan Lokey scores just 2/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Houlihan Lokey Excess Returns Analysis</h3> <p>The Excess Returns model looks at how much value a company creates above the return that shareholders are estimated to require. It starts from the equity on the balance sheet, then compares the company’s expected return on that equity to its estimated cost of equity.</p> <p>For Houlihan Lokey, the model uses a Book Value of US$32.92 per share and a Stable EPS of US$9.25 per share, based on weighted future Return on Equity estimates from 4 analysts. The Average Return on Equity used is 25.05%, while the Cost of Equity is US$2.91 per share, implying an Excess Return of US$6.34 per share. The model also factors in a Stable Book Value of US$36.95 per share, sourced from weighted future Book Value estimates from 4 analysts.</p> <p>Combining these inputs, the Excess Returns model arrives at an estimated intrinsic value of about US$178.83 per share. Compared with the recent share price of about US$169.10, this suggests the stock is around 5.4% undervalued. This sits within a reasonable margin of error rather than providing a clear bargain signal.</p> <p><strong>Result: ABOUT RIGHT</strong></p> <p>Houlihan Lokey is fairly valued according to our <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Excess Returns</a>, but this can change at a moment's notice. Track the value in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted on when to act.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"HLI Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c70f2d67-69b8-455b-920e-4c3e95539baa/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>HLI Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Houlihan Lokey.</a></p> <h3>Approach 2: Houlihan Lokey Price vs Earnings</h3> <p>For profitable companies like Houlihan Lokey, the P/E ratio is a useful shorthand for how much you are paying for each dollar of earnings. It helps you compare what the market is currently willing to pay for the company’s earnings relative to other options.</p> <p>What counts as a reasonable P/E usually reflects two things: how quickly earnings are expected to grow, and how risky those earnings are perceived to be. Higher expected growth and lower perceived risk can justify a higher P/E, while slower growth or higher risk typically support a lower multiple.</p> <p>Houlihan Lokey currently trades on a P/E of 26.35x. That sits above both the Capital Markets industry average of 23.01x and the peer group average of 15.39x. Simply Wall St’s Fair Ratio for Houlihan Lokey is 16.22x, which is its proprietary view of what a balanced P/E could look like after factoring in earnings growth, industry, profit margins, market cap and company specific risks.</p> <p>This Fair Ratio can be more informative than a simple peer or industry comparison because it adjusts for the company’s own characteristics rather than assuming one size fits all. With the current 26.35x P/E sitting above the 16.22x Fair Ratio, the shares look expensive on this metric.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:HLI P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c70f2d67-69b8-455b-920e-4c3e95539baa/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:HLI P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 20 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Houlihan Lokey Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, which are simply your story about a company expressed through your own assumptions for fair value, future revenue, earnings and margins, linked to a forecast and then to a fair value that you can compare with today’s price. On Simply Wall St, within the Community page used by millions of investors, Narratives give you an easy way to set out that story in numbers, see how your view differs from others, and quickly spot when your Fair Value is above or below the current price. This can help you decide whether the stock fits your watchlist or portfolio. Narratives also refresh as new information such as news, earnings or updated analyst estimates are added, so your view does not stay frozen. For Houlihan Lokey, for example, one investor might align with the higher fair value view around US$242.55 per share while another might lean closer to the lower fair value of US$173 per share, and Narratives make those different perspectives clear and comparable in one place.</p> <p>Do you think there's more to the story for Houlihan Lokey? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/HLI\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-hli/houlihan-lokey\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:HLI 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c70f2d67-69b8-455b-920e-4c3e95539baa/chart/quote-price?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:HLI 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Houlihan Lokey might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:16:10",
            "link": "https://simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/news/is-houlihan-lokey-hli-fairly-priced-after-recent-share-price",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Evaluating Pan American Silver’s Valuation After Record 2025 Results And A Higher Dividend",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Record 2025 results and higher dividend draw investor focus</h2> <p>Pan American Silver (TSX:PAAS) has come into focus after reporting record fourth quarter and full year 2025 results, alongside a higher dividend and a 2026 outlook calling for further silver production growth.</p> <p>For the fourth quarter, the company reported sales of US$1,179 million, compared with US$815 million a year earlier, and net income of US$452 million, compared with US$108 million. Basic and diluted earnings per share from continuing operations were US$1.07, compared with US$0.30 a year ago.</p> <p>Across 2025, sales were US$3.62b compared with US$2.82b a year earlier, while net income was US$978 million compared with US$112 million. Full year basic and diluted earnings per share from continuing operations were US$2.56, compared with US$0.31 in the prior year.</p> <p>Alongside the earnings release on February 18, 2026, Pan American Silver declared a cash dividend of US$0.18 per common share for the fourth quarter of 2025, payable on or about March 13, 2026, to shareholders of record as of March 2, 2026. The company described the dividend as an eligible dividend for Canadian income tax purposes and noted that any future dividends will remain at the discretion of its board.</p> <p>The company also updated the market on its share repurchase activity. From October 1, 2025 to December 31, 2025, Pan American Silver bought back 282,700 shares for US$15 million, representing 0.07% of its shares. This completed a program initiated on March 3, 2025, under which the company repurchased a total of 1,650,770 shares for US$46.1 million, representing 0.44% of its outstanding shares.</p> <p>Management has guided to a further 14% increase in silver production in 2026, supported by contributions from the Juanicipio mine and higher grades at Cerro Moro, and plans to release an updated technical report for the La Colorada Skarn project in the second quarter of 2026. These elements sit alongside record 2025 free cash flow and a series of recent dividend increases and form the backdrop for how investors may weigh Pan American Silver’s current valuation and risk profile.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Pan American Silver.</a></p> <p>Investors appear to be responding to the record 2025 results and higher dividend. The share price is at CA$92.37 with a 90 day share price return of 45.83%, while the 1 year total shareholder return of 171.88% and 3 year total shareholder return of roughly 4.7x point to strong longer term momentum.</p> <p>If this earnings driven move has you rethinking precious metals exposure, it could be worth scanning beyond a single name and checking out our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_silver\" href=\"https://simplywall.st/discover/investing-ideas/473743/top-silver-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">7 top silver producer stocks</a> as potential next ideas.</p> <p>With the shares up 46% in 90 days and trading slightly above the average analyst price target, yet still showing a large intrinsic value gap, is there still a buying opportunity here, or is the market already pricing in future growth?</p> <h2>Price-to-Earnings of 29.1x: Is it justified?</h2> <p>On earnings, the market is putting a 29.1x P/E on Pan American Silver at CA$92.37. This sits above both peers and the company’s own estimated fair ratio.</p> <p>The P/E multiple simply tells you how much investors are currently paying for each dollar of earnings. It is a common yardstick for metals and mining companies where profitability matters as much as production volumes.</p> <p>For Pan American Silver, that 29.1x P/E compares with a peer average of 26.4x and an estimated fair P/E of 26.4x. This indicates the market is applying a richer tag than both the sector and the level our fair ratio suggests the price could lean toward over time.</p> <p>Stacked against the broader Canadian Metals and Mining industry, where the average P/E is 22.5x, Pan American Silver’s 29.1x stands out as clearly higher. This signals that investors are currently pricing in stronger earnings prospects or a higher quality profile than the typical name in the group.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"fair_ratio_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Explore the SWS fair ratio for Pan American Silver</a></p> <p><strong>Result: Price-to-Earnings of 29.1x (OVERVALUED)</strong></p> <p>However, you are paying that richer P/E in a sector exposed to metal price swings, as well as Pan American Silver’s multi country operating and regulatory risks.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Pan American Silver narrative.</a></p> <h2>Another view on value: SWS DCF points the other way</h2> <p>The P/E of 29.1x suggests Pan American Silver looks expensive, but our DCF model tells a different story. At CA$92.37, the shares trade about 57.6% below our estimate of fair value at CA$217.63. This frames the current price as a sizeable discount instead of a premium. So which signal do you trust more: earnings multiples or future cash flows?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/ca/materials/tsx-paas/pan-american-silver-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"PAAS Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/32d0f89b-a81d-42bd-9deb-9557bcda8c33/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>PAAS Discounted Cash Flow as at Feb 2026</figcaption></figure><p> </p><p>Simply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (<a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">check out Pan American Silver for example</a>). We show the entire calculation in full. You can track the result in your <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted when this changes, or use our stock screener to discover <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">9 high quality undervalued stocks</a>. If you <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">save a screener</a> we even alert you when new companies match - so you never miss a potential opportunity.</p> <h2>Next Steps</h2> <p>Mixed signals or clear opportunity, either way it helps to move fast and pressure test the story for yourself by weighing up <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If this has sharpened your focus on opportunities, do not stop here. The right mix of stocks can matter more than any single position.</p> <ul> <li>Spot potential value plays early and check out our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">9 high quality undervalued stocks</a> that currently stand out on both quality and pricing.</li> <li>Strengthen your income stream by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/ca\" rel=\"noopener noreferrer\" target=\"_blank\">5 dividend fortresses</a>, so you are not missing companies offering higher yields with robust payout records.</li> <li>Prioritize resilience and peace of mind by scanning <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/ca\" rel=\"noopener noreferrer\" target=\"_blank\">7 resilient stocks with low risk scores</a>, where the focus is on companies with lower risk scores and steadier profiles.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 08:16:10",
            "link": "https://simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares/news/evaluating-pan-american-silvers-valuation-after-record-2025",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore Land Group (SGX:U06) Margin Compression Challenges Bullish Earnings Narratives",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Singapore Land Group (SGX:U06) has reported its FY 2025 first half numbers with revenue of S$372.2 million and net income of S$111.4 million, translating to basic EPS of S$0.078. The company has seen revenue move from S$354.6 million in 1H FY 2024 to S$372.2 million in 1H FY 2025, while EPS shifted from S$0.072 to S$0.078 over the same periods, which allows investors to consider solid top line scale alongside signs of margin pressure.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/sg/real-estate-management-and-development/sgx-u06/singapore-land-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Singapore Land Group.</a> <p>With the headline figures in place, the next step is to see how these results line up against the key market narratives around Singapore Land Group's earnings quality, margins, and long term outlook.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/sg/real-estate-management-and-development/sgx-u06/singapore-land-group-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"SGX:U06 Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3911dd29-ffc5-4722-a2bb-2f7102e9965f/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>SGX:U06 Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Margins Slip From 38% To 34.8%</h2> <ul> <li>Over the last 12 months, net profit margin was 34.8%, compared with 38% in the prior year, while trailing 12 month net income was S$272.3 million on S$783.1 million of revenue.</li> <li>What stands out for a more cautious, bearish view is that this margin compression sits alongside a 1% per year earnings decline over five years, which raises questions about profit resilience even though 1H FY 2025 net income of S$111.4 million is above the S$103.7 million recorded in 1H FY 2024.\n    <ul> <li>Bears point to the drop from 38% to 34.8% net margin as evidence that profitability per dollar of revenue has been under pressure across the last two years of data.</li> <li>They also highlight that trailing 12 month net income of S$272.3 million is lower than the S$291.9 million level reported in the earlier trailing set, which lines up with the longer run 1% annual earnings decline.</li> </ul> </li> </ul> On top of this compression in margins, skeptics may argue that recent profit levels still need to prove they can hold up if revenue conditions become less supportive. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Singapore Land Group Bear Case</strong></a> <h2>Five Year Earnings Trend Points To 1% Decline</h2> <ul> <li>The analysis flags that reported earnings have declined at an average rate of 1% per year over the past five years, even though 1H FY 2025 basic EPS of S$0.078 is slightly above the S$0.072 recorded in 1H FY 2024.</li> <li>Supporters of a more optimistic, bullish angle often focus on the fact that trailing 12 month EPS of about S$0.204 is higher than the S$0.198 level observed in the earlier trailing period. However, this shorter term improvement sits against that 1% five year earnings decline, so the recent lift does not fully counter the longer term drift.\n    <ul> <li>Backers of the bullish angle may point to revenue trending from S$354.6 million in 1H FY 2024 to S$372.2 million in 1H FY 2025, and from S$748.6 million to S$783.1 million on a trailing basis, as a sign that the business is still scaling.</li> <li>At the same time, the five year 1% earnings decline signal means any bullish case has to show how current profitability can be maintained or improved rather than assuming past patterns will simply reverse.</li> </ul> </li> </ul> If you want to see how optimistic and cautious investors are framing this longer term track record against the latest half year numbers, have a look at what the community is debating around Singapore Land Group right now. <a class=\"company-report-links\" data-vars-link-type=\"cta_consensus_narrative_link\" href=\"https://simplywall.st/stock/SGX/U06\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>📊 Read the what the Community is saying about Singapore Land Group.</strong></a> <h2>P/E Of 18.9x Sits Between Peers And DCF Value</h2> <ul> <li>The shares trade on a P/E of 18.9x, which is below the peer average of 23.1x but slightly above the Singapore real estate industry average of 18.7x. The S$3.59 share price also stands modestly above the S$3.47 DCF fair value.</li> <li>Investors weighing a bullish angle on valuation often see the discount to the 23.1x peer P/E as supportive. Yet that is balanced by two constraints, the slight premium to the 18.7x industry average and the fact that the current S$3.59 share price is higher than the S$3.47 DCF fair value, which together argue for careful attention to how future profit metrics evolve.\n    <ul> <li>Supporters of the bullish view can argue that an 18.9x P/E with a peer discount leaves some room if earnings stabilise relative to the 1% five year decline, but that argument depends heavily on how margins and net income trend from here.</li> <li>Others will focus more on the S$0.204 trailing 12 month EPS and the P/E implied at S$3.59, viewing the gap to DCF fair value as a reason to be measured when judging how much of the current earnings profile is already priced in.</li> </ul> </li> </ul> <h2>Next Steps</h2> <p>Don't just look at this quarter; the real story is in the long-term trend. We've done an in-depth analysis on Singapore Land Group's <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/sg/real-estate-management-and-development/sgx-u06/singapore-land-group-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">growth</a> and its <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/sg/real-estate-management-and-development/sgx-u06/singapore-land-group-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation</a> to see if today's price is a bargain. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> now so you don't miss the next big move.</p> <p>Mixed messages on earnings and valuation can feel a bit uneasy, so it is worth checking the underlying data and forming your own view. A good place to start is the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_analysis\" href=\"https://www.simplywall.st/stocks/sg/real-estate-management-and-development/sgx-u06/singapore-land-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">1 important warning sign</a> for Singapore Land Group.</p> <h2>See What Else Is Out There</h2> <p>Singapore Land Group's 1% five year earnings decline, softer net margins, and P/E premium to its DCF value together highlight questions around profit resilience and pricing.</p> <p>If those mixed earnings trends and valuation tensions leave you wanting stronger fundamentals, take a look at our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">232 high quality undervalued stocks</a> that aim to pair lower prices with more compelling earnings strength and balance sheets right now.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 08:10:53",
            "link": "https://simplywall.st/stocks/sg/real-estate-management-and-development/sgx-u06/singapore-land-group-shares/news/singapore-land-group-sgxu06-margin-compression-challenges-bu",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMG Critical Materials (ENXTAM:AMG) Q4 Loss Of US$48.3 Million Challenges Bullish Earnings Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>AMG Critical Materials FY 2025 Results Snapshot</h2> <p>AMG Critical Materials (ENXTAM:AMG) has just closed out FY 2025 with fourth quarter revenue of US$446.6 million and basic EPS of US$1.49 loss, setting a clear focal point for how its earnings story is developing.</p> <p>Across recent periods, the company has seen quarterly revenue move from US$361.4 million and EPS of US$0.23 in Q4 2024 to US$388.1 million with EPS of US$0.16 in Q1 2025, US$439.0 million with EPS of US$0.36 in Q2, and US$434.7 million with EPS of US$0.40 in Q3, giving investors a clean run of numbers to weigh against a still pressured margin profile in the latest quarter.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/nl/materials/ams-amg/amg-critical-materials-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for AMG Critical Materials.</a> <p>With the headline figures on the table, the next step is to see how these results line up with the prevailing narratives around AMG Critical Materials, and where the numbers start to challenge those stories.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/tg38nhim-amg-recent-index-addition-and-market-trends-will-shape-risk-reward-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about AMG Critical Materials</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/nl/materials/ams-amg/amg-critical-materials-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ENXTAM:AMG Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3d0218c9-3e55-4898-9a9e-5ca4de82779a/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>ENXTAM:AMG Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <h2>TTM still shows US$18.6 million loss</h2> <ul> <li>On a trailing twelve month basis to Q4 2025, AMG recorded total revenue of US$1.7b and a net loss of US$18.6 million, with basic EPS of US$0.58 loss.</li> <li>What stands out against the bullish narrative is that, while bullish investors focus on forecasts of 71.31% yearly earnings growth and a return to profitability within three years, the latest TTM numbers still show losses. This means:\n    <ul> <li>TTM net income moved from a loss of US$33.4 million in Q4 2024 to a smaller loss of US$18.6 million in Q4 2025, so the company is closer to break even but not yet there.</li> <li>Quarterly figures inside that period swung from a US$13.1 million profit in Q3 2025 to a US$48.3 million loss in Q4 2025, which challenges the idea of a smooth path toward the bullish earnings forecasts.</li> </ul> </li> </ul> On these numbers, bulls are essentially arguing that a business still reporting a TTM loss can grow into those forecasts relatively quickly, which is an optimistic read on how fast profitability can improve. <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/l3rwv1up-us-and-eu-refining-will-fuel-a-green-metals-boom\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 AMG Critical Materials Bull Case</strong></a> <h2>US$48.3 million Q4 loss vs earlier 2025 profits</h2> <ul> <li>Within FY 2025, AMG moved from net income of US$5.0 million, US$11.5 million and US$13.1 million in Q1, Q2 and Q3 to a net loss of US$48.3 million in Q4, even as quarterly revenue stayed in a fairly tight band between US$388.1 million and US$446.6 million.</li> <li>Bears highlight that heavy capital spending and exposure to commodity prices can hit earnings hard, and this pattern fits that cautious view because:\n    <ul> <li>Losses over the past five years have widened at roughly 6% per year and the latest TTM period still ends in the red, which lines up with concerns about long stretches of uneven profitability.</li> <li>Interest payments are flagged as not well covered by earnings, so a quarter like Q4 2025 with a US$48.3 million loss adds weight to worries about financial pressure if similar periods repeat.</li> </ul> </li> </ul> Skeptics point to this swing back into a sizeable loss as evidence that the path to steady profits may be rougher than headline growth forecasts imply. <a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/huf0chdo-lithium-volatility-and-geopolitical-risks-will-undermine-refining-prospects\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 AMG Critical Materials Bear Case</strong></a> <h2>Low P/S and DCF fair value create valuation tension</h2> <ul> <li>At a share price of €33.04, AMG is trading on a P/S of 0.7x compared with peer and industry averages of 5.7x and 0.9x, and sits well below a DCF fair value estimate of €60.83.</li> <li>Consensus narrative suggests the stock looks inexpensive while still facing meaningful financial risk, and the data backs both sides of that tension because:\n    <ul> <li>The gap between the €33.04 price and the €60.83 DCF fair value points to valuation support, even after factoring in that analysts as a group only see roughly 25.6% implied upside to their price target of €41.49.</li> <li>At the same time, the company remains unprofitable on a TTM basis and interest coverage is described as weak, so any case that the current P/S discount is attractive also needs to factor in these ongoing balance sheet and earnings risks.</li> </ul> </li> </ul> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/tg38nhim-amg-recent-index-addition-and-market-trends-will-shape-risk-reward-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for AMG Critical Materials on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>If this mix of bullish and cautious signals feels finely balanced, now may be a good time to review the core data yourself and decide where you stand, starting with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/nl/materials/ams-amg/amg-critical-materials-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a>.</p> <h2>See What Else Is Out There</h2> <p>The trailing twelve month loss of US$18.6 million, the sharp US$48.3 million Q4 setback and weak interest coverage all point to meaningful financial and earnings risks.</p> <p>If that level of pressure makes you uneasy, it is worth quickly checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/global\" rel=\"noopener noreferrer\" target=\"_blank\">326 resilient stocks with low risk scores</a> so you can focus on companies with steadier fundamentals and fewer red flags.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 08:10:53",
            "link": "https://simplywall.st/stocks/nl/materials/ams-amg/amg-critical-materials-shares/news/amg-critical-materials-enxtamamg-q4-loss-of-us483-million-ch",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Avista (AVA) Margin Improvement Tests Bullish Earnings Narrative In FY 2025 Results",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Avista FY 2025 Earnings Snapshot</h2> <p>Avista (AVA) closed out FY 2025 with fourth quarter revenue of US$533 million and basic EPS of US$0.87, underpinned by net income of US$71 million as the utility updated investors on its full year performance. Over the last several quarters, revenue has ranged from US$403 million to US$617 million while quarterly EPS has moved between US$0.17 and US$0.98, giving you a clear view of how the top line and per share earnings have tracked through the year. With trailing 12 month net profit margins edging higher and earnings growth outpacing revenue, this set of results puts operating efficiency and profitability firmly in focus for investors.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/utilities/nyse-ava/avista\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Avista.</a> <p>With the latest numbers on the table, the next step is to set them against the widely held market narratives around Avista and see which views line up with the data and which might need a rethink.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/tw3gqe02-ava-long-term-earnings-growth-will-steady-energy-delivery-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Avista</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/utilities/nyse-ava/avista/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:AVA Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/ce0aad62-987f-4e06-8d7c-e28b4a62a665/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:AVA Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <h2>Margins Steady Around 9.8% Net Level</h2> <ul> <li>On a trailing 12 month basis, Avista reports net income of US$193 million on US$1.964b of revenue, which works out to a 9.8% net margin compared with 9.3% a year earlier.</li> <li>Analysts' consensus view points to margin expansion over time, and the current 9.8% margin sits between the 9.2% level referenced in that view and the 11.4% margin that analysts expect. This raises questions about how quickly capital projects and regulatory outcomes will flow through to earnings.</li> <ul> <li>The consensus narrative highlights multi year capital plans of about US$3b and a pipeline of over 3,000 megawatts of potential new load as drivers for higher margins, while the actual trailing margin improvement from 9.3% to 9.8% is more modest in comparison.</li> <li>At the same time, the trailing 12 month earnings growth figure of roughly 7.2% lines up with the long run 7.4% annualized growth the consensus references, so the earnings side of that story is currently closer to the script than the faster margin lift analysts are hoping for.</li> </ul> </ul> <h2>Earnings Growth Outpaces Slower Revenue</h2> <ul> <li>Over the last year, earnings grew about 7.2% while revenue is forecast at roughly 2% annual growth, and trailing 12 month EPS of US$2.38 on US$1.964b of revenue underscores that most of the progress is coming from profitability rather than rapid top line expansion.</li> <li>Supporters of the bullish narrative argue that accelerating electrification and over 3,000 megawatts of large load inquiries can support stronger revenue ahead. However, the current revenue base of about US$1.964b and the 2% revenue growth forecast show a slower build than the more upbeat demand story might suggest.</li> <ul> <li>The consensus narrative talks about potential revenues of US$2.1b and earnings of US$245.2 million by around 2028, but today Avista is at US$1.964b of revenue and US$193 million of net income, which means a meaningful gap still needs to be closed.</li> <li>Analysts also expect EPS of US$2.94 by about 2028 compared with trailing EPS of roughly US$2.38, so while the 7.2% earnings growth rate so far is consistent with that direction, the modest revenue assumptions suggest a heavier reliance on margin and rate outcomes than on pure volume growth.</li> </ul> </ul> <p>Skeptics warn that this kind of earnings profile can be vulnerable if large load projects or regulatory approvals slip, so it is worth comparing the current US$2.38 EPS and 7.2% growth to the US$2.94 EPS target investors are building into their expectations before deciding how much risk you are comfortable taking on at a US$40.61 share price relative to the US$41.00 analyst target.</p> <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Avista Bear Case</strong></a> <h2>Valuation Support Versus Cash Flow Strain</h2> <ul> <li>Avista trades on a trailing P/E of 17.1x, which is below the Global Integrated Utilities industry average of 19.1x and well below the peer average of 25.5x, while offering a 4.83% dividend yield that is not well covered by free cash flows and interest payments that are not well covered by earnings over the trailing 12 months.</li> <li>Bulls argue that the combination of below peer P/E and expected earnings growth of about 7.4% a year makes the current valuation attractive. However, the flagged risks around cash coverage and interest costs show that the lower multiple and higher yield come with trade offs that investors need to weigh carefully.</li> <ul> <li>The current share price of US$40.61 is close to the US$41.00 consensus analyst target and only slightly above the DCF fair value estimate of about US$37.92, so there is not a large valuation gap that would offset concerns about dividend and interest coverage.</li> <li>At the same time, earnings of US$193 million on US$1.964b of revenue with a 9.8% margin and a 4.83% yield support the idea of a steady utility profile, but the fact that free cash flow does not fully cover\n<h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/tw3gqe02-ava-long-term-earnings-growth-will-steady-energy-delivery-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Avista on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>Mixed messages in the data, or a balanced risk and reward story that suits your style? Take a moment to review the numbers, pressure test the market narrative, and see how <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/utilities/nyse-ava/avista\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 3 important warning signs</a> shapes your own conclusion.</p> <h2>See What Else Is Out There</h2> <p>Avista's modest revenue growth, tight coverage of dividends and interest, and reliance on regulatory outcomes leave limited room for error if expectations shift.</p> <p>If that mix feels a bit stretched for your comfort, you might want to balance it by checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">80 resilient stocks with low risk scores</a> that score better on resilience and risk.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p></li></ul></ul><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 08:10:53",
            "link": "https://simplywall.st/stocks/us/utilities/nyse-ava/avista/news/avista-ava-margin-improvement-tests-bullish-earnings-narrati",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nebius Relies On Upfront Big Tech Contracts To Fund AI Cloud Expansion",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Nebius Group (NasdaqGS:NBIS) is using upfront financing from large enterprise clients, including Microsoft and Meta Platforms, to reshape its financial risk profile.</li> <li>These long-term contracts are providing greater liquidity and clearer revenue visibility for the company.</li> <li>Nebius is expanding its data center capacity while integrating Tavily to deepen its enterprise AI cloud offering.</li> </ul> <p>Nebius Group is drawing attention as it leans on customer prepayments rather than external capital to support growth, while trading at a share price of $106.12. The stock has returned 4.2% over the past week, 16.0% over the past month, 18.0% year to date, and 194.9% over the past year, which puts recent business moves under a brighter spotlight for investors watching NasdaqGS:NBIS.</p> <p>For investors, the shift toward upfront financing and long-term contracts with large enterprises, combined with heavier investment in data center capacity and AI capabilities through the Tavily acquisition, directly affects how Nebius Group's risk profile may be viewed. These changes relate to funding needs, revenue visibility, and the company’s role in AI cloud infrastructure, and are likely to remain key points to monitor around NasdaqGS:NBIS.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-nbis/nebius-group/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Nebius Group</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NasdaqGS/NBIS\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Nebius Group.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-nbis/nebius-group/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:NBIS Earnings &amp; Revenue Growth as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/5f6b1365-9dd7-473c-adb0-2ecb30ad2a12/chart/earnings-and-revenue-growth?date=2026-02-26\" width=\"746\"/></a><figcaption>NasdaqGS:NBIS Earnings &amp; Revenue Growth as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_risk_alert\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-nbis/nebius-group\" rel=\"noopener noreferrer\" target=\"_blank\">We've flagged 2 risks for Nebius Group. See which could impact your investment.</a></p> <p>Nebius Group’s decision to lean on upfront payments from large customers like Microsoft and Meta Platforms shifts part of the financing burden from lenders and equity markets to its own client base. For you as an investor, that means liquidity is tied more closely to contract execution and less to capital market conditions. Long dated agreements and customer prepayments can smooth cash inflows and give clearer visibility over future revenue, but they also concentrate exposure in a small group of hyperscale clients. The aggressive data center build out and the Tavily acquisition indicate that Nebius is trying to move up the stack from pure infrastructure into more software rich, enterprise grade AI cloud services, putting it in more direct competition with Amazon, Alphabet and other cloud providers. That can support pricing power if the platform resonates with developers, yet it raises execution risk around integration, uptime and ongoing capital intensity in an already crowded AI-infrastructure space.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>How This Fits Into The Nebius Group Narrative</h3> <ul> <li>The use of upfront customer financing and large multi year contracts directly supports the narrative that Nebius can use partnerships and strong funding access to build recurring revenue around AI focused infrastructure.</li> <li>Heavy reliance on a few very large deals ties into the narrative concern that customer concentration and sector consolidation could make it harder for Nebius to secure diversified, long term earnings streams.</li> <li>The Tavily acquisition and push into full stack AI services adds a software and data layer that is not fully captured in earlier commentary that focused mainly on GPU infrastructure and capacity expansion.</li> </ul> <p>Knowing what a company is worth starts with understanding its story.\n<a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/narratives/qronlo1g-nbis-winning-the-dollar174b-microsoft-deal-will-drive-market-outperformance\" rel=\"noopener noreferrer\" target=\"_blank\">Check out one of the top narratives in the Simply Wall St Community for Nebius Group</a> to help decide what it's worth to you.</p> <h3>The Risks and Rewards Investors Should Consider</h3> <ul> <li>⚠️ High capital expenditure for AI focused data centers means Nebius is exposed to cost overruns, deployment delays and changing power or regulatory requirements.</li> <li>⚠️ Dependence on a small number of very large contracts with companies like Microsoft and Meta Platforms increases the impact if any single customer changes strategy or scales back usage.</li> <li>🎁 Long term, prepaid agreements with major enterprises can support more predictable cash flows and give management flexibility over how to fund expansion.</li> <li>🎁 Expansion of capacity and the addition of Tavily’s AI search capabilities position Nebius to offer full stack solutions that could appeal to AI developers looking beyond established providers such as Amazon and Alphabet.</li> </ul> <h3>What To Watch Going Forward</h3> <p>From here, it is worth tracking how quickly Nebius converts its contracted backlog into active, revenue producing capacity, and whether new sites come online on the timelines management has outlined. Keep an eye on any updates to the terms or scale of the Microsoft and Meta Platforms agreements, as well as customer diversification beyond these anchor clients. Integration of Tavily into the broader platform, and customer uptake of higher value AI software services versus pure compute, will also help indicate whether Nebius can build a defensible position against larger cloud peers.</p> <p>To ensure you're always in the loop on how the latest news impacts the investment narrative for Nebius Group, head to the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NasdaqGS/NBIS\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Nebius Group</a> to never miss an update on the top community narratives.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Nebius Group might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/software/nasdaq-nbis/nebius-group/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:10:53",
            "link": "https://simplywall.st/stocks/us/software/nasdaq-nbis/nebius-group/news/nebius-relies-on-upfront-big-tech-contracts-to-fund-ai-cloud",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kingsgate Consolidated H1 2026 Margin Compression Challenges Bullish Growth Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>H1 2026 results snapshot for Kingsgate Consolidated (ASX:KCN)</h2> <p>Kingsgate Consolidated (ASX:KCN) has put fresh numbers on the table for H1 2026, with trailing twelve month revenue of A$483.9 million and basic EPS of A$0.45 framing the latest half in the context of a year that also included H2 2025 revenue of A$200.7 million and basic EPS of A$0.10. Over recent halves the company has seen revenue move from A$74.6 million in H2 2024 to A$136.1 million in H1 2025 and A$200.7 million in H2 2025, while basic EPS shifted from A$0.84 to A$0.01 and then A$0.10. This gives investors a clearer view of how reported profit tracks against the expanding top line. With trailing net profit margins at 23.8% and below the prior year, this result is likely to focus attention on how sustainably Kingsgate can convert that higher revenue base into earnings.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/au/materials/asx-kcn/kingsgate-consolidated-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Kingsgate Consolidated.</a> <p>With the headline figures on the board, the next step is to see how this earnings profile lines up against the widely shared narratives around Kingsgate’s growth, risks, and profitability, and where the fresh numbers push back against those views.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/au/materials/asx-kcn/kingsgate-consolidated-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ASX:KCN Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/6ebaac19-4401-459e-b09a-25df53b825b0/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>ASX:KCN Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <h2>23.8% margins against prior strength</h2> <ul> <li>Trailing twelve month net profit is A$115.1 million on A$483.9 million of revenue, which works out to a 23.8% net margin that sits below the prior year level flagged in the analysis.</li> <li>What jumps out for a cautious or bearish view is the mix of strong five year annualized earnings growth of 61.7% with negative earnings growth in the most recent year, as the lower 23.8% margin\n    <ul> <li>supports the concern that recent profitability is not matching that multi year growth pace, even with earnings still solidly positive on a trailing basis</li> <li>and highlights how much of the past five year story came from earlier periods like H2 2024, when net income was A$216.5 million on just A$74.6 million of revenue.</li> </ul> </li> </ul> Stay curious about whether recent margin pressure is a short bump or the start of a different story. <a class=\"company-report-links\" data-vars-link-type=\"cta_consensus_narrative_link\" href=\"https://simplywall.st/stock/ASX/KCN\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>📊 Read the what the Community is saying about Kingsgate Consolidated.</strong></a> <h2>Revenue climbing through recent halves</h2> <ul> <li>Over the last three reported halves, revenue moved from A$74.6 million in H2 2024 to A$136.1 million in H1 2025 and A$200.7 million in H2 2025, with trailing twelve month revenue at A$483.9 million.</li> <li>Supporters of a more bullish angle often point to this larger revenue base and the forecast that earnings could grow about 32.3% per year alongside expected revenue growth of roughly 15.2% per year\n    <ul> <li>arguing that a business producing A$115.1 million of trailing net income has more room to benefit if those revenue forecasts play out on top of the recent scale up</li> <li>even though the same data reminds you to watch how much of each extra A$1 of revenue actually flows through to profit given the margin step down.</li> </ul> </li> </ul> <h2>P/E of 15.8x with DCF fair value gap</h2> <ul> <li>At a share price of A$6.81 and a P/E of 15.8x, Kingsgate sits below its peer average of 32.4x and the wider Australian Metals &amp; Mining industry at 24.4x, while the DCF fair value is A$28.36 per share.</li> <li>For a bullish narrative, this combination of a lower multiple and a large gap to the A$28.36 DCF fair value is often used to argue that the market is being cautious\n    <ul> <li>with the current price sitting about 76% below that DCF fair value even after the most recent year of negative earnings growth and lower margins</li> <li>and trailing earnings of A$115.1 million supporting the idea that the valuation is anchored in actual profits rather than purely in distant forecasts.</li> </ul> </li> </ul> <h2>Next Steps</h2> <p>Don't just look at this quarter; the real story is in the long-term trend. We've done an in-depth analysis on Kingsgate Consolidated's <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/au/materials/asx-kcn/kingsgate-consolidated-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">growth</a> and its <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/au/materials/asx-kcn/kingsgate-consolidated-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation</a> to see if today's price is a bargain. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> now so you don't miss the next big move.</p> <p>If this combination of strong revenue, changing margins, and differing narratives seems mixed, use the numbers to stress test your own thesis and decide how to proceed while the details are fresh, including <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/au/materials/asx-kcn/kingsgate-consolidated-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 1 important warning sign</a>.</p> <h2>See What Else Is Out There</h2> <p>Margins sitting at 23.8% below prior strength, alongside negative recent earnings growth, suggest profitability is not keeping pace with Kingsgate’s larger revenue base.</p> <p>If those profit swings make you want steadier potential, check out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/au\" rel=\"noopener noreferrer\" target=\"_blank\">7 resilient stocks with low risk scores</a> to quickly spot companies where earnings and balance sheet risk look more contained.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Kingsgate Consolidated might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/au/materials/asx-kcn/kingsgate-consolidated-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:10:53",
            "link": "https://simplywall.st/stocks/au/materials/asx-kcn/kingsgate-consolidated-shares/news/kingsgate-consolidated-h1-2026-margin-compression-challenges",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Northland Power Q4 Profitability Contrasts With Trailing Losses And Tests Bullish Earnings Narratives",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Northland Power FY 2025 earnings snapshot</h2> <p>Northland Power (TSX:NPI) closed out FY 2025 with Q4 revenue of C$725.3 million and basic EPS of C$0.95, while its trailing 12 month profile still reflects a loss with EPS at C$0.62 and net income of C$163.2 million. The company has seen quarterly revenue move from C$582.3 million in Q4 2024 to C$725.3 million in Q4 2025, alongside EPS shifting from C$0.49 to C$0.95 over the same period. This sets up an earnings picture where recent quarterly profitability contrasts with a loss making trailing 12 month base. For investors, the mix of positive Q4 earnings on top of loss making full year figures keeps the spotlight firmly on how margins hold up from here.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Northland Power.</a> <p>With the headline numbers on the table, the next step is to see how this earnings profile lines up against the key narratives around Northland Power's profitability, growth potential, and risk profile that investors have been talking about.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/n65x0uiq-grid-storage-and-offshore-wind-will-deliver-a-brighter-future-uxos\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Northland Power</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSX:NPI Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/eb1e3ff3-ac2f-404c-899f-e4a48d235412/chart/revenue-and-expenses-breakdown?date=2026-02-26\" width=\"746\"/></a><figcaption>TSX:NPI Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <h2>Loss making over C$160 million on a 12 month view</h2> <ul> <li>On a trailing 12 month basis to Q4 2025, Northland Power recorded total revenue of about C$2.4b and a net loss of C$163.2 million, which contrasts with Q4 alone showing net income of C$249.5 million.</li> <li>What stands out for the bearish narrative is that this 12 month loss comes after multiple loss making quarters, including Q3 2025 net loss of C$414.0 million and Q2 2025 net loss of C$64.1 million. Critics argue this keeps cash flow and long term earnings visibility under pressure even as individual quarters like Q4 look strong.\n    <ul> <li>Bears also point to weak coverage of interest costs and dividends, with earnings currently not covering a 3.32% dividend yield or interest expense. This ties directly into concerns about elevated debt and C$9b already spent plus C$6b still expected on Baltic Power and Hai Long.</li> <li>At the same time, consensus commentary about step changes in EBITDA from new offshore wind and storage projects is hard to reconcile with the recent pattern of trailing losses, including a trailing loss of C$285.9 million just one quarter earlier in Q3 2025.</li> </ul> </li> </ul> Northland’s recent loss pattern and debt funded build out give cautious investors plenty to question in the more optimistic forecasts of future earnings power. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Northland Power Bear Case</strong></a> <h2>Slow 1.7% revenue growth versus wider market</h2> <ul> <li>Over the past 12 months, revenue has grown by about 1.7% per year compared to a 6.1% per year forecast for the Canadian market, even though quarterly revenue moved from C$582.3 million in Q4 2024 to C$725.3 million in Q4 2025.</li> <li>Analysts' bullish case leans heavily on new projects like Hai Long and Baltic Power and on grid scale storage, arguing that these additions can lift margins from about 2.3% loss making levels today toward 16.5% over three years. However, the current modest 1.7% revenue growth rate and history of wind resource issues and curtailments in places like the German offshore assets show how sensitive actual revenue can be to weather and power price conditions.\n    <ul> <li>On the supportive side for bulls, Q4 2025 revenue of C$725.3 million and net income of C$249.5 million follow Q4 2024 revenue of C$582.3 million and net income of C$126.8 million, which aligns with the view that new assets and better contract mix can improve earnings in stronger periods.</li> <li>Against that, the same 12 month data set still shows the business unprofitable and dropping several onshore and battery projects in Ontario, Alberta, and New York. This pushes back on the idea that growth from here is straightforward or that all pipeline projects will translate into higher revenue.</li> </ul> </li> </ul> For investors weighing that slower 1.7% revenue growth against the big project pipeline, it helps to see how others frame the trade off between new capacity, weather risk, and contract quality. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Northland Power Bull Case</strong></a> <h2>Valuation sits below both DCF fair value and peers</h2> <ul> <li>At a current share price of C$21.69, Northland Power trades below the DCF fair value of about C$23.78 and at a P/S of 2.3x, compared with 3.0x for the broader North American renewable energy industry and 3.5x for peers.</li> <li>Consensus narrative suggests that expansion into grid scale storage and offshore wind and the use of long term, inflation linked contracts could justify these lower multiples over time. Yet the combination of a trailing loss of C$163.2 million and interest expenses that are not well covered by earnings means the current discount can also be read as the market pricing in balance sheet risk and a reliance on analyst forecasts that expect earnings of C$454.1 million by around 2028.\n    <ul> <li>The spread between the share price of C$21.69 and DCF fair value of C$23.78, plus a forecast earnings growth rate of about 40% per year and an analyst target of C$22.42, are the main numbers backing the view that the shares are not expensive\n<h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/n65x0uiq-grid-storage-and-offshore-wind-will-deliver-a-brighter-future-uxos\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Northland Power on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>With bulls and bears both making strong cases here, it is worth getting familiar with the full set of numbers and forming your own view quickly. To see how concerns stack up against potential upside, take a look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a> and judge the balance for yourself.</p> <h2>Explore Alternatives</h2> <p>Northland Power is still working through a C$163.2 million loss on a 12 month view, modest 1.7% revenue growth, and debt related concerns.</p> <p>If that combination of recent losses and balance sheet pressure feels uncomfortable, you can quickly compare it with companies in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/ca\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (10 results)</a> that prioritize financial resilience.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p></li></ul></li></ul><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Northland Power might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/ca/utilities/tsx-npi/northland-power-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:01:39",
            "link": "https://simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares/news/northland-power-q4-profitability-contrasts-with-trailing-los",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chime Financial (CHYM) Q2 Loss Of US$923m Fuels Bearish Profitability Narratives",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Chime Financial (CHYM) closed out FY 2025 with Q4 revenue of US$596.4 million and a basic EPS loss of US$0.12. Trailing 12 month figures show revenue of about US$2.2 billion and a basic EPS loss of US$4.27, keeping the story firmly in loss-making territory. Over recent periods the company has seen revenue move from US$475.2 million in Q4 2024 to US$596.4 million in Q4 2025. This has come alongside quarterly EPS that has swung between a profit of US$0.20 in Q1 2025 and a loss of US$7.29 in Q2 2025, so investors are watching how quickly that volatility settles into more stable margins.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Chime Financial.</a> <p>With the latest numbers on the table, the next step is to see how this mix of rapid revenue progress and uneven profitability lines up with the key narratives investors have been using to frame Chime Financial’s story.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/tgtbueur-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Chime Financial</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:CHYM Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/93e8c166-1574-412a-8955-93ccc8007b9e/chart/revenue-and-expenses-breakdown?date=2026-02-26\" width=\"746\"/></a><figcaption>NasdaqGS:CHYM Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Revenue Nears US$2.2b While Losses Remain Heavy</h2> <ul> <li>On a trailing 12 month basis, Chime generated about US$2.2b of revenue against a net loss of roughly US$1.0b, so this is a business with strong top line scale that is still firmly in loss making territory.</li> <li>What stands out for the bullish narrative is that analysts are pairing this 30.7% revenue growth over the last year with forecast earnings growth of about 116.54% per year,\n    <ul> <li>Revenue moving from US$1.7b to about US$2.2b over the last 12 months aligns with the bullish view that digital banking adoption and higher value products like MyPay and Chime Card can support future growth.</li> <li>At the same time, the current trailing 12 month loss of roughly US$1.0b is a reminder that the optimistic margin assumptions in the bullish case depend on a significant shift from today’s loss making base.</li> </ul> </li> </ul> <p>Some bulls argue this mix of US$2.2b in revenue and heavy current losses could be the setup for a sharp earnings swing if their margin expectations play out, but they are starting from a very loss heavy year.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/tgtbueur-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 Chime Financial Bull Case</strong></a> <h2>Quarterly Profit Swings Highlight Execution Risk</h2> <ul> <li>Within FY 2025, net income ranged from a profit of US$12.9 million in Q1 to a loss of US$923.4 million in Q2, with Q3 and Q4 losses of US$54.7 million and US$44.8 million, so profitability has moved around a lot within a single year.</li> <li>Bears focus on this pattern when they question how smooth the road to profitability might be,\n    <ul> <li>The very large loss in Q2 2025, alongside much smaller losses in Q3 and Q4, supports the cautious narrative that scaling products like MyPay and instant loans could expose Chime to earnings volatility if credit costs or operating expenses spike again.</li> <li>Even with revenue between US$518.7 million and US$596.4 million across the 2025 quarters, the shift from a small profit in Q1 to sizable losses later in the year gives skeptics concrete data to reference when they argue that earnings quality is still unproven.</li> </ul> </li> </ul> <p>Skeptical investors often point to the jump from a US$12.9 million profit to a US$923.4 million loss within the same year as a key reason to treat any profitability timelines with caution.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/q2p2b8jf-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 Chime Financial Bear Case</strong></a> <h2>Premium P/S Multiple Relies On Growth Story</h2> <ul> <li>Chime is trading on a P/S ratio of 4.2x compared with peers at 2.0x and the US Diversified Financial industry at 2.4x, so the market is currently valuing each dollar of Chime’s sales at a clear premium to its reference group.</li> <li>Consensus narrative ties that higher multiple to expectations for faster growth,\n    <ul> <li>Forecast revenue growth of 16.7% per year compared with 10.4% for the broader US market is one reason investors may be comfortable paying more than peers for each dollar of current revenue.</li> <li>At the same time, the company is still loss making on a trailing 12 month basis, so the premium P/S ratio is being supported by growth forecasts rather than current profitability, which leaves less room if those forecasts are revised lower.</li> </ul> </li> </ul> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/tgtbueur-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Chime Financial on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>If the combination of strong revenue scale, heavy losses and competing narratives leaves you unsure, take a moment to review the numbers yourself. Move quickly to form your own stance, then check what our data driven view highlights with <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards</a>.</p> <h2>See What Else Is Out There</h2> <p>Chime Financial combines roughly US$2.2b of revenue with heavy losses and sharp quarterly profit swings, so earnings quality and consistency remain key pressure points.</p> <p>If that level of earnings volatility has you wanting something steadier, check out our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> built to highlight companies with more consistent performance profiles today.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 08:01:39",
            "link": "https://simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial/news/chime-financial-chym-q2-loss-of-us923m-fuels-bearish-profita",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Simmons First National (SFNC) Net Interest Margin Rebound Tests Bearish Profitability Narratives",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Simmons First National (SFNC) closed out FY 2025 with fourth quarter revenue of US$233.9 million and basic EPS of US$0.54, following a turbulent year in which trailing twelve month figures show revenue of US$37.4 million and a basic EPS loss of US$2.96. Over recent quarters, the company has seen quarterly revenue move from US$162.7 million in Q3 2024 to US$195.2 million in Q4 2024, then to US$182.8 million, US$202.2 million and US$233.9 million through Q1 to Q4 2025. Basic EPS shifted from US$0.20 in Q3 2024 to US$0.38 in Q4 2024, then US$0.26, US$0.43, a loss of US$4.01 and back to US$0.54 in Q4 2025. With trailing results still showing an annual loss and earlier quarters marked by compressed profitability, the latest print puts the focus firmly on whether margins can stabilise from here.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/banks/nasdaq-sfnc/simmons-first-national\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Simmons First National.</a> <p>With the headline numbers set, the next step is to see how this earnings profile lines up with the current bull and bear narratives investors are using to frame Simmons First National.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/vjzcq8w3-urbanization-and-digital-adoption-will-transform-us-banking-x4si\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Simmons First National</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/banks/nasdaq-sfnc/simmons-first-national/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:SFNC Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/66a99783-4928-4089-b45d-67659b360ea5/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>NasdaqGS:SFNC Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Loan book steady while problem credits climb</h2> <ul> <li>Total loans stayed around US$17.1b through FY 2025, while non performing loans moved from US$101.7 million in Q3 2024 to US$153.9 million by Q3 2025.</li> <li>Analysts' consensus view talks about healthy commercial and industrial pipelines and higher yielding loans, yet the rise in non performing loans:\n    <ul> <li>Sits alongside commentary about commercial real estate exposure and classification upticks. This could help explain why non performing loans moved above US$150 million for much of 2025.</li> <li>Creates a contrast between the expected support from loan remixing and the credit risk signals that could feed into future loan loss provisions.</li> </ul> </li> </ul> <h2>Net interest margin improves through FY 2025</h2> <ul> <li>Net interest margin moved from 2.74% on a trailing basis at Q4 2024 to 2.95% in Q1 2025, 3.06% in Q2 2025 and 3.5% in Q3 2025.</li> <li>Consensus narrative highlights loan portfolio shifts toward higher yielding variable rate loans and digital investments, and the margin path:\n    <ul> <li>Aligns with the idea that repricing and higher yielding assets are helping, as seen in the move from sub 3% to 3.5% net interest margin by Q3 2025.</li> <li>Also runs into comments about rising expenses and fading deposit repricing gains, which could make sustaining a 3% plus margin harder if cost growth continues.</li> </ul> </li> </ul> Over the last few quarters, this margin trend is one of the key numbers bulls point to when they argue Simmons can support loan growth and earnings quality over time. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Simmons First National Bull Case</strong></a> <h2>Large loss still weighs on full year picture</h2> <ul> <li>Despite Q4 2025 net income of US$78.1 million, trailing twelve month net income sits at a loss of US$397.6 million and basic EPS at a loss of US$2.96, reflecting the Q3 2025 net loss of US$562.8 million.</li> <li>Bears focus on the trailing loss profile and dilution, and the numbers here:\n    <ul> <li>Support that view, with trailing revenue of US$37.4 million and a multi year pattern of worsening losses cited at 36.2% per year even after the profitable Q4 2025.</li> <li>Also interact with the 4.01% dividend yield that is flagged as not well covered by current or forecast earnings, which is an important point for income focused holders.</li> </ul> </li> </ul> For anyone worried that the recent profit prints might mask these larger loss figures, it is worth seeing how cautious analysts frame the downside case in more detail. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Simmons First National Bear Case</strong></a> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/vjzcq8w3-urbanization-and-digital-adoption-will-transform-us-banking-x4si\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Simmons First National on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>The combination of profit recovery and earlier losses presents a mixed picture, so if you want a clearer view, check the balance of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/banks/nasdaq-sfnc/simmons-first-national\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 2 important warning signs</a>.</p> <h2>See What Else Is Out There</h2> <p>Simmons First National is still carrying a trailing net income loss of US$397.6 million, rising non performing loans, and questions about dividend coverage.</p> <p>If those credit and earnings pressures make you uneasy, it could be worth checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> to quickly focus on businesses with more resilient profiles.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 08:01:38",
            "link": "https://simplywall.st/stocks/us/banks/nasdaq-sfnc/simmons-first-national/news/simmons-first-national-sfnc-net-interest-margin-rebound-test",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Danaher (DHR) Valuation After Recent Share Price Weakness",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Why Danaher stock may be on your radar today</h2> <p>Danaher (DHR) has been drawing attention after recent share price moves, with the stock around $209.36 and showing mixed returns over the past year, month, and past 3 months.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-dhr/danaher\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Danaher.</a></p> <p>Recent trading has been softer, with a 30 day share price return of an 11.19% decline and a 1 year total shareholder return of 2.41%, so near term momentum looks weaker than the longer term picture.</p> <p>If Danaher’s recent moves have you reassessing your watchlist, it could be a good moment to broaden your search with our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_healthcare_ai\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">29 healthcare AI stocks</a> as potential next ideas to research.</p> <p>So, with the share price weaker over the past 3 months, but trading at an estimated 8% discount to some intrinsic value models and about 27% below one analyst target, is this a genuine opportunity or is future growth already priced in?</p> <h2>Most Popular Narrative: 21% Undervalued</h2> <p>Compared with Danaher’s last close at $209.36, the most followed narrative puts fair value closer to the mid $260s, based on projected earnings power and cash flows discounted at an 8.01% rate.</p> <blockquote> <p><em>The sustained advancement of precision medicine and personalized therapies, including new AI-assisted diagnostic solutions and groundbreaking launches in genomics (like support for in vivo CRISPR therapies), positions Danaher's technology portfolio to capture higher-margin growth and drive long-term EBITDA expansion.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/9dupaeb2-dhr-premium-outlook-will-be-sustained-as-market-recovery-gradually-unfolds\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what kind of revenue mix, margin profile and future P/E multiple could justify a fair value well above today’s share price? The narrative leans on a detailed path for earnings, cash generation and capital allocation that goes far beyond a simple P/E snapshot, and the full story joins those moving parts into one valuation picture.</p> <p><strong>Result: Fair Value of $264.91 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/9dupaeb2-dhr-premium-outlook-will-be-sustained-as-market-recovery-gradually-unfolds\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, you also need to weigh softer bioprocessing demand and policy changes in China, which could pressure revenue, margins and the premium P/E narrative.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-dhr/danaher\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Danaher narrative.</a></p> <h2>Another View: Earnings Multiple Paints A Richer Picture</h2> <p>While the SWS models suggest Danaher is 8.3% below fair value on future cash flows, its current P/E of 41.1x looks expensive next to a 32.1x fair ratio, the 34.7x Life Sciences industry average and 34.3x for peers. Is the premium a cushion or a risk if sentiment cools?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-dhr/danaher/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/pharmaceuticals-biotech/nyse-dhr/danaher/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:DHR P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/6e72b874-f689-4638-95f4-c1aeedcf3fe6/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:DHR P/E Ratio as at Feb 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>If this all sounds mixed to you, that is the point. Markets rarely offer a simple story, so check the data yourself and weigh up <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-dhr/danaher\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards</a>.</p> <h2>Looking for more ideas before you commit?</h2> <p>If you are unsure about adding Danaher right now, use this momentum to widen your research and pressure test your thinking against other clear opportunities.</p> <ul> <li>Spot potential value opportunities by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a> that combine quality fundamentals with prices that may not fully reflect their current profiles.</li> <li>Prioritise resilience first and check companies filtered by our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> so you can focus on businesses with fewer red flags.</li> <li>Hunt for potential early stage winners with strong under the radar fundamentals using our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> before everyone else starts paying attention.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 08:01:38",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-dhr/danaher/news/assessing-danaher-dhr-valuation-after-recent-share-price-wea",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bonheur (OB:BONHR) Margin Improvement Reinforces Bullish Profitability Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Bonheur (OB:BONHR) FY 2025 earnings snapshot</h2> <p>Bonheur (OB:BONHR) has wrapped up FY 2025 with fourth quarter revenue of NOK2.9b and basic EPS of NOK3, rounding out a trailing twelve month EPS of NOK33.4 and net income of NOK1.4b. The company has seen quarterly revenue range from NOK2.9b to NOK3.4b over 2025, with basic EPS moving from a loss of NOK0.99 in Q1 to NOK20.62 in Q2, NOK10.84 in Q3 and NOK3 in Q4. Trailing twelve month EPS has tracked between NOK21.81 and NOK33.4 over the last six reported periods. With net profit margin improving from 8.2% to 11.4% over the past year, the latest print provides a picture of firmer profitability that investors will weigh against the forward earnings outlook.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/no/capital-goods/ob-bonhr/bonheur-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Bonheur.</a> <p>With the headline numbers on the table, the next step is to see how this earnings run rate lines up with the widely held narratives around Bonheur's growth potential, risk profile and profit trajectory.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/jq8q31gd-floating-wind-and-renewables-will-drive-demand-despite-risks\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Bonheur</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/no/capital-goods/ob-bonhr/bonheur-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"OB:BONHR Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/bea6d945-d331-44e5-ad85-1e03aee84bc0/chart/revenue-and-expenses-breakdown?date=2026-02-26\" width=\"746\"/></a><figcaption>OB:BONHR Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <h2>Margins strengthen with 11.4% net level</h2> <ul> <li>Over the last twelve months, Bonheur generated NOK12.5b of revenue and NOK1.4b of net income, giving an 11.4% net margin compared with 8.2% a year earlier, alongside 24.8% earnings growth.</li> <li>What stands out for the bullish view is that this higher margin coincides with a period when quarterly revenue has been fairly steady between NOK2.9b and NOK3.6b. That supports the idea that profitability, not just top line, is doing more of the work.\n    <ul> <li>Bulls point to wind service and new wind farms as key earnings drivers, and the move from NOK927.6m to NOK1.4b in trailing net income over the last six reported periods is consistent with that stronger earnings story.</li> <li>At the same time, operational issues mentioned in the bearish narrative, like downtime at certain wind farms and lower power prices in Sweden, are not yet visible in these full year margin and earnings figures. This may make bulls more confident than bears about profit resilience.</li> </ul> </li> </ul> <p>Bulls argue that improved margins and earnings give Bonheur more room to handle project hiccups before profits come under pressure, which is exactly what the latest 11.4% net margin suggests at face value. <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/jq8q31gd-floating-wind-and-renewables-will-drive-demand-despite-risks\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 Bonheur Bull Case</strong></a></p> <h2>P/E of 7.8x vs slower forecast growth</h2> <ul> <li>Bonheur is trading on a trailing P/E of 7.8x, which sits below the Norwegian market at 14.2x, peers at 16.7x and European Industrials at 21.6x. In this dataset, earnings are forecast to decline about 10.8% per year over the next three years and revenue is expected to grow around 0.5% per year versus 3.9% for the wider Norwegian market.</li> <li>Skeptics highlight that a low P/E can be a value signal or a warning, and the bearish narrative leans on those forward numbers to argue that the multiple is low because the market is already factoring in slower growth.\n    <ul> <li>The contrast between 24.8% trailing earnings growth and the expected 10.8% annual decline is exactly the kind of swing bears focus on when they say recent profits may not be a good guide to the next few years.</li> <li>With the share price at NOK260 and analysts in this dataset expecting earnings to shrink while margins ease from 9.4% to 8.2% in the bearish case, the gap between strong recent profitability and softer forecasts is central to that cautious stance.</li> </ul> </li> </ul> <p>Skeptics warn that the combination of a low P/E and projected earnings declines can sometimes signal a value trap rather than a bargain, which is why they lean more heavily on the forward numbers than the trailing growth. <a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/id87qqn3-higher-borrowing-costs-and-supply-disruptions-will-strangle-wind-expansion\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 Bonheur Bear Case</strong></a></p> <h2>DCF fair value of NOK87.02 vs NOK260 price</h2> <ul> <li>The DCF fair value in this dataset is NOK87.02 per share, compared with the current share price of NOK260 and an allowed analyst price target of NOK306.00. This sets up a wide range of views on what the business may be worth.</li> <li>Consensus narrative thinking tries to balance this by pointing out that while analysts expect earnings to reach about NOK957.7m by 2028 with margins easing to 7.6%, they are still using a 14.1x P/E on those earnings to justify targets closer to NOK306.00, which sits well above the DCF fair value but below very aggressive bullish assumptions.\n    <ul> <li>The fact that trailing earnings sit at NOK1.4b, above that NOK957.7m 2028 estimate, helps explain why a cash flow model might point to NOK87.02, while a multiple based on today’s 7.8x P/E and analysts’ future 14.1x assumption can support higher targets.</li> <li>For you as an investor, the tension between a DCF number far below the market price, a market P/E well below peers and an analyst target at NOK306.00 highlights how sensitive valuation is to which metric you trust most.</li> </ul> </li> </ul> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/jq8q31gd-floating-wind-and-renewables-will-drive-demand-despite-risks\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Bonheur on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>If this mix of bullish and cautious views leaves you unsure, quickly review the numbers yourself and weigh both sides using <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/no/capital-goods/ob-bonhr/bonheur-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 1 important warning sign</a>.</p> <h2>See What Else Is Out There</h2> <p>Bonheur's low 7.8x P/E alongside forecasts for annual earnings declines of about 10.8% and lower future margins suggests the current profit story may be fragile.</p> <p>If that mix of weaker earnings expectations and a wide gap between DCF fair value and the share price worries you, check out our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">231 high quality undervalued stocks</a> that pair stronger fundamentals with prices that look more grounded in their cash flow profiles.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Bonheur might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/no/capital-goods/ob-bonhr/bonheur-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 08:01:38",
            "link": "https://simplywall.st/stocks/no/capital-goods/ob-bonhr/bonheur-shares/news/bonheur-obbonhr-margin-improvement-reinforces-bullish-profit",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        }
    ]
}