{
    "data": [
        {
            "title": "High Growth Tech Explores 3 Leading Stocks with Promising Expansion",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p>The global markets have experienced a turbulent week, with U.S. stocks mostly lower amid AI competition fears and mixed earnings reports, while European indices reached record highs following interest rate cuts by the ECB. In this context of volatility and competitive pressures, identifying high-growth tech stocks requires careful consideration of factors such as innovation potential and resilience to market shifts.</p><h3>Top 10 High Growth Tech Companies</h3><table><tbody><tr><th>Name</th><th>Revenue Growth</th><th>Earnings Growth</th><th>Growth Rating</th></tr><tr><td>Shanghai Baosight SoftwareLtd</td><td>21.82%</td><td>25.22%</td><td>★★★★★★</td></tr><tr><td>Seojin SystemLtd</td><td>35.41%</td><td>39.86%</td><td>★★★★★★</td></tr><tr><td>eWeLLLtd</td><td>26.41%</td><td>28.82%</td><td>★★★★★★</td></tr><tr><td>Yggdrazil Group</td><td>30.20%</td><td>87.10%</td><td>★★★★★★</td></tr><tr><td>Medley</td><td>20.95%</td><td>27.32%</td><td>★★★★★★</td></tr><tr><td>Mental Health TechnologiesLtd</td><td>25.83%</td><td>113.12%</td><td>★★★★★★</td></tr><tr><td>Fine M-TecLTD</td><td>36.52%</td><td>135.02%</td><td>★★★★★★</td></tr><tr><td>JNTC</td><td>29.48%</td><td>104.37%</td><td>★★★★★★</td></tr><tr><td>Dmall</td><td>29.53%</td><td>88.37%</td><td>★★★★★★</td></tr><tr><td>Delton Technology (Guangzhou)</td><td>20.25%</td><td>29.52%</td><td>★★★★★★</td></tr></tbody></table><p><a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/215171/high-growth-tech-and-ai-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">Click here to see the full list of 1230 stocks from our  High Growth Tech and AI Stocks screener.</a></p><p>We're going to check out a few of the best picks from our screener tool.</p><h2><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/cn/tech/szse-001389/delton-technology-guangzhou-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Delton Technology (Guangzhou) (SZSE:001389)</a></h2><p><strong>Simply Wall St Growth Rating:</strong> ★★★★★★</p><p><strong>Overview:</strong> Delton Technology (Guangzhou) Inc. engages in the research, development, production, and sale of printed circuit boards both in China and internationally, with a market capitalization of CN¥24.72 billion.</p><p><strong>Operations:</strong> Delton Technology (Guangzhou) Inc. focuses on the production and sale of printed circuit boards, catering to both domestic and international markets. The company's revenue model is centered around its expertise in printed circuit board manufacturing, though specific revenue figures for different segments are not provided.</p><p>Delton Technology (Guangzhou) demonstrates robust growth dynamics, with revenue and earnings forecasted to outpace the broader Chinese market. Specifically, revenue is expected to increase by 20.2% annually, surpassing the national average of 13.3%, while earnings could see a significant rise of 29.5% per year, compared to the market's 25%. This performance is underscored by its recent inclusion in both the Shenzhen Stock Exchange A Share and Component Indexes on December 16, 2024, reflecting growing investor recognition. With an anticipated high Return on Equity of 21.4% in three years' time, Delton's strategic focus on innovation and market expansion could continue to yield substantial results within the tech sector.</p><ul><li><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/cn/tech/szse-001389/delton-technology-guangzhou-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Unlock comprehensive insights into our analysis of Delton Technology (Guangzhou) stock in this health report.</a></li><li><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/cn/tech/szse-001389/delton-technology-guangzhou-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Understand Delton Technology (Guangzhou)'s track record by examining our Past report.</a></p></li></ul><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/cn/tech/szse-001389/delton-technology-guangzhou-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"SZSE:001389 Revenue and Expenses Breakdown as at Feb 2025\" class=\"sc-25294e4c-0 jrFsFO\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/942bb741-9494-4170-954f-eee2c3a394a5/chart/revenue-and-expenses-breakdown\" width=\"746\"/></a><figcaption>SZSE:001389 Revenue and Expenses Breakdown as at Feb 2025</figcaption></figure><h2><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/cn/tech/szse-002446/guangdong-shenglu-telecommunication-tech-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Guangdong Shenglu Telecommunication Tech (SZSE:002446)</a></h2><p><strong>Simply Wall St Growth Rating:</strong> ★★★★★☆</p><p><strong>Overview:</strong> Guangdong Shenglu Telecommunication Tech is a company focused on the telecommunications industry, with a market cap of CN¥5.26 billion.</p><p><strong>Operations:</strong> Shenglu Telecommunication Tech specializes in the telecommunications sector, generating revenue primarily through its range of telecommunication products and services. The company focuses on delivering innovative solutions to meet the demands of a rapidly evolving industry.</p><p>Guangdong Shenglu Telecommunication Tech. Co., Ltd. is setting a brisk pace in the tech sector with its aggressive revenue growth forecast at 31.3% annually, significantly outstripping the Chinese market average of 13.3%. This growth is complemented by an expected surge in earnings, projected to increase by 84.5% per year as the company transitions from unprofitability to profitability within three years. The firm's commitment to innovation and future planning is evident from its recent share repurchase program valued at CNY 285.8 million, aimed at bolstering employee ownership and incentivizing performance through equity plans, funded robustly through internal resources and strategic financial partnerships.</p><ul><li><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/cn/tech/szse-002446/guangdong-shenglu-telecommunication-tech-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Click here to discover the nuances of Guangdong Shenglu Telecommunication Tech with our detailed analytical health report.</a></li><li><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/cn/tech/szse-002446/guangdong-shenglu-telecommunication-tech-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Learn about Guangdong Shenglu Telecommunication Tech's  historical performance.</a></p></li></ul><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/cn/tech/szse-002446/guangdong-shenglu-telecommunication-tech-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"SZSE:002446 Revenue and Expenses Breakdown as at Feb 2025\" class=\"sc-25294e4c-0 jrFsFO\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3ec8ba36-59d7-4301-b8a2-12541e91e1db/chart/revenue-and-expenses-breakdown\" width=\"746\"/></a><figcaption>SZSE:002446 Revenue and Expenses Breakdown as at Feb 2025</figcaption></figure><h2><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/cn/tech/szse-002913/aoshikang-technology-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Aoshikang Technology (SZSE:002913)</a></h2><p><strong>Simply Wall St Growth Rating:</strong> ★★★★☆☆</p><p><strong>Overview:</strong> Aoshikang Technology Co., Ltd. specializes in the research, development, production, and sale of printed circuit boards with a market capitalization of approximately CN¥7.74 billion.</p><p><strong>Operations:</strong> Aoshikang Technology focuses on producing printed circuit boards, generating revenue of approximately CN¥4.41 billion from this segment.</p><p>Aoshikang Technology is navigating the competitive tech landscape with a robust annual revenue growth rate of 19%, outpacing the broader Chinese market's 13.3%. This growth trajectory is bolstered by an impressive forecast for earnings to expand at 30.7% annually, reflecting strong operational efficiencies and market demand. The company’s focus on R&amp;D, crucial for maintaining its competitive edge, is evidenced by its significant investment in this area, aligning with industry leaders who typically allocate substantial resources to innovation. Recent strategic moves include board restructuring and amendments to corporate governance, positioning Aoshikang well for future scalability and adaptability in a rapidly evolving sector.</p><ul><li><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/cn/tech/szse-002913/aoshikang-technology-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Dive into the specifics of Aoshikang Technology here with our thorough health report.</a></li><li><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/cn/tech/szse-002913/aoshikang-technology-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Evaluate Aoshikang Technology's historical performance by accessing our past performance report.</a></p></li></ul><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/cn/tech/szse-002913/aoshikang-technology-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"SZSE:002913 Revenue and Expenses Breakdown as at Feb 2025\" class=\"sc-25294e4c-0 jrFsFO\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/ea4beba6-8c78-49a8-ab08-ce8634f3e5bc/chart/revenue-and-expenses-breakdown\" width=\"746\"/></a><figcaption>SZSE:002913 Revenue and Expenses Breakdown as at Feb 2025</figcaption></figure><h2>Next Steps</h2><ul><li>Discover the full array of 1230 <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/215171/high-growth-tech-and-ai-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\"> High Growth Tech and AI Stocks</a> right here.</li><li>Shareholder in one or more of these companies? Ensure you're never caught off-guard by <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">adding your portfolio in Simply Wall St</a> for timely alerts on significant stock developments.</li><li>Maximize your investment potential with Simply Wall St, the comprehensive app that offers global market insights for free.</li></ul><h2>Ready To Venture Into Other Investment Styles?</h2><ul><li>Explore <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/152/undiscovered-gems-with-strong-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\">high-performing small cap companies</a> that haven't yet garnered significant analyst attention.</li><li>Fuel your portfolio with <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/10228/fast-growing-stocks-with-high-insider-ownership/global\" rel=\"noopener noreferrer\" target=\"_blank\">companies showing strong growth potential, backed by optimistic outlooks both from analysts and management</a>.</li><li>Find <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/168/undervalued-stocks-based-on-cash-flows/global\" rel=\"noopener noreferrer\" target=\"_blank\">companies with promising cash flow potential yet trading below their fair value</a>.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data \n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your \n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data. \n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. \n    Simply Wall St has no position in any stocks mentioned.</em></p></div>",
            "pub_date": "2025-02-04 16:01:04",
            "link": "https://simplywall.st/stocks/cn/tech/szse-002446/guangdong-shenglu-telecommunication-tech-shares/news/high-growth-tech-explores-3-leading-stocks-with-promising-ex",
            "image": "https://images.simplywall.st/asset/industry/8111000-choice2-main-header/1585186811567",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Do Its Financials Have Any Role To Play In Driving Weichai Power Co., Ltd.'s (HKG:2338) Stock Up Recently?",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p> Weichai Power's (HKG:2338) stock is up by a considerable 12% over the past month.   We wonder if and what role the company's financials play in that price change as a company's long-term fundamentals usually dictate market outcomes.      In this article, we decided to focus on <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/stocks/hk/capital-goods/hkg-2338/weichai-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Weichai Power's </a> ROE.   </p><p> Return on equity or ROE is a key measure used to assess how efficiently a company's management is utilizing the company's capital.  In other words, it is a profitability ratio which measures the rate of return on the capital provided by the company's shareholders. </p><p><span class=\"veryHighlightLink\"><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/hk/capital-goods/hkg-2338/weichai-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> See our latest analysis for Weichai Power </a></span></p><h2> How Do You Calculate Return On Equity? </h2><p> <strong>Return on equity can be calculated by using the formula:</strong> </p><p> Return on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity </p><p>So, based on the above formula, the ROE for Weichai Power is:</p><p>11% = CN¥14b ÷ CN¥121b (Based on the trailing twelve months to September 2024).</p><p> The 'return' is the amount earned after tax over the last twelve months.  That means that for every HK$1 worth of shareholders' equity, the company generated HK$0.11 in profit. </p> <h2> What Is The Relationship Between ROE And Earnings Growth? </h2><p> So far, we've learned that ROE is a measure of a company's profitability.  Depending on how much of these profits the company reinvests or \"retains\", and how effectively it does so, we are then able to assess a company’s earnings growth potential.  Assuming everything else remains unchanged, the higher the ROE and profit retention, the higher the growth rate of a company compared to companies that don't necessarily bear these characteristics. </p><h2> Weichai Power's Earnings Growth And 11% ROE </h2><p> To begin with, Weichai Power seems to have a respectable ROE.   And on comparing with the industry, we found that the the average industry ROE is similar at 12%.   Given the circumstances, we can't help but wonder why Weichai Power saw little to no growth in the past five years.  Based on this, we feel that there might be other reasons which haven't been discussed so far in this article that could be hampering the company's growth.  For example, it could be that the company has a high payout ratio or the business has allocated capital poorly, for instance.    </p><p> Next, on comparing with the industry net income growth, we found that the industry grew its earnings by 11% over the last few years.   </p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/hk/capital-goods/hkg-2338/weichai-power-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"past-earnings-growth\" class=\"sc-25294e4c-0 jrFsFO\" height=\"334\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/9283092-past-earnings-growth-1-dark/1738649848859\" width=\"821\"/></a><figcaption class=\"wp-caption-text\">SEHK:2338 Past Earnings Growth February 4th 2025</figcaption></figure><p> Earnings growth is an important metric to consider when valuing a stock.   It’s important for an investor to know whether the market has priced in the company's expected earnings growth (or decline).  Doing so will help them establish if the stock's future looks promising or ominous.    If you're wondering about Weichai Power's's valuation, check out <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/hk/capital-goods/hkg-2338/weichai-power-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">this gauge of its price-to-earnings ratio</a>, as compared to its industry.   </p><h2> Is Weichai Power Efficiently Re-investing Its Profits? </h2> <p> Despite having a normal three-year median payout ratio of 46% (implying that the company keeps 54% of its income) over the last three years, Weichai Power has seen a negligible amount of growth in earnings as we saw above.  So there could be some other explanation in that regard. For instance, the company's business may be deteriorating.   </p> <p> Moreover, Weichai Power has been paying dividends for at least ten years or more suggesting that management must have perceived that the shareholders prefer dividends over earnings growth.      Upon studying the latest analysts' consensus data, we found that the company's future payout ratio is expected to rise to 56% over the next three years.   However, Weichai Power's future ROE is expected to rise to 14% despite the expected increase in the company's payout ratio. We infer that there could be other factors that could be driving the anticipated growth in the company's ROE.    </p> <h2> Summary  </h2> <p> Overall, we feel that Weichai Power certainly does have some positive factors to consider.      Although, we are disappointed to see a lack of growth in earnings even in spite of a high ROE and and a high reinvestment rate. We believe that there might be some outside factors that could be having a negative impact on the business.       Having said that, looking at current analyst estimates, we found that the company's earnings growth rate is expected to see a huge improvement.     To know more about the latest analysts predictions for the company, check out this <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/hk/capital-goods/hkg-2338/weichai-power-shares/future\" rel=\"noopener noreferrer\" target=\"_blank\">visualization of analyst forecasts for the company.</a> </p></div>",
            "pub_date": "2025-02-04 16:01:04",
            "link": "https://simplywall.st/stocks/hk/capital-goods/hkg-2338/weichai-power-shares/news/do-its-financials-have-any-role-to-play-in-driving-weichai-p",
            "image": "https://images.simplywall.st/asset/industry/3071000-choice2-main-header/1585186751359",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Tokai Tokyo Financial Holdings Third Quarter 2025 Earnings: EPS: JP¥18.45 (vs JP¥10.01 in 3Q 2024)",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><h2>Tokai Tokyo Financial Holdings (<a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/stocks/jp/diversified-financials/tse-8616/tokai-tokyo-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">TSE:8616</a>) Third Quarter 2025 Results</h2><h3>Key Financial Results</h3><ul> <li>Revenue: JP¥22.5b (up 10.0% from 3Q 2024).</li> <li>Net income: JP¥4.63b (up 85% from 3Q 2024).</li> <li>Profit margin: 21% (up from 12% in 3Q 2024).</li> <li>EPS: JP¥18.45 (up from JP¥10.01 in 3Q 2024).</li> </ul> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/jp/diversified-financials/tse-8616/tokai-tokyo-financial-holdings-shares/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"earnings-and-revenue-growth\" class=\"sc-25294e4c-0 jrFsFO\" height=\"524\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/880864-earnings-and-revenue-growth-1-dark/1738634761835\" width=\"821\"/></a><figcaption class=\"wp-caption-text\">TSE:8616 Earnings and Revenue Growth February 4th 2025</figcaption></figure> <p><i>All figures shown in the chart above are for the trailing 12 month (TTM) period</i></p> <h3>Tokai Tokyo Financial Holdings Earnings Insights</h3> <p> Looking ahead, revenue is forecast to grow 3.5% p.a. on average during the next 3 years, compared to a 5.8% growth forecast for the Capital Markets industry in Japan.   </p> <p><i><a class=\"company-report-links\" data-vars-link-type=\"industry\" href=\"https://simplywall.st/markets/jp/financials/capital-markets\" rel=\"noopener noreferrer\" target=\"_blank\">Performance of the <strong>Japanese Capital Markets industry.</strong></a></i></p> <p> The company's share price is broadly unchanged from a week ago.  </p> <h3>Risk Analysis</h3><p> It's still necessary to consider the ever-present spectre of investment risk. <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/jp/diversified-financials/tse-8616/tokai-tokyo-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> <strong> We've identified 1 warning sign </strong> with Tokai Tokyo Financial Holdings</a>, and understanding this should be part of your investment process. </p></div>",
            "pub_date": "2025-02-04 11:45:55",
            "link": "https://simplywall.st/stocks/jp/diversified-financials/tse-8616/tokai-tokyo-financial-holdings-shares/news/tokai-tokyo-financial-holdings-third-quarter-2025-earnings-e",
            "image": "https://images.simplywall.st/asset/industry/7132000-choice2-main-header/1585186691278",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Those who invested in BANDAI NAMCO Holdings (TSE:7832) five years ago are up 110%",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p> When we invest, we're generally looking for stocks that outperform the market average.  And in our experience, buying the right stocks can give your wealth a significant boost.  To wit, the BANDAI NAMCO Holdings share price has climbed 89% in five years, easily topping the market return of 53% (ignoring dividends).   On the other hand, the more recent gains haven't been so impressive, with shareholders gaining just 23%, including dividends.     </p><p> So let's assess the underlying fundamentals over the last 5 years and see if they've moved in lock-step with shareholder returns.  </p><p><span class=\"veryHighlightLink\"><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/jp/consumer-durables/tse-7832/bandai-namco-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> View our latest analysis for BANDAI NAMCO Holdings </a></span></p> <p> To quote Buffett, 'Ships will sail around the world but the Flat Earth Society will flourish. There will continue to be wide discrepancies between price and value in the marketplace...'  One flawed but reasonable way to assess how sentiment around a company has changed is to compare the earnings per share (EPS) with the share price. </p> <p> During five years of share price growth, BANDAI NAMCO Holdings achieved compound earnings per share (EPS) growth of 15% per year.    This EPS growth is reasonably close to the 14% average annual increase in the share price.   This indicates that investor sentiment towards the company has not changed a great deal.  In fact, the share price seems to largely reflect the EPS growth.  </p><p> The image below shows how EPS has tracked over time (if you click on the image you can see greater detail). </p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/jp/consumer-durables/tse-7832/bandai-namco-holdings-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"earnings-per-share-growth\" class=\"sc-25294e4c-0 jrFsFO\" height=\"520\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/409828-earnings-per-share-growth-1-dark/1738635018948\" width=\"821\"/></a><figcaption class=\"wp-caption-text\">TSE:7832 Earnings Per Share Growth February 4th 2025</figcaption></figure><p> It is of course excellent to see how BANDAI NAMCO Holdings has grown profits over the years, but the future is more important for shareholders.  It might be well worthwhile taking a look at our <strong>free</strong> <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/jp/consumer-durables/tse-7832/bandai-namco-holdings-shares/health\" rel=\"noopener noreferrer\" target=\"_blank\">report on how its financial position has changed over time</a>. </p> <h2>What About Dividends?</h2><p> It is important to consider the total shareholder return, as well as the share price return, for any given stock.  The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested.  So for companies that pay a generous dividend, the TSR is often a lot higher than the share price return.  As it happens, BANDAI NAMCO Holdings' TSR for the last 5 years was 110%, which exceeds the share price return mentioned earlier.  And there's no prize for guessing that the dividend payments largely explain the divergence! </p> <h2>A Different Perspective</h2><p> It's nice to see that BANDAI NAMCO Holdings shareholders have received a total shareholder return of 23% over the last year.   And that does include the dividend.     That's better than the annualised return of 16% over half a decade, implying that the company is doing better recently.  Someone with an optimistic perspective could view the recent improvement in TSR as indicating that the business itself is getting better with time.        I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too.   Case in point: We've spotted <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/jp/consumer-durables/tse-7832/bandai-namco-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> <strong> 2 warning signs for BANDAI NAMCO Holdings</strong> </a> you should be aware of, and 1 of them doesn't sit too well with us.    </p><p> Of course, <strong>you might find a fantastic investment by looking elsewhere.</strong> So take a peek at this <strong>free</strong> <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/19524/growth-stocks\" rel=\"noopener noreferrer\" target=\"_blank\">list of companies we expect will grow earnings.</a> </p><p><em>Please note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on Japanese exchanges.</em></p></div>",
            "pub_date": "2025-02-04 11:45:55",
            "link": "https://simplywall.st/stocks/jp/consumer-durables/tse-7832/bandai-namco-holdings-shares/news/those-who-invested-in-bandai-namco-holdings-tse7832-five-yea",
            "image": "https://images.simplywall.st/asset/industry/4121000-choice2-main-header/1585186962234",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "These 4 Measures Indicate That YC (KOSDAQ:232140) Is Using Debt Reasonably Well",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p> The external fund manager backed by Berkshire Hathaway's Charlie Munger, Li Lu, makes no bones about it when he says 'The biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital.'  It's only natural to consider a company's balance sheet when you examine how risky it is, since debt is often involved when a business collapses.  Importantly, <strong>YC Corporation</strong> (<a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/stocks/kr/semiconductors/kosdaq-a232140/yc-shares\" rel=\"noopener noreferrer\" target=\"_blank\">KOSDAQ:232140</a>) does carry debt.  But the real question is whether this debt is making the company risky. </p><h2> What Risk Does Debt Bring? </h2><p> Debt is a tool to help businesses grow, but if a business is incapable of paying off its lenders, then it exists at their mercy.  Ultimately, if the company can't fulfill its legal obligations to repay debt, shareholders could walk away with nothing.  While that is not too common, we often do see indebted companies permanently diluting shareholders because lenders force them to raise capital at a distressed price.  By replacing dilution, though, debt can be an extremely good tool for businesses that need capital to invest in growth at high rates of return.  When we think about a company's use of debt, we first look at cash and debt together. </p> <p><span class=\"veryHighlightLink\"><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/kr/semiconductors/kosdaq-a232140/yc-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> View our latest analysis for YC </a></span></p><h2> What Is YC's Debt? </h2><p> As you can see below, at the end of September 2024, YC had ₩84.7b of debt, up from ₩75.5b a year ago. Click the image for more detail.    But on the other hand it also has ₩121.3b in cash, leading to a ₩36.6b net cash position.  </p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/kr/semiconductors/kosdaq-a232140/yc-shares/health\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"debt-equity-history-analysis\" class=\"sc-25294e4c-0 jrFsFO\" height=\"526\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/226571001-debt-equity-history-analysis-1-dark/1738622307368\" width=\"821\"/></a><figcaption class=\"wp-caption-text\">KOSDAQ:A232140 Debt to Equity History February 3rd 2025</figcaption></figure><h2> How Strong Is YC's Balance Sheet? </h2><p> We can see from the most recent balance sheet that YC had liabilities of ₩72.8b falling due within a year, and liabilities of ₩59.9b due beyond that.   Offsetting these obligations, it had cash of ₩121.3b as well as receivables valued at ₩12.8b due within 12 months.   So its total liabilities are just about perfectly matched by its shorter-term, liquid assets.  </p><p> Having regard to YC's size, it seems that its liquid assets are well balanced with its total liabilities.  So while it's hard to imagine that the ₩799.8b company is struggling for cash, we still think it's worth monitoring its balance sheet.    Succinctly put, YC boasts net cash, so it's fair to say it does not have a heavy debt load!   </p> <p> In addition to that, we're happy to report that YC has boosted its EBIT by 56%, thus reducing the spectre of future debt repayments.      When analysing debt levels, the balance sheet is the obvious place to start.  But ultimately the future profitability of the business will decide if YC can strengthen its balance sheet over time.  So if you're focused on the future you can check out this <strong>free</strong> <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/kr/semiconductors/kosdaq-a232140/yc-shares/future\" rel=\"noopener noreferrer\" target=\"_blank\">report showing analyst profit forecasts</a>. </p><p> But our final consideration is also important, because a company cannot pay debt with paper profits; it needs cold hard cash.   While YC has net cash on its balance sheet, it's still worth taking a look at its ability to convert earnings before interest and tax (EBIT) to free cash flow, to help us understand how quickly it is building (or eroding) that cash balance.    Over the last three years, YC saw substantial negative free cash flow, in total.  While investors are no doubt expecting a reversal of that situation in due course, it clearly does mean its use of debt is more risky.   </p> <h2>Summing Up</h2><p> While we empathize with investors who find debt concerning, you should keep in mind that YC has net cash of ₩36.6b, as well as more liquid assets than liabilities.     And it impressed us with its EBIT growth of 56% over the last year.     So we are not troubled with YC's debt use.    When analysing debt levels, the balance sheet is the obvious place to start.  However, not all investment risk resides within the balance sheet - far from it.   For instance, we've identified <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/kr/semiconductors/kosdaq-a232140/yc-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> <strong> 1 warning sign for YC</strong> </a> that you should be aware of.   </p> <p> Of course, if you're the type of investor who prefers buying stocks without the burden of debt, then don't hesitate to discover <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/27012/net-cash-stocks-with-a-growth-track-record\" rel=\"noopener noreferrer\" target=\"_blank\">our exclusive list of net cash growth stocks</a>, today. </p></div>",
            "pub_date": "2025-02-04 07:25:51",
            "link": "https://simplywall.st/stocks/kr/semiconductors/kosdaq-a232140/yc-shares/news/these-4-measures-indicate-that-yc-kosdaq232140-is-using-debt",
            "image": "https://images.simplywall.st/asset/industry/8211000-choice1-main-header/1585186899663",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Heiwa (TSE:6412) Is Paying Out A Dividend Of ¥40.00",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p> The board of <strong>Heiwa Corporation</strong> (<a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/stocks/jp/consumer-services/tse-6412/heiwa-shares\" rel=\"noopener noreferrer\" target=\"_blank\">TSE:6412</a>) has announced that it will pay a dividend of ¥40.00 per share on the 30th of June.      Based on this payment, the dividend yield on the company's stock will be 3.5%, which is an attractive boost to shareholder returns.   </p><p><span class=\"veryHighlightLink\"><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/jp/consumer-services/tse-6412/heiwa-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> Check out our latest analysis for Heiwa </a></span></p> <h2>Heiwa's Payment Could Potentially Have Solid Earnings Coverage</h2> <p> Impressive dividend yields are good, but this doesn't matter much if the payments can't be sustained.     Prior to this announcement, Heiwa's dividend was only 40% of earnings, however it was paying out 139% of free cash flows.  This signals that the company is more focused on returning cash flow to shareholders, but it could mean that the dividend is exposed to cuts in the future.   </p><p> The next year is set to see EPS grow by 16.0%.   Assuming the dividend continues along recent trends, we think the payout ratio could be 35% by next year, which is in a pretty sustainable range.     </p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/jp/consumer-services/tse-6412/heiwa-shares/dividend\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"historic-dividend\" class=\"sc-25294e4c-0 jrFsFO\" height=\"508\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/882148-historic-dividend-1-dark/1738622313772\" width=\"821\"/></a><figcaption class=\"wp-caption-text\">TSE:6412 Historic Dividend February 3rd 2025</figcaption></figure> <h2>Heiwa Has A Solid Track Record</h2> <p> The company has an extended history of paying stable dividends.      Since 2015, the dividend has gone from ¥60.00 total annually to ¥80.00.      This means that it has been growing its distributions at 2.9% per annum over that time.     Slow and steady dividend growth might not sound that exciting, but dividends have been stable for ten years, which we think makes this a fairly attractive offer.    </p> <h2>Heiwa Could Grow Its Dividend</h2> <p> Investors could be attracted to the stock based on the quality of its payment history.     Heiwa has impressed us by growing EPS at 9.8% per year over the past five years.       The company is paying out a lot of its cash as a dividend, but it looks okay based on the payout ratio.    </p> <h2>Our Thoughts On Heiwa's Dividend</h2> <p> Overall, it's nice to see a consistent dividend payment, but we think that longer term, the current level of payment might be unsustainable.       While Heiwa is earning enough to cover the payments, the cash flows are lacking.      We would probably look elsewhere for an income investment.  </p><p> Investors generally tend to favour companies with a consistent, stable dividend policy as opposed to those operating an irregular one.  Meanwhile, despite the importance of dividend payments, they are not the only factors our readers should know when assessing a company.   For instance, we've picked out <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/jp/consumer-services/tse-6412/heiwa-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>1 warning sign for Heiwa</strong></a> that investors should take into consideration.   Is Heiwa not quite the opportunity you were looking for? Why not check out our <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/240709/top-dividend-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>selection of top dividend stocks. </strong></a> </p></div>",
            "pub_date": "2025-02-04 07:25:51",
            "link": "https://simplywall.st/stocks/jp/consumer-services/tse-6412/heiwa-shares/news/heiwa-tse6412-is-paying-out-a-dividend-of-4000-1",
            "image": "https://images.simplywall.st/asset/industry/4121000-choice2-main-header/1585186962234",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Exploring Undiscovered Gems With Potential In February 2025",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p>As global markets navigate a period of volatility marked by mixed corporate earnings, AI competition fears, and steady interest rates from the Federal Reserve, investors are increasingly seeking opportunities in small-cap stocks. In this dynamic environment, identifying undiscovered gems requires a keen eye for companies with strong fundamentals and potential resilience amid shifting economic conditions.</p><h3>Top 10 Undiscovered Gems With Strong Fundamentals</h3><table><tbody><tr><th>Name</th><th>Debt To Equity</th><th>Revenue Growth</th><th>Earnings Growth</th><th>Health Rating</th></tr><tr><td>Wilson Bank Holding</td><td>NA</td><td>7.87%</td><td>8.22%</td><td>★★★★★★</td></tr><tr><td>Ovostar Union</td><td>0.01%</td><td>10.19%</td><td>49.85%</td><td>★★★★★★</td></tr><tr><td>All E Technologies</td><td>NA</td><td>18.60%</td><td>31.35%</td><td>★★★★★★</td></tr><tr><td>Hermes Transportes Blindados</td><td>50.88%</td><td>4.57%</td><td>3.33%</td><td>★★★★★☆</td></tr><tr><td>HOMAG Group</td><td>NA</td><td>-31.14%</td><td>23.43%</td><td>★★★★★☆</td></tr><tr><td>Compañía Electro Metalúrgica</td><td>71.27%</td><td>12.50%</td><td>19.90%</td><td>★★★★☆☆</td></tr><tr><td>La Positiva Seguros y Reaseguros</td><td>0.04%</td><td>8.78%</td><td>27.31%</td><td>★★★★☆☆</td></tr><tr><td>Sociedad Eléctrica del Sur Oeste</td><td>42.67%</td><td>8.52%</td><td>4.10%</td><td>★★★★☆☆</td></tr><tr><td>Practic</td><td>NA</td><td>3.63%</td><td>6.85%</td><td>★★★★☆☆</td></tr><tr><td>Jiangsu Aisen Semiconductor MaterialLtd</td><td>12.19%</td><td>14.60%</td><td>12.10%</td><td>★★★★☆☆</td></tr></tbody></table><p><a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/152/undiscovered-gems-with-strong-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\"> Click here to see the full list of 4682 stocks from our  Undiscovered Gems With Strong Fundamentals screener.\n    </a></p><p>We're going to check out a few of the best picks from our screener tool.</p><h2><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/tr/real-estate/ibse-yggyo/yeni-gimat-gayrimenkul-yatirim-ortakligi-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Yeni Gimat Gayrimenkul Yatirim Ortakligi (IBSE:YGGYO)</a></h2><p><strong>Simply Wall St Value Rating:</strong> ★★★★★☆</p><p><strong>Overview:</strong> Yeni Gimat Gayrimenkul Yatirim Ortakligi A.S. is a real estate investment company with operations primarily focused on managing commercial properties, and it has a market capitalization of TRY16.53 billion.</p><p><strong>Operations:</strong> YGGYO generates revenue primarily from the Ankamall Shopping Mall, contributing TRY1.96 billion, and CP Ankara Hotel with TRY154.24 million. The net profit margin for the company is not specified in the provided data.</p><p>Yeni Gimat Gayrimenkul Yatirim Ortakligi, a relatively small player in the Retail REITs sector, has seen its earnings grow at an impressive 65% annually over the last five years. Despite this growth, recent performance indicates some challenges; third-quarter sales jumped to TRY 904 million from TRY 216 million year-on-year, yet net income fell sharply to TRY 564 million from TRY 2.48 billion. The company's debt-to-equity ratio remains low at just 0.2%, and it trades significantly below estimated fair value by around 83%. While cash flow is positive and interest coverage is not a concern, earnings growth of only 4% last year lagged behind industry peers.</p><ul><li><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/tr/real-estate/ibse-yggyo/yeni-gimat-gayrimenkul-yatirim-ortakligi-shares/health\" rel=\"noopener noreferrer\" target=\"_blank\">Navigate through the intricacies of Yeni Gimat Gayrimenkul Yatirim Ortakligi with our comprehensive health report here.</a></li><li><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/tr/real-estate/ibse-yggyo/yeni-gimat-gayrimenkul-yatirim-ortakligi-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Understand Yeni Gimat Gayrimenkul Yatirim Ortakligi's track record by examining our Past report.</a></p></li></ul><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/tr/real-estate/ibse-yggyo/yeni-gimat-gayrimenkul-yatirim-ortakligi-shares/health\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"IBSE:YGGYO Debt to Equity as at Feb 2025\" class=\"sc-25294e4c-0 jrFsFO\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/27f3fc96-d4fa-4e56-9cff-6e26c2ff589b/chart/debt-equity-history-analysis\" width=\"746\"/></a><figcaption>IBSE:YGGYO Debt to Equity as at Feb 2025</figcaption></figure><h2><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/il/consumer-retailing/tase-dipl/diplomat-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Diplomat Holdings (TASE:DIPL)</a></h2><p><strong>Simply Wall St Value Rating:</strong> ★★★★★★</p><p><strong>Overview:</strong> Diplomat Holdings Ltd. is a sales and distribution company in the fast-moving consumer goods sector with a market cap of ₪1.42 billion.</p><p><strong>Operations:</strong> Diplomat Holdings generates revenue primarily from its role in sales and distribution within the fast-moving consumer goods sector. The company reported a market cap of ₪1.42 billion, reflecting its scale in this industry.</p><p>Diplomat Holdings, a smaller player in its field, has shown promising financial health with earnings growing 3.1% annually over the past five years and high-quality past earnings. The company's debt situation has improved significantly, with the debt-to-equity ratio dropping from 120.3% to 37.1% over five years, while interest payments are comfortably covered at 7.5 times by EBIT. Despite not outpacing industry growth last year at 53.8%, it remains a good value proposition trading at nearly 96% below estimated fair value and maintains satisfactory net debt levels of 29.2%. A recent cash dividend of ILS0.65 further highlights its shareholder returns focus.</p><ul><li><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/il/consumer-retailing/tase-dipl/diplomat-holdings-shares/health\" rel=\"noopener noreferrer\" target=\"_blank\">Get an in-depth perspective on Diplomat Holdings' performance by reading our health report here.</a></li><li><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/il/consumer-retailing/tase-dipl/diplomat-holdings-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Assess Diplomat Holdings' past performance with our detailed historical performance reports.</a></p></li></ul><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/il/consumer-retailing/tase-dipl/diplomat-holdings-shares/health\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TASE:DIPL Debt to Equity as at Feb 2025\" class=\"sc-25294e4c-0 jrFsFO\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/fecf727c-c281-438e-b2bd-5e2be00284fa/chart/debt-equity-history-analysis\" width=\"746\"/></a><figcaption>TASE:DIPL Debt to Equity as at Feb 2025</figcaption></figure><h2><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/jp/capital-goods/tse-8052/tsubakimoto-kogyo-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Tsubakimoto Kogyo (TSE:8052)</a></h2><p><strong>Simply Wall St Value Rating:</strong> ★★★★★★</p><p><strong>Overview:</strong> Tsubakimoto Kogyo Co., Ltd. is involved in the sale of machinery, equipment, parts, and accessories in Japan with a market cap of ¥39.62 billion.</p><p><strong>Operations:</strong> The company generates revenue primarily from the sale of machinery, equipment, parts, and accessories. It has a market cap of ¥39.62 billion.</p><p>Tsubakimoto Kogyo, a nimble player in the Trade Distributors industry, is trading at 60.6% below its estimated fair value, suggesting potential undervaluation. The company has demonstrated robust earnings growth of 10.2% over the past year, outpacing the industry's modest 0.4%. With no debt on its books for five years and high-quality earnings reported, it appears financially sound and agile in capital management. Recently, Tsubakimoto completed a share buyback of 450,000 shares for ¥843 million to enhance shareholder returns and capital efficiency—highlighting proactive financial strategies amidst evolving market dynamics.</p><ul><li><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/jp/capital-goods/tse-8052/tsubakimoto-kogyo-shares/health\" rel=\"noopener noreferrer\" target=\"_blank\">Click to explore a detailed breakdown of our findings in Tsubakimoto Kogyo's health report.</a></li><li><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/jp/capital-goods/tse-8052/tsubakimoto-kogyo-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Gain insights into Tsubakimoto Kogyo's historical performance by reviewing our past performance report.</a></p></li></ul><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/jp/capital-goods/tse-8052/tsubakimoto-kogyo-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSE:8052 Earnings and Revenue Growth as at Feb 2025\" class=\"sc-25294e4c-0 jrFsFO\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/7fc9cc67-627d-4c2b-8a61-c4a05e33c452/chart/earnings-and-revenue-growth\" width=\"746\"/></a><figcaption>TSE:8052 Earnings and Revenue Growth as at Feb 2025</figcaption></figure><h2>Make It Happen</h2><ul><li>Discover the full array of 4682 <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/152/undiscovered-gems-with-strong-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\"> Undiscovered Gems With Strong Fundamentals</a> right here.</li><li>Are any of these part of your asset mix? <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">Tap into the analytical power of Simply Wall St's portfolio</a> to get a 360-degree view on how they're shaping up.</li><li>Elevate your portfolio with Simply Wall St, the ultimate app for investors seeking global market coverage.</li></ul><h2>Ready To Venture Into Other Investment Styles?</h2><ul><li>Explore <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/152/undiscovered-gems-with-strong-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\">high-performing small cap companies</a> that haven't yet garnered significant analyst attention.</li><li>Fuel your portfolio with <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/10228/fast-growing-stocks-with-high-insider-ownership/global\" rel=\"noopener noreferrer\" target=\"_blank\">companies showing strong growth potential, backed by optimistic outlooks both from analysts and management</a>.</li><li>Find <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/168/undervalued-stocks-based-on-cash-flows/global\" rel=\"noopener noreferrer\" target=\"_blank\">companies with promising cash flow potential yet trading below their fair value</a>.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data \n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your \n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data. \n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. \n    Simply Wall St has no position in any stocks mentioned.</em></p></div>",
            "pub_date": "2025-02-04 03:30:57",
            "link": "https://simplywall.st/stocks/tr/real-estate/ibse-yggyo/yeni-gimat-gayrimenkul-yatirim-ortakligi-shares/news/exploring-undiscovered-gems-with-potential-in-february-2025",
            "image": "https://images.simplywall.st/asset/industry/9551736-choice2-main-header/1585186602415",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "Airbnb, Inc. (NASDAQ:ABNB) is largely controlled by institutional shareholders who own 56% of the company",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><h3>Key Insights</h3><ul> <li> Institutions' substantial holdings in Airbnb implies that they have significant influence over the company's share price </li> <li> 50% of the business is held by the top 9 shareholders </li> <li> <a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb/ownership\" rel=\"noopener noreferrer\" target=\"_blank\"> 28% of Airbnb is held by insiders</a> </li> </ul><p> Every investor in Airbnb, Inc. (<a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb\" rel=\"noopener noreferrer\" target=\"_blank\">NASDAQ:ABNB</a>) should be aware of the most powerful shareholder groups.  And the group that holds the biggest piece of the pie are institutions with 56% ownership.   That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn). </p><p> Given the vast amount of money and research capacities at their disposal, institutional ownership tends to carry a lot of weight, especially with individual investors.  Hence, having a considerable amount of institutional money invested in a company is often regarded as a desirable trait.   </p><p> In the chart below, we zoom in on the different ownership groups of Airbnb. </p><p><span class=\"veryHighlightLink\"><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb\" rel=\"noopener noreferrer\" target=\"_blank\"> View our latest analysis for Airbnb </a></span></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb/ownership\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ownership-breakdown\" class=\"sc-25294e4c-0 jrFsFO\" height=\"245\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/115705393-ownership-breakdown-1-dark/1738606979941\" width=\"746\"/></a><figcaption class=\"wp-caption-text\">NasdaqGS:ABNB Ownership Breakdown February 3rd 2025</figcaption></figure> <h2>What Does The Institutional Ownership Tell Us About Airbnb?</h2><p> Many institutions measure their performance against an index that approximates the local market. So they usually pay more attention to companies that are included in major indices. </p> <p> We can see that Airbnb does have institutional investors; and they hold a good portion of the company's stock.  This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes.  If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at Airbnb's earnings history below. Of course, the future is what really matters. </p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"earnings-and-revenue-growth\" class=\"sc-25294e4c-0 jrFsFO\" height=\"524\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/115705393-earnings-and-revenue-growth-1-dark/1738606981321\" width=\"821\"/></a><figcaption class=\"wp-caption-text\">NasdaqGS:ABNB Earnings and Revenue Growth February 3rd 2025</figcaption></figure> <p> Institutional investors own over 50% of the company, so together than can probably strongly influence board decisions.    Airbnb is not owned by hedge funds.      With a 11% stake, CEO Brian Chesky is the largest shareholder.       For context, the second largest shareholder holds about 9.9% of the shares outstanding, followed by an ownership of 6.8% by the third-largest shareholder.      Note that two of the top three shareholders are also Top Key Executive and Member of the Board of Directors, respectively, once again pointing to significant ownership by company insiders.       </p> <p> We also observed that the top 9 shareholders account for more than half of the share register, with a few smaller shareholders to balance the interests of the larger ones to a certain extent.   </p> <p> Researching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments.   There are a reasonable number of analysts covering the stock, so it might be useful to find out their aggregate view on the future.  </p><h2>Insider Ownership Of Airbnb</h2><p> While the precise definition of an insider can be subjective, almost everyone considers board members to be insiders.  Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO. </p><p> Insider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances. </p> <p> It seems insiders own a significant proportion of Airbnb, Inc..   It has a market capitalization of just US$82b, and insiders have US$23b worth of shares in their own names. That's quite significant.  Most would say this shows a good degree of alignment with shareholders, especially in a company of this size. You can <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb/ownership\" rel=\"noopener noreferrer\" target=\"_blank\"> click here to see if those insiders have been buying or selling. </a> </p> <h2>General Public Ownership</h2><p> With a 14% ownership, the general public, mostly comprising of individual investors, have some degree of sway over Airbnb.  While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run.  </p> <h2>Next Steps:</h2><p> It's always worth thinking about the different groups who own shares in a company. But to understand Airbnb better, we need to consider many other factors.    Take risks for example - Airbnb has <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb\" rel=\"noopener noreferrer\" target=\"_blank\"> <strong> 1 warning sign </strong> </a> we think you should be aware of.   </p> <p> But ultimately <strong> it is the future</strong>, not the past, that will determine how well the owners of this business will do. Therefore we think it advisable to take a look at <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb/future\" rel=\"noopener noreferrer\" target=\"_blank\">this free report showing whether analysts are predicting a brighter future</a>. </p> <p><small>NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.</small></p></div>",
            "pub_date": "2025-02-04 03:30:57",
            "link": "https://simplywall.st/stocks/us/consumer-services/nasdaq-abnb/airbnb/news/airbnb-inc-nasdaqabnb-is-largely-controlled-by-institutional",
            "image": "https://images.simplywall.st/asset/industry/4212000-choice1-main-header/1585186649420",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "These 4 Measures Indicate That MercadoLibre (NASDAQ:MELI) Is Using Debt Reasonably Well",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p> The external fund manager backed by Berkshire Hathaway's Charlie Munger, Li Lu, makes no bones about it when he says 'The biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital.'  It's only natural to consider a company's balance sheet when you examine how risky it is, since debt is often involved when a business collapses.  Importantly, <strong>MercadoLibre, Inc.</strong> (<a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/stocks/us/retail/nasdaq-meli/mercadolibre\" rel=\"noopener noreferrer\" target=\"_blank\">NASDAQ:MELI</a>) does carry debt.  But is this debt a concern to shareholders? </p><h2> When Is Debt Dangerous? </h2><p> Debt and other liabilities become risky for a business when it cannot easily fulfill those obligations, either with free cash flow or by raising capital at an attractive price.  Ultimately, if the company can't fulfill its legal obligations to repay debt, shareholders could walk away with nothing.  While that is not too common, we often do see indebted companies permanently diluting shareholders because lenders force them to raise capital at a distressed price.  Of course, plenty of companies use debt to fund growth, without any negative consequences.  The first step when considering a company's debt levels is to consider its cash and debt together. </p> <p><span class=\"veryHighlightLink\"><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/us/retail/nasdaq-meli/mercadolibre\" rel=\"noopener noreferrer\" target=\"_blank\"> See our latest analysis for MercadoLibre </a></span></p><h2> How Much Debt Does MercadoLibre Carry? </h2><p> You can click the graphic below for the historical numbers, but it shows that as of September 2024 MercadoLibre had US$5.27b of debt, an increase on US$4.40b, over one year.    However, it does have US$6.67b in cash offsetting this, leading to net cash of US$1.41b.  </p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/retail/nasdaq-meli/mercadolibre/health\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"debt-equity-history-analysis\" class=\"sc-25294e4c-0 jrFsFO\" height=\"526\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/34322384-debt-equity-history-analysis-1-dark/1738588794142\" width=\"821\"/></a><figcaption class=\"wp-caption-text\">NasdaqGS:MELI Debt to Equity History February 3rd 2025</figcaption></figure><h2> How Healthy Is MercadoLibre's Balance Sheet? </h2><p> According to the last reported balance sheet, MercadoLibre had liabilities of US$14.3b due within 12 months, and liabilities of US$4.31b due beyond 12 months.   On the other hand, it had cash of US$6.67b and US$9.05b worth of receivables due within a year.   So its liabilities total US$2.90b more than the combination of its cash and short-term receivables.  </p><p> Of course, MercadoLibre has a   titanic  market capitalization of US$97.4b, so these liabilities are probably manageable.  Having said that, it's clear that we should continue to monitor its balance sheet, lest it change for the worse.    Despite its noteworthy liabilities, MercadoLibre boasts net cash, so it's fair to say it does not have a heavy debt load!   </p> <p> But the other side of the story is that MercadoLibre saw its EBIT decline by 4.9% over the last year.  That sort of decline, if sustained, will obviously make debt harder to handle.      When analysing debt levels, the balance sheet is the obvious place to start.  But it is future earnings, more than anything, that will determine MercadoLibre's ability to maintain a healthy balance sheet going forward.  So if you want to see what the professionals think, you might find <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/us/retail/nasdaq-meli/mercadolibre/future\" rel=\"noopener noreferrer\" target=\"_blank\">this free report on analyst profit forecasts</a> to be interesting.  </p><p> But our final consideration is also important, because a company cannot pay debt with paper profits; it needs cold hard cash.   While MercadoLibre has net cash on its balance sheet, it's still worth taking a look at its ability to convert earnings before interest and tax (EBIT) to free cash flow, to help us understand how quickly it is building (or eroding) that cash balance.    Happily for any shareholders, MercadoLibre actually produced more free cash flow than EBIT over the last three years.  There's nothing better than incoming cash when it comes to staying in your lenders' good graces.   </p> <h2>Summing Up</h2><p> We could understand if investors are concerned about MercadoLibre's liabilities, but we can be reassured by the fact it has has net cash of US$1.41b.     The cherry on top was that in converted 239% of that EBIT to free cash flow, bringing in US$6.2b.     So we don't think MercadoLibre's use of debt is risky.      Above most other metrics, we think its important to track how fast earnings per share is growing, if at all. If you've also come to that realization, you're in luck, because today you can <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/retail/nasdaq-meli/mercadolibre/past\" rel=\"noopener noreferrer\" target=\"_blank\">view this interactive graph of MercadoLibre's earnings per share history</a> for free.    </p> <p> When all is said and done, sometimes its easier to focus on companies that don't even need debt. Readers can access a <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/27012/net-cash-stocks-with-a-growth-track-record\" rel=\"noopener noreferrer\" target=\"_blank\">list of growth stocks with zero net debt</a> <strong>100% free</strong>, right now. </p></div>",
            "pub_date": "2025-02-03 23:38:22",
            "link": "https://simplywall.st/stocks/us/retail/nasdaq-meli/mercadolibre/news/these-4-measures-indicate-that-mercadolibre-nasdaqmeli-is-us-1",
            "image": "https://images.simplywall.st/asset/industry/4422000-choice2-main-header/1585186866479",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "title": "KWS SAAT SE KGaA (ETR:KWS) Is Looking To Continue Growing Its Returns On Capital",
            "description": "<div class=\"sc-11f25c13-4 bGKxSh\" data-cy-id=\"article-content\"><p> If you're looking for a multi-bagger, there's a few things to keep an eye out for.  Amongst other things, we'll want to see two things; firstly, a growing <em>return</em> on capital employed (ROCE) and secondly, an expansion in the company's <em>amount</em> of capital employed.  This shows us that it's a compounding machine, able to continually reinvest its earnings back into the business and generate higher returns.    So when we looked at <strong>KWS SAAT SE KGaA</strong> (<a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/stocks/de/food-beverage-tobacco/etr-kws/kws-saat-se-kgaa-shares\" rel=\"noopener noreferrer\" target=\"_blank\">ETR:KWS</a>) and its trend of ROCE, we really liked what we saw.    </p><h2> Return On Capital Employed (ROCE): What Is It? </h2><p> For those that aren't sure what ROCE is, it measures the amount of pre-tax profits a company can generate from the capital employed in its business.  The formula for this calculation on KWS SAAT SE KGaA is: </p><p> <strong>Return on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)</strong> </p><p>0.14 = €294m ÷ (€2.7b - €605m) <em>(Based on the trailing twelve months to September 2024)</em>.</p><p> Thus, <strong>KWS SAAT SE KGaA has an ROCE of 14%. </strong> That's a relatively normal return on capital, and it's around the 13% generated by the Food industry.  </p><p><span class=\"veryHighlightLink\"><a class=\"company-report-links\" data-vars-link-type=\"cta\" href=\"https://simplywall.st/stocks/de/food-beverage-tobacco/etr-kws/kws-saat-se-kgaa-shares\" rel=\"noopener noreferrer\" target=\"_blank\"> Check out our latest analysis for KWS SAAT SE KGaA </a></span></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/de/food-beverage-tobacco/etr-kws/kws-saat-se-kgaa-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"roce\" class=\"sc-25294e4c-1 kdwwfs\" height=\"316\" loading=\"lazy\" src=\"https://images.simplywall.st/asset/chart/880406-roce-1-dark/1738589768788\" width=\"333\"/></a><figcaption class=\"wp-caption-text\">XTRA:KWS Return on Capital Employed February 3rd 2025</figcaption></figure><p> In the above chart we have measured KWS SAAT SE KGaA's prior ROCE against its prior performance, but the future is arguably more important.  If you'd like to see what analysts are forecasting going forward, you should check out our <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/de/food-beverage-tobacco/etr-kws/kws-saat-se-kgaa-shares/future\" rel=\"noopener noreferrer\" target=\"_blank\">free analyst report for KWS SAAT SE KGaA </a>. </p><h2> So How Is KWS SAAT SE KGaA's ROCE Trending? </h2><p> KWS SAAT SE KGaA's ROCE growth is quite impressive.   The figures show that over the last  five years, ROCE has grown 101% whilst employing roughly the same amount of capital.  So it's likely that the business is now reaping the full benefits of its past investments, since the capital employed hasn't changed considerably.  It's worth looking deeper into this though because while it's great that the business is more efficient, it might also mean that going forward the areas to invest internally for the organic growth are lacking.   </p><h2> The Bottom Line </h2><p> To sum it up, KWS SAAT SE KGaA is collecting higher returns from the same amount of capital, and that's impressive.     Investors may not be impressed by the favorable underlying trends yet because over the last  five years the stock has only returned 14% to shareholders.  Given that, we'd look further into this stock in case it has more traits that could make it multiply in the long term.   </p><p> Before jumping to any conclusions though, we need to know what value we're getting for the current share price. That's where you can check out our <strong> <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/de/food-beverage-tobacco/etr-kws/kws-saat-se-kgaa-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">FREE intrinsic value estimation for KWS </a> </strong> that compares the share price and estimated value.   </p><p> For those who like to invest in <strong>solid companies,</strong> check out this <strong>free</strong> <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\">list of companies with solid balance sheets and high returns on equity.</a> </p></div>",
            "pub_date": "2025-02-03 23:38:22",
            "link": "https://simplywall.st/stocks/de/food-beverage-tobacco/etr-kws/kws-saat-se-kgaa-shares/news/kws-saat-se-kgaa-etrkws-is-looking-to-continue-growing-its-r-1",
            "image": "https://images.simplywall.st/asset/industry/5121000-choice2-main-header/1585186862101",
            "source": "simplywall",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}