{
    "data": [
        {
            "title": "Universal Health Services Q4 EPS Strength Reinforces Bullish Margin Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Universal Health Services (UHS) has wrapped up FY 2025 with fourth quarter revenue of US$4.5b and basic EPS of US$7.19, backed by net income of US$445.9m. The company has seen quarterly revenue move from US$4.1b in Q4 2024 to US$4.5b in Q4 2025, while basic EPS stepped up from US$5.07 to US$7.19 over the same period. On a trailing twelve month view, net profit margin sits at 8.6% versus 7.2% a year earlier, giving investors a clearer view of how earnings are converting into profit.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Universal Health Services.</a> <p>With the latest numbers on the table, the next step is to see how this earnings profile lines up with the key narratives around UHS, highlighting where the story is confirmed and where expectations might need to be revisited.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/rdizidzn-lower-medicaid-payments-and-rising-costs-will-erode-margins\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Universal Health Services</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:UHS Earnings &amp; Revenue History as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/dc1969cb-1517-4f94-bfaa-fe82aca6adfc/chart/earnings-and-revenue-history?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:UHS Earnings &amp; Revenue History as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>TTM earnings up 30.4% with profit margin at 8.6%</h2> <ul> <li>Over the trailing twelve months, UHS generated US$23.42 in basic EPS and US$1.5b in net income on US$17.4b of revenue, with net profit margin at 8.6% compared with 7.2% a year earlier.</li> <li>What stands out for the bullish view is that this 30.4% trailing earnings growth and higher margin line up with arguments about expanding behavioral health and outpatient capacity. At the same time, the consensus narrative also flags future Medicaid payment reductions, so current profitability and the longer term policy overhang are pulling in different directions.</li> </ul> <h2>Low 8.6x P/E against healthcare peers</h2> <ul> <li>UHS trades on a trailing P/E of 8.6x compared with 23.6x for the wider US healthcare industry and 27x for peers, even though trailing earnings have grown 30.4% year over year and have risen about 7.3% per year over the last five years according to the supplied data.</li> <li>Bulls point to this apparent valuation gap and recent earnings strength as support for their case that the company could justify higher pricing. Yet the current share price of US$204.33 still sits well below the cited DCF fair value of about US$588.00 and below the allowed analyst target of US$253.00, which means the bullish argument about underappreciated growth is being made against forecasts that show earnings and revenue growth of 3.1% and 4.2% per year respectively, both slower than the US market in the inputs.\n    <ul> <li>That tension between a low P/E and slower forecast growth is central to the bullish narrative that outpatient and behavioral expansion, plus technology efficiencies, could support higher margins than the consensus currently embeds.</li> <li>At the same time, the supplied data notes the stock trading materially below the DCF fair value and below US$253.00, which bullish investors treat as evidence that the market is not fully crediting the 30.4% trailing earnings growth and 8.6% margin achieved so far.</li> </ul> </li> </ul> <p>Bulls argue that the market is underestimating how sustained earnings growth and margin resilience could shift sentiment if current trends hold, especially with the stock on an 8.6x P/E and trading below both DCF fair value and the US$253.00 analyst target. <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/6pqkl3yw-new-outpatient-facilities-and-telehealth-will-unlock-secular-market-demand\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 Universal Health Services Bull Case</strong></a></p> <h2>High debt and policy risks against slower 3.1% EPS growth</h2> <ul> <li>The inputs highlight a high level of debt on the balance sheet alongside forecast earnings growth of about 3.1% per year and revenue growth of 4.2% per year, both cited as slower than the broader US market even though trailing net income over the last year is US$1.5b.</li> <li>Bears focus on that leverage and on regulatory items such as expected US$360m to US$400m annual cuts to Medicaid supplemental payments by 2032, arguing that slower forecast growth plus higher interest and capital needs make it harder to sustain the 8.6% margin, even though recent results show improved profitability and 30.4% trailing earnings growth that so far have run ahead of those cautious assumptions.\n    <ul> <li>Critics highlight that if net benefit from Medicaid programs falls while revenue growth tracks closer to the 4.2% forecast, the combination of debt servicing and lower reimbursement could pressure earnings even if current EPS of US$23.42 on a trailing basis remains solid today.</li> <li>What challenges the bearish stance somewhat is that, despite these risks being flagged, analysts in the supplied data still reference earnings that have grown 7.3% per year over five years and a current margin above last year, which suggests the operational picture has been resilient so far even as future policy changes are being debated.</li> </ul> </li> </ul> <p>Skeptics warn that high leverage and policy changes could matter more than recent EPS strength, especially if future growth sits near 3.1% while debt stays elevated. <a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/rdizidzn-lower-medicaid-payments-and-rising-costs-will-erode-margins\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 Universal Health Services Bear Case</strong></a></p> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/rdizidzn-lower-medicaid-payments-and-rising-costs-will-erode-margins\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Universal Health Services on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>With the bullish and bearish angles laid out, how do they stack up for you right now, and what feels most important for your own portfolio decisions? Our analysis flags both risks and rewards that investors are watching closely, so it is worth checking the full breakdown before you settle on a view, starting with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 1 important warning sign</a>.</p> <h2>Explore Alternatives</h2> <p>UHS carries high debt and faces potential Medicaid payment cuts, while forecast earnings and revenue growth in the supplied data sit at modest single digit rates.</p> <p>If that mix of leverage and policy risk feels heavy for your portfolio, take a look at our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> to find companies with steadier profiles.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 12:00:59",
            "link": "https://simplywall.st/stocks/us/healthcare/nyse-uhs/universal-health-services/news/universal-health-services-q4-eps-strength-reinforces-bullish",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing BrightView Holdings (BV) Valuation After Expanded Golf Management Role At The Villages",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>BrightView Holdings (BV) shares are in focus after its BrightView Landscapes unit expanded its golf management role at The Villages in Florida, where it now oversees more than half of the community’s 400 golf holes.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for BrightView Holdings.</a></p> <p>The latest contract win comes as BrightView’s 30 day share price return of 5.39% and 90 day share price return of 10.06% point to building momentum. At the same time, the 3 year total shareholder return of about 12x contrasts with a 5 year total shareholder return decline of 12.86%.</p> <p>If this golf expansion has you thinking about longer term themes in infrastructure and services, it could be worth scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_power_grid\" href=\"https://simplywall.st/discover/investing-ideas/473750/power-grid-technology-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">23 power grid technology and infrastructure stocks</a> as another way to look for potential opportunities.</p> <p>With BrightView shares up over the past 3 months and trading at a reported discount to some analyst and intrinsic value estimates, the key question is whether there is still an opportunity here or if the market is already pricing in future growth.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 15% Undervalued</h2> <p>BrightView Holdings' most followed narrative sets a fair value of about $16.34 per share, compared with the last close at $13.89. This frames the current debate around upside versus execution risk.</p> <blockquote> <p><em>The \"One BrightView\" strategy is driving substantial cost savings and operating leverage through procurement centralization, technology investments, and large-scale fleet upgrades, which is directly impacting operating margins and net earnings, with further margin expansion expected as these initiatives scale.</em></p> </blockquote> <p><em>Read the complete narrative.</em> <a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/oxqxa3ns-expansion-into-10-branches-will-secure-urban-green-demand-d4qd\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Curious what kind of revenue growth, margin lift, and future earnings multiple need to come together to support that fair value? The projections behind this story lean heavily on improving profitability, rising recurring revenue and a lower valuation multiple than many investors might assume. The full narrative lays out how those moving parts fit together and what would need to go right for the numbers to line up.</p> <p><strong>Result: Fair Value of $16.34 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/oxqxa3ns-expansion-into-10-branches-will-secure-urban-green-demand-d4qd\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this story could look very different if macro headwinds keep delaying client projects, or if cost savings and project to maintenance conversions fall short of expectations.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this BrightView Holdings narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of potential upside and clear risks leaves you on the fence, take time while the data is fresh to shape your own view with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 4 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If BrightView has you thinking more broadly about where to put your money to work next, do not stop here; widen your search before the market moves on.</p> <ul> <li>Target quality first by checking companies that combine strong fundamentals with sturdy finances through our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (41 results)</a>.</li> <li>Hunt for potential value by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a> that filters for companies with solid business profiles trading below their assessed worth.</li> <li>Prioritise resilience by reviewing our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> that highlights businesses with lower risk scores for steadier portfolio anchors.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if BrightView Holdings might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/commercial-services/nyse-bv/brightview-holdings/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 12:00:59",
            "link": "https://simplywall.st/stocks/us/commercial-services/nyse-bv/brightview-holdings/news/assessing-brightview-holdings-bv-valuation-after-expanded-go",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Reassessing Novo Nordisk (CPSE:NOVO B) After Sharp Share Price Declines",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are looking at Novo Nordisk and wondering whether the current share price still lines up with the company’s long term story, you are not alone.</li> <li>The stock last closed at DKK 238.6, with returns of 22.4% decline over 7 days, 39.4% decline over 30 days, 27.8% decline year to date, 61.8% decline over 1 year and 50.0% decline over 3 years, while the 5 year return stands at 19.6%.</li> <li>These swings have arrived alongside ongoing attention on Novo Nordisk’s role in diabetes and weight management treatments, as well as regulatory and competitive headlines that keep the company in the spotlight. Together, these factors help explain why the share price has been so reactive, as investors reassess expectations and risk.</li> <li>Against that backdrop, Novo Nordisk currently scores 5 out of 6 on our valuation checks, as shown by our <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation score</a>. Next, we will look at how different valuation methods line up on the stock and finish with an approach that can give you an even clearer view of what the market is pricing in.</li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_industry_underperformer\" href=\"https://www.simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/future\" rel=\"noopener noreferrer\" target=\"_blank\">Find out why Novo Nordisk's -61.8% return over the last year is lagging behind its peers.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Novo Nordisk Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model estimates what a business could be worth today by projecting its future cash flows and discounting them back to the present.</p> <p>For Novo Nordisk, the model uses a 2 stage Free Cash Flow to Equity approach. The latest twelve month free cash flow is DKK 52,097.16m. Analyst and extrapolated projections suggest free cash flow reaching DKK 145,840.33m in 2030, with a path that includes DKK 41,926.80m in 2026 and DKK 207,436.58m in 2035. Simply Wall St uses analyst estimates where available, then extends them using its own growth assumptions for the later years.</p> <p>Discounting these projected cash flows back to today gives an estimated intrinsic value of DKK 1,072.30 per share. Compared with the recent share price of DKK 238.60, the DCF output suggests the market price is at a 77.7% discount to this estimate, which indicates that the stock appears materially undervalued on this model alone.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Novo Nordisk is undervalued by 77.7%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">231 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NOVO B Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/71be77aa-1311-4447-b4b8-bcb7f8815b88/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>NOVO B Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Novo Nordisk.</a></p> <h3>Approach 2: Novo Nordisk Price vs Earnings</h3> <p>For a profitable company like Novo Nordisk, the P/E ratio is a useful snapshot of how much investors are paying for each unit of earnings. It reflects what the market is willing to pay today for the company’s current profit stream.</p> <p>In simple terms, higher growth expectations and lower perceived risk tend to support a higher P/E, while slower expected growth or higher risk usually line up with a lower, more conservative P/E. Novo Nordisk currently trades on a P/E of 10.35x, compared with the Pharmaceuticals industry average of 22.54x and a peer average of 26.08x. That raw comparison alone might suggest the stock is priced more cautiously than many of its peers.</p> <p>Simply Wall St’s Fair Ratio for Novo Nordisk is 25.04x. This is a proprietary P/E level that reflects factors such as the company’s earnings growth profile, profit margins, risk characteristics, industry, and market cap. Because it builds in these company specific drivers, it can be more informative than a simple peer or industry comparison. With the current P/E of 10.35x sitting well below the Fair Ratio of 25.04x, the multiple based view points to the shares looking undervalued on earnings.</p> <p><strong>Result: UNDERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"CPSE:NOVO B P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/71be77aa-1311-4447-b4b8-bcb7f8815b88/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>CPSE:NOVO B P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/global\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 98 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Novo Nordisk Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple way for you to attach a clear story about a company to the numbers you are seeing, including your view on fair value and your own assumptions for future revenue, earnings and margins.</p> <p>A Narrative connects three pieces you already think about: what you believe is happening in the business, how that might flow through to a financial forecast, and what that implies for a fair value you can compare with today’s share price.</p> <p>On Simply Wall St, Narratives are available on the Community page and are used by millions of investors, so you can quickly see different views on Novo Nordisk and how other investors translate their thesis into numbers without needing to build a full model yourself.</p> <p>Because each Narrative pairs a user’s fair value with the current market price, it gives you a practical way to decide whether the gap between value and price is wide enough for you to consider buying, waiting, or taking some money off the table, all within a consistent framework.</p> <p>Narratives stay current because they refresh when new information such as earnings releases, regulatory updates or major news is incorporated, so the story, forecast and fair value do not sit frozen in time.</p> <p>For Novo Nordisk right now, one investor Narrative on Simply Wall St estimates fair value at DKK 287.0 while another sits at DKK 1,036.18, which shows how two people looking at the same company can reach very different conclusions once they plug in their own expectations.</p> <p>Do you think there's more to the story for Novo Nordisk? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/CPSE/NOVO%20B\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"CPSE:NOVO B 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/71be77aa-1311-4447-b4b8-bcb7f8815b88/chart/quote-price?date=2026-02-26\" width=\"746\"/></a><figcaption>CPSE:NOVO B 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Novo Nordisk might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 12:00:58",
            "link": "https://simplywall.st/stocks/dk/pharmaceuticals-biotech/cph-novo-b/novo-nordisk-shares/news/reassessing-novo-nordisk-cpsenovo-b-after-sharp-share-price",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is Houlihan Lokey (HLI) Fairly Priced After Recent Share Price Softness And Strong Multi‑Year Gains",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Houlihan Lokey’s current share price reflects its true worth, you are not alone. This article is designed to help you size up what you are really paying for.</li> <li>The stock last closed at US$169.10, with returns of 1.8% over the past week, a 5.9% decline over the past month, a 4.1% decline year to date, a 0.5% gain over the past year, 86.6% over three years and 182.7% over five years, which may leave you questioning whether the recent path justifies today’s price tag.</li> <li>Recent company updates and sector news have kept Houlihan Lokey on investor watchlists, as corporate activity and advisory demand often steer sentiment around investment banks and financial advisors. These headlines give important context to the recent mix of short term softness and longer term strength in the share price.</li> <li>Right now Houlihan Lokey scores 2 out of 6 on our valuation checks, which you can see in detail in our <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation score</a>. We will walk through the usual valuation approaches next and also point you to a more complete way of thinking about value at the end of the article.</li> </ul> <p>Houlihan Lokey scores just 2/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Houlihan Lokey Excess Returns Analysis</h3> <p>The Excess Returns model looks at how much value a company creates above the return that shareholders are estimated to require. It starts from the equity on the balance sheet, then compares the company’s expected return on that equity to its estimated cost of equity.</p> <p>For Houlihan Lokey, the model uses a Book Value of US$32.92 per share and a Stable EPS of US$9.25 per share, based on weighted future Return on Equity estimates from 4 analysts. The Average Return on Equity used is 25.05%, while the Cost of Equity is US$2.91 per share, implying an Excess Return of US$6.34 per share. The model also factors in a Stable Book Value of US$36.95 per share, sourced from weighted future Book Value estimates from 4 analysts.</p> <p>Combining these inputs, the Excess Returns model arrives at an estimated intrinsic value of about US$178.83 per share. Compared with the recent share price of about US$169.10, this suggests the stock is around 5.4% undervalued. This sits within a reasonable margin of error rather than providing a clear bargain signal.</p> <p><strong>Result: ABOUT RIGHT</strong></p> <p>Houlihan Lokey is fairly valued according to our <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Excess Returns</a>, but this can change at a moment's notice. Track the value in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://www.simplywall.st/watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_fairly_valued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted on when to act.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"HLI Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c70f2d67-69b8-455b-920e-4c3e95539baa/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>HLI Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Houlihan Lokey.</a></p> <h3>Approach 2: Houlihan Lokey Price vs Earnings</h3> <p>For profitable companies like Houlihan Lokey, the P/E ratio is a useful shorthand for how much you are paying for each dollar of earnings. It helps you compare what the market is currently willing to pay for the company’s earnings relative to other options.</p> <p>What counts as a reasonable P/E usually reflects two things: how quickly earnings are expected to grow, and how risky those earnings are perceived to be. Higher expected growth and lower perceived risk can justify a higher P/E, while slower growth or higher risk typically support a lower multiple.</p> <p>Houlihan Lokey currently trades on a P/E of 26.35x. That sits above both the Capital Markets industry average of 23.01x and the peer group average of 15.39x. Simply Wall St’s Fair Ratio for Houlihan Lokey is 16.22x, which is its proprietary view of what a balanced P/E could look like after factoring in earnings growth, industry, profit margins, market cap and company specific risks.</p> <p>This Fair Ratio can be more informative than a simple peer or industry comparison because it adjusts for the company’s own characteristics rather than assuming one size fits all. With the current 26.35x P/E sitting above the 16.22x Fair Ratio, the shares look expensive on this metric.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:HLI P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c70f2d67-69b8-455b-920e-4c3e95539baa/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:HLI P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 20 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Houlihan Lokey Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, which are simply your story about a company expressed through your own assumptions for fair value, future revenue, earnings and margins, linked to a forecast and then to a fair value that you can compare with today’s price. On Simply Wall St, within the Community page used by millions of investors, Narratives give you an easy way to set out that story in numbers, see how your view differs from others, and quickly spot when your Fair Value is above or below the current price. This can help you decide whether the stock fits your watchlist or portfolio. Narratives also refresh as new information such as news, earnings or updated analyst estimates are added, so your view does not stay frozen. For Houlihan Lokey, for example, one investor might align with the higher fair value view around US$242.55 per share while another might lean closer to the lower fair value of US$173 per share, and Narratives make those different perspectives clear and comparable in one place.</p> <p>Do you think there's more to the story for Houlihan Lokey? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/HLI\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/diversified-financials/nyse-hli/houlihan-lokey\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:HLI 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c70f2d67-69b8-455b-920e-4c3e95539baa/chart/quote-price?date=2026-02-26\" width=\"746\"/></a><figcaption>NYSE:HLI 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Houlihan Lokey might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 12:00:58",
            "link": "https://simplywall.st/stocks/us/diversified-financials/nyse-hli/houlihan-lokey/news/is-houlihan-lokey-hli-fairly-priced-after-recent-share-price",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Evaluating Pan American Silver’s Valuation After Record 2025 Results And A Higher Dividend",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Record 2025 results and higher dividend draw investor focus</h2> <p>Pan American Silver (TSX:PAAS) has come into focus after reporting record fourth quarter and full year 2025 results, alongside a higher dividend and a 2026 outlook calling for further silver production growth.</p> <p>For the fourth quarter, the company reported sales of US$1,179 million, compared with US$815 million a year earlier, and net income of US$452 million, compared with US$108 million. Basic and diluted earnings per share from continuing operations were US$1.07, compared with US$0.30 a year ago.</p> <p>Across 2025, sales were US$3.62b compared with US$2.82b a year earlier, while net income was US$978 million compared with US$112 million. Full year basic and diluted earnings per share from continuing operations were US$2.56, compared with US$0.31 in the prior year.</p> <p>Alongside the earnings release on February 18, 2026, Pan American Silver declared a cash dividend of US$0.18 per common share for the fourth quarter of 2025, payable on or about March 13, 2026, to shareholders of record as of March 2, 2026. The company described the dividend as an eligible dividend for Canadian income tax purposes and noted that any future dividends will remain at the discretion of its board.</p> <p>The company also updated the market on its share repurchase activity. From October 1, 2025 to December 31, 2025, Pan American Silver bought back 282,700 shares for US$15 million, representing 0.07% of its shares. This completed a program initiated on March 3, 2025, under which the company repurchased a total of 1,650,770 shares for US$46.1 million, representing 0.44% of its outstanding shares.</p> <p>Management has guided to a further 14% increase in silver production in 2026, supported by contributions from the Juanicipio mine and higher grades at Cerro Moro, and plans to release an updated technical report for the La Colorada Skarn project in the second quarter of 2026. These elements sit alongside record 2025 free cash flow and a series of recent dividend increases and form the backdrop for how investors may weigh Pan American Silver’s current valuation and risk profile.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Pan American Silver.</a></p> <p>Investors appear to be responding to the record 2025 results and higher dividend. The share price is at CA$92.37 with a 90 day share price return of 45.83%, while the 1 year total shareholder return of 171.88% and 3 year total shareholder return of roughly 4.7x point to strong longer term momentum.</p> <p>If this earnings driven move has you rethinking precious metals exposure, it could be worth scanning beyond a single name and checking out our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_silver\" href=\"https://simplywall.st/discover/investing-ideas/473743/top-silver-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">7 top silver producer stocks</a> as potential next ideas.</p> <p>With the shares up 46% in 90 days and trading slightly above the average analyst price target, yet still showing a large intrinsic value gap, is there still a buying opportunity here, or is the market already pricing in future growth?</p> <h2>Price-to-Earnings of 29.1x: Is it justified?</h2> <p>On earnings, the market is putting a 29.1x P/E on Pan American Silver at CA$92.37. This sits above both peers and the company’s own estimated fair ratio.</p> <p>The P/E multiple simply tells you how much investors are currently paying for each dollar of earnings. It is a common yardstick for metals and mining companies where profitability matters as much as production volumes.</p> <p>For Pan American Silver, that 29.1x P/E compares with a peer average of 26.4x and an estimated fair P/E of 26.4x. This indicates the market is applying a richer tag than both the sector and the level our fair ratio suggests the price could lean toward over time.</p> <p>Stacked against the broader Canadian Metals and Mining industry, where the average P/E is 22.5x, Pan American Silver’s 29.1x stands out as clearly higher. This signals that investors are currently pricing in stronger earnings prospects or a higher quality profile than the typical name in the group.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"fair_ratio_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Explore the SWS fair ratio for Pan American Silver</a></p> <p><strong>Result: Price-to-Earnings of 29.1x (OVERVALUED)</strong></p> <p>However, you are paying that richer P/E in a sector exposed to metal price swings, as well as Pan American Silver’s multi country operating and regulatory risks.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Pan American Silver narrative.</a></p> <h2>Another view on value: SWS DCF points the other way</h2> <p>The P/E of 29.1x suggests Pan American Silver looks expensive, but our DCF model tells a different story. At CA$92.37, the shares trade about 57.6% below our estimate of fair value at CA$217.63. This frames the current price as a sizeable discount instead of a premium. So which signal do you trust more: earnings multiples or future cash flows?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/ca/materials/tsx-paas/pan-american-silver-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"PAAS Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/32d0f89b-a81d-42bd-9deb-9557bcda8c33/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>PAAS Discounted Cash Flow as at Feb 2026</figcaption></figure><p> </p><p>Simply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (<a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">check out Pan American Silver for example</a>). We show the entire calculation in full. You can track the result in your <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted when this changes, or use our stock screener to discover <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">9 high quality undervalued stocks</a>. If you <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">save a screener</a> we even alert you when new companies match - so you never miss a potential opportunity.</p> <h2>Next Steps</h2> <p>Mixed signals or clear opportunity, either way it helps to move fast and pressure test the story for yourself by weighing up <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If this has sharpened your focus on opportunities, do not stop here. The right mix of stocks can matter more than any single position.</p> <ul> <li>Spot potential value plays early and check out our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">9 high quality undervalued stocks</a> that currently stand out on both quality and pricing.</li> <li>Strengthen your income stream by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/ca\" rel=\"noopener noreferrer\" target=\"_blank\">5 dividend fortresses</a>, so you are not missing companies offering higher yields with robust payout records.</li> <li>Prioritize resilience and peace of mind by scanning <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/ca\" rel=\"noopener noreferrer\" target=\"_blank\">7 resilient stocks with low risk scores</a>, where the focus is on companies with lower risk scores and steadier profiles.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 12:00:58",
            "link": "https://simplywall.st/stocks/ca/materials/tsx-paas/pan-american-silver-shares/news/evaluating-pan-american-silvers-valuation-after-record-2025",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SoundHound AI (SOUN) Valuation Check After Sales Assist Launch And Bengaluru Expansion",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>SoundHound AI (SOUN) is back in focus after unveiling its Sales Assist voice agent at Mobile World Congress 2026 and opening a new Bengaluru innovation hub, moves that sharpen attention on the stock.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-soun/soundhound-ai\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for SoundHound AI.</a></p> <p>The recent Sales Assist launch and Bengaluru hub opening come as the stock shows mixed momentum, with a 14.7% 7 day share price return but a 9.7% 30 day share price decline. At the same time, the 3 year total shareholder return of roughly 2.5x highlights how sentiment has swung over a longer horizon.</p> <p>If this kind of AI story has your attention, it could be worth scanning our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_ai_stocks\" href=\"https://simplywall.st/discover/investing-ideas/472948/ai-small-caps/us\" rel=\"noopener noreferrer\" target=\"_blank\">30 AI small caps</a> to see which other names are catching interest in this space.</p> <p>So with SoundHound AI trading at US$8.98 and sitting at a steep discount to the average analyst price target of US$16.31, is the recent pullback giving you an opening, or is the market already pricing in future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 68.6% Undervalued</h2> <p>StjepanK’s widely followed narrative pegs SoundHound AI’s fair value at $28.58 per share, well above the last close at $8.98, which puts a spotlight on how bold the assumptions are behind that gap.</p> <blockquote> <p><em>SoundHound started as a Stanford dorm-based project between a few aspiring academics in 2004. At that time, hardly anyone thought about voice AI. However, over more than two decades, the team accumulated diverse experience with this technology, building a moat of over 280 patents that set it apart from competitors. These patents cover a wide range, including speech recognition, natural language understanding, and voice search.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/srfzrzzw-soundhounds-moat-and-diversified-revenue-strategy-make-it-a-voice-ai-leader\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Want to see what kind of revenue ramp, margin shift, and valuation multiple are baked into that fair value? The core assumptions lean on aggressive growth, richer profitability, and a generous earnings-type multiple that together support a much higher implied price.</p> <p><strong>Result: Fair Value of $28.58 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_user_generated_narrative\" href=\"https://www.simplywall.st/narratives/srfzrzzw-soundhounds-moat-and-diversified-revenue-strategy-make-it-a-voice-ai-leader\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, stock dilution and ongoing cash burn, along with margin pressure, could still undermine this upbeat fair value story if they persist or worsen.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-soun/soundhound-ai\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this SoundHound AI narrative.</a></p> <h2>Another View: Market Pricing Looks Much Richer</h2> <p>That $28.58 fair value from the narrative sits awkwardly next to how the market is currently valuing SoundHound AI on sales. The stock trades at a P/S of 25.4x, while the US Software industry sits around 3.5x, peers average 20.3x, and the fair ratio points closer to 5.3x.</p> <p>In plain terms, the current price already bakes in a lot of future revenue and execution. This raises the risk that any slip in growth, margins, or funding could hit the share price harder than the bullish story suggests. Which version of “fair” do you think fits your risk tolerance right now?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-soun/soundhound-ai/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/software/nasdaq-soun/soundhound-ai/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGM:SOUN P/S Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c9109c83-4a17-4323-82e7-698789e17ede/chart/ps-multiple-vs-industry?date=2026-02-27\" width=\"746\"/></a><figcaption>NasdaqGM:SOUN P/S Ratio as at Feb 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>Does this mix of optimism and concern match how you see SoundHound AI, or does it feel off? Take a closer look at the full picture so you can act quickly and shape your own view, including <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-soun/soundhound-ai\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward and 2 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If SoundHound AI has sharpened your thinking, do not stop here. Broaden your watchlist with targeted stock ideas backed by clear data and consistent screening.</p> <ul> <li>Target potential bargains by scanning our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a> that combine attractive pricing with solid fundamental traits.</li> <li>Prioritize staying power by reviewing companies in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (41 results)</a> that focus on financial strength and resilience.</li> <li>Hunt for lesser known opportunities by checking the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> that many investors may not be watching yet.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 11:55:55",
            "link": "https://simplywall.st/stocks/us/software/nasdaq-soun/soundhound-ai/news/soundhound-ai-soun-valuation-check-after-sales-assist-launch",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hormel Foods (HRL) Margin Compression Tests Bullish Earnings Growth Narrative In Q1 2026",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Hormel Foods (HRL) opened fiscal Q1 2026 with revenue of about US$3.0 billion and basic EPS of US$0.33, setting a clear snapshot of where the business stands as earnings season gets underway. The company has seen quarterly revenue move in a tight band around US$3.0 billion over the past year, while basic EPS has ranged from a loss of roughly US$0.10 in Q4 2025 to US$0.40 in Q4 2024. This gives investors a mixed but data rich backdrop for judging this quarter. With trailing net profit margin at 4% versus 6.4% a year earlier and earnings forecast to grow faster than revenue, the key question now is how durable Hormel’s margin profile really looks.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nyse-hrl/hormel-foods\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Hormel Foods.</a> <p>With the latest numbers on the table, the next step is to line them up against the widely held narratives around Hormel’s growth, income appeal, and margin pressure to see which stories hold up and which need a rethink.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/35m678x1-recent-upgrades-and-industry-shifts-will-support-longer-term-recovery\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Hormel Foods</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nyse-hrl/hormel-foods/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:HRL Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/eb61d372-2097-4eb9-8703-c66afaf0e221/chart/revenue-and-expenses-breakdown?date=2026-02-27\" width=\"746\"/></a><figcaption>NYSE:HRL Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Net Income Swings and Margin Pressure</h2> <ul> <li>Over the last six quarters, net income has moved from a loss of US$56.1 million in Q4 2025 to US$181.8 million in Q1 2026, while trailing 12 month profit stands at US$489.4 million on US$12.1b of revenue, aligning with the 4% net margin figure.</li> <li> Bears focus on profitability pressure, and the numbers give them some support alongside some pushback.\n    <ul> <li>Trailing net margin at 4% versus 6.4% a year earlier lines up with concerns about margin compression from volatile input costs like pork, beef, and nuts.</li> <li>At the same time, recent quarterly net income in the US$170 million to US$184 million range across most of the last five quarters, apart from Q4 2025, suggests earnings have remained relatively steady even as longer term margins have tightened.</li> </ul> </li> </ul> Over the last year Hormel’s margin strain has been a key talking point for skeptics, so this mix of steady recent profits and lower trailing margins makes the bear case more nuanced than a simple profitability decline story. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Hormel Foods Bear Case</strong></a> <h2>EPS Stability vs Forecast Growth Story</h2> <ul> <li>Basic EPS has hovered around US$0.31 to US$0.33 in four of the last five quarters, with a Q4 2025 loss and a Q4 2024 EPS of US$0.40 as the outliers, while earnings are forecast to grow about 11.18% per year compared with roughly 2% revenue growth.</li> <li> The consensus narrative that earnings growth can run ahead of sales growth is tested by this steady but unspectacular EPS pattern.\n    <ul> <li>Trailing 12 month EPS of US$0.89 compares with quarterly EPS near US$0.33 in Q1 2026 and Q3 2025, which is below the US$0.40 level seen in Q4 2024 and below earlier trailing EPS figures like US$1.47 a year ago.</li> <li>Forecasts calling for earnings to grow faster than revenue suggest better margins over time, yet today’s trailing 4% net margin and flat recent EPS band show that the margin uplift implied by those forecasts is not visible in the recent history supplied.</li> </ul> </li> </ul> <h2>Rich P/E, Dividend Strain and DCF Upside</h2> <ul> <li>Hormel trades on a trailing P/E of 27.9x versus 24.2x for the broader US Food industry and 13.2x for peers, while offering a 4.71% dividend yield that is not well covered by earnings or free cash flow, and a DCF fair value of US$48.41 compared with a current share price of US$24.82.</li> <li> Bulls point to long term earnings growth and valuation upside, and the figures both support and complicate that view.\n    <ul> <li>The stock price of US$24.82 sitting well below the DCF fair value of US$48.41 fits the optimistic claim of meaningful upside if earnings forecasts are met.</li> <li>However, the combination of a premium 27.9x P/E, a 4% trailing net margin, and a dividend that is not well covered means the bullish argument depends heavily on the expected margin improvement and cash generation that are not yet reflected in the trailing data.</li> </ul> </li> </ul> If you are weighing that richer P/E and stretched dividend against the potential DCF upside, it is worth seeing how bullish investors connect these earnings trends to their long term case for Hormel. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Hormel Foods Bull Case</strong></a> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/35m678x1-recent-upgrades-and-industry-shifts-will-support-longer-term-recovery\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Hormel Foods on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>Mixed on the story so far or leaning one way already? Take a moment to review the numbers yourself and decide where you stand, then check out <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nyse-hrl/hormel-foods\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 2 important warning signs</a> to see how those potential upsides and concerns line up in one place.</p> <h2>See What Else Is Out There</h2> <p>Hormel’s rich 27.9x P/E, flat recent EPS band, thinner 4% net margin, and uncovered 4.71% dividend all point to strained earnings power and income quality.</p> <p>If those pressure points make you question sticking with this setup, take a focused look at <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> to find income ideas with healthier coverage and potentially more dependable payouts.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Hormel Foods might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/food-beverage-tobacco/nyse-hrl/hormel-foods/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 11:55:55",
            "link": "https://simplywall.st/stocks/us/food-beverage-tobacco/nyse-hrl/hormel-foods/news/hormel-foods-hrl-margin-compression-tests-bullish-earnings-g",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is Astec Industries (ASTE) Attractive After Strong 1 Year Rally And DCF Upside?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Astec Industries' current share price lines up with its underlying worth, this is a good place to break that question down calmly and clearly.</li> <li>The stock closed at US$62.34, with returns of 8.5% over 7 days, 28.8% over 30 days, 39.7% year to date, 76.1% over 1 year and 32.7% over 3 years, while the 5 year return sits at a 4.9% decline.</li> <li>Recent news around Astec Industries has focused on its position in capital goods and how the company is being evaluated against peers in the sector. That context helps frame whether these returns are being driven more by changing expectations for the business or by broader sentiment toward the industry.</li> <li>On our simple 6 point value checklist, Astec Industries scores <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nasdaq-aste/astec-industries/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">3 out of 6</a>. We will unpack this score using earnings based, cash flow based and asset based valuation methods, before finishing with a different way to think about fair value that many investors overlook.</li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_industry_performance_contextual\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nasdaq-aste/astec-industries/past\" rel=\"noopener noreferrer\" target=\"_blank\">Astec Industries delivered 76.1% returns over the last year. See how this stacks up to the rest of the Machinery industry.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Approach 1: Astec Industries Discounted Cash Flow (DCF) Analysis</h2> <p>A Discounted Cash Flow, or DCF, model estimates what a company might be worth by projecting its future cash flows and discounting them back to today in dollar terms. It is essentially asking what those future dollars are worth right now.</p> <p>For Astec Industries, the model used is a 2 Stage Free Cash Flow to Equity approach. The company’s last twelve months of Free Cash Flow is reported at about $28.24 million. Analysts provide explicit forecasts out to 2027, with Free Cash Flow projected at $82.10 million in that year, and Simply Wall St extends those forecasts further using its own assumptions, out to 2035, keeping everything in dollars and in millions.</p> <p>When all those projected cash flows are discounted back to today under this model, the estimated intrinsic value comes out at about $86.31 per share. Compared with the recent share price of $62.34, the DCF suggests Astec Industries trades at roughly a 27.8% discount, which screens as undervalued on this measure.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Astec Industries is undervalued by 27.8%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/capital-goods/nasdaq-aste/astec-industries/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ASTE Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/17a0383e-2905-49ef-8f00-5be25d110ada/chart/dcf?date=2026-02-27\" width=\"746\"/></a><figcaption>ASTE Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nasdaq-aste/astec-industries/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Astec Industries.</a></p> <h2>Approach 2: Astec Industries Price vs Earnings</h2> <p>For profitable companies like Astec Industries, the P/E ratio is a useful way to link what you pay for the stock to the earnings the business is currently generating. It is a quick way to see how many dollars investors are paying for each dollar of earnings.</p> <p>What counts as a “normal” P/E depends on how the market views a company’s growth prospects and risks. Higher expected growth or lower perceived risk can justify a higher multiple, while slower growth or higher uncertainty can point to a lower one.</p> <p>Astec Industries currently trades on a P/E of 36.75x. That sits above the Machinery industry average of about 28.70x and below the peer group average of roughly 41.03x. Simply Wall St’s Fair Ratio for Astec Industries is 30.79x, which is its view of what a reasonable P/E would be after factoring in elements such as earnings growth, profit margins, industry, market cap and company specific risks.</p> <p>This Fair Ratio can be more informative than a simple comparison with peers or the industry, because it adjusts for those business specific characteristics rather than assuming all companies deserve the same multiple. With the actual P/E of 36.75x sitting above the Fair Ratio of 30.79x, Astec Industries appears overvalued on this metric.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/capital-goods/nasdaq-aste/astec-industries/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:ASTE P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/17a0383e-2905-49ef-8f00-5be25d110ada/chart/pe-multiple-vs-industry?date=2026-02-27\" width=\"746\"/></a><figcaption>NasdaqGS:ASTE P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Astec Industries Narrative</h3> <p>Earlier we mentioned that there is an even better way to think about valuation, and on Simply Wall St this is done through Narratives. You set out your story for Astec Industries, link that story to a forecast for revenue, earnings and margins, and end up with your own Fair Value that you can compare with today’s price on the Community page. This page is used by millions of investors, so your view updates automatically when new news or earnings arrive. You can see, for example, one investor building a Narrative that supports a Fair Value of about US$86 per share, while another, more cautious view aligns with a Fair Value closer to US$56.50. Each uses the same company but very different expectations to decide whether the current price looks attractive or not.</p> <p>Do you think there's more to the story for Astec Industries? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NasdaqGS/ASTE\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/capital-goods/nasdaq-aste/astec-industries\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:ASTE 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/17a0383e-2905-49ef-8f00-5be25d110ada/chart/quote-price?date=2026-02-27\" width=\"746\"/></a><figcaption>NasdaqGS:ASTE 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 11:55:55",
            "link": "https://simplywall.st/stocks/us/capital-goods/nasdaq-aste/astec-industries/news/is-astec-industries-aste-attractive-after-strong-1-year-rall",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Titan International (TWI) Q4 Loss Of US$56 Million Tests Profitability Turnaround Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Titan International (TWI) has wrapped up FY 2025 with fourth quarter revenue of US$410.4 million and a basic EPS loss of US$0.88, alongside a full year trailing revenue base of about US$1.8 billion and a net loss of US$63.5 million. The company has seen quarterly revenue range from US$383.6 million in Q4 2024 to US$490.7 million in Q1 2025, while basic EPS has swung from a small profit of US$0.02 in Q4 2024 to progressively larger quarterly losses through 2025. This sets the stage for a results season in which investors will focus squarely on how margins are holding up against this revenue line.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-twi/titan-international\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Titan International.</a> <p>With the headline numbers in place, the next step is to see how this earnings print lines up with the prevailing narratives about Titan International’s growth prospects, risk profile, and eventual path back to profitability.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/iee57cl7-global-urbanization-and-smart-farming-will-drive-secular-demand-ho0e\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Titan International</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-twi/titan-international/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:TWI Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/41064cd2-6786-4957-9ed0-b22494a67041/chart/revenue-and-expenses-breakdown?date=2026-02-27\" width=\"746\"/></a><figcaption>NYSE:TWI Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>TTM loss of US$63.5 million despite US$1.8b revenue base</h2> <ul> <li>On a trailing twelve month basis to Q4 2025, Titan International generated about US$1.8b of revenue while recording a net loss of US$63.5 million and basic EPS of US$0.99 in losses, showing that the current scale of sales has not yet translated into profitability.</li> <li>Bulls point out that analyst models in the data set call for earnings growth of about 151.5% per year and a move to profitability within three years. That view sits against a five year history where losses widened at roughly 13.2% per year and the latest TTM period still shows US$63.5 million in losses, so the optimistic case leans heavily on a future margin shift that is not visible in these reported numbers.</li> </ul> <h2>Quarterly losses widened sharply in Q4 2025</h2> <ul> <li>Q4 2025 net income excluding extra items was a loss of US$56.0 million on revenue of US$410.4 million, compared with smaller quarterly losses earlier in 2025 that ranged from about US$0.6 million to US$4.5 million on revenues between US$460.8 million and US$490.7 million.</li> <li>Bears argue that dependence on cyclical equipment demand and large OEM customers could keep earnings under pressure. The pattern in 2025, where quarterly losses moved from roughly US$0.6 million in Q1 to US$56.0 million by Q4 while revenue stayed within a US$410 million to US$491 million band, gives their argument support that profitability has been fragile even without a collapse in the top line.\n    <ul> <li>The data also shows that over the last five years, losses widened at about 13.2% per year, which fits with the cautious view that earnings volatility and operating leverage have worked against shareholders recently.</li> <li>With the share price at US$9.90 and the business still loss making over the last twelve months, skeptics may question how quickly any forecast profit recovery can show through in reported EPS.</li> </ul> </li> </ul> <p>Bears warn that the latest step up in quarterly losses could signal that tighter OEM spending or cost pressure bites harder than optimistic scenarios assume, especially if order patterns stay uneven.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/lubktl12-trade-and-oem-risks-will-delay-recovery-yet-spark-optimism-1mqc\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 Titan International Bear Case</strong></a> <h2>Mixed valuation signals at US$9.90 share price</h2> <ul> <li>The data shows a P/S of 0.3x compared with a peer average of 1.7x and a US Machinery industry average of 2.3x. A DCF fair value of US$7.71 per share sits below the current US$9.90 price.</li> <li>Supporters of the bullish view point to the low 0.3x P/S multiple and the earnings growth forecasts as backing their case for upside, but the DCF fair value of US$7.71 being below the current share price and the company’s current TTM loss of US$63.5 million mean the market is already pricing in some improvement. That leaves less room for error if revenue growth of 3.7% per year and recent loss trends persist instead of quickly swinging toward the earnings levels implied by an 11.25 analyst target.\n    <ul> <li>Consensus expectations in the data look for revenue growth of 5.5% per year and margins moving from about 1.2% loss making today to a 2.5% profit margin by 2028, so the gap between those future assumptions and today’s US$63.5 million loss is what investors are effectively paying for at US$9.90.</li> <li>If earnings track closer to the more cautious path, where margins are still only 6.0% by 2028 and earnings are US$124.5 million, the current discount to an 11.25 target is smaller than it appears once the DCF fair value of US$7.71 is factored into the range of views.</li> </ul> </li> </ul> <p>If you want to see how optimistic investors connect these valuation signals to their thesis on margins and growth, have a look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/iee57cl7-global-urbanization-and-smart-farming-will-drive-secular-demand-ho0e\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 Titan International Bull Case</strong></a></p> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/iee57cl7-global-urbanization-and-smart-farming-will-drive-secular-demand-ho0e\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Titan International on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>With the mix of bullish hopes and cautious signals in the numbers, it is worth taking a closer look at the data yourself and moving quickly to shape your own view. To see what has investors optimistic, review the <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-twi/titan-international\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards</a> and weigh it against the rest of the picture.</p> <h2>Explore Alternatives</h2> <p>Titan International is working with widening TTM losses of US$63.5 million, a sharp Q4 2025 loss and a DCF value below the current share price.</p> <p>If those swings in earnings and the recent quarterly loss spike feel uncomfortable, you can review <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">80 resilient stocks with low risk scores</a> today to focus on companies with steadier risk profiles and potentially smoother return paths.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Titan International might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/capital-goods/nyse-twi/titan-international/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 11:55:55",
            "link": "https://simplywall.st/stocks/us/capital-goods/nyse-twi/titan-international/news/titan-international-twi-q4-loss-of-us56-million-tests-profit",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rackspace Technology FY 2025 Loss Narrowing Challenges Bearish Narratives On Persistent Unprofitability",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Rackspace Technology FY 2025 Earnings: Revenue Holds Steady As Losses Narrow</h2> <p>Rackspace Technology (RXT) just closed out FY 2025 with Q4 revenue of US$682.8 million and a basic EPS loss of US$0.13, alongside trailing 12 month revenue of US$2.69 billion and a full year net loss of US$225.8 million. The company has seen quarterly revenue move from US$665.4 million in Q1 2025 to US$682.8 million in Q4 2025, while quarterly EPS losses over the same period ranged from US$0.31 to US$0.13. This gives investors a clear read on how revenue scale and persistent losses are shaping margins.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-rxt/rackspace-technology\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Rackspace Technology.</a> <p>With the headline numbers on the table, the next step is to set these results against the most widely discussed narratives around Rackspace to see which stories hold up and which ones the latest margins start to call into question.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/7s76ftyt-digital-transformation-and-cloud-adoption-will-fuel-expansion-5zw5\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Rackspace Technology</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-rxt/rackspace-technology/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:RXT Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/8352bdd4-b729-4cdf-a58d-e2f59b544f73/chart/revenue-and-expenses-breakdown?date=2026-02-27\" width=\"746\"/></a><figcaption>NasdaqGS:RXT Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <h2>LTM Losses Of US$225.8 Million Keep Profit Story On Hold</h2> <ul> <li>Over the last 12 months, Rackspace recorded total revenue of US$2.69b and a net loss of US$225.8 million, with trailing basic EPS at a loss of US$0.95.</li> <li>Consensus narrative talks about higher margin managed services helping over time, but the current loss profile puts a clear hurdle in front of that idea.\n    <ul> <li>Analysts expect revenue growth of about 2.2% per year and earnings to decline about 2.7% per year over the next three years, so the business is not projected to return to profit in that window.</li> <li>Losses have grown at roughly 9.6% per year over the past five years, which contrasts with the bullish view that margin mix alone can meaningfully lift net earnings from here.</li> </ul> </li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/7s76ftyt-digital-transformation-and-cloud-adoption-will-fuel-expansion-5zw5\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 Rackspace Technology Bull Case</strong></a></p> <h2>0.2x P/S Versus 2.1x Industry Sets A Low Sales Multiple</h2> <ul> <li>Rackspace trades at about 0.2x P/S, far below the US IT industry at 2.1x and a peer group at 3.2x, even though the shares are at US$2.28.</li> <li>Bulls point to this discount as potential value, but the underlying trends give that idea mixed support.\n    <ul> <li>The company is unprofitable on a trailing 12 month basis and is not forecast to become profitable over the next three years, so the low P/S sits alongside an ongoing loss making profile.</li> <li>Consensus revenue growth of about 2.2% per year, compared with 10.4% for the broader US market, means the discount on sales is paired with slower expected growth than many IT names.</li> </ul> </li> </ul> <h2>Negative Equity And High Volatility Keep Bears Focused On Risk</h2> <ul> <li>Risk data flags negative shareholders’ equity and a highly volatile share price over the past three months as key balance sheet and market concerns.</li> <li>Bears argue these issues could limit how much that low P/S matters, and the current numbers support why they focus on downside risk.\n    <ul> <li>With forecasts calling for earnings to decline about 2.7% per year and no move into profitability over the next three years, there is no earnings cushion against that negative equity position.</li> <li>Persistent losses on roughly US$2.69b of trailing revenue, together with recent share price swings, give cautious investors clear, quantifiable risks to weigh alongside any turnaround hopes.</li> </ul> </li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/da3wetp8-public-cloud-competition-will-erode-managed-revenues-but-spark-recovery\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 Rackspace Technology Bear Case</strong></a></p> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/7s76ftyt-digital-transformation-and-cloud-adoption-will-fuel-expansion-5zw5\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Rackspace Technology on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>Mixed feelings about Rackspace after all that detail? Take a moment to review the numbers yourself and weigh <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-rxt/rackspace-technology\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward and 4 important warning signs</a> before you decide what the story really is.</p> <h2>See What Else Is Out There</h2> <p>Rackspace is working with losses of US$225.8 million, negative equity and no forecast move into profitability, which keeps risk firmly on the front burner for now.</p> <p>If that mix of ongoing losses and balance sheet pressure feels a bit too intense, you might prefer a starting point built around <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">80 resilient stocks with low risk scores</a> that aims to prioritise resilience over drama.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 11:55:55",
            "link": "https://simplywall.st/stocks/us/software/nasdaq-rxt/rackspace-technology/news/rackspace-technology-fy-2025-loss-narrowing-challenges-beari",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Terreno Realty Refines Coastal Logistics Footprint With New Leases And Acquisitions",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Terreno Realty (NYSE:TRNO) reported new full building leases in Redondo Beach, CA with a domestic energy company in the past week.</li> <li>The company also secured a lease with a manufacturer in Rancho Dominguez, expanding its tenant mix in Southern California.</li> <li>In New York, Terreno Realty acquired industrial properties in the Bronx and Queens with plans for redevelopment.</li> <li>These moves affect the company’s leasing profile, tenant base, and geographic footprint in core U.S. logistics markets.</li> </ul> <p>Terreno Realty focuses on industrial real estate in coastal U.S. markets that serve freight, distribution, and last mile logistics. For investors following NYSE:TRNO, the recent leasing activity in California and property acquisitions in New York are consistent with that core business model. Industrial properties tied to distribution and warehouse needs remain central to many supply chain discussions.</p> <p>These new leases and planned redevelopments provide more current data points on where Terreno Realty is active and what types of tenants are occupying its buildings. As additional information becomes available on lease terms, redevelopment timing, and occupancy, investors can evaluate how these transactions align with their own view of the company’s long term positioning in major coastal hubs.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-trno/terreno-realty/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Terreno Realty</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/TRNO\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Terreno Realty.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-trno/terreno-realty/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:TRNO Earnings &amp; Revenue Growth as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/921dddc1-6cd4-4736-81cf-98de4b8adf7d/chart/earnings-and-revenue-growth?date=2026-02-27\" width=\"746\"/></a><figcaption>NYSE:TRNO Earnings &amp; Revenue Growth as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_hidden_strengths\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-trno/terreno-realty\" rel=\"noopener noreferrer\" target=\"_blank\">4 things going right for Terreno Realty that this headline doesn't cover.</a></p> <p>The recent moves in California and New York point to Terreno Realty trying to tighten up how its portfolio is used rather than simply adding square footage. On the West Coast, locking in three full building leases in Redondo Beach with a single domestic energy tenant, plus a long dated lease in Rancho Dominguez with a laboratory products company, gives better visibility on occupancy in key infill logistics submarkets. Terminating an in place lease slightly early to accommodate the new Redondo Beach agreements suggests Terreno is prioritizing tenant profile and lease length over a short period of remaining income from the prior tenant.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>The Risks and Rewards Investors Should Consider</h3> <ul> <li>⚠️ Execution risk around the Bronx and Queens projects, where planned demolition, interior build out and reconfiguration need to be finished on time and within the US$12.2m and US$103.4m expected investment levels.</li> <li>⚠️ The US$500m at the market follow on equity program could lead to shareholder dilution if new shares are issued without offsetting benefits in earnings or asset quality.</li> <li>🎁 The Bronx asset carries an estimated stabilized cap rate of 5.3% initially and 6.1% after renovation, while Queens is guided at 5.4%, giving investors concrete return targets for these projects.</li> <li>🎁 Long dated leases in Southern California industrial hubs, including one running to 2036, can support more predictable cash flows if tenants perform as expected under their contracts.</li> </ul> <h3>What To Watch Going Forward</h3> <p>From here, the key questions are execution and capital deployment. On the leasing side, you can watch how quickly the Rancho Dominguez and Redondo Beach tenants take occupancy, and whether there are any disclosed changes to rent terms or renewal activity. On the acquisitions side, progress updates on permitting, demolition and construction at the Bronx and Queens assets will be important to see if the targeted cap rates and timelines hold. Finally, keep an eye on how much of the US$500m follow on equity capacity Terreno actually uses, and at what share prices, because that will shape the balance between portfolio growth and dilution for existing investors.</p> <p>To ensure you're always in the loop on how the latest news impacts the investment narrative for Terreno Realty, head to the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/TRNO\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Terreno Realty</a> to never miss an update on the top community narratives.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Terreno Realty might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/real-estate/nyse-trno/terreno-realty/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 11:51:12",
            "link": "https://simplywall.st/stocks/us/real-estate/nyse-trno/terreno-realty/news/terreno-realty-refines-coastal-logistics-footprint-with-new",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Will Compass’ Alliance With Rocket And Redfin Reshape COMP’s AI-Enabled Platform Narrative?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Compass, Inc. has reported past fourth-quarter 2025 revenue of US$1,699.8 million and full-year revenue of US$6,961.6 million, alongside a narrowed annual net loss of US$58.5 million, while also appointing former Anywhere Real Estate chief accounting officer Timothy B. Gustavson as its new Chief Accounting Officer.</li> <li>At the same time, Compass International Holdings entered a three-year alliance with Rocket Companies and Redfin that could add more than 500,000 exclusive listings to Redfin’s platform and embed Rocket Mortgage offerings into Compass’s technology, meaningfully expanding listing exposure and integrating financing into its homebuying experience.</li> <li>Next, we’ll examine how this three-year Rocket and Redfin alliance may influence Compass’s investment narrative around its AI-enabled platform.</li> </ul><p>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">29 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Compass Investment Narrative Recap</h2><p>To own Compass, I think you have to believe its AI-enabled, end-to-end platform can turn higher agent productivity and richer listing inventory into a sustainably profitable brokerage model, despite its reliance on transaction-based commissions. The Rocket and Redfin alliance directly touches the key near term catalyst of platform adoption by expanding Compass’s digital reach, while the biggest current risk remains that structural shifts in how homes are bought and sold could weaken the traditional agent-centric economics Compass depends on.</p> <p>Among the recent announcements, the three-year alliance with Rocket Companies and Redfin looks most relevant, because it plugs Compass’s listings and Rocket Mortgage financing into high-traffic consumer channels where buyers already search. For shareholders focused on catalysts around AI and integrated services, this agreement may matter as much as quarterly results, since it tests whether Compass’s technology and data can actually convert broader online exposure and lead flow into better economics per transaction.</p> <p>Yet even with these partnerships, investors should be aware that growing regulatory and platform power could still reshape how much value brokerages like Compass are allowed to keep...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/real-estate-management-and-development/nyse-comp/compass/0jhpbs6g-ai-integration-and-evolving-demographics-will-expand-real-estate-horizons-tv18\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Compass (it's free!)</a></p><p>Compass’ narrative projects $9.1 billion revenue and $275.1 million earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/real-estate-management-and-development/nyse-comp/compass/0jhpbs6g-ai-integration-and-evolving-demographics-will-expand-real-estate-horizons-tv18\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Compass' forecasts yield a $13.90 fair value</a>, a 39% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/real-estate-management-and-development/nyse-comp/compass\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"COMP 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/1de63fb6-70ab-4048-a072-49ee626a6c2a/chart/quote-price\" width=\"746\"/></a><figcaption>COMP 1-Year Stock Price Chart</figcaption></figure> <p>Some of the lowest ranked analysts were assuming only about 11.6 percent annual revenue growth to roughly US$8.7 billion and modest 1.9 percent margins by 2028, so if you worry that tech platforms could eventually marginalize Compass’s agent model, this new Rocket and Redfin partnership might either soften or reinforce that concern depending on how much value you think flows to Compass versus its partners.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/real-estate-management-and-development/nyse-comp/compass\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 5 other fair value estimates on Compass</a> - why the stock might be worth just $11.00!</p><h2>Reach Your Own Conclusion</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your Compass research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/real-estate-management-and-development/nyse-comp/compass\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/real-estate-management-and-development/nyse-comp/compass\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Compass research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Compass' overall financial health at a glance.</li></ul><h2>Searching For A Fresh Perspective?</h2><p>Our top stock finds are flying under the radar-for now. Get in early:</p><ul><li>The future of work is here. Discover the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">29 top robotics and automation stocks</a> leading the charge in AI-driven automation and industrial transformation.</li><li>Invest in the nuclear renaissance through our list of <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473644/nuclear-renaissance/global\" rel=\"noopener noreferrer\" target=\"_blank\">84 elite nuclear energy infrastructure plays</a> powering the global AI revolution.</li><li>Find <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 companies with promising cash flow potential yet trading below their fair value</a>.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 11:51:11",
            "link": "https://simplywall.st/stocks/us/real-estate-management-and-development/nyse-comp/compass/news/will-compass-alliance-with-rocket-and-redfin-reshape-comps-a",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Illumina (ILMN) Valuation After Recent Share Price Momentum Shifts",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Illumina (ILMN) is back in focus for investors after recent trading moves, with the stock showing mixed performance across different time frames and a meaningful gap between its market price and some valuation estimates.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-ilmn/illumina\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Illumina.</a></p> <p>The recent 1-day share price return of 4.54% and 7-day return of 6.17% suggest short term momentum is picking up again, even though the 30-day share price return of a 16.23% decline and 90-day return of a 3.08% decline show pressure has not fully eased. The 1-year total shareholder return of 43.19% contrasts with weaker 3 and 5 year total shareholder returns.</p> <p>If this shift in momentum has you thinking about where else growth stories might emerge in healthcare and genomics, our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_healthcare_ai\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">29 healthcare AI stocks</a> is a useful place to start comparing ideas.</p> <p>With Illumina trading at $127.40 against an analyst price target of $136.05 and an estimated intrinsic value implying a 15.3% discount, you have to ask whether there is a genuine opportunity here or whether the market is already factoring in future growth.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 6.3% Undervalued</h2> <p>Illumina's most followed narrative puts fair value at $135.94 versus the last close at $127.40, framing the current price as modestly below that estimate built on detailed long term assumptions.</p> <blockquote> <p><em>Operational efficiencies, disciplined cost controls, and targeted share repurchases have already resulted in notable operating margin and EPS improvements, and further scaling, along with tax headwinds turning into tailwinds, sets the stage for continued net margin and earnings growth over the next several years.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/gkww7ghf-ilmn-operational-progress-will-offset-ongoing-china-exposure-and-sector-uncertainties\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what kind of revenue trajectory, profit margins, and future P/E multiple are baked into that fair value and discount rate story? The full narrative lays out a specific earnings path, detailed margin expectations, and how those get translated into an equity value using a single discount rate over the coming years.</p> <p><strong>Result: Fair Value of $135.94 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/gkww7ghf-ilmn-operational-progress-will-offset-ongoing-china-exposure-and-sector-uncertainties\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, risks around tighter research budgets and ongoing export controls in China could still disrupt instrument demand and challenge the earnings and margin path in that narrative.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-ilmn/illumina\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Illumina narrative.</a></p> <h2>Next Steps</h2> <p>With a mix of cautious and optimistic signals running through this story, it makes sense to look at the numbers yourself and decide where you stand. Our breakdown of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-ilmn/illumina\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 1 important warning sign</a> can help you weigh both sides before you act.</p> <h2>Looking for more investment ideas?</h2> <p>If you are weighing your next move, do not stop with a single stock. Use the Simply Wall St screener to spot other opportunities that match your style.</p> <ul> <li>Target reliable cash generators by scanning companies with strong fundamentals in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (41 results)</a> and see which names stand out on quality first.</li> <li>Hunt for potential value candidates using the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a> to spot businesses trading below their estimated worth based on underlying metrics.</li> <li>Build a shortlist of potential income ideas with the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> and quickly see which companies offer higher yields with a focus on stability.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 11:51:10",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-ilmn/illumina/news/assessing-illumina-ilmn-valuation-after-recent-share-price-m",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlas Copco (OM:ATCO A) Valuation Check After Recent Share Price Momentum",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Atlas Copco (OM:ATCO A) has drawn investor attention after recent share price moves, including a return of about 4.3% over the past month and roughly 21.5% over the past 3 months.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/se/capital-goods/sto-atco-a/atlas-copco-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Atlas Copco.</a></p> <p>Those recent gains come after a stronger run, with a 21.5% 90 day share price return and a 16.1% year to date share price return. The 1 year total shareholder return of 8.9% points to more moderate longer term momentum.</p> <p>If Atlas Copco has you looking beyond a single name, this could be a good moment to broaden your search and check out our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/global\" rel=\"noopener noreferrer\" target=\"_blank\">97 top founder-led companies</a> as potential new ideas.</p> <p>With Atlas Copco shares roughly flat to the latest analyst price target and trading at an intrinsic premium on some models, you now have to ask yourself: is there real value left here, or is the market already pricing in future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 1% Overvalued</h2> <p>Atlas Copco's most followed narrative pegs fair value at SEK193.25, just below the latest close at SEK194.70, so the story hinges on fine margins.</p> <blockquote> <p><em>The expanding, high-margin service and aftermarket business continues to grow robustly across business areas, increasing recurring revenue streams and helping to stabilize and lift group operating margins even amid volatility in equipment orders.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/wknmc8w9-analysts-lift-atlas-copco-price-target-as-profit-margins-improve-and-valuation-metrics-strengthen\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what kind of revenue mix, margin path, and earnings multiple are baked into that fair value? The narrative leans on steady growth assumptions and a richer future P/E, but the exact hurdles it sets might surprise you.</p> <p><strong>Result: Fair Value of SEK193.25 (OVERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/wknmc8w9-analysts-lift-atlas-copco-price-target-as-profit-margins-improve-and-valuation-metrics-strengthen\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, persistent currency headwinds and weaker large order demand, especially in China and Europe, could quickly challenge those fair value assumptions if they intensify.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/se/capital-goods/sto-atco-a/atlas-copco-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Atlas Copco narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of optimism and caution has you on the fence, consider taking a closer look now. Weigh the positives yourself and check out <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/se/capital-goods/sto-atco-a/atlas-copco-shares\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward</a>.</p> <h2>Want more ideas before you move on?</h2> <p>If you stop at a single company, you might miss opportunities that fit your style even better, so use this moment to widen your watchlist smartly.</p> <ul> <li>Target value potential by scanning our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">230 high quality undervalued stocks</a> that pair quality fundamentals with pricing that some investors may find appealing.</li> <li>Prioritise resilience by checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/global\" rel=\"noopener noreferrer\" target=\"_blank\">324 resilient stocks with low risk scores</a>, focusing on companies with more measured risk profiles that could suit a steadier approach.</li> <li>Hunt for tomorrow's leaders early by reviewing our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/global\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 572 high quality undiscovered gems</a> before they sit firmly on everyone else's radar.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 11:51:09",
            "link": "https://simplywall.st/stocks/se/capital-goods/sto-atco-a/atlas-copco-shares/news/atlas-copco-omatco-a-valuation-check-after-recent-share-pric",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Regeneron Pharmaceuticals (REGN) Valuation After Dupixent’s New FDA Approval For Allergic Fungal Rhinosinusitis",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>The latest catalyst for Regeneron Pharmaceuticals (REGN) is US FDA approval of Dupixent for allergic fungal rhinosinusitis in patients 6 and older with prior sino nasal surgery. This expands the labeled uses of this key drug.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-regn/regeneron-pharmaceuticals\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Regeneron Pharmaceuticals.</a></p> <p>Despite the positive Dupixent news and other recent pipeline updates, such as the priority review for garetosmab and gene editing progress with Tessera, Regeneron Pharmaceuticals' recent share price momentum has been muted, with a 1-year total shareholder return of 10.28% alongside a 5-year total shareholder return of 72.68%.</p> <p>If this kind of targeted biotech progress interests you, it could be a good moment to look across the sector and scan <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_healthcare_ai\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">29 healthcare AI stocks</a> as potential next ideas to research.</p> <p>With REGN trading at $770.79, carrying a value score of 5 and a quoted 56% intrinsic discount plus an implied upside to analyst targets, is the recent caution a mispricing, or is the market already factoring in expectations for future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 6.1% Undervalued</h2> <p>Compared with the narrative fair value of about $821.12, Regeneron Pharmaceuticals at $770.79 sits below that mark, and the narrative leans on a few core growth pillars to justify that gap.</p> <blockquote> <p><em>The successful ramp of EYLEA HD, which is gaining physician adoption due to its clinical profile and durability, along with anticipated regulatory approvals for label enhancements (pending resolution of manufacturing site issues), could help offset patent/biosimilar pressures on legacy EYLEA, supporting stabilization and potential growth in core revenue and sustaining healthy margins over the next several years.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/yho3yxld-pipeline-strength-and-recent-developments-will-drive-premium-potential-ahead\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what sits underneath that fair value call? The narrative leans on measured revenue growth, firm profit margins, and a richer future earnings multiple to bridge today’s price and that target.</p> <p><strong>Result: Fair Value of $821.12 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/yho3yxld-pipeline-strength-and-recent-developments-will-drive-premium-potential-ahead\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, the story could change quickly if competition for Eylea and pricing pressure hit revenue harder than expected, or if key pipeline bets disappoint commercially.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-regn/regeneron-pharmaceuticals\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Regeneron Pharmaceuticals narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of opportunity and caution rings true for you, consider acting while the data is fresh and shape your own view with <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-regn/regeneron-pharmaceuticals\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards</a>.</p> <h2>Ready for more investment ideas?</h2> <p>If Regeneron has sharpened your thinking, do not stop here. Use the Simply Wall St screener to spot other opportunities and pressure test your next move.</p> <ul> <li>Focus on quality at a sensible price by checking companies in the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a> that could merit a place on your watchlist.</li> <li>Prioritise resilience by reviewing the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (41 results)</a> and see which names pair financial strength with fundamentals you may want to research further.</li> <li>Hunt for tomorrow's standouts by running through the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> before these ideas are widely followed.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 11:51:08",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-regn/regeneron-pharmaceuticals/news/assessing-regeneron-pharmaceuticals-regn-valuation-after-dup",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A Look At FTI Consulting (FCN) Valuation After Strong Results And Upbeat 2026 Guidance",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Why FTI Consulting’s latest earnings matter for shareholders</h2> <p>FTI Consulting (FCN) just released fourth quarter and full year 2025 results alongside fresh 2026 guidance. This puts new numbers around how the business is performing today and what management expects next.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-fcn/fti-consulting\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for FTI Consulting.</a></p> <p>The 5.1% 1 day share price return after the results, with the stock now at $168.11, comes after a mixed few months where a 30 day share price decline of 8.1% contrasts with a modestly positive 1 year total shareholder return of 2.0%. This suggests recent trading momentum has picked up as investors react to the earnings beat and 2026 guidance.</p> <p>If these earnings have you thinking about where professional services and technology intersect, it could be a good moment to check out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">20 top founder-led companies</a> as potential next ideas.</p> <p>With FTI Consulting posting higher quarterly sales and diluted EPS alongside 2026 guidance that points to more revenue and earnings, you now have to ask yourself whether there is still upside here or whether the market is already pricing in that growth.</p> <h2>Most Popular Narrative: 5.3% Undervalued</h2> <p>With FTI Consulting closing at $168.11 against a narrative fair value of $177.50, the current price sits below what this widely followed view considers reasonable, and that gap comes from some very specific assumptions about growth and profitability.</p> <blockquote> <p><em>The consulting industry's trend toward consolidation and the challenging macro climate are expected to drive \"shakeouts\" among weaker competitors, strengthening FTI's competitive position, client retention, and potential for market share gains, all of which could result in sustainable margin expansion and earnings growth.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/didodtsg-fcn-revenue-outlook-adjustments-and-cfo-transition-will-shape-next-chapter\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Want to see what sits behind that confidence in margins and earnings? The narrative leans on steady revenue progress, firmer profitability, and a future earnings multiple that is lower than many peers. The key point is how those moving parts line up over several years. If you want to understand the full playbook behind the $177.50 fair value, the complete narrative spells out every assumption.</p> <p>In this narrative, discounting future earnings back at just over 7% and pairing mid single digit revenue growth with higher profit margins creates a path that supports the current fair value estimate. Analysts also assume fewer shares on issue and a future P/E that is below where the broader professional services space sits today, which together help close the gap between today’s price and that $177.50 figure.</p> <p><strong>Result: Fair Value of $177.50 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/didodtsg-fcn-revenue-outlook-adjustments-and-cfo-transition-will-shape-next-chapter\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, there are clear watchpoints, including pressure on higher billing rates if competition intensifies and the risk that automation could chip away at some consulting demand.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-fcn/fti-consulting\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this FTI Consulting narrative.</a></p> <h2>Another View: Cash Flows Tell A Different Story</h2> <p>While the narrative fair value of $177.50 suggests FTI Consulting is 5.3% undervalued, our DCF model points in the opposite direction, with the shares trading well above an estimated future cash flow value of $0.16. That is a very large gap. Which signal do you trust more: earnings power or cash flows?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-fcn/fti-consulting/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/commercial-services/nyse-fcn/fti-consulting/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"FCN Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/40098b7d-2adb-4c5e-b295-ff1576b3672b/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>FCN Discounted Cash Flow as at Feb 2026</figcaption></figure><p> </p><p>Simply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (<a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-fcn/fti-consulting\" rel=\"noopener noreferrer\" target=\"_blank\">check out FTI Consulting for example</a>). We show the entire calculation in full. You can track the result in your <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted when this changes, or use our stock screener to discover <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a>. If you <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">save a screener</a> we even alert you when new companies match - so you never miss a potential opportunity.</p> <h2>Next Steps</h2> <p>With such mixed signals around value and earnings power, it makes sense to move quickly and examine the numbers yourself to decide what really matters. To see what the market is currently optimistic about, take a closer look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/commercial-services/nyse-fcn/fti-consulting\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If this update has you rethinking where your next opportunity could come from, do not stop at one stock. Use the screener to quickly surface fresh ideas tailored to you.</p> <ul> <li>Target potential mispricings by scanning our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a>, which combines quality fundamentals with prices that may not fully reflect them.</li> <li>Strengthen your income focus by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a>, a set of companies offering yields that stand out for investors who care about regular cash returns.</li> <li>Prioritize resilience by checking the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a>, a group of businesses that score well on financial stability and measured risk factors.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 11:41:36",
            "link": "https://simplywall.st/stocks/us/commercial-services/nyse-fcn/fti-consulting/news/a-look-at-fti-consulting-fcn-valuation-after-strong-results",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A Look At New Oriental Education & Technology Group’s (EDU) Valuation After Recent Share Price Weakness",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Recent performance snapshot</h2> <p>New Oriental Education &amp; Technology Group (EDU) has recently drawn attention after a mixed run in its share price, with a 1 day return of 2.07% and a 7 day decline of 6.76%.</p> <p>Over the past month the stock is roughly flat, while the past 3 months show a total return of 8.99%. Over a 1 year period, the total return stands at 20.51%, set against a 3 year total return of 33.52% and a 5 year total return decline of 67.80%.</p> <p>The shares last closed at US$55.74, and the company currently carries a value score of 3 on the provided scale.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-edu/new-oriental-education-technology-group\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for New Oriental Education &amp; Technology Group.</a></p> <p>For New Oriental, the recent 7 day share price decline of 6.76% and a year to date share price decline of 3.61% sit alongside a 90 day share price return of 8.99% and a 1 year total shareholder return of 20.51%. This suggests momentum has cooled in the short term, while longer term holders have still seen gains.</p> <p>If this shift in sentiment has you thinking about where else capital could work hard, it might be a good moment to broaden your search and check out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">20 top founder-led companies</a>.</p> <p>With New Oriental trading at US$55.74 and sitting at a discount to analyst targets and some intrinsic estimates, investors now face a key question: is this a genuine value opportunity, or is future growth already priced in?</p> <h2>Most Popular Narrative: 13.6% Undervalued</h2> <p>With New Oriental shares at US$55.74 against a narrative fair value of US$64.49, the current setup centers on whether its cash generation can justify that gap under a 7.74% discount rate.</p> <blockquote> <p><em>Continued investment and rollout of omnichannel online merge offline (OMO) and AI-driven systems are enabling operating leverage, cost reductions, and higher efficiency in delivery, which is already resulting in improved operating margins (410bps YoY in core business), supporting future earnings growth through both topline expansion and margin expansion.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/u6bu8xt3-analysts-raise-price-target-for-new-oriental-amid-resilient-margins-and-mixed-growth-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what kind of revenue climb, margin shift, and future earnings multiple need to line up to support that valuation gap? The full narrative spells out the growth runway, profit profile, and re-rating assumptions that sit behind that US$64.49 figure.</p> <p><strong>Result: Fair Value of US$64.49 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/u6bu8xt3-analysts-raise-price-target-for-new-oriental-amid-resilient-margins-and-mixed-growth-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, that story could wobble if overseas study demand softens further, or if tougher competition in non academic segments squeezes margins more than expected.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-edu/new-oriental-education-technology-group\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this New Oriental Education &amp; Technology Group narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of upside potential and risks leaves you on the fence, now is a good time to check the data yourself and pressure test the story. To see what more optimistic investors are focusing on, take a look at <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-edu/new-oriental-education-technology-group\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If New Oriental has sharpened your thinking, do not stop with one stock. Use the tools at your fingertips to compare different themes, risk levels, and income profiles before you commit fresh capital.</p> <ul> <li>Target potential value opportunities by checking companies that screen as attractively priced with solid fundamentals through <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">53 high quality undervalued stocks</a>.</li> <li>Strengthen the defensive side of your portfolio by focusing on companies with cash rich, resilient balance sheets using the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (41 results)</a>.</li> <li>Set up a reliable income stream by reviewing companies highlighted as higher yielding payers in the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a>.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if New Oriental Education &amp;amp; Technology Group might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/consumer-services/nyse-edu/new-oriental-education-technology-group/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 11:41:36",
            "link": "https://simplywall.st/stocks/us/consumer-services/nyse-edu/new-oriental-education-technology-group/news/a-look-at-new-oriental-education-technology-groups-edu-valua",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Northland Power Q4 Profitability Contrasts With Trailing Losses And Tests Bullish Earnings Narratives",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Northland Power FY 2025 earnings snapshot</h2> <p>Northland Power (TSX:NPI) closed out FY 2025 with Q4 revenue of C$725.3 million and basic EPS of C$0.95, while its trailing 12 month profile still reflects a loss with EPS at C$0.62 and net income of C$163.2 million. The company has seen quarterly revenue move from C$582.3 million in Q4 2024 to C$725.3 million in Q4 2025, alongside EPS shifting from C$0.49 to C$0.95 over the same period. This sets up an earnings picture where recent quarterly profitability contrasts with a loss making trailing 12 month base. For investors, the mix of positive Q4 earnings on top of loss making full year figures keeps the spotlight firmly on how margins hold up from here.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Northland Power.</a> <p>With the headline numbers on the table, the next step is to see how this earnings profile lines up against the key narratives around Northland Power's profitability, growth potential, and risk profile that investors have been talking about.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/n65x0uiq-grid-storage-and-offshore-wind-will-deliver-a-brighter-future-uxos\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Northland Power</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSX:NPI Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/eb1e3ff3-ac2f-404c-899f-e4a48d235412/chart/revenue-and-expenses-breakdown?date=2026-02-26\" width=\"746\"/></a><figcaption>TSX:NPI Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <h2>Loss making over C$160 million on a 12 month view</h2> <ul> <li>On a trailing 12 month basis to Q4 2025, Northland Power recorded total revenue of about C$2.4b and a net loss of C$163.2 million, which contrasts with Q4 alone showing net income of C$249.5 million.</li> <li>What stands out for the bearish narrative is that this 12 month loss comes after multiple loss making quarters, including Q3 2025 net loss of C$414.0 million and Q2 2025 net loss of C$64.1 million. Critics argue this keeps cash flow and long term earnings visibility under pressure even as individual quarters like Q4 look strong.\n    <ul> <li>Bears also point to weak coverage of interest costs and dividends, with earnings currently not covering a 3.32% dividend yield or interest expense. This ties directly into concerns about elevated debt and C$9b already spent plus C$6b still expected on Baltic Power and Hai Long.</li> <li>At the same time, consensus commentary about step changes in EBITDA from new offshore wind and storage projects is hard to reconcile with the recent pattern of trailing losses, including a trailing loss of C$285.9 million just one quarter earlier in Q3 2025.</li> </ul> </li> </ul> Northland’s recent loss pattern and debt funded build out give cautious investors plenty to question in the more optimistic forecasts of future earnings power. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Northland Power Bear Case</strong></a> <h2>Slow 1.7% revenue growth versus wider market</h2> <ul> <li>Over the past 12 months, revenue has grown by about 1.7% per year compared to a 6.1% per year forecast for the Canadian market, even though quarterly revenue moved from C$582.3 million in Q4 2024 to C$725.3 million in Q4 2025.</li> <li>Analysts' bullish case leans heavily on new projects like Hai Long and Baltic Power and on grid scale storage, arguing that these additions can lift margins from about 2.3% loss making levels today toward 16.5% over three years. However, the current modest 1.7% revenue growth rate and history of wind resource issues and curtailments in places like the German offshore assets show how sensitive actual revenue can be to weather and power price conditions.\n    <ul> <li>On the supportive side for bulls, Q4 2025 revenue of C$725.3 million and net income of C$249.5 million follow Q4 2024 revenue of C$582.3 million and net income of C$126.8 million, which aligns with the view that new assets and better contract mix can improve earnings in stronger periods.</li> <li>Against that, the same 12 month data set still shows the business unprofitable and dropping several onshore and battery projects in Ontario, Alberta, and New York. This pushes back on the idea that growth from here is straightforward or that all pipeline projects will translate into higher revenue.</li> </ul> </li> </ul> For investors weighing that slower 1.7% revenue growth against the big project pipeline, it helps to see how others frame the trade off between new capacity, weather risk, and contract quality. <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Northland Power Bull Case</strong></a> <h2>Valuation sits below both DCF fair value and peers</h2> <ul> <li>At a current share price of C$21.69, Northland Power trades below the DCF fair value of about C$23.78 and at a P/S of 2.3x, compared with 3.0x for the broader North American renewable energy industry and 3.5x for peers.</li> <li>Consensus narrative suggests that expansion into grid scale storage and offshore wind and the use of long term, inflation linked contracts could justify these lower multiples over time. Yet the combination of a trailing loss of C$163.2 million and interest expenses that are not well covered by earnings means the current discount can also be read as the market pricing in balance sheet risk and a reliance on analyst forecasts that expect earnings of C$454.1 million by around 2028.\n    <ul> <li>The spread between the share price of C$21.69 and DCF fair value of C$23.78, plus a forecast earnings growth rate of about 40% per year and an analyst target of C$22.42, are the main numbers backing the view that the shares are not expensive\n<h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/n65x0uiq-grid-storage-and-offshore-wind-will-deliver-a-brighter-future-uxos\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Northland Power on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>With bulls and bears both making strong cases here, it is worth getting familiar with the full set of numbers and forming your own view quickly. To see how concerns stack up against potential upside, take a look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a> and judge the balance for yourself.</p> <h2>Explore Alternatives</h2> <p>Northland Power is still working through a C$163.2 million loss on a 12 month view, modest 1.7% revenue growth, and debt related concerns.</p> <p>If that combination of recent losses and balance sheet pressure feels uncomfortable, you can quickly compare it with companies in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/ca\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (10 results)</a> that prioritize financial resilience.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p></li></ul></li></ul><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Northland Power might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/ca/utilities/tsx-npi/northland-power-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-27 11:41:36",
            "link": "https://simplywall.st/stocks/ca/utilities/tsx-npi/northland-power-shares/news/northland-power-q4-profitability-contrasts-with-trailing-los",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chime Financial (CHYM) Q2 Loss Of US$923m Fuels Bearish Profitability Narratives",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Chime Financial (CHYM) closed out FY 2025 with Q4 revenue of US$596.4 million and a basic EPS loss of US$0.12. Trailing 12 month figures show revenue of about US$2.2 billion and a basic EPS loss of US$4.27, keeping the story firmly in loss-making territory. Over recent periods the company has seen revenue move from US$475.2 million in Q4 2024 to US$596.4 million in Q4 2025. This has come alongside quarterly EPS that has swung between a profit of US$0.20 in Q1 2025 and a loss of US$7.29 in Q2 2025, so investors are watching how quickly that volatility settles into more stable margins.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Chime Financial.</a> <p>With the latest numbers on the table, the next step is to see how this mix of rapid revenue progress and uneven profitability lines up with the key narratives investors have been using to frame Chime Financial’s story.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/tgtbueur-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about Chime Financial</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:CHYM Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/93e8c166-1574-412a-8955-93ccc8007b9e/chart/revenue-and-expenses-breakdown?date=2026-02-26\" width=\"746\"/></a><figcaption>NasdaqGS:CHYM Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Revenue Nears US$2.2b While Losses Remain Heavy</h2> <ul> <li>On a trailing 12 month basis, Chime generated about US$2.2b of revenue against a net loss of roughly US$1.0b, so this is a business with strong top line scale that is still firmly in loss making territory.</li> <li>What stands out for the bullish narrative is that analysts are pairing this 30.7% revenue growth over the last year with forecast earnings growth of about 116.54% per year,\n    <ul> <li>Revenue moving from US$1.7b to about US$2.2b over the last 12 months aligns with the bullish view that digital banking adoption and higher value products like MyPay and Chime Card can support future growth.</li> <li>At the same time, the current trailing 12 month loss of roughly US$1.0b is a reminder that the optimistic margin assumptions in the bullish case depend on a significant shift from today’s loss making base.</li> </ul> </li> </ul> <p>Some bulls argue this mix of US$2.2b in revenue and heavy current losses could be the setup for a sharp earnings swing if their margin expectations play out, but they are starting from a very loss heavy year.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_bull_narrative_link\" href=\"https://simplywall.st/narratives/tgtbueur-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐂 Chime Financial Bull Case</strong></a> <h2>Quarterly Profit Swings Highlight Execution Risk</h2> <ul> <li>Within FY 2025, net income ranged from a profit of US$12.9 million in Q1 to a loss of US$923.4 million in Q2, with Q3 and Q4 losses of US$54.7 million and US$44.8 million, so profitability has moved around a lot within a single year.</li> <li>Bears focus on this pattern when they question how smooth the road to profitability might be,\n    <ul> <li>The very large loss in Q2 2025, alongside much smaller losses in Q3 and Q4, supports the cautious narrative that scaling products like MyPay and instant loans could expose Chime to earnings volatility if credit costs or operating expenses spike again.</li> <li>Even with revenue between US$518.7 million and US$596.4 million across the 2025 quarters, the shift from a small profit in Q1 to sizable losses later in the year gives skeptics concrete data to reference when they argue that earnings quality is still unproven.</li> </ul> </li> </ul> <p>Skeptical investors often point to the jump from a US$12.9 million profit to a US$923.4 million loss within the same year as a key reason to treat any profitability timelines with caution.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_bear_narrative_link\" href=\"https://simplywall.st/narratives/q2p2b8jf-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>🐻 Chime Financial Bear Case</strong></a> <h2>Premium P/S Multiple Relies On Growth Story</h2> <ul> <li>Chime is trading on a P/S ratio of 4.2x compared with peers at 2.0x and the US Diversified Financial industry at 2.4x, so the market is currently valuing each dollar of Chime’s sales at a clear premium to its reference group.</li> <li>Consensus narrative ties that higher multiple to expectations for faster growth,\n    <ul> <li>Forecast revenue growth of 16.7% per year compared with 10.4% for the broader US market is one reason investors may be comfortable paying more than peers for each dollar of current revenue.</li> <li>At the same time, the company is still loss making on a trailing 12 month basis, so the premium P/S ratio is being supported by growth forecasts rather than current profitability, which leaves less room if those forecasts are revised lower.</li> </ul> </li> </ul> <h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/tgtbueur-update-for-chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for Chime Financial on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>If the combination of strong revenue scale, heavy losses and competing narratives leaves you unsure, take a moment to review the numbers yourself. Move quickly to form your own stance, then check what our data driven view highlights with <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards</a>.</p> <h2>See What Else Is Out There</h2> <p>Chime Financial combines roughly US$2.2b of revenue with heavy losses and sharp quarterly profit swings, so earnings quality and consistency remain key pressure points.</p> <p>If that level of earnings volatility has you wanting something steadier, check out our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">79 resilient stocks with low risk scores</a> built to highlight companies with more consistent performance profiles today.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-27 11:41:36",
            "link": "https://simplywall.st/stocks/us/diversified-financials/nasdaq-chym/chime-financial/news/chime-financial-chym-q2-loss-of-us923m-fuels-bearish-profita",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is It Time To Revisit Daiichi Sankyo (TSE:4568) After Recent Share Price Weakness?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Daiichi Sankyo Company is attractively priced right now, this article will walk you through what the numbers are saying about its share price.</li> <li>The stock last closed at ¥3,051, with returns of 3.7% over the past 7 days, 0.2% over 30 days, and year to date and 1 year returns of 13.6% decline and 10.9% decline, alongside a 25.3% decline over 3 years and a 6.5% gain over 5 years.</li> <li>These mixed return figures set the stage for a closer look at what is driving sentiment around the company. In this article, we will focus on how its current share price lines up with different valuation views rather than short term news flow.</li> <li>Daiichi Sankyo Company currently has a <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/jp/pharmaceuticals-biotech/tse-4568/daiichi-sankyo-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation score of 5 out of 6</a>, which means it screens as undervalued on most of the checks we run. Next we will look at what each valuation approach suggests, before finishing with a way to tie them together into a clearer picture of value.</li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_industry_underperformer\" href=\"https://www.simplywall.st/stocks/jp/pharmaceuticals-biotech/tse-4568/daiichi-sankyo-shares/future\" rel=\"noopener noreferrer\" target=\"_blank\">Find out why Daiichi Sankyo Company's -10.9% return over the last year is lagging behind its peers.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Daiichi Sankyo Company Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model estimates what a company might be worth by projecting its future cash flows and then discounting those back to today to get a single present value figure.</p> <p>For Daiichi Sankyo Company, the model used is a 2 Stage Free Cash Flow to Equity approach. The latest twelve month free cash flow is a loss of ¥46.2b, so the valuation leans heavily on expected improvements in future cash generation rather than recent cash flow alone.</p> <p>Analysts have provided free cash flow estimates out to 2030, with projections such as ¥278.8b for 2026 and ¥359.7b for 2030. Beyond the analyst horizon, Simply Wall St extrapolates additional years of cash flows to complete the 10 year projection, all still in ¥ and then discounted back to today.</p> <p>Putting all of those cash flows together, the DCF model suggests an estimated intrinsic value of about ¥5,305 per share, compared with the recent share price of ¥3,051. That gap implies the stock screens as around 42.5% undervalued on this measure alone.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Daiichi Sankyo Company is undervalued by 42.5%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/jp\" rel=\"noopener noreferrer\" target=\"_blank\">18 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/jp/pharmaceuticals-biotech/tse-4568/daiichi-sankyo-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"4568 Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3da34022-ad84-492d-b476-e9d83a1ae4e6/chart/dcf?date=2026-02-26\" width=\"746\"/></a><figcaption>4568 Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/jp/pharmaceuticals-biotech/tse-4568/daiichi-sankyo-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Daiichi Sankyo Company.</a></p> <h3>Approach 2: Daiichi Sankyo Company Price vs Earnings (P/E)</h3> <p>For a profitable business, the P/E ratio is a useful shorthand for how much investors are paying for each unit of earnings. This makes it a practical way to compare companies of different sizes within the same sector.</p> <p>What counts as a “normal” P/E depends a lot on expectations and risk. Higher expected earnings growth or perceived stability can support a higher P/E, while lower growth or higher risk usually point to a lower, more cautious P/E range.</p> <p>Daiichi Sankyo Company currently trades on a P/E of 18.5x. That is above the Pharmaceuticals industry average of 16.0x, but below the peer group average of 31.3x. Simply Wall St also calculates a proprietary “Fair Ratio” for the stock of 32.3x, which is the P/E it might reasonably trade on given factors such as its earnings growth profile, industry, profit margin, market cap and specific risks.</p> <p>This Fair Ratio is more tailored than a simple peer or industry comparison because it adjusts for the company’s own characteristics rather than assuming it should trade in line with broad averages. With the current P/E of 18.5x sitting well below the Fair Ratio of 32.3x, the shares currently appear undervalued on this metric.</p> <p><strong>Result: UNDERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/jp/pharmaceuticals-biotech/tse-4568/daiichi-sankyo-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSE:4568 P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3da34022-ad84-492d-b476-e9d83a1ae4e6/chart/pe-multiple-vs-industry?date=2026-02-26\" width=\"746\"/></a><figcaption>TSE:4568 P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/jp\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 12 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Daiichi Sankyo Company Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, where you write a simple story about Daiichi Sankyo Company that ties your view on its drugs, risks and opportunities to a set of numbers like future revenue, earnings, margins and a fair value estimate.</p> <p>A Narrative on Simply Wall St links three things in one place: the business story you believe, the forecast that matches that story, and the fair value that follows from those assumptions, all presented as an easy tool on the Community page that millions of investors already use.</p> <p>You can then compare that fair value to the current share price to help decide whether you see Daiichi Sankyo Company as priced above or below your expectations. Your Narrative will automatically refresh when new earnings, news or analyst updates are added, so your view remains current.</p> <p>For example, one Daiichi Sankyo Company Narrative could lean closer to the higher analyst fair value around ¥6,300, built on stronger growth and margins. Another could sit nearer the lower fair value around ¥3,623, built on more cautious assumptions about growth, profitability and future P/E. Both perspectives can coexist side by side on the platform.</p> <p>Do you think there's more to the story for Daiichi Sankyo Company? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/TSE/4568\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/jp/pharmaceuticals-biotech/tse-4568/daiichi-sankyo-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSE:4568 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3da34022-ad84-492d-b476-e9d83a1ae4e6/chart/quote-price?date=2026-02-26\" width=\"746\"/></a><figcaption>TSE:4568 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-27 11:35:55",
            "link": "https://simplywall.st/stocks/jp/pharmaceuticals-biotech/tse-4568/daiichi-sankyo-shares/news/is-it-time-to-revisit-daiichi-sankyo-tse4568-after-recent-sh",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        }
    ]
}