{
    "data": [
        {
            "title": "Assessing Silverco Mining (TSXV:SICO) After Final 2025 Cusi Drill Results And Strong Recent Share Price Gains",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Silverco Mining (TSXV:SICO) has drawn fresh attention after reporting the final assay results from its 15,000 metre 2025 diamond drill program at the 100% owned Cusi Property in Chihuahua, Mexico.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/ca/materials/tsxv-sico/silverco-mining-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Silverco Mining.</a></p> <p>The recent drilling update and February equity raise appear to be part of the backdrop to Silverco Mining’s strong momentum, with a 7 day share price return of 17.7%, a 30 day return of 25.6%, and a 90 day return of 140.4% from a latest share price of CA$13.82. Together, these figures suggest building optimism around the exploration story rather than short term trading alone.</p> <p>If this kind of move in a silver focused explorer has your attention, it could be worth widening your search with our screen of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_silver\" href=\"https://simplywall.st/discover/investing-ideas/473743/top-silver-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">7 top silver producer stocks</a> to see what else is on the radar.</p> <p>With zero revenue, a recent equity raise at CA$12.50 and a share price at CA$13.82 after very strong recent returns, you have to ask: is Silverco still mispriced, or is the market already banking on future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 93.1% Undervalued</h2> <p>According to the most followed narrative, Silverco Mining’s fair value of CA$199 sits far above the last close at CA$13.82, which frames the recent rally in a very different light.</p> <blockquote> <p><em>Silverco is a restart-stage, high-grade-ish silver district consolidator advancing the Cusi Mine Complex (underground mine + permitted 1,200 tpd mill) toward a restart decision, but the company explicitly says no production decision has been made yet, pending technical, financial, and permitting milestones.</em></p> </blockquote> <p><em>🗺️ Expected Timeline to Full Production 2026 (company framing): “resource update / restart plan / restart operations” (high-level). However, the official stance is that no production decision has been made yet until milestones are completed. Practical interpretation: until Silverco releases a restart study, financing, and a detailed schedule, any exact “full production” date would be guesswork.</em></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/0ox1qy9t-update-for-silverco-mining\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Curious how a zero revenue explorer gets to that CA$199 figure? The narrative leans on projected ounces, margins and a rich implied multiple that is far from conservative.</p> <p><strong>Result: Fair Value of CA$199 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_user_generated_narrative\" href=\"https://www.simplywall.st/narratives/0ox1qy9t-update-for-silverco-mining\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this narrative could quickly be tested if the restart decision is delayed further or if new technical work points to persistently high AISC.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/ca/materials/tsxv-sico/silverco-mining-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Silverco Mining narrative.</a></p> <h2>Next Steps</h2> <p>If this all sounds optimistic or cautious to you, it is worth checking the facts yourself and forming your own take, especially given our findings of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_analysis\" href=\"https://www.simplywall.st/stocks/ca/materials/tsxv-sico/silverco-mining-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If Silverco has sparked your curiosity, do not stop here. Broaden your watchlist now with focused screens that surface opportunities you might otherwise miss.</p> <ul> <li>Scan for potential bargains by checking companies highlighted in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">8 high quality undervalued stocks</a>, where pricing and fundamentals can tell a very different story to the headline narrative.</li> <li>Strengthen the quality of your watchlist by focusing on companies from the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/ca\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (10 results)</a>, so you are not ignoring balance sheet resilience.</li> <li>Spot under followed opportunities early by reviewing our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/ca\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 6 high quality undiscovered gems</a>, before they sit firmly on everyone else’s radar.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:50:56",
            "link": "https://simplywall.st/stocks/ca/materials/tsxv-sico/silverco-mining-shares/news/assessing-silverco-mining-tsxvsico-after-final-2025-cusi-dri",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is Vulcan Materials (VMC) Fully Priced After Strong Multi Year Share Price Gains",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Vulcan Materials is a fair deal at around US$310 per share, it helps to step back and look at what the current price actually reflects.</li> <li>The stock last closed at US$310.00, with returns of 1.5% over 7 days, 3.1% over 30 days, 5.9% year to date, 26.3% over 1 year, 73.4% over 3 years and 92.3% over 5 years, which may shape how investors are thinking about its potential and its risks today.</li> <li>Recent coverage has focused on Vulcan Materials as a key supplier of construction aggregates in the US, with investors watching how its position in infrastructure and construction projects could influence sentiment. At the same time, broader market discussions around materials and construction stocks have given context to Vulcan's share price moves, as investors compare it to peers and sector trends.</li> <li>Despite that backdrop, Vulcan Materials currently has a valuation score of <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-vmc/vulcan-materials/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">0 out of 6</a>. Next, we will look at how different valuation approaches, and a more holistic view at the end of the article, might help you judge whether the current price lines up with your own expectations.</li> </ul> <p>Vulcan Materials scores just 0/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-vmc/vulcan-materials/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Vulcan Materials Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model estimates what a company could be worth by projecting its future cash flows and then discounting those back to today to get a single present value per share.</p> <p>For Vulcan Materials, the model used is a 2 Stage Free Cash Flow to Equity approach that starts from last twelve months free cash flow of about $1.07b. Analysts provide explicit projections through 2028, with free cash flow for that year modeled at $1.60b. Beyond that, Simply Wall St extrapolates out to 2035, generating a full 10 year cash flow path in dollar terms.</p> <p>When all those projected cash flows are discounted back, the DCF output points to an estimated intrinsic value of about $269.82 per share. Compared with the recent share price of US$310.00, this output indicates that Vulcan Materials is around 14.9% overvalued on this model.</p> <p>On this DCF view, the current market price is above the modelled cash flow value.</p> <p><strong>Result: OVERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Vulcan Materials may be overvalued by 14.9%. <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">Discover 46 high quality undervalued stocks</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">create your own screener</a> to find better value opportunities.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/materials/nyse-vmc/vulcan-materials/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"VMC Discounted Cash Flow as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/b5c73fc4-1c78-42f4-b741-436f7057bd54/chart/dcf?date=2026-03-01\" width=\"746\"/></a><figcaption>VMC Discounted Cash Flow as at Mar 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-vmc/vulcan-materials/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Vulcan Materials.</a></p> <h3>Approach 2: Vulcan Materials Price vs Earnings</h3> <p>For a profitable company like Vulcan Materials, the P/E ratio is a useful way to see how much investors are currently paying for each dollar of earnings. In general, higher expected earnings growth or lower perceived risk can support a higher P/E, while lower growth or higher risk tends to align with a lower, more cautious multiple.</p> <p>Vulcan Materials is trading on a P/E of 37.44x. That compares with an average P/E of 15.56x for the wider Basic Materials industry and a peer group average of 27.79x, so the stock is priced above both of those reference points. Simply Wall St also calculates a proprietary “Fair Ratio” for Vulcan Materials of 24.44x. This is the P/E it might trade on given factors such as its earnings growth profile, profit margins, industry, market capitalization and risk characteristics.</p> <p>This Fair Ratio is more tailored than a simple peer or industry comparison because it adjusts for company specific drivers rather than assuming one size fits all. Lining up the current P/E of 37.44x against the Fair Ratio of 24.44x suggests Vulcan Materials is trading at a richer multiple than this model would indicate.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/materials/nyse-vmc/vulcan-materials/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:VMC P/E Ratio as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/b5c73fc4-1c78-42f4-b741-436f7057bd54/chart/pe-multiple-vs-industry?date=2026-03-01\" width=\"746\"/></a><figcaption>NYSE:VMC P/E Ratio as at Mar 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Vulcan Materials Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, which are simply your own story about a company that you connect to a forecast for revenue, earnings and margins, then to a Fair Value that you can compare with the current price.</p> <p>On Simply Wall St, Narratives live in the Community page and are designed to be easy to use. You can plug in the assumptions you believe in, see the Fair Value that falls out of those numbers, and quickly judge whether that is above or below Vulcan Materials' current share price.</p> <p>Because Narratives update as new information comes in, such as earnings, guidance or news about highway spending and buybacks, your story and its Fair Value do not stay frozen. They move with the data so you can keep checking whether the gap between price and value still supports holding, trimming or adding.</p> <p>For Vulcan Materials, one investor might build a more optimistic Narrative closer to US$340 per share that leans on stronger infrastructure demand and margin expansion. Another might prefer a more cautious Narrative nearer US$190 to US$239.78 per share that leans on sustainability pressures, regulation and slower construction. Both can see in one place how their different stories link to different Fair Values and decisions.</p> <p>For Vulcan Materials, however, we will make it really easy for you with previews of two leading Vulcan Materials Narratives:</p> <p><a href=\"/us/materials/nyse-vmc/vulcan-materials/0leo7c01-highway-project-spending-and-pricing-trends-will-sustain-balanced-opportunity-ahead?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Vulcan Materials Bull Case</strong></a></p> <p>Fair value in this bullish Narrative: US$327.57 per share</p> <p>Gap to that fair value at the recent US$310.00 price: about 5.4% below the Narrative fair value</p> <p>Revenue growth assumption used: 5.34% a year</p> <ul> <li>Analysts in this camp expect infrastructure spending, Sunbelt demand and disciplined pricing to support revenue and earnings over several years.</li> <li>They factor in higher profit margins over time, supported by cost control, automation, acquisitions and a steady project pipeline.</li> <li>Their numbers line up with an analyst consensus price target around US$304.05 and a fair value estimate near US$327.57, with the view that the current price is broadly in line with those assumptions.</li> </ul> <p><a href=\"/us/materials/nyse-vmc/vulcan-materials/3wytubgl-shifting-urbanization-and-sustainability-will-erode-traditional-aggregates?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Vulcan Materials Bear Case</strong></a></p> <p>Fair value in this bearish Narrative: US$264.31 per share</p> <p>Gap to that fair value at the recent US$310.00 price: about 14.8% above the Narrative fair value</p> <p>Revenue growth assumption used: 8.75% a year</p> <ul> <li>This group flags long term headwinds from sustainability trends, regulation, reserve quality and alternative building methods that could pressure traditional aggregate demand.</li> <li>They still model revenue and earnings growth, but think the P/E multiple implied by the current price asks too much of future execution and market conditions.</li> <li>Their updated fair value of about US$264.31 reflects those concerns, with the view that recent gains leave less room for error.</li> </ul> <p>Taken together, these Narratives frame a clear range for Vulcan Materials, from a more optimistic fair value near US$327.57 to a more cautious one around US$264.31. Your own view on volumes, margins and the P/E you are comfortable with will decide which story feels closer to reality.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a></p> <p>Do you think there's more to the story for Vulcan Materials? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/VMC\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/materials/nyse-vmc/vulcan-materials\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:VMC 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/b5c73fc4-1c78-42f4-b741-436f7057bd54/chart/quote-price?date=2026-03-01\" width=\"746\"/></a><figcaption>NYSE:VMC 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:50:56",
            "link": "https://simplywall.st/stocks/us/materials/nyse-vmc/vulcan-materials/news/is-vulcan-materials-vmc-fully-priced-after-strong-multi-year",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Xponential Fitness (XPOF) Valuation After Weak Earnings And Lower 2026 Revenue Guidance",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Xponential Fitness (XPOF) is back in focus after reporting fourth quarter and full year 2025 results, along with 2026 revenue guidance that points to a lower range than the prior year.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-xpof/xponential-fitness\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Xponential Fitness.</a></p> <p>The earnings release and lower 2026 revenue guidance have coincided with sharp share price weakness, with a 1 day share price return of 47.08% decline and a 1 year total shareholder return of 67.75% decline. This points to fading momentum and a reassessment of risk.</p> <p>If you are reassessing your exposure to consumer names after this update, it could be a good time to broaden your search with our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">19 top founder-led companies</a>.</p> <p>With revenue at US$314.9 million in 2025, a net loss of US$38.7 million and 2026 guidance pointing lower, the steep share price pullback raises the key question: is XPOF now undervalued, or is the market correctly pricing in weaker growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 60.9% Undervalued</h2> <p>With Xponential Fitness closing at $4.26 against a widely followed fair value estimate of $10.90, the current setup reflects a wide valuation gap that hinges on long term assumptions about profitability and growth durability.</p> <blockquote> <p><em>The analysts have a consensus price target of $12.333 for Xponential Fitness based on their expectations of its future earnings growth, profit margins and other risk factors. However, there is a degree of disagreement amongst analysts, with the most bullish reporting a price target of $21.0, and the most bearish reporting a price target of just $9.0.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/k97fvnpr-international-expansion-will-capture-rising-wellness-demand-wotn\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Want to see what sits behind that fair value gap and wide analyst range? The narrative leans heavily on a sharp swing to profitability, higher margins and a future earnings multiple that assumes the franchise model keeps scaling efficiently. The exact mix of revenue growth, margin lift and discount rate doing the heavy lifting is all laid out in the full narrative.</p> <p><strong>Result: Fair Value of $10.90 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/k97fvnpr-international-expansion-will-capture-rising-wellness-demand-wotn\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, softer same-store sales and slower studio openings, combined with higher closures and leverage, could pressure royalties and challenge the bullish profitability path that analysts are using.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-xpof/xponential-fitness\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Xponential Fitness narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of concern and optimism feels familiar, do not wait on the sidelines. Check the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nyse-xpof/xponential-fitness\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a> to weigh the full picture for yourself.</p> <h2>Looking for more investment ideas?</h2> <p>If Xponential Fitness has you rethinking your watchlist, do not stop here. Use this moment to widen your opportunity set with a few focused stock ideas.</p> <ul> <li>Spot potential bargains first by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 high quality undervalued stocks</a> that pair quality with prices that may not fully reflect their fundamentals.</li> <li>Prioritise resilience with our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">74 resilient stocks with low risk scores</a> so you can focus on companies that score well on stability instead of constantly worrying about shocks.</li> <li>Get ahead of the crowd by checking our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> before these names move onto everyone else's radar.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 20:50:56",
            "link": "https://simplywall.st/stocks/us/consumer-services/nyse-xpof/xponential-fitness/news/assessing-xponential-fitness-xpof-valuation-after-weak-earni",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A Look At Collegium Pharmaceutical (COLL) Valuation After Mixed Q4 2025 Results And Updated 2026 Guidance",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Collegium Pharmaceutical (COLL) shares came under pressure after its Q4 and full year 2025 report, where earnings and revenue missed some analyst estimates, while management reaffirmed and slightly lifted 2026 guidance.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-coll/collegium-pharmaceutical\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Collegium Pharmaceutical.</a></p> <p>The Q4 miss has come with a reset in expectations, with the 1 day share price return of a 5.77% decline at US$41.67 extending a 30 day share price return of a 9.26% decline, even though the 1 year total shareholder return of 43.44% and 5 year total shareholder return of 85.28% still point to investors who have stayed invested being rewarded over time.</p> <p>If this mix of short term volatility and longer term gains has you thinking about other opportunities in healthcare, it could be worth scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_healthcare_ai\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">27 healthcare AI stocks</a> as a starting list of ideas.</p> <p>With Collegium still trading below the average analyst price target and recent results combining record revenues with an earnings miss, you have to ask: Is this pullback a reset that leaves upside on the table, or is the market already baking in future growth?</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 22.4% Undervalued</h2> <p>Collegium Pharmaceutical's widely followed narrative pegs fair value at about $53.67 per share versus the last close of $41.67, framing the current pullback as potentially too harsh in the context of long term earnings power.</p> <blockquote> <p><em>The company's differentiated pain portfolio, notably with products featuring proprietary abuse deterrent and extended release technologies (e.g., Xtampza ER's DETERx platform), is supported by industry and regulatory trends that increasingly favor safer opioid options. This likely enhances market share, pricing power, and sustains net margins as regulatory emphasis on abuse deterrence grows.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/tzlmd05y-specialty-pharmaceuticals-and-diversified-assets-will-drive-future-success-jtot\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Want to see what kind of profit margins and earnings path have to line up with that view? The most followed narrative leans on a very specific mix of modest revenue shifts, rising profitability and a future earnings multiple that is lower than many peers expect. The numbers behind that story are where the real tension sits.</p> <p><strong>Result: Fair Value of $53.67 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/tzlmd05y-specialty-pharmaceuticals-and-diversified-assets-will-drive-future-success-jtot\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, you also need to weigh risks, such as potential generic pressure on key pain brands and higher operating costs if expected Jornay PM traction does not fully show up.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-coll/collegium-pharmaceutical\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Collegium Pharmaceutical narrative.</a></p> <h2>Another View: Multiples Paint A Pricier Picture</h2> <p>So far, the story leans on cash flows and long term earnings power suggesting Collegium looks undervalued. Yet on a simpler yardstick like P/E, the stock trades around 21x, above both peers at 18.1x and a fair ratio estimate of 18.2x. This suggests there may be less room for error if growth or margins disappoint.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-coll/collegium-pharmaceutical/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/pharmaceuticals-biotech/nasdaq-coll/collegium-pharmaceutical/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:COLL P/E Ratio as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/9a27ea2f-6e12-4a81-a52d-45f720512ada/chart/pe-multiple-vs-industry?date=2026-03-01\" width=\"746\"/></a><figcaption>NasdaqGS:COLL P/E Ratio as at Mar 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>Given the mixed signals in the story so far, it makes sense to move quickly and look through the numbers yourself, weighing up both sides of the argument. To see how the current share price lines up with the balance of risks and potential rewards, take a closer look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-coll/collegium-pharmaceutical\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 2 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If this earnings update has sharpened your focus, do not stop here; broaden your watchlist with a few targeted screens that surface different kinds of opportunities.</p> <ul> <li>Spot potential bargains early by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> that pair solid fundamentals with limited market attention.</li> <li>Build a foundation of strength by checking companies in the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (39 results)</a> that prioritise robust financial footing.</li> <li>Aim for a smoother ride by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">74 resilient stocks with low risk scores</a> that score well on our risk metrics while still offering upside potential.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 20:50:56",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-coll/collegium-pharmaceutical/news/a-look-at-collegium-pharmaceutical-coll-valuation-after-mixe",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vaxcyte (PCVX) Is Up 5.5% After Unveiling VAX-31 Data, Phase 3 Plans And New Financing - Has The Bull Case Changed?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>In February 2026, Vaxcyte reported a full-year 2025 net loss of US$766.63 million and higher loss per share, while also raising roughly US$408.10 million through an at-the-market follow-on equity offering and filing additional shelf capacity linked to employee stock plans.</li> <li>Alongside these financing moves, the company highlighted unprecedented Phase 2 results for its VAX-31 pneumococcal vaccine, rapid progression into multiple Phase 3 trials, and completion of a large-scale manufacturing facility that together signal a major push toward potential commercialization of its vaccine portfolio.</li> <li>Next, we’ll examine how Vaxcyte’s unprecedented VAX-31 Phase 2 data and advancing Phase 3 program shape the company’s investment narrative.</li> </ul><p>The latest GPUs need a type of rare earth metal called Dysprosium and there are only <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 companies in the world exploring or producing it</a>. Find the list for free.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>What Is Vaxcyte's Investment Narrative?</h2><p>For Vaxcyte, the core belief you need to have as a shareholder is that its pneumococcal and broader vaccine pipeline can translate extensive cash burn today into meaningful, defensible products tomorrow. The latest update sharpens that tradeoff. On one hand, the 2025 net loss widening to US$766.63 million reinforces that this is a pure clinical-stage story with no revenue and rising operating costs. On the other, raising about US$408.10 million via an at-the-market equity program, layering on new shelf capacity tied to employee stock plans, reporting unprecedented VAX-31 Phase 2 data, moving quickly into several Phase 3 trials and finishing a large-scale manufacturing facility all feed directly into the near-term catalysts: clinical readouts, regulatory milestones and potential partnering discussions. The key risk profile also shifts slightly, with financing risk reduced for now but dilution, trial execution and commercial build-out risks front and center. Overall, the February 2026 news is material because it both extends the funding runway and accelerates the company toward its most binary events.</p> However, investors should not overlook how rising losses and ongoing dilution could affect future outcomes.\n\nVaxcyte's shares have been on the rise but are still potentially undervalued by 33%. <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-pcvx/vaxcyte/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Find out what it's worth</a>.<h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-pcvx/vaxcyte\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"PCVX 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/a5c22673-aeb2-4b4c-9e84-eb62a6baad5a/chart/quote-price\" width=\"746\"/></a><figcaption>PCVX 1-Year Stock Price Chart</figcaption></figure> Three Simply Wall St Community fair values, from US$10.90 to US$109.00, show just how far apart expectations sit. Set against escalating losses and heavier reliance on trial success, it underlines why you should weigh multiple viewpoints before deciding how Vaxcyte fits in your portfolio.<p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/pharmaceuticals-biotech/nasdaq-pcvx/vaxcyte\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 3 other fair value estimates on Vaxcyte</a> - why the stock might be worth as much as 77% more than the current price!</p><h2>Form Your Own Verdict</h2><p>Disagree with this assessment? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your Vaxcyte research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-pcvx/vaxcyte\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward and 3 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-pcvx/vaxcyte\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Vaxcyte research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Vaxcyte's overall financial health at a glance.</li></ul><h2>Contemplating Other Strategies?</h2><p>Opportunities like this don't last. These are today's most promising picks. Check them out now:</p><ul><li>Invest in the nuclear renaissance through our list of <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473644/nuclear-renaissance/global\" rel=\"noopener noreferrer\" target=\"_blank\">84 elite nuclear energy infrastructure plays</a> powering the global AI revolution.</li><li>Uncover the next big thing with <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/472945/elite-penny-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">30 elite penny stocks</a> that balance risk and reward.</li><li>The future of work is here. Discover the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 top robotics and automation stocks</a> leading the charge in AI-driven automation and industrial transformation.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:50:56",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-pcvx/vaxcyte/news/vaxcyte-pcvx-is-up-55-after-unveiling-vax-31-data-phase-3-pl",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Perdoceo Education’s (PRDO) Valuation After Earnings Growth Guidance And Dividend Affirmation",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Perdoceo Education (PRDO) drew fresh attention after reporting fourth quarter and full year 2025 earnings, issuing new 2026 guidance, and affirming its quarterly dividend, giving investors several data points to reassess the stock.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nasdaq-prdo/perdoceo-education\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Perdoceo Education.</a></p> <p>The recent earnings, 2026 guidance and dividend affirmation come after a period of steady share price strength, with a 90 day share price return of 19.83% and a 1 year total shareholder return of 32.10% supporting a much larger 3 year total shareholder return of about 2.6x.</p> <p>If this update has you looking beyond a single education stock, it could be a good time to broaden your watchlist with <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">19 top founder-led companies</a>.</p> <p>With strong recent returns, earnings growth and a dividend on the table, the key question now is whether Perdoceo’s current price still offers value or if the market is already pricing in future growth.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 20.6% Undervalued</h2> <p>Perdoceo Education's most followed narrative places fair value at $42, above the last close of $33.35. This frames the stock as materially discounted and puts the focus squarely on the earnings and enrollment story behind that gap.</p> <blockquote> <p><em>Continued expansion of high-demand, industry-aligned programs (notably in nursing, speech language therapy, and healthcare doctorate programs) and introduction of flexible learning modalities (online, in-person, hybrid) positions the company to capture premium tuition and adapt to evolving workforce upskilling needs, supporting both revenue growth and higher net margins.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/yv132eii-enrollment-trends-and-student-support-technologies-will-shape-future-education-jujp\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Want to see what powers that higher fair value, beyond recent earnings? The narrative leans heavily on specific revenue growth, margin assumptions and how future P/E levels compare with the broader Consumer Services group, but the exact thresholds might surprise you.</p> <p><strong>Result: Fair Value of $42 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/yv132eii-enrollment-trends-and-student-support-technologies-will-shape-future-education-jujp\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this depends on enrollment and margin trends holding up, and tighter regulation or rising student acquisition costs could quickly challenge that upbeat valuation story.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nasdaq-prdo/perdoceo-education\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Perdoceo Education narrative.</a></p> <h2>Next Steps</h2> <p>If the mixed signals in this story leave you on the fence, now is a good moment to check the numbers yourself and decide where you stand, including our view on <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/consumer-services/nasdaq-prdo/perdoceo-education\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If this Perdoceo update sharpened your thinking, do not stop here, use the Simply Wall St screener to uncover other ideas that could reshape your portfolio.</p> <ul> <li>Target potential mispricings by scanning a data backed list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 high quality undervalued stocks</a> that might not be getting full credit from the market yet.</li> <li>Strengthen your income stream by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> that aim to combine higher yields with balance sheet support.</li> <li>Get ahead of the crowd by checking a <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> that many investors may not be watching closely yet.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:42:04",
            "link": "https://simplywall.st/stocks/us/consumer-services/nasdaq-prdo/perdoceo-education/news/assessing-perdoceo-educations-prdo-valuation-after-earnings",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Claritev (CTEV) Is Down 42.1% After Launching $75 Million Buyback Amid Ongoing Losses - What's Changed",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Claritev Corporation recently reported past fourth-quarter 2025 sales of US$246.55 million and a net loss of US$80.57 million, alongside full-year 2025 sales of US$965.41 million and a net loss of US$284.28 million, and announced a new share repurchase program of up to US$75 million running through 2030.</li> <li>While the company remains loss-making, the year-on-year reduction in losses and the commitment to buying back shares suggest management is focused on improving financial discipline and capital allocation.</li> <li>Next, we’ll examine how Claritev’s reduced losses and new US$75 million share repurchase program may influence its existing investment narrative.</li> </ul><p>Uncover the next big thing with <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/472945/elite-penny-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">31 elite penny stocks</a> that balance risk and reward.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Claritev Investment Narrative Recap</h2><p>To own Claritev, you need to believe its healthcare analytics platform can convert a concentrated client base and ongoing digital investments into a path toward smaller losses and eventually sustainable margins. The latest results show narrower losses and modest revenue growth, but the key near term catalyst remains whether Claritev can keep reducing losses while stabilizing its balance sheet. The biggest risk is still its dependence on a few large payor and TPA relationships, and this update does not materially change that.</p> <p>The new US$75 million share repurchase program, capped at US$20 million per year through 2030, is the most relevant announcement here. It intersects directly with the near term focus on cost control and cash generation, since buybacks will draw on cash on hand and operating cash flows. For investors, the real test is whether Claritev can support this program while funding ongoing AI, cloud, and international initiatives that underpin its longer term growth catalysts.</p> <p>Yet even with shrinking losses and a buyback in place, investors still need to weigh the concentration risk in Claritev’s largest client contracts and...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/healthcare/nyse-ctev/claritev/tkit8a2w-analysts-boost-claritev-valuation-amid-growth-optimism-and-strategic-developments\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Claritev (it's free!)</a></p><p>Claritev's narrative projects $1.0 billion revenue and $90.0 million earnings by 2028. This requires 3.1% yearly revenue growth and a $753.4 million earnings increase from $-663.4 million today.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/healthcare/nyse-ctev/claritev/tkit8a2w-analysts-boost-claritev-valuation-amid-growth-optimism-and-strategic-developments\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Claritev's forecasts yield a $57.25 fair value</a>, a 325% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/healthcare/nyse-ctev/claritev\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"CTEV 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/e4284142-c859-4628-ae85-f9d61db99e60/chart/quote-price\" width=\"746\"/></a><figcaption>CTEV 1-Year Stock Price Chart</figcaption></figure> <p>By contrast, the most cautious analysts were already assuming only about 3.4 percent annual revenue growth to roughly US$1.0 billion and no near term profitability, so this earnings and buyback update could either reinforce their concerns about margin pressure from rising costs or gradually challenge that view, depending on how you interpret Claritev’s progress and which risks you think matter most.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/healthcare/nyse-ctev/claritev\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 2 other fair value estimates on Claritev</a> - why the stock might be a potential multi-bagger!</p><h2>The Verdict Is Yours</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Claritev research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/healthcare/nyse-ctev/claritev\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward and 3 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/healthcare/nyse-ctev/claritev\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Claritev research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Claritev's overall financial health at a glance.</li></ul><h2>Searching For A Fresh Perspective?</h2><p>Every day counts. These free picks are already gaining attention. See them before the crowd does:</p><ul><li>Find <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 companies with promising cash flow potential yet trading below their fair value</a>.</li><li>The latest GPUs need a type of rare earth metal called Neodymium and there are only <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 companies in the world exploring or producing it</a>. Find the list for free.</li><li>The future of work is here. Discover the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 top robotics and automation stocks</a> leading the charge in AI-driven automation and industrial transformation.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 20:42:03",
            "link": "https://simplywall.st/stocks/us/healthcare/nyse-ctev/claritev/news/claritev-ctev-is-down-421-after-launching-75-million-buyback",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Chartwell Retirement Residences (TSX:CSH.UN) Valuation After Its Multi‑Year Share Price Momentum",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Why Chartwell Retirement Residences is on investors’ radar</h2> <p>Chartwell Retirement Residences (TSX:CSH.UN) has drawn investor attention after a period of steady share price gains, with the unit price recently closing at CA$22.22 and showing solid returns across multiple time frames.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/ca/healthcare/tsx-csh.un/chartwell-retirement-residences-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Chartwell Retirement Residences.</a></p> <p>Those recent moves come on top of a 9.9% 1 month share price return and an 11.7% year to date share price return. The 1 year total shareholder return of 36.6% and very large 3 and 5 year total shareholder returns suggest momentum has been building over several years rather than just in the latest rally.</p> <p>If Chartwell’s run has you thinking more broadly about where capital could work hardest next, it may be worth scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_healthcare_ai\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/ca\" rel=\"noopener noreferrer\" target=\"_blank\">4 healthcare AI stocks</a> for fresh ideas across the sector.</p> <p>With Chartwell generating revenue of CA$1.11b and net income of CA$29.41m, and trading only slightly below a CA$23.70 analyst price target, it is worth asking whether there is still a buying opportunity here or whether the market is already pricing in future growth.</p> <h2>Most Popular Narrative: 3.6% Undervalued</h2> <p>On the most followed narrative, Chartwell’s fair value comes out at CA$23.05, a touch above the CA$22.22 last close. This puts the focus on what assumptions are doing the heavy lifting.</p> <blockquote> <p><em>Chartwell's financial results and guidance point to a sustained increase in demand for senior housing, driven by a rapidly growing seniors population and persistent supply constraints, supporting rising occupancy and driving long term revenue and NOI growth. The company is executing on a strategy of acquiring and developing newer, larger, and more operationally efficient properties expected to produce higher occupancy rates, greater per suite NOI, and enhanced margins as lease ups mature.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/q5a1jmtt-senior-housing-demand-will-build-sustained-market-leadership-5fl7\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what sits behind that CA$23.05 figure? The narrative leans on robust top line expansion, firmer margins, and a rich future earnings multiple that is described as anything but conservative.</p> <p><strong>Result: Fair Value of CA$23.05 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/q5a1jmtt-senior-housing-demand-will-build-sustained-market-leadership-5fl7\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, the picture could change if elevated leverage and refinancing costs squeeze margins, or if higher labour expenses erode the modest profit improvements that analysts are banking on.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/ca/healthcare/tsx-csh.un/chartwell-retirement-residences-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Chartwell Retirement Residences narrative.</a></p> <h2>Another angle: rich sales multiple vs fair ratio</h2> <p>The AI fair value story leans toward modest undervaluation, but the sales multiple tells a different tale. Chartwell trades on a P/S of 6.4x, far above the North American Healthcare industry at 1.2x and peers at 1.3x, and well ahead of its own fair ratio of 3.5x.</p> <p>That gap suggests the market is already paying a premium for future growth. This leaves less room for error if margins, interest costs or occupancy do not line up with expectations. How comfortable are you paying almost double the fair ratio for that growth story?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/ca/healthcare/tsx-csh.un/chartwell-retirement-residences-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/ca/healthcare/tsx-csh.un/chartwell-retirement-residences-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSX:CSH.UN P/S Ratio as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/98b989bf-47b7-42e2-9ef4-25adfac3feb0/chart/ps-multiple-vs-industry?date=2026-03-01\" width=\"746\"/></a><figcaption>TSX:CSH.UN P/S Ratio as at Mar 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>Mixed signals or a clear story: this is a good moment to look under the hood yourself and move quickly rather than follow the crowd. To understand how the positives stack up against the concerns, take a look at the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/ca/healthcare/tsx-csh.un/chartwell-retirement-residences-shares\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 3 important warning signs</a> and weigh the trade off for your own portfolio.</p> <h2>Looking for more investment ideas?</h2> <p>If Chartwell has sharpened your focus, do not stop here. Your next strong idea could be waiting just outside your current watchlist.</p> <ul> <li>Spot potential value opportunities early by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">8 high quality undervalued stocks</a> and see which businesses currently look priced below what their fundamentals suggest.</li> <li>Strengthen your portfolio’s foundations with companies from the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/ca\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (10 results)</a> that combine financial resilience with underlying business quality.</li> <li>Boost your income watchlist by reviewing the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/ca\" rel=\"noopener noreferrer\" target=\"_blank\">5 dividend fortresses</a> and find yields that could complement holdings like Chartwell.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 20:42:03",
            "link": "https://simplywall.st/stocks/ca/healthcare/tsx-csh.un/chartwell-retirement-residences-shares/news/assessing-chartwell-retirement-residences-tsxcshun-valuation",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nidec (TSE:6594) Is Up 7.0% After Earnings Beat And Founder Exit During Accounting Probe",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Nidec Corporation recently reported a Q3 earnings beat with upgraded guidance and a sharper focus on stabilizing margins in its industrial and automotive businesses, while founder Shigenobu Nagamori resigned as Chairman Emeritus amid an ongoing third-party accounting probe.</li> <li>Together, improved operational signals and a governance reset during the probe mark an important moment for assessing Nidec’s earnings quality and corporate oversight.</li> <li>Next, we’ll explore how Nagamori’s resignation during the accounting probe reshapes Nidec’s existing investment narrative and risk‑reward profile.</li> </ul><p>Invest in the nuclear renaissance through our list of <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473644/nuclear-renaissance/global\" rel=\"noopener noreferrer\" target=\"_blank\">84 elite nuclear energy infrastructure plays</a> powering the global AI revolution.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Nidec Investment Narrative Recap</h2><p>To own Nidec, you need to believe its restructuring, cost cuts, and exposure to electrification and data centers can translate into stronger, cleaner earnings despite cyclical end markets. Right now, the most important near term catalyst is clarity from the accounting probe, because it directly affects confidence in Nidec’s reported margins and cash flows. The biggest risk is that any control weaknesses or legal findings prove deeper than currently known and weigh on profitability.</p> <p>Against that backdrop, the latest Q3 earnings beat and upgraded guidance matter because they show progress on margin stabilization in industrial motors and automotive, which sits at the core of the restructuring story. Stronger earnings and cash flow provide more flexibility for Nidec to keep investing in motors for data centers and EVs while absorbing any near term costs related to governance reforms and potential compliance fixes.</p> <p>Yet investors should also be aware that the ongoing trade compliance investigations could still...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/jp/capital-goods/tse-6594/nidec-shares/ahdigll5-6594-new-arkansas-expansion-will-drive-positive-momentum-into-2027\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Nidec (it's free!)</a></p><p>Nidec's narrative projects ¥2,893.2 billion revenue and ¥247.5 billion earnings by 2028. This requires 3.7% yearly revenue growth and about a ¥90.1 billion earnings increase from ¥157.4 billion today.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/jp/capital-goods/tse-6594/nidec-shares/ahdigll5-6594-new-arkansas-expansion-will-drive-positive-momentum-into-2027\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Nidec's forecasts yield a ¥2995 fair value</a>, a 22% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/jp/capital-goods/tse-6594/nidec-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSE:6594 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/040c61a6-455f-4a12-9141-627a6be40a0b/chart/quote-price\" width=\"746\"/></a><figcaption>TSE:6594 1-Year Stock Price Chart</figcaption></figure> <p>Some analysts were far more optimistic, assuming revenue could reach about ¥3,030.4 billion and earnings about ¥285.8 billion by 2028, but the latest governance shock may prompt you to rethink how realistic that path looks and whether the probe and chairman’s exit change the balance between upside from restructuring and the risk that compliance issues keep margins under pressure.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/jp/capital-goods/tse-6594/nidec-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 4 other fair value estimates on Nidec</a> - why the stock might be worth as much as 67% more than the current price!</p><h2>Form Your Own Verdict</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your Nidec research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/jp/capital-goods/tse-6594/nidec-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/jp/capital-goods/tse-6594/nidec-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Nidec research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Nidec's overall financial health at a glance.</li></ul><h2>Contemplating Other Strategies?</h2><p>Our daily scans reveal stocks with breakout potential. Don't miss this chance:</p><ul><li>Rare earth metals are the new gold rush. Find out which <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 stocks are leading the charge</a>.</li><li>The best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 smaller AI-focused companies with strong growth potential</a> through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.</li><li>Capitalize on the AI infrastructure supercycle with our selection of the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473744/ai-infrastructure-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">34 best 'picks and shovels' of the AI gold rush</a> converting record-breaking demand into massive cash flow.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Nidec might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/jp/capital-goods/tse-6594/nidec-shares/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 20:42:03",
            "link": "https://simplywall.st/stocks/jp/capital-goods/tse-6594/nidec-shares/news/nidec-tse6594-is-up-70-after-earnings-beat-and-founder-exit",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is EyePoint (EYPT) Recasting Its Ophthalmology Playbook With a Veteran Launch Executive at DURAVYU?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>EyePoint, Inc. recently appointed Michael Campbell as Chief Commercial Officer, giving him responsibility for commercial strategy and launch preparation for DURAVYU, its Phase 3 retinal disease candidate. </li> <li>The hire brings in a leader who helped shape the commercial playbooks behind Lucentis, Xiidra, Beovu and Tyrvaya, directly relevant to DURAVYU’s target markets. </li> <li>We’ll now examine how adding a veteran ophthalmology launch executive to oversee DURAVYU’s commercialization may influence EyePoint’s broader investment narrative. </li> </ul><p>Uncover the next big thing with <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/472945/elite-penny-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">31 elite penny stocks</a> that balance risk and reward.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>EyePoint Investment Narrative Recap</h2><p>To own EyePoint today, you really have to believe DURAVYU can graduate from a Phase 3 program into a meaningful commercial franchise before cash burn becomes overwhelming. The Michael Campbell hire directly targets the key short term catalyst, a potential DURAVYU launch, but it does not change the fact that any delay or disappointment in the pivotal trials remains the central risk for a company with minimal current revenue.</p> <p>Among recent announcements, the Phase 3 DURAVYU update following the second DSMC review in November 2025 is most relevant here, because it kept the pivotal program on track toward potential commercialization. Campbell’s arrival now sits on top of that clinical backdrop, linking trial progress with an increasingly built out launch and manufacturing footprint, which together frame both the upside catalyst of a successful entry into wet AMD and DME and the execution risk if uptake proves slower than expected.</p> <p>Yet against that excitement, investors should be aware that...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint/nwrya9z6-phase-iii-trials-in-wet-amd-will-expand-market-reach-ncqs\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on EyePoint (it's free!)</a></p><p>EyePoint's narrative projects $146.7 million revenue and $34.1 million earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint/nwrya9z6-phase-iii-trials-in-wet-amd-will-expand-market-reach-ncqs\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how EyePoint's forecasts yield a $36.08 fair value</a>, a 105% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"EYPT 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3922204e-9934-411a-90c5-e170feacb161/chart/quote-price\" width=\"746\"/></a><figcaption>EYPT 1-Year Stock Price Chart</figcaption></figure> <p>Some of the lowest estimate analysts were assuming only about 7.9% annual revenue growth and ongoing losses, so compared with those views, you should see Campbell’s appointment and the Phase III dependence as parts of a much more cautious story that might look different once updated forecasts reflect this new hire.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 3 other fair value estimates on EyePoint</a> - why the stock might be worth just $36.08!</p><h2>Reach Your Own Conclusion</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your EyePoint research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 3 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint\" rel=\"noopener noreferrer\" target=\"_blank\">Our free EyePoint research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate EyePoint's overall financial health at a glance.</li></ul><h2>Want Some Alternatives?</h2><p>Right now could be the best entry point. These picks are fresh from our daily scans. Don't delay:</p><ul><li>The latest GPUs need a type of rare earth metal called Neodymium and there are only <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 companies in the world exploring or producing it</a>. Find the list for free.</li><li>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">27 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</li><li>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if EyePoint might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 20:37:07",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-eypt/eyepoint/news/is-eyepoint-eypt-recasting-its-ophthalmology-playbook-with-a",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A Look At Aisin (TSE:7259) Valuation After Leadership Transition At The Top",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Leadership change as a fresh lens on Aisin stock</h2> <p>Aisin (TSE:7259) is back in focus after its Board of Directors decided to change the company’s representative directors, putting a leadership transition at the center of the investment story.</p> <p>From April 1, 2026, Yoshihisa Yamamoto is set to become Executive Vice President and Representative Director, while Shintaro Ito plans to retire from senior executive roles and be proposed as an Audit &amp; Supervisory Board Member at the June 2026 shareholders’ meeting.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/jp/automobiles/tse-7259/aisin-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Aisin.</a></p> <p>The leadership reshuffle comes after a mixed price backdrop, with the 1 day share price return of 2.39% and 7 day return of 3.64% sitting against a year to date share price decline of 7.47%. At the same time, longer term total shareholder returns of 61.69% over one year and 168.29% over five years point to gains that investors will compare with current expectations.</p> <p>If this leadership news has you thinking more broadly about where growth could come from in mobility and manufacturing, it might be worth scanning <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_robotics\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 robotics and automation stocks</a> as a fresh set of ideas to review next.</p> <p>With Aisin trading at ¥2,779.5 and sitting at an estimated 45% discount to one intrinsic value measure and around 9% below the average analyst price target, is there still a buying opportunity here, or is the market already pricing in future growth?</p> <h2>Preferred P/E of 12.2x: Is it justified?</h2> <p>Aisin's current P/E of 12.2x sits at an interesting crossroads, with the shares at ¥2,779.5 and various signals pointing in different directions compared with both peers and an internally estimated fair ratio.</p> <p>The P/E multiple compares the company’s share price with its earnings per share, so it essentially reflects what investors are currently willing to pay for each unit of profit. For an auto components group like Aisin, this is a common yardstick because earnings are a direct link to its large base of recurring supply contracts and exposure to vehicle production volumes.</p> <p>Here, the picture is mixed. On one hand, Aisin is described as expensive versus the broader JP Auto Components industry average P/E of 11.4x, which suggests the market is paying a premium relative to many sector peers. On the other hand, the same 12.2x P/E is assessed as good value compared with an estimated fair P/E of 15.5x, as well as against a peer average of 19.3x in a separate comparison. Those reference points imply that if valuations shifted closer to the higher peer averages or the fair ratio, the multiple could move up from current levels rather than down.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"fair_ratio_cta\" href=\"https://www.simplywall.st/stocks/jp/automobiles/tse-7259/aisin-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Explore the SWS fair ratio for Aisin</a></p> <p><strong>Result: Price-to-earnings of 12.2x (UNDERVALUED)</strong></p> <p>However, investors still need to watch for any slowdown in annual revenue and net income growth and for how the leadership shift affects execution on Aisin's broad product portfolio.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/jp/automobiles/tse-7259/aisin-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Aisin narrative.</a></p> <h2>Another view on Aisin's value using our DCF model</h2> <p>The P/E story suggests some room for upside, but our DCF model presents a stronger valuation case. On this measure, Aisin at ¥2,779.5 is trading at a 45.4% discount to an estimated future cash flow value of ¥5,091.84. This indicates a wider potential value gap.</p> <p>Such a gap can reflect genuine mispricing, or it can suggest that the market is more cautious about long term cash flows than the model assumes. Which side do you think has it right?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/jp/automobiles/tse-7259/aisin-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/jp/automobiles/tse-7259/aisin-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"7259 Discounted Cash Flow as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/cd6c662b-4e1c-44a0-9aaa-494fb21fb423/chart/dcf?date=2026-03-01\" width=\"746\"/></a><figcaption>7259 Discounted Cash Flow as at Mar 2026</figcaption></figure><p> </p><p>Simply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (<a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://www.simplywall.st/stocks/jp/automobiles/tse-7259/aisin-shares\" rel=\"noopener noreferrer\" target=\"_blank\">check out Aisin for example</a>). We show the entire calculation in full. You can track the result in your <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted when this changes, or use our stock screener to discover <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/jp\" rel=\"noopener noreferrer\" target=\"_blank\">20 high quality undervalued stocks</a>. If you <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">save a screener</a> we even alert you when new companies match - so you never miss a potential opportunity.</p> <h2>Next Steps</h2> <p>The mix of potential upside and clear risks is hard to ignore, so take a moment to review the details yourself and move quickly if you want to shape your own view. Start with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/jp/automobiles/tse-7259/aisin-shares\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 1 important warning sign</a>.</p> <h2>Ready for more investment ideas?</h2> <p>If you stop with just one stock on your radar, you could miss other opportunities that better fit your goals, risk comfort and income needs.</p> <ul> <li>Target potential mispricings by scanning <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/jp\" rel=\"noopener noreferrer\" target=\"_blank\">20 high quality undervalued stocks</a> that pair solid fundamentals with price tags that may not fully reflect their underlying businesses yet.</li> <li>Build a steadier income stream by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/jp\" rel=\"noopener noreferrer\" target=\"_blank\">12 dividend fortresses</a> that focus on higher yields and balance sheet support for those payouts.</li> <li>Stay on the front foot with <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/jp\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 58 high quality undiscovered gems</a> that highlight quality names many investors may not be watching closely yet.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:37:06",
            "link": "https://simplywall.st/stocks/jp/automobiles/tse-7259/aisin-shares/news/a-look-at-aisin-tse7259-valuation-after-leadership-transitio",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Will A++ Upgrade and New Debt Deal Change RLI's (RLI) Risk‑Reward Narrative for Investors?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>In late February 2026, RLI Corp. completed a US$300 million fixed-rate senior unsecured bond offering of 5.375% Notes due June 1, 2036, following a new debt shelf registration and alongside a board decision to maintain its quarterly dividend at US$0.16 per share, extending a 50-year dividend increase streak. </li> <li>A recent AM Best upgrade of RLI Group’s financial strength rating to A++, coupled with an equity-backed partnership with AI-focused insurer Kettle to launch a new multi-peril commercial property product including wildfire coverage, highlights both balance sheet strength and a push into more specialized, technology-enabled insurance solutions. </li> <li>We’ll now examine how the AM Best upgrade to A++ reshapes RLI’s existing investment narrative and risk-reward trade-offs for investors.</li> </ul><p>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>RLI Investment Narrative Recap</h2><p>To own RLI, you have to be comfortable with a specialty insurer that leans heavily on underwriting discipline, a strong balance sheet and steady capital return. Right now, the main near term catalyst is whether underwriting profitability can stay resilient as commercial property conditions soften, while the biggest risk remains higher catastrophe losses and volatility in property results. The AM Best upgrade and new bond issue support financial flexibility, but do not fundamentally change that risk profile in the short term.</p> <p>Among the recent announcements, the AM Best upgrade to A++ stands out as most relevant. A higher financial strength rating can support RLI’s ability to write specialty business and access reinsurance on better terms, which matters if catastrophe claims stay elevated. Coupled with the Kettle partnership on multi peril property including wildfire, it ties directly into the key catalyst of maintaining attractive margins while taking on complex climate exposed risks.</p> <p>Yet, while the rating upgrade looks reassuring, investors should also be aware of how rising catastrophe exposure could still...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/insurance/nyse-rli/rli/9jnythxt-rli-future-performance-will-be-supported-by-strong-operational-execution\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on RLI (it's free!)</a></p><p>RLI's narrative projects $1.9 billion revenue and $297.9 million earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/insurance/nyse-rli/rli/9jnythxt-rli-future-performance-will-be-supported-by-strong-operational-execution\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how RLI's forecasts yield a $59.75 fair value</a>, a 4% downside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/insurance/nyse-rli/rli\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"RLI 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/7a39d565-7db6-41e4-bfa5-9e5fa29b07bf/chart/quote-price\" width=\"746\"/></a><figcaption>RLI 1-Year Stock Price Chart</figcaption></figure> <p>Some of the most optimistic analysts saw RLI reaching about US$1.9 billion of revenue and US$345.9 million of earnings, but the new A++ rating and wildfire exposed products could either support that upbeat view or highlight how much their optimism depends on underwriting and catastrophe risk not breaking the thesis you just read about.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/insurance/nyse-rli/rli\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 2 other fair value estimates on RLI</a> - why the stock might be worth just $59.75!</p><h2>The Verdict Is Yours</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your RLI research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/insurance/nyse-rli/rli\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 2 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/insurance/nyse-rli/rli\" rel=\"noopener noreferrer\" target=\"_blank\">Our free RLI research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate RLI's overall financial health at a glance.</li></ul><h2>Ready For A Different Approach?</h2><p>Early movers are already taking notice. See the stocks they're targeting before they've flown the coop:</p><ul><li>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">27 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</li><li>This technology could replace computers: discover <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/282/quantum-computing-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 stocks that are working to make quantum computing a reality</a>.</li><li>Outshine the giants: these <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 early-stage AI stocks could fund your retirement</a>.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 20:37:06",
            "link": "https://simplywall.st/stocks/us/insurance/nyse-rli/rli/news/will-a-upgrade-and-new-debt-deal-change-rlis-rli-riskreward",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Greif (GEF) Valuation As Mixed Near‑Term Returns Contrast With Longer‑Term Gains",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Greif stock moves and recent performance snapshot</h2> <p>Greif (GEF) has attracted fresh attention after a period of mixed short term returns, including a 0.1% one day slip and a 2.6% decline over the past week, alongside positive longer term performance.</p> <p>With the shares last closing at US$72.67 and total return figures of 3% over the past month and 9.4% over the past 3 months, investors are reassessing how this industrial packaging company fits into their portfolios.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-gef/greif\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Greif.</a></p> <p>Greif’s recent share price pullback over the past week sits against a stronger backdrop, with positive share price returns over the past quarter and year and a solid 1 year total shareholder return of 31.5% suggesting earlier optimism is being reassessed rather than reversed.</p> <p>If this shift in momentum has you thinking about where else capital could work hard, it may be worth scanning our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">19 top founder-led companies</a> as a starting point for fresh ideas.</p> <p>With Greif trading at US$72.67, sitting below the US$80.20 analyst price target and suggesting a roughly 53% intrinsic discount, you have to ask: is this a genuine value gap or is the market already factoring in future growth?</p> <h2>Most Popular Narrative: 8.7% Undervalued</h2> <p>Greif’s most followed narrative places fair value at $79.60, above the last close at $72.67, which sets up a clear valuation gap for investors to weigh.</p> <blockquote> <p><em>The company's investment and expansion in polymer-based packaging (with strong end-market demand in agrochemicals, pharma, food &amp; beverage, and flavor &amp; fragrance) directly positions Greif to benefit from the ongoing expansion of global manufacturing, logistics, and e-commerce, supporting sustainable top-line revenue growth.</em></p> </blockquote> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/000ok5yw-gef-balance-sheet-flexibility-and-asset-sales-will-drive-future-momentum\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Curious what turns that growth story into a higher fair value? The narrative leans on changing margins, a reset revenue path, and a richer future earnings multiple. Want the full picture yet?</p> <p><strong>Result: Fair Value of $79.60 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/000ok5yw-gef-balance-sheet-flexibility-and-asset-sales-will-drive-future-momentum\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, you also need to factor in softer volumes in key packaging segments and execution risk if targeted polymer end markets or containerboard pricing do not play out as expected.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-gef/greif\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Greif narrative.</a></p> <h2>Another Angle On Valuation: Earnings Multiple Sends A Different Signal</h2> <p>While the popular narrative points to an 8.7% undervaluation, the current P/E of 22.2x sits above the fair ratio of 17.3x, the North American packaging average of 21.2x, and the peer average of 20.1x. That richer multiple can mean less room for error if growth expectations slip. Which signal do you trust more?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-gef/greif/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/materials/nyse-gef/greif/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:GEF P/E Ratio as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/6adfc0be-7f92-4c6e-83e1-0f0cfa79593b/chart/pe-multiple-vs-industry?date=2026-03-01\" width=\"746\"/></a><figcaption>NYSE:GEF P/E Ratio as at Mar 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>Seeing mixed signals on Greif and wondering what it really adds up to for you? Act while the data is fresh and shape your own view by weighing its <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-gef/greif\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 3 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If Greif has sparked your interest, do not stop here. Your next strong idea could be one smart screener away on Simply Wall St.</p> <ul> <li>Target value opportunities by scanning companies our screener flags as <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 high quality undervalued stocks</a> with solid fundamentals already laid out for you.</li> <li>Prioritise resilience first and shortlist businesses identified as <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">74 resilient stocks with low risk scores</a> so you can focus your research where risk scores already look more controlled.</li> <li>Hunt for lesser known prospects through our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> before the crowd starts paying attention.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:37:06",
            "link": "https://simplywall.st/stocks/us/materials/nyse-gef/greif/news/assessing-greif-gef-valuation-as-mixed-nearterm-returns-cont",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Did Stronger 2025 Results and a Steady Dividend Just Shift Tootsie Roll Industries' (TR) Investment Narrative?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Tootsie Roll Industries, Inc. has reported its full-year 2025 results, with sales of US$7.85 million, revenue of US$732.52 million, and net income of US$100.05 million, while also affirming a quarterly dividend of US$0.09 per share payable on March 27, 2026.</li> <li>The increase in both revenue and net income, alongside higher basic earnings per share from continuing operations, points to improved profitability and operating efficiency.</li> <li>We’ll explore how this earnings growth and dividend affirmation shape Tootsie Roll Industries’ investment narrative for shareholders and prospective investors.</li> </ul><p>The best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 smaller AI-focused companies with strong growth potential</a> through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>What Is Tootsie Roll Industries' Investment Narrative?</h2><p>For someone considering Tootsie Roll Industries today, the big picture is about owning a slow-and-steady confectionery business that can convert brand familiarity into consistent earnings and dependable cash generation. The latest full-year 2025 results show higher revenue and net income, with basic EPS up to US$1.37, which helps validate that story after a flatter profit track record. The affirmed US$0.09 quarterly dividend reinforces a message of stability rather than signaling any major shift in capital allocation, so it is unlikely to change the near term catalysts in a material way. Instead, the more immediate focus remains on how the company manages input costs, protects margins, and justifies a relatively rich earnings multiple after a strong 12‑month total return. The recent results support confidence, but they also raise the bar for expectations.</p> However, that higher valuation makes any stumble on margins or demand more painful for shareholders to absorb.\nTootsie Roll Industries' shares are on the way up, but they could be overextended by 10%. <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/us/food-beverage-tobacco/nyse-tr/tootsie-roll-industries/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover the fair value now</a>.<h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/food-beverage-tobacco/nyse-tr/tootsie-roll-industries\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TR 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/9f8185b7-359c-4591-99fd-ca67babeda42/chart/quote-price\" width=\"746\"/></a><figcaption>TR 1-Year Stock Price Chart</figcaption></figure> <p>Simply Wall St Community members currently offer just one fair value view at about US$38.53, giving you a single reference point rather than a broad range of opinions. Set against a stock that has already delivered a strong 1‑year total return, this limited spread in community estimates puts more emphasis on understanding the business risks and catalysts before deciding how optimistic you want to be.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/food-beverage-tobacco/nyse-tr/tootsie-roll-industries\" rel=\"noopener noreferrer\" target=\"_blank\">Explore another fair value estimate on Tootsie Roll Industries</a> - why the stock might be worth 9% less than the current price!</p><h2>Form Your Own Verdict</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Tootsie Roll Industries research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/food-beverage-tobacco/nyse-tr/tootsie-roll-industries\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/food-beverage-tobacco/nyse-tr/tootsie-roll-industries\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Tootsie Roll Industries research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Tootsie Roll Industries' overall financial health at a glance.</li></ul><h2>Interested In Other Possibilities?</h2><p>Our top stock finds are flying under the radar-for now. Get in early:</p><ul><li>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">27 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</li><li>Uncover the next big thing with <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/472945/elite-penny-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">31 elite penny stocks</a> that balance risk and reward.</li><li>The latest GPUs need a type of rare earth metal called Neodymium and there are only <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 companies in the world exploring or producing it</a>. Find the list for free.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Tootsie Roll Industries might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/food-beverage-tobacco/nyse-tr/tootsie-roll-industries/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 20:31:44",
            "link": "https://simplywall.st/stocks/us/food-beverage-tobacco/nyse-tr/tootsie-roll-industries/news/did-stronger-2025-results-and-a-steady-dividend-just-shift-t",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Investors Are Reacting To Sila Realty Trust (SILA) Softer Earnings And Steady US$0.40 Dividend",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Sila Realty Trust, Inc. reported past fourth-quarter and full-year 2025 results showing higher revenue of US$50.7 million for the quarter and US$197.54 million for the year, but lower net income of US$5.02 million and US$33.12 million respectively, while funds from operations reached US$30.4 million in Q4 and US$120.9 million for 2025.</li> <li>Alongside these earnings, the board approved a US$0.40 per-share quarterly dividend and highlighted high occupancy, strong lease retention, and active healthcare property acquisitions and redevelopments, underlining a focus on necessity-based healthcare real estate and portfolio optimization.</li> <li>Against this backdrop, we’ll examine how the earnings softness alongside the maintained US$0.40 dividend reshapes Sila Realty Trust’s investment narrative.</li> </ul><p>Uncover the next big thing with <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/472945/elite-penny-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">31 elite penny stocks</a> that balance risk and reward.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Sila Realty Trust Investment Narrative Recap</h2><p>To own Sila Realty Trust, you need to be comfortable with a focused bet on necessity-based healthcare real estate and long-term, net lease cash flows. The latest results show revenue growth but softer net income, while funds from operations remain solid and the US$0.40 dividend is maintained. This combination does not materially change the near term catalyst of portfolio growth through acquisitions and redevelopments, but it does keep interest expense and earnings pressure as key risks to watch.</p> <p>The most relevant recent announcement is the board’s decision to affirm another US$0.40 quarterly dividend alongside 2025 results. For income-focused shareholders, that payout, backed by funds from operations of US$30.4 million in Q4 and US$120.9 million for 2025, ties directly into the core catalyst of stable, healthcare-driven cash flows, even as higher interest costs and lower net income remind you that the dividend is ultimately dependent on...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/real-estate/nyse-sila/sila-realty-trust/gk7v0w6n-growing-outpatient-demand-will-drive-healthcare-facility-expansion-3dce\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Sila Realty Trust (it's free!)</a></p><p>Sila Realty Trust's narrative projects $243.6 million revenue and $54.7 million earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/real-estate/nyse-sila/sila-realty-trust/gk7v0w6n-growing-outpatient-demand-will-drive-healthcare-facility-expansion-3dce\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Sila Realty Trust's forecasts yield a $29.62 fair value</a>, a 15% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/real-estate/nyse-sila/sila-realty-trust\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"SILA 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/ad96aacf-77f4-40c7-a8ba-e616f07b38c1/chart/quote-price\" width=\"746\"/></a><figcaption>SILA 1-Year Stock Price Chart</figcaption></figure> <p>Some of the lowest ranked analysts were already modeling only about US$241.8 million of revenue and US$48.0 million of earnings by 2029, so this softer quarter and ongoing acquisition and redevelopment risk could either validate their caution or prompt a rethink, depending on how you view Sila’s balance between growth and tenant resilience.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/real-estate/nyse-sila/sila-realty-trust\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 2 other fair value estimates on Sila Realty Trust</a> - why the stock might be worth over 2x more than the current price!</p><h2>The Verdict Is Yours</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Sila Realty Trust research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/real-estate/nyse-sila/sila-realty-trust\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 3 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/real-estate/nyse-sila/sila-realty-trust\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Sila Realty Trust research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Sila Realty Trust's overall financial health at a glance.</li></ul><h2>Curious About Other Options?</h2><p>These stocks are moving-our analysis flagged them today. Act fast before the price catches up:</p><ul><li>The best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 smaller AI-focused companies with strong growth potential</a> through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.</li><li>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</li><li>Invest in the nuclear renaissance through our list of <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473644/nuclear-renaissance/global\" rel=\"noopener noreferrer\" target=\"_blank\">84 elite nuclear energy infrastructure plays</a> powering the global AI revolution.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:31:44",
            "link": "https://simplywall.st/stocks/us/real-estate/nyse-sila/sila-realty-trust/news/how-investors-are-reacting-to-sila-realty-trust-sila-softer",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Investors Are Reacting To Rogers (ROG) Net Loss, Softer Sales And Completed Buyback Program",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>In February 2026, Rogers Corporation reported full-year 2025 results showing sales of US$810.8 million versus US$830.1 million a year earlier and a net loss of US$61.8 million, alongside first-quarter 2026 sales guidance of US$193 million to US$208 million. </li> <li>The company also disclosed that it has completed a long-running buyback program, repurchasing 2,120,103 shares, or 11.48% of its share count, for US$147.44 million since 2015, which may influence how investors weigh recent losses against capital return. </li> <li>We will now examine how the swing to a net loss and new quarterly sales guidance affect Rogers’ existing investment narrative. </li> </ul><p>Capitalize on the AI infrastructure supercycle with our selection of the <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473744/ai-infrastructure-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">34 best 'picks and shovels' of the AI gold rush</a> converting record-breaking demand into massive cash flow.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Rogers Investment Narrative Recap</h2><p>To own Rogers today, you need to believe its materials portfolio can still benefit from long-term electrification and high-performance electronics, despite near-term earnings volatility. The swing to a US$61.8 million net loss makes execution risk around restructuring and cost savings more immediate, but does not fundamentally change the key near-term catalyst: progress on returning core operations to consistent profitability. The biggest risk remains that EV-related weakness and restructuring drag out longer than expected, prolonging losses.</p> <p>Among the recent announcements, the completion of the multi-year share repurchase program is most relevant here. Buying back 2,120,103 shares, or 11.48% of the share base for US$147.44 million, slightly amplifies the impact of any future earnings recovery on a per-share basis, but it also sharpens focus on whether the new quarterly sales guidance of US$193 million to US$208 million is a step toward stabilizing results or a prelude to further...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/tech/nyse-rog/rogers/jjp5kfkp-analyst-maintains-rogers-price-target-amid-stable-valuation-and-modest-profit-margin-adjustment\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Rogers (it's free!)</a></p><p>Rogers’ narrative projects $921.6 million revenue and $83.3 million earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/tech/nyse-rog/rogers/jjp5kfkp-analyst-maintains-rogers-price-target-amid-stable-valuation-and-modest-profit-margin-adjustment\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Rogers' forecasts yield a $124.33 fair value</a>, a 15% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/tech/nyse-rog/rogers\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ROG 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/a6f41413-9bad-48be-bc64-776d511e4c77/chart/quote-price\" width=\"746\"/></a><figcaption>ROG 1-Year Stock Price Chart</figcaption></figure> <p>By contrast, the most bullish analysts were assuming revenue could reach about US$1.0 billion and earnings near US$318.0 million, which is far more optimistic than the curamik restructuring risk highlighted earlier, and you should recognize that views like this may shift meaningfully after the latest net loss and guidance.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/tech/nyse-rog/rogers\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 2 other fair value estimates on Rogers</a> - why the stock might be worth as much as 15% more than the current price!</p><h2>The Verdict Is Yours</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your Rogers research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/tech/nyse-rog/rogers\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward and 1 important warning sign</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/tech/nyse-rog/rogers\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Rogers research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Rogers' overall financial health at a glance.</li></ul><h2>Interested In Other Possibilities?</h2><p>Right now could be the best entry point. These picks are fresh from our daily scans. Don't delay:</p><ul><li>Invest in the nuclear renaissance through our list of <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473644/nuclear-renaissance/global\" rel=\"noopener noreferrer\" target=\"_blank\">84 elite nuclear energy infrastructure plays</a> powering the global AI revolution.</li><li>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</li><li>Uncover the next big thing with <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/472945/elite-penny-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">31 elite penny stocks</a> that balance risk and reward.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 20:31:44",
            "link": "https://simplywall.st/stocks/us/tech/nyse-rog/rogers/news/how-investors-are-reacting-to-rogers-rog-net-loss-softer-sal",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why Kodiak Gas Services (KGS) Is Up 7.8% After Record 2025 Results And Power Push",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Kodiak Gas Services recently reported fourth-quarter 2025 revenue of US$332.87 million and net income of US$24.63 million, capping a record full year with US$1.31 billion in revenue and US$80.52 million in net income.</li> <li>The company paired this strong performance with a US$6.34 million long-lived asset impairment and the announcement of an expansion into power generation through acquiring Distributed Power Solutions, supported by technology-driven efficiency gains and higher dividends.</li> <li>We’ll now examine how Kodiak’s record 2025 results and move into power generation through Distributed Power Solutions affect its investment narrative.</li> </ul><p>Invest in the nuclear renaissance through our list of <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473644/nuclear-renaissance/global\" rel=\"noopener noreferrer\" target=\"_blank\">84 elite nuclear energy infrastructure plays</a> powering the global AI revolution.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Kodiak Gas Services Investment Narrative Recap</h2><p>To own Kodiak Gas Services, you need to believe its large horsepower compression and emerging power generation platform can stay heavily utilized while covering a still-demanding capital and dividend profile. The latest results reinforce that 2025 was a record year, but the asset impairment and continued supply chain constraints do not materially change the near term catalyst, which remains execution on growth projects without eroding margins, nor the key risk around capital intensity and equipment availability.</p> <p>The pending acquisition of Distributed Power Solutions is the most relevant update here, because it extends Kodiak’s contracted horsepower model into power generation right as management is working through long equipment lead times. If DPS integrates smoothly and Kodiak secures enough new units on acceptable terms, the combination could support revenue and earnings growth, but any misstep on procurement or deployment timing would feed directly into the existing risk around capital intensity and potential overcapacity.</p> <p>Yet beneath Kodiak’s record 2025 numbers, investors should still be watching how its highly capital intensive model copes with...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/energy/nyse-kgs/kodiak-gas-services/cieb1ckz-permian-basin-and-lng-exports-will-unlock-future-opportunities-gevd\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Kodiak Gas Services (it's free!)</a></p><p>Kodiak Gas Services' narrative projects $1.5 billion revenue and $293.4 million earnings by 2028. This requires 5.8% yearly revenue growth and about a $210 million earnings increase from $83.2 million today.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/energy/nyse-kgs/kodiak-gas-services/cieb1ckz-permian-basin-and-lng-exports-will-unlock-future-opportunities-gevd\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Kodiak Gas Services' forecasts yield a $46.27 fair value</a>, a 15% downside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/energy/nyse-kgs/kodiak-gas-services\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"KGS 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/0fad968d-fe8f-4d42-8ce1-09337e6b828a/chart/quote-price\" width=\"746\"/></a><figcaption>KGS 1-Year Stock Price Chart</figcaption></figure> <p>Three fair value estimates from the Simply Wall St Community span a wide US$46.27 to US$148.07 per share, underlining how far apart individual views can be. Against that backdrop, Kodiak’s record 2025 performance and expansion into power generation sit alongside unresolved questions about capital intensity and supply chain constraints, which could meaningfully shape how those different valuation stories play out over time.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/energy/nyse-kgs/kodiak-gas-services\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 3 other fair value estimates on Kodiak Gas Services</a> - why the stock might be worth 15% less than the current price!</p><h2>Reach Your Own Conclusion</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Kodiak Gas Services research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/energy/nyse-kgs/kodiak-gas-services\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 3 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/energy/nyse-kgs/kodiak-gas-services\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Kodiak Gas Services research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Kodiak Gas Services' overall financial health at a glance.</li></ul><h2>No Opportunity In Kodiak Gas Services?</h2><p>Markets shift fast. These stocks won't stay hidden for long. Get the list while it matters:</p><ul><li>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</li><li>Find <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 companies with promising cash flow potential yet trading below their fair value</a>.</li><li>The best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 smaller AI-focused companies with strong growth potential</a> through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Kodiak Gas Services might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/energy/nyse-kgs/kodiak-gas-services/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-03-01 20:31:43",
            "link": "https://simplywall.st/stocks/us/energy/nyse-kgs/kodiak-gas-services/news/why-kodiak-gas-services-kgs-is-up-78-after-record-2025-resul",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Judo Capital Holdings (ASX:JDO) Valuation After Earnings Growth And Director Share Purchase",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Why Judo Capital Holdings is back on investors’ radar</h2> <p>Judo Capital Holdings (ASX:JDO) has drawn fresh attention after reporting half year earnings and a director share purchase that together reshaped how some investors are looking at the stock.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/au/banks/asx-jdo/judo-capital-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Judo Capital Holdings.</a></p> <p>At a latest share price of A$1.725, Judo Capital Holdings has a 90 day share price return of 7.81%, while the 1 year total shareholder return of 15.02% and 3 year total shareholder return of 18.97% point to momentum that has built over a longer period despite recent softer 30 day and year to date share price returns.</p> <p>If this earnings update has you thinking about where else capital could work hard, it might be worth scanning our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/au\" rel=\"noopener noreferrer\" target=\"_blank\">2 top founder-led companies</a> for more ideas beyond the banking space.</p> <p>With net income of A$59.9 million for the half year and the share price trading at a discount to analyst and intrinsic estimates, you have to ask: is Judo quietly undervalued, or is the market already pricing in future growth?</p> <h2>Most Popular Narrative: 17.4% Undervalued</h2> <p>Judo Capital Holdings' most followed narrative points to a fair value of A$2.09, which sits above the last close of A$1.725 and frames the current debate around the stock.</p> <blockquote> <p><em>The continued withdrawal of major banks from regional and SME lending leaving these segments underserved creates opportunity for Judo to capture outsized market share; this is expected to result in above-system loan book growth and higher net interest income relative to competition.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/5dpvsw80-advanced-banking-platform-will-unlock-sme-digital-demand-mat1\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>If you are curious what kind of revenue lift and margin profile that scenario implies, and how those earnings are then discounted back to today, the full narrative lays out the maths and the tug of war between growth assumptions and required returns in clear detail.</p> <p><strong>Result: Fair Value of A$2.09 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/5dpvsw80-advanced-banking-platform-will-unlock-sme-digital-demand-mat1\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this hinges on SME credit quality and funding costs, with higher impairments or more expensive deposits both potential triggers for a reset in expectations.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/au/banks/asx-jdo/judo-capital-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Judo Capital Holdings narrative.</a></p> <h2>Another angle: earnings multiple sends a different signal</h2> <p>While the SWS fair value points to Judo Capital Holdings trading at a 31.5% discount, the current P/E of 18.3x is higher than both the Australian peer average of 15.3x and the global banks average of 11.1x, and below a fair ratio of 23.2x. That mix of premium against peers but gap to the fair ratio raises a simple question: is the market cautiously early, or already paying up for future growth?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/au/banks/asx-jdo/judo-capital-holdings-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/au/banks/asx-jdo/judo-capital-holdings-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ASX:JDO P/E Ratio as at Mar 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/4ef5009c-c5d5-4c73-b6e5-258846044f2f/chart/pe-multiple-vs-industry?date=2026-03-01\" width=\"746\"/></a><figcaption>ASX:JDO P/E Ratio as at Mar 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>If this mix of fair value signals and earnings multiples has you unsure which way to lean, it is worth acting now to check the underlying drivers and see what stands out most to you; our data highlights that the company has at least one factor investors are optimistic about, so it may help to review those <a class=\"company-report-links\" data-vars-link-type=\"cta_rewards_analysis\" href=\"https://www.simplywall.st/stocks/au/banks/asx-jdo/judo-capital-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards</a>.</p> <h2>Looking for more investment ideas?</h2> <p>Judo may have your attention today, but you do not want to miss other opportunities that match your goals and risk comfort before the market moves on.</p> <ul> <li>Target potential value opportunities by scanning our list of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/au\" rel=\"noopener noreferrer\" target=\"_blank\">7 high quality undervalued stocks</a> and see which businesses line up with your expectations.</li> <li>Secure your income focus by checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/au\" rel=\"noopener noreferrer\" target=\"_blank\">7 dividend fortresses</a>, built around companies offering higher yields with an eye on stability.</li> <li>Protect your downside first by reviewing the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/au\" rel=\"noopener noreferrer\" target=\"_blank\">8 resilient stocks with low risk scores</a>, highlighting companies that score well on our risk checks.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:31:43",
            "link": "https://simplywall.st/stocks/au/banks/asx-jdo/judo-capital-holdings-shares/news/assessing-judo-capital-holdings-asxjdo-valuation-after-earni",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Sealed Air (SEE) Valuation As Shares Trade Near Recent Levels",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Why Sealed Air is on investors’ radar today</h2> <p>Sealed Air (SEE) is back in focus after recent trading left the shares around $41.88, prompting investors to reassess how its packaging business and current valuation line up with their expectations.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-see/sealed-air\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Sealed Air.</a></p> <p>While the 1-day and 7-day share price returns are slightly negative, Sealed Air’s 1-year total shareholder return of 25.46% contrasts with weaker 3-year and modest 5-year total shareholder returns, which suggests that momentum has recently improved after a softer multi year period.</p> <p>If Sealed Air has you rethinking where packaging and automation fit in your portfolio, it could be a good time to scan <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">19 top founder-led companies</a> as potential long term compounders beyond this sector.</p> <p>With Sealed Air trading around $41.88, showing recent 1 year gains but weaker 3 year and modest 5 year total returns, the key question is whether today’s valuation still leaves room for upside or if the market is already factoring in future growth.</p> <h2>Most Popular Narrative: 7% Undervalued</h2> <p>With Sealed Air last closing at $41.88 against a narrative fair value of about $45.02, the widely followed view sees modest upside still on the table.</p> <blockquote> <p><em>Ongoing investments in network optimization (new manufacturing facilities, supply chain streamlining, leveraging external R&amp;D/production partners) are expected to improve efficiency and customer service while reducing capital intensity, supporting both future margin expansion and free cash flow generation.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/6jorsoga-see-upcoming-cfo-appointment-and-product-advances-will-drive-shareholder-value\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what kind of margin profile and earnings power that sort of efficiency story needs to support this value gap? The narrative quietly bakes in measured revenue growth, firmer profitability, and a leaner capital base that all have to work together to justify that fair value line.</p> <p><strong>Result: Fair Value of $45.02 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/6jorsoga-see-upcoming-cfo-appointment-and-product-advances-will-drive-shareholder-value\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, you also have to weigh risks such as a prolonged slump in high margin beef volumes or ongoing pricing pressure in Protective packaging that could squeeze earnings.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-see/sealed-air\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Sealed Air narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of potential upside and real risks feels finely balanced, do not wait around. Review the numbers yourself and see how <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/materials/nyse-see/sealed-air\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 1 important warning sign</a> stack up for your view on Sealed Air.</p> <h2>Looking for more investment ideas?</h2> <p>Do not stop with one stock. The Simply Wall St screener can quickly surface other ideas that might fit your goals and help you act with confidence.</p> <ul> <li>Target steadier returns by checking out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">74 resilient stocks with low risk scores</a>, which score well on resilience when markets feel uncertain.</li> <li>Hunt for value by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a>, which pair solid fundamentals with relatively low market attention.</li> <li>Strengthen your income stream by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a>, which focus on higher yields with an emphasis on resilience.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-03-01 20:25:53",
            "link": "https://simplywall.st/stocks/us/materials/nyse-see/sealed-air/news/assessing-sealed-air-see-valuation-as-shares-trade-near-rece",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xeris Biopharma Holdings (XERS) Is Down 7.4% After Suing to Block Recorlev Generics Until 2040",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Xeris Biopharma recently filed a Hatch-Waxman patent infringement lawsuit in the US District Court for the District of New Jersey against Torrent Pharmaceuticals and Somerset Therapeutics, seeking to block generic versions of its Cushing’s syndrome therapy Recorlev until its patents expire in March 2040.</li> <li>This legal move highlights how central Recorlev’s intellectual property protection is to Xeris’s long-term product exclusivity and potential revenue longevity in its endocrine franchise.</li> <li>We’ll now examine how this patent lawsuit, aimed at preserving Recorlev’s market exclusivity, could influence Xeris Biopharma’s broader investment narrative.</li> </ul><p>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/us\" rel=\"noopener noreferrer\" target=\"_blank\">27 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Xeris Biopharma Holdings Investment Narrative Recap</h2><p>To own Xeris Biopharma, you have to believe its focused endocrine portfolio, anchored by Recorlev, can support a path to sustainable profitability while the company invests in growth. The Recorlev patent lawsuit is important for protecting potential long term cash flows, but in the near term the key catalyst is still execution around upcoming earnings and commercial performance, while the biggest risk remains Xeris’s reliance on a small set of branded products.</p> <p>Against this backdrop, the upcoming March 2, 2026 earnings report, with consensus expecting US$0.04 EPS and full year 2025 revenue around US$292,000,000, looks especially relevant. Those results will give investors a fresh read on how Recorlev, Gvoke, and Keveyis are performing just as Xeris moves to defend Recorlev’s patents, and may influence how investors weigh the benefit of extended exclusivity against ongoing R&amp;D and SG&amp;A spending.</p> <p>Yet while the lawsuit aims to secure Recorlev’s future, investors should also factor in the risk that...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/pharmaceuticals-biotech/nasdaq-xers/xeris-biopharma-holdings/9pjzm8dt-xers-higher-2025-revenue-guidance-will-drive-measured-financial-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Xeris Biopharma Holdings (it's free!)</a></p><p>Xeris Biopharma Holdings' narrative projects $440.9 million revenue and $84.8 million earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/pharmaceuticals-biotech/nasdaq-xers/xeris-biopharma-holdings/9pjzm8dt-xers-higher-2025-revenue-guidance-will-drive-measured-financial-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Xeris Biopharma Holdings' forecasts yield a $11.14 fair value</a>, a 82% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-xers/xeris-biopharma-holdings\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"XERS 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/34985fb8-c88a-498a-8524-1011a674e966/chart/quote-price\" width=\"746\"/></a><figcaption>XERS 1-Year Stock Price Chart</figcaption></figure> <p>Some of the lowest estimating analysts were already more cautious, even while assuming revenue could reach about US$414,200,000 and earnings about US$21,400,000 by 2028, so this fresh legal uncertainty around Recorlev’s patents could push their already more pessimistic view further, and it is worth asking yourself which version of Xeris’s future you find more convincing.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/pharmaceuticals-biotech/nasdaq-xers/xeris-biopharma-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 4 other fair value estimates on Xeris Biopharma Holdings</a> - why the stock might be worth 23% less than the current price!</p><h2>Reach Your Own Conclusion</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Xeris Biopharma Holdings research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-xers/xeris-biopharma-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 2 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-xers/xeris-biopharma-holdings\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Xeris Biopharma Holdings research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Xeris Biopharma Holdings' overall financial health at a glance.</li></ul><h2>Ready For A Different Approach?</h2><p>These stocks are moving-our analysis flagged them today. Act fast before the price catches up:</p><ul><li>Outshine the giants: these <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 early-stage AI stocks could fund your retirement</a>.</li><li>The future of work is here. Discover the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 top robotics and automation stocks</a> leading the charge in AI-driven automation and industrial transformation.</li><li>Rare earth metals are the new gold rush. Find out which <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 stocks are leading the charge</a>.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-03-01 20:25:53",
            "link": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-xers/xeris-biopharma-holdings/news/xeris-biopharma-holdings-xers-is-down-74-after-suing-to-bloc",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        }
    ]
}