{
    "data": [
        {
            "title": "Assessing Mizuho Financial Group's Valuation As New Leadership Prepares To Take The Helm",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Leadership changes at Mizuho Financial Group</h2> <p>Mizuho Financial Group (TSE:8411) has announced a major boardroom reshuffle, with Hidekatsu Take set to become Chairperson and Masayuki Sugawara stepping into the Deputy President &amp; Corporate Executive role from April 1, 2026.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/jp/banks/tse-8411/mizuho-financial-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Mizuho Financial Group.</a></p> <p>The leadership reshuffle comes after a strong run in the shares, with a 30.66% 90 day share price return and a 21.74% year to date share price return. The 5 year total shareholder return of 464.55% highlights the longer term performance.</p> <p>If changes at Mizuho have you thinking about where else capital could work hard, this could be a good moment to scan <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/jp\" rel=\"noopener noreferrer\" target=\"_blank\">12 top founder-led companies</a> and see what stands out.</p> <p>With a very large 5 year total return and shares trading below one estimate of intrinsic value, the key question now is whether Mizuho is still priced at a discount or if the market already reflects future growth.</p> <h2>Most Popular Narrative: 6.5% Overvalued</h2> <p>Mizuho's most followed narrative puts fair value at ¥6,715.83, slightly below the last close of ¥7,151, which frames the current debate around the shares.</p> <blockquote> <p><em>The strategic acquisitions and collaborations, such as those with Greenhill and Rakuten Securities, are expected to create new synergies and improve the Group's competitive edge, leading to increased revenues and improved earnings.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/widbv25k-8411-share-buyback-and-improved-projections-will-support-fair-value-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what kind of revenue mix, margin profile and future P/E this narrative leans on, and how those moving parts tie back to that fair value?</p> <p><strong>Result: Fair Value of ¥6,715.83 (OVERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/widbv25k-8411-share-buyback-and-improved-projections-will-support-fair-value-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, higher governance and infrastructure costs, or hiccups integrating Rakuten and Greenhill, could pressure margins and challenge the earnings and valuation assumptions behind this narrative.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/jp/banks/tse-8411/mizuho-financial-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Mizuho Financial Group narrative.</a></p> <h2>Another view: cash flows tell a different story</h2> <p>The popular narrative leans on future earnings and P/E assumptions and ends up calling Mizuho about 6.5% overvalued around ¥6,716. Our DCF model looks at estimated future cash flows instead and points to a value of ¥10,164.96, which suggests upside instead. Which yardstick do you trust more when the signals diverge?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/jp/banks/tse-8411/mizuho-financial-group-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/jp/banks/tse-8411/mizuho-financial-group-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"8411 Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/6f30e5e6-1e9c-47d2-b7f1-7432bed5d69a/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>8411 Discounted Cash Flow as at Feb 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>If this mix of signals feels finely balanced, it may be a good time to look through the data yourself and decide where you stand, including weighing up <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/jp/banks/tse-8411/mizuho-financial-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 2 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If Mizuho sits in the “watch closely” bucket for you, this is the moment to widen your opportunity set before the next round of prices moves away.</p> <ul> <li>Target resilience by checking companies in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/jp\" rel=\"noopener noreferrer\" target=\"_blank\">57 resilient stocks with low risk scores</a> and see which names pair modest risk scores with steadier profiles.</li> <li>Spot potential mispricing by reviewing our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/jp\" rel=\"noopener noreferrer\" target=\"_blank\">20 high quality undervalued stocks</a> where quality fundamentals and current prices look out of sync.</li> <li>Hunt for tomorrow's possible standouts through the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/jp\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 58 high quality undiscovered gems</a> and see which underfollowed names meet your quality filters.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:21:32",
            "link": "https://simplywall.st/stocks/jp/banks/tse-8411/mizuho-financial-group-shares/news/assessing-mizuho-financial-groups-valuation-as-new-leadershi",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is Swedbank (OM:SWED A) Still Attractive After A 47% One Year Share Price Jump",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Swedbank is still reasonably priced after a strong run, this article will walk through what the current share price might be implying about its value.</li> <li>Swedbank's share price, which last closed at SEK 347.8, has seen a 0.3% decline over the past week, a 0.3% gain over the past month, a 6.9% return year to date and a 47.1% return over the past year, with a 101.6% return over three years and a 212.3% return over five years.</li> <li>Recent coverage around Swedbank has focused on its position in the Swedish banking sector and ongoing interest in the wider Nordic financials space, which helps frame how investors are thinking about bank valuations generally. At the same time, regulatory developments and broader sentiment toward European banks have been part of the backdrop for the current share price.</li> <li>On our valuation checks, Swedbank currently scores <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/se/banks/sto-swed-a/swedbank-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">3 out of 6</a>, which suggests the picture is mixed and worth unpacking in more detail. Next, we will look at different valuation methods before finishing with a way to tie them together into a clearer view of value.</li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_industry_performance_contextual\" href=\"https://www.simplywall.st/stocks/se/banks/sto-swed-a/swedbank-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">Swedbank delivered 47.1% returns over the last year. See how this stacks up to the rest of the Banks industry.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Swedbank Excess Returns Analysis</h3> <p>The Excess Returns model looks at how effectively Swedbank turns its equity base into profits above its estimated cost of equity, then capitalises those surplus returns into a per share value.</p> <p>For Swedbank, the starting point is a Book Value of SEK200.85 per share and a Stable EPS of SEK28.74 per share, based on weighted future return on equity estimates from 5 analysts. The model applies an Average Return on Equity of 14.28% and a Cost of Equity of SEK12.56 per share. The gap between these two is the Excess Return, calculated at SEK16.19 per share, which is what this approach treats as value created over and above the required return.</p> <p>The Stable Book Value used in the model is SEK201.21 per share, sourced from weighted future Book Value estimates from 4 analysts. Combining these inputs produces an Excess Returns intrinsic value of roughly SEK569 per share. Compared with the recent share price of SEK347.8, this framework points to the stock trading at a 38.9% discount, which screens as undervalued on this method.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Excess Returns analysis suggests Swedbank is undervalued by 38.9%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">220 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/se/banks/sto-swed-a/swedbank-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"SWED A Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/d68ba17d-9030-4dd5-bcd5-1c64af8b3dbf/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>SWED A Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/se/banks/sto-swed-a/swedbank-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Swedbank.</a></p> <h3>Approach 2: Swedbank Price vs Earnings</h3> <p>For a profitable bank like Swedbank, the P/E ratio is a practical way to think about value because it ties the share price directly to the earnings that each share generates. In general, higher growth expectations and lower perceived risk can justify a higher “normal” P/E, while slower expected growth or higher risk tend to pull a fair P/E lower.</p> <p>Swedbank currently trades on a P/E of 11.92x. That sits slightly above the Banks industry average of 11.09x and also above the peer group average of 11.49x, so on simple comparisons the shares are not screening as cheap. To go a step further, Simply Wall St calculates a proprietary “Fair Ratio” of 12.02x for Swedbank. This is the P/E level suggested after factoring in elements like its earnings profile, industry, profit margins, market value and risk characteristics. This Fair Ratio can be more informative than a straight peer or industry comparison because it is tailored to the company rather than relying on broad group averages.</p> <p>Set against the current P/E of 11.92x, the Fair Ratio of 12.02x is very close, which points to the shares being priced roughly in line with this metric.</p> <p><strong>Result: ABOUT RIGHT</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/se/banks/sto-swed-a/swedbank-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"OM:SWED A P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/d68ba17d-9030-4dd5-bcd5-1c64af8b3dbf/chart/pe-multiple-vs-industry?date=2026-02-28\" width=\"746\"/></a><figcaption>OM:SWED A P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/global\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 96 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Swedbank Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation. Let us introduce you to Narratives, which are simply your story about Swedbank linked to concrete numbers like your own fair value, revenue, earnings and margin assumptions. All of these are updated in real time on Simply Wall St’s Community page as new news or results arrive. This way you can instantly see how your Fair Value compares to the current price and decide whether the share looks appealing, whether you prefer a cautious view closer to SEK 213.52 per share or a more optimistic stance around SEK 390 per share.</p> <p>For Swedbank, however, we will make it really easy for you with previews of two leading Swedbank Narratives:</p> <p>First is a more optimistic take that leans toward a higher fair value and assumes that Swedbank can keep turning its retail and corporate banking footprint into steady business across Sweden and the Baltics.</p> <p><a href=\"/se/banks/sto-swed-a/swedbank-shares/pvtd2lw8-long-term-digital-and-sustainability-trends-will-support-a-stronger-banking-franchise?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Swedbank Bull Case</strong></a></p> <p>Fair value: SEK 390.00 per share</p> <p>Implied discount to this narrative: 10.8% below the narrative fair value, based on the last close of SEK 347.80</p> <p>Revenue growth assumption: 5.0% per year</p> <ul> <li>The bullish view is based on Swedbank executing on its 15/27 plan, using stronger customer engagement and tighter cost control to support earnings through a lower cost to income ratio.</li> <li>It also relies on steady volume growth in core lending, including Swedish mortgages and Baltic lending, together with rising contributions from savings, pensions and asset management fees.</li> <li>This narrative assumes investors will be comfortable with Swedbank trading on a future P/E of 14.6x on 2029 earnings, with earnings projected at SEK 36.0b and a discount rate of 6.24% used to bring those numbers back to today.</li> </ul> <p>The second is a more cautious narrative that points to a lower fair value and focuses on what happens if interest income and revenue do not keep pace with current expectations.</p> <p><a href=\"/se/banks/sto-swed-a/swedbank-shares/d2z4fsdh-swedbank-kommer-oka-langsiktigt-tack-vare-hogkonjuktur?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Swedbank Bear Case</strong></a></p> <p>Fair value: SEK 213.52 per share</p> <p>Implied premium to this narrative: 62.8% above the narrative fair value, based on the last close of SEK 347.80</p> <p>Revenue growth assumption: 6.0% per year</p> <ul> <li>This bearish view starts from the idea that Swedish mortgage rates could settle nearer 3% from around 4.5%, which would feed through to lower interest income from mortgages and a smaller total revenue base.</li> <li>In this scenario, Swedbank’s total revenue moves from SEK 74.4b to SEK 63.0b, partly offset by about 10% growth in other services tied to the policy rate.</li> <li>From there, the narrative outlines a path where revenue recovers over three years to SEK 88.0b, but the starting point is a lower fair value of SEK 213.52 per share, which is based on a future P/E of 7.79 and a higher discount rate of 8.92%.</li> </ul> <p>Together, these two narratives frame the current price between a more optimistic SEK 390.00 view and a more cautious SEK 213.52 view, allowing you to consider which set of assumptions comes closer to how you see Swedbank’s earnings power and risk profile.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a></p> <p>Do you think there's more to the story for Swedbank? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/OM/SWED%20A\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/se/banks/sto-swed-a/swedbank-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"OM:SWED A 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/d68ba17d-9030-4dd5-bcd5-1c64af8b3dbf/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>OM:SWED A 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:21:32",
            "link": "https://simplywall.st/stocks/se/banks/sto-swed-a/swedbank-shares/news/is-swedbank-omswed-a-still-attractive-after-a-47-one-year-sh",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enpro 3.0 Acquisition Push Meets Rich Valuation And Mixed Profit Picture",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Enpro (NYSE:NPO) has outlined plans to pursue acquisitions as part of its Enpro 3.0 strategy.</li> <li>The company is targeting new growth areas and capabilities with a focus on long term shareholder value.</li> <li>Management highlighted financial flexibility to fund deals while maintaining a disciplined approach.</li> </ul> <p>Enpro focuses on engineered products and solutions across industrial end markets, so adding new capabilities through acquisitions could reshape how the business is positioned. For you as an investor, the key point is that this is an explicit push to use M&amp;A as a core growth tool, not just an occasional bolt on deal. It comes as many industrial companies are reassessing their portfolios and looking for ways to add more specialized, higher value offerings.</p> <p>Looking ahead, the Enpro 3.0 approach signals that management is prepared to deploy capital into targeted deals that fit its updated priorities. You may want to watch how the company balances deal size, integration risk and balance sheet strength as specific transactions are announced, and how clearly each acquisition ties back to the stated focus on long term shareholder value.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-npo/enpro/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Enpro</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/NPO\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Enpro.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-npo/enpro/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:NPO Earnings &amp; Revenue Growth as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/1542c6db-327f-455d-816c-c9a535a021b2/chart/earnings-and-revenue-growth?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:NPO Earnings &amp; Revenue Growth as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_risk_alert\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-npo/enpro\" rel=\"noopener noreferrer\" target=\"_blank\">We've flagged 3 risks for Enpro. See which could impact your investment.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Quick Assessment</h3> <ul> <li><strong>⚖️ Price vs Analyst Target</strong>: At US$258.65 versus a US$300.00 consensus target, the price sits about 14% below where analysts place it.</li> <li><strong>❌ Simply Wall St Valuation</strong>: Shares are flagged as overvalued, trading around 38% above the platform's estimated fair value.</li> <li><strong>✅ Recent Momentum</strong>: The 30 day return of roughly 10.6% shows the stock has had a strong recent run.</li> </ul> <p>There is only one way to know the right time to buy, sell or hold Enpro. Head to Simply Wall St's\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-npo/enpro/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">company report for the latest analysis of Enpro's fair value</a>.</p> <h3>Key Considerations</h3> <ul> <li>📊 The push for acquisitions under Enpro 3.0 could change the mix of earnings and the risk profile, so it is worth tracking how deal terms and integration outcomes develop.</li> <li>📊 With a P/E of about 135.7 versus an industry average near 28.4 and a price target of US$300.00, valuation, earnings delivery and M&amp;A progress are key items to watch.</li> <li>⚠️ Profit margins sitting at 3.5% versus 7% last year and recent insider selling stand out as important risks as the company steps up acquisition activity.</li> </ul> <h3>Dig Deeper</h3> <p>For the full picture including more risks and rewards, check out the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/capital-goods/nyse-npo/enpro\" rel=\"noopener noreferrer\" target=\"_blank\">complete Enpro analysis</a>. Alternatively, you can visit the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/NPO\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Enpro</a> to see how other investors believe this latest news will impact the company's narrative.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Enpro might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/capital-goods/nyse-npo/enpro/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-28 16:21:32",
            "link": "https://simplywall.st/stocks/us/capital-goods/nyse-npo/enpro/news/enpro-30-acquisition-push-meets-rich-valuation-and-mixed-pro",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nick O. Rowe Joins H2O America Board As Big Investments Loom",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>H2O America (NasdaqGS:HTO) has appointed Nick O. Rowe to its Board of Directors.</li> <li>Rowe brings nearly four decades of water industry leadership, including senior roles at American Water Works Company and other institutions.</li> <li>The board change comes as H2O America pursues acquisitions and infrastructure investments.</li> </ul> <p>For you as an investor, this move relates to how H2O America plans to handle the practical realities of being a regulated water utility and infrastructure owner. The company operates in a sector where capital spending, customer rates, and regulatory relationships all matter, and where experience with large scale water systems can be particularly valuable. Rowe’s mix of operational and regulatory background aligns with those day to day demands.</p> <p>His appointment comes at a time when water utilities are often considering larger capital projects, new technology for system reliability, and potential acquisitions. Investors watching NasdaqGS:HTO may view this board addition as an indication that governance and execution are key areas of focus as the company evaluates growth, funding needs, and long term asset planning.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/utilities/nasdaq-hto/h2o-america/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">H2O America</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NasdaqGS/HTO\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on H2O America.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/utilities/nasdaq-hto/h2o-america\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:HTO 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/3ccd0975-7ab8-413d-8ee0-927983dbabd8/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>NasdaqGS:HTO 1-Year Stock Price Chart</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_management\" href=\"https://www.simplywall.st/stocks/us/utilities/nasdaq-hto/h2o-america/management\" rel=\"noopener noreferrer\" target=\"_blank\">Does the team leading H2O America have what it takes? See our full breakdown of the management team's track record and compensation.</a></p> <p>For H2O America, Rowe’s arrival comes at a time when board oversight really matters. The company has a pending $540 million Quadvest acquisition, a 2026 to 2030 capital plan of $2.7b, and guidance for 2026 adjusted diluted EPS between $3.08 and $3.18. That combination of higher spending, expected EPS impact from acquisitions in 2026 and 2027, and ongoing regulatory work in several states increases the importance of directors who understand both utility operations and rate-setting.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>How This Fits Into The H2O America Narrative</h3> <ul> <li>Rowe’s background in long-term value creation and large utility operations aligns with H2O America’s focus on capital projects, PFAS treatment and acquisitions such as Quadvest, which were already central to the existing narrative.</li> <li>His emphasis on customer service and affordability could influence how aggressively the company pursues rate increases to support its $2.7b plan, which may differ from assumptions that focus mainly on investment and revenue growth.</li> <li>The narrative highlights technology investments like advanced metering, while this appointment adds a governance angle that was not fully reflected, particularly around board-level oversight of integration risk in Texas.</li> </ul> <p>Knowing what a company is worth starts with understanding its story.\n<a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/narratives/6cyz92qw-general-rate-cases-and-ami-deployment-will-secure-future-reliability\" rel=\"noopener noreferrer\" target=\"_blank\">Check out one of the top narratives in the Simply Wall St Community for H2O America</a> to help decide what it's worth to you.</p> <h3>The Risks and Rewards Investors Should Consider</h3> <ul> <li>⚠️ Large capital plans and acquisitions typically mean higher funding needs, and analysts have noted that interest payments are not well covered by earnings.</li> <li>⚠️ The Quadvest acquisition is expected to dilute EPS by 10% to 20% in 2026 and 2027, so execution missteps or regulatory delays could leave shareholders with the costs but slower benefits.</li> <li>🎁 A director with 39 years in drinking water utilities may help the board scrutinize project returns, regulatory filings and integration plans more effectively.</li> <li>🎁 Rowe’s experience with customer and stakeholder relationships may support H2O America’s efforts to seek timely rate recovery on PFAS treatment and infrastructure spending.</li> </ul> <h3>What To Watch Going Forward</h3> <p>From here, you may want to see how often Rowe features in committees tied to capital allocation, acquisitions and regulatory affairs, and whether H2O America’s board commentary around Quadvest and the 2026 to 2030 plan becomes more detailed. Track any updates on Texas approvals, the timing of equity and debt issuance to support the $2.7b program, and whether the company keeps earnings within its 2026 guidance range as it absorbs near term EPS dilution from deals.</p> <p>To stay informed on how the latest news impacts the investment narrative for H2O America, visit the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NasdaqGS/HTO\" rel=\"noopener noreferrer\" target=\"_blank\">community page for H2O America</a> to follow the top community narratives.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if H2O America might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/utilities/nasdaq-hto/h2o-america/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-28 16:21:32",
            "link": "https://simplywall.st/stocks/us/utilities/nasdaq-hto/h2o-america/news/nick-o-rowe-joins-h2o-america-board-as-big-investments-loom",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LandBridge Ups Dividend And Buyback As Growth And Valuation Converge",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>LandBridge (NYSE:LB) announced a substantial increase in its quarterly dividend.</li> <li>The company introduced a new $50 million share repurchase authorization.</li> <li>Management reported a seventh consecutive quarter of revenue growth.</li> <li>LandBridge highlighted high margin expansion tied to new agreements across renewable and conventional energy.</li> </ul> <p>For investors watching income and capital return policies, the latest update from LandBridge, ticker NYSE:LB, brings several moving pieces together. The company operates across both renewable and conventional energy, and its recent agreements appear focused on higher margin business within that mix. In the context of ongoing investment in energy infrastructure and transition, these shifts in its contract base help frame how management views the balance of growth and cash returns.</p> <p>The larger dividend and the new $50 million buyback authorization indicate that the company is actively shaping its capital allocation approach. For those following NYSE:LB, the combination of reported revenue growth, higher margin deals, and increased shareholder distributions provides a set of themes to monitor in upcoming quarters, including how consistently management follows through on both the payout plans and the business pipeline.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/real-estate-management-and-development/nyse-lb/landbridge/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">LandBridge</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/LB\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on LandBridge.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/real-estate-management-and-development/nyse-lb/landbridge/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:LB Earnings &amp; Revenue Growth as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/1544c9f8-d4e7-434d-9e5a-3f4e5f55821d/chart/earnings-and-revenue-growth?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:LB Earnings &amp; Revenue Growth as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_dividend\" href=\"https://www.simplywall.st/stocks/us/real-estate-management-and-development/nyse-lb/landbridge/dividend\" rel=\"noopener noreferrer\" target=\"_blank\">Is LandBridge's dividend sustainable? Check out what every dividend investor needs to know in our dividend analysis.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Quick Assessment</h3> <ul> <li><strong>⚖️ Price vs Analyst Target</strong>: At US$74.50, LandBridge trades roughly 1.4% below the US$75.57 consensus target, well within the 10% band.</li> <li><strong>⚖️ Simply Wall St Valuation</strong>: Shares are described as trading close to estimated fair value, so pricing does not screen as a clear bargain or stretch.</li> <li><strong>✅ Recent Momentum</strong>: A 30 day return of 27.22% shows strong recent momentum heading into this dividend and buyback announcement.</li> </ul> <p>There's only one way to know the right time to buy, sell or hold LandBridge. Head to Simply Wall St's\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/real-estate-management-and-development/nyse-lb/landbridge/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">company report for the latest analysis of LandBridge's Fair Value</a>.</p> <h3>Key Considerations</h3> <ul> <li>📊 The higher dividend and US$50m buyback signal a clear focus on returning cash while the company continues to report ongoing revenue growth and margin expansion.</li> <li>📊 Keep an eye on the high 68.8x P/E versus the Real Estate industry average of 34.2x, the forward P/E of 43.1x and whether future earnings justify this gap.</li> <li>⚠️ One flagged risk is a high level of debt, so you may want to track how increased payouts and repurchases interact with balance sheet strength over time.</li> </ul> <h3>Dig Deeper</h3> <p>For the full picture including more risks and rewards, check out the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/real-estate-management-and-development/nyse-lb/landbridge\" rel=\"noopener noreferrer\" target=\"_blank\">complete LandBridge analysis</a>. Alternatively, you can visit the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/LB\" rel=\"noopener noreferrer\" target=\"_blank\">community page for LandBridge</a> to see how other investors believe this latest news will impact the company's narrative.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-28 16:21:32",
            "link": "https://simplywall.st/stocks/us/real-estate-management-and-development/nyse-lb/landbridge/news/landbridge-ups-dividend-and-buyback-as-growth-and-valuation",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Invincible Investment (TSE:8963) Earnings Raise Fresh Questions On Dividend Cash Coverage",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Invincible Investment (TSE:8963) just posted its FY 2025 results with second half revenue of ¥28.6b and basic EPS of ¥2,182.45, while the trailing twelve months show revenue at ¥53.7b and basic EPS at ¥4,061.28. Over recent periods, revenue has moved from ¥25.6b in FY 2024 H2 to ¥25.1b in FY 2025 H1 and then to ¥28.6b in FY 2025 H2, with EPS shifting from ¥1,980.36 to ¥1,878.83 and then to ¥2,182.45. This sets up a picture where investors will be weighing how durable these margins look against the broader growth story and income profile.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/jp/real-estate/tse-8963/invincible-investment-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for Invincible Investment.</a> <p>With the headline numbers on the table, the next step is to set them against the prevailing narratives around Invincible Investment to see which views the results support and which they call into question.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/jp/real-estate/tse-8963/invincible-investment-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSE:8963 Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/e6a0bf85-15de-403f-bcf4-ffff34f2abac/chart/revenue-and-expenses-breakdown?date=2026-02-28\" width=\"746\"/></a><figcaption>TSE:8963 Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Net Margin Holds Above 57%</h2> <ul> <li>Over the last 12 months, Invincible Investment converted ¥53,698.83 million of revenue into ¥31,054.37 million of net income, giving a net margin of 57.8%, compared with 60.1% in the prior year.</li> <li>What stands out for a more cautious view is that, while this 57.8% margin is still high in absolute terms, the bearish angle around pressure on profitability finds some support in the slip from 60.1%, even as trailing basic EPS of ¥4,061.28 remains well above the single half year figures.\n    <ul> <li>Bears point to this margin move as a sign that earnings growth of 10.8% in the last year is much softer than the 55.9% per year pace over five years.</li> <li>That tension, strong margins yet slower growth, is exactly where more cautious investors tend to focus their attention.</li> </ul> </li> </ul> <h2>FFO And Cash Coverage Question Marks</h2> <ul> <li>Funds From Operations over the trailing 12 months sit at ¥19,538 million, and the risk summary flags that this level of operating cash flow does not comfortably cover the company’s debt and that a 5.91% dividend is not well covered by earnings or free cash flow.</li> <li>Critics highlight these cash flow and payout flags as a key bearish point, and the data backs up that concern because:\n    <ul> <li>FFO of about ¥19.5 billion is meaningfully below net income of ¥31,054.37 million, which points to a gap between accounting profit and cash generation.</li> <li>Pairing that with a 5.91% dividend yield that is flagged as not well covered means income focused holders have to pay close attention to how much of those payouts are supported by recurring cash.</li> </ul> </li> </ul> <h2>P/E Discount And DCF Gap</h2> <ul> <li>At a share price of ¥66,300, Invincible Investment trades on a trailing P/E of 16.3x, below the peer average of 22.4x, while also sitting well under a DCF fair value of ¥111,563.43 that implies the stock is about 40.6% below that fair value estimate.</li> <li>Supporters of a more bullish stance often lean on this valuation gap, and the figures give that argument some weight, although they also face a trade off with more moderate growth:\n    <ul> <li>The DCF fair value of ¥111,563.43 versus the current ¥66,300 price is a wide spread, yet forward forecasts for earnings growth of about 4.05% a year and revenue growth around 2.4% are both below the JP market growth rates cited.</li> <li>That mix, a P/E discount to peers and a gap to DCF fair value on one side and softer forecast growth on the other, is exactly what investors have to weigh when they look at whether the current price already reflects those slower trends.</li> </ul> </li> </ul> <p>Curious how other investors are weighing that P/E discount, the DCF gap, and the slower forecast growth against the cash flow risks in this REIT, and what that might mean for the longer term story of Invincible Investment, have a look at <a class=\"company-report-links\" data-vars-link-type=\"cta_generic_community_narrative\" href=\"https://simplywall.st/features/community-narratives\" rel=\"noopener noreferrer\" target=\"_blank\">Curious how numbers become stories that shape markets? Explore Community Narratives</a></p> <h2>Next Steps</h2> <p>Don't just look at this quarter; the real story is in the long-term trend. We've done an in-depth analysis on Invincible Investment's <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/jp/real-estate/tse-8963/invincible-investment-shares/past\" rel=\"noopener noreferrer\" target=\"_blank\">growth</a> and its <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://www.simplywall.st/stocks/jp/real-estate/tse-8963/invincible-investment-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation</a> to see if today's price is a bargain. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_dont_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> now so you don't miss the next big move.</p> <p>If this combination of strengths and concerns leaves you undecided, it may be useful to review the numbers yourself now and stress test your view against the balance of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/jp/real-estate/tse-8963/invincible-investment-shares\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 2 important warning signs</a></p> <h2>Explore Alternatives</h2> <p>Invincible Investment pairs a high net margin with softer forecast growth, a gap between profit and cash generation, and flagged coverage risks around its 5.91% dividend.</p> <p>If you are uneasy about those coverage concerns and want dividend income backed by sturdier cash flows, check out <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/jp\" rel=\"noopener noreferrer\" target=\"_blank\">12 dividend fortresses</a> and see how other income ideas stack up today.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-28 16:16:04",
            "link": "https://simplywall.st/stocks/jp/real-estate/tse-8963/invincible-investment-shares/news/invincible-investment-tse8963-earnings-raise-fresh-questions",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is It Too Late To Consider Teledyne Technologies (TDY) After Strong Recent Share Gains?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Teledyne Technologies at around US$681 per share still offers value, you are not alone; many investors are asking the same question right now.</li> <li>The stock has posted returns of 1.9% over 7 days, 9.8% over 30 days, 31.3% year to date and 32.2% over 1 year, which naturally raises questions about what is already priced in and how much risk you are taking on at this level.</li> <li>Recent news around Teledyne has focused on its role as a diversified technology company, with attention on its presence in areas such as sensors, imaging and instrumentation that are important for aerospace, defense and industrial customers. This kind of coverage helps explain why some investors are paying close attention to the stock after its recent performance and are starting to reassess what they think the shares are worth.</li> <li>On our checklist of six valuation tests, Teledyne scores <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/tech/nyse-tdy/teledyne-technologies/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">1 out of 6</a> for being undervalued, which sets up a closer look at how different models assess its worth and, later in the article, an even more practical way to judge whether the current price makes sense for you.</li> </ul> <p>Teledyne Technologies scores just 1/6 on our valuation checks. See what other red flags we found in the <a class=\"company-report-links\" data-vars-link-type=\"cta_low_value_score\" href=\"https://www.simplywall.st/stocks/us/tech/nyse-tdy/teledyne-technologies/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">full valuation breakdown</a>.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Teledyne Technologies Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow, or DCF, model estimates what a company might be worth by projecting the cash it could generate in the future and then discounting those amounts back into today’s dollars.</p> <p>For Teledyne Technologies, the model used is a 2 Stage Free Cash Flow to Equity approach. The company’s latest twelve month free cash flow is about $1.08b. Analyst estimates and subsequent extrapolations suggest free cash flow reaching around $1.92b in 2035, with interim projections such as $1.17b in 2026 and $1.39b in 2028. These figures are all expressed in US$ and include both analyst inputs and Simply Wall St extrapolations beyond the typical five year analyst window.</p> <p>When all those projected cash flows are discounted back, the DCF model arrives at an estimated intrinsic value of about $577 per share, compared with a current share price of roughly $681. That implies the stock is about 18.0% above this particular fair value estimate, based on this model.</p> <p><strong>Result: OVERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Teledyne Technologies may be overvalued by 18.0%. <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">Discover 47 high quality undervalued stocks</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_overvalued\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">create your own screener</a> to find better value opportunities.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/tech/nyse-tdy/teledyne-technologies/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TDY Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/2cf6a5f6-c6d5-4192-890e-61a491757215/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>TDY Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/tech/nyse-tdy/teledyne-technologies/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Teledyne Technologies.</a></p> <h3>Approach 2: Teledyne Technologies Price vs Earnings</h3> <p>For a profitable company like Teledyne Technologies, the P/E ratio is a useful yardstick because it links what you pay for the stock to the earnings the business is currently generating. In general, higher growth expectations or lower perceived risk can support a higher P/E, while slower growth or higher risk usually justify a lower, more conservative multiple.</p> <p>Teledyne’s current P/E is about 35.25x, compared with the Electronic industry average of around 27.59x and a peer average of roughly 60.93x. To give a more tailored view, Simply Wall St calculates a proprietary “Fair Ratio” of 24.68x for Teledyne, which is the P/E level it might trade on given factors such as its earnings profile, industry, profit margins, market capitalization and risk characteristics.</p> <p>This Fair Ratio aims to be more useful than a simple comparison with peers or the broad industry because it is specific to Teledyne’s own mix of growth, risks and profitability. Relative to that Fair Ratio of 24.68x, the current P/E of 35.25x is higher by a clear margin, suggesting the shares are pricing in richer terms than this model implies.</p> <p><strong>Result: OVERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/tech/nyse-tdy/teledyne-technologies/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:TDY P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/2cf6a5f6-c6d5-4192-890e-61a491757215/chart/pe-multiple-vs-industry?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:TDY P/E Ratio as at Feb 2026</figcaption></figure> <p>P/E ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Teledyne Technologies Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation. On Simply Wall St’s Community page you can use Narratives, where you set out your story for Teledyne Technologies, link it to your own forecasts for revenue, earnings and margins, see the fair value that falls out of those assumptions, have that view update automatically as new filings or news arrive, and compare your fair value with today’s price and with other investors’ Narratives, which currently span roughly US$579 at the cautious end to about US$770 at the optimistic end for Teledyne. All of this is available within a simple, interactive tool used by millions of investors.</p> <p>Do you think there's more to the story for Teledyne Technologies? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/TDY\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/tech/nyse-tdy/teledyne-technologies\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:TDY 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/2cf6a5f6-c6d5-4192-890e-61a491757215/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:TDY 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Teledyne Technologies might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/tech/nyse-tdy/teledyne-technologies/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-28 16:16:03",
            "link": "https://simplywall.st/stocks/us/tech/nyse-tdy/teledyne-technologies/news/is-it-too-late-to-consider-teledyne-technologies-tdy-after-s",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MBIA (MBI) Loss Of US$50 Million Challenges Optimistic Margin Recovery Narrative",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>MBIA (MBI) has just closed out FY 2025 with fourth quarter revenue of US$13 million and a basic EPS loss of US$1.01, alongside net income from ongoing operations showing a loss of US$50 million. The company has seen quarterly revenue move from US$26 million in Q4 2024 through US$33 million and negative US$43 million in early 2024 to US$21 million, US$15 million, then US$13 million in 2025. Quarterly basic EPS has ranged from a loss of US$5.33 in Q2 2024 to losses of US$1.28, US$0.14 and US$1.01 across 2025, setting up a story where investors are likely to focus on how efficiently MBIA is managing its shrinking top line against persistent losses and what that implies for margins.</p> <a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis_earnings\" href=\"https://www.simplywall.st/stocks/us/insurance/nyse-mbi/mbia\" rel=\"noopener noreferrer\" target=\"_blank\">See our full analysis for MBIA.</a> <p>With the headline numbers on the table, the next step is to weigh them against the most widely held narratives around MBIA, to see which stories the latest results support and which ones the data starts to challenge.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_range_narrative\" href=\"https://www.simplywall.st/narratives/4it2jeai-update-for-mbia\" rel=\"noopener noreferrer\" target=\"_blank\">See what the community is saying about MBIA</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/insurance/nyse-mbi/mbia/past\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:MBI Revenue &amp; Expenses Breakdown as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/e7562be9-1d4c-489e-b33b-f5446fff2d04/chart/revenue-and-expenses-breakdown?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:MBI Revenue &amp; Expenses Breakdown as at Feb 2026</figcaption></figure> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Running losses still large at US$175 million TTM</h2> <ul> <li>On a trailing 12 month basis, MBIA reported total revenue of US$80 million and a net loss from ongoing operations of US$175 million, which works out to basic EPS of US$3.55 in losses.</li> <li>Analysts' consensus view talks about earnings reaching US$58.3 million by around 2028 with margins moving from about 188.2% in the red to 64.6% in the black, and the current loss profile sets up a clear test of that path:\n    <ul> <li>The last four reported quarters still show losses in each period, including US$50 million in Q4 2025 and US$62 million in Q1 2025, so any future profit story has to bridge that gap.</li> <li>At the same time, the data shows losses shrinking at about 4.2% per year over five years. This is consistent with a gradual improvement but still far from the earnings level implied in those longer term forecasts.</li> </ul> </li> </ul> <h2>Revenue growth vs flat outlook</h2> <ul> <li>Over the last year, revenue growth is described at about 8.4% per year. Yet quarterly revenue in the table runs from US$33 million in Q3 2024 to US$13 million in Q4 2025, while analysts assume revenue of US$90.4 million by 2028 that is characterized as fairly flat over the next three years.</li> <li>What is interesting for the bullish narrative is how that 8.4% revenue growth rate lines up with assumptions that revenue stays fairly flat, even as bulls expect higher margins to carry future earnings:\n    <ul> <li>The consensus narrative ties a lot of the potential upside to margin improvement rather than big new premium growth. This fits with comments about the insured portfolio running off and limiting future revenue expansion.</li> <li>Given that the insured par at National is described as shrinking and leverage sits at 23 to 1, bulls are effectively leaning on cost control and better outcomes on legacy exposures rather than a jump in top line to support those margin targets.</li> </ul> </li> </ul> If you want to see how those margin assumptions stack up against MBIA's latest numbers, have a look at <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 MBIA Bull Case</strong></a> for the full bull case.\n\n<h2>Premium P/S, mixed valuation signals</h2> <ul> <li>MBIA trades on a P/S of 4.1x compared with about 1.2x for the wider US insurance group and roughly 1.0x for peers. A DCF fair value of about US$34.47 in the supplied data sits well above the current share price of US$6.55 and the analyst price target of US$7.75.</li> <li>Bears focus on that valuation gap by pointing out that the premium P/S multiple is coming alongside negative shareholders' equity and ongoing losses, which leaves little room for disappointment if forecasts do not play out as expected:\n    <ul> <li>The company is still unprofitable on a trailing 12 month basis and has negative equity flagged in the risk summary, so the balance sheet is not yet reflecting the DCF fair value figure or the US$58.3 million earnings level assumed for 2028.</li> <li>With the analyst price target only about 18% above the current US$6.55 share price, skeptics can argue that the market is already cautious, even as the DCF fair value number suggests a much larger gap that depends heavily on that future profit recovery.</li> </ul> </li> </ul> Skeptical about whether those losses and balance sheet issues justify a premium P/S? Take a look at <a href=\"?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 MBIA Bear Case</strong></a> for a focused breakdown of the cautious case.\n<h2>Next Steps</h2> <p>To see how these results tie into long-term growth, risks, and valuation, check out the full range of <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://www.simplywall.st/narratives/4it2jeai-update-for-mbia\" rel=\"noopener noreferrer\" target=\"_blank\">community narratives</a> for MBIA on Simply Wall St. Add the company to your <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"conclusion_cta_when_narratives_exist\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> so you'll be alerted when the story evolves.</p> <p>Reading this, you can probably sense the mix of concern and cautious optimism around MBIA, so move quickly, review the numbers yourself, and weigh up the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/insurance/nyse-mbi/mbia\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 1 important warning sign</a> before you decide where you stand.</p> <h2>Explore Alternatives</h2> <p>MBIA is still working through sizeable losses, negative equity and shrinking revenue, so the current numbers leave plenty of questions about durability and downside risk.</p> <p>If that mix of ongoing losses and a stretched balance sheet feels uncomfortable, check out our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">76 resilient stocks with low risk scores</a> to quickly find companies with more resilient financial profiles.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:16:03",
            "link": "https://simplywall.st/stocks/us/insurance/nyse-mbi/mbia/news/mbia-mbi-loss-of-us50-million-challenges-optimistic-margin-r",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackLine (BL) Valuation Check After Share Price Pullback And Mixed Growth Expectations",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>BlackLine stock: event as a valuation check-in</h2> <p>BlackLine (BL) has drawn attention after a sharp pullback, with the share price around US$35.28 and negative returns over the past month and past 3 months prompting investors to reassess expectations and risks.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-bl/blackline\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for BlackLine.</a></p> <p>That recent pullback sits on top of a weaker backdrop, with the 1 month share price return of 31.92% and year to date share price return of 34.40% declines lining up with a 1 year total shareholder return of 26.96% and a 5 year total shareholder return of 68.37%. This hints that sentiment has been fading over both shorter and longer horizons.</p> <p>If this reset in expectations has you reassessing the software space more broadly, it could be a good time to widen your search with our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">19 top founder-led companies</a> and see what else stands out.</p> <p>So with BlackLine trading around US$35.28, combined with solid recent revenue and net income growth, and some analysts seeing higher value, are you looking at an underappreciated software name or a market that has already priced in future gains?</p> <h2>Most Popular Narrative: 42.9% Undervalued</h2> <p>BlackLine's most followed narrative pins fair value at $61.83, well above the last close of $35.28, which raises questions about what is driving that gap.</p> <blockquote> <p><em>Analysts are assuming BlackLine's revenue will grow by 10.9% annually over the next 3 years. The expansion of strategic integrations and partnerships with SAP, Snowflake, Oracle, and other leading ERPs is accelerating distribution and market penetration, supporting higher bookings and anticipated revenue growth into 2025 and beyond.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/jr97fe70-digital-transformation-and-ai-will-expand-market-reach-despite-risks-1u0h\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious how that kind of growth outlook turns into a higher valuation story? The narrative focuses on earnings power, margin shifts, and a future profit multiple that needs to stretch well beyond where the broader software space currently sits.</p> <p><strong>Result: Fair Value of $61.83 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/jr97fe70-digital-transformation-and-ai-will-expand-market-reach-despite-risks-1u0h\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this depends on modest 7% revenue growth guidance and risks from larger ERP competitors closing the product gap, which could pressure pricing and margins.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-bl/blackline\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this BlackLine narrative.</a></p> <h2>Another lens on valuation: rich on earnings multiples</h2> <p>That 42.9% undervalued narrative runs into a very different picture when you look at the current P/E. BlackLine trades on 85.6x earnings, versus 43.9x for peers, 26x for the wider US Software group, and a fair ratio of 43.5x, which points to clear valuation risk if sentiment cools.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-bl/blackline/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/software/nasdaq-bl/blackline/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:BL P/E Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/778c2d9f-6ab3-4f7d-b7b1-28f2bb3fe66a/chart/pe-multiple-vs-industry?date=2026-02-28\" width=\"746\"/></a><figcaption>NasdaqGS:BL P/E Ratio as at Feb 2026</figcaption></figure><p> </p><h2>Next Steps</h2> <p>If this mix of enthusiasm and caution around BlackLine feels familiar, it may be a good moment to look at the numbers yourself and decide where you stand. You can then use our breakdown of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/software/nasdaq-bl/blackline\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 2 important warning signs</a> to round out your view.</p> <h2>Looking for more investment ideas?</h2> <p>If BlackLine has sharpened your thinking, do not stop here. Use this moment to refresh your watchlist with a few targeted ideas that match your style.</p> <ul> <li>Target long term upside potential by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undiscovered_gems\" href=\"https://simplywall.st/discover/investing-ideas/473622/high-quality-undiscovered-gems/us\" rel=\"noopener noreferrer\" target=\"_blank\">screener containing 24 high quality undiscovered gems</a> that combine strong fundamentals with relatively low market attention.</li> <li>Prioritize capital preservation and consistency by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">76 resilient stocks with low risk scores</a> that score well on business stability and financial resilience.</li> <li>Build a portfolio with sturdier foundations by focusing on companies from our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/us\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (39 results)</a> that pair manageable debt with dependable fundamentals.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if BlackLine might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/software/nasdaq-bl/blackline/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-28 16:16:03",
            "link": "https://simplywall.st/stocks/us/software/nasdaq-bl/blackline/news/blackline-bl-valuation-check-after-share-price-pullback-and",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing VICI Properties (VICI) Valuation After Mixed Q4 Results And Continued Expansion",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>What VICI’s latest earnings tell you about the business</h2> <p>VICI Properties (VICI) just released its fourth quarter and full year 2025 results, giving you an updated look at how this experiential REIT is funding its dividend, using its balance sheet, and pursuing growth.</p> <p>For the quarter ended December 31, 2025, VICI reported revenue of US$1,013.09 million versus US$976.05 million a year earlier, with net income of US$604.77 million compared with US$614.59 million.</p> <p>Basic and diluted earnings per share from continuing operations were US$0.57, slightly below the US$0.58 level a year earlier, while adjusted funds from operations for the quarter rose 6.8% year over year.</p> <p>For the full year, revenue came in at US$4,006.12 million compared with US$3,849.21 million, and net income was US$2,775.49 million versus US$2,678.81 million in the prior year.</p> <p>Full year basic and diluted earnings per share from continuing operations were US$2.61 compared with US$2.56 a year earlier, alongside VICI’s eighth consecutive annual dividend increase and a 4.0% raise to the quarterly payout.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-vici/vici-properties\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for VICI Properties.</a></p> <p>VICI’s latest earnings drop into a period where the share price has picked up, with a 1‑month share price return of 8.32% and a year to date share price return of 7.32%. However, the 1 year total shareholder return is slightly negative at 1.58% and the 5 year total shareholder return sits at 34.16%, suggesting recent momentum is rebuilding after a softer stretch.</p> <p>If this update on experiential real estate has you thinking about where else growth and income might come from, it could be a good moment to broaden your search with <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">19 top founder-led companies</a>.</p> <p>With VICI trading at US$30.21 and the supplied data pointing to a sizeable gap to analyst targets and an intrinsic value estimate, the key question is simple: is this a rare discount on experiential real estate, or is the market already baking in future growth?</p> <h2>Most Popular Narrative: 14% Undervalued</h2> <p>With VICI Properties last closing at $30.21 and the most followed narrative pointing to a fair value of $35.13, the story frames the stock as trading at a clear discount based on long term cash flow assumptions.</p> <blockquote> <p><em>The company's scale, access to $2.9 billion in liquidity, and disciplined internal funding position enable accretive acquisitions and partnerships without near-term dependence on capital markets; this supports earnings and AFFO per share growth while maintaining low G&amp;A expenses and strong net margins.</em></p> <p><em>Ongoing tenant reinvestment in VICI-owned properties, catalyzed by favorable tax law changes (bonus depreciation), and continued capital deployment into high-demand experiential real estate (for example, theme parks, sports facilities, convention hotels) are expected to increase asset value and future rental income, contributing to long-term earnings and net asset value expansion.</em></p> </blockquote> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/edrv9zsd-rising-us-experiential-demand-will-unlock-long-term-value-pcsv\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Want to see what earnings path, margin profile, and future valuation multiple underpin that gap to $35.13? The narrative leans on specific growth, profitability, and discount rate assumptions that could surprise you when you line them up against your own expectations.</p> <p><strong>Result: Fair Value of $35.13 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/edrv9zsd-rising-us-experiential-demand-will-unlock-long-term-value-pcsv\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, this depends on physical casinos and experiential assets remaining attractive, while tenant concentration and lending exposures do not begin to pressure rents or margins.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-vici/vici-properties\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this VICI Properties narrative.</a></p> <h2>Next Steps</h2> <p>Mixed signals or a clear story: either way, it makes sense to look at the numbers yourself, weigh the trade offs, and move fast if needed, starting with <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-vici/vici-properties\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 1 important warning sign</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If VICI has sharpened your thinking, do not stop here. Use the Simply Wall St Screener to line up your next few candidates before the crowd catches on.</p> <ul> <li>Target value opportunities by comparing fundamentals with price and see which names stand out across <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">47 high quality undervalued stocks</a>.</li> <li>Strengthen your income stream by reviewing companies with reliable payouts highlighted in <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a>.</li> <li>Prioritise resilience by scanning companies with measured risk profiles featured in <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/us\" rel=\"noopener noreferrer\" target=\"_blank\">76 resilient stocks with low risk scores</a>.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:16:03",
            "link": "https://simplywall.st/stocks/us/real-estate/nyse-vici/vici-properties/news/assessing-vici-properties-vici-valuation-after-mixed-q4-resu",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Assessing Azelis Group (ENXTBR:AZE) Valuation After Weaker Full Year 2025 Results And Lower Dividend",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><p>Azelis Group (ENXTBR:AZE) shares are in focus after the company reported full year 2025 results showing lower sales and net income, alongside a proposed €0.226 per share dividend with a late June ex dividend date.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/be/capital-goods/ebr-aze/azelis-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Azelis Group.</a></p> <p>The full year 2025 results and lower proposed dividend come after a year where Azelis Group’s share price return slipped, with a year to date share price return of 10.12% and a 1 year total shareholder return decline of 53.49%, hinting that sentiment has weakened despite a recent 1 day share price return of 1.57%.</p> <p>If this update has you rethinking where growth might come from, it could be a good moment to broaden your search with our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/global\" rel=\"noopener noreferrer\" target=\"_blank\">96 top founder-led companies</a>.</p> <p>With earnings under pressure, a lower dividend and the share price well below some valuation estimates, the key question is whether Azelis Group now offers value or if the market is already pricing in its future growth potential.</p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Most Popular Narrative: 36.4% Undervalued</h2> <p>With Azelis Group last closing at €8.40 against a narrative fair value of €13.20, the current setup puts a clear spotlight on the gap between price and expectations.</p> <blockquote> <p><em>The analysts have a consensus price target of €19.557 for Azelis Group based on their expectations of its future earnings growth, profit margins and other risk factors. However, there is a degree of disagreement amongst analysts, with the most bullish reporting a price target of €24.0, and the most bearish reporting a price target of just €16.0.</em></p> </blockquote> <p><em><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/slskwhgx-recovery-will-likely-emerge-after-industry-pressures-ease-in-2026\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></em></p> <p>Curious what earnings path and margin rebuild need to play out for that gap to close? The narrative leans on steady revenue gains, firmer profitability and a richer future earnings multiple, all running through a single discount rate that does a lot of heavy lifting.</p> <p><strong>Result: Fair Value of €13.20 (UNDERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/slskwhgx-recovery-will-likely-emerge-after-industry-pressures-ease-in-2026\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, you also need to weigh geopolitical uncertainty and higher distribution costs. These could pressure margins and keep cash conversion and leverage in sharper focus.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/be/capital-goods/ebr-aze/azelis-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Azelis Group narrative.</a></p> <h2>Next Steps</h2> <p>If this mix of pressure and potential feels finely balanced, take a closer look at the full picture now to shape your own view using <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/be/capital-goods/ebr-aze/azelis-group-shares\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 4 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>Before you log off, you can increase your chances of spotting opportunities that fit your style by scanning a few targeted lists built from clear, transparent data.</p> <ul> <li>Focus your attention on quality at a discount by checking our screener of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">221 high quality undervalued stocks</a> that may warrant a closer look.</li> <li>Strengthen your income toolkit by reviewing a curated set of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/global\" rel=\"noopener noreferrer\" target=\"_blank\">445 dividend fortresses</a> that could complement Azelis Group in a diversified portfolio.</li> <li>Protect the downside first by scanning a hand picked group of <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/global\" rel=\"noopener noreferrer\" target=\"_blank\">324 resilient stocks with low risk scores</a> before the rest of the market catches on.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:06:36",
            "link": "https://simplywall.st/stocks/be/capital-goods/ebr-aze/azelis-group-shares/news/assessing-azelis-group-enxtbraze-valuation-after-weaker-full",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Record H1 Results and Fast Sand King Payback Will Impact Ora Banda Mining (ASX:OBM) Investors",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Ora Banda Mining Limited has reported record half-year results for the six months to 31 December 2025, with gold production rising 32% to 62,631 ounces and revenue increasing to A$336.28 million, alongside net income of A$96.3 million.</li> <li>A key highlight was the rapid capital payback at the Sand King underground mine within 12 months, supporting strong free cash flow and funding for projects such as the planned ~3 mtpa mill and the restart of open pit mining at Waihi.</li> <li>We will now examine how the record production and rapid Sand King payback shape Ora Banda’s investment narrative and future project funding.</li> </ul><p>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/au\" rel=\"noopener noreferrer\" target=\"_blank\">7 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>What Is Ora Banda Mining's Investment Narrative?</h2><p>For Ora Banda, the big picture an investor needs to buy into is relatively straightforward: a mid-tier gold producer using strong recent profitability to self-fund the next leg of its growth. The latest half-year update, with record output and A$96.3 million in net income, reinforces that story by showing Sand King is not just online, but already repaid and throwing off cash. That materially strengthens the near-term funding case for the proposed ~3 mtpa mill and Waihi open pit restart, and may ease concerns about overreliance on the new debt facility. At the same time, the sharp share price pullback over the past month suggests the market is still focused on execution risk, especially around sustaining margins and converting today’s strong free cash flow into durable returns if gold prices soften.</p> However, one risk around sustaining current margins and cash flows deserves closer attention. \nOra Banda Mining's shares have been on the rise but are still potentially undervalued. <a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/stocks/au/materials/asx-obm/ora-banda-mining-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Find out how large the opportunity might be</a>.<h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/au/materials/asx-obm/ora-banda-mining-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ASX:OBM 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/10ee5398-4b96-4b2c-b0ad-b48a665e44bf/chart/quote-price\" width=\"746\"/></a><figcaption>ASX:OBM 1-Year Stock Price Chart</figcaption></figure> <p>Eleven fair value estimates from the Simply Wall St Community span A$1.11 to about A$4.36 per share, showing wide disagreement on what Ora Banda is worth. When you set that against the recent record half-year results and reliance on continued operational delivery at Sand King, it underlines how differently investors can weigh the same catalysts and risks, and why comparing multiple viewpoints can be useful.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/au/materials/asx-obm/ora-banda-mining-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 11 other fair value estimates on Ora Banda Mining</a> - why the stock might be worth 14% less than the current price!</p><h2>Decide For Yourself</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Ora Banda Mining research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/au/materials/asx-obm/ora-banda-mining-shares\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards and 1 important warning sign</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/au/materials/asx-obm/ora-banda-mining-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Ora Banda Mining research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Ora Banda Mining's overall financial health at a glance.</li></ul><h2>Contemplating Other Strategies?</h2><p>Early movers are already taking notice. See the stocks they're targeting before they've flown the coop:</p><ul><li>The future of work is here. Discover the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 top robotics and automation stocks</a> leading the charge in AI-driven automation and industrial transformation.</li><li>Invest in the nuclear renaissance through our list of <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473644/nuclear-renaissance/global\" rel=\"noopener noreferrer\" target=\"_blank\">84 elite nuclear energy infrastructure plays</a> powering the global AI revolution.</li><li>The best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 smaller AI-focused companies with strong growth potential</a> through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-28 16:06:36",
            "link": "https://simplywall.st/stocks/au/materials/asx-obm/ora-banda-mining-shares/news/how-record-h1-results-and-fast-sand-king-payback-will-impact",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smithfield Foods Sioux Falls Expansion Draws Focus To Costs And Valuation",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Smithfield Foods, NasdaqGS:SFD, plans to build a new packaged meats and fresh pork processing facility in Sioux Falls, South Dakota.</li> <li>The new facility is intended to replace the company’s historic existing plant in the city.</li> <li>The expansion is aimed at improving operational efficiency and supporting the surrounding agricultural community.</li> </ul> <p>For investors following NasdaqGS:SFD, this project comes with the stock trading at $24.88 and a return of 24.9% over the past year. That kind of move often prompts closer attention to how management is reshaping the business and where capital is being deployed.</p> <p>The planned facility is positioned to influence how Smithfield runs its pork and packaged meats operations in the region, which may matter for costs, capacity, and supply reliability. It also puts a spotlight on relationships with employees and local suppliers, which can be important inputs when you think about the company’s long term operating profile.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-sfd/smithfield-foods/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Smithfield Foods</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NasdaqGS/SFD\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Smithfield Foods.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-sfd/smithfield-foods/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NasdaqGS:SFD Earnings &amp; Revenue Growth as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/ac33fc4b-33a2-40a5-8910-3c4a63795a76/chart/earnings-and-revenue-growth?date=2026-02-28\" width=\"746\"/></a><figcaption>NasdaqGS:SFD Earnings &amp; Revenue Growth as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_hidden_strengths\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-sfd/smithfield-foods\" rel=\"noopener noreferrer\" target=\"_blank\">2 things going right for Smithfield Foods that this headline doesn't cover.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Quick Assessment</h3> <ul> <li><strong>⚖️ Price vs Analyst Target</strong>: At US$24.88 versus a US$29.36 analyst target, the current price is roughly 15% below consensus.</li> <li><strong>✅ Simply Wall St Valuation</strong>: The shares are described as trading about 67.1% below an internal fair value estimate.</li> <li><strong>✅ Recent Momentum</strong>: A 30 day return of roughly 5.2% suggests investors have been incrementally more positive lately.</li> </ul> <p>To assess whether it may be the right time to buy, sell or hold Smithfield Foods, you can review Simply Wall St's\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-sfd/smithfield-foods/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">company report for the latest analysis of Smithfield Foods's fair value</a>.</p> <h3>Key Considerations</h3> <ul> <li>📊 The new Sioux Falls facility could affect Smithfield's cost base and capacity, which many investors watch closely for a large processor.</li> <li>📊 It may be useful to monitor project spending, timelines and any updates to earnings guidance as the build-out progresses.</li> <li>⚠️ Construction projects of this size can face cost overruns or delays, which may affect cash flow and short-term returns.</li> </ul> <h3>Dig Deeper</h3> <p>For a fuller picture, including more detail on risks and potential rewards, you can review the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-sfd/smithfield-foods\" rel=\"noopener noreferrer\" target=\"_blank\">complete Smithfield Foods analysis</a>. You can also visit the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NasdaqGS/SFD\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Smithfield Foods</a> to see how other investors believe this latest news fits into the company's broader narrative.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:06:36",
            "link": "https://simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-sfd/smithfield-foods/news/smithfield-foods-sioux-falls-expansion-draws-focus-to-costs",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is Capital Power’s New CFO Signaling a Shift in Strategic Finance Priorities for (TSX:CPX)?",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Capital Power Corporation has appointed Kevin MacIntosh as Chief Financial Officer, effective March 16, 2026, bringing over 30 years of global energy finance leadership, including senior roles at Suncor Energy and Irving Oil. </li> <li>His background in complex cross-border operations, ERP transformation, and integrating large-scale energy assets may reshape how Capital Power manages financial planning, reporting, and future growth initiatives. </li> <li>We’ll now explore how MacIntosh’s extensive global energy finance experience could influence Capital Power’s existing investment narrative and long-term outlook.</li> </ul><p>Find <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/ca\" rel=\"noopener noreferrer\" target=\"_blank\">8 companies with promising cash flow potential yet trading below their fair value</a>.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Capital Power Investment Narrative Recap</h2><p>To own Capital Power, you need to be comfortable with a regulated and merchant power producer that is investing for long term North American demand while managing carbon, interest cost, and recontracting risks. The appointment of Kevin MacIntosh as CFO does not materially change the key near term catalyst, which remains execution on growth and integration in U.S. merchant markets, or the biggest risk, which is weaker than expected power demand or contract pricing.</p> <p>The December 2025 memorandum of understanding with Apollo Funds for up to US$3.0 billion of equity to pursue U.S. merchant natural gas assets is the clearest link to this CFO change, as MacIntosh’s multi jurisdiction and integration background aligns directly with scaling and operating such assets. How effectively Capital Power balances this expansion with its carbon and financing risk profile will be central to how the current growth narrative plays out.</p> <p>But investors should also recognize that expectations around recontracting existing capacity at attractive prices may not fully account for...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/ca/utilities/tsx-cpx/capital-power-shares/88qktb3y-analysts-raise-targets-for-capital-power-on-improved-margins-and-strong-growth-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on Capital Power (it's free!)</a></p><p>Capital Power's narrative projects CA$4.1 billion revenue and CA$521.7 million earnings by 2028. This requires 5.0% yearly revenue growth and a CA$92.3 million earnings decrease from CA$614.0 million today.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/ca/utilities/tsx-cpx/capital-power-shares/88qktb3y-analysts-raise-targets-for-capital-power-on-improved-margins-and-strong-growth-outlook\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how Capital Power's forecasts yield a CA$74.54 fair value</a>, a 16% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/ca/utilities/tsx-cpx/capital-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"TSX:CPX 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/7c33fff1-dfb6-46e3-9452-1bc859b31b1d/chart/quote-price\" width=\"746\"/></a><figcaption>TSX:CPX 1-Year Stock Price Chart</figcaption></figure> <p>Three members of the Simply Wall St Community currently place Capital Power’s fair value between CA$57.14 and CA$138.48, underlining how far apart individual views can be. You should weigh those differing opinions against the risk that future contract renewals could face pricing pressure if new renewable supply intensifies, and consider how that might affect the company’s ability to support its investment and dividend plans over time.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/ca/utilities/tsx-cpx/capital-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 3 other fair value estimates on Capital Power</a> - why the stock might be worth over 2x more than the current price!</p><h2>Form Your Own Verdict</h2><p>Don't just follow the ticker - dig into the data and build a conviction that's truly your own.</p><ul><li>A great starting point for your Capital Power research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/ca/utilities/tsx-cpx/capital-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">2 key rewards and 3 important warning signs</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/ca/utilities/tsx-cpx/capital-power-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Our free Capital Power research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Capital Power's overall financial health at a glance.</li></ul><h2>Curious About Other Options?</h2><p>Right now could be the best entry point. These picks are fresh from our daily scans. Don't delay:</p><ul><li>Capitalize on the AI infrastructure supercycle with our selection of the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473744/ai-infrastructure-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">33 best 'picks and shovels' of the AI gold rush</a> converting record-breaking demand into massive cash flow.</li><li>This technology could replace computers: discover <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/282/quantum-computing-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">23 stocks that are working to make quantum computing a reality</a>.</li><li>AI is about to change healthcare. These <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434426/healthcare-ai/ca\" rel=\"noopener noreferrer\" target=\"_blank\">4 stocks are working on everything from early diagnostics to drug discovery</a>. The best part - they are all under $10b in market cap - there's still time to get in early.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-28 16:06:36",
            "link": "https://simplywall.st/stocks/ca/utilities/tsx-cpx/capital-power-shares/news/is-capital-powers-new-cfo-signaling-a-shift-in-strategic-fin",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Is It Too Late To Consider Iron Mountain (IRM) After Its Strong Multi Year Rally",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>If you are wondering whether Iron Mountain's current share price still offers value or if most of the upside is already reflected, you are not alone. This article is designed to help you frame that question clearly.</li> <li>The stock closed at US$108.33, with a 1.8% decline over the last 7 days, a 17.4% gain over 30 days, a 30.1% return year to date, a 20.5% return over 1 year, a 120.6% return over 3 years and a 273.5% return over 5 years. This gives important context before weighing up valuation.</li> <li>Recent coverage has focused on Iron Mountain's positioning as a real estate and data focused business, alongside ongoing interest in how traditional storage assets and data center exposure fit together for long term investors. These themes help explain why the share price performance over multiple time frames is drawing attention from investors who care about both income and growth potential.</li> <li>On our checks, Iron Mountain scores 5 out of 6 on valuation, which you can see in more detail in its <a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-irm/iron-mountain/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">valuation score</a>. Next we will walk through the standard valuation approaches before finishing with a way to think about value that goes beyond any single model.</li> </ul> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_industry_performance_contextual\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-irm/iron-mountain/past\" rel=\"noopener noreferrer\" target=\"_blank\">Iron Mountain delivered 20.5% returns over the last year. See how this stacks up to the rest of the Specialized REITs industry.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Approach 1: Iron Mountain Discounted Cash Flow (DCF) Analysis</h3> <p>A Discounted Cash Flow model takes estimates of a company’s future cash flows and then discounts them back to today’s dollars to arrive at an implied value per share. For Iron Mountain, this version of the DCF uses adjusted funds from operations as a proxy for free cash flow to equity.</p> <p>The model starts from Iron Mountain’s last twelve months free cash flow of about $1.54b, then uses analyst estimates for the next few years and extends them out to 2035. By 2030, projected free cash flow is $2.49b, with intermediate annual projections between 2026 and 2035 that are either based on analyst forecasts or extrapolated estimates by Simply Wall St.</p> <p>Discounting this stream of projected cash flows results in an estimated intrinsic value of about $155.76 per share. Compared with the recent share price of US$108.33, the model implies the stock trades at a 30.4% discount. On this DCF view, Iron Mountain screens as undervalued.</p> <p><strong>Result: UNDERVALUED</strong></p> <p>Our Discounted Cash Flow (DCF) analysis suggests Iron Mountain is undervalued by 30.4%. Track this in your <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>, or discover <a class=\"company-report-links\" data-vars-link-type=\"cta_dcf_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">47 more high quality undervalued stocks</a>.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/real-estate/nyse-irm/iron-mountain/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"IRM Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/1f278899-edd3-4fb5-aca3-77a01574badb/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>IRM Discounted Cash Flow as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"dcf_explainer_cta\" href=\"https://www.simplywall.st/stocks/us/real-estate/nyse-irm/iron-mountain/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Head to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Iron Mountain.</a></p> <h3>Approach 2: Iron Mountain Price vs Sales</h3> <p>For a profitable company like Iron Mountain, the P/S ratio is a useful cross check because it compares what you are paying per share with the revenue the business generates per share. It is especially handy when earnings can be affected by non cash items or accounting choices, while sales remain a cleaner top line measure.</p> <p>What counts as a \"normal\" P/S ratio depends on how quickly investors expect sales to grow and how much risk they see in those expectations. Higher perceived growth or lower perceived risk can justify a higher multiple, while slower growth or higher uncertainty tends to line up with a lower ratio.</p> <p>Iron Mountain currently trades on a P/S ratio of 4.64x. That sits below the Specialized REITs industry average of 7.56x and below the peer group average of 7.32x. Simply Wall St's Fair Ratio for Iron Mountain is 5.32x, which estimates the P/S level that fits its earnings profile, industry, profit margin, size and risk characteristics. This Fair Ratio can be more tailored than a simple comparison with peers or industry averages because it folds in those company specific factors. With the current 4.64x P/S sitting below the 5.32x Fair Ratio, Iron Mountain appears undervalued on this metric.</p> <p><strong>Result: UNDERVALUED</strong></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/real-estate/nyse-irm/iron-mountain/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:IRM P/S Ratio as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/1f278899-edd3-4fb5-aca3-77a01574badb/chart/ps-multiple-vs-industry?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:IRM P/S Ratio as at Feb 2026</figcaption></figure> <p>P/S ratios tell one story, but what if the real opportunity lies elsewhere? <a class=\"company-report-links\" data-vars-link-type=\"cta_preferred_multiple_contextual\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/us\" rel=\"noopener noreferrer\" target=\"_blank\">Start investing in legacies, not executives. Discover our 19 top founder-led companies</a>.</p> <h3>Upgrade Your Decision Making: Choose your Iron Mountain Narrative</h3> <p>Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, which are simply your story about a company linked directly to the numbers behind its fair value, such as what you think Iron Mountain can earn, how quickly revenue might grow, and what margin range feels reasonable.</p> <p>On Simply Wall St, Narratives live in the Community page and turn that story into a forecast and a fair value estimate, then keep it updated automatically when new data arrives, such as analyst revisions, earnings results or news.</p> <p>That makes it easier for you to compare the Fair Value from your Narrative with Iron Mountain’s current share price and decide whether you view the stock as offering enough potential reward, too little, or something in between.</p> <p>For example, one Iron Mountain Narrative on the platform currently anchors on a fair value of about US$65.53 while another stretches to about US$160.00. This shows how two investors looking at the same business, from legacy storage risk on one side to information infrastructure opportunity on the other, can reach very different yet clearly framed views.</p> <p>For Iron Mountain, however, we will make it really easy for you with previews of two leading Iron Mountain Narratives:</p> <p><a href=\"/us/real-estate/nyse-irm/iron-mountain/xn8xw1oo-legacy-data-management-with-optionality-in-digital-and-infrastructure-expansion?utm_medium=finance_user&amp;utm_campaign=cta_bull_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐂 Iron Mountain Bull Case</strong></a></p> <p>Fair value: US$160.00</p> <p>Implied discount to this fair value: 32.3% below the narrative fair value based on the recent US$108.33 share price</p> <p>Revenue growth assumption: very large, reflecting a multi fold increase from the current base</p> <ul> <li>Frames Iron Mountain as a global information management REIT with deep exposure to regulated sectors like healthcare, financial services and government, where compliance needs and high switching costs support long contracts.</li> <li>Sees the combination of sticky physical storage and expanding digital and data center services as a hybrid model, with legacy assets supplying cash and newer offerings adding optionality and new revenue pillars.</li> <li>Argues that as customers upgrade infrastructure and refine data governance, Iron Mountain’s focus on secure colocation, digital transformation and lifecycle management can support meaningful growth in information infrastructure services.</li> </ul> <p><a href=\"/us/real-estate/nyse-irm/iron-mountain/a5ubyqkq-falling-legacy-demand-will-burden-data-center-margins-1jbl?utm_medium=finance_user&amp;utm_campaign=cta_bear_narrative_link&amp;utm_source=post\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><strong>🐻 Iron Mountain Bear Case</strong></a></p> <p>Fair value: US$65.53</p> <p>Implied downside to this fair value: 38.4% below the recent US$108.33 share price</p> <p>Revenue growth assumption: 9.19%</p> <ul> <li>Highlights the risk that faster cloud adoption and digital transformation reduce demand for legacy physical storage, while tougher competition and higher costs in data centers pressure margins.</li> <li>Points to ongoing capital needs, sustainability requirements and potential commoditization in data centers as factors that could strain free cash flow, leverage and pricing power over time.</li> <li>Bases its lower fair value on analyst assumptions for mid single digit revenue growth, higher future profit margins and a lower future P/E, arguing that current market expectations may already be demanding.</li> </ul> <p>If seeing both sides laid out like this helps you clarify your own view, the next step is to go straight to the full narratives, compare the assumptions with your expectations for Iron Mountain and decide which story feels closer to how you think the business can perform.</p> <p>Do you think there's more to the story for Iron Mountain? <a class=\"company-report-links\" data-vars-link-type=\"cta_create_narrative_community\" href=\"https://simplywall.st/stock/NYSE/IRM\" rel=\"noopener noreferrer\" target=\"_blank\">Head over to our Community to see what others are saying!</a></p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/us/real-estate/nyse-irm/iron-mountain\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:IRM 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/1f278899-edd3-4fb5-aca3-77a01574badb/chart/quote-price?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:IRM 1-Year Stock Price Chart</figcaption></figure> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-28 16:06:36",
            "link": "https://simplywall.st/stocks/us/real-estate/nyse-irm/iron-mountain/news/is-it-too-late-to-consider-iron-mountain-irm-after-its-stron",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ferrovial (BME:FER) Valuation Check After Recent Share Price Strength And Consensus Target Gap",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Recent performance snapshot</h2> <p>Ferrovial (BME:FER) has drawn investor attention after a recent move in its share price, with the stock last closing at €63.16 and delivering a 0.6% return over the past day.</p> <p>That short term gain sits alongside returns of 2.3% over the past week and about 11% over the past month, prompting some investors to reassess how the company’s current valuation lines up with its recent financial profile.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/es/capital-goods/bme-fer/ferrovial-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Ferrovial.</a></p> <p>Looking beyond the recent move, Ferrovial’s 1 month share price return of 11.2% and year to date share price return of 14.1% sit alongside a 1 year total shareholder return of 50.0%, suggesting momentum has been strong over both shorter and longer horizons.</p> <p>If Ferrovial’s run has you thinking about infrastructure and energy themes, it could be a good moment to see what else is out there through our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_power_grid\" href=\"https://simplywall.st/discover/investing-ideas/473750/power-grid-technology-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">23 power grid technology and infrastructure stocks</a>.</p> <p>With Ferrovial posting double digit returns over multiple timeframes and trading close to analyst targets, the real question now is whether the current price still leaves room for upside or if the market is already pricing in future growth.</p> <h2>Most Popular Narrative: 5.4% Overvalued</h2> <p>Ferrovial last closed at €63.16, while the most followed narrative pegs fair value at €59.90, which helps frame how stretched expectations might be.</p> <blockquote> <p><em>The analysts have a consensus price target of €46.987 for Ferrovial based on their expectations of its future earnings growth, profit margins and other risk factors. However, there is a degree of disagreement amongst analysts, with the most bullish reporting a price target of €56.0, and the most bearish reporting a price target of just €38.8.</em></p> </blockquote> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_narrative_prompt_after_quote\" href=\"https://www.simplywall.st/narratives/8y152iv7-revenue-expansion-and-margin-pressure-will-shape-future-sector-fortunes\" rel=\"noopener noreferrer\" target=\"_blank\">Read the complete narrative.</a></p> <p>Curious what justifies a fair value above consensus targets? The narrative leans on modest revenue growth, slimmer margins, and a richer future earnings multiple than today. Want the full story?</p> <p><strong>Result: Fair Value of €59.90 (OVERVALUED)</strong></p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_ai_narrative\" href=\"https://www.simplywall.st/narratives/8y152iv7-revenue-expansion-and-margin-pressure-will-shape-future-sector-fortunes\" rel=\"noopener noreferrer\" target=\"_blank\">Have a read of the narrative in full and understand what's behind the forecasts.</a></p> <p>However, resilience in North American toll assets or successful execution of Ferrovial’s sizeable order book could support stronger earnings and challenge the current overvaluation narrative.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/es/capital-goods/bme-fer/ferrovial-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Ferrovial narrative.</a></p> <h2>Next Steps</h2> <p>Mixed signals on value and momentum so far? Take a moment to weigh both the concerns and the upside by starting with our breakdown of <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_rewards_analysis\" href=\"https://www.simplywall.st/stocks/es/capital-goods/bme-fer/ferrovial-shares\" rel=\"noopener noreferrer\" target=\"_blank\">1 key reward and 2 important warning signs</a>.</p> <h2>Looking for more investment ideas?</h2> <p>If Ferrovial has sharpened your focus, do not stop here. Use this momentum to broaden your watchlist with ideas that fit your own style and risk comfort.</p> <ul> <li>Hunt for quality at a discount by scanning our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">220 high quality undervalued stocks</a>, built from companies with strong fundamentals that currently trade below their assessed worth.</li> <li>Look for income potential by reviewing <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/global\" rel=\"noopener noreferrer\" target=\"_blank\">445 dividend fortresses</a>, a collection of higher yielding payers that may suit investors who want returns in cash as well as price moves.</li> <li>Play offense without forgetting defense by checking the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_low_risk\" href=\"https://simplywall.st/discover/investing-ideas/473631/low-risk-leaders/global\" rel=\"noopener noreferrer\" target=\"_blank\">325 resilient stocks with low risk scores</a>, focused on businesses that score well on resilience and financial stability.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>AI Stock Screener &amp; Alerts</h3><p>Our new AI Stock Screener scans the market every day to uncover opportunities.</p><p>• Dividend Powerhouses (3%+ Yield)<br/>• Undervalued Small Caps with Insider Buying<br/>• High growth Tech and AI Companies<br/><br/>Or build your own from over 50 metrics.</p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/stock-screener\" target=\"_blank\">Explore Now for Free</a></div></div>",
            "pub_date": "2026-02-28 16:01:27",
            "link": "https://simplywall.st/stocks/es/capital-goods/bme-fer/ferrovial-shares/news/ferrovial-bmefer-valuation-check-after-recent-share-price-st",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A Look At Migdal Insurance And Financial Holdings (TASE:MGDL) Valuation After Sector Wide Tel Aviv Market Selloff",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>Market jolt puts Migdal Insurance and Financial Holdings (TASE:MGDL) in focus</h2> <p>Migdal Insurance and Financial Holdings (TASE:MGDL) was hit hard as insurance stocks and banks led a sharp drop on the Tel Aviv Stock Exchange. This has put the insurer’s recent share performance under closer investor scrutiny.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_company_latest_analysis\" href=\"https://www.simplywall.st/stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">See our latest analysis for Migdal Insurance and Financial Holdings.</a></p> <p>While today’s sector wide selloff dragged Migdal Insurance and Financial Holdings lower, its recent record tells a different story, with a 30 day share price return of 7.21% and a one year total shareholder return of 128.13% hinting that longer term momentum has been strong even after short term volatility.</p> <p>If this move in financials has you looking wider than a single insurer, it could be a good moment to scan the market for <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_founder_led\" href=\"https://simplywall.st/discover/investing-ideas/473625/top-founder-led-companies/global\" rel=\"noopener noreferrer\" target=\"_blank\">96 top founder-led companies</a> and see what else stands out.</p> <p>With Migdal Insurance and Financial Holdings now trading at an intrinsic value premium and a strong multi year total return behind it, you have to ask: is there still upside here, or is the market already pricing in future growth?</p> <h2>Price-to-Earnings of 24.7x: Is it justified?</h2> <p>Migdal Insurance and Financial Holdings currently trades on a P/E of 24.7x, compared to a peer average of 17.8x and an Asian insurance sector average of 12x, which points to a rich valuation against both local and broader industry groups.</p> <p>The P/E ratio tells you how much investors are paying for each ₪1 of current earnings. For an insurer such as MGDL, a higher P/E often reflects expectations for steadier earnings quality, prospects for future profitability, or simply strong demand for the shares relative to recent earnings, even when near term profit trends are mixed.</p> <p>In MGDL’s case, the company is flagged as having high quality earnings and a modest 1.1% annual earnings growth rate over the past 5 years. However, earnings fell 56.9% over the last year and net profit margins declined from 10.6% to 2.1%. Against that backdrop, a 24.7x P/E suggests the market is placing a higher price on each unit of current earnings than on peers, despite recent pressure on profitability and a return on equity of 7.6% that is described as low.</p> <p>The comparison to the Asian insurance industry average P/E of 12x is even more stark. MGDL’s multiple is more than double that level, which signals that buyers are willing to pay a premium relative to regional insurers with lower P/E ratios. If the P/E were to move closer to those lower peer or regional averages, it would imply a very different price for the same earnings base.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_preferred_multiple_cta\" href=\"https://www.simplywall.st/stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">See what the numbers say about this price — find out in our valuation breakdown.</a></p> <p><strong>Result: Price-to-Earnings of 24.7x (OVERVALUED)</strong></p> <p>However, there are clear risks, including the recent 56.9% earnings drop, the thinner 2.1% net margin, and a valuation premium that could unwind if sentiment cools.</p> <p><a class=\"company-report-links\" data-vars-link-type=\"risks_narrative_cta\" href=\"https://www.simplywall.st/stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">Find out about the key risks to this Migdal Insurance and Financial Holdings narrative.</a></p> <h2>Another view from the SWS DCF model</h2> <p>The P/E of 24.7x already looks full, but our DCF model paints an even starker picture, with an estimated future cash flow value of ₪7.35 versus the current price of ₪16.95. If both earnings and cash flow signals are this stretched, what exactly are you paying up for?</p> <p><a class=\"company-report-links\" data-vars-link-type=\"alternate_dcf_cta\" href=\"https://www.simplywall.st/stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Look into how the SWS DCF model arrives at its fair value.</a></p> <p></p><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st//stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares/valuation\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"MGDL Discounted Cash Flow as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/c9ca6f03-cb97-486a-9bde-d15bba5ec2f6/chart/dcf?date=2026-02-28\" width=\"746\"/></a><figcaption>MGDL Discounted Cash Flow as at Feb 2026</figcaption></figure><p> </p><p>Simply Wall St performs a discounted cash flow (DCF) on every stock in the world every day (<a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://www.simplywall.st/stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">check out Migdal Insurance and Financial Holdings for example</a>). We show the entire calculation in full. You can track the result in your <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a> and be alerted when this changes, or use our stock screener to discover <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">220 high quality undervalued stocks</a>. If you <a class=\"company-report-links\" data-vars-link-type=\"dcf_cta\" href=\"https://simplywall.st/features/stock-screener\" rel=\"noopener noreferrer\" target=\"_blank\">save a screener</a> we even alert you when new companies match - so you never miss a potential opportunity.</p> <h2>Next Steps</h2> <p>If this all sounds cautious, that is the point. You do not need to wait to form your own view. Start by checking the <a class=\"company-report-links\" data-vars-link-type=\"cta_risks_analysis\" href=\"https://www.simplywall.st/stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares\" rel=\"noopener noreferrer\" target=\"_blank\">1 important warning sign</a>.</p> <h2>Looking for more investment ideas?</h2> <p>Once you have formed a view on Migdal Insurance and Financial Holdings, consider broadening your watchlist with other clear, data driven stock ideas.</p> <ul> <li>Target reliable cash generators by scanning companies with strong fundamentals in our <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_solid_balance_sheet\" href=\"https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/global\" rel=\"noopener noreferrer\" target=\"_blank\">solid balance sheet and fundamentals stocks screener (370 results)</a> and see which ones meet your quality threshold.</li> <li>Look for value opportunities by reviewing the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_undervalued\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">220 high quality undervalued stocks</a> and compare how these names stack up on earnings, balance sheets and future potential.</li> <li>Explore potential portfolio stability and income by checking out the <a class=\"company-report-links\" data-vars-link-type=\"cta_screener_dividend\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/global\" rel=\"noopener noreferrer\" target=\"_blank\">445 dividend fortresses</a> that match your yield and risk comfort level.</li> </ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:01:27",
            "link": "https://simplywall.st/stocks/il/insurance/tase-mgdl/migdal-insurance-and-financial-holdings-shares/news/a-look-at-migdal-insurance-and-financial-holdings-tasemgdl-v-1",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US$1 Billion Buyback Authorization Could Be A Game Changer For News’ Capital Return Strategy (NWSA)",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>In February 2026, News Corporation authorized a new US$1.00 billion stock repurchase program covering its Class A and Class B shares, signaling management’s intention to reduce the share count and return additional capital to investors.</li> <li>This sizeable buyback adds a fresh capital allocation lever to a business already focused on digital subscriptions, data services, and operational efficiency, potentially reshaping how investors weigh its mix of growth and cash returns.</li> <li>We’ll now examine how this new US$1.00 billion repurchase authorization interacts with News Corporation’s existing buyback-led investment narrative.</li> </ul><p>Capitalize on the AI infrastructure supercycle with our selection of the <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473744/ai-infrastructure-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">33 best 'picks and shovels' of the AI gold rush</a> converting record-breaking demand into massive cash flow.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>News Investment Narrative Recap</h2><p>To own News Corp, you need to believe its shift toward digital subscriptions, data services, and real estate platforms can more than offset pressure on legacy print and ad revenue. The new US$1.00 billion buyback may support near term earnings per share and capital returns, but it does not materially change the key risk that slowing digital audience growth or weaker real estate activity could weigh on future revenue and margins.</p> <p>The most relevant recent development alongside the buyback is News Corp’s continued dividend of US$0.10 per share for the half year to December 31, 2025. Taken together, the dividend and repurchase authorization highlight a heavier emphasis on returning cash to shareholders at a time when digital real estate, data services, and subscription businesses remain central to the company’s growth and earnings story.</p> <p>But while higher capital returns may look appealing, investors also need to be aware of how concentrated earnings have become in a smaller set of core segments, and...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/media/nasdaq-nwsa/news/m1rw3d8h-digital-information-and-real-estate-will-shape-a-strong-future-s4oy\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on News (it's free!)</a></p><p>News’ narrative projects $9.3 billion revenue and $754.0 million earnings by 2028. This requires 3.2% yearly revenue growth and a roughly $274.0 million earnings increase from $480.0 million today.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/media/nasdaq-nwsa/news/m1rw3d8h-digital-information-and-real-estate-will-shape-a-strong-future-s4oy\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how News' forecasts yield a $34.05 fair value</a>, a 40% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/media/nasdaq-nwsa/news\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NWSA 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/14f8497e-b551-4ed6-8da7-ca6640854ebb/chart/quote-price\" width=\"746\"/></a><figcaption>NWSA 1-Year Stock Price Chart</figcaption></figure> <p>Compared with the consensus view, the lowest analysts were more cautious, assuming only about 2.1 percent annual revenue growth to around US$9.0 billion and earnings of roughly US$615.4 million, so you should weigh how this new US$1.00 billion buyback and capital deployment choice might either reinforce or challenge that more pessimistic path for News Corp’s future.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/media/nasdaq-nwsa/news\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 3 other fair value estimates on News</a> - why the stock might be worth as much as 40% more than the current price!</p><h2>The Verdict Is Yours</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your News research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/media/nasdaq-nwsa/news\" rel=\"noopener noreferrer\" target=\"_blank\">4 key rewards</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/media/nasdaq-nwsa/news\" rel=\"noopener noreferrer\" target=\"_blank\">Our free News research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate News' overall financial health at a glance.</li></ul><h2>Ready To Venture Into Other Investment Styles?</h2><p>Right now could be the best entry point. These picks are fresh from our daily scans. Don't delay:</p><ul><li>Rare earth metals are the new gold rush. Find out which <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 stocks are leading the charge</a>.</li><li>Find <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473076/high-quality-undervalued-stocks/us\" rel=\"noopener noreferrer\" target=\"_blank\">46 companies with promising cash flow potential yet trading below their fair value</a>.</li><li>The future of work is here. Discover the <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/473746/robotics-andamp-automation-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">30 top robotics and automation stocks</a> leading the charge in AI-driven automation and industrial transformation.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if News might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/media/nasdaq-nwsa/news/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-28 16:01:27",
            "link": "https://simplywall.st/stocks/us/media/nasdaq-nwsa/news/news/us1-billion-buyback-authorization-could-be-a-game-changer-fo",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target’s Cereal Shift And New Partnerships Weighed Against Stock Valuation",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>Target (NYSE:TGT) is phasing out cereals made with certified synthetic colors in what it describes as an industry first for a major retailer.</li> <li>The company is rolling out exclusive launches, including a limited Roller Rabbit collaboration with new product categories and in-store experiences.</li> <li>Target is also expanding its wellness assortment with brands such as AquaSonic and Cleanlogic while addressing the implications of a recent jury verdict in a premises liability case.</li> </ul> <p>At a share price of $113.79, NYSE:TGT reflects a mixed return profile, with a 30-day return of 11.8% and a 13.2% return year to date, alongside a 4.2% decline over the past year. Over 3 and 5 years, the stock shows declines of 23.6% and 23.8%, which gives important context as you weigh how much these brand and assortment changes might matter over time.</p> <p>For investors, the cereal ingredient shift, new wellness offerings, and the Roller Rabbit collection illustrate how Target is trying to differentiate its stores and respond to customer preferences. At the same time, the recent legal verdict highlights operating and reputational risks that can influence how consistently Target maintains customer trust as its broader business transformation continues.</p> <p>Stay updated on the most important news stories for <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://www.simplywall.st/stocks/us/consumer-retailing/nyse-tgt/target/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">Target</a> by adding it to your <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/stock-watchlist\" rel=\"noopener noreferrer\" target=\"_blank\">watchlist</a> or <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/features/portfolio\" rel=\"noopener noreferrer\" target=\"_blank\">portfolio</a>. Alternatively, explore our <a class=\"company-report-links\" data-vars-link-type=\"news_stay_updated_cta\" href=\"https://simplywall.st/stock/NYSE/TGT\" rel=\"noopener noreferrer\" target=\"_blank\">Community</a> to discover new perspectives on Target.</p> <figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://www.simplywall.st/stocks/us/consumer-retailing/nyse-tgt/target/future\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"NYSE:TGT Earnings &amp; Revenue Growth as at Feb 2026\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/1b112cc3-26db-4bc0-b6f1-6f18d783f54d/chart/earnings-and-revenue-growth?date=2026-02-28\" width=\"746\"/></a><figcaption>NYSE:TGT Earnings &amp; Revenue Growth as at Feb 2026</figcaption></figure> <p><a class=\"company-report-links\" data-vars-link-type=\"cta_news_risk_alert\" href=\"https://www.simplywall.st/stocks/us/consumer-retailing/nyse-tgt/target\" rel=\"noopener noreferrer\" target=\"_blank\">We've flagged 1 risk for Target. See which could impact your investment.</a></p> <div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h3>Quick Assessment</h3> <ul> <li><strong>⚖️ Price vs Analyst Target</strong>: At US$113.79, Target trades about 6.9% above the US$106.44 analyst price target, which is within the 10% band for a fair value signal.</li> <li><strong>✅ Simply Wall St Valuation</strong>: Simply Wall St flags Target as trading about 18.5% below its estimated fair value, which screens as undervalued.</li> <li><strong>✅ Recent Momentum</strong>: A 30 day return of roughly 11.8% shows short term positive momentum as this product news hits the market.</li> </ul> <p>There is only one way to know the right time to buy, sell or hold Target. Head to Simply Wall St's\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/consumer-retailing/nyse-tgt/target/valuation\" rel=\"noopener noreferrer\" target=\"_blank\">company report for the latest analysis of Target's fair value.</a></p> <h3>Key Considerations</h3> <ul> <li>📊 The cereal reformulation, wellness expansion and Roller Rabbit tie up all point to Target leaning into health and brand differentiation, which can affect how you think about its long term customer appeal.</li> <li>📊 Keep an eye on the P/E of 13.7 versus the Consumer Retailing industry average of about 22.5, the 4.01% dividend, and how traffic and basket data react to these assortment changes.</li> <li>⚠️ The recent premises liability verdict underlines operational and legal risk, which sits alongside Target's identified high level of debt in the risk checks.</li> </ul> <h3>Dig Deeper</h3> <p>For the full picture, including more risks and rewards, check out the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stocks/us/consumer-retailing/nyse-tgt/target\" rel=\"noopener noreferrer\" target=\"_blank\">complete Target analysis</a>. Alternatively, you can check out the\n<a class=\"company-report-links\" href=\"https://www.simplywall.st/stock/NYSE/TGT\" rel=\"noopener noreferrer\" target=\"_blank\">community page for Target</a> to see how other investors believe this latest news will impact the company's narrative.</p> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\">Valuation is complex, but we're here to simplify it.</h3><p>Discover if Target might be undervalued or overvalued with our detailed analysis, featuring <strong>fair value estimates, potential risks, dividends, insider trades, and its financial condition.</strong></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"/stocks/us/consumer-retailing/nyse-tgt/target/valuation\" target=\"_blank\">Access Free Analysis</a></div></div>",
            "pub_date": "2026-02-28 16:01:27",
            "link": "https://simplywall.st/stocks/us/consumer-retailing/nyse-tgt/target/news/targets-cereal-shift-and-new-partnerships-weighed-against-st",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stronger Q4, Upbeat Guidance and Buyback Might Change The Case For Investing In AptarGroup (ATR)",
            "description": "<div class=\"sc-d08486b0-3 byoTNg\" data-cy-id=\"article-content\"><ul> <li>In early February 2026, AptarGroup reported fourth-quarter results that topped expectations, issued upbeat first-quarter guidance, and approved a US$600 million stock repurchase program, with all three segments contributing to 5% core sales growth.</li> <li>This combination of broad-based operational momentum and a large buyback authorization underscores how AptarGroup is pairing innovation-led growth with more active capital return.</li> <li>We’ll now examine how AptarGroup’s stronger-than-expected quarter and sizeable repurchase plan may influence the company’s investment narrative and outlook.</li> </ul><p>We've uncovered the <a class=\"company-report-links\" data-vars-link-type=\"intro\" href=\"https://simplywall.st/discover/investing-ideas/473528/dividend-fortresses/us\" rel=\"noopener noreferrer\" target=\"_blank\">15 dividend fortresses</a> yielding 5%+ that don't just survive market storms, but thrive in them.</p><div class=\"relative grid grid-rows-[25px_auto] place-items-center bg-surface @container/article-body-ad [[data-brand='v2']_&amp;]:bg-surface-1\" data-cy-id=\"article-body-ad\"><div class=\"text-tiny text-softer\">Advertisement</div><div class=\"relative h-[250px] min-h-[250px] w-[300px] min-w-[300px] @[380px]/article-body-ad:h-[280px] @[380px]/article-body-ad:min-h-[280px] @[380px]/article-body-ad:w-[336px] @[380px]/article-body-ad:min-w-[336px]\"><div data-fuse=\"news_incontent_1\" id=\"news_incontent_1\"></div></div></div><h2>AptarGroup Investment Narrative Recap</h2><p>To own AptarGroup, you need to believe its drug delivery and sustainable packaging platforms can keep attracting high-value customers despite legal, regulatory, and demand headwinds. The Q4 beat and upbeat Q1 guidance support the view that innovation-led growth remains the key near-term catalyst, while elevated legal costs around intellectual property and uncertainty in emergency medicine demand still look like the biggest swing risks. This latest quarter does not remove those risks, but it may ease some concerns around execution.</p> <p>The new US$600 million stock repurchase program is the announcement most directly tied to this earnings release, because it adds a more visible capital return angle to the story just as all three segments delivered 5% core sales growth. For investors focused on catalysts, that combination can sharpen attention on how quickly AptarGroup converts its innovation and operational improvements into consistent earnings and cash flow, even while legal expenses and softer pharma sub-segments remain in the background.</p> <p>Yet investors should also be aware that ongoing legal expenses and uncertain emergency medicine demand could still...</p> <p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/materials/nyse-atr/aptargroup/vuti6kyf-atr-expanded-partnership-agreements-will-drive-long-term-healthcare-solutions\" rel=\"noopener noreferrer\" target=\"_blank\">Read the full narrative on AptarGroup (it's free!)</a></p><p>AptarGroup's narrative projects $4.3 billion revenue and $450.9 million earnings by 2028.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/materials/nyse-atr/aptargroup/vuti6kyf-atr-expanded-partnership-agreements-will-drive-long-term-healthcare-solutions\" rel=\"noopener noreferrer\" target=\"_blank\">Uncover how AptarGroup's forecasts yield a $161.43 fair value</a>, a 12% upside to its current price.</p><h2>Exploring Other Perspectives</h2><figure><a class=\"company-report-links\" data-vars-link-type=\"infographic\" href=\"https://simplywall.st/stocks/us/materials/nyse-atr/aptargroup\" rel=\"noopener noreferrer\" target=\"_blank\"><img alt=\"ATR 1-Year Stock Price Chart\" class=\"sc-3204b94-0 iJdSPa\" height=\"476\" loading=\"lazy\" src=\"https://images.simplywall.st/company/ae10b1af-602a-4968-9eab-35a4eaca3c65/chart/quote-price\" width=\"746\"/></a><figcaption>ATR 1-Year Stock Price Chart</figcaption></figure> <p>The lowest ranked analysts paint a much more cautious picture, assuming revenue of about US$4.1 billion and earnings near US$431 million by 2028, so you should compare that against this quarter’s stronger update and the potential impact of ongoing legal and regulatory pressures.</p><p><a class=\"company-report-links\" data-vars-link-type=\"integrated-pitch\" href=\"https://simplywall.st/community/narratives/us/materials/nyse-atr/aptargroup\" rel=\"noopener noreferrer\" target=\"_blank\">Explore 4 other fair value estimates on AptarGroup</a> - why the stock might be worth 8% less than the current price!</p><h2>Reach Your Own Conclusion</h2><p>Disagree with existing narratives? Extraordinary investment returns rarely come from following the herd, so go with your instincts.</p><ul><li>A great starting point for your AptarGroup research is our analysis highlighting <a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/materials/nyse-atr/aptargroup\" rel=\"noopener noreferrer\" target=\"_blank\">3 key rewards and 1 important warning sign</a> that could impact your investment decision.</li><li><a class=\"company-report-links\" data-vars-link-type=\"conclusion\" href=\"https://simplywall.st/stocks/us/materials/nyse-atr/aptargroup\" rel=\"noopener noreferrer\" target=\"_blank\">Our free AptarGroup research report</a> provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate AptarGroup's overall financial health at a glance.</li></ul><h2>Contemplating Other Strategies?</h2><p>Markets shift fast. These stocks won't stay hidden for long. Get the list while it matters:</p><ul><li>This technology could replace computers: discover <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/282/quantum-computing-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 stocks that are working to make quantum computing a reality</a>.</li><li>The latest GPUs need a type of rare earth metal called Terbium and there are only <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434418/rare-earth-metal-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">31 companies in the world exploring or producing it</a>. Find the list for free.</li><li>Outshine the giants: these <a class=\"company-report-links\" data-vars-link-type=\"conclusion-grid\" href=\"https://simplywall.st/discover/investing-ideas/434414/ai-penny-stocks/global\" rel=\"noopener noreferrer\" target=\"_blank\">22 early-stage AI stocks could fund your retirement</a>.</li></ul> <p><em> This article by Simply Wall St is general in nature. <strong>We provide commentary based on historical data\n    and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.</strong> It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your\n    financial situation. We aim to bring you long-term focused analysis driven by fundamental data.\n    Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\n    Simply Wall St has no position in any stocks mentioned.</em></p><div class=\"sc-80c0fb9d-0 hLZAWP\"><h3 class=\"m-0 text-balance text-mega font-medium mb-4 font-serif\"><strong>New: </strong>Manage All Your Stock Portfolios in One Place</h3><p>We've created the <strong>ultimate portfolio companion</strong> for stock investors, <strong>and it's free.</strong></p><p>• Connect an unlimited number of Portfolios and see your total in one currency<br/>• Be alerted to new Warning Signs or Risks via email or mobile<br/>• Track the Fair Value of your stocks<br/></p><a class=\"sc-kuACkN kjLJKA !text-[--s-button-primary-color-text] !no-underline\" data-focus=\"dashed\" href=\"https://simplywall.st/features/portfolio\" target=\"_blank\">Try a Demo Portfolio for Free</a></div></div>",
            "pub_date": "2026-02-28 16:01:27",
            "link": "https://simplywall.st/stocks/us/materials/nyse-atr/aptargroup/news/stronger-q4-upbeat-guidance-and-buyback-might-change-the-cas",
            "source": "simplywall",
            "kind": 1,
            "language": "en"
        }
    ]
}