{
    "data": [
        {
            "title": "Lululemon Founder Calls Board’s Response to his Proposals ‘Weak and Insufficient’",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><a href=\"https://shop.lululemon.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Lululemon Athletica</strong></a> Founder Dennis J. “Chip” Wilson, who remains one of the athleisurewear company’s largest shareholders, has stepped up his criticism of Lululemon’s current Board of Directors. Among other accusations, Wilson decried a “<strong>third</strong> failed succession planning process” that has the board in search of a permanent CEO following last month’s departure of longtime leader Calvin McDonald.</p>\n<p>Wilson also has been pushing changes to the board itself, proposing <strong>three</strong> potential new members in late <a href=\"https://www.retailtouchpoints.com/features/retail-movers-and-shakers/mcdonald-steps-down-as-lululemon-leader-company-begins-search-for-new-ceo\" rel=\"noreferrer noopener\" target=\"_blank\">December 2025</a>: Marc Maurer, former Co-CEO of <a href=\"https://www.on.com/en-us/\" rel=\"noreferrer noopener\" target=\"_blank\">On Holding AG</a>; Laura Gentile, former Chief Marketing Officer of <a href=\"https://www.espn.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>ESPN</em></a>; and Eric Hirshberg, former CEO of Activision Publishing, the largest segment of <a href=\"https://www.activisionblizzard.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Activision Blizzard</a>.</p>\n<p>“In an effort to spur the conversation forward, one of the candidates I put forward [Marc Maurer] has met with some directors,” said Wilson in a statement. However, “despite efforts, the board only engaged with our framework for the first time on Feb. 24, more than <strong>70</strong> days later. The response was weak and insufficient. The board indicated an openness to some unspecified director refreshment over a period of multiple years and a phased de-staggering of the board over time.”</p>\n<p>Wilson is seeking faster and more definitive actions: “We think shareholders expect the board to act with urgency, clarity and in good faith to reach a sensible resolution that benefits all shareholders. It is our expectation that the board provide us with specific detail on how many incumbent directors will be retiring (and by when and who they are), and when our candidates will be added. If the board engages as shareholders expect, there is no reason to believe we cannot have this resolved before March 13.”</p>\n<h3 class=\"wp-block-heading\"><strong>Calls for a Brand Product Committee to Oversee Creative Processes</strong></h3>\n<p>Wilson also called out the board’s rejection of his proposal to create a Brand Product Committee, which he called “part of highly effective oversight of the best creative businesses,” and something that he has seen work effectively at <a href=\"https://www.amersports.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Amer Sports, Inc.</strong></a> Such a committee would “give focus to one of Lululemon’s most pressing needs in between regularly scheduled board meetings, without supplanting the role of the full board as the ultimate decisionmaker on material issues facing the company. The fact that the Lululemon board rejected this idea, in my estimation, reflects the lack of experience this board has in understanding how to leverage creative, high-performance brands,” he added.</p>\n<p>Lululemon responded to Wilson’s latest criticisms by noting that the board has had “numerous meetings, with the goal of having a productive dialogue” with him, but added “We disagree with Mr. Wilson’s characterization of his interactions with the board.”</p>\n<p>The Lululemon statement also disputed the conditions for meeting Wilson’s candidates, saying Wilson was barring the board from interviewing them “unless the board agreed to a full set of settlement terms.” The statement said it “welcomed” the preliminary meeting with candidate Maurer and also that it “remains open to engaging with Mr. Wilson as well as the company’s other shareholders and will continue to take actions that we believe are in the best interests of all the company’s shareholders.”</p>\n<p></p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/lululemon-founder-wilson-calls-boards-response-to-his-proposals-weak-and-insufficient",
            "pub_date": "2026-02-28 03:16:42",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Walmart Settles FTC Charges Over Deceptive Delivery Driver Earnings",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><a href=\"https://corporate.walmart.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Walmart</strong></a> has agreed to a <strong>$100 million</strong> judgment to settle allegations from the <a href=\"https://www.ftc.gov/\" rel=\"noreferrer noopener\" target=\"_blank\">Federal Trade Commission</a> (FTC) and <strong>11</strong> states that the company deceived delivery drivers in its Spark Driver service about base pay, incentive pay and tips, costing them <strong>tens of millions</strong> of dollars in earnings. Spark Driver uses gig workers who decide whether to accept deliveries based on Walmart’s statements about the base pay and tips they can expect to receive.</p>\n<p>In its <a href=\"https://www.ftc.gov/system/files/ftc_gov/pdf/WalmartSparkDriverComplaint.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">complaint</a>, the FTC alleged that Walmart misled drivers about the amount of tips they would receive from an order, as well as deceiving them about base pay and tip amounts when Walmart modified “batch” orders — reducing drivers’ base pay and tips, without informing the drivers, when an order was removed from a multi-stop trip. Walmart also was accused of misrepresenting conditions for receiving incentive pay, for example by not clarifying that bonuses for referring new drivers would only be paid if the new driver performed deliveries in a particular zone or for a particular store.</p>\n<p>The complaint also alleged that Walmart deceived customers when it said that “100% of tips go to the driver,” saying the retailer failed to provide collected tips on multiple occasions, and did not refund the tip to customers either.</p>\n<h3 class=\"wp-block-heading\"><strong>Walmart Ordered to Set Up Earnings Verification Program</strong></h3>\n<p>A <a href=\"https://www.ftc.gov/system/files/ftc_gov/pdf/WalmartSparkDriver-Order.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">proposed order</a> for providing remedies to these practices includes requiring Walmart to:</p>\n<ul class=\"wp-block-list\">\n<li>Implement an earnings verification program to ensure drivers are paid promised earnings and tips;</li>\n<li>Not modify offers for base and incentive pay or tips after the initial offer is made, except under limited circumstances such as the driver’s failing to provide the required services; and</li>\n<li>Not misrepresent the earnings and other information included in the delivery offers made to Spark drivers.</li>\n</ul>\n<p>“Labor markets cannot function efficiently without truthful and non-misleading information about earnings and other material terms,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection in a statement.</p>\n<p>The states that joined the FTC in the complaint are Arizona, California, Colorado, Illinois, Michigan, North Carolina, Oklahoma, Pennsylvania, South Carolina, Utah and Wisconsin.</p>\n<p>This is not the first time Walmart has faced pushback over its treatment of Spark Drivers. In <a href=\"https://www.retailtouchpoints.com/topics/store-operations/workforce-scheduling/cfpb-sues-walmart-for-illegal-payment-practices-that-allegedly-cost-drivers-10-million\" rel=\"noreferrer noopener\" target=\"_blank\">January 2025</a> the Consumer Financial Protection Bureau (CFPB) sued Walmart for payment practices that allegedly cost Walmart’s Spark Drivers more than <strong>$10 million</strong> in fees, by forcing them to use “costly deposit accounts” to access their earnings.</p>\n<p>Walmart competitor <strong>Amazon</strong> also has faced regulatory and legal scrutiny over its treatment of drivers; in <a href=\"https://www.retailtouchpoints.com/topics/store-operations/workforce-scheduling/labor-regulator-amazon-is-a-joint-employer-of-its-third-party-delivery-drivers\" rel=\"noreferrer noopener\" target=\"_blank\">August 2024</a> the National Labor Relations Board (NLRB) determined that Amazon is a joint employer of the third-party drivers it contracts with for deliveries in California and that Amazon engaged in unfair labor practices in its dealings with workers and refusing to recognize the drivers’ decision to unionize with the Teamsters.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/walmart-settles-ftc-charges-over-deceptive-delivery-driver-earnings",
            "pub_date": "2026-02-28 01:16:07",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "The Hidden Surge in Sales Promotion Fraud: What Retailers Must Prepare For in 2026",
            "description": "<div class=\"elementor-element elementor-element-d31e15f elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d31e15f\" data-widget_type=\"theme-post-content.default\">\n<p>Sales promotions (i.e. cashbacks, rebates, trade-ins and incentive rewards) have long fueled sales growth and differentiation in consumer electronics and appliances. But as promotional activity increases heading into 2026, so does the opportunity for fraud.</p>\n<p>Unlike traditional retail scams, sales promotion fraud is a structural manipulation of the system, where individuals and organized groups exploit program rules, identity loopholes and claim-volume vulnerabilities. This fast-growing form of fraud is often invisible to retailers until losses accumulate, and by then, promotions may have already paid out far beyond their intended budget.</p>\n<h3 class=\"wp-block-heading\"><strong>Systematic Manipulation</strong></h3>\n<p>Sales promotion fraud has shifted from occasional misuse to strategic exploitation. Today’s fraudsters aren’t just creating fake materials; they’re bypassing promotional frameworks, with high-value incentives such as TV rebates, appliance trade-ins or accessory bundles being especially attractive targets. The list of tactics they use include:</p>\n<ul class=\"wp-block-list\">\n<li>Cycling multiple identities, emails, or addresses to exceed claim limits</li>\n<li>Leveraging loopholes in qualification rules for cashbacks or rebates</li>\n<li>Submitting high volumes of claims during short promotional windows</li>\n<li>Coordinating “promotion sweeps” across multiple retailers and brands</li>\n<li>Taking advantage of inconsistent terms across programs</li>\n</ul>\n<p>Short-term promotions generate huge bursts of activity, which makes it easier for fraud to “blend in.” In other words, promotions built for customer convenience can unintentionally create ideal conditions for exploitation.</p>\n<p>When thousands of claims arrive within hours, a number of problems arise. Identity-matching becomes challenging; duplicate or excessive claims are harder to catch; systems without real-time monitoring can be overwhelmed; and fraudsters exploit delays in manual verification. Most vendors handle claims processing and support but not <strong>fraud defense.</strong> Few invest in the specialized risk infrastructure needed to detect identity manipulation, high-volume submission patterns or cross-promotion behavior.</p>\n<h3 class=\"wp-block-heading\"><strong>The New Era: AI-Driven Promotion Fraud</strong></h3>\n<p>While traditional sales promotion fraud is already costly, 2026 brings a more sophisticated threat: AI-powered fraud at scale. Automated tools, off-the-shelf AI models and bot networks are giving fraudsters the means to attack promotions faster, more efficiently and with far greater anonymity. This new generation of fraud introduces unprecedented risks:</p>\n<ul class=\"wp-block-list\">\n<li><strong>Bots that submit thousands of claims instantly:</strong> Fraudsters are now using automated bots to auto-fill claim forms with rotating identities in order to submit thousands of entries per minute while mimicking human typing and interaction patterns to evade basic bot detection. Legacy claims platforms (especially those built for customer convenience) are not equipped to handle automated high-volume attacks.</li>\n<li><strong>AI that generates synthetic identities:</strong> Generative AI can instantly produce fake names; valid-looking email structures; realistic addresses pulled from public scraping tools; and AI-generated receipts or invoices. The level of sophistication makes manual reviewer detection virtually impossible without advanced analytics.</li>\n<li><strong>AI that detects weaknesses in promotion terms:</strong> Fraudsters are beginning to use AI to “read” promotion terms and identify claim limit gaps; eligibility loopholes; inconsistent rule enforcement; and timing windows where monitoring is weakest. These insights allow organized groups to design coordinated attacks tailored to each promotion.</li>\n<li><strong>Deepfake documentation:</strong> As document forgery becomes AI-assisted, receipts, serial numbers, proof-of-purchase photos, even warranty cards can be fabricated in seconds, often indistinguishable from genuine submissions.</li>\n</ul>\n<p>For high-value promotions like premium TV cashbacks or appliance rebates, the rise in document-based deepfakes will dramatically increase exposure.</p>\n<h3 class=\"wp-block-heading\"><strong>AI Fraud Outruns Defenses</strong></h3>\n<p>The speed and scale enabled by AI create a widening gap between fraudsters and retailers. The primary factor is that AI lowers the barrier to entry; fraud no longer requires technical skill. Additionally, attacks happen at machine speed, overwhelming verification systems. Plus, bots operate around the clock, exploiting every minute of downtime. And synthetic identities do not fatigue, reducing detection based on behavior.</p>\n<p>Without real-time identity intelligence and advanced risk scoring, retailers may see fraud levels spike rapidly – many times without immediate visibility into the root cause. However, fraud prevention doesn’t have to add unnecessary friction. By using a layered approach, retailers can ensure that most customers experience a smooth, fast claim journey; only high-risk submissions undergo deeper review; and fraud is addressed quietly, without impacting brand experience.</p>\n<p>As promotions become richer and more competitive, fraudsters are becoming more sophisticated in exploiting them. Retailers and manufacturers must strengthen their promotion controls, partner with vendors equipped for fraud oversight and adopt proactive rather than reactive strategies. Building resilience in the face of AI-driven fraud (or fraud in general, for that matter) requires a shift in mindset (and investment) in areas such as:</p>\n<ul class=\"wp-block-list\">\n<li><strong>Real-time identity intelligence: </strong>Automated risk scoring, device fingerprinting, geolocation logic and behavioral analysis must be foundational capabilities, not optional add-ons.</li>\n<li><strong>AI that fights AI:</strong> Retailers increasingly need machine learning tools capable of spotting synthetic identities; detecting bot-generated patterns; and identifying clusters of suspicious claims across multiple promotions.</li>\n<li><strong>Consistent terms and controls across all promotions:</strong> Fraudsters love  inconsistency and will exploit it relentlessly. Alignment across regions, retailers and product categories reduces the number of attack surfaces.</li>\n<li><strong>Partners that specialize in fraud prevention: </strong>Most promotion vendors simply process claims, they don’t protect them. A partner with deep forensic capability, cross-brand monitoring and AI-enhanced risk frameworks is becoming essential.</li>\n</ul>\n<p>As we enter 2026, retailers must assume that fraud will continue increasing in both sophistication and volume. The winners will be those who treat fraud prevention not as an afterthought but as a strategic requirement of running impactful promotions. Sales promotions remain a powerful lever, but only when the integrity of the program is protected right from the start.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><em>Sara Lomax is the Head of Fraud and Operational Risk at </em><a href=\"https://www.opia.com/en-us/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Opia</em></a><em>, a leading global sales promotions agency. With more than a decade of experience safeguarding incentive programs for major consumer electronics and appliance brands, she oversees Opia’s dedicated fraud division — one of the only teams of its kind in the promotions industry. Under her leadership, Opia has maintained a fraud rate below 1% for five consecutive years, blocked more than one million invalid submissions and saved clients millions through advanced risk detection, behavioral analysis and multilayered fraud prevention strategies.</em></p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/executive-viewpoints/the-hidden-surge-in-sales-promotion-fraud-what-retailers-must-prepare-for-in-2026",
            "pub_date": "2026-02-27 22:16:03",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "TJX Plans 146 New Stores This Year, Eyes Goal of 7,000 Stores Globally",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p>Riding the rising appeal of value-oriented retailing, <a href=\"https://www.tjx.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>TJX</strong></a> is planning to open <strong>146</strong> net-new stores in 2026, bringing the retailer’s total brick-and-mortar footprint to <strong>5,300 </strong>stores around the world. That would outpace the company’s growth in 2025, when it added <strong>129 </strong>stores. TJX operates multiple banners including <strong>Marshalls, Home Goods </strong>and<strong> TJ Maxx</strong>.</p>\n<p>This doesn’t represent the limit of TJX’s brick-and-mortar ambitions. In a recent <a href=\"https://seekingalpha.com/article/4874698-the-tjx-companies-inc-tjx-q4-2026-earnings-call-transcript\" rel=\"noreferrer noopener\" target=\"_blank\">conference call,</a> TJX President and CEO Ernie Herrman discussed the potential for global store count to grow to <strong>7,000</strong>, aided by the retailer’s recent entrance into Spain: “We have an excellent track record of opening stores in the right locations in the right markets and are convinced that we will continue to do so,” said Herrman. “With the long-term opportunity to open <strong>1,700</strong>-plus additional stores globally, we see a very strong path ahead for continued global growth.”</p>\n<p>The retailer’s confidence has been buoyed by strong Q4 and FY 2026 results. Net sales for Q4, which ended Jan. 31, 2026, were <strong>$17.7 billion</strong>, a <strong>9%</strong> increase over the same period in Q4 2025, with comparable sales rising <strong>5%</strong>. For the full year, net sales of <strong>$60.4 billion</strong> represented a <strong>7%</strong> increase over the previous year, with comparable sales also rising <strong>5%</strong>.</p>\n<h3 class=\"wp-block-heading\"><strong>Store Expansion to Focus on Marmaxx, HomeGoods Banners and Global Footprint</strong></h3>\n<p>TJX’s capital expenditure budget for the coming year will be “in the range of <strong>$2.2 billion to $2.3 billion</strong>,” said John Klinger, Senior EVP and CFO during the conference call. “This includes opening new stores, remodels and relocations as well as investments in our distribution network and infrastructure to support our growth.”</p>\n<p>TJX’s U.S. store growth will include <strong>45</strong> net-new <strong>Marmaxx</strong> stores and <strong>35</strong> new HomeGoods stores, including <strong>11</strong> <strong>HomeSense</strong> stores and <strong>24</strong> new <strong>Sierra </strong>stores. The retailer also will open <strong>13</strong> new stores in Canada and <strong>19</strong> net-new stores in Europe, including the retailer’s first <strong>five</strong> stores in Spain. TJX also will open <strong>10</strong> new stores in Australia.</p>\n<p>“Lastly, we’re planning about <strong>540</strong> remodels and plan to relocate approximately <strong>40</strong> stores in FY 2027,” Klinger added.</p>\n<p>Some of TJX’s international growth has been accomplished through partnerships. In <a href=\"https://www.retailtouchpoints.com/topics/market-news/tjx-expands-to-mexico-through-new-joint-venture-with-grupo-axo\" rel=\"noreferrer noopener\" target=\"_blank\">June 2024</a>, TJX partnered with <strong>Grupo Axo</strong> to expand into Mexico as part of a joint venture, and in <a href=\"https://www.retailtouchpoints.com/features/mergers-and-acquisitions/tjx-buys-35-stake-in-dubai-based-brands-for-less\" rel=\"noreferrer noopener\" target=\"_blank\">August 2024</a> TJX bought a <strong>35%</strong> stake in Dubai-based <strong>Brands for Less</strong>.</p>\n<p>“We believe our strategy of operating stores across a wide customer demographic will continue to serve us well,” said Herrman. “With outstanding access to good, better and best merchandise, we can curate our stores with an assortment that appeals to various income and age demographics. This allows us to reach a broad range of shoppers, which we believe differentiates us from many other major brick-and-mortar retailers. Further, we continue to see an outsized number of new younger customers visiting our retail banners at each of our divisions. All of this gives us confidence that we can continue to open stores in new markets in each of our geographies.”</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/tjx-plans-146-new-stores-this-year-eyes-goal-of-7000-stores-globally",
            "pub_date": "2026-02-27 00:10:47",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "PepsiCo Foundation Provides $1 Million Jumpstart for NRF Retail Training Initiative",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p>A new <a href=\"https://nrffoundation.org/\" rel=\"noreferrer noopener\" target=\"_blank\">NRF Foundation</a> program designed to strengthen job readiness for careers in retail by expanding access to skills training and credentials has kicked off with a <strong>$1 million</strong> contribution by the <a href=\"https://www.pepsico.com/about/pepsico-foundation\" rel=\"noreferrer noopener\" target=\"_blank\">PepsiCo Foundation</a>, to be used over <strong>three</strong> years.</p>\n<p>The Retail Training Fund will support workforce development at organizations, community colleges and select educational institutions, providing participants with skills including customer service, operational and technical proficiencies and industry-specific knowledge. The partnership is designed to reach <strong>3,000</strong> participants across <strong>30</strong> partner organizations, strengthening the talent pipeline for retail and adjacent sectors.</p>\n<p>“Access to skills, training and opportunity is critical to advancing economic mobility,” said Monica Bauer, SVP, Social Impact at PepsiCo in a statement. “By partnering with the NRF Foundation through the Retail Training Fund, we are investing in people and communities by helping learners gain the credentials and capabilities they need to succeed in today’s workforce.”</p>\n<p>“The PepsiCo Foundation’s support of our new NRF Foundation Retail Training Fund will increase our reach and impact, propelling the job seekers of today to become the retail leaders of tomorrow,” said Adam Lukoskie, Executive Director of the NRF Foundation in a statement.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/pepsico-foundation-provides-1-million-jumpstart-for-nrf-retail-training-initiative",
            "pub_date": "2026-02-26 23:10:42",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Gary V on the Shifting Landscape of Attention and the Death of Don Draper Marketing",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><em>This article first appeared in our sister publication <a href=\"https://shop-eat-surf-outdoor.com/\">Shop Eat Surf Outdoor</a></em></p>\n<p>Earlier this year at the <a href=\"https://shop-eat-surf-outdoor.com/news/companies-launch-myriad-ai-products-for-retailers-and-brands-at-nrf-2026/616427/\" rel=\"noreferrer noopener\" target=\"_blank\">NRF Big Show</a>, <a href=\"https://vaynermedia.com/\" rel=\"noreferrer noopener\" target=\"_blank\">VaynerMedia</a> CEO Gary Vaynerchuk — a best-selling author, early investor in companies like <strong>Facebook</strong>, <strong>Twitter</strong>, <strong>Tumblr</strong>, <strong>Venmo</strong>, <strong>Snapchat</strong> and <strong>Uber</strong>, and social media star with over <strong>50 million</strong> followers across multiple platforms — stood before the packed room of retail professionals and asked a simple question: “How many people in this room are aware of what <a href=\"https://www.whatnot.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Whatnot</strong></a> is?”</p>\n<p>When asked to stand, barely <strong>3%</strong> of the audience rose. The punchline? Whatnot, a live-streaming shopping app, generated between <strong>$7 billion and $10 billion</strong> in gross merchandise value last year.</p>\n<p>This disconnect illustrates Vaynerchuk’s central thesis: <strong>huge opportunities exist right now, but many businesses are too slow to see them. </strong>Whether it’s the explosion of live shopping or the democratization of viral content, the landscape of attention is shifting rapidly.</p>\n<p>Here is how Vaynerchuk suggests brands and creators navigate this new era of digital revolution.</p>\n<h2 class=\"wp-block-heading\"><strong>Stop Acting Like Don Draper</strong></h2>\n<p>For decades, advertising relied on a <em>Mad Men</em>-style model. Executives would sit in a room, debate the subjective quality of a creative asset and then spend millions of dollars to force people to see it.</p>\n<p>Vaynerchuk argues that this era is over.</p>\n<p>“<strong>The smartest marketers are obsessed with context, volume, relevance at all cost, humility around creative</strong>, not leaning on your subjective opinion like you’re Don Draper in 1965, but understanding that we are in a distribution model now where we can create creative at scale and get consumer insights and data affirmation that then allow us to deploy paid media,” he told the audience at NRF.</p>\n<p>“For another framework on this, friends, I think we’ve lived in advertising for <strong>70 to 80</strong> years in a model that used working media dollars to hide bad creative,” Vaynerchuk added. “I think w<strong>e’re now clearly in the era of let’s use working media dollars only to amplify and scale good creative</strong>, and good is judged by did it actually achieve views, not four executives in a room saying, ‘That’s on brand.’”</p>\n<h2 class=\"wp-block-heading\"><strong>The Live Shopping Revolution is Coming</strong></h2>\n<p>While the U.S. market has been slower to adopt live social shopping compared to China, Vaynerchuk believes it is inevitable. He points to the success of apps like Whatnot and the massive scale of <strong>TikTok Shop</strong> as proof that the tide is turning.</p>\n<p>“I think this is social media all over again,” he said. “A bunch of people in this room and a bunch of people in this industry <strong>10</strong> years ago said, ‘Social’s not for us. We’re a high-end brand. We’re expensive. We have a higher AOV (average order value).’ This is all I heard in 2010, ’17, ’13, ’12. Everything sells on social now, and everybody knows that.”</p>\n<p>Every brand now needs to also devise a live shopping strategy as well, Vaynerchuk said.</p>\n<p>“Live shopping is not built for (tchotchkes) like Labubus,” he said. “In China, they sell cars at scale through live shopping. <strong>Live shopping is attention. Consumers see something, and they act on it. It’s a frictionless environment.</strong> You’re in your feed. It just shows up. You like purses. You buy a purse. It’s easier than any other ecommerce.”</p>\n<p>He warned that companies need to get on board quickly or risk getting left behind: “Anyone here at a Fortune 5,000 level that isn’t spending an enormous amount of time trying to figure out their live shopping strategy and figuring out their GEO and AEO strategy — if they’re not doing that, they are setting themselves up for very challenging 2027, 2028 realities,” Vaynerchuk said.</p>\n<h2 class=\"wp-block-heading\"><strong>The Impact of AI on the Creator Economy</strong></h2>\n<p>Artificial intelligence is undoubtedly shaking up the creative world, specifically the influencer economy. Vaynerchuk acknowledges that AI-generated influencers will likely take market share from lower-tier human influencers. However, he remains optimistic about the human spirit and its ability to navigate big changes.</p>\n<p>“Nobody felt bad for the A-list celebrities that the influencers have come along and taken money out of their pockets,” he said. “And so I don’t feel bad (about) the people that create AI influencers and bring value to the consumer. And if they start getting brand deals and they come out of the [human] influencers’ [piece of the business], I think this is an evolution. I think this is just what happens. Many inventions through the history of time are demonized up front, electricity being my favorite historical story of how we tried to not accept it. We were big on candles back in the day.</p>\n<p>“So, am I concerned? I’m not concerned in the macro,” he added. “<strong>I believe in the human spirit. We’ve navigated atomic bomb invention. I think we’ll navigate the AI invention. </strong>But do I think a lot of B, C, D- list influencers… do I think that they have a vulnerability on losing brand deals to AI influencers? I know they will.</p>\n<p>“But I would also argue, when I look at this crowd, I get so happy knowing that so many people’s parents, children, spouses and [they] themselves will live 10 to 15 years longer because AI in medicine will detect a disease earlier than [before]. There’s so much remarkable joy that’s coming [with AI], I think some business commerce reshaping is frivolous in comparison to the upside.”</p>\n<h2 class=\"wp-block-heading\"><strong>It Is Easier to Break out Today Than Ever Before</strong></h2>\n<p>A common complaint among new creators is that platforms like <strong>YouTube</strong> are “too mature” and that it’s too late to get started. Vaynerchuk completely rejects this idea. While early adopters who bought “beachfront property” on YouTube in the early days certainly had an advantage, the algorithms have changed in a way that favors newcomers.</p>\n<p>In the past, you had to spend<strong> three or four</strong> years building a following before anyone saw your content. Today, interest-based algorithms on platforms like TikTok, <strong>Instagram Reels</strong> and YouTube Shorts allow you to go viral on Day One, he said.</p>\n<p>“Somebody here can literally make their first TikTok ever and it could be the start of the whole game,” Vaynerchuk said. “<strong>The level of merit and opportunity for the individual human because of where the algos are in social right now and for every business is profound</strong>, profound, and I want more people to take advantage of it.”</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/topics/digital-marketing/gary-v-on-the-shifting-landscape-of-attention-and-the-death-of-don-draper-marketing",
            "pub_date": "2026-02-26 23:10:42",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Urban Outfitters Invites Community Members to ‘Add to Story’",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><strong><a href=\"https://www.urbanoutfitters.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Urban Outfitters</a></strong> has launched Add to Story, a campaign that encourages input from <strong>thousands</strong> of the brand’s community members through weekly prompts that are designed to inspire them to share their stories from school, sports and everyday life.</p>\n<p>This Me@UO community prioritizes emerging voices with strong engagement and fewer than <strong>10,000</strong> followers, using a participatory model that brings members closer through elevated IRL experience, access to Gen Z-favorite brands and affiliate earning.</p>\n<p>Urban Outfitters also will sponsor creator-exclusive events, inviting top <strong>100</strong> contributors and their plus-ones to Meet Me@UO, a <strong>two</strong>-day brand experience in Joshua Tree, Calif. The trip will bring the community together for surprise performances, immersive moments, giveaways and more.</p>\n<p>“This is our next chapter of connection,” said Cyntia Leo, Head of Brand Marketing at Urban Outfitters in a statement. “We’re here to build real relationships over transactional ones. Our strategy puts customer first with moments that feel real, memorable and worth showing up for.”</p>\n<p>Urban Outfitters’ embrace of Gen Z also has spread to the brick-and-mortar world: in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/urban-outfitters-plans-10-new-stores-in-gen-z-friendly-format\" rel=\"noreferrer noopener\" target=\"_blank\">October 2025</a> Urban Outfitters announced plans to open <strong>three</strong> new stores in a Gen Z-friendly format by the end of that year, with an additional <strong>seven</strong> stores planned for 2026.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/urban-outfitters-invites-community-members-to-add-to-story",
            "pub_date": "2026-02-26 00:08:06",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Gordon Brothers Licenses Footwear Group to Expand Chinese Laundry Brand in U.S.",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p>Asset management firm <strong><a href=\"https://www.gordonbrothers.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Gordon Brothers</a></strong>, owner of the <strong><a href=\"https://chineselaundry.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Chinese Laundry</a></strong> brand, has licensed <strong><a href=\"https://www.sclfootwear.com/\" rel=\"noreferrer noopener\" target=\"_blank\">SCL Footwear Group</a></strong> to grow the trend-driven women’s footwear company in the U.S. The SCL Footwear Group specializes in the mass production and distribution of men’s, women’s and children’s footwear.</p>\n<p>“We’re proud to build upon the legacy of Chinese Laundry, <strong>Dirty Laundry, CL by Dirty Laundry </strong>and<strong> 42 Gold</strong> by investing in marketing, design and product development to keep all <strong>four</strong> brands at the forefront of the consumer’s mind while expanding into complementary categories,” said Carolyn D’Angelo, Senior Managing Director and Head of Brand Operations at Gordon Brothers in a statement.</p>\n<p>Gordon Brothers is known for its roles helping retail companies deal with bankruptcies and store closures, such as brokering a sale of <strong>Big Lots</strong> assets to <strong>Variety Wholesalers </strong><a href=\"https://www.retailtouchpoints.com/features/mergers-and-acquisitions/big-lots-planned-private-equity-sale-falls-through-retailer-commences-going-out-of-business-sales\" rel=\"noreferrer noopener\" target=\"_blank\">December 2024</a> and restocking soon-to-be-closed <strong>Party City</strong> stores with merchandise to be sold during their closing sales in <a href=\"https://www.retailtouchpoints.com/features/financial-news/the-partys-over-at-party-city-retailer-preps-to-close-700-stores-nationwide\" rel=\"noreferrer noopener\" target=\"_blank\">February 2025</a>. However, the company also has become more involved in longer-term brand management; a Gordon Brothers executive discussed its “asset-light” strategy for revitalizing the <strong>Laura Ashley</strong> brand in <a href=\"https://www.retailtouchpoints.com/topics/retail-innovation/inside-gordon-brothers-asset-light-strategy-to-rejuvenate-the-laura-ashley-brand\" rel=\"noreferrer noopener\" target=\"_blank\">January 2025</a>.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/gordon-brothers-licenses-footwear-group-to-expand-chinese-laundry-brand-in-u-s",
            "pub_date": "2026-02-26 00:08:07",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Loblaws Plans 70 New Stores in 2026 with Focus on Pharmacies and ‘Hard Discount’ Models",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><a href=\"https://www.loblaw.ca/en/home/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Loblaw Companies Ltd.</strong></a> will expand its store footprint across Canada in 2026 with <strong>70</strong> new locations, emphasizing its pharmacy and discount banners. These openings, along with renovations of another <strong>191</strong> stores, are part of <a href=\"https://www.loblaws.ca/en\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Loblaws</strong></a>’ plans to spend <strong>$2.4 billion </strong>Canadian (<strong>$1.75 billion</strong> USD) on its stores and supply chain capabilities this year, an investment that represents the second part of the company’s <strong>five</strong>-year plan to spend <strong>$10 billion</strong> CAD by 2030.</p>\n<p>The new stores will include <strong>34 Shoppers Drug Mart/Pharmaprix</strong> pharmacies and care clinics and <strong>31</strong> hard discount-style <strong>No Frills </strong>and<strong> Maxi </strong>stores. Additionally, Loblaws will continue construction of the approximately <strong>1.2 million-square-foot</strong> distribution center in Caledon, Ontario. The company estimated that all these activities will generate <strong>9,700</strong> retail and construction jobs across Canada:</p>\n<ul class=\"wp-block-list\">\n<li>Eastern Canada: <strong>four</strong> new stores and more than <strong>600</strong> jobs;</li>\n<li>Quebec: <strong>15</strong> new stores and more than <strong>1,985</strong> jobs;</li>\n<li>Ontario: <strong>27</strong> new stores and <strong>3,775</strong> jobs, including roles associated with the company’s <strong>two</strong> new automated distribution centers in Southern Ontario; and</li>\n<li>Western Canada: <strong>24</strong> new stores and more than <strong>3,400</strong> jobs.</li>\n</ul>\n<p>“Our success depends heavily on the strength of the communities we serve,” said Per Bank, President and CEO of Loblaw Companies in a statement. “We see this as a significant investment in our network and capabilities as one of Canada’s largest retailers, but it is also an investment in the people we serve and their ability to access great value and quality healthcare.”</p>\n<p>Loblaws has already been steadily expanding its store network; in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/loblaws-plans-80-new-stores-in-2025-as-retailer-doubles-down-on-discounting\" rel=\"noreferrer noopener\" target=\"_blank\">February 2025</a> the retailer had announced plans to open <strong>80</strong> new stores last year, part of the retailer’s <strong>$2.2 billion </strong>CAD investment plan. Loblaws also introduced its “No Name” stores in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/loblaws-pilots-3-limited-assortment-no-name-stores-promises-significant-discounts\" rel=\"noreferrer noopener\" target=\"_blank\">August 2024</a>, offering steep discounts on a limited selection of <strong>1,300</strong> products, including pantry staples and household goods.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/loblaws-plans-70-new-stores-in-2026-with-focus-on-pharmacies-and-hard-discount-models",
            "pub_date": "2026-02-25 23:10:50",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Reading Your Data Tea Leaves: What Your Metrics are Really Trying to Tell You",
            "description": "<div class=\"elementor-element elementor-element-d31e15f elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d31e15f\" data-widget_type=\"theme-post-content.default\">\n<p>There’s a wealth of customer knowledge sitting right in front of retailers, but most just don’t see it.</p>\n<p>Brands are investing millions to build out their data infrastructure. Tracking every click, abandoned cart, cross-channel journey and more. But how’s that data actually being used? Typically, just to improve workflows. This looks like automating email sends. Streamlining inventory. Speeding up campaign launches. It’s all about operational efficiency.</p>\n<p>Why? Because that’s the default for most businesses. It’s much easier to optimize what you’re already doing than to rethink how you’re doing it. So brands end up with faster processes that still produce generic experiences. This annoys customers, just more efficiently.</p>\n<p>The better play, though, is using data to understand consumer behavior. Reading the signals in those clicks and abandoned carts. Seeing patterns in how customers move across channels. Doing all of this to turn those insights into 1:1 experiences that actually resonate.</p>\n<p>Shifting from operational efficiency to consumer understanding is how you turn data into actionable insight. The kind that improves personalization and drives down acquisition costs.</p>\n<p>Here’s what that looks like.</p>\n<h3 class=\"wp-block-heading\"><strong>The Productivity Trap</strong></h3>\n<p>I’m not a gambler, but there’s a bet I feel comfortable making: If I walked into any retail marketing meeting, I’m sure I’d hear variations of the same wins being celebrated: </p>\n<ul class=\"wp-block-list\">\n<li>“We automated our segmentation process.” </li>\n<li>“We reduced campaign launch time by XX%.” </li>\n<li>“Our reporting dashboards are now real-time.”</li>\n</ul>\n<p>These are all good things. They’re making progress. But none of them are customer-facing.</p>\n<p>Operational optimization without genuine insight creates generic experiences for everyone. Your team could send emails faster, but if those emails don’t resonate, you’re just annoying people at scale. You’ve built a well-oiled machine that produces mediocrity more efficiently than before.</p>\n<p>You can’t stand out just by increasing the speed by which you process your customer data. It comes down to what you do with what you discover.</p>\n<h3 class=\"wp-block-heading\"><strong>What Your Data is Actually Telling You</strong></h3>\n<p>When you look at behavioral patterns, that’s when the story gets interesting. Your data doesn’t just track what happened. It reveals why your customers are doing what they’re doing, what they actually care about and what they’re most likely to do next.</p>\n<p>Take timing. Most brands know when a purchase happens, but few dig into the context. Are certain segments shopping exclusively on mobile during their lunch break? That’s not a random experience; that’s a signal. It tells you they’re squeezing shopping into stolen moments, which means you’d better have mobile-friendly product pages — and a frictionless checkout experience.</p>\n<p>Or look at cross-channel behavior. Customer browses your site, adds items to their cart, then bounces. Two days later, they’re clicking through your email but not buying anything. Three more days later, they finally convert — via SMS. Most brands would track it across several separate data points. But the brands that pay attention see each action (or non-action) as chapters in the same story, and use that pattern to inform their next move.</p>\n<p>Intent signals are everywhere. You just need to know where to look. A customer who hovers on a product page for nearly a minute but leaves without adding to cart isn’t disinterested; they’re considering. Someone who returns to view the same item three or four times across different sessions isn’t a browser. They’re a savvy shopper comparing for the best deal, or they’re waiting for a reason to commit.</p>\n<p>These emotional and motivational signals are right in front of you.</p>\n<h3 class=\"wp-block-heading\"><strong>From Insight to Action</strong></h3>\n<p>Vitamin and supplement brand OLLY gets this. “We want every text or email we send to feel like a personal message from us,” says Becca Tran, OLLY’s CRM and retention specialist.</p>\n<p>And that’s not just a nice sentiment, it’s data strategy. When you understand what individual customers care about, you can make every touch point relevant to them.</p>\n<p>OLLY found the story their data told about each of their customers. The brand reacted recently by creating an email series that sends subscribers personalized recommendations at a regular cadence based on their specific needs and behaviors. These automated emails took minimal effort to create and send, and generated over 40% of a typical month’s email revenue for the company.</p>\n<p>This is where data transforms from a productivity tool into a revenue driver. When you have better insights, you have more efficient campaign spend. You’re not wasting budget on messages that won’t land. You’re getting less operational overhead. No more creating dozens of email variants when behavioral data tells you exactly which three will perform.</p>\n<h3 class=\"wp-block-heading\"><strong>Seeing What’s Coming Next</strong></h3>\n<p>If you leverage your data the right way, you’ll gain the power to see into the future. Because your data can anticipate what customers will want before they know they want it.</p>\n<p>How do we know this? Behavioral patterns compound. Someone who buys a face cleanser in January and does so again in March is more than a repeat customer. They’re someone on a predictable cycle that you can proactively serve. </p>\n<p>A spike in searches for cozy loungewear isn’t just noise. It’s an early signal of a trend you can capitalize on before competitors notice.</p>\n<p>With data like this, you won’t have to mass-send generic and ill-timed emails, text messages or push notifications anymore. This leads to better experiences on both sides of the relationship: consumers stop being bombarded with irrelevant offers, and brands increase lifetime value and foster deeper loyalty.</p>\n<p>But getting there requires shifting how you think about data. You have to stop looking at your data to answer the question, “What happened?” Instead, you should be asking, “What does this tell me about what’s going to happen?”</p>\n<h3 class=\"wp-block-heading\"><strong>What’s Next for Brands</strong></h3>\n<p>Reading your data tea leaves means understanding data as a tool for connection and relevance instead of just productivity. It means moving from operational optimization to genuine customer understanding and engagement.</p>\n<p>Today, you’re at a fork in the road: you could either stay focused on efficiencies and keep things surface-level — vague and generic — or you could turn all that wonderful data into measurable advantage. The latter route offers the best of both worlds: your customers get relevant offers, faster service, fewer annoying messages and more trustworthy interactions. You get faster revenue, lower waste and clearer decisions.</p>\n<p>Option B, right? I’m assuming you said yes. Great! </p>\n<p>So, what’s next — for brands? You have to prioritize deep understanding over efficiency. Make sure you’re framing your thinking through the lens of your customers’ wants, needs, actions and predictability. </p>\n<p>And to do that, you must invest in the infrastructure that connects customer behavior across channels. You also need to build teams that can translate those patterns into action. Experiment, experiment, experiment, and see whether your insights are driving incremental value. Be curious. Ask stupid questions. Answer them quickly.</p>\n<p>Remember that data isn’t the end. Customer relationships are. Data shows you the way there. You just need to get — and stay — on that path.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><em>Keri McGhee is Chief Marketing Officer at </em><a href=\"https://www.attentive.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Attentive</em></a><em>, where she leads strategies that help brands transform customer data into meaningful, revenue-driving experiences.</em></p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/executive-viewpoints/reading-your-data-tea-leaves-what-your-metrics-are-really-trying-to-tell-you",
            "pub_date": "2026-02-25 22:11:34",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}