{
    "data": [
        {
            "title": "Urban Outfitters Invites Community Members to ‘Add to Story’",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><strong><a href=\"https://www.urbanoutfitters.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Urban Outfitters</a></strong> has launched Add to Story, a campaign that encourages input from <strong>thousands</strong> of the brand’s community members through weekly prompts that are designed to inspire them to share their stories from school, sports and everyday life.</p>\n<p>This Me@UO community prioritizes emerging voices with strong engagement and fewer than <strong>10,000</strong> followers, using a participatory model that brings members closer through elevated IRL experience, access to Gen Z-favorite brands and affiliate earning.</p>\n<p>Urban Outfitters also will sponsor creator-exclusive events, inviting top <strong>100</strong> contributors and their plus-ones to Meet Me@UO, a <strong>two</strong>-day brand experience in Joshua Tree, Calif. The trip will bring the community together for surprise performances, immersive moments, giveaways and more.</p>\n<p>“This is our next chapter of connection,” said Cyntia Leo, Head of Brand Marketing at Urban Outfitters in a statement. “We’re here to build real relationships over transactional ones. Our strategy puts customer first with moments that feel real, memorable and worth showing up for.”</p>\n<p>Urban Outfitters’ embrace of Gen Z also has spread to the brick-and-mortar world: in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/urban-outfitters-plans-10-new-stores-in-gen-z-friendly-format\" rel=\"noreferrer noopener\" target=\"_blank\">October 2025</a> Urban Outfitters announced plans to open <strong>three</strong> new stores in a Gen Z-friendly format by the end of that year, with an additional <strong>seven</strong> stores planned for 2026.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/urban-outfitters-invites-community-members-to-add-to-story",
            "pub_date": "2026-02-26 00:08:06",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Gordon Brothers Licenses Footwear Group to Expand Chinese Laundry Brand in U.S.",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p>Asset management firm <strong><a href=\"https://www.gordonbrothers.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Gordon Brothers</a></strong>, owner of the <strong><a href=\"https://chineselaundry.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Chinese Laundry</a></strong> brand, has licensed <strong><a href=\"https://www.sclfootwear.com/\" rel=\"noreferrer noopener\" target=\"_blank\">SCL Footwear Group</a></strong> to grow the trend-driven women’s footwear company in the U.S. The SCL Footwear Group specializes in the mass production and distribution of men’s, women’s and children’s footwear.</p>\n<p>“We’re proud to build upon the legacy of Chinese Laundry, <strong>Dirty Laundry, CL by Dirty Laundry </strong>and<strong> 42 Gold</strong> by investing in marketing, design and product development to keep all <strong>four</strong> brands at the forefront of the consumer’s mind while expanding into complementary categories,” said Carolyn D’Angelo, Senior Managing Director and Head of Brand Operations at Gordon Brothers in a statement.</p>\n<p>Gordon Brothers is known for its roles helping retail companies deal with bankruptcies and store closures, such as brokering a sale of <strong>Big Lots</strong> assets to <strong>Variety Wholesalers </strong><a href=\"https://www.retailtouchpoints.com/features/mergers-and-acquisitions/big-lots-planned-private-equity-sale-falls-through-retailer-commences-going-out-of-business-sales\" rel=\"noreferrer noopener\" target=\"_blank\">December 2024</a> and restocking soon-to-be-closed <strong>Party City</strong> stores with merchandise to be sold during their closing sales in <a href=\"https://www.retailtouchpoints.com/features/financial-news/the-partys-over-at-party-city-retailer-preps-to-close-700-stores-nationwide\" rel=\"noreferrer noopener\" target=\"_blank\">February 2025</a>. However, the company also has become more involved in longer-term brand management; a Gordon Brothers executive discussed its “asset-light” strategy for revitalizing the <strong>Laura Ashley</strong> brand in <a href=\"https://www.retailtouchpoints.com/topics/retail-innovation/inside-gordon-brothers-asset-light-strategy-to-rejuvenate-the-laura-ashley-brand\" rel=\"noreferrer noopener\" target=\"_blank\">January 2025</a>.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/gordon-brothers-licenses-footwear-group-to-expand-chinese-laundry-brand-in-u-s",
            "pub_date": "2026-02-26 00:08:07",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Loblaws Plans 70 New Stores in 2026 with Focus on Pharmacies and ‘Hard Discount’ Models",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><a href=\"https://www.loblaw.ca/en/home/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Loblaw Companies Ltd.</strong></a> will expand its store footprint across Canada in 2026 with <strong>70</strong> new locations, emphasizing its pharmacy and discount banners. These openings, along with renovations of another <strong>191</strong> stores, are part of <a href=\"https://www.loblaws.ca/en\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Loblaws</strong></a>’ plans to spend <strong>$2.4 billion </strong>Canadian (<strong>$1.75 billion</strong> USD) on its stores and supply chain capabilities this year, an investment that represents the second part of the company’s <strong>five</strong>-year plan to spend <strong>$10 billion</strong> CAD by 2030.</p>\n<p>The new stores will include <strong>34 Shoppers Drug Mart/Pharmaprix</strong> pharmacies and care clinics and <strong>31</strong> hard discount-style <strong>No Frills </strong>and<strong> Maxi </strong>stores. Additionally, Loblaws will continue construction of the approximately <strong>1.2 million-square-foot</strong> distribution center in Caledon, Ontario. The company estimated that all these activities will generate <strong>9,700</strong> retail and construction jobs across Canada:</p>\n<ul class=\"wp-block-list\">\n<li>Eastern Canada: <strong>four</strong> new stores and more than <strong>600</strong> jobs;</li>\n<li>Quebec: <strong>15</strong> new stores and more than <strong>1,985</strong> jobs;</li>\n<li>Ontario: <strong>27</strong> new stores and <strong>3,775</strong> jobs, including roles associated with the company’s <strong>two</strong> new automated distribution centers in Southern Ontario; and</li>\n<li>Western Canada: <strong>24</strong> new stores and more than <strong>3,400</strong> jobs.</li>\n</ul>\n<p>“Our success depends heavily on the strength of the communities we serve,” said Per Bank, President and CEO of Loblaw Companies in a statement. “We see this as a significant investment in our network and capabilities as one of Canada’s largest retailers, but it is also an investment in the people we serve and their ability to access great value and quality healthcare.”</p>\n<p>Loblaws has already been steadily expanding its store network; in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/loblaws-plans-80-new-stores-in-2025-as-retailer-doubles-down-on-discounting\" rel=\"noreferrer noopener\" target=\"_blank\">February 2025</a> the retailer had announced plans to open <strong>80</strong> new stores last year, part of the retailer’s <strong>$2.2 billion </strong>CAD investment plan. Loblaws also introduced its “No Name” stores in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/loblaws-pilots-3-limited-assortment-no-name-stores-promises-significant-discounts\" rel=\"noreferrer noopener\" target=\"_blank\">August 2024</a>, offering steep discounts on a limited selection of <strong>1,300</strong> products, including pantry staples and household goods.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/loblaws-plans-70-new-stores-in-2026-with-focus-on-pharmacies-and-hard-discount-models",
            "pub_date": "2026-02-25 23:10:50",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Reading Your Data Tea Leaves: What Your Metrics are Really Trying to Tell You",
            "description": "<div class=\"elementor-element elementor-element-d31e15f elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d31e15f\" data-widget_type=\"theme-post-content.default\">\n<p>There’s a wealth of customer knowledge sitting right in front of retailers, but most just don’t see it.</p>\n<p>Brands are investing millions to build out their data infrastructure. Tracking every click, abandoned cart, cross-channel journey and more. But how’s that data actually being used? Typically, just to improve workflows. This looks like automating email sends. Streamlining inventory. Speeding up campaign launches. It’s all about operational efficiency.</p>\n<p>Why? Because that’s the default for most businesses. It’s much easier to optimize what you’re already doing than to rethink how you’re doing it. So brands end up with faster processes that still produce generic experiences. This annoys customers, just more efficiently.</p>\n<p>The better play, though, is using data to understand consumer behavior. Reading the signals in those clicks and abandoned carts. Seeing patterns in how customers move across channels. Doing all of this to turn those insights into 1:1 experiences that actually resonate.</p>\n<p>Shifting from operational efficiency to consumer understanding is how you turn data into actionable insight. The kind that improves personalization and drives down acquisition costs.</p>\n<p>Here’s what that looks like.</p>\n<h3 class=\"wp-block-heading\"><strong>The Productivity Trap</strong></h3>\n<p>I’m not a gambler, but there’s a bet I feel comfortable making: If I walked into any retail marketing meeting, I’m sure I’d hear variations of the same wins being celebrated: </p>\n<ul class=\"wp-block-list\">\n<li>“We automated our segmentation process.” </li>\n<li>“We reduced campaign launch time by XX%.” </li>\n<li>“Our reporting dashboards are now real-time.”</li>\n</ul>\n<p>These are all good things. They’re making progress. But none of them are customer-facing.</p>\n<p>Operational optimization without genuine insight creates generic experiences for everyone. Your team could send emails faster, but if those emails don’t resonate, you’re just annoying people at scale. You’ve built a well-oiled machine that produces mediocrity more efficiently than before.</p>\n<p>You can’t stand out just by increasing the speed by which you process your customer data. It comes down to what you do with what you discover.</p>\n<h3 class=\"wp-block-heading\"><strong>What Your Data is Actually Telling You</strong></h3>\n<p>When you look at behavioral patterns, that’s when the story gets interesting. Your data doesn’t just track what happened. It reveals why your customers are doing what they’re doing, what they actually care about and what they’re most likely to do next.</p>\n<p>Take timing. Most brands know when a purchase happens, but few dig into the context. Are certain segments shopping exclusively on mobile during their lunch break? That’s not a random experience; that’s a signal. It tells you they’re squeezing shopping into stolen moments, which means you’d better have mobile-friendly product pages — and a frictionless checkout experience.</p>\n<p>Or look at cross-channel behavior. Customer browses your site, adds items to their cart, then bounces. Two days later, they’re clicking through your email but not buying anything. Three more days later, they finally convert — via SMS. Most brands would track it across several separate data points. But the brands that pay attention see each action (or non-action) as chapters in the same story, and use that pattern to inform their next move.</p>\n<p>Intent signals are everywhere. You just need to know where to look. A customer who hovers on a product page for nearly a minute but leaves without adding to cart isn’t disinterested; they’re considering. Someone who returns to view the same item three or four times across different sessions isn’t a browser. They’re a savvy shopper comparing for the best deal, or they’re waiting for a reason to commit.</p>\n<p>These emotional and motivational signals are right in front of you.</p>\n<h3 class=\"wp-block-heading\"><strong>From Insight to Action</strong></h3>\n<p>Vitamin and supplement brand OLLY gets this. “We want every text or email we send to feel like a personal message from us,” says Becca Tran, OLLY’s CRM and retention specialist.</p>\n<p>And that’s not just a nice sentiment, it’s data strategy. When you understand what individual customers care about, you can make every touch point relevant to them.</p>\n<p>OLLY found the story their data told about each of their customers. The brand reacted recently by creating an email series that sends subscribers personalized recommendations at a regular cadence based on their specific needs and behaviors. These automated emails took minimal effort to create and send, and generated over 40% of a typical month’s email revenue for the company.</p>\n<p>This is where data transforms from a productivity tool into a revenue driver. When you have better insights, you have more efficient campaign spend. You’re not wasting budget on messages that won’t land. You’re getting less operational overhead. No more creating dozens of email variants when behavioral data tells you exactly which three will perform.</p>\n<h3 class=\"wp-block-heading\"><strong>Seeing What’s Coming Next</strong></h3>\n<p>If you leverage your data the right way, you’ll gain the power to see into the future. Because your data can anticipate what customers will want before they know they want it.</p>\n<p>How do we know this? Behavioral patterns compound. Someone who buys a face cleanser in January and does so again in March is more than a repeat customer. They’re someone on a predictable cycle that you can proactively serve. </p>\n<p>A spike in searches for cozy loungewear isn’t just noise. It’s an early signal of a trend you can capitalize on before competitors notice.</p>\n<p>With data like this, you won’t have to mass-send generic and ill-timed emails, text messages or push notifications anymore. This leads to better experiences on both sides of the relationship: consumers stop being bombarded with irrelevant offers, and brands increase lifetime value and foster deeper loyalty.</p>\n<p>But getting there requires shifting how you think about data. You have to stop looking at your data to answer the question, “What happened?” Instead, you should be asking, “What does this tell me about what’s going to happen?”</p>\n<h3 class=\"wp-block-heading\"><strong>What’s Next for Brands</strong></h3>\n<p>Reading your data tea leaves means understanding data as a tool for connection and relevance instead of just productivity. It means moving from operational optimization to genuine customer understanding and engagement.</p>\n<p>Today, you’re at a fork in the road: you could either stay focused on efficiencies and keep things surface-level — vague and generic — or you could turn all that wonderful data into measurable advantage. The latter route offers the best of both worlds: your customers get relevant offers, faster service, fewer annoying messages and more trustworthy interactions. You get faster revenue, lower waste and clearer decisions.</p>\n<p>Option B, right? I’m assuming you said yes. Great! </p>\n<p>So, what’s next — for brands? You have to prioritize deep understanding over efficiency. Make sure you’re framing your thinking through the lens of your customers’ wants, needs, actions and predictability. </p>\n<p>And to do that, you must invest in the infrastructure that connects customer behavior across channels. You also need to build teams that can translate those patterns into action. Experiment, experiment, experiment, and see whether your insights are driving incremental value. Be curious. Ask stupid questions. Answer them quickly.</p>\n<p>Remember that data isn’t the end. Customer relationships are. Data shows you the way there. You just need to get — and stay — on that path.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><em>Keri McGhee is Chief Marketing Officer at </em><a href=\"https://www.attentive.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Attentive</em></a><em>, where she leads strategies that help brands transform customer data into meaningful, revenue-driving experiences.</em></p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/executive-viewpoints/reading-your-data-tea-leaves-what-your-metrics-are-really-trying-to-tell-you",
            "pub_date": "2026-02-25 22:11:34",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Ikea Opens its Doors to Other Retailers, Beginning with Decathlon in the UK",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><strong>Ikea</strong> retailer <a href=\"https://www.ingka.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Ingka Group</strong></a> has begun piloting store-in-store concepts with third-party retailers across Europe in a bid to make its specialty big-box stores “more relevant, convenient and inspiring for customers.”</p>\n<p>The first concept to come to life will be the spring introduction of French sporting goods retailer <a href=\"https://www.decathlon.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Decathlon</strong></a> at the Ikea store in the London borough of Croydon — marking <strong>the first time the retailer will host another global brand in one of its “blue boxes.”</strong> The Decathlon store will be a standalone unit with a dedicated customer entrance and will take up roughly <strong>12,800 square feet</strong> of the <strong>270,000-square-foot</strong> Ikea store.</p>\n<p>“Our ambition is to become as accessible as ever and give customers more reasons to visit us wherever they are on their home journey,” said Javier Quiñones, Commercial Manager at Ingka Group Ikea in a statement. “By testing new ways of using our retail space together with other retailers, we want to further evolve our stores into inviting destinations that reflect what customers want today — convenience, inspiration and an expanded offer.”</p>\n<h2 class=\"wp-block-heading\"><strong>Regional Retailers Also Popping up at Ikea’s in Austria, Sweden</strong></h2>\n<p>Similar partnerships also are already underway in a number of other European markets, with each designed to bring complementary products and services to Ikea shoppers.</p>\n<p>In Austria, Ingka is investing <strong>€11 million ($12.95 million)</strong> in the biggest revamp of its store in Klagenfurt since it opened <strong>17</strong> years ago. Once the renovation is completed this fall, approximately <strong>28,000 square feet</strong> will be made available for other retailers, including discount home and garden specialist <strong>Thomas Philipps</strong>.</p>\n<p>In Sweden, Ikea already has launched a pilot with Nordic consumer electronics retailer <a href=\"https://www.kjell.com/se\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Kjell &amp; Company</strong></a> in its two stores in Stockholm and Kalmar, part of an <strong>18</strong>-month pilot that began in late 2025. These store-in-stores focus on smart home and other technology products that complement Ikea offerings.</p>\n<h2 class=\"wp-block-heading\"><strong>Ikea’s Own Shop-in-Shops, Store Expansion Plans</strong></h2>\n<p>And Ikea itself recently entered the store-in-store arena in the U.S. with the debut of <a href=\"https://www.retailtouchpoints.com/topics/retail-store-design/in-store-innovation/best-buy-ikea-assemble-shop-in-shop-concept\" rel=\"noreferrer noopener\" target=\"_blank\">small-format kitchen and laundry planning centers</a> in <strong>10</strong> <strong>Best Buy</strong> stores across Florida and Texas.</p>\n<p>These store-in-store partnerships haven’t lessened the company’s focus on its own brick-and-mortar expansion, however. Through Ingka’s fiscal 2026 the company plans to invest more than <strong>€5 billion ($5.89 billion) </strong>in opening new locations and improving existing ones across most of its <strong>32</strong> markets, including <a href=\"https://www.retailtouchpoints.com/features/news-briefs/ikea-plans-10-new-u-s-stores-in-2026\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>10 </strong>new stores</a> in the U.S.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/topics/retail-store-design/new-store-concepts/ikea-opens-its-doors-to-other-retailers-beginning-with-decathlon-in-the-uk",
            "pub_date": "2026-02-25 00:06:57",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Gap Launches Cross-Brand Loyalty Program Featuring Branded Credit Card and Experiential Rewards",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><a href=\"https://www.gapinc.com/en-us/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Gap Inc.</strong></a> has launched Encore, a rebranded loyalty program that will draw on the company’s file of nearly <strong>40 million</strong> active members across its brands. In addition to the traditional points and awards, the <strong>three-</strong>tier Encore program will offer early access to select products and exclusive drops as well as brand experiences that extend fashion into moments beyond retail. As the program develops, these experiences will include behind-the-scenes views into how products are designed and made, styling advice and original storytelling.</p>\n<p>In addition to encompassing the Gap, <strong>Old Navy, Athleta </strong>and<strong> Banana Republic</strong> brands, the Encore program will offer a Mastercard credit card from <a href=\"https://cards.barclaycardus.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Barclays U.S. Consumer Bank</a> that will provide users with rewards beyond the Gap ecosystem, rewarding apparel purchases from other brands with a <strong>3X</strong> points bonus, with Gap Inc. purchases rewarded at <strong>5X</strong> points.</p>\n<p>“Encore is a powerful new tool to bring our Fashiontainment platform to life,” said Pam Kaufman, Chief Entertainment Officer at Gap in a statement. “Through partners like <strong>Disney, NBCUniversal</strong> and <strong>AMC Theatres</strong>, we can translate what people love on screens and stages into experiences they can actually access — from early drops and exclusives to cultural moments you can’t get anywhere else.” Kaufman was named to the newly created position in <a href=\"https://www.retailtouchpoints.com/features/retail-movers-and-shakers/gap-casts-paramount-exec-as-chief-entertainment-officer-opens-office-on-sunset-blvd\" rel=\"noreferrer noopener\" target=\"_blank\">January</a>, reporting directly to CEO Richard Dickson.</p>\n<h3 class=\"wp-block-heading\"><strong>Three-Tier Structure for New Program</strong></h3>\n<p>Existing loyalty members and their accumulate points will automatically be transferred into the Encore program, which will offer three tiers: Core, Premier and All-Access. Key changes include lower spend thresholds for Premier members, new points flexibility, extended return benefits and birthday bonuses. The Encore Mastercard immediately unlocks the All-Access tier, providing priority access to select experiences.</p>\n<p>Additionally, Gap is debuting the Encore Market, which will feature a rotating mix of members-only offerings from Gap brands and partners, many created specifically for Encore. These will include limited-run products, signed pieces and experiences such as a chance to fly to New York City and visit <strong>Zac Posen</strong>’s studio to hear about his inspirations. Members also can use the Encore Market to donate rewards to select charitable organizations.</p>\n<p>Gap has been making moves to coordinate operations across its brands, debuting an affiliate and advocacy program for creators in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/gap-introduces-multi-brand-affiliate-and-advocacy-platform-for-creators\" rel=\"noreferrer noopener\" target=\"_blank\">October 2025</a>.</p>\n<p>“Fashion is entertainment, and today’s customers aren’t just buying apparel, they’re buying into brands that shape culture and tell compelling stories,” said Richard Dickson, President and CEO of Gap Inc. in a statement. “Encore connects our brands and partnerships in new ways to meet that demand and change how customers engage with our brands.”</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/gap-launches-cross-brand-loyalty-program-featuring-branded-credit-card-and-experiential-rewards",
            "pub_date": "2026-02-25 00:06:57",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "What the 2025 Holiday Return Season Revealed about Retail’s Fraud Problem",
            "description": "<div class=\"elementor-element elementor-element-d31e15f elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d31e15f\" data-widget_type=\"theme-post-content.default\">\n<p>The 2025 holiday season delivered the first trillion-dollar holiday in U.S. retail history, with<a href=\"https://news.adobe.com/news/2026/01/adobe-holiday-shopping-season\"> </a><a href=\"https://news.adobe.com/news/2026/01/adobe-holiday-shopping-season\" rel=\"noreferrer noopener\" target=\"_blank\">online spending alone hitting $257.8 billion</a>. But while the sales numbers made headlines, the returns story was more complicated.</p>\n<p>According to Adobe Analytics, returns were actually down 1.2% compared to last year during the core November to December shopping window. Then came the flood:<a href=\"https://www.ecommercebytes.com/2026/01/07/consumers-set-new-ecommerce-spending-record-for-2025-holiday-season/\"> </a><a href=\"https://www.ecommercebytes.com/2026/01/07/consumers-set-new-ecommerce-spending-record-for-2025-holiday-season/\" rel=\"noreferrer noopener\" target=\"_blank\">returns surged 4.7% in the days immediately following Christmas</a>, with volumes<a href=\"https://www.retaildive.com/news/returns-spike-new-year-retail/808367/\" rel=\"noreferrer noopener\" target=\"_blank\"> spiking at 25% to 35%</a> leading up to the new year.</p>\n<p>That pattern of a brief reprieve, followed by an intense post-holiday wave, put a spotlight on what’s really driving return costs: fraud, abuse and the operational strain of handling millions of items in a compressed window.</p>\n<p>In a year when operating margins are already thin, these behaviors are turning what used to be a customer service cost into a serious financial risk. Here’s how merchants are preparing for that collision — all without alienating loyal shoppers.</p>\n<h2 class=\"wp-block-heading\"><a></a>What Happened During the 2025 Holiday Season</h2>\n<p>Data from the National Retail Federation estimated that retailers would process <a href=\"https://nrf.com/research/2025-retail-returns-landscape\" rel=\"noreferrer noopener\" target=\"_blank\">$849.9 billion in total returns duri</a><a href=\"https://nrf.com/research/2025-retail-returns-landscape\">ng 2025</a>, with online return rates hovering near 19.3%. Returns used to reflect uncertainty about a product; now they reflect uncertainty about spending power. Shoppers have begun using them to manage budgets, delay commitment or stretch cash flow through “buy now, return later” behavior.</p>\n<p>And as consumers push for flexibility, opportunists are following close behind. For every legitimate return, others exploit refund loopholes, manipulate automation gaps or abuse lenient policies designed for loyalty rather than loss prevention.</p>\n<p>Against that backdrop, the stakes in 2026 are higher than ever.</p>\n<h3 class=\"wp-block-heading\"><a></a>The Post-Christmas Surge</h3>\n<p>The shift toward early holiday promotions, starting as soon as October, meant return cycles opened before peak shipping weeks. Retailers faced a 10- to 12-week return horizon, up from the traditional four to six weeks, complicating inventory forecasting and resale timing well into February. And while return rates held steady during the shopping rush, <a href=\"https://www.retaildive.com/news/returns-spike-new-year-retail/808367/\" rel=\"noreferrer noopener\" target=\"_blank\">the post-Christmas spike hit hard</a><a href=\"https://www.retaildive.com/news/returns-spike-new-year-retail/808367/\">, </a>Adobe predicted elevated levels through mid-January.</p>\n<h3 class=\"wp-block-heading\"><a></a>Certain Categories Bore the Brunt</h3>\n<p><a href=\"https://www.statista.com/chart/34373/most-returned-product-categories-purchased-online/?srsltid=AfmBOoomlPSRTlWQnFF5GbfAiTqB4pmXMGkWIXeczFIvaWvSYrJ0ynPo\" rel=\"noreferrer noopener\" target=\"_blank\">Apparel remained the leader in returns</a>, where “bracketing” (ordering multiple sizes or colors with the intent to send most back) has become a normalized shopping behavior — <a href=\"https://njbia.org/consumers-expected-to-return-850b-in-merchandise-in-2025/\" rel=\"noreferrer noopener\" target=\"_blank\">nearly two-thirds of online shoppers</a> engage in this practice. For some fast-fashion retailers, <a href=\"https://sizebay.com/en/blog/fashion-returns/\" rel=\"noreferrer noopener\" target=\"_blank\">return rates topped 30%</a>, with a growing share of those tied to “wear once” or wardrobing behavior.</p>\n<h3 class=\"wp-block-heading\"><a></a>A Spike in “Friendly Fraud”</h3>\n<p>“Friendly fraud” (including false damage claims, “item not received” disputes and serial refunds) now represents <a href=\"https://capitaloneshopping.com/research/average-retail-return-rate/\" rel=\"noreferrer noopener\" target=\"_blank\">roughly 15% of all return-related losses</a>, costing retailers over $100 billion annually. Each fraudulent claim chips away at already-tight margins and forces retailers to choose between protecting profits and preserving goodwill.</p>\n<h3 class=\"wp-block-heading\"><a></a>Rising Cost per Return</h3>\n<p>The average cost of processing a return now <a href=\"https://www.modernretail.co/operations/the-case-for-and-against-return-fees/\" rel=\"noreferrer noopener\" target=\"_blank\">exceeds $27 for a $100 order</a>, once restocking, shipping and inspection labor are factored in. For low-margin products, that can wipe out profits, even when the merchandise is resold.</p>\n<h3 class=\"wp-block-heading\"><a></a>Omnichannel Blind Spots</h3>\n<p>The convenience of buying online and returning in-store has blurred oversight. Without unified systems, fraud teams may not see cross-channel return patterns, like the same customer returning items purchased under different accounts or payment methods.</p>\n<h2 class=\"wp-block-heading\"><a></a>What Retail Leaders are Doing Differently in 2026</h2>\n<p>Retailers know they can’t simply tighten the screws without risking loyalty. The very policies that create trust — fast refunds, no-questions-asked exchanges, extended return windows — have become a balancing act between generosity and control.</p>\n<p>Instead of tightening policies across the board, leading retailers layered automation, data and behavioral insight to make every return decision dynamic.</p>\n<h3 class=\"wp-block-heading\"><a></a>Automating Trust Decisions</h3>\n<p><a href=\"https://www.nofraud.com/platform/protection/\" rel=\"noreferrer noopener\" target=\"_blank\">AI-powered verification tools</a> can cross-check orders, payments and tracking data before a refund is issued. By flagging inconsistencies, such as repeated “item not received” claims or mismatched return weights, they help reduce the burden on overwhelmed support teams while preventing false refunds.</p>\n<p>One brand using NoFraud managed to block nearly $50,000 in monthly losses from fake tracking IDs and shipping manipulation alone. And across multiple retailers, automated verification now identifies and declines roughly 5% of claims driven by fraud or abuse while speeding up resolution times for legitimate customers.</p>\n<h3 class=\"wp-block-heading\"><a></a>Unifying Chargeback, Order and Return Data</h3>\n<p>Some retailers are consolidating fraud, logistics and customer service into unified risk engines. This allows for pattern recognition across millions of transactions — spotting, for example, a customer who returns the same SKU across multiple accounts or who consistently disputes high-value orders.</p>\n<h3 class=\"wp-block-heading\"><a></a>Segmenting Risk, not Customers</h3>\n<p>Some sellers are applying fraud scoring to return requests in real time. Shoppers with a strong purchase history receive instant approvals or pre-paid labels; meanwhile, high-risk profiles trigger a brief manual review. This results in legitimate customers enjoying frictionless service while abusers encounter invisible guardrails.</p>\n<h3 class=\"wp-block-heading\"><a></a>Personalizing Return Policies with AI</h3>\n<p>Retailers are beginning to customize the return rules themselves by tailoring window lengths, restocking fees and refund timing based on a shopper’s behavior and product category. A loyal customer might receive instant store credit or a 60-day window, while repeat abusers might see shorter timelines or credit-only options. By replacing one-size-fits-all policies with data-driven flexibility, merchants can reward good behavior without exposing themselves to risk.</p>\n<h3 class=\"wp-block-heading\"><a></a>Building Empathy into Automation</h3>\n<p>Returns are often the most emotional moment in the customer journey. The most effective AI systems can route each case to the right resolution channel. Low-value items may be marked as “keep it” to avoid shipping costs, while high-value returns get handled by live agents who can recover trust in real time.</p>\n<h3 class=\"wp-block-heading\"><a></a>Connecting Insights Back to Merchandising and Marketing</h3>\n<p>Leading brands are feeding return data into product and content teams. If an item has a 35% return rate for “fit,” marketing might adjust its imagery or descriptions; if a category drives high abuse, it might prompt a re-evaluation of pricing or packaging.</p>\n<p>Returns will always be part of retail, but in 2026, they’re also becoming a mirror for how each brand manages trust. Instead of trying to eliminate returns, shift your mindset to see them as a recurring investment in customer lifetime value. The sellers that succeed won’t be the ones with the strictest policies, but the ones that turn these signals into smarter operational decisions.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><em>Scott Gifis is the CEO of </em><a href=\"https://www.nofraud.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>NoFraud</em></a><em>. With more than 20 years of leadership experience, he previously served as President and COO of Frame.io, acquired by Adobe for $1.3 billion, and as President of AdRoll. Gifis also has held executive roles at OpinionLab (acquired by Verint Systems), Criteo, CareerBuilder and TeraSolar (which was sold in 2005).</em></p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/executive-viewpoints/what-the-2025-holiday-return-season-revealed-about-retails-fraud-problem",
            "pub_date": "2026-02-24 22:08:08",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Exclusive Q&A: Why Any Day Can be a ‘Yes’ Day at The Children’s Place",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p>Every time a parent and child shop for clothing, there’s a battle between the holder of the purse strings and the (eventual) wearer of the clothes. The adult in the room needs the apparel to provide good value for the money, while the kid may be more focused on fashion value — no matter if it falls apart after a dozen washes. Depending on your family dynamics, the fight can be quiet or loud — but no matter the volume, it will take place eventually.</p>\n<p><a href=\"https://www.childrensplace.com/us/home\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>The Children’s Place</strong></a>, which prides itself on being the only U.S. specialty retailer offering head-to-toe apparel for children aged zero to <strong>12</strong>, wants this to be less of a fight and more of a negotiation — one in which the child is an active participant. Acknowledging that “the child is influencing [shopping] choices a lot more, and a lot earlier in age,” Smeeta Khetarpaul, SVP and Head of Marketing at The Children’s Place, tied this societal movement to the retailer’s new “It’s a Yes Day” brand platform.</p>\n<p>“We want to empower these kids at an earlier age and help them learn to make decisions,” said Khetarpaul in an interview with <em>Retail TouchPoints</em>. “Of course, the parent is still in the decision mix, but ‘It’s a Yes Day’ is about both of them coming together.”</p>\n<p>The Children’s Place is counting on the new platform to help address ongoing challenges by raising awareness among shoppers (both young and old alike). During the retailer’s Q3 2025, which ended Nov. 1, 2025, sales decreased <strong>13%</strong>, dropping from $390.2 million to $339.5 million. For the first <strong>nine</strong> months of its fiscal year, sales declined <strong>10%</strong>, from <strong>$977.7 million to $879.6 million</strong>.</p>\n<p>The legacy retailer, established in 1969, also is looking to its <strong>499 </strong>brick-and-mortar stores, which had generated <strong>2%</strong> growth in comparable sales for Q3, as a key element in its comeback. “We opened <strong>five</strong> new stores during the third quarter, with another <strong>11</strong> store openings planned for the fourth quarter,” said Muhammad Umair, President and CEO of The Children’s Place in a December 2025 statement.</p>\n<p>“Looking ahead, we plan to open an additional <strong>15 to 20</strong> new stores in the first half of fiscal year 2026, ahead of our critical back-to-school season to drive revenue growth and profitability, with more store openings in the back-half of fiscal year 2026 and beyond,” Umair added. “We also plan to refresh our store layouts, and in conjunction with our revamped My Place Rewards loyalty program, we are excited for the enhanced experience this will create for our new and existing customer file.”</p>\n<p>Khetarpaul, who has been with The Children’s Place for less than a year but also has held top marketing positions at companies including <strong>Crocs, Danone, BrightFarms</strong> and <strong>Nestlé</strong>, shared details about the retailer’s plans to make any day, and every day, a “Yes” day when it comes to kids’ clothes.</p>\n<p><strong><em><mark class=\"has-inline-color has-vivid-red-color\" style=\"background-color:rgba(0, 0, 0, 0)\">Retail TouchPoints: How do you see the “It’s a Yes Day” platform building on the bigger role kids are playing in deciding what they wear?</mark></em></strong></p>\n<p><strong><img alt=\"\" class=\"alignright wp-image-157066 size-full\" decoding=\"async\" fetchpriority=\"high\" height=\"750\" sizes=\"(max-width: 500px) 100vw, 500px\" src=\"https://www.retailtouchpoints.com/wp-content/uploads/2026/02/Childrens-Place-Yes-Day-vertical.jpg\" srcset=\"https://www.retailtouchpoints.com/wp-content/uploads/2026/02/Childrens-Place-Yes-Day-vertical.jpg 500w, https://www.retailtouchpoints.com/wp-content/uploads/2026/02/Childrens-Place-Yes-Day-vertical-400x600.jpg 400w\" width=\"500\"/>Smeeta Khetarpaul: </strong>It’s the kid who is driving the “want” today; they’re the decision-maker on fashion, and the parent is the purchaser. The “It’s a Yes Day” platform is designed to be a place that gets kids excited about the product as they own their identity. We also want to give parents the comfort, convenience and confidence of great product at a great value, but we all know that if the kid is very excited [about a purchase], the parent is more confident.</p>\n<p>In a broader sense, “It’s a Yes Day” also represents our brand philosophy. Saying “yes” in life generally opens opportunities, and we’re saying “yes” to kids expressing themselves. Even in the creative we’ll be using, we’re picturing open spaces, blue skies and kids moving, <strong>showing kids as their joyful selves as opposed to models that are posed.</strong></p>\n<p>We also want to showcase what authentic childhood is, including the funny, messy details and the funny things they see. The ultimate benefit of this is confidence for the kids, and then confidence for the parent that they are making the right decision.</p>\n<p><strong><em><mark class=\"has-inline-color has-vivid-red-color\" style=\"background-color:rgba(0, 0, 0, 0)\">RTP: How will The Children’s Place be leveraging this new brand positioning?</mark></em></strong></p>\n<p><strong>Khetarpaul:</strong> It’s going to provide a strategic foundation across marketing, digital and retail going forward. We see “It’s a Yes Day” as an operating model showing how to touch the customer at every touch point. It will impact our customer experience — how they feel when they come into a store, where we’re focused on providing a kid-first environment. It will also guide the products that we’re retailing, and overall help us tell better product stories and create better experiences and activities.</p>\n<p>We’ll be launching this in phases, starting with creative assets across retail and our website. Then we’ll be talking to the customer and do more storytelling about our head-to-toe messaging. We want to meet the consumer where they are, which is often on social media with their whole families.</p>\n<p>Additionally, we’re building a new influencer strategy with this new ethos, talking about how they feel about The Children’s Place brand and the shopping experience. The goal is to be as consistent as possible across all touch points, and also to be able to iterate [as we progress] to get better and better. We’ll also see creative refreshes for periods like back-to-school and holiday that will double down on that “It’s a Yes Day” expression as we try to make it more and more authentic.</p>\n<p>Additionally, this year, there will be specific brand partnerships [supporting “It’s a Yes Day”] coming down the pike.</p>\n<p><strong><em><mark class=\"has-inline-color has-vivid-red-color\" style=\"background-color:rgba(0, 0, 0, 0)\">RTP: What impact do you see this new platform having on The Children’s Place’s business?</mark></em></strong></p>\n<p><strong>Khetarpaul: </strong>Ultimately, any brand positioning refresh must drive business. I see the opportunity here as shifting our marketing from short-term, transaction-driven messaging to a much more long-term customer connection and community-building experience that fuels the entire ecosystem. The goal is to build high-quality organic demand over that long term. It’s been a labor of love to come to this point, and I’m also very proud of getting The Children’s Place to this point in such a short time.</p>\n<p></p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/retail-success-stories/exclusive-qa-why-any-day-can-be-a-yes-day-at-the-childrens-place",
            "pub_date": "2026-02-24 22:08:08",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Target Expands Levi’s Partnership to 1,000+ Stores",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><a href=\"https://www.target.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Target</strong></a> will bring denim styles from <a href=\"https://www.levistrauss.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Levi Strauss &amp; Co.</strong></a> to an additional <strong>150</strong> stores, reaching a total of more than <strong>1,000</strong> locations by the end of 2026. The retailer also will grow its Levi’s women’s <a href=\"https://www.target.com/b/levi-s/-/N-54zpr\" rel=\"noreferrer noopener\" target=\"_blank\">assortment</a> by <strong>20%</strong> for spring 2026, including trend-driven pieces with relaxed and looser leg silhouettes, updated washes and lifestyle pieces such as tops and overalls. Most styles will be priced under <strong>$60</strong>.</p>\n<p>The iconic Levi’s brand has been riding a renewed wave of interest and got a big boost earlier this month, when Super Bowl LX was played at Levi’s Stadium. Levi’s <a href=\"https://www.retailtouchpoints.com/features/news-briefs/levis-claims-home-turf-advantage-with-super-bowl-pop-up-activations\" rel=\"noreferrer noopener\" target=\"_blank\">celebrated</a> the event in its home town of San Francisco with a series of pop-ups and activations.</p>\n<p>Back in 1976, Target was one of the first retailers to carry Levi’s jeans, and the company reintroduced Levi’s products in 2011. Since then, the partnership has expanded from value-driven core styles to a broader assortment of Levi’s Red Tab denim and lifestyle pieces, and Levi’s has become one of Target’s longest-standing national partnerships.</p>\n<p>“Guests turn to Target to find the styles, brands and value they love, which is why our partnership with Levi’s is so important,” said Gena Fox, SVP, Apparel and Accessories at Target in a statement. “Through our partnership, we’re growing Target’s denim business by delivering exactly what our guests want: on-trend style, exceptional quality and unmatched value.”</p>\n<p>“Levi’s is the #1 denim brand in the world and our evolution into a head-to-toe denim lifestyle brand is resonating with Target guests,” said Heidi Manes, SVP and Managing Director of Levi’s U.S. and Canada in a statement.</p>\n</div>",
            "link": "https://www.retailtouchpoints.com/features/news-briefs/target-expands-levis-partnership-to-1000-stores",
            "pub_date": "2026-02-24 01:01:22",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Judge Approves $1 Billion Bankruptcy Loan after Saks Global Addresses Vendors’ Concerns",
            "description": "<div class=\"elementor-element elementor-element-d3c07bd elementor-widget elementor-widget-theme-post-content\" data-element_type=\"widget\" data-id=\"d3c07bd\" data-widget_type=\"theme-post-content.default\" id=\"ArticleContent\">\n<p><em>[Update as of Feb. 23, 2026] </em>U.S. Bankruptcy Judge Alfredo Perez has approved <strong>$1 billion</strong> in new funding for <a href=\"https://www.saksglobal.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Saks Global</strong></a> after the brand resolved concerns with luxury suppliers, landlords and <strong>Amazon</strong>, which had partnered with Saks Global to create an online sales platform, according to <a href=\"https://www.reuters.com/legal/litigation/saks-global-gets-final-court-approval-1-billion-bankruptcy-loan-after-addressing-2026-02-20/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Reuters</em></a>.</p>\n<p>Following Saks Global’s bankruptcy filing last month, many vendors raised concerns that the original bankruptcy loan could allow Saks’ lenders to claim “collateral rights to millions of dollars in luxury handbags, clothing and jewelry that the luxury brands had sent to Saks on consignment,” according to the <a href=\"https://www.reuters.com/legal/litigation/saks-global-gets-final-court-approval-1-billion-bankruptcy-loan-after-addressing-2026-02-20/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Reuters</em> </a>article. Prior to the hearing in the U.S. Bankruptcy Court for the Southern District of Texas, Saks and its lenders reached agreements confirming that inventory provided on consignment was not Saks’ property. The company also resolved objections regarding rent payments owed for January 2026.</p>\n<p>An attorney representing a <a href=\"https://www.reuters.com/legal/litigation/amazon-chanel-appointed-represent-saks-creditors-bankruptcy-2026-01-28/\" rel=\"noreferrer noopener\" target=\"_blank\">court-appointed committee</a> of Saks’ junior creditors said that nearly <strong>$600 million</strong> of the new financing will be used to make catch-up payments to vendors, with approximately <strong>$330 million</strong> going out in the next <strong>two</strong> weeks.</p>\n<h2 class=\"wp-block-heading\"><strong>Amazon Takes Issue with Saks Global Bankruptcy</strong></h2>\n<p><em>[Update as of January 15, 2026]</em> A judge has <a href=\"https://finance.yahoo.com/video/saks-global-obtains-court-approval-111037031.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAB_kTw67C-ONcrxeZ3mzRyOoWMtnTOhsEdEWYbR5REdRE2sxKtVRJaW5Vzl4IGXalf_6VM2dC7ViZC-u5ryp2NFLPicaXxrFQJNq84GtEeBaV1Nkuuo55fKQYwqRgo9mXyLYJb3j6OipSKFW17ZOSUuquig07xgnqN8v1GKAFyuZ\" rel=\"noreferrer noopener\" target=\"_blank\">approved</a> <a href=\"https://www.saksglobal.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Saks Global</strong></a>‘s request for <strong>$400 million</strong> in rescue financing to keep operations afloat as it moves forward with its bankruptcy and restructuring, but one notable company is challenging the whole plan — <strong><a href=\"https://www.amazon.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Amazon</a></strong>.</p>\n<p>The online retailer became a minority stakeholder in Saks Global in 2024 as part of an agreement that helped facilitate Saks’ acquisition of Neiman Marcus, according to <em><a href=\"https://finance.yahoo.com/news/amazon-blasts-saks-funding-deal-014757395.html\" rel=\"noreferrer noopener\" target=\"_blank\">Bloomberg</a></em>. Part of the deal was that Saks would begin selling on Amazon (which it did in <a href=\"https://www.retailtouchpoints.com/features/news-briefs/saks-to-curate-new-multi-brand-luxury-storefront-on-amazon\" rel=\"noreferrer noopener\" target=\"_blank\">April 2025</a>), giving Amazon a referral fee on all sales and guaranteeing at least <strong>$900 million</strong> in payments to Amazon over <strong>eight</strong> years. </p>\n<p>However, Amazon said in a court filing on Wednesday that Saks Global’s proposed restructuring plan will make its equity investment in the business “presumptively worthless,” because it would saddle Saks with <strong>billions </strong>of new debt obligations that would harm Amazon and other unsecured creditors of Saks.</p>\n<p><em>Original story from January 14, 2026 begins-</em></p>\n<h2 class=\"wp-block-heading\"><strong>Saks Global Files for Bankruptcy, Names Former Neiman Marcus Chief as CEO</strong></h2>\n<p>A little over <strong>one</strong> year after it completed its <a href=\"https://www.retailtouchpoints.com/features/mergers-and-acquisitions/saks-parent-hbc-to-buy-neiman-marcus-group-for-2-65-billion-including-investment-from-amazon\" rel=\"noreferrer noopener\" target=\"_blank\">acquisition of Neiman Marcus</a>, luxury conglomerate <strong>Saks Global </strong>has filed for Chapter 11 bankruptcy in the U.S. Bankruptcy Court for the Southern District of Texas, and has appointed former Neiman Marcus Group CEO Geoffroy van Raemdonck as CEO.</p>\n<p>While the bankruptcy has been expected, the CEO switch-up is an abrupt about-face — <a href=\"https://www.retailtouchpoints.com/features/financial-news/saks-global-names-new-ceo-as-bankruptcy-rumors-continue-to-swirl\" rel=\"noreferrer noopener\" target=\"_blank\">just a week and a half ago</a>, Executive Chairman Richard Baker was named as the replacement for long-time Saks Global CEO Marc Metrick. However, as of Jan. 13, Baker has stepped down from his roles as CEO and Executive Chairman.</p>\n<p>In conjunction with its bankruptcy filing, Saks Global — which in addition to Neiman Marcus also owns the <strong>Saks Fifth Avenue</strong>, <strong>Bergdorf Goodman</strong>, <strong>Saks Off 5TH</strong>, <strong>Last Call</strong> and <strong>Horchow</strong> brands — secured a financing commitment of approximately <strong>$1.75 billion</strong>, including <strong>$1.5 billion</strong> from an ad hoc group of its senior secured bondholders and approximately <strong>$240 million</strong> of incremental liquidity from its asset-based lenders. The ad hoc group also has committed to <strong>$500 million</strong> of additional financing when Saks emerges from bankruptcy, which the company said it expects to happen later this year.</p>\n<h2 class=\"wp-block-heading\"><strong>A ‘Transformative Financial Transaction’ for Saks</strong></h2>\n<p>Saks is framing the move as a “transformative financial transaction” that will strengthen the company’s balance sheet and position it for a more stable future. <strong>All stores and websites across the company’s portfolio will remain open throughout the process.</strong></p>\n<p>Saks Global currently operates <strong>70</strong> full-line luxury locations as well as a number of off-price locations and ecommerce platforms for each of its banners. As part of the Chapter 11 process, the company said it <strong>will evaluate this operational footprint </strong>to ensure it is investing resources where there is “the greatest long-term potential.”</p>\n<p>That process will be led byVan Raemdonck — who previously served as CEO of Neiman Marcus Group prior to its acquisition by Saks Global, as well as in previous roles at <strong>Louis Vuitton</strong> and <strong>Ralph Lauren</strong> — alongside current CFOBrandy Richardson, who served as CFO with him at Neiman Marcus Group.</p>\n<p>“Geoffroy has a proven track record driving transformative growth at Neiman Marcus Group and other brands, building trusted relationships within these organizations and throughout the industry,” said Paul Aronzon, a member of Saks Global’s Board of Directors, in a statement. “His leadership will help advance the company’s focus on stability and long-term value creation. We also want to thank Richard, who was a visionary leader during his tenure at Saks Global. We are grateful for his contributions and wish him continued success in the future.”</p>\n<h2 class=\"wp-block-heading\"><strong>Van Raemdonck: ‘This is a Defining Moment’</strong></h2>\n<p>Van Raemdonck has moved quickly to expand his senior leadership team with a series of appointments, including:</p>\n<ul class=\"wp-block-list\">\n<li>Darcy Penick as President and Chief Commercial Officer, overseeing stores, marketing, buying, digital, analytics and customer care; and </li>\n<li>Lana Todorovich as Chief of Global Brand Partnerships, leading the luxury retailer’s efforts with brand partners at an enterprise level.</li>\n</ul>\n<p>“This is a defining moment for Saks Global, and the path ahead presents a meaningful opportunity to strengthen the foundation of our business and position it for the future,” said van Raemdonck in a statement. “In close partnership with these newly appointed leaders and our colleagues across the organization, we will navigate this process together with a continued focus on serving our customers and luxury brands. I look forward to serving as CEO and continuing to transform the company so that Saks Global continues to play a central role in shaping the future of luxury retail.”</p>\n<p>Saks Global is seeking relief through a number of customary “first day” motions with the court to facilitate a smooth transition into Chapter 11 and the continuation of operations. These motions include requests to honor all customer programs, make go-forward payments to vendors and continue employee payroll and benefits.</p>\n<p>Upon court approval, the <strong>$1 billion</strong> of debtor-in-possession financing from the ad hoc group will provide the liquidity Saks needs to fund its operations and turnaround initiatives.</p>\n<h2 class=\"wp-block-heading\"><strong>The Writing has Been on the Wall for a While</strong></h2>\n<p>Saks has been showing signs of financial strain for nearly a year. Rumors of a bankruptcy filing first surfaced when, late last year, Saks missed an interest payment on the debt it took on to buy the Neiman Marcus Group.</p>\n<p>In fact, since that <strong>$2.7 billion</strong> acquisition, Saks has struggled to pay vendors, according to the <a href=\"https://www.wsj.com/finance/saks-prepares-for-bankruptcy-after-missing-debt-payment-ff3df6d2?mod=retail_news_article_pos5\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Wall Street Journal</em></a>, resulting in weaker merchandise offerings and sales. In <a href=\"https://www.retailtouchpoints.com/features/financial-news/saks-global-gets-600-million-in-financing-from-current-bondholders\" rel=\"noreferrer noopener\" target=\"_blank\">July 2025</a> Saks received <strong>$600 million</strong> in financing from a majority of its existing bondholders as part of a debt restructuring, a move that prompted S&amp;P Global Ratings to <a href=\"https://www.retailtouchpoints.com/features/financial-news/sp-global-downgrades-saks-credit-rating-calls-600-million-financing-deal-tantamount-to-a-default\" rel=\"noreferrer noopener\" target=\"_blank\">downgrade the retailer’s rating</a>, which said that “the planned exchange of its notes at a discount to par” was “tantamount to a default.”</p>\n<p></p>\n</div>",
            "link": "https://www.retailtouchpoints.com/topics/market-news/saks-global-files-for-bankruptcy-names-former-neiman-marcus-chief-as-ceo",
            "pub_date": "2026-02-24 00:01:23",
            "source": "retailtouchpoints",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}