{
    "data": [
        {
            "title": "Tech Moves: Zillow names CPO; AWS leader retires; Microsoft poaches AI expert from Apple",
            "description": "<p><strong>Zillow </strong>on Wednesday <a href=\"https://www.zillow.com/news/zillow-elevates-product-rentals-corporate-affairs-leaders/\">announced </a>three promotions to the senior leadership team of the Seattle-based real estate platform. </p>\n<ul class=\"wp-block-list\">\n<li>After nearly two-decades with Zillow, <a href=\"https://www.linkedin.com/in/christopherroberts1/\"><strong>Christopher Roberts </strong></a>is now chief product officer. Roberts helped build Zillow Rentals, which the the company touts as the No. 1 platform among renters. His Seattle tech career started at Expedia as a senior vice president of engineering. </li>\n<li><strong><a href=\"https://www.linkedin.com/in/jonplim/\">Jon Lim</a></strong> graduated from VP of product management to SVP of Rentals Product &amp; Business Operations. Prior to Zillow, Lim worked in technical product management roles at Amazon for more than five years. </li>\n<li><strong><a href=\"https://www.linkedin.com/in/marissalbrooks/\">Marissa Brooks</a></strong> is now SVP of corporate affairs, having previously served as VP of communications. Brooks, who works from Scottsdale, Ariz., joined Zillow in 2017.  </li>\n</ul>\n<p>Earlier this month, Zillow <a href=\"https://www.geekwire.com/2026/zillow-tops-estimates-with-654m-in-q4-revenue-up-18/\">reported </a>its revenue grew 16% last year. Its quarterly revenue, which came in at $654 million, was at the upper end of Zillow’s guidance and slightly higher than investors’ projections.</p>\n\n<p>— <a href=\"https://www.linkedin.com/in/jeffreykratz/\"><strong>Jeffrey Kratz</strong></a> is retiring from<strong> Amazon Web Services</strong> after more than 13 years. He’s leaving the role of vice president of Worldwide Public Sector Industry international sales. Throughout his tenure at AWS, Kratz worked with public sector customers, whom he described on <a href=\"https://www.linkedin.com/posts/jeffreykratz_amazon-aws-activity-7432183984509501440-IE31/?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAALbAY8BAMubgbU_YrKPSMQUTb8n4LKdJA0\">LinkedIn </a>as “making the world a better place.”</p>\n<p>Kratz previously was employed at crosstown rival Microsoft for two decades where he held a variety of leadership roles in enterprise and public sector sales.</p>\n<p>“Now it’s time to recharge, take Luna-the-pup on leisurely walks, spend quality time with Beverly, Andrew, family, and friends,” Kratz wrote, adding that he would work on his golf swing, volunteering and “spending more time with Boards in areas I am passionate about.” </p>\n<p>— In another <strong>Amazon </strong>departure, <a href=\"https://www.linkedin.com/in/jluan/\"><strong>David Luan</strong></a>, who led the company’s San Francisco-based AGI Lab and oversaw one of its most important agentic AI initiatives, is leaving for an undisclosed new gig. Luan <a href=\"https://www.linkedin.com/posts/jluan_ill-be-leaving-amazon-at-the-end-of-this-share-7432162649276153856-Tgev/\">announced </a>his exit on LinkedIn, saying he will leave at the end of the week. He joined Amazon through an <a href=\"https://www.geekwire.com/2024/amazon-hires-founders-from-well-funded-enterprise-ai-startup-adept-to-boost-tech-giants-agi-team/\">acqui-hire deal</a> targeting leaders at the startup Adept. More details are in this <a href=\"https://www.geekwire.com/2026/head-of-amazons-agi-lab-is-leaving-in-latest-exit-from-high-profile-adept-deal/\">GeekWire story</a>. </p>\n\n<p>— <strong>Microsoft </strong>nabbed <a href=\"https://www.linkedin.com/in/manasahari/\"><strong>Manasa Hari</strong></a> from Apple to join its California-based AI Super Intelligence program as a partner.</p>\n<p>“I’ll be supporting to build the infrastructure for human-centric AI systems that are safe, useful, and aligned with human needs. Inspired by Mustafa Suleyman’s mission to build AI that amplifies human potential, I’m excited about its broad impact on enterprise,” Hari said on <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7429730142966644736/?originTrackingId=rKrTZ1b865vGVYoX37kDjA%3D%3D\">LinkedIn</a>. </p>\n<p>Hari was previously head of product and program at Apple’s AIML Machine Learning Platform. She also serves on San Francisco State University’s Big Data Advisory Board, which provides input on course curriculum.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/craig-cincotta-2995774/\">Craig Cincotta</a></strong> has moved to chief of staff for <strong>Microsoft’s Xbox </strong>division, formerly holding the role of Microsoft general manager of communications for cloud and AI. Cincotta has been with the Redmond, Wash.-tech giant for more than 17 years over two stretches of employment. </p>\n<p>The company last week <a href=\"https://www.geekwire.com/2026/who-is-asha-sharma-a-closer-look-at-microsofts-surprise-pick-to-lead-the-xbox-business/\">announced </a>that Asha Sharma is taking the helm of Xbox and Microsoft Gaming, succeeding 38-year Microsoft veteran Phil Spencer. </p>\n\n<p>— <a href=\"https://www.linkedin.com/in/juliejkeef/\"><strong>Julie Keef</strong></a> is leaving her role of VP of product at <strong>Redfin</strong>, a Seattle real estate platform that was acquired nearly a year ago by Rocket Companies. Keef joined Redfin in 2016 as the first hire on what would become the company’s content marketing team. She was promoted seven times to reach her VP position in which she oversaw a team of 50. </p>\n<p>“We grew Redfin to the 3rd most visited real estate site, and held on to that spot despite competitors outspending us 5 to 1 on tech and advertising. And we had fun doing it. Even as the housing market turned and investment was hard to come by, the rabid squirrel spirit of Redfin persisted,” Keef said on <a href=\"https://www.linkedin.com/posts/juliejkeef_after-9-years-ive-decided-to-leave-redfin-activity-7430803293129363456-cYcO/?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAALbAY8BAMubgbU_YrKPSMQUTb8n4LKdJA0\">LinkedIn</a>. </p>\n<p>Keef did not disclose her next pursuit.</p>\n\n<p>— Seattle’s <strong>DexCare </strong>named <a href=\"https://www.linkedin.com/in/ravid/\"><strong>Ravi Doddivaripall</strong></a> as chief technology officer. Doddivaripall joins the company from XY Retail and has more than 25 years of senior platform and engineering experience. He is based in the San Francisco Bay Area. </p>\n<p>DexCare’s software platform helps healthcare providers manage their system’s capacity and schedule appointments. The startup launched at Providence, spinning out from the healthcare network’s digital innovation group in 2021. </p>\n<p>“Ravi brings the architectural depth and platform experience to accelerate what we’ve built to help more health systems treat more patients with the resources they already have,” said Matt Blosl, CEO of DexCare, in a statement.</p>\n\n<p>— <a href=\"https://www.linkedin.com/in/kellycbrooks/\"><strong>Kelly Brooks</strong></a> is now VP of sales for <strong>Read AI</strong>, a Seattle startup that sells enterprise productivity software tools using generative AI. Brooks joins from HubSpot where she worked for nearly nine years.</p>\n<p>On <a href=\"https://www.linkedin.com/posts/kellycbrooks_im-excited-to-share-that-ive-joined-read-share-7429558391414489088-Goz2/?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAABlvYYBjtme7erhHPfna4T99kpRsajUzno\">LinkedIn</a>, Brooks said she was attracted to the company after using its technology. </p>\n<p>“I saw immediate value from trialing the product, and got excited by the ways Read improves the transfer and access of information through organizations — perennial challenges I tackled as Chief of Staff at HubSpot,” Brooks wrote. “Inspired, I reached out to [CEO] <a href=\"https://www.linkedin.com/in/davidshim/\">David Shim</a> to make a connection. The rest is history… or at least a story for another day :)”</p>\n<p>— Serial entrepreneur and ShiftAI podcast host <a href=\"https://www.linkedin.com/in/boazashkenazy/\"><strong>Boaz Ashkenazy</strong></a> is now senior director of AI infrastructure for <strong>Redapt</strong>, a Woodinville, Wash.-based IT company.</p>\n<p>Ashkenazy is also co-founder of the legal tech startup Clause and co-founder and CEO of Augmented AI Labs, which builds and tests AI products. Ashkenazy additionally serves on the board of trustees for the Seattle Metropolitan Chamber of Commerce.</p>\n\n<p>— <strong><a href=\"https://www.linkedin.com/in/jeromejohnsonii/\">Jerome Johnson</a></strong> has a new leadership role at <strong>Amazon Web Services</strong>, serving as director of its professional services business for U.S. federal, defense and aerospace customers. Johnson, who is based in Arlington, Virginia, has been with AWS for more than 12 years. His previous role was director of solutions architecture for national security and defense customers.</p>\n<p>“While my focus expands from architecture leadership to business and delivery leadership, the mission remains the same: Serving customers by helping them solve their hardest problems with AWS,” Johnson wrote on LinkedIn.</p>\n<p>— <a href=\"https://www.linkedin.com/in/jillangelo/\"><strong>Jill Angelo</strong></a> is the new board chair of <strong>Special Olympics Washington</strong>. Angelo is the founder and past CEO of Gennev, a company billed as the first virtual menopause care provider in the U.S. The business was acquired by Unified Women’s Healthcare, where she served as president until last year. </p>\n<p>Angelo is also currently VP of women’s health and commercial partnerships at the wellness startup Oura.</p>\n<p>— <a href=\"https://www.linkedin.com/in/frieda-chan-phd-63386b89/\"><strong>Frieda Chan</strong></a> has left her role as manager of innovation development at the University of Washington’s CoMotion, the institution’s collaborative entrepreneurial hub. Chan is now director business development at <strong>Yale Ventures</strong>.</p>\n<p>— <strong>Yoodli </strong>shared that <a href=\"https://www.linkedin.com/in/tom-craven-cos/\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>Tom Craven</strong></a> is now the enterprise sales leader for the Seattle-based AI roleplay startup. </p>\n<p>—<strong> <a href=\"https://www.linkedin.com/in/williambal/\">William Bal</a></strong> is now VP of growth for <strong>EdgeRunner AI</strong>, a Virginia-based defense technology company. </p>\n<p></p>",
            "link": "https://www.geekwire.com/2026/tech-moves-zillow-names-cpo-aws-leader-retires-microsoft-poaches-ai-expert-from-apple/",
            "pub_date": "2026-02-26 03:01:17",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seattle-area startup Union.ai raises $19M to fuel AI workflow platform",
            "description": "<p>Bellevue, Wash.-based startup <a href=\"https://www.union.ai/\">Union.ai</a> announced that it closed a $38.1 million Series A round, led by NEA, with participation from Nava Ventures and new investor Mozilla Ventures. The total includes a previously announced $19.1 million portion raised in 2023.</p>\n<p>Union is the company behind <a href=\"https://flyte.org/\">Flyte</a>, an open-source orchestration tool used to run complex machine learning and data workflows. Union is positioning itself as broader “AI development infrastructure” — covering orchestration as well as pieces such as training, inference, and observability — aimed at helping engineering teams move from experimentation to production faster.</p>\n<p>“Building AI requires a fundamentally different approach than traditional software, and engineering teams are now embracing that,” CEO <a href=\"https://www.linkedin.com/in/ketanumare\">Ketan Umare</a> said in a statement.</p>\n<p>More from the company’s post on <a href=\"https://www.linkedin.com/posts/union-ai_ai-machinelearning-orchestration-activity-7432439577069645825-dWIQ?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAALbAY8BAMubgbU_YrKPSMQUTb8n4LKdJA0\">LinkedIn</a>:</p>\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>This funding comes at an inflection point for AI: engineering teams are discovering that legacy software infrastructure and devtools struggle to handle AI development. They were designed for basic and deterministic processes of traditional data workflows, not for the non-deterministic processes of AI workflows, which expect agents to adapt and recover from failure at runtime. Union.ai is building the new category of AI development infrastructure. Engineering teams can develop dynamic, durable AI workflows and agents while dramatically reducing time spent maintaining brittle pipelines.</p>\n</blockquote>\n<p>The startup says revenue grew 3X in 2025, and its customer base expanded 2.6X. Union’s customers include Spotify, HederaDx, Carfax, Hopper, and others.</p>\n<p>The company says the round supports the commercial launch of Union 2.0 and continued development of Flyte 2, including “pure Python” authoring, improved debugging, runtime decision-making, and crash-resilient workflows.</p>\n<p>Umare helped develop the underlying technology for Flyte while he was an engineer at Lyft. He previously worked at Amazon and Oracle. He co-founded Union.ai in 2020 with <a href=\"https://www.linkedin.com/in/haythamafutuh/\">Haytham Abuelfutuh</a>.</p>\n<p>The company has more than 40 employees and is actively hiring. </p>\n<p>Investors are backing various startups building behind-the-scenes infrastructure to help companies turn AI prototypes into reliable products. Temporal, a “durable execution” company rooted in the Seattle region, <a href=\"https://www.geekwire.com/2026/temporal-raises-300m-hits-5b-valuation-as-seattle-infrastructure-startup-rides-ai-wave/\">announced</a> a $300 million round last week. <br/></p>",
            "link": "https://www.geekwire.com/2026/seattle-area-startup-union-ai-raises-19m-to-fuel-ai-workflow-platform/",
            "pub_date": "2026-02-26 01:31:22",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bill Gates addresses Epstein fallout at foundation as new Microsoft revelations emerge",
            "description": "<p>Bill Gates apologized to Gates Foundation staff on Tuesday for his past interactions with the late convicted sex offender Jeffrey Epstein, acknowledging in an internal town hall that the situation puts the foundation’s reputation at risk, according to <a href=\"https://www.wsj.com/articles/bill-gates-apologizes-to-foundation-staff-over-epstein-ties-67f39ef5?gaa_at=eafs&amp;gaa_n=AWEtsqfn-NGS3riQASyM0Dh50bHMtf7q8-ojzN7nZxgVeRVMexKa76YvGoq2f2W113g%3D&amp;gaa_ts=699f20bc&amp;gaa_sig=Wmkg_p4_MQQsmMt45SiMP3sBOmFYOhzGhEPLaSfOhnscAwYMI5IDoL19YQ69Dzk2AxlN5bfqWysNjxar63h6WQ%3D%3D\">a Wall Street Journal report</a>.</p>\n<p>Gates met with Epstein multiple times from 2011 to 2014, years after the financier had pleaded guilty to soliciting a minor for prostitution, and continued the meetings even after his then-wife Melinda French Gates raised concerns in 2013, according to the WSJ report. </p>\n<p>He told staff it was “a huge mistake to spend time with Epstein” and to bring foundation executives into meetings with the sex offender, the newspaper reported. </p>\n<p>In the town hall, Gates acknowledged two extramarital affairs (with a Russian bridge player and a Russian nuclear physicist) that Epstein later discovered through Gates’s former science adviser Boris Nikolic, the WSJ reported. Gates insisted he didn’t participate in or witness any of Epstein’s crimes, telling staff, “I did nothing illicit. I saw nothing illicit.”</p>\n<p>Gates has not been accused of wrongdoing by any of Epstein’s victims.</p>\n<p>During the town hall, he acknowledged the broader implications for the foundation.</p>\n<p>“It definitely is the opposite of the values of the Foundation and the goals of the foundation,” he said, according to the recording reviewed by the newspaper. “And our work is very reputational sensitive. I mean, people can choose to work with us or not work with us.”</p>\n<p>In a statement to GeekWire, a Gates Foundation spokesperson said the town hall was a regularly scheduled internal event that Gates holds twice a year. </p>\n<p>“Bill answered questions submitted by foundation staff on a range of issues, including the release of the Epstein files, the foundation’s work in AI, and the future of global health,” the spokesperson said. “Bill spoke candidly, addressing several questions in detail, and took responsibility for his actions.”</p>\n<p>Last week, Gates<a href=\"https://www.aljazeera.com/news/2026/2/19/epsteins-shadow-why-bill-gates-pulled-out-of-modis-ai-summit\"> abruptly cancelled a planned keynote address</a> at India’s AI Impact Summit hours before he was scheduled to speak, with the foundation saying at the time that the decision was made “to ensure the focus remains on the AI Summit’s key priorities.”</p>\n<p>In <a href=\"https://www.gatesfoundation.org/ideas/media-center/press-releases/2026/02/doj-statement\">a previous statement</a>, the Gates Foundation said it was “aware of emails recently released by the U.S. Department of Justice” involving communication between Epstein and foundation staff, and that a small number of employees had interacted with Epstein based on his claims that he could “mobilize significant philanthropic resources for global health and development.” </p>\n<p>It said no collaboration was pursued and no payments were ever made to Epstein.</p>\n<p>Separately on Tuesday, the <a href=\"https://www.nytimes.com/2026/02/24/technology/jeffrey-epstein-microsoft-executives.html?unlocked_article_code=1.O1A.DQ_u.ksqayPbhCka6&amp;smid=url-share\">New York Times reported</a> that Epstein built a network of connections across Microsoft over more than two decades, reaching deeper into the company than any other major tech firm. </p>\n<p>The documents show Epstein receiving updates on Microsoft’s CEO search, offering advice to executives, and gaining access to confidential company business.</p>\n<p>Among those named in the NYT report: former CTO Nathan Myhrvold, who vouched for Epstein to Gates; former Windows chief Steven Sinofsky, who shared confidential Microsoft information with Epstein and sought his advice on his exit package; and LinkedIn co-founder Reid Hoffman, a current Microsoft board member who visited Epstein’s island and continued communicating with him through 2018, according to the newspaper.</p>\n<p>Microsoft communications chief Frank Shaw told the NYT that the company was “disappointed” by emails between Epstein and former employees “acting in their personal capacities.”</p>\n<p>The Seattle Times <a href=\"https://www.seattletimes.com/business/local-business/records-show-deeper-ties-between-epstein-ex-microsoft-exec-myhrvold/\">has separately reported</a> on deeper ties between Myhrvold and Epstein, including emails showing the two met regularly in Seattle and New York from 2010 through 2018, and correspondence that appeared to show Myhrvold visiting Epstein’s private island. </p>\n<p>Myhrvold was also listed as a “friend” in Epstein’s 2003 birthday book and contributed a personal letter to the project, as <a href=\"https://www.geekwire.com/2025/epstein-birthday-book-includes-apparent-letter-from-former-microsoft-cto-nathan-myhrvold/\">GeekWire previously reported</a>. </p>\n<p>A spokesperson for Myhrvold said previously that he knew Epstein “from TED conferences and as a donor to basic scientific research” and “regrets that he ever met him.”</p>\n<p>The Epstein revelations have had significant consequences elsewhere. </p>\n<p>Hyatt Hotels executive chairman Tom Pritzker <a href=\"https://www.nbcnews.com/politics/justice-department/epstein-files-fallout-resignations-firings-investigations-rcna259702\">stepped down</a> over his ties to Epstein, Goldman Sachs chief legal officer Kathy Ruemmler <a href=\"https://www.usnews.com/news/us/articles/2026-02-13/high-profile-resignations-and-replacements-as-epstein-case-fallout-spreads\">resigned</a>, Norway’s former Prime Minister Thorbjørn Jagland has been charged with aggravated corruption, and former British ambassador Peter Mandelson <a href=\"https://www.aljazeera.com/news/2026/2/24/epstein-files-the-arrests-and-the-resignations\">was arrested</a> in connection with the disclosures.</p>\n<p>In addition to his role at the foundation, Gates continues to advise Microsoft and serve as chairman of Bellevue-based TerraPower. Hoffman remains on the Microsoft board. Myhrvold is CEO of Intellectual Ventures and vice chairman of the TerraPower board.</p>",
            "link": "https://www.geekwire.com/2026/bill-gates-addresses-epstein-fallout-at-foundation-as-new-microsoft-revelations-emerge/",
            "pub_date": "2026-02-26 01:05:39",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pick Alexa’s personality: Amazon lets users choose ‘Brief,’ ‘Chill,’ or ‘Sweet’ conversation styles",
            "description": "<p>Tired of Alexa’s constant chatter? Wish Amazon’s voice assistant would just get to the point without all the extra stuff? Maybe I’m just speaking for myself? Anyway, relief is finally here.</p>\n<p>Amazon is rolling out <a href=\"https://www.aboutamazon.com/news/devices/alexa-plus-personality-styles\">a new option</a> to keep Alexa’s responses blessedly perfunctory in a new “Brief” mode for Alexa+, along with options for “Chill” and “Sweet” conversation styles that adjust the AI assistant’s tone and delivery across Alexa+ devices.</p>\n<p>Ask Alexa how it’s going in Brief mode, for example, and the response might be a curt “All systems operational.” Switch to Chill and it’s a zen “all systems are in harmony.” Go with Sweet and you’ll get something like an exuberant “radiating pure joy!” (Responses differ each time.)</p>\n<p>It’s a first for the voice assistant, available now for Alexa+ users. Users can switch by saying “Alexa, change your personality style” or through the Alexa app under device settings. Personality styles can also be paired with any of Alexa’s eight voice options, which include different genders and regional dialects.</p>\n<p>Alexa’s default personality also remains an option, and can be restored at any time.</p>\n<p>Amazon has <a href=\"https://www.geekwire.com/2023/amazon-is-ending-celebrity-voices-for-alexa-that-delivered-weather-jokes-and-more/\">previously offered</a> voice customization for Alexa, including celebrity add-ons like Samuel L. Jackson and Melissa McCarthy, but those were paid extras that altered phrasing on a limited set of responses rather than system-wide personality adjustments.</p>\n<p>The new option is part of Amazon’s broader Alexa+ overhaul, which has made the voice assistant more conversational, with the ability to take actions such as ordering takeout and booking dinner reservations. The company made the AI-powered upgrade available to all U.S. customers <a href=\"https://www.geekwire.com/2026/amazon-rolls-out-alexa-to-all-u-s-customers-making-its-ai-assistant-free-for-prime-members/\">earlier this month</a>, nearly a year after it was unveiled.</p>\n<p>The personality feature reflects a trend in consumer AI. For example, ChatGPT lets users <a href=\"https://help.openai.com/en/articles/11899719-customizing-your-chatgpt-personality\">customize its tone and behavior</a> through custom instructions, and Google’s Gemini offers <a href=\"https://www.reddit.com/r/GooglePixel/comments/1pqt7td/lpt_change_geminis_default_tone_response_style/\">different response styles</a>. Microsoft has been testing <a href=\"https://windowsforum.com/threads/microsoft-copilot-tests-personality-studio-for-custom-ai-styles.398958/\">a “Personality Studio”</a> for Copilot and introduced a “Real Talk” mode that mirrors the user’s conversational style.</p>",
            "link": "https://www.geekwire.com/2026/pick-alexas-personality-amazon-lets-users-choose-brief-chill-or-sweet-conversation-styles/",
            "pub_date": "2026-02-25 23:25:15",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon to move out of longtime office building near its main Seattle headquarters",
            "description": "<p>Amazon plans to exit an office building near its Seattle headquarters, 12 years after taking over the space during the height of its growth in the city.</p>\n<p>Amazon is not renewing its lease at <a href=\"https://www.hines.com/properties/1915-terry-seattle\">1915 Terry Ave</a>. in the Denny Triangle area of downtown Seattle, the company confirmed to GeekWire on Tuesday. The tech giant, which has occupied the seven-story, 251,000-square-foot space owned by Seattle Children’s since 2014, will move out at the end of May and relocate employees to other offices.</p>\n<p>The Puget Sound Business Journal first <a href=\"https://www.bizjournals.com/seattle/news/2026/02/24/amazon-seattle-building-lease-denny-triangle.html\">reported</a> on the planned move.</p>\n\n<p>Kumo, as Amazon calls it, is a 1950s-era building located just a few blocks from Amazon’s main office towers and the Spheres. Amazon did not say how many employees work from the building.</p>\n<p>The company employs approximately 50,000 corporate and tech employees in Seattle. <a href=\"https://www.geekwire.com/2026/amazon-layoffs-hit-nearly-2200-in-washington-state-more-than-half-in-core-product-and-engineering-roles/\">More than 1,400 workers</a> in Seattle were impacted by company-wide <a href=\"https://www.geekwire.com/2026/amazon-confirms-16000-more-job-cuts-bringing-total-layoffs-to-30000-since-october/\">layoffs of 16,000 people</a> announced at the end of January.</p>\n<p>PSBJ reported that since 2020, Amazon has given up more than 1 million square feet of office space in Seattle, most of it in the Denny Triangle. </p>\n<p>The company has been growing its footprint across Lake Washington in Bellevue, where it has opened new office buildings and said it plans to employ 25,000 people as part of its regional HQ.</p>",
            "link": "https://www.geekwire.com/2026/amazon-to-move-out-of-longtime-office-building-near-its-main-seattle-headquarters/",
            "pub_date": "2026-02-25 11:26:45",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Head of Amazon’s AGI lab is leaving in latest exit from high-profile Adept startup deal",
            "description": "<p><a href=\"https://www.linkedin.com/in/jluan/\">David Luan</a>, who led Amazon’s San Francisco-based AGI Lab and oversaw one of its most important agentic AI initiatives, is leaving less than two years after joining the tech giant through an <a href=\"https://www.geekwire.com/2024/amazon-hires-founders-from-well-funded-enterprise-ai-startup-adept-to-boost-tech-giants-agi-team/\">acqui-hire deal</a> involving him and other leaders from AI startup Adept.</p>\n<p>Luan announced his exit Tuesday <a href=\"https://www.linkedin.com/posts/jluan_ill-be-leaving-amazon-at-the-end-of-this-share-7432162649276153856-Tgev/\">in a LinkedIn post</a>, saying he will leave at the end of the week “to cook up something new.”</p>\n<p>“There’s incredible work to be done at Amazon and opportunities for me to take on more areas. But with AGI so close, I decided to spend 100% of my time on teaching AI systems brand new capabilities,” Luan wrote, adding later, “I have a bet for what’s next.”</p>\n<p>With his departure, four of the five Adept co-founders who joined Amazon as part of the high-profile 2024 arrangement have left the company, a review of LinkedIn profiles shows.</p>\n<p>Peter DeSantis, a 27-year Amazon veteran and senior vice president who oversees the company’s custom chips and quantum computing efforts, late last year took over <a href=\"https://www.geekwire.com/2025/amazon-ai-chief-rohit-prasad-leaving-infrastructure-exec-peter-desantis-to-lead-unified-ai-group/\">the broader organization</a> that includes the AGI team, which is responsible for Amazon’s Nova Act AI agent technologies. Luan wrote that the team “will be in great hands” with DeSantis.</p>\n<p>Adept co-founder <a href=\"https://www.linkedin.com/in/kelseyschroeder/\">Kelsey Szot</a> remains at the company on the AGI team, and <a href=\"https://www.linkedin.com/in/bsilverthorn/\">Bryan Silverthorn</a>, a director of applied science who also joined Amazon from Adept, continues to lead agent model training research on the AGI team, his Linkedin profile shows.</p>\n<p>Amazon declined to comment beyond Luan’s post.</p>\n<p>The arrangement between Amazon and Adept is one of several acqui-hire deals that have drawn scrutiny from the Federal Trade Commission in recent years amid concerns that tech giants are using the structures to absorb AI startups without triggering formal merger reviews. </p>\n<p>Under the deal, Amazon hired Luan and other Adept leaders, and licensed the startup’s agent technology and AI models, while Adept continued operating independently with its remaining employees. The FTC reportedly <a href=\"https://www.cnbc.com/2024/07/16/amazons-deal-with-ai-startup-adept-faces-ftc-scrutiny.html\">examined</a> the Amazon-Adept deal in 2024. </p>\n<p>At Amazon, Luan served as vice president of Autonomy and led the AGI Lab, which was formally established in December 2024 as a small, focused research group. Its first major release was Nova Act, an AI model and developer toolkit for building agents that can perform tasks autonomously in web browsers, which Amazon <a href=\"https://www.geekwire.com/2025/amazon-unveils-nova-act-moving-further-into-the-ai-agent-race/\">unveiled in March 2025</a>.</p>\n<p>“We really think agents are the last missing piece on the path to general intelligence,” Luan told GeekWire in an interview ahead of the Nova Act launch.</p>\n<p>In his departure post on Tuesday, Luan said Nova Act had been adopted by customers including Hertz, 1Password, and Amazon.com itself, and had reached the top of the REALBench agent research leaderboard. The model became generally available as an AWS service at Amazon’s re:Invent conference in December.</p>\n<p>The other Adept co-founders who left Amazon scattered across the industry. <a href=\"https://www.linkedin.com/in/erichkelsen/\">Erich Elsen</a> departed after four months and is now a principal research scientist at Databricks. <a href=\"https://www.linkedin.com/in/augustus-odena-46b162140/\">Augustus Odena</a> and <a href=\"https://www.linkedin.com/in/maxwell-nye-279b81b6/\">Maxwell Nye</a> both left after about a year and are now research scientists at Meta.</p>\n<p>Before founding Adept in 2022, Luan ran research and engineering at OpenAI for three years and led Google’s large language model effort. In his departure post, he described his career as a series of early bets, including incubating the first GPTs at OpenAI, and going all-in on agents at Adept before others. </p>\n<p>He said Adept’s technology and people “now drive computer-use efforts at every major lab.”</p>\n<p>Amazon has separately invested up to $8 billion in Anthropic and offers third-party AI models alongside its Nova family through AWS, competing against cloud rivals Microsoft, Google, and others.</p>",
            "link": "https://www.geekwire.com/2026/head-of-amazons-agi-lab-is-leaving-in-latest-exit-from-high-profile-adept-deal/",
            "pub_date": "2026-02-25 08:22:31",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Head of Amazon’s AGI lab is leaving in latest exit from high-profile Adept startup deal",
            "description": "<p><a href=\"https://www.linkedin.com/in/jluan/\">David Luan</a>, who led Amazon’s San Francisco-based AGI Lab and oversaw one of its most important agentic AI initiatives, is leaving less than two years after joining the tech giant through an <a href=\"https://www.geekwire.com/2024/amazon-hires-founders-from-well-funded-enterprise-ai-startup-adept-to-boost-tech-giants-agi-team/\">acqui-hire deal</a> involving him and other leaders from AI startup Adept.</p>\n<p>Luan announced his exit Tuesday <a href=\"https://www.linkedin.com/posts/jluan_ill-be-leaving-amazon-at-the-end-of-this-share-7432162649276153856-Tgev/\">in a LinkedIn post</a>, saying he will leave at the end of the week “to cook up something new.”</p>\n<p>“There’s incredible work to be done at Amazon and opportunities for me to take on more areas. But with AGI so close, I decided to spend 100% of my time on teaching AI systems brand new capabilities,” Luan wrote, adding later, “I have a bet for what’s next.”</p>\n<p>With his departure, four of the five Adept co-founders who joined Amazon as part of the high-profile 2024 arrangement have left the company, a review of LinkedIn profiles shows.</p>\n<p>Peter DeSantis, a 27-year Amazon veteran and senior vice president who oversees the company’s custom chips and quantum computing efforts, late last year took over <a href=\"https://www.geekwire.com/2025/amazon-ai-chief-rohit-prasad-leaving-infrastructure-exec-peter-desantis-to-lead-unified-ai-group/\">the broader organization</a> that includes the AGI team, which is responsible for Amazon’s Nova Act AI agent technologies. Luan wrote that the team “will be in great hands” with DeSantis.</p>\n<p>Adept co-founder <a href=\"https://www.linkedin.com/in/kelseyschroeder/\">Kelsey Szot</a> remains at the company on the AGI team, and <a href=\"https://www.linkedin.com/in/bsilverthorn/\">Bryan Silverthorn</a>, a director of applied science who also joined Amazon from Adept, continues to lead agent model training research on the AGI team, his Linkedin profile shows.</p>\n<p>Amazon declined to comment beyond Luan’s post.</p>\n<p>The arrangement between Amazon and Adept is one of several acqui-hire deals that have drawn scrutiny from the Federal Trade Commission in recent years amid concerns that tech giants are using the structures to absorb AI startups without triggering formal merger reviews. </p>\n<p>Under the deal, Amazon hired Luan and other Adept leaders, and licensed the startup’s agent technology and AI models, while Adept continued operating independently with its remaining employees. The FTC reportedly <a href=\"https://www.cnbc.com/2024/07/16/amazons-deal-with-ai-startup-adept-faces-ftc-scrutiny.html\">examined</a> the Amazon-Adept deal in 2024. </p>\n<p>At Amazon, Luan served as vice president of Autonomy and led the AGI Lab, which was formally established in December 2024 as a small, focused research group. Its first major release was Nova Act, an AI model and developer toolkit for building agents that can perform tasks autonomously in web browsers, which Amazon <a href=\"https://www.geekwire.com/2025/amazon-unveils-nova-act-moving-further-into-the-ai-agent-race/\">unveiled in March 2025</a>.</p>\n<p>“We really think agents are the last missing piece on the path to general intelligence,” Luan told GeekWire in an interview ahead of the Nova Act launch.</p>\n<p>In his departure post on Tuesday, Luan said Nova Act had been adopted by customers including Hertz, 1Password, and Amazon.com itself, and had reached the top of the REALBench agent research leaderboard. The model became generally available as an AWS service at Amazon’s re:Invent conference in December.</p>\n<p>The other Adept co-founders who left Amazon scattered across the industry. <a href=\"https://www.linkedin.com/in/erichkelsen/\">Erich Elsen</a> departed after four months and is now a principal research scientist at Databricks. <a href=\"https://www.linkedin.com/in/augustus-odena-46b162140/\">Augustus Odena</a> and <a href=\"https://www.linkedin.com/in/maxwell-nye-279b81b6/\">Maxwell Nye</a> both left after about a year and are now research scientists at Meta.</p>\n<p>Before founding Adept in 2022, Luan ran research and engineering at OpenAI for three years and led Google’s large language model effort. In his departure post, he described his career as a series of early bets, including incubating the first GPTs at OpenAI, and going all-in on agents at Adept before others. </p>\n<p>He said Adept’s technology and people “now drive computer-use efforts at every major lab.”</p>\n<p>Amazon has separately invested up to $8 billion in Anthropic and offers third-party AI models alongside its Nova family through AWS, competing against cloud rivals Microsoft, Google, and others.</p>",
            "link": "https://www.geekwire.com/2026/head-of-amazons-agi-lab-is-leaving-in-latest-exit-from-high-profile-adept-deal/",
            "pub_date": "2026-02-25 08:22:30",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "San Francisco AI startup Nooks makes engineering push in Seattle",
            "description": "<p><a href=\"https://www.nooks.ai/\">Nooks</a> is nestling into Seattle. </p>\n<p>The San Francisco-based startup, which builds AI software for sales teams, is expanding its engineering footprint in Seattle — growing from zero to six engineers recently and hiring for more platform and product engineering roles. </p>\n<p>The company plans to open a Seattle office and has been working out of investor Tola Capital’s Seattle space while it ramps up, CTO and co-founder <a href=\"https://www.linkedin.com/in/nikhilcheerla/\">Nikhil Cheerla</a> told GeekWire.</p>\n<p>Cheerla said the company’s initial Seattle hires were intentional, aimed at tapping a “pocket of talent” — engineers with experience building scalable systems who want to join a fast-growing startup and experiment with the next wave of AI-powered software.</p>\n<p>Nooks’ Seattle move lands amid a broader conversation in the region about talent drift — from founders <a href=\"https://www.geekwire.com/2026/why-these-startup-founders-are-leaving-seattle-for-san-francisco/\">relocating to San Francisco</a> to executives weighing their next steps as Washington debates new tax proposals. In that context, Nooks is making the opposite bet: that Seattle’s depth of engineering talent, especially from large tech companies, makes it a durable hub for building applied AI.</p>\n<p>Other San Francisco companies, from software startup <a href=\"https://www.geekwire.com/2026/san-francisco-based-binti-opens-office-on-seattles-lake-union-to-tap-into-citys-great-talent-pool/\">Binti</a> to larger AI players including <a href=\"https://www.geekwire.com/2026/openai-inks-huge-lease-in-bellevue-doubling-down-on-seattle-region-near-microsoft-and-amazon-hqs/\">OpenAI</a> and <a href=\"https://www.geekwire.com/2026/elon-musks-xai-lands-in-bellevue-joining-openai-in-growing-eastside-ai-corridor/\">xAI</a>, have also recently expanded in the Seattle area. </p>\n<p>Cheerla and his co-founders at Nooks initially made their startup leap in 2020 with a virtual classroom tool during COVID. They later pivoted into a virtual collaboration product — and discovered the pain (and craft) of selling while trying to land customers themselves.</p>\n<p>Nooks is now focused on building AI-driven productivity software for sales teams. Its products aim to reduce the busywork around outbound sales: researching accounts, writing emails, handling dials/voicemails, summarizing calls, and recommending next steps — while keeping humans in the driver’s seat for judgment and relationship-building.</p>\n<p>Nooks competes in a crowded market for sales software, which includes incumbents like Seattle-based companies Outreach and Highspot (which just <a href=\"https://www.geekwire.com/2026/seattle-based-highspot-is-merging-with-rival-seismic-in-major-sales-software-deal/\">announced</a> a merger with Seismic). Cheerla said Nooks differentiates by bridging both data and intelligence with execution. He said this creates a feedback loop: by having the work happen in the same workspace, Nooks can learn from what reps do and refine the system over time.</p>\n<p>This week, Nooks is <a href=\"https://www.nooks.ai/blog-posts/introducing-ai-sequencing-the-evolution-of-intelligent-outbound\">rolling out</a> what it calls the Agent Workspace — a system where sales reps and AI agents collaborate in one place for tasks like prospecting, sequencing, dialing and LinkedIn follow-ups. Nooks says the system can learn a team’s best behaviors and apply those learnings at scale.</p>\n<p>Nooks <a href=\"https://www.nooks.ai/blog-posts/series-b\">raised</a> a $43 million Series B round in October 2024. Since then, the company says revenue has grown 6X. The company employs about 200 people, up from 90 a year ago. Its customers include HubSpot, Rippling, ZoomInfo, Toast, Postman, Vanta, and others.</p>\n<p>Tola Capital managing director <a href=\"https://www.linkedin.com/in/sheilagulati\">Sheila Gulati</a> said the company stands out for pushing AI directly into revenue workflows.</p>\n<p>“Nooks is the company evolving the sales experience through AI,” Gulati said. She added: “I’m excited to see Nooks expand into Seattle and deepen its impact across our ecosystem.”</p>\n<p>Nooks and Tola are also hosting a Seattle <a href=\"https://luma.com/w4e7h5ma\">event</a> Feb. 26 focused on domain-specific AI agents deployed in production, featuring speakers including Cheerla, along with <a href=\"https://www.linkedin.com/in/cbarve/\" rel=\"noreferrer noopener\" target=\"_blank\">Chinmay Barve</a>, VP of engineering at Nooks, Arm’s Sharbani Roy, and Pulumi’s Joe Duffy.</p>",
            "link": "https://www.geekwire.com/2026/san-francisco-ai-startup-nooks-makes-engineering-push-in-seattle/",
            "pub_date": "2026-02-25 00:57:23",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Water, power, and transparency: Amazon’s $12B data center deal signals a new era of accountability",
            "description": "<p>Amazon on Monday <a href=\"https://www.aboutamazon.com/news/company-news/amazon-data-center-louisiana-new-jobs\">announced </a>a $12 billion data center project in Louisiana in which the company vowed to pay its own way for energy and other infrastructure. </p>\n<p>The deal highlights the unwritten expectations now placed on tech giants to cover upfront power costs and other impacts. Such pledges have become commonplace as leaders at the state and national levels move to codify these commitments with new laws.</p>\n<p>Amazon’s Louisiana project includes a deal with Southwestern Electric Power Company (SWEPCO) to pay for “energy infrastructure and upgrades required to serve the data centers, which also strengthens overall grid reliability for all SWEPCO customers. In addition, Amazon has invested in solar energy projects in Louisiana, bringing up to 200 [megawatts] of new carbon-free energy onto the grid,” the company said.</p>\n<p>Washington state, where Amazon is based, is among the areas pursuing legislation to control the impact of data centers on local communities, including their use of energy and water to run the computer hubs that underpin the internet and support the growing use of artificial intelligence. </p>\n<p>The measure, <a href=\"https://app.leg.wa.gov/billsummary/?BillNumber=2515&amp;Chamber=House&amp;Year=2025\">House Bill 2515</a>, has <a href=\"https://www.geekwire.com/2026/washington-state-has-embraced-data-centers-but-now-its-looking-to-set-terms-of-engagement/\">passed the House</a> and is now being considered by the Senate. The legislation includes public reporting requirements about sustainability impacts and projected energy use, bringing heightened transparency to a sector that has often expanded and operated secrecy. </p>\n<p>On Monday, Sen. Bernie Sanders called again for a moratorium on data center deployments, citing Denver’s move to temporarily ban new facilities. In a post on <a href=\"https://x.com/SenSanders/status/2026048719259406750\">X</a>, the Vermont senator called out data centers’ environmental impacts, as well as AI’s threat to jobs and overall risks to humanity.</p>\n<p>Data centers are expected to drive roughly half of the energy growth demand in the U.S. by 2030, according to new data from the <a href=\"https://www.iea.org/reports/electricity-2026\">International Energy Agency</a>. Solar will provide much of the supply, but so will natural gas, which contributes to the continued warming of the planet.</p>\n<h3 class=\"wp-block-heading\">Louisiana deal</h3>\n<p>At its Louisiana project, Amazon is also pledging to use “only verified surplus water” — which refers to water that is otherwise deemed unneeded by the community where the data centers are based. </p>\n<p>Water is used by data centers to cool the electronics that produce heat while computing. Amazon expects to mostly use air to fan the machines, tapping into water cooling for less than 13% of the year in the peak of summer heat. </p>\n<p>The company will also spend up to $400 million to improve water infrastructure, plus an additional $250,000 earmarked for the Amazon Northwest Louisiana Community Fund. The philanthropic dollars will help pay for STEM education, sustainability efforts, health and other local needs. </p>\n<p>“Amazon is making a long-term commitment to Louisiana because our state delivers — prime sites, strong infrastructure and a skilled, hard-working workforce ready to support the next generation of technological innovation,” Louisiana Gov. Jeff Landry said in a <a href=\"https://www.aboutamazon.com/news/company-news/amazon-data-center-louisiana-new-jobs\">statement</a>.</p>\n<p>Cloud and AI rival Microsoft last month made a <a href=\"https://www.geekwire.com/2026/microsoft-responds-to-ai-data-center-revolt-vowing-to-cover-full-power-costs-and-reject-local-tax-breaks/\">good neighbor pledge</a> for all of its new data centers, vowing to pay the company’s full power costs, reject local property tax breaks, replenish more water than it uses, train local workers, and invest in AI education and community programs. </p>\n<p>“This sector worked one way in the past, and needs to work in some different ways going forward,” Microsoft President Brad Smith told GeekWire. </p>\n<h3 class=\"wp-block-heading\">Pursuit of clean power</h3>\n<p>The data centers keep coming. Amazon has committed to spending <a href=\"https://www.geekwire.com/2026/amazon-stock-sinks-10-after-q4-profit-miss-as-jassy-signals-200b-in-capital-spending/\">$200 billion</a> this year on capital expenditures worldwide, predominately for its Amazon Web Services cloud business. Microsoft expects to shell out up to $140 billion in capital expenses this year.</p>\n<p>Both companies are in hot pursuit of new clean energy sources, which in addition to wind, solar and batteries, also include new and existing nuclear power facilities and Microsoft is looking to fusion energy, an unproven but potentially game-changing option if and when it works.  </p>\n<p>A new <a href=\"https://about.bnef.com/insights/clean-energy/corporate-clean-energy-buying-fell-in-2025-after-nearly-a-decade-of-growth/\">report from BloombergNEF</a> found that Amazon, Microsoft, Meta and Google made nearly half of the world’s new clean energy deals last year. Amazon alone — which tied with Meta in making to most power purchase agreements — paid for nearly 10 gigawatts of energy globally. That’s about one-third of the power demand annually in California. </p>\n<p>Overall, the power purchase agreement sector declined for the first time in a decade as corporations in other sectors stepped back from the deals. </p>\n<p>Since 2023, Amazon has annually purchased enough clean energy <a href=\"https://www.geekwire.com/2024/amazons-carbon-footprint-shrinks-3-last-year-but-ai-driven-climate-challenges-loom/\">to match</a> its electricity use worldwide. </p>\n<p>Last week, Microsoft <a href=\"https://blogs.microsoft.com/blog/2026/02/18/a-milestone-achievement-in-our-journey-to-carbon-negative/\">announced </a>that it, too, hit that benchmark in 2025. That doesn’t mean the companies are literally using only climate friendly power — depending on when and where they operate, their data centers and operations will require fossil fuels while still supporting clean energy use globally.</p>\n<p></p>",
            "link": "https://www.geekwire.com/2026/water-power-and-transparency-amazons-12b-data-center-deal-signals-a-new-era-of-accountability/",
            "pub_date": "2026-02-24 07:05:58",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seattle startup Elevāt raises $12M to help industrial companies speed up equipment repairs",
            "description": "<p>Seattle startup <a href=\"https://www.elevat-iot.com/\">Elevāt</a> has raised $12 million as part of a Series A round to fuel growth of its software aimed at helping industrial companies and equipment makers streamline repairs and reduce downtime. </p>\n<p>Elevāt CEO <a href=\"https://www.linkedin.com/in/adam-livesay-5b557a10/\">Adam Livesay</a> confirmed the new funding but did not provide details on investors. </p>\n<p>The company is positioning itself as an answer to a growing shortage of skilled workers with expertise to maintain complicated industrial equipment. Its platform can improve first-time fix rates and reduce mean time to repair by combining telemetry, fault codes, manuals and repair history into AI-guided guidance for technicians. The company also says it can help teams triage issues remotely and predict failures to support proactive maintenance and parts planning.</p>\n<p>Livesay said the funding will help Elevāt expand into Europe. The company has customers in industries including construction, agriculture, and fire and safety.</p>\n<p>Livesay declined to share revenue or growth metrics.</p>\n<p>Elevāt launched in 2015 after spinning out of Western Integrated Technologies, a longtime Seattle-area manufacturer and integrator of fluid power systems.</p>\n<p>Elevāt co-founder <a href=\"https://www.linkedin.com/in/william-hill-3325591\">Bill Hill</a> recently transitioned from the CEO role to chairman of the board. </p>\n<p>The company has 25 employees and has raised $18.7 million to date. </p>",
            "link": "https://www.geekwire.com/2026/seattle-startup-elevat-raises-12m-to-help-industrial-companies-speed-up-equipment-repairs/",
            "pub_date": "2026-02-24 05:01:27",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Temporal CEO Samar Abbas on the ‘massive platform shift’ in AI fueling the startup’s $5B valuation",
            "description": "<p><a href=\"https://www.temporal.io/\">Temporal</a> co-founders <a href=\"https://www.linkedin.com/in/samar-abbas-381997/\">Samar Abbas</a> and <a href=\"https://www.linkedin.com/in/fateev/\">Maxim Fateev</a> have been tackling the same distributed systems problem since their days at Amazon, Microsoft, and Uber. But the AI boom has put the problem “on steroids” as agents move to production, according to Abbas — and investors have taken notice.</p>\n<p>Temporal last week <a href=\"https://temporal.io/news/temporal-raises-300M-to-make-agentic-ai-real-for-companies\">announced</a> a $300 million Series D round led by Andreessen Horowitz, pushing its valuation to $5 billion — up from $2.5 billion in October. </p>\n<p>Temporal’s revenue increased more than 380% year-over-year, reflecting demand for infrastructure services from companies using AI agents that are taking on more responsibilities.</p>\n<p>“There is a massive platform shift happening,” Abbas told GeekWire. “And there is a whole layer of infrastructure being developed right now.”</p>\n<p>Temporal’s pitch is something it calls “durable execution,” a new category Abbas says is about giving developers a simpler programming model for long-running, distributed workflows. Instead of wiring together queues, databases, retry mechanisms, and timers to handle failures, engineers write their logic as normal code and Temporal makes it durable behind the scenes.</p>\n<p>Abbas and Fateev launched Temporal in 2019, after they helped build an open-source orchestration engine called Cadence during their time at Uber. The tool was used by companies including HashiCorp, LinkedIn, Airbnb, Coinbase, and others.</p>\n<p>“Both of us have been obsessed about this problem space,” Abbas said, describing Temporal as “literally the fourth or fifth time we are building a similar system.”</p>\n<p>During the cloud era, Abbas said, Temporal became a “reliability backbone” for developers building mission-critical applications. Now, as AI models get smarter and agents hit production, the company is seeing huge scale.</p>\n<p>“We are kind of becoming the core piece of infrastructure which is powering the AI agentic wave,” Abbas said.</p>\n<p>Temporal’s customer base ranges from OpenAI, which uses the platform for image generation, to  Replit, which uses Temporal to orchestrate coding agents over extended sessions.</p>\n<p>“As long-running agents become a primary driver of enterprise value, the execution layer beneath them becomes indispensable,” investors with Andreessen Horowitz wrote in a <a href=\"https://a16z.com/announcement/investing-in-temporal/\">blog post</a>. “Temporal wasn’t built in reaction to generative AI; it was built to make complex systems durable. But the agentic era has made that need undeniable.”</p>\n<p>Asked about a potential AI bubble and broader hype, Abbas pointed to customers like Abridge in healthcare, where doctors can focus on patients instead of note-taking. He also noted transformation across legal workflows, coding agents, customer support, and research.</p>\n<p>“There is real value being delivered to real users,” he said.</p>\n<p>He envisions a future where “every human on the planet can be called a software developer” and the cost of building software keeps falling, driving demand for a reliable execution backbone.</p>\n<p>Temporal is built as a remote-first company, with around 375 employees and 62 of them in the Seattle area. Abbas and Fateev have been based in the region for decades, and many early employees are here as well.</p>\n<p>Abbas, who was previously CTO (he swapped roles with Fateev in 2024) said the software infrastructure expertise in Seattle is a good match for trends that Temporal is riding. “Seattle has the right ingredients of talent,” he said. “We’ll be doubling down and growing in the Seattle area.”</p>\n<p>As for advice to other founders riding the AI wave, Abbas said it’s about getting clarity on how you deliver value and avoiding all other distractions. “Just know who your users are — are they able to drive value from the product you are building?” He said Temporal is laser-focused on that strategy — and it seems to be working.</p>",
            "link": "https://www.geekwire.com/2026/temporal-ceo-samar-abbas-on-the-massive-platform-shift-in-ai-fueling-the-startups-5b-valuation/",
            "pub_date": "2026-02-24 03:16:06",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Who is Asha Sharma? A closer look at Microsoft’s surprise pick to lead the Xbox business",
            "description": "<p><strong>“And the thing about games is, if you get good at one game, you can be good at any game. … They’re all hand-eye coordination and observing patterns.”</strong></p>\n<p>That’s a line from <em><a href=\"https://www.goodreads.com/book/show/58784475-tomorrow-and-tomorrow-and-tomorrow\">Tomorrow, and Tomorrow, and Tomorrow</a></em>, Gabrielle Zevin’s 2022 novel about two friends who build a video game company from nothing — struggling with the tension between art and commerce, and ultimately with the challenges of operating a business at scale.</p>\n<p>This describes almost perfectly what <a href=\"https://www.linkedin.com/in/aboutasha/\">Asha Sharma</a> will be attempting to do in <a href=\"https://www.geekwire.com/2026/xbox-chief-phil-spencer-retiring-after-38-years-at-microsoft-asha-sharma-named-new-gaming-ceo/\">her new role</a> leading Microsoft’s Xbox and video-game business: She’ll need to take all the patterns she’s observed as an executive with Facebook, Instacart, Seattle startup Porch, and Microsoft’s AI platform, and apply them to a world she hasn’t played in before.</p>\n<p>And get this: it’s one of her favorite books.</p>\n<p>Speaking last fall on <a href=\"https://www.lennysnewsletter.com/p/how-80000-companies-build-with-ai-asha-sharma\">Lenny Rachitsky’s podcast</a>, Sharma mentioned she had read the novel every year for the past three years. “I love it so much,” she said, calling it a “beautiful story.”</p>\n<p>She didn’t mention on the podcast speed round that it’s a story about video games. It wasn’t really relevant at the time. But it is now, given the news Friday that Sharma will succeed 38-year Microsoft veteran Phil Spencer as <a href=\"https://blogs.microsoft.com/blog/2026/02/20/asha-sharma-named-evp-and-ceo-microsoft-gaming/\">CEO of Microsoft Gaming</a>, in a shakeup that also saw Xbox President Sarah Bond — previously seen as Spencer’s likely successor — decide to leave.</p>\n<p>Sharma was a surprise pick, in part because she has no prior video-game industry leadership experience, and limited background as a gamer, which is creating skepticism in gaming circles already. However, she has experience running large tech platforms, the clear trust of Microsoft CEO Satya Nadella, and a belief in the potential of AI to reshape every business.</p>\n<p>On that last point, she quickly offered some reassurance to Microsoft employees and the broader universe of Xbox gamers in her introductory memo last week.</p>\n<p>“As monetization and AI evolve and influence this future, we will not chase short-term efficiency or flood our ecosystem with soulless AI slop,” she wrote. “Games are and always will be art, crafted by humans, and created with the most innovative technology provided by us.”</p>\n<p>Sharma laid out three priorities in the memo: great games above all else, a recommitment to Xbox’s core console fans, and what she called the “future of play” — new business models and a shared platform where developers and players can create together. </p>\n<p>She vowed not to treat the company’s iconic franchises as “static IP to milk and monetize,” and said she wants to return to “the renegade spirit that built Xbox in the first place.”</p>\n<p>Her first act was promoting longtime studio chief Matt Booty to executive vice president and chief content officer, pairing her platform background with his decades of gaming credibility. </p>\n<p>“My first job is simple,” she wrote. “Understand what makes this work and protect it.”</p>\n<h4 class=\"wp-block-heading\"><strong>The challenge ahead</strong></h4>\n<p>There’s a lot to protect, and plenty of work to do. Microsoft has been in gaming for decades, from early PC titles like <em>Flight Simulator</em> to the launch of the original Xbox console in 2001. </p>\n<p>Under Spencer, the company made massive bets on expansion, acquiring ZeniMax Media and its family of studios — including Bethesda — for $7.5 billion in 2021, and then closing the $69 billion acquisition of Activision Blizzard in 2023, the largest gaming deal in history. </p>\n<p>That brought Call of Duty, World of Warcraft, Candy Crush, Diablo, and Overwatch under Microsoft’s roof, making it the third-largest gaming company in the world by revenue. </p>\n<p>Spencer also expanded Xbox’s reach across PC, mobile, and cloud gaming, and built Game Pass into a major subscription service, transforming the division’s business model.</p>\n<p>But the financial picture has been rough. Microsoft’s gaming revenue fell 9% in the most recent quarter, with hardware revenue down 32%. The division represents about 7% of the company’s total revenue, and has faced pressure in recent years to meet aggressive profit targets.</p>\n<p>Xbox’s challenge has not been a lack of talent or popular franchises. GeekWire gaming contributor Thomas Wilde <a href=\"https://www.geekwire.com/2026/analysis-the-best-thing-that-the-new-xbox-ceo-can-do-is-nothing/\">observed</a> that the biggest problem has been instability: waves of layoffs and studio closures that left even successful teams uncertain about their future.</p>\n<p>In his memo about the transition, Nadella said Sharma brings “deep experience building and growing platforms, aligning business models to long-term value, and operating at global scale.”</p>\n<p>The implication in the selection is clear: Xbox spans console, PC, mobile, and cloud platforms, requiring an operator who knows how to make all the pieces work together. </p>\n<p>That’s the job Sharma has done everywhere she’s been.</p>\n<h4 class=\"wp-block-heading\"><strong>From Wisconsin to Redmond</strong></h4>\n<p>Sharma’s career and biographical details have been widely scrutinized over the past few days, as the video game and business press have scrambled to figure out who this person is, who arrived seemingly out of the blue to lead one of Microsoft’s biggest consumer brands. </p>\n<p>Now 37, she grew up in Wisconsin and started working at 17, with an early role at SC Johnson, according to <a href=\"https://martech.org/get-know-porch-com-cmo-asha/\">a 2014 MarTech profile</a>. She earned a bachelor’s degree in business from the University of Minnesota’s Carlson School of Management, and by the time she left college had worked at Cargill, Deloitte, and Microsoft, and lived abroad in Hungary.</p>\n<p>As of last fall, she was a second-degree black belt in Taekwondo, explaining to Rachitsky on his podcast that the discipline is “more mental than it is physical.”</p>\n\n<p>She has been at Microsoft for two years, running the CoreAI product organization, the team behind Azure AI Studio, the company’s AI model catalog, and the developer tools for Microsoft Copilot. She was previously COO of Instacart, and before that VP of product at Meta, where she ran Messenger and Instagram Direct. She’s on the Home Depot and Coupang boards.</p>\n<p>What’s lesser known is that she got her start at Microsoft, interning at the company and then working in marketing right out of college before leaving to help build Porch, the Seattle home services company, where she was COO during the company’s early years.</p>\n<p>In a 2024 interview with GeekWire at Microsoft’s Build developer conference, not long after rejoining the company, Sharma talked about what brought her back. After years working across different types of organizations, she said, the lesson she drew from her career was the importance of working with great people on problems that matter. </p>\n<p>She described feeling fortunate to be working on “some of the most important technology of our lifetime” at a critical juncture, with people embracing a growth mindset.</p>\n<h4 class=\"wp-block-heading\"><strong>Winning over the gamers</strong></h4>\n<p>Part of what made Spencer so beloved among Xbox fans was that he was one of them — a lifelong gamer with a prolific achievement history and a habit of wearing gaming T-shirts under blazers at industry events. </p>\n<p>Sharma knows she can’t replicate that overnight, but she’s clearly trying to close the gap.</p>\n<p>Over the weekend, she began engaging directly with Xbox fans on social media, sharing her gamertag (AMRAHSAHSA, her name spelled backwards) and listing her top three games as “Halo, Valheim, Goldeneye” — Microsoft’s flagship franchise, a popular survival game, and classic title that first launched on the Nintendo 64 in 1997.</p>\n<p>When one fan accused her account of being run by AI, she replied: “Beep Boop Beep Boop.”</p>\n<p>She’s also getting public support from inside Xbox. Longtime exec Aaron Greenberg, the division’s VP of marketing, <a href=\"https://x.com/aarongreenberg/status/2024957141208162474\">wrote on X</a> that after spending time with Sharma during the past week, he was “incredibly optimistic about the opportunity ahead under her leadership,” describing her as “exceptionally bright, eager to listen and learn from others, no ego.”</p>\n<p>The activity history in Sharma’s Xbox profile, which <a href=\"https://www.ign.com/articles/beep-boop-beep-boop-new-xbox-boss-asha-sharma-hits-back-at-claim-her-social-media-account-is-run-by-ai-and-posts-her-gamertag\">IGN</a> and <a href=\"https://www.windowscentral.com/gaming/xbox/newly-named-xbox-ceo-asha-sharma-has-shared-her-gamertag-so-what-is-she-playing-and-why-does-it-matter\">Windows Central</a> quickly dissected, shows she’s played about 30 titles since mid-January, gravitating toward narrative-driven indie games like <em>Firewatch</em>, <em>Gone Home</em>, and <em>What Remains of Edith Finch</em> — the kinds of games you’d play if you wanted to understand games as art, not just entertainment.</p>\n<p>She unlocked her first achievement Jan. 15, about five weeks before the announcement of her new role. It was a <em>Halo: Master Chief Collection</em> milestone, fittingly titled “Your Journey Begins.”</p>",
            "link": "https://www.geekwire.com/2026/who-is-asha-sharma-a-closer-look-at-microsofts-surprise-pick-to-lead-the-xbox-business/",
            "pub_date": "2026-02-24 01:26:19",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon pushes back on Financial Times report blaming AI coding tools for AWS outages",
            "description": "<p>Seven hours <a href=\"https://www.techmeme.com/260220/h1500\">at the top of Techmeme</a> was apparently too much for Amazon to take.</p>\n<p>The tech giant’s cloud division, Amazon Web Services, issued an unusually pointed public rebuttal Friday afternoon to a widely cited <a href=\"https://www.ft.com/content/00c282de-ed14-4acd-a948-bc8d6bdb339d\">Financial Times report</a> asserting that Amazon’s own AI coding tools have caused at least two AWS outages in recent months. </p>\n<p>The story was picked up by numerous media outlets, and the widely followed tech news aggregator, as an example of the risks of deploying agentic AI tools, and the underlying question of who — or what —  is responsible when something goes wrong.</p>\n<p>In a blog post titled “<a href=\"https://www.aboutamazon.com/news/aws/aws-service-outage-ai-bot-kiro\">Correcting the Financial Times report about AWS, Kiro, and AI</a>,” Amazon acknowledged a limited disruption to a single service in one region last December but attributed it to a user error in configuring access controls, not a flaw in the AI tool itself.</p>\n<p>“The issue stemmed from a misconfigured role—the same issue that could occur with any developer tool (AI powered or not) or manual action,” Amazon said, noting that it received no customer inquiries about the disruption.</p>\n<p>In addition, the company wrote, “The Financial Times’ claim that a second event impacted AWS is entirely false.” </p>\n<p>This is where it gets into semantics, the key phrase being “impacted AWS.” In fact, the FT reported that Amazon itself acknowledged a second incident but said it did not affect a “customer-facing AWS service.” </p>\n<p>In other words, if an incident doesn’t impact a service used by customers, does it count as an outage? The FT called it one. Amazon clearly thinks not. And this is ultimately the crux of the dispute.</p>\n<p>As for the undisputed outage impacting AWS, the FT’s report cited four people familiar with the matter in describing a 13-hour interruption to an AWS system in mid-December. </p>\n<p>The sources said engineers had allowed Amazon’s Kiro AI coding tool — an agentic assistant capable of taking autonomous actions — to make changes, and that the tool determined the best course of action was to “delete and recreate the environment.”</p>\n<p>Multiple Amazon employees told the publication that it was the second time in recent months that AI tools had been involved in a service disruption. According to the FT report, a senior AWS employee said the outages were “small but entirely foreseeable,” adding that engineers had let the AI agent resolve issues without human intervention.</p>\n<p>AWS is Amazon’s most profitable division. It generated <a href=\"https://www.geekwire.com/2026/aws-growth-hits-3-year-high-custom-chips-top-10b-as-200b-capex-plan-rattles-investors/\">$35.6 billion in revenue</a> last quarter, up 24%, and $12.5 billion in operating income. The cloud unit is a significant focus of the company’s planned $200-billion capital spending spree this year, much of it directed toward AI infrastructure.</p>\n<p>In addition to using agentic tools in its own operations, Amazon is selling them to AWS customers, making any narrative about AI-caused outages particularly unwelcome.</p>\n<p>Amazon’s core defense — that the December incident was “user error, not AI error” — was already included in the FT’s original story. The blog post largely restates that position in a more prominent and pointed way.</p>\n<p>“We did not receive any customer inquiries regarding the interruption,” Amazon wrote in its response. “We implemented numerous safeguards to prevent this from happening again—not because the event had a big impact (it didn’t), but because we insist on learning from our operational experience to improve our security and resilience.”</p>\n<p>Amazon said the disruption was limited to AWS Cost Explorer, a tool that lets customers track their cloud spending, in one of its 39 geographic regions. <a href=\"https://www.reuters.com/business/retail-consumer/amazons-cloud-unit-hit-by-least-two-outages-involving-ai-tools-ft-says-2026-02-20/\">Reuters</a> and <a href=\"https://www.theverge.com/ai-artificial-intelligence/882005/amazon-blames-human-employees-for-an-ai-coding-agents-mistake\">The Verge</a> reported that the affected region was in mainland China, citing an Amazon spokesperson. It did not affect core services such as compute, storage, or databases, the company said.</p>\n<p>The company added that it has since implemented new safeguards, including mandatory peer review for production access.</p>\n<p><a href=\"https://x.com/MikeIsaac/status/2024996533717139615\">Posting on X</a>, New York Times reporter Mike Isaac called the Amazon response “the most prickly” he’d seen from Amazon in years, comparing it to the past era when former White House press secretary Jay Carney, who led public policy for the company, spoke out strongly in its defense.</p>",
            "link": "https://www.geekwire.com/2026/amazon-pushes-back-on-financial-times-report-blaming-ai-coding-tools-for-aws-outages/",
            "pub_date": "2026-02-21 11:09:42",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysis: The best thing that the new Xbox CEO can do is … nothing",
            "description": "<p>During Phil Spencer’s tenure as the CEO of Microsoft Gaming, he brought dozens of the games industry’s best developers and most beloved franchises under a single roof. As a result, his successor Asha Sharma is in a unique position where she really <em>can </em>succeed in the video game business, despite her inexperience in the field, without really trying.</p>\n<p>The <a href=\"https://www.geekwire.com/2026/xbox-chief-phil-spencer-retiring-after-38-years-at-microsoft-asha-sharma-named-new-gaming-ceo/\">surprising departures</a> of Phil Spencer and Sarah Bond from Xbox marks the end of a chaotic week for the global video game industry, as well as a new period of uncertainty for Microsoft’s already chaotic gaming division.</p>\n<p>At first glance, the news doesn’t appear to be good. Observers have noted that Sarah Bond was <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7430654858329767937/\">posting on LinkedIn</a> on Xbox’s behalf only a few hours before the story broke that she’d resigned. While Spencer has announced publicly that his retirement has been months in the making, Bond’s resignation initially seemed more sudden. (Bond has since <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7430753683912531968/\" id=\"https://www.linkedin.com/feed/update/urn:li:activity:7430753683912531968/\">posted on LinkedIn</a> that this transition has been in the works for a while.)</p>\n<p>Another point of cynicism comes from Spencer’s planned replacement. Sharma, the newly appointed CEO of Microsoft Gaming, is a relatively new face at Microsoft with no previous experience in the games industry.</p>\n<p>She’s moving over to Xbox from a previous stint as a president at Microsoft’s CoreAI division, which comes at the same time as Microsoft is already drawing fire — <a href=\"https://www.geekwire.com/2025/analysis-microsofts-copilot-for-gaming-is-a-solution-looking-for-a-problem/\">from <em>me</em></a><em>, </em>if no one else — for trying to wedge its Copilot LLM into every individual facet of its product lineup. Putting one of its AI leaders in charge of its games division sounds like an attempt to take another step in that direction.</p>\n<p>In her defense, and to her credit, Sharma does appear to have anticipated that initial criticism, writing <a href=\"https://blogs.microsoft.com/blog/2026/02/20/asha-sharma-named-evp-and-ceo-microsoft-gaming/\">in an email to the Microsoft Gaming team</a>: “…we will not chase short-term efficiency or flood our ecosystem with soulless AI slop. Games are and always will be art, crafted by humans, and created with the most innovative technology provided by us.”</p>\n<p>Sharma’s arrival as CEO comes on the heels of last October’s report that Microsoft’s video game division has spent the last two years <a href=\"https://www.geekwire.com/2025/new-report-about-crazy-xbox-profit-expectations-helps-shed-light-on-microsofts-broader-gaming-changes/\">working to meet deeply unrealistic profit margins</a>, as mandated by Microsoft CFO Amy Hood. That revelation served to at least partially explain some of the strange decisions Xbox was making, such as waves of layoffs, sudden studio closures, and abruptly canceling highly anticipated projects such as <a href=\"https://www.ign.com/articles/xboxs-canceled-perfect-dark-game-had-entire-chapters-of-motion-capture-recorded-and-a-doomed-rescue-plan-to-salvage-a-slimmed-down-version\">the Initiative’s reboot of <em>Perfect Dark</em></a>.</p>\n<p>With that news in mind, it’s reasonable to wonder if today’s news is the beginning of the end for Xbox. Microsoft has seemingly set the division up to fail for at least the last two years, which has led to rumors that executives are simply looking for an excuse to sunset the department.</p>\n<p>It’d even be a good time to jump out of the hardware game. Bond in particular had already been hyping up the next version of the Xbox, with <a href=\"https://www.geekwire.com/2025/pc-or-console-microsofts-new-handheld-gaming-device-raises-questions-about-xbox-strategy/\">last year’s portable ROG Xbox Ally</a> as a sort of effective sneak preview thereof. However, <a href=\"https://www.techradar.com/gaming/sony-could-be-forced-to-delay-the-ps6-to-2029-due-to-the-rising-cost-of-ram-as-nintendo-reportedly-considers-increasing-the-cost-of-the-switch-2\">recent memory shortages</a> created by data center demand are currently changing every hardware manufacturer’s plans. If Microsoft were to decide to postpone or even cancel the next Xbox, which could’ve arrived as soon as next year, the current cost of memory would be a solid excuse. Also of note: Xbox hardware revenue fell 32% in Microsoft’s most recent quarter.</p>\n<p>On the other hand, Sharma is counterbalanced by the promotion of Xbox’s Matt Booty to chief content officer. As the former head of Xbox Game Studios, Booty is one of the last big insiders left at Microsoft’s gaming division. In a perfect world, he’d form a good counterbalance to Sharma’s inexperience with the industry.</p>\n<p>Further, while Xbox has significant and ongoing PR issues, it’s not doing as poorly as many of its detractors would prefer to believe. Xbox is currently saddled with a bad reputation based upon its seemingly permanent third-place status in the console market; its recent tendency to suddenly fire thousands of people while abruptly shutting down its subsidiaries; and there’s <a href=\"https://bdsmovement.net/news/boycott-microsofts-xbox\">at least one significant organized boycott</a> against the company. That all adds up, which has left the enthusiast end of the games industry convinced that Xbox is on the verge of collapse.</p>\n<p>That aside, however, Xbox has shown some real signs of life in the last year. 2025 saw Xbox Game Studios release original IP like <em>Avowed, South of Midnight,</em> and <em>Keeper,</em> alongside franchise entries such as <em>Doom: The Dark Ages, Ninja Gaiden 4, The Outer Worlds 2,</em> <em>Grounded 2</em>, and a new <em>Call of Duty</em>. Many of these games were at least critically successful, and a few even sold well.</p>\n<p>Xbox’s 2026 lineup currently includes the long-awaited reboot of the <em>Fable </em>series, an <a href=\"https://www.geekwire.com/2026/zillow-teams-up-with-world-of-warcraft-to-exhibit-virtual-homes-inside-popular-game/\" id=\"https://www.geekwire.com/2026/zillow-teams-up-with-world-of-warcraft-to-exhibit-virtual-homes-inside-popular-game/\">upcoming <em>World of Warcraft </em>expansion</a>, a new <em>Forza Horizon </em>racing game, another <em>Gears of War</em>, and <em>Halo: Campaign Evolved</em>.</p>\n<p>Xbox’s problem has never been a lack of in-house talent or not having any popular franchises. For the last few years, its biggest issue has been instability. Even its internal studios that produced popular and successful games, such as Tango Gameworks (<em>Hi-Fi Rush</em>), were potentially on the chopping block. If your potential reward for doing <em>well </em>was <em>still </em>getting laid off, what’s your incentive to perform?</p>\n<p>As a result, the best move that Sharma could make as CEO, at least in the short term, might be to do nothing. In her memo to staff, the former Instacart and Meta exec laid out a big vision, noting that “we will invent new business models and new ways to play,” and that the company must “relentlessly question everything, revisit processes, protect what works, and be brave enough to change what does not.”</p>\n<p>But perhaps the right move, at least initially, is to lay low. If Sharma and Microsoft are simply willing and able to let their studios work, in their own time and at their own pace, without the imminent threat of another wave of layoffs, it could be the first step toward restoring some of Xbox’s tattered reputation.</p>",
            "link": "https://www.geekwire.com/2026/analysis-the-best-thing-that-the-new-xbox-ceo-can-do-is-nothing/",
            "pub_date": "2026-02-21 10:16:43",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xbox chief Phil Spencer retiring after 38 years at Microsoft; Asha Sharma named new gaming CEO",
            "description": "<p>Phil Spencer, the Xbox leader who spent 38 years at Microsoft and helped reshape the gaming industry through big acquisitions and a bet on cloud gaming, is retiring from the company.</p>\n<p>He will be succeeded as CEO of Microsoft Gaming by <a href=\"https://www.linkedin.com/in/aboutasha/\">Asha Sharma</a>, a former Instacart chief operating officer and Meta vice president who joined Microsoft two years ago, the company said Friday. </p>\n<p>The transition also includes the departure of Sarah Bond, the Xbox president who was widely seen as a potential Spencer successor, and the promotion of Matt Booty to executive vice president and chief content officer overseeing Microsoft’s nearly 40 game studios.</p>\n<p>In an email to employees, Spencer said he told Microsoft CEO Satya Nadella last fall that he was ready to step back, and that they had been planning the transition since then. He called his nearly four decades at Microsoft “an epic ride and truly the privilege of a lifetime.”</p>\n<p>Spencer “expanded our reach across PC, mobile, and cloud; nearly tripled the size of the business; helped shape our strategy through the acquisitions of Activision Blizzard, ZeniMax, and Minecraft; and strengthened our culture across our studios and platforms,” Nadella wrote in a separate memo.</p>\n<p>The longtime Xbox leader will remain in an advisory role through the summer to support the handoff. Bond is also expected to remain at the company through a transition period.</p>\n\n<p>Sharma, who is currently president of Microsoft’s CoreAI product organization, has roots in the Seattle startup community, with deep experience in consumer platforms and operations, and no prior experience in the video-game industry.</p>\n<p>That’s where Booty’s new role will presumably come in — as chief content officer, the industry veteran will oversee Microsoft’s sprawling studio portfolio, pairing his decades of gaming experience with Sharma’s operational background.</p>\n<p>In her first message to the gaming team, Sharma pledged to recommit to Xbox’s core console fans and vowed that the company would not “flood our ecosystem with soulless AI slop,” calling games “art, crafted by humans.”</p>\n<p>Microsoft had been planning to make the announcement next week, but accelerated its timeline after IGN learned about the plans from inside sources. The gaming publication <a href=\"https://www.ign.com/articles/phil-spencer-retiring-sarah-bond-out-matt-booty-promoted-as-microsoft-ai-exec-asha-sharma-named-new-xbox-boss-exclusive\">broke the news</a> a short time ago.</p>",
            "link": "https://www.geekwire.com/2026/xbox-chief-phil-spencer-retiring-after-38-years-at-microsoft-asha-sharma-named-new-gaming-ceo/",
            "pub_date": "2026-02-21 05:05:54",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tech Moves: Code.org has a new leader; Synapse vet joins Amazon; ex-Tableau CEO lands at Code Metal",
            "description": "<p>— <strong><a href=\"https://www.linkedin.com/in/kmeghji/\">Karim Meghji</a></strong> is taking over the the role of president and CEO at <strong>Code.org</strong>, the Seattle-based computer science education nonprofit.</p>\n<p>Meghji, the former CTO at Seattle digital remittance company Remitly, joined Code.org in 2022 to serve as chief product officer, leading the organization’s shift toward an AI-centered strategy. </p>\n<p><strong><a href=\"https://www.linkedin.com/in/cameronpwilson/\">Cameron Wilson</a></strong>, the longtime president at Code.org, is transitioning to an executive advisor role at the organization where he has worked for more than 12 years.</p>\n<p>“It’s impossible to overstate Cameron’s impact on Code.org and on the education system,” Code.org founder Hadi Partovi said in a news release on Friday. “He helped build an institution that will continue to serve students for generations, and I am profoundly grateful for his leadership and partnership.”</p>\n<p>Code.org was <a href=\"https://www.geekwire.com/2013/twin-brothers-ali-hadi-partovi-start-codeorg-solve-computer-science-education-gap/\">launched in 2013</a> by brothers Hadi and Ali Partovi with a mission to expand computer science education to K-12 students. Backed by nearly $60 million in funding from the likes of Microsoft, Amazon, Google and others, Code.org counts 102 million students and 3 million teachers on its platform today, with 232 million projects created by students around the world.</p>\n<p>Code.org says its AI curriculum has already helped more than 6 million students learn foundational concepts around the technology. More than 25 million students have completed activities in its <a href=\"https://code.org/en-US/hour-of-ai\">“Hour of AI”</a> campaign.</p>\n<p>The company employs 107 people following <a href=\"https://www.geekwire.com/2026/code-org-lays-off-18-employees-to-ensure-long-term-sustainability-at-education-nonprofit/\">layoffs in January</a>.</p>\n<p>Partovi, who has been operating as chairman of the board for the past two years, will continue in that role.</p>\n\n<p>— <strong><a href=\"https://www.linkedin.com/in/jeffreyjhebert/\">Jeff Hebert</a></strong> is a new senior hardware manager at <strong>Amazon</strong> leading a team working on last-mile delivery innovations.</p>\n<p>“Intelligent sensors, human-digital interfaces, and robotics that leverage the latest capabilities of AI, edge processing, and connectivity have immense potential to increase safety and efficiency at the heart of Amazon’s business,” he said in a <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7430280048139526144/\">post on LinkedIn</a>.</p>\n<p>Hebert spent 15 years at Seattle-based product development firm Synapse and left as president last August. He was most recently at consulting firm Capgemini Invent.</p>\n<p>— Former Tableau CEO <strong><a href=\"https://www.linkedin.com/in/ryanaytay?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAALB_QBzzzC_cdojCyGNH09gFlUgESwT1I&amp;lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3Bk%2F2WvbYRQYeU2F%2FWR%2FENEA%3D%3D\">Ryan Aytay</a></strong> is the new president and chief operating officer of <strong>Code Metal</strong>, a Boston-based company that builds AI tools that automatically translate and optimize code for different hardware systems.</p>\n<p>Aytay <a href=\"https://www.geekwire.com/2026/tech-moves-tableau-ceo-steps-down-microsoft-taps-new-executive-vps-avanades-new-ceo/\">announced earlier this month</a> that he was leaving Salesforce after 19 years. He’d been serving since 2023 as the CEO of Tableau, the Seattle-based data visualization company that was acquired by Salesforce in 2019.</p>\n<p>“I’m incredibly energized about this next chapter,” Aytay wrote <a href=\"https://www.linkedin.com/posts/ryanaytay_today-im-excited-to-share-that-ive-joined-activity-7430341478637457408-LHoW/\">on LinkedIn</a>. “The combination of world-class tech, real customer demand, and team building with urgency and integrity is rare — and I feel lucky to be part of it!”</p>\n<p>Code Metal just closed a $125 million <a href=\"https://www.businesswire.com/news/home/20260219267824/en/Code-Metal-Secures-%24125M-Series-B-at-%241.25B-Valuation-to-Bridge-the-Trust-Gap-in-AI-Code-Generation\">Series B funding round</a> at a $1.25 billion valuation.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/douglas-dawson-9672773/\">Douglas Dawson</a></strong>, a longtime communications leader at <strong>Microsoft</strong>, is now leading comms for the team focused on Microsoft’s cloud and AI strategy. He previously led Microsoft’s global communications team, and has been with the company for almost 12 years.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/harshah?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAAAPRXsBF8KvJ6-3-EMJ-LaKc4Jy2pF7PPk&amp;lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3BkWSs%2F5nWTVGcm1x6kgS3UQ%3D%3D\">Harshit Shah</a></strong> is the new chief technology officer at <strong>LiveView Technologies</strong>, a company that develops cloud-connected video surveillance, safety, and remote monitoring solutions. Shah was previously CTO at Kyruus Health. He spent four years as an engineering leader at Amazon Web Services and another 10 at Microsoft as a software and program manager.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/diana-leo-49562923/\">Diana Leo</a></strong> is the new vice president of governmental affairs for the <strong>Bellevue Chamber of Commerce</strong>.</p>\n<p>Leo has an extensive background in politics, policy, and public service. She previously led multi-state advocacy for iCivics, advancing nonpartisan K-12 civic education policies through legislative engagement. She served as grassroots and outreach director for Utah Sen. Mike Lee and held senior leadership appointments in the first Trump administration.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/andrewmarshallpeterson/?lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3B6Q%2B8UQ%2BCQniwjKps%2B7u0Tw%3D%3D\">Andrew Peterson</a></strong> joined the board of directors at Austin, Texas-based cybersecurity company <strong>DryRun Security</strong>.</p>\n<p>Peterson is a Seattle native and entrepreneur-turned-investor who <a href=\"https://www.geekwire.com/2024/this-seattle-investor-went-from-google-to-africa-to-a-big-exit-and-is-back-home-investing-in-startups/\">returned to the city</a> to lead Aviso Ventures, a venture capital fund founded in 2023 to back early stage enterprise and infrastructure software startups. He previously co-founded Signal Sciences, a cybersecurity company acquired by Fastly in 2020.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/vinvalentinowa?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA3gr2UBHzdwGLYCqIQJnpX2VQe-LPohOmw&amp;lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3BBmX0XCCPTu65ICkjA8koeA%3D%3D\">Vincent Valentino</a></strong> is the new energy economy lead at the <strong>Washington State Department of Commerce</strong> following more than three years leading green economy initiatives for the City of Seattle’s Office of Economic Development.</p>\n<p>Valentino, who is also vice chair of the board of Washington State Green Bank, said in a <a href=\"https://www.linkedin.com/posts/vinvalentinowa_after-three-and-a-half-years-leading-the-activity-7430115101405401088-KKXQ/\">post on LinkedIn</a>, that he’s looking forward to “continuing to work to make Washington a national leader in all things clean energy and climate tech!”</p>",
            "link": "https://www.geekwire.com/2026/tech-moves-code-org-has-a-new-leader-synapse-vet-joins-amazon-ex-tableau-ceo-lands-at-code-metal/",
            "pub_date": "2026-02-21 04:04:47",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Microsoft’s new RTO policy starts Feb. 23, bringing Seattle-area workers back 3 days a week",
            "description": "<p>Remember that return-to-office mandate Microsoft <a href=\"https://www.geekwire.com/2025/microsoft-sets-new-rto-policy-requiring-employees-in-the-office-3-days-per-week/\">announced last fall</a>? It’s almost here.</p>\n<p>Monday, Feb. 23 — yes, next week! — will mark the start of the company’s new policy requiring Puget Sound (a.k.a. Seattle-area) employees who live within 50 miles of a Microsoft office to show up at least three days a week, the company confirmed in response to GeekWire’s inquiry.</p>\n<p>It’s a big shift for one of Big Tech’s last holdouts on flexible work. It’s also a potentially significant development for local traffic, given that there are more than 50,000 Microsoft employees in the Seattle region, at last count.</p>\n<p>“Gird your loins and prepare for a potentially longer commute,” the Bellevue Chamber <a href=\"https://www.bellevuechamber.org/news/5-things-you-need-to-know-this-week-new-vp-of-government-affairs-another-week-in-oly\">wrote in its newsletter</a>, in an item titled, “Get Your Booty Back to Work: Microsoft’s Turn.”</p>\n<p>The good news: Sound Transit’s Crosslake Connection is <a href=\"https://www.geekwire.com/2026/light-rail-across-lake-washington-a-major-connection-for-seattle-area-tech-hubs-to-open-march-28/\">set to open March 28</a>, finally linking Seattle and the Eastside by light rail across Lake Washington — connecting downtown Seattle to downtown Bellevue and the Redmond Technology station at Microsoft headquarters.</p>\n<p>The Seattle-area rollout is the first phase, with other U.S. offices next and international locations later this year. The policy replaces Microsoft’s previous hybrid arrangement, which let most employees work remotely up to half the time without manager approval. </p>\n<p>The company isn’t dictating from above which three days people will need to be in the office. Specifics are left to individual teams and managers. Some groups may require more than three days, and certain customer-facing roles like field sales and consultants are exempt.</p>\n<p>The mandate brings Microsoft in line with Google and Facebook parent Meta, which have similar three-day requirements. Amazon, the region’s other tech giant, <a href=\"https://www.geekwire.com/2025/on-the-ground-from-amazon-hq-in-seattle-small-businesses-excited-as-5-day-policy-kicks-in/\">went further last year</a>, requiring employees to be back in the office five days a week.</p>\n<p>In <a href=\"https://blogs.microsoft.com/blog/2025/09/09/flexible-work-update/\">her memo to employees</a> last September, Microsoft EVP and Chief People Officer Amy Coleman said the change isn’t about cutting headcount. “It’s about working together in a way that enables us to meet our customers’ needs,” she wrote. </p>\n<p>Still, the mandate could impact the workforce through attrition, consistent with what has happened at other companies that have implemented tighter RTO policies. The new policy comes after Microsoft cut <a href=\"https://www.geekwire.com/2025/microsoft-cuts-another-4-of-its-workforce-about-9000-jobs-in-continued-push-for-efficiency/\">more than 15,000 jobs globally</a> last year.</p>",
            "link": "https://www.geekwire.com/2026/microsofts-new-rto-policy-starts-feb-23-bringing-seattle-area-workers-back-3-days-a-week/",
            "pub_date": "2026-02-21 03:20:58",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Remitly CEO Matt Oppenheimer steps down, hands reins of fintech company to former Amazon exec",
            "description": "<p>Remitly co-founder <a href=\"https://www.linkedin.com/in/mattoppenheimer/\">Matt Oppenheimer</a> is stepping down as CEO after nearly 15 years growing the Seattle-based digital remittance company into a profitable, publicly traded fintech giant valued at nearly $3 billion.</p>\n<p>Veteran tech and finance executive <a href=\"https://www.linkedin.com/in/sebastian-j-gunningham-ba820/\">Sebastian Gunningham</a> will replace Oppenheimer, effective Feb. 19. Oppenheimer will remain chairman as the company leans into what it calls its next chapter.</p>\n<p>“This transition isn’t about stepping back. It’s about stepping up into the role that best serves Remitly’s long-term success,” Oppenheimer wrote in an <a href=\"https://www.linkedin.com/pulse/remitly-leadership-announcement-matt-oppenheimer-bo81c\">email</a> to employees. He stressed that the leadership change “didn’t happen overnight,” as he approached the company’s board “a while back” to discuss long-term succession planning.</p>\n<p>Gunningham previously led Amazon’s marketplace and payments businesses, working directly for Jeff Bezos, and was a member of Amazon’s executive “S-team.” He also did a brief stint as co-CEO at WeWork and more recently helped lead a digital transformation push at Spanish banking giant Santander. “I’ve long admired Remitly’s mission and the real difference it makes in people’s lives,” Gunningham said in a statement.</p>\n<p>Remitly stock was up more than 10% in after-hours trading Wednesday. </p>\n<p>The CEO change marks the end of an era for Oppenheimer and Remitly, which also on Wednesday <a href=\"https://ir.remitly.com/news-releases/news-release-details/remitly-reports-fourth-quarter-and-full-year-2025-results-above\">reported</a> double-digit increases in customers and transaction volume in the fourth quarter, along with adjusted EBITDA of $88.6 million, nearly doubling from the prior year. Send volume on the platform rose 35% to $20.8 billion.</p>\n\n<p>Remitly’s mobile technology lets people send and receive money across borders, including immigrants in the U.S. and U.K. who support families back home in countries such as the Philippines, India, El Salvador, and others. The service eliminates many of the forms, codes, and agents typically associated with international money transfers.</p>\n<p>The Remitly story began more than a decade ago after Oppenheimer had just returned from Kenya, where he was working for Barclays and realized how hard it was for families to send and receive money overseas.</p>\n<p>He teamed up with co-founders <a href=\"https://www.linkedin.com/in/joshhug\">Josh Hug</a> and <a href=\"https://www.linkedin.com/in/shivaas\">Shivaas Gulati</a>, taking Remitly from a tiny upstart that graduated from Techstars Seattle in 2011 into a global remittance player that battled incumbents such as Western Union and MoneyGram. Remitly raised around $400 million from private investors and went public in 2021 at a valuation of nearly $7 billion.</p>\n<p>Remitly now has more than 9.3 million quarterly active users — up 19% year-over-year — and employs 3,200 people across the globe. It reported $442.2 million in Q4 revenue, up 26% year-over-year.</p>\n<p>The company has been laying out a new evolution that keeps remittances at the core but adds products like a small‑business payments service, a membership offering with multi‑currency wallets and debit cards, the ability to access a line of credit, and new tools for stablecoin-based balances. </p>\n<p>Recent earnings language notes that Remitly is evolving beyond a remittance company into a diversified, cross-border financial services provider, serving both consumers and businesses across a growing set of use cases.</p>\n<p>In his memo to staff, Oppenheimer highlighted Gunningham’s personal story — “Argentine by birth, Scottish by heritage, and American by journey” — noting that he brings a global perspective that aligns with the company’s customer base. “He knows what it feels like to navigate a global financial services system.,” Oppenheimer wrote. “He understands that we aren’t just moving money; we are moving hope.”</p>\n<p>Oppenheimer, who won Ernst &amp; Young’s Pacific Northwest Entrepreneur of the Year award in 2016, told employees he will remain Remitly’s largest individual shareholder “with no plans to sell” and will stay “deeply engaged as chairman, not as an operator of the business where I will defer to Sebastian.” He said he intends to spend more time on cross-industry initiatives where Remitly’s scale and technology can address systemic issues; invest more energy in external relationships and additional board roles; and be more present with his family while pursuing personal goals such as training for a Half Ironman in July.</p>\n<p>“This transition isn’t a conclusion. It’s a renewal. It is a deeper commitment to the vision we have held from the beginning,” he wrote. “I’m grateful. I’m humbled. And I’m excited for the bright future ahead.”</p>",
            "link": "https://www.geekwire.com/2026/remitly-ceo-matt-oppenheimer-steps-down-hands-reins-of-fintech-company-to-former-amazon-exec/",
            "pub_date": "2026-02-19 07:02:07",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Microsoft exec Charlie Bell shifts to new role as Hayete Gallot returns from Google to lead security",
            "description": "<p><em>In today’s installment of “As the Tech World Turns” … </em></p>\n<p>A former Microsoft exec is returning to the company from Google to lead its security initiatives, replacing the former Amazon exec who’s exiting the security role to live out a longstanding engineering dream, serving as an individual contributor at the Redmond company.</p>\n<p>Microsoft CEO Satya Nadella <a href=\"https://blogs.microsoft.com/blog/2026/02/04/updates-in-two-of-our-core-priorities/\">announced</a> Wednesday that <a href=\"https://www.linkedin.com/in/hayetegallot/\">Hayete Gallot</a> is rejoining Microsoft from Google Cloud as executive vice president of security, taking over the organization built by <a href=\"https://www.linkedin.com/in/charlie--bell/\">Charlie Bell</a> in the more than four years since <a href=\"https://www.geekwire.com/2021/microsoft-amazon-reach-truce-allowing-former-aws-executive-charlie-bell-start-new-role/\">he joined Microsoft</a> from Amazon Web Services.</p>\n<p>Nadella said in the post that he had asked Bell “to take on a new role focused on engineering quality, reporting to me,” adding that they had been planning the transition for some time, “given his desire to move from being an org leader to being an IC engineer.”</p>\n\n<p>Gallot was most recently president of customer experience for Google Cloud. Before that, she spent more than 15 years at Microsoft in senior leadership roles across engineering and sales, helping build the Windows and Office franchises, including security solutions.</p>\n<p>“As we embark on one of the most significant transformations in our lifetime, realizing the astonishing potential of AI will only succeed if we can secure AI solutions and make them safe,” Gallot <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7424862241180663809/\">wrote on LinkedIn</a>.</p>\n<p>In his tenure in the role, Bell oversaw the development of Microsoft’s Security, Compliance, Identity, and Management organization into a major business as the company faced intense scrutiny over high-profile breaches by Russian and Chinese hackers.</p>\n<p><strong>GEEKWIRE ARCHIVE: <a href=\"https://www.geekwire.com/2022/former-amazon-exec-inherits-microsofts-complex-cybersecurity-legacy-in-quest-to-solve-one-of-the-greatest-challenges-of-our-time/\">Exec inherits Microsoft’s complex security legacy</a></strong></p>\n<p>He led the Secure Future Initiative, launched in late 2023 and described as the largest cybersecurity engineering effort in Microsoft’s history, mobilizing the equivalent of 34,000 full-time engineers to overhaul the company’s security practices.</p>\n<p>“Folks who’ve known me for the last 25 years will know that my LinkedIn title was simply ‘engineer’ for most of my executive career,” Bell <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7424862261686456320/\">wrote</a> in a post about the news, adding that he’s excited to regain the title and “all the rights and privileges” that come with it.</p>",
            "link": "https://www.geekwire.com/2026/microsoft-exec-charlie-bell-shifts-to-new-role-as-hayete-gallot-returns-from-google-to-lead-security/",
            "pub_date": "2026-02-19 02:21:32",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tech Moves: Sana hires CFO; Aptevo names new CEO; Violett founder departs; and more",
            "description": "<p>— <a href=\"https://www.linkedin.com/in/brian-piper/\"><strong>Brian Piper</strong></a>, a longtime biotech leader, is the new CFO at Seattle-based <strong>Sana Biotechnology</strong>. </p>\n<p>Piper was previously CFO at Antares Therapeutics, Scorpion Therapeutics, and Prelude Therapeutics. </p>\n<p>Piper was also given an executive vice president title at Sana, a cell and gene therapy company that went public in 2021.</p>\n<p>“We have meaningful momentum in our type 1 diabetes and <em>in vivo</em> CAR T programs, and his leadership will be critical as we continue to advance our portfolio, optimize long‑term value creation, and work to deliver these transformative therapies for patients,” Sana CEO Steve Harr said in a press release.</p>\n<p>— <strong><a href=\"http://linkedin.com/in/marvin-white-5561b2285\">Marvin White</a></strong> is stepping down as CEO of <strong>Aptevo Therapeutics</strong> in April after leading the Seattle biotech company since 2016, following its spinout from Emergent BioSolutions. <strong><a href=\"http://linkedin.com/in/jeff-lamothe-49323b173\">Jeff Lamothe</a></strong>, the company’s COO and longtime exec, will be the new CEO. White will remain executive chair.</p>\n<p>— <a href=\"https://www.linkedin.com/in/scott-kushino-095b284/\"><strong>Scott Kushino</strong></a> was named CEO at <strong>Violett</strong>, a Seattle startup that sells air purification tech. Kushino had been advising Violett and is a longtime Seattle-area tech leader. Violett founder <strong><a href=\"https://www.linkedin.com/in/brandendoyle/\">Branden Doyle</a></strong> <a href=\"https://www.linkedin.com/posts/brandendoyle_seattle-startup-activity-7429246988975583232-62Z7?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAALbAY8BAMubgbU_YrKPSMQUTb8n4LKdJA0\">said</a> he’s transitioning to another Seattle startup. Violett also added <a href=\"https://www.linkedin.com/in/stevensmark1/?lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3B6JdGqrgnRVimJ5itYYmIPA%3D%3D\"><strong>Mark Stevens</strong></a> as vice president of sales and <strong><a href=\"https://www.linkedin.com/in/ryan-k-palmer/?lipi=urn%3Ali%3Apage%3Ad_flagship3_detail_base%3B6JdGqrgnRVimJ5itYYmIPA%3D%3D\">Ryan Palmer</a> </strong>as a fractional CTO.</p>\n<p>— <strong><a href=\"http://linkedin.com/in/rohilbh\">Rohil Bhansali</a></strong> was promoted to head of engineering at Adora, a Seattle marketing startup. Bhansali was a founding engineer and previously spent six years at Pinterest.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/tedplumis/\">Ted Plumis</a></strong> joined New York startup <strong>Noma Security</strong> to lead go-to-market partnerships. Plumis is a Seattle-area sales vet who previously was a senior vice president at Exabeam and vice president at Imperva.</p>\n<p>— <a href=\"https://www.linkedin.com/in/marktranterseattle/\"><strong>Mark Tranter</strong></a> joined <strong>Clark Nuber PS</strong> as chief revenue officer. Tranter is an angel investor in Seattle and previously co-founded CFO Selections, an executive search and interim consulting service provider.</p>\n<p>— <a href=\"https://www.linkedin.com/in/tthomas/\"><strong>Teresa Thomas</strong></a> started a new role at <strong>Zillow</strong> <strong>Group</strong> as director of product, agentic AI and experiences. Thomas joined Zillow in 2019 and has held various senior manager positions.</p>\n<p><strong>— ​​<a href=\"https://www.linkedin.com/in/mikerich/\">Mike Rich</a></strong>, former VP at Panopto and comScore, was named head of partnerships at Seattle startup <strong>Yoodli</strong>. Rich was more recently a senior director at Signifyd. Yoodli also hired <a href=\"https://www.linkedin.com/in/ryan-hartlage-56174214/\"><strong>Ryan Hartlage</strong></a>, a former senior director at PitchBook, as a SMB sales leader. </p>\n<p>— <a href=\"https://www.linkedin.com/in/greg7smith/\"><strong>Greg Smith</strong></a> joined Seattle-area startup <strong>Scala</strong> as global head of growth and GTM. Smith was a group vice president at Transcarent and a senior marketing manager at GE Healthcare Digital and Premera Blue Cross. Scala just <a href=\"https://www.geekwire.com/2026/ai-startup-founded-by-ex-accolade-leaders-lands-8-5m-from-seattle-vcs-to-rethink-contact-center-operations/\">announced</a> a $8.5 million seed round.</p>\n<p>— <strong><a href=\"https://www.linkedin.com/in/aaronstacy/\">Aaron Stacy</a></strong> joined <strong>Placements.io</strong> as senior enterprise sales director. Stacy previously worked at Amazon and Microsoft.</p>\n<p>— <a href=\"https://www.linkedin.com/in/conrad-pastore-120569111/\"><strong>Conrad Pastore</strong></a> was named senior immigration specialist at Seattle startup <strong>Casium</strong>. Pastore was previously a senior subject matter expert at fellow Seattle-based immigration startup Boundless.</p>",
            "link": "https://www.geekwire.com/2026/tech-moves-sana-hires-cfo-aptevo-names-new-ceo-violett-founder-departs-and-more/",
            "pub_date": "2026-02-19 02:15:52",
            "source": "geekwire",
            "kind": 1,
            "language": "en"
        }
    ]
}