{
    "data": [
        {
            "title": "Oil Jumps 10%, Could Hit US$100 After Strike On Iran",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Brent crude jumped 10 per cent to about $80 a barrel over the counter on Sunday, oil traders said, while analysts predicted that prices could climb as high as $100 after U.S. and Israeli strikes on Iran plunged the Middle East into a new war.\n\n\n\n</p><p>“While the military attacks are themselves supportive for oil prices, the key factor here is the closing of the Strait of Hormuz,” said Ajay Parmar, director of energy and refining at ICIS.Most tanker owners, oil majors and trading houses have suspended crude oil, fuel and liquefied natural gas shipments via the Strait of Hormuz, trade sources said, after Tehran warned ships against moving through the waterway. More than 20 per cent of global oil is moved through the Strait of Hormuz.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>“We expect prices to open (after the weekend) much closer to $100 a barrel and perhaps exceed that level if we see a prolonged outage of the Strait,” Parmar said. \n\n\n\n</p><p>Middle East leaders have warned Washington that a war on Iran could lead to oil prices jumping to more than $100 a barrel, said RBC analyst Helima Croft. Barclays analysts also said prices could hit $100.\n\n\n\n</p><p>The OPEC+ group of oil producers agreed on Sunday to raise output by 206,000 barrels per day (bpd) from April, a modest increase representing less than 0.2 per cent of global demand.\n\n\n\n</p><p>While some alternate infrastructure could be used to bypass the Strait of Hormuz, the net impact from its closure would be a loss of 8 million to 10 million bpd of crude oil supply even after diverting some flows through Saudi Arabia’s East-West pipeline and Abu Dhabi pipeline, said Rystad energy economist Jorge Leon. Rystad expects prices to rise by $20 to about $92 a barrel when trade opens.\n\n\n\n</p><p>The Iran crisis also prompted Asian governments and refiners to assess oil stockpiles and alternative shipping routes and supplies.\n\n\n\n</p><p><em>Reuters</em>\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/03/01/oil-jumps-10-could-hit-us100-after-strike-on-iran/",
            "pub_date": "2026-03-01 21:01:41",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong Stocks Close Higher As Hang Seng Climbs Nearly 1%",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Hong Kong’s equity market ended Feb 27 on a buoyant note, with the Hang Seng Index climbing 0.95% to 26,630.54 points, signalling a modest rebound in risk appetite after recent volatility.\n\n\n\n</p><p>Market strength was broad-based: The Hang Seng China Enterprises Index rose 0.51% and the Hang Seng Tech Index gained 0.56% as investors rotated back into key segments.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Heavy turnover in marquee names underlined the day’s action. Fosun International was among the most active stocks, finishing up around 3.8% on strong volume, while some smaller-cap plays saw heightened speculative interest.\n\n\n\n</p><p>Not all movers were positive as certain small-cap issues suffered sharp declines, but overall sentiment lifted after recent weakness and ahead of fresh catalysts in Hong Kong’s IPO pipeline.\n\n\n\n</p><p>The market’s uptick capped a volatile week, with readings pointing to consolidation around current levels as investors digest macro signals and await direction from upcoming economic data and policy developments.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/28/hong-kong-stocks-close-higher-as-hang-seng-climbs-nearly-1/",
            "pub_date": "2026-03-01 17:05:38",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore Stocks Finish Strong As STI Climbs 0.6%",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Singapore’s equity market wrapped up the trading week on a positive note on Feb 27, with the benchmark Straits Times Index (STI) rising 0.6% to 4,995.07, buoyed by broad-based gains amid mixed regional sentiment.\n\n\n\n</p><p>Market breadth was healthy, with 349 gainers outpacing 237 losers as two billion securities changed hands in a session that saw selective strength in heavyweight and mid-cap names.</p><div class=\"g g-1\"><div class=\"g-single a-70\"></div></div>\n<p>Key movers included Yangzijiang Shipbuilding, which led the blue-chip rally with a more than 10% jump, while Venture Corporation dragged on the index after sliding 7.5%.\n\n\n\n</p><p>Elsewhere on the Singapore Exchange, small-cap names saw notable activity: Aztech Global Ltd surged over 13% on heavy volume and Trek 2000 International Ltd climbed nearly 15%, underscoring pockets of speculative interest.\n\n\n\n</p><p>Despite the upbeat close, broader regional cues were mixed, with technology and cyclical stocks showing uneven performance in Asia amid lingering global uncertainties.\n\n\n\n</p><p>Singapore’s strong finish trimmed weekly losses and capped a volatile session as investors head into month-end.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/28/singapore-stocks-finish-strong-as-sti-climbs-0-6/",
            "pub_date": "2026-03-01 16:56:44",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin, Ethereum Rebound As Derivatives Expiry Tests Market Nerves",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Crypto markets found their footing on Feb 27, with Bitcoin and Ethereum staging a sharp rebound ahead of a major options expiry event.\n\n\n\n</p><p>Bitcoin climbed back toward the US$67,000-US$68,000 range, gaining roughly 4%-5% in 24 hours and briefly approaching the US$70,000 level. The move was fuelled by renewed ETF inflows and short-covering activity, signalling institutional buyers are stepping back into the market after recent volatility.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Ethereum outperformed on a percentage basis, rising more than 8% earlier in the week and reclaiming ground above US$2,000 before moderating. The rally in Ethereum and broader altcoins suggests risk appetite is returning, though conviction remains fragile.\n\n\n\n</p><p>The immediate catalyst: Billions of dollars in Bitcoin and Ethereum options contracts set to expire. Large derivatives settlements often compress price ranges or trigger sharp swings as traders rebalance positions. With “max pain” levels clustered below current spot prices, volatility risk remains elevated.\n\n\n\n</p><p>For now, the market narrative is one of cautious stabilisation. A sustained move above US$70,000 for Bitcoin or US$2,100 for Ethereum would signal renewed bullish momentum. Failure to hold recent gains, however, could reopen downside pressure.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/bitcoin-ethereum-rebound-as-derivatives-expiry-tests-market-nerves/",
            "pub_date": "2026-03-01 16:51:20",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin Slide Below US$64,000 After Iran Strike",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Bitcoin and other cryptocurrencies fell sharply after the US and Israel began striking targets across Iran on Saturday, causing ripples across high-risk assets.\n\n\n\n</p><p>Bitcoin dropped as much as 3.8% to $63,038, before stablising to trade around the $64,000 mark as of 6 a.m. in New York. Ether, the second-largest token, slid as much as 4.5% to $1,836. Roughly $128 billion in market value was erased across digital assets in the immediate aftermath of the news, according to data from CoinGecko.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>For Bitcoin, the weekend losses extend a months-long selloff in crypto markets, beginning with the liquidation of some $19 billion in leveraged positions in October. Bitcoin has fallen around 50% from its all-time peak of over $126,000 earlier that month, unable to latch on to rallies in gold and other safe-haven assets.\n\n\n\n</p><p><em>Bloomberg report</em>\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/28/bitcoin-slide-below-us64000-after-iran-strike/",
            "pub_date": "2026-03-01 16:45:38",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street Ends Lower As AI Valuation Worries Mount",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Wall Street closed in the red on Feb 27 as investors grappled with lofty technology valuations and lingering uncertainty over the broader impact of artificial intelligence (AI).\n\n\n\n</p><p><em>Reuters </em>reported that the benchmark S&amp;P 500 fell 0.43%, the Dow Jones Industrial Average dropped 1.05% and the Nasdaq Composite slid 0.92%, as semiconductor stocks retreated from recent highs.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Shares of Nvidia, the world’s most valuable company and a bellwether for the AI trade, fell 3.5%, extending losses from the prior session despite posting better-than-expected earnings. The Philadelphia Semiconductor Index declined 1.2%.\n\n\n\n</p><p>Globally, the MSCI All Country World Index slipped 0.25% on the day but still posted a weekly gain of 0.35%, while Europe’s STOXX 600 edged up 0.11%.\n\n\n\n</p><p>US Treasury yields fell as investors sought safety, with the 10-year yield down 6.3 basis points (bps) to 3.96%, and the two-year yield also falling 6.3bps to 3.385%. Germany’s 10-year Bund yield slipped 1bps to 2.644%.\n\n\n\n</p><p>In currency markets, sterling eased 0.07% to US$1.3447 after Britain’s Labour Party suffered an election setback in Greater Manchester. The dollar index was little changed, down 0.06% at 97.67, while the euro rose 0.14% to US$1.1813. The yen pared earlier gains to trade at 156.18 per dollar following softer Japanese inflation and factory output data.\n\n\n\n</p><p>Safe-haven demand lifted precious metals, with spot gold climbing 1.5% to US$5,263.59 an ounce and silver surging 6.1% to US$93.74.\n\n\n\n</p><p>Investors now turn their focus to further developments in AI-driven earnings momentum and geopolitical negotiations, both of which are likely to steer market sentiment in the weeks ahead.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/28/wall-street-ends-lower-as-ai-valuation-worries-mount/",
            "pub_date": "2026-03-01 16:36:42",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Despite 4Q Decline Syarikat Takaful Remains Favourable",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>MBSB Investment Bank Bhd (MBSB Research) and Hong Leong Investment Bank Bhd (HLIB) have maintained BUY calls on Syarikat Takaful Malaysia Keluarga Bhd (STMB), with revised target prices of RM3.95 and RM4.09 respectively, highlighting solid fundamentals, robust capital, and attractive dividend yields as key positives.\n\n\n\n</p><p>The research house noted that both family and general takaful segments delivered strong growth, while management’s outlook remains neutral yet constructive.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>STMB reported FY25 core net profit of RM386 million, up 2% year-on-year, largely driven by higher takaful revenue which offset increased claims and tax charges. \n\n\n\n</p><p>Fourth-quarter core profit fell 20% quarter-on-quarter to RM92 million, impacted by the absence of the previous quarter’s investment windfall. Despite the quarterly decline, results were broadly in line with market expectations, accounting for around 102% of consensus full-year forecasts.\n\n\n\n</p><p>Gross written premiums (GWP) for the general takaful segment exceeded expectations, rising 14% year-on-year and outperforming the industry growth of 12.4%, supported by strong fire and motor results. \n\n\n\n</p><p>The family takaful segment continues to benefit from a diversified bancassurance network, limiting exposure to any single loan product and allowing margins to remain stable. Management also flagged that retakaful repricing in FY25 was moderate, aided by a relatively benign claims environment.\n\n\n\n</p><p>Looking ahead, STMB expects continued momentum, underpinned by sustained bank-led distribution, improving general takaful performance, and stable underwriting margins. \n\n\n\n</p><p>Analysts highlighted that the group’s strong capital position and progressive dividend policy, targeting around 40% payout, provide flexibility for strategic initiatives, including retail expansion and digital investments. FY26 core net profit forecasts have been revised upwards to RM389 million by MBSB, with dividend yield projected at 5.4%, while HLIB projects RM390.2 million and a 5.5% yield.\n\n\n\n</p><p>As of 3.31 pm, the stock price decreased 2.12% to RM3.23.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/28/despite-4q-decline-syarikat-takaful-remains-favourable/",
            "pub_date": "2026-03-01 16:31:20",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "STI Opens Lower As Nasdaq Decline Weighs On Sentiment",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Singapore shares opened slightly lower on Thursday, mirroring weakness in US technology stocks following a sharp post-earnings sell-off in Nvidia.\n\n\n\n</p><p>As at 9.10 am, the Straits Times Index (STI) slipped 5.92 points, or 0.12%, to 4,958.46, with decliners outnumbering advancers 124 to 102. Market turnover reached 188.27 million shares valued at S$314.75 million.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Yangzijiang Shipbuilding emerged as an early standout, climbing 8.93% to S$4.27, while other actively traded blue chips included DBS at S$57.01, UOB at S$36.52, Singtel at S$4.99, ST Engineering at S$9.75, City Developments at S$9.69 and Seatrium at S$2.34.\n\n\n\n</p><p>In derivatives trading, total volume reached 31,150 contracts. Nikkei 225 Index Futures for March were quoted at 58,300, while MSCI Singapore Index Futures for March stood at 456.85. The USD/SGD March futures were at 1.2624.\n\n\n\n</p><p>The muted local opening reflects lingering caution after U.S. markets fell, with the Nasdaq Composite dropping 1.18% and the S&amp;P 500 down 0.54%, while the Dow inched up 0.03%. Technology shares led losses, weighed by a 5.5% decline in Nvidia despite better-than-expected results, as investors digested slower revenue growth and challenging year-on-year comparisons.\n\n\n\n</p><p>Analysts noted the “Nvidia hangover” was dragging major indexes, with volatility in AI-linked stocks contributing to uneven trading sentiment globally.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/sti-opens-lower-as-nasdaq-decline-weighs-on-sentiment/",
            "pub_date": "2026-03-01 16:25:37",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Weekly Recap: Kospi Soars Past 6,000 Before Profit-Taking Pullback",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>South Korean equities ended the week of Feb 23–27 on a mixed note, with the benchmark KOSPI hitting fresh record highs before retreating on late profit-taking.\n\n\n\n</p><p>The KOSPI surged at the start of the week, climbing past the 6,000-point milestone on Feb 23, fueled by strong demand for semiconductor and technology stocks and positive global growth sentiment. Momentum extended to Feb 26, when the index briefly topped 6,300, reflecting enthusiasm over robust earnings prospects and artificial intelligence-led demand.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Tech heavyweights and large-cap counters led the advance, with semiconductors particularly buoyed by sustained institutional and foreign buying. Investor optimism underpinned broad participation across growth-oriented sectors, propelling the index to historic levels.\n\n\n\n</p><p>However, gains moderated late in the week as profit-taking intensified. On Feb 27, the KOSPI retreated about 1% to close at 6,244.13, snapping a six-day winning streak. Heavy foreign selling weighed on sentiment, while domestic retail and institutional investors helped cushion the decline.\n\n\n\n</p><p>Despite the pullback, overall market sentiment remained constructive. The index continued to trade near record highs, supported by underlying strength in technology stocks and selective buying across major sectors, highlighting resilience in South Korea’s equity market following its historic rally.\n\n\n\n</p><p>The week underscored the KOSPI’s bullish trajectory, even as short-term consolidation emerged after its landmark breakout.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/03/01/weekly-recap-kospi-soars-past-6000-before-profit-taking-pullback/",
            "pub_date": "2026-03-01 16:25:37",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bursa Opens Lower Amid Global Tech Sell-Off",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Bursa Malaysia opened lower on Thursday, tracking a broad sell-off in US technology stocks following a sharp post-earnings decline in Nvidia, which weighed on investor sentiment globally.\n\n\n\n</p><p>As at 9.11 am, the benchmark FBMKLCI fell 8.37 points, or 0.48%, to 1,732.57. Other key indices were also lower, with the FBM70 down 36.76 points (-0.21%) to 17,661.49, F4GBM slipping 4.29 points (-0.42%) to 1,024.72, FBMEMAS losing 56.73 points (-0.44%) to 12,711.87, and FBMSHA retreating 36.96 points (-0.30%) to 12,274.75.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Among the most active stocks, Velesto Energy led trading with 99.14 million shares, last done at RM0.305, while MBSB traded 98.35 million shares at RM0.710, down RM0.05. AMBEST changed hands at RM0.285, down RM0.025 on volume of 91.05 million shares. \n\n\n\n</p><p>Top gainers included Greatec rising RM0.15 to RM2.12 and MHC advancing RM0.15 to RM1.78. Meanwhile, MPI fell RM0.42 to RM31.72 and BKAWAN lost RM0.32 to RM19.38.\n\n\n\n</p><p>Market watchers noted that the weaker opening was in line with Wall Street, where the Nasdaq Composite fell 1.18% and the S&amp;P 500 slipped 0.54% as Nvidia’s 5.5% drop and broader AI-related volatility dragged on tech counters. \n\n\n\n</p><p>The Dow Jones Industrial Average, however, edged up 0.03%, supported by gains in cyclical sectors.\n\n\n\n</p><p>Trading on Bursa showed mixed momentum, with decliners slightly outnumbering advancers, reflecting caution among investors amid persistent volatility in technology-linked markets.\n\n\n\n</p><p>\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/bursa-opens-lower-amid-global-tech-sell-off/",
            "pub_date": "2026-03-01 16:16:40",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Snapshot: Hang Seng Index Ends Higher After Choppy Week",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Trading on the Hong Kong Stock Exchange closed out a volatile week with the benchmark Hang Seng Index posting a modest overall gain, as early optimism gave way to bouts of profit-taking before a late rebound.\n\n\n\n</p><p>The week kicked off with strong upside momentum on Feb 23, with the index climbing more than 2% in early trade, supported by gains in technology and communications-related counters. Improved regional sentiment and renewed interest in growth sectors helped lift broader market confidence.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>However, as the sessions progressed, volatility resurfaced. Investors trimmed positions in select heavyweight names amid mixed global cues and macro uncertainties, tempering earlier advances. Profit-taking in large-cap stocks weighed intermittently on the index, while sector performance turned uneven.\n\n\n\n</p><p>By Feb 27, the Hang Seng regained traction, rising 0.95% to close at 26,630.54, supported by strength in China-linked enterprises and selective buying in tech shares. Market turnover remained active throughout the week, reflecting sustained participation despite shifting sentiment.\n\n\n\n</p><p>Although fluctuations marked the trading period, the index managed to end the week slightly higher overall, signaling a cautiously constructive undertone even as investors navigated external risks.\n\n\n\n</p><p>Analysts view the near-term outlook as balanced, with attention focused on developments from mainland China and broader global markets that could shape directional momentum in the sessions ahead.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/03/01/market-snapshot-hang-seng-index-ends-higher-after-choppy-week/",
            "pub_date": "2026-03-01 16:16:40",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTSE Bursa Malaysia KLCI Slides 1.39% As Profit-Taking Hits Blue Chips",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>FTSE Bursa Malaysia KLCI closed sharply lower on Feb 27, retreating 24.33 points or 1.39% to 1,716.61 as investors locked in gains following a recent rally.\n\n\n\n</p><p>Losses were broad-based across key indices. The FBM 70 fell 0.88% to 17,542.47, the FBM EMAS dropped 1.23% to 12,611.43, the FBM SHA declined 0.76% to 12,217.56, while the F4GBM slid 1.25% to 1,016.13.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Heavyweight banking counters led the retreat. Malayan Banking Bhd slipped four sen to RM11.96, Public Bank Bhd fell seven sen to RM4.93 and CIMB Group Holdings Bhd tumbled 42 sen to RM8.04.\n\n\n\n</p><p>However, selective buying emerged in defensive names. Tenaga Nasional Bhd rose 20 sen to RM14.38, while IHH Healthcare Bhd added 10 sen to RM9.12.\n\n\n\n</p><p>Trading interest remained robust, particularly among lower-priced and mid-cap stocks.\n\n\n\n</p><p>Electronics manufacturing services provider VS Industry Bhd was the most actively traded counter, easing two sen to 34.5 sen with over 125.9 million shares changing hands. Zetrix AI Bhd gained two sen to 82 sen on heavy volume, while property developer Tanco Holdings Bhd climbed six sen to RM1.59.\n\n\n\n</p><p>Construction-linked Malaysian Resources Corporation Bhd slipped half a sen to 31 sen.\n\n\n\n</p><p>The day’s pullback suggests investors are taking a breather after recent gains, with profit-taking concentrated in financial heavyweights even as selected defensives and speculative plays continued to see buying support.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/ftse-bursa-malaysia-klci-slides-1-39-as-profit-taking-hits-blue-chips/",
            "pub_date": "2026-03-01 16:11:37",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Weekly Review: STI Ends Mixed As Volatility And Global Cues Drive Trading",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>The benchmark Singapore Exchange closed the week of Feb 23–27 on an uneven note after a volatile stretch shaped by shifting global sentiment and earnings-driven movements.\n\n\n\n</p><p>The Straits Times Index (STI) began the week on firmer ground, tracking regional gains as improved risk appetite and currency stability lent early support to equities. Blue-chip counters provided initial momentum, keeping the index within sight of the 5,000 level.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>However, sentiment turned cautious mid-week as weakness in U.S. technology stocks and mixed global cues prompted investors to pare positions. The STI opened lower on Feb 27, with decliners outnumbering gainers as broader risk appetite softened.\n\n\n\n</p><p>Despite the mid-week pullback, the index staged a recovery toward the latter part of the week, rising 0.6% in one session to close at 4,995.07, supported by selective buying in heavyweight and mid-cap names. Market breadth improved, reflecting renewed interest in pockets of the market even as overall sentiment remained measured.\n\n\n\n</p><p>For the week as a whole, the STI finished marginally softer, hovering just below the key 5,000 threshold after fluctuating through a series of mixed sessions.\n\n\n\n</p><p>Analysts expect near-term consolidation as investors balance corporate earnings developments with external macroeconomic signals, while monitoring global market volatility for clearer directional cues.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/03/01/weekly-review-sti-ends-mixed-as-volatility-and-global-cues-drive-trading/",
            "pub_date": "2026-03-01 16:11:37",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nestle, PetGas Among Top Losers As Decliners Swamp Gainers",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Shares in Nestle (M) Bhd and Petronas Gas Bhd (PetGas) led the losers’ board as market breadth turned decisively negative, with 842 decliners overwhelming 376 gainers on Bursa Malaysia.\n\n\n\n</p><p>Nestle slipped 90 sen to RM109.90, topping the list of decliners, while PetGas fell 48 sen to RM17.96. Financial heavyweights also came under pressure, with Hong Leong Financial Group Bhd shedding 60 sen to RM21.30 and Hong Leong Bank Bhd down 56 sen to RM23.28. Plantation counter United Plantations Bhd eased 48 sen to RM29.52.</p><div class=\"g g-1\"><div class=\"g-single a-70\"></div></div>\n<p>On the upside, Fraser &amp; Neave Holdings Bhd emerged as the top gainer, climbing RM1.44 to RM34.94. UWC Bhd advanced 39 sen to RM4.50, while Hume Cement Industries Bhd rose 36 sen to RM3.88. Also among the gainers were Hong Leong Industries Bhd, up 34 sen to RM18.72, and Kelington Group Bhd, which added 26 sen to RM5.47 on robust trading volume.\n\n\n\n</p><p>Overall, 491 counters were unchanged, while 981 were untraded and 76 suspended, reflecting cautious sentiment across the broader market.\n\n\n\n</p><p>Despite the negative breadth, trading activity strengthened. Turnover rose to 3.53 billion units valued at RM5.53 billion compared to 2.98 billion units worth RM4.07 billion in the previous session, indicating active portfolio rebalancing.\n\n\n\n</p><p>The session’s divergence — selective buying amid broad-based selling — underscores lingering caution as investors trim positions in selected blue chips while rotating into pockets of resilience.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/nestle-petgas-among-top-losers-as-decliners-swamp-gainers/",
            "pub_date": "2026-03-01 16:06:21",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bursa Slips On Profit-Taking Pressure As Volatility Picks Up",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>Bursa Malaysia ended the trading week on a weaker footing after a volatile stretch marked by profit-taking and cautious sentiment, mirroring softer regional cues.\n\n\n\n</p><p>The benchmark FTSE Bursa Malaysia KLCI (FBM KLCI) began the week on a steadier note, supported by improved regional sentiment and currency stability. However, gains proved short-lived as investors moved to lock in profits following earlier advances in February.</p><div class=\"g g-1\"><div class=\"g-single a-70\"></div></div>\n<p>By mid-week, selling pressure became more evident, particularly in banking and selected heavyweight counters. On Feb 26, the FBM KLCI slipped 0.39% to close at 1,740.94, as decliners outpaced gainers across the broader market.\n\n\n\n</p><p>The downturn intensified toward the week’s close. On Feb 27, the benchmark fell 1.39% — its sharpest drop in recent weeks — dragged down by sustained profit-taking in blue-chip stocks. Market breadth remained negative, reflecting a cautious stance among both institutional and retail participants.\n\n\n\n</p><p>Trading activity was measured, with investors adopting a selective approach amid ongoing corporate earnings releases and mixed global economic signals. Broader indices also tracked lower, highlighting the market’s consolidative tone.\n\n\n\n</p><p>Market Outlook: Analysts expect the local bourse to trade within a defined range in the near term as investors digest earnings results and monitor external developments. While downside risks persist, bargain-hunting interest may emerge should valuations turn more compelling.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/03/01/bursa-slips-on-profit-taking-pressure-as-volatility-picks-up/",
            "pub_date": "2026-03-01 16:06:21",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Foreign Exchange Rates Feb 27, 2026",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>The closing foreign exchange rates, sourced from Bank Negara Malaysia and recorded at 5pm on Feb 27, 2026, provide a comprehensive overview of currency fluctuations for the day.\n\n\n\n</p><p>These rates, crucial for investors and businesses alike, reflect the relative strength or weakness of major global currencies against the Malaysian Ringgit. They serve as a vital indicator for assessing international trade competitiveness, investment opportunities and overall economic trends in the global market.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>The exchange rates are as shown below:\n\n\n\n<figure class=\"wp-block-table\"><table class=\"has-fixed-layout\"><tbody><tr><td colspan=\"2\" rowspan=\"2\"><strong>Foreign Currency Units</strong><br/><strong>[=1 Malaysian ringgit]</strong></td><td colspan=\"4\"><strong>Trading date: 27 Feb 2026 (Friday)</strong><br/><strong>Time: 1700 </strong></td></tr><tr><td colspan=\"2\"><strong>Buying</strong></td><td colspan=\"2\"><strong>Selling</strong></td></tr><tr><td>1 U.S. Dollar</td><td>USD</td><td>3.888</td><td>[0.2568]</td><td>3.894</td><td>[0.2572]</td></tr><tr><td>1 Australian Dollar</td><td>AUD</td><td>2.7675</td><td>[0.3605]</td><td>2.7737</td><td>[0.3613]</td></tr><tr><td>1 Brunei Dollar</td><td>BND</td><td>3.0725</td><td>[0.3248]</td><td>3.0787</td><td>[0.3255]</td></tr><tr><td>1 Canadian Dollar</td><td>CAD</td><td>2.8431</td><td>[0.3511]</td><td>2.8479</td><td>[0.3517]</td></tr><tr><td>100 Cambodian Riel</td><td>KHR</td><td>0.096</td><td>[1027.75]</td><td>0.0973</td><td>[1041.67]</td></tr><tr><td>1 Chinese Renminbi</td><td>CNY</td><td>0.5669</td><td>[1.7609]</td><td>0.5679</td><td>[1.7640]</td></tr><tr><td>1 EURO</td><td>EUR</td><td>4.5898</td><td>[0.2175]</td><td>4.5976</td><td>[0.2179]</td></tr><tr><td>100 Hong Kong Dollar</td><td>HKD</td><td>49.6856</td><td>[2.0095]</td><td>49.7629</td><td>[2.0127]</td></tr><tr><td>100 Indonesian Rupiah</td><td>IDR</td><td>0.0232</td><td>[4,310]</td><td>0.0232</td><td>[4,310]</td></tr><tr><td>100 Japanese Yen</td><td>JPY</td><td>2.4898</td><td>[40.0978]</td><td>2.4939</td><td>[40.1639]</td></tr><tr><td>100 Korean Won</td><td>KRW</td><td>0.2702</td><td>[369.55]</td><td>0.2706</td><td>[370.10]</td></tr><tr><td>100 Phillippine Peso</td><td>PHP</td><td>6.7388</td><td>[14.8060]</td><td>6.754</td><td>[14.8394]</td></tr><tr><td>100 Saudi Arabian Riyal</td><td>SAR</td><td>103.6662</td><td>[0.9631]</td><td>103.8317</td><td>[0.9646]</td></tr><tr><td>1 Singapore Dollar</td><td>SGD</td><td>3.0725</td><td>[0.3248]</td><td>3.0787</td><td>[0.3255]</td></tr><tr><td>1 Swiss Franc</td><td>CHF</td><td>5.0291</td><td>[0.1985]</td><td>5.0382</td><td>[0.1988]</td></tr><tr><td>100 Taiwanese New Dollar</td><td>TWD</td><td>12.411</td><td>[8.0424]</td><td>12.4341</td><td>[8.0574]</td></tr><tr><td>100 Thai Baht</td><td>THB</td><td>12.5024</td><td>[7.9784]</td><td>12.5338</td><td>[7.9985]</td></tr><tr><td>1 U.K. Pound</td><td>GBP</td><td>5.2453</td><td>[0.1903]</td><td>5.2553</td><td>[0.1906]</td></tr><tr><td>100 Vietnamese Dong</td><td>VND</td><td>0.0149</td><td>[6,711.41]</td><td>0.0149</td><td>[6,711.41]</td></tr><tr><td>1 IMF Special Drawing Right</td><td>SDR</td><td>–</td><td></td><td>–</td><td></td></tr><tr><td>1 New Zealand Dollar</td><td>NZD</td><td>2.3266</td><td>[0.4289]</td><td>2.3313</td><td>[0.4298]</td></tr><tr><td>100 Myanmar Kyat</td><td>MMK</td><td>0.1857</td><td>[537.6344]</td><td>0.186</td><td>[538.5030]</td></tr><tr><td>100 Indian Rupee</td><td>INR</td><td>4.2737</td><td>[23.3585]</td><td>4.2811</td><td>[23.3989]</td></tr><tr><td>100 United Arab Emirates Dirham UAE</td><td>AED</td><td>105.842</td><td>[0.9430]</td><td>106.0486</td><td>[0.9448]</td></tr><tr><td>100 Pakistan Rupee</td><td>PKR</td><td>1.3896</td><td>[71.7000]</td><td>1.3947</td><td>[71.9632]</td></tr><tr><td>100 Nepalese Rupee</td><td>NPR</td><td>2.6714</td><td>[37.3706]</td><td>2.6759</td><td>[37.4336]</td></tr><tr><td>1 Egyptian Pound</td><td>EGP</td><td>0.081</td><td>[12.3001]</td><td>0.0813</td><td>[12.3457]</td></tr></tbody></table></figure>\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/foreign-exchange-rates-feb-27-2026/",
            "pub_date": "2026-03-01 16:00:36",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korean Stocks Snap Rally As Kospi Closes Down 1%",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>South Korea’s stock market slid at the close on Feb 27, with the Korea Composite Stock Price Index (Kospi) dropping 1% to 6,244.13, ending a six-day winning streak as foreign investors stepped up profit-taking after strong recent gains.\n\n\n\n</p><p>Heavy net selling by overseas funds, around 6.8 trillion Korean won, drove much of the weakness, outweighing solid domestic buying from retail and institutional traders that helped cushion the market.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Technology and large-cap stocks led declines, with heavyweight semiconductor names under pressure following broad market profit-taking and softer cues from global peers.\n\n\n\n</p><p>Despite the pullback, the Kospi still posted strong weekly gains and remains elevated after clearing the 6,000 milestone earlier in the week as part of a broader February rally driven by export demand and artificial intelligence-linked tech optimism.\n\n\n\n</p><p>Trading volume was brisk, reflecting active repositioning by investors ahead of month-end, while the Korean won softened against the US dollar amid the sell-off.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/28/south-korean-stocks-snap-rally-as-kospi-closes-down-1/",
            "pub_date": "2026-03-01 16:00:36",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock Picks: AMMB And Orkim",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>RHB Investment Bank Bhd (RHB Research) has identified AMMB Holdings Bhd and Orkim Bhd as stocks displaying bullish technical momentum, following recent breakouts on strong trading volumes.\n\n\n\n</p><p>AMMB Holdings may see its upward trajectory extended after breaching the RM6.60 resistance level with high volume, validating a bullish continuation pattern. </p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>RHB Research said sustaining prices above this breakout point could pave the way towards the next resistance at RM6.90, followed by RM7.15. However, a decline below the RM6.35 support level would invalidate the bullish setup and signal a potential pullback.\n\n\n\n</p><p>Meanwhile, Orkim has extended its rally with a decisive breakout above its resistance level, supported by elevated trading activity. \n\n\n\n</p><p>The stock’s close above RM1.06 confirms that bullish momentum remains intact, positioning it to test the next resistance at RM1.12 and subsequently RM1.17, according to the research house. On the downside, a move below the RM1.01 support level would negate the positive outlook and could trigger a correction.\n\n\n\n</p><p>RHB Research’s technical view suggests both counters are trading within favourable momentum trends, although key support levels will need to hold to sustain the bullish bias.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/stock-picks-ammb-and-orkim/",
            "pub_date": "2026-03-01 15:51:46",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street Slides As Nvidia Fails To Spark AI Rally",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>US stocks fell sharply on Thursday as a post-earnings sell-off in Nvidia weighed heavily on technology counters, dragging the Nasdaq lower and putting pressure on the broader market.\n\n\n\n</p><p>The Nasdaq Composite dropped 273.69 points, or 1.18%, to 22,878.38, while the S&amp;P 500 shed 37.27 points, or 0.54%, to 6,908.86. </p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>In contrast, the Dow Jones Industrial Average edged up 17.05 points, or 0.03%, to 49,499.20, supported by strength in cyclical sectors.\n\n\n\n</p><p>Nvidia shares slid 5.5% despite posting fourth-quarter results that exceeded analysts’ expectations and issuing guidance above market estimates. Investors appeared unsettled by slowing revenue growth and increasingly challenging year-on-year comparisons. \n\n\n\n</p><p>The Philadelphia SE Semiconductor index dropped 3.2%, leaving it close to ending what would have been a record 11-week winning streak.\n\n\n\n</p><p>“It feels like an Nvidia hangover that’s specific to the AI space,” said Michael Green, chief strategist at Simplify Asset Management in Philadelphia. \n\n\n\n</p><p>He added, “The S&amp;P itself is being dragged down by Nvidia and the Magnificent 7, and the Nasdaq is really getting hammered.”\n\n\n\n</p><p>“It’s as simple as investors being levered long in Nvidia and short the AI disruption,” Green added. \n\n\n\n</p><p>He concluded, “And when that failed to materialize in a large enough scale, they sold out of their position, driving Nvidia down and pushing the stocks they were short back up.”\n\n\n\n</p><p>Among the S&amp;P 500’s 11 major sectors, technology and communication services posted the steepest losses, while financials rose 1.3%, lifted by gains in major banks. The software and services index climbed 1.4%, even as AI-linked volatility persisted.\n\n\n\n</p><p>Trading volume on US exchanges totalled 19.55 billion shares, below the 20-day average of 20.31 billion.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/27/wall-street-slides-as-nvidia-fails-to-spark-ai-rally/",
            "pub_date": "2026-03-01 15:51:46",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Decliners Dominate Bursa As Dutch Lady, Maybank And TM Lead Losses",
            "description": "<div class=\"tdb-block-inner td-fix-index\">\n<p>The stock market closed with broad-based weakness on Feb 26 as decliners outnumbered gainers 746 to 367, signalling cautious sentiment in the market.\n\n\n\n</p><p>Meanwhile, some 520 counters were unchanged, while 1,136 counters were untraded and 165 suspended.</p><div class=\"g g-1\"><div class=\"g-dyn a-70 c-1\"></div></div>\n<p>Leading the losses, Dutch Lady Milk Industries Bhd slid 88 sen to RM32.20, followed by Malayan Banking Bhd (Maybank), down 36 sen to RM12. Telecom giant Telekom Malaysia Bhd (TM) eased 29 sen to RM7.46, while Amway (M) Holdings Bhd and Hong Leong Bank Bhd fell 26 sen and 20 sen to RM5.11 and RM23.84 respectively.\n\n\n\n</p><p>On the upside, Sunway Construction Group Bhd led gainers, adding 35 sen to RM7.25, followed by Petronas Dagangan Bhd up 32 sen to RM22.28 and Nestlé (M) Berhad rising 30 sen to RM110.80.\n\n\n\n</p><p>The market reflected cautious trading as investors weighed corporate results and broader economic signals, keeping overall activity selective and focused on blue-chip movers.\n\n</p></div>",
            "link": "https://www.businesstoday.com.my/2026/02/26/decliners-dominate-bursa-as-dutch-lady-maybank-and-tm-lead-losses/",
            "pub_date": "2026-03-01 15:46:40",
            "source": "businesstoday",
            "kind": 1,
            "language": "en"
        }
    ]
}