{
    "data": [
        {
            "title": "Microsoft’s Japan chief stresses compliance with antitrust probe",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[TOKYO] Microsoft Corp is compliant with Japan’s antitrust watchdog and its inquiry, the chief of its local unit said, as the company fields an investigation over possible anti-competitive practices involving the Azure cloud services.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The country’s Fair Trade Commission is probing whether Microsoft restricted customers’ use of competing cloud services by preventing its software from running on platforms other than Azure, Bloomberg and other media reported earlier this week. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Japan is one of the most significant strategic markets for Microsoft and everything we do is operated with integrity,” Microsoft Japan President Miki Tsusaka said at a Bloomberg event in Tokyo on Thursday (Feb 26). “I hope that is reflected in the market in terms of day-to-day practices.” She declined to comment further on the details of the investigation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Japan, which is the second-largest economy in Asia after China and a US ally, is a key market to winning a global race for customers against the likes of Amazon.com’s AWS and Alphabet’s Google Cloud. In 2024, Microsoft said it would invest about US2.9 billion over two years to shore up its AI and cloud computing infrastructure in Japan.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The cloud services market is expected to expand rapidly alongside the development of generative artificial intelligence, which depends on vast networks of high-performance servers. While Japan has domestic data centre operators – and the government is seeking to nurture them as part of efforts to strengthen national cybersecurity – much of the local market, as in many other countries, is dominated by US providers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The investigation in Japan comes as the US antitrust watchdog ratchets up a probe into Microsoft’s licensing and other business practices to see whether the company illegally monopolises the enterprise computing market with its cloud software and AI offerings.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Research firm IDC expects Japan’s cloud market to reach US$121 billion in revenue by 2029, roughly double the total for 2024. The JFTC has signalled it wants to ensure the competitive landscape remains fair, particularly ahead of the anticipated surge in demand.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Japan has a lot to gain from AI adoption due to its ageing and shrinking population, but the “human side of change” remains a bottleneck in the country, Tsusaka said. “If we don’t change the way we work, we have the same meetings, we have the same PDFs and Power Points and whatnot.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Still, the executive said she’s “very pleased” with Japan’s pace of AI adoption, compared with past technological trends.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This time around, Japan is few points behind, but not that far,” she said. “I see growth, I see change, I see companies and individuals adopting.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/microsofts-japan-chief-stresses-compliance-antitrust-probe",
            "pub_date": "2026-02-26 21:25:30",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HSBC kicks off Singapore insurance business sale, eyes over US$1 billion value: sources",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[HONG KONG] HSBC has started the sale process for its Singapore life insurance product manufacturing business with the hiring of an adviser, and is hoping for the deal to be valued at more than US$1 billion, said three sources with knowledge of the matter.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The bank, which makes the bulk of its revenues and profits in Asia, has hired JPMorgan as its adviser, said two of the sources, who declined to be named. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HSBC has started engaging with potential buyers including Japanese insurers Nippon Life and Dai-ichi Life, and non-binding bids for the business could be expected in a month, said one of the sources.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HSBC, JPMorgan, and Dai-ichi Life declined to comment on the potential sale of the Singapore insurance manufacturing business. Nippon Life did not immediately respond to a Reuters request for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HSBC’s plan to divest its Singapore life insurance manufacturing business comes as the London-based bank pushes to simplify itself and exit areas that are not viewed as adding value.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Since assuming his position a year and a half ago, chief executive officer Georges Elhedery has shaken HSBC up by revamping divisions along East-West lines, shedding sub-scale investment banking units in the US and Europe and slashing the ranks of senior managers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In total, the bank initiated 11 exits from various businesses across the globe last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The bank is only seeking to sell the insurance manufacturing operations in Singapore, the sources said, not the entire insurance business, which means it will continue to distribute insurance products to investors in the market.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Bidder interest</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The valuation expectations of more than US$1 billion for HSBC’s Singapore insurance product manufacturing business could change depending on potential bidder interest, one of the sources said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the insurance manufacturing business, the bank creates products and then distributes them via its retail banking network, digital channels and private banking relationships. It has a separate business that sells policies of other insurers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2025, revenue from the bank’s insurance manufacturing operations reached US$2.3 billion, HSBC said in its annual results.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the bank’s 2025 earnings call on Wednesday (Feb 25), Elhedery said the Singapore insurance business was under strategic review but no decision had been made.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The reason we decided to put this business under strategic review is because we are not in the top five in the life business in Singapore, and therefore our ambition is always to be as a leader in what we do, or let others do it better than us and not be there,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HSBC’s insurance franchise, at which global revenue grew 36 per cent in 2025 to US$2.6 billion from a year earlier, is one of the fastest-expanding segments among the bank’s fee-based businesses as it seeks to increase wealth income. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/banking-finance/hsbc-kicks-singapore-insurance-business-sale-eyes-over-us1-billion-value-sources",
            "pub_date": "2026-02-26 21:10:32",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Korean barbecue goes big at DRIM Gold",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>NEW RESTAURANT</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>DRIM Gold Korean Steak House</strong>\n<strong>B1-204 Resorts World Sentosa</strong>\n<strong>8 Sentosa Gateway</strong>\n<strong>Singapore 098269</strong>\n<strong>Tel:  </strong><a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.google.com/search?q=drim+gold+sentosa&amp;sca_esv=ee81a51e8e25352b&amp;rlz=1C1GCFD_enSG1147SG1147&amp;sxsrf=ANbL-n7FSCYd4KC8ZVbIRUl0SXz7tJFnmw%3A1772028854349&amp;ei=tgOfacOFFdvgseMPsIiIUQ&amp;biw=1280&amp;bih=631&amp;ved=0ahUKEwjDuJTz6fSSAxVbcGwGHTAEIgoQ4dUDCBE&amp;uact=5&amp;oq=drim+gold+sentosa&amp;gs_lp=Egxnd3Mtd2l6LXNlcnAiEWRyaW0gZ29sZCBzZW50b3NhMgUQABiABDIHEAAYgAQYCjILEAAYgAQYhgMYigUyCxAAGIAEGIYDGIoFMgsQABiABBiGAxiKBTILEAAYgAQYhgMYigUyCBAAGIAEGKIEMggQABiiBBiJBTIIEAAYogQYiQUyCBAAGKIEGIkFSO8VUJECWN8TcAN4AZABAJgBaqABrQaqAQM5LjG4AQPIAQD4AQGYAg2gAtQGwgIKEAAYsAMY1gQYR8ICCRAAGIAEGAoYC8ICBhAAGBYYHsICAhAmwgIFEAAY7wWYAwCIBgGQBgiSBwQxMS4yoAf3PbIHAzguMrgHyQbCBwYwLjEyLjHIBxmACAA&amp;sclient=gws-wiz-serp\" target=\"_blank\"><strong>8806-0505</strong></a>\n<strong>Open daily: 11 am to 10 pm</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">THEY call it a cave. We can’t stop thinking, “that’s a lot of papier-mache”. White, craggy lumps proliferating across the walls of an otherwise stunning Korean hanok – not so much plastered, but almost breeding. Is it a design statement, or cautionary tale of mildew left unchecked for generations?</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But you have to give it to DRIM. Its newest – and biggest – opening at Resorts World Sentosa is made for impact, competing with the likes of Harry Potter and a United Nations of theme park-worthy food concepts. Having exhausted the “mid-Joseon emperor’s backyard” aesthetic at its debut space in Mandarin Gallery, it’s moved into “go big or go home” territory.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Wonky cave metaphor aside, DRIM Gold spares no expense in turning Korean barbecue into performance art. It’s high-stakes hospitality the moment you step in – the reception coolly sorts out your reservation mix-up (we booked Mandarin Gallery by mistake) while hostess Ashley swiftly walks you through the menu and table set-up. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, a drill sergeant dressed in civilian clothing paces up and down with an eagle eye and a walkie-talkie, keeping everyone on their toes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There’s a lot to take in once you’re seated, thanks to its sheer size. Beyond the amorphous columns of faux limestone are barbecue stations in every configuration – from solo diners to rowdy K-drama club gatherings. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Thick timber pillars and rafters give it that old-world feel, but the vibe is more efficient banquet dining than endearing “anhyeong” folksiness. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Think of DRIM Gold as its Orchard Road sibling in overdrive – with an expanded menu that includes the newly-trending Korean beef (hanwoo) and pork, at prices inspired by the precious metal. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hanwoo short rib is tagged at S$102 for 100 gm, for a minimum order of 200 gm. The cut of the day, striploin, costs slightly more, at S$110 per 100 gm. Feeling sadistic? Multiply that into kilogram pricing and marvel at the mark-up. If you buy the equivalent at retail price, it’s in the region of S$300 to S$350.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There are “budget” alternatives – USDA prime short rib at S$58 per 100 gm, or wagyu oyster blade at S$68. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pork is a bargain in comparison, with Jeju black pork averaging S$38 per 100 gm.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There are hanwoo set menus at S$248 a head (for a minimum of two diners), but you lose out on variety. It’s best to pay for only what you want. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That includes a crunchy water parsley pancake (S$34) – pretend you’re fulfilling your daily veggie quota even if it’s covered in a blanket of chewy-crisp fried batter. Dried shrimp takes this guilty pleasure up a notch.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Butter-grilled Jeju abalone (S$88) yields plump butter-grilled morsels with little tooth resistance, but not much character. The grated cheese on top is a pesky distraction. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The cold noodles (S$33) go down well – slippery, chewy, slicked with the vegetal perfume of perilla oil and tossed in a parade of condiments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Service here is virtually Gold standard. Every table has an assigned grill expert, and ours is Darren, tasked to cook, entertain and take care of us. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In between carefully draping slices of marinated hanwoo short rib and striploin over controlled flames, he narrates the matching benefits of Maldon salt, wasabi, spicy fish roe, pickled garlic leaves and other assorted banchan. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Salt is the most neutral, but feel free to wrap, dip and munch in any way you like. Raw garlic slightly charred on the grill is a must, even if you don’t plan to meet any vampires later.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The marinated short rib is mildly sweet and not cloying, so you still taste the fine texture of the meat. The striploin is a better cut – with a cleaner beefiness and steak-like texture. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Quality-wise, hanwoo isn’t as fatty as Japanese wagyu and more tender than Australian wagyu. But the variety available in Singapore tastes entry-level, compared to what you can get in Seoul. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Still, if you can stomach the price, it’s a good fallback between trips. Jeju pork, in contrast, is better value. It’s superior to local pork and fresher than iberico, if still better at source.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">DRIM is only as good as its ingredients are. Add accessibility and good service, and you get an all-round, fuss-free – if slightly over-the-top – experience. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It aims for gold, but it’s not quite there yet.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Rating: 6.5</strong></p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/food-drink/korean-barbecue-goes-big-drim-gold",
            "pub_date": "2026-02-26 21:00:31",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "World Economic Forum CEO Borge Brende quits after Epstein ties scrutinised",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[ZURICH] The president and CEO of the World Economic Forum (WEF), Borge Brende, said he was stepping down on Thursday (Feb 26), a few weeks after the forum launched an independent investigation into his relationship with sex offender Jeffrey Epstein.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Brende, who became president of the WEF in 2017, announced his decision in a statement following disclosures from the US Justice Department that showed the Norwegian had three business dinners with Epstein and had also communicated with the disgraced financier via email and text message.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“After careful consideration, I have decided to step down as President and CEO of the World Economic Forum. My time here, spanning 8½ years, has been profoundly rewarding,” Brende said. The statement made no mention of Epstein.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I am grateful for the incredible collaboration with my colleagues, partners, and constituents, and I believe now is the right moment for the Forum to continue its important work without distractions,” added Brende, a former Norwegian foreign minister.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Brende has said he was unaware of Epstein’s past and criminal activities before first meeting him in 2018, and that he regretted not having investigated him more thoroughly.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Brende’s decision to quit follows a series of revelations relating to Epstein, who in 2008 was convicted of soliciting prostitution from a minor. The revelations have roiled business and political elites, and even the British royal family.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Independent review</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In a separate statement, Andre Hoffmann and Larry Fink, co-chairs of the Geneva-based forum that organises the annual Davos summit, said the independent review conducted by outside counsel into Brende’s ties with Epstein had concluded.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The findings stated there were no additional concerns beyond what has been previously disclosed, it added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The co-chairs said the WEF’s Alois Zwinggi will serve as interim president and CEO, and that the forum’s Board of Trustees will oversee the leadership transition, including a plan to drive a process to identify a permanent successor.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The US Justice Department has released more than three million pages of documents relating to Epstein, who died by suicide in jail in 2019 while awaiting trial on federal sex-trafficking charges.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">His ties to a long list of business and political leaders, including US President Donald Trump, former President bill Clinton and Tesla CEO Elon Musk are under close scrutiny.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Overseas, the revelations have prompted criminal investigations of Britain’s Andrew Mountbatten-Windsor, the former Duke of York, and other prominent figures. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/world-economic-forum-ceo-borge-brende-quits-after-epstein-ties-scrutinised",
            "pub_date": "2026-02-26 20:35:30",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Economists expect global AI tailwinds to sustain through H1 2026, as Singapore’s factory output rises 16.6% in January",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Private-sector economists expect global artificial intelligence (AI)-related tailwinds to bolster the Republic’s manufacturing growth at least through the first half of 2026, following January’s 16.6 per cent year-on-year increase in factory output.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">January’s performance exceeded private-sector economists’ estimates. They had predicted a median 12.1 per cent expansion in a Bloomberg poll. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Excluding the volatile biomedical manufacturing cluster, industrial production surged 24.1 per cent year on year, compared with December’s revised 13.1 per cent increase.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Maybank economists Chua Hak Bin and Brian Lee expect manufacturing and export growth to remain “robust” for at least the first half of 2026, due to the sustained AI investment boom.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As they see it, President Donald Trump’s higher US tariff threats are unlikely to affect the AI boom and strong electronics demand. “The timeline for implementing his previously threatened 15 per cent tariffs is uncertain and may not materialise for all countries,” they said.<strong> </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">They reiterated Maybank’s 2026 gross domestic product growth forecast of 3.6 per cent, which stands at the upper end of the Ministry of Trade and Industry’s official forecast range of 2 to 4 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Similarly, UOB associate economist Jester Koh expects AI-related tailwinds to sustain through H1 2026 at least, underpinned by an estimated 30 per cent increase in capital expenditure by major technology firms.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">OCBC chief economist Selena Ling noted that January’s factory output figures marked the largest surge since November 2025, but said this was due to a low base effect stemming from the Chinese New Year (CNY) holidays taking place in January last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">She said February’s industrial production prints are likely to lean lower “towards 5 per cent” as a result of the CNY holidays falling in February this year. Still, she expects manufacturing momentum in Q1 2026 to stay resilient at 9.4 per cent year on year, while full-year manufacturing growth could come in at 3 per cent or even higher, depending on how long the AI boom lasts.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The latest prints come after Singapore’s manufacturing Purchasing Manager’s Index (PMI) rose to 50.5 last month – its highest reading in 10 months – arriving on the back of sustained demand for AI related products. The electronics sector registered its eighth consecutive month of expansion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A reading above 50 on the index indicates growth from the previous month.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Cluster performance</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">All clusters recorded growth in factory output in January, except general manufacturing and biomedical manufacturing.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The linchpin electronics sector rose 44 per cent for the month, more than doubling December’s 19.6 per cent increase. Growth was led by the segments of other electronic modules and components, as well as semiconductors, with the latter supported by strong AI-related demand.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Maybank’s Dr Chua and Lee pointed out that semiconductor exports remain exempt from US tariffs. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Many of Singapore’s trading partners are also facing lower tariff rates for the time being with the Supreme Court’s repeal of US President Donald Trump’s International Emergency Economic Powers Act (IEEPA)-based reciprocal tariffs, they noted.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Therefore, they think Asian exporters could step up frontloading to the US to capitalise on the temporarily lower tariff rates, in anticipation of fresh country-specific or product-specific tariffs. This would in turn benefit Singapore’s manufacturing sector and exports.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, DBS senior economist Chua Han Teng noted that electronics firms remain optimistic about the near-term outlook, as indicated in the recent PMI and EDB’s business expectations survey.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Of the clusters, transport engineering was the next best-performing, growing 25.2 per cent year on year. This was driven by the aerospace segment, which saw higher production of aircraft parts and sustained maintenance, repair and overhaul jobs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Next was precision engineering, with output jumping 13.2 per cent. The cluster recorded growth in the segments of precision modules and components, as well as machinery and systems.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The chemicals cluster edged up a marginal 2.3 per cent for the month. While the other chemicals and petroleum segments recorded gains, these were partially offset by declines in the petrochemicals segment – due to weak demand and plant shutdowns – and the specialties segment, such as industrial gases.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In contrast,<strong> </strong>biomedical manufacturing recorded the biggest decline at 33.1 per cent in January. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The pharmaceuticals segment contracted on lower production of biological products and active pharmaceutical ingredients, while the medical technology segment fell due to softer demand for medical devices. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">General manufacturing declined 2.6 per cent for the month, as gains in the miscellaneous industries and printing segments were offset by declines in the food, beverages and tobacco segment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On a seasonally adjusted monthly basis, factory output rose 5.3 per cent in January, in a turnaround from December’s 0.3 per cent decline. Excluding biomedical manufacturing, output rose 10.8 per cent on the month, reversing from the previous month’s 2.5 per cent decline. </p></div>",
            "link": "https://www.businesstimes.com.sg/singapore/economy-policy/economists-expect-global-ai-tailwinds-sustain-through-h1-2026-singapores-factory-output-rises-16-6",
            "pub_date": "2026-02-26 20:30:21",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cristiano Ronaldo buys a 25% stake in Spanish football club Almería",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LISBON] Cristiano Ronaldo, the world’s first billionaire football player, bought a 25 per cent stake in Spanish soccer club UD Almería, expanding his business interests in the sport.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The investment in UD Almería, currently ranked third in Spain’s second division, will be made through CR7 Sports Investments, a newly created unit of Ronaldo’s holding company CR7 SA, according to a statement on Thursday (Feb 26). The Spanish club is controlled by Saudi entrepreneur Mohamed Al Khereiji.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The CR7 Sports Investments statement did not provide details of what it was paying for the stake.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The move marks the latest investment by 41-year-old Ronaldo, whose ambitions reflect a broader trend of current and former athletes owning stakes in football clubs, seeking to leverage their global brands and expertise into long-term assets. The Al Nassr forward – who has a net worth of US$1.4 billion according to the Bloomberg billionaires Index – has publicly declared that he dreams of owning several clubs after retiring.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While Ronaldo has a range of businesses, including his CR7 brand, a hotel chain, gyms and a media group, they’re not major wealth drivers. His net worth is primarily derived from his pay, with the majority of his wealth coming from his career earnings, including his recent contract with Al-Nassr and previous deals with top European clubs. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/cristiano-ronaldo-buys-25-stake-spanish-football-club-almeri",
            "pub_date": "2026-02-26 20:21:13",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Yangzijiang Financial drops 14.5% to 2-year low on expected reversal into red",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->Yangzijiang Financial<!-- --> <!-- --> shares dropped to a two-year low on Thursday (Feb 26) amid heavy trading on news of the investment management company’s forecast<strong> </strong>loss for its second half and full year.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The share price decline<strong> </strong>come ahead of its H2 and FY2025 financial results, which are expected to be released on or around Friday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at 10.19 am, the counter hit an intraday low of S$0.29, retreating as much as 15.9 per cent or S$0.055 from its Wednesday closing price of S$0.345.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It eventually trimmed some of its losses to finish the day down 14.5 per cent or S$0.05 at S$0.295, its lowest price in more than two years, having last traded below this price in October 2023. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With close to 85.4 million shares transacted, it was one of the most heavily traded stocks on the Singapore Exchange by volume on Thursday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Wednesday, Yangzijiang Financial said it expected to post a loss for H2 and FY2025. This would mark a reversal into the red from its FY2024 net profit. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The projected declines were attributed to the recognition of substantial credit loss allowances, after a “comprehensive review” of the group’s debt investment portfolio. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Yangzijiang Financial said it conducted the reassessment to reflect updated credit risk profiles, given current market conditions in China’s real estate and credit markets. This led to higher provisions for non-performing loans and expected credit loss allowances.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/yangzijiang-financial-drops-14-5-2-year-low-expected-reversal-red",
            "pub_date": "2026-02-26 20:10:33",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Budget 2026: With fiscal marksmanship now harder to achieve, tax changes need stronger justification",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The government announces a GST hike; ends up with an unexpectedly large fiscal surplus; and draws criticism. This describes not just <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/economy-policy/ai-adoption-s15-1-billion-surplus-dominate-first-day-budget-debate\" target=\"_blank\">this year’s Budget debate</a>, nor just <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/wp-chief-pritam-singh-calls-help-business-rents-questions-gst-hike-start-budget-debate\" target=\"_blank\">last year’s similar arguments</a>, but an objection that goes back nearly two decades. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Criticism of the government’s fiscal projections has come up in recent Budget debates – but is far from new.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Budget 2007, it was announced that the goods and services tax would be hiked to 7 per cent in July, from 5 per cent before. A year later, revised figures showed a S$6.4 billion surplus for the 2007 fiscal year, in contrast to the originally projected S$700 million deficit.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/budget-2026-fiscal-marksmanship-now-harder-achieve-tax-changes-need-stronger-justification",
            "pub_date": "2026-02-26 20:10:32",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Soilbuild Construction H2 profit jumps 84.1% to S$35.3 million",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Mainboard-listed <!-- --> <!-- -->Soilbuild Construction<!-- --> <!-- --> on Thursday (Feb 26) posted an 84.1 per cent rise in net profit to S$35.3 million for its second half ended Dec 31, 2025, from S$19.2 million for the previous corresponding period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue rose 33.6 per cent year on year to S$317.9 million from S$237.9 million. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full year, net profit was up 139.4 per cent at S$63.6 million, while revenue rose 50.8 per cent to S$590.7 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Soilbuild Construction attributed the earnings surge mainly to sustained revenue growth in its construction operations, as well as in its precast and prefabrication operations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This was boosted by construction projects, including the PSA Supply Chain Hub @ Tuas and an industrial development in Tuas South Avenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For H2, earnings per share came in at S$0.2135, up from S$0.116 a year earlier.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A final dividend of S$0.025 a share was recommended for FY2025. This marked an increase from the total payout of S$0.02 a share for FY2024, which comprised a final dividend of S$0.01 a share and a special dividend of S$0.01 a share.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The latest dividends will be subject to approval by shareholders at Soilbuild Construction’s annual general meeting in April. The payment date has yet to be announced.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Soilbuild Construction closed 1.9 per cent or S$0.02 higher at S$1.06 on Thursday, before the results were announced.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/soilbuild-construction-h2-profit-jumps-84-1-s35-3-million",
            "pub_date": "2026-02-26 20:05:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singlife offers new indexed universal life plan amid growing HNW demand",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Customers of financial services company Singlife can now gain exposure to global market performance through indices such as the S&amp;P 500 Index without directly investing in equities – all within the structure of an insurance policy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group on Thursday (Feb 26) launched its Singlife Legacy Indexed Income plan, a whole-of-life, non-participating universal life (UL) plan which offers income linked to five selected indices: the S&amp;P 500 Index, S&amp;P 500 Engle 8% VT TCA Index, Nasdaq-100 Engle 8% Index, UBS Global Multi Asset Engle 8% Index and UBS Gold Engle 8% Index.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Customisable lifetime income</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Singlife said that the plan “offers growth potential alongside highly customisable income streams”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A built-in floor rate of 0 per cent per annum ensures no negative returns are credited, helping to mitigate the impact of market volatility on policy value.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Policyholders can also decide how much income to receive each year, when payouts begin and how long they last. They can receive income while continuing to accumulate wealth. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During each policy year in the payout period, income is distributed based on index performance up to the selected annual target. Any additional gains within the same year are automatically reinvested to support continued policy value growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From the 11th policy year onwards, a guaranteed loyalty bonus adds an extra 0.7 per cent per annum crediting rate to the index account.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For legacy planning, the plan allows the life assured to be changed up to five times, allowing the plan to be transferred across generations. It also offers guaranteed acceptance without requiring medical underwriting. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Other features of Singlife’s latest UL plan include lifelong protection against death and terminal illness, penalty-free partial withdrawals during key life events, and the option to spread premiums allocated to the index account over 12 months to manage the impact of market volatility.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Growing demand for UL plans</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The launch comes amid growing demand for UL plans, fuelled by rising wealth creation across Asia-Pacific. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">These policies have long been a mainstay of high-net-worth (HNW) insurance, which emphasises multigenerational wealth and legacy planning. Insurers have <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/wealth/wealth-investing/indexed-universal-life-plans-hit-sweet-spot-among-wealthy-and-mass-affluent-clients\" target=\"_blank\">reported</a> increasing take-up of indexed universal life (IUL) policies with larger sums assured.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2024, Singlife launched the Singlife Legacy Indexed Universal Life, marking its earlier foray into the indexed UL segment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Traditional UL plans, which have been in the market for decades, generate returns via a fixed crediting rate. However, interest in such structures has waned, giving way to IULs, which aim to offer a blend of capital stability and market-linked upside.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Typically, premiums are divided into two accounts: a fixed account earning a crediting rate of about 2 per cent per annum, and an index account where clients select their preferred market exposure.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, IULs are not just for the ultra-wealthy. While some insurers require a minimum sum assured of US$1 million to US$2 million, Singlife and Great Eastern set theirs at US$250,000.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Wong Lu Ping, head of savings and investments at Singlife, noted that its latest UL plan can complement guaranteed retirement income sources such as CPF Life payouts and endowment plans by providing an additional income stream linked to the performance of globally-recognised indices.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Rising life expectancy, escalating living costs and global uncertainties make it increasingly important for individuals to have multiple diverse income streams to support their retirement years,” she added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Singlife’s Legacy Indexed Income plan comes amid similar product launches in the market. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Last month, HSBC Life Singapore introduced HSBC Life Indexed Flexi Income, an IUL plan designed to provide lifetime income, wealth accumulation and protection across life stages.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The plan offers guaranteed lifetime increasing income options up to age 120 and also allows policyholders to determine when payouts begin, with flexibility to pause or resume distributions. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Similar to Singlife’s plan, HSBC Life Indexed Flexi Income supports legacy planning through succession features that allow transfers across up to five generations. Its index account also provides access to global benchmarks, including the S&amp;P 500 Index, Nasdaq-100 Index, S&amp;P Global Diversified Index and S&amp;P U.S. Tactical Multi-Asset Index.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The plan is said to build on HSBC Life Singapore’s ongoing efforts to “broaden its suite of integrated protection, accumulation, retirement and legacy planning solutions to meet increasingly complex wealth needs”, said the insurer. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/banking-finance/singlife-offers-new-indexed-universal-life-plan-amid-growing-hnw-demand",
            "pub_date": "2026-02-26 20:05:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}