{
    "data": [
        {
            "title": "How Budget 2026 should affect Singaporean wallets",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN Singapore Budget 2026 was unveiled on Feb 12, the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-highlights-ai-champions-foreign-worker-policy-tweaks-more-cdc-vouchers\" target=\"_blank\">headline numbers</a> caught attention. For individuals, in particular: Community Development Council (CDC) Vouchers, cost-of-living payouts and education credits. But beneath the surface lies a deeper message. One that does not show up on the balance sheet yet will determine the financial futures of millions of Singaporeans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This Budget arrives in a world where artificial intelligence (AI) is reshaping careers, living costs still matter and family-building gets expensive fast. More than a fiscal document, the Budget quietly, but powerfully, challenges each of us to upgrade our money mindset alongside the nation’s economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s why every young career starter, aspiring parent and middle-class professional should read the Budget with as much interest as the next smartphone launch.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/how-budget-2026-should-affect-singaporean-wallets",
            "pub_date": "2026-02-27 20:06:31",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "As Trump reins in China tech curbs, Beijing’s export controls come of age",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BEIJING] Almost a year after China expanded rare-Earth export controls ostensibly aimed at preventing their use by foreign militaries, exporters are still asking a basic question: when does a small magnet turn an everyday product into a controlled item?</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Makers of products ranging from pill boxes, printed billboards, motor components and optical glass are among the growing number of companies that have queried the commerce ministry over whether they require export licences.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Beijing is expanding export enforcement manpower and imposing compliance nationwide, even as it raises costs for domestic firms and makes it harder for them to ship goods.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A Reuters review of over 200 public export-control compliance enquiries to China’s commerce ministry between 2019 and the start of this month showed a stark surge after rare-Earth controls were tightened last April.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the meantime, Washington has eased some export restrictions on products like advanced artificial-intelligence chips during President Donald Trump’s second term, after China’s curbs on rare earths exports threatened to hobble global supply chains spanning autos, technology, energy, aerospace, and defence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The export controls on both sides are expected to be in sharp focus as Trump and Chinese President Xi Jinping meet in Beijing in late March for their second in-person talks since Trump returned to office, setting up a high-stakes test of whether a fragile trade truce between the world’s two largest economies can hold.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“What we are seeing in China is ... the rapid construction of a comprehensive export-control apparatus designed to weaponize chokepoints across strategic and non-strategic sectors,” said Alfredo Montufar-Helu, a Beijing-based managing director at Ankura Consulting. “That the US is reining in some of its controls is a direct acknowledgement of China’s growing leverage.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China’s commerce ministry did not respond to a request for comment.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Export compliance queries jump</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Exporters have flooded the Chinese commerce ministry’s website with urgent compliance questions: whether magnetic sheets cross rare-Earth thresholds; whether gallium nitride chips are restricted; whether ultraviolet medical equipment counts as controlled technology.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From 2019 through 2024, only 43 export-control compliance enquiries were posted publicly. In 2025 alone, the number jumped to 135, with about 16 per cent of them complaints about issues such as shipment delays and increased regulatory burdens. The rate of complaints nearly doubled in early 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The actual number of queries from exporters is likely to be orders of magnitude larger as there are several private channels these companies can use, including contacting provincial and municipal commerce bureaux, many of which do not have public query platforms like the central government’s commerce ministry.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The official responses to the queries from Chinese exporters have been vague and formulaic, stopping short of confirming whether any individual product, from rare-Earth magnets to medical materials, required a licence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The enforcement push is also legal and bureaucratic. Since China enacted its Export Control Law in October 2020, it has introduced or expanded export control measures 29 times, compared to just six times between 2015-2020.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Recruitment documents show 45 commerce ministry posts available in this year’s national civil-service examination could be assigned to export-control-related work, compared with 11 such vacancies in both 2022 and 2023.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dozens of provincial and municipal governments have organised compliance seminars and policy briefings over the past year, while Beijing has convened national export-control work conferences bringing officials from across the country to the capital.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Beijing’s October 2025 revision to its rare-Earth export-control regime reflected lessons from the US Foreign Direct Product Rule, which allows Washington to assert jurisdiction over certain foreign-made goods produced with American technology.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“China’s use of rare earths as leverage is completely learned from the West – especially the US,” said Li Xing, professor at the Guangdong Institute for International Strategies, a think tank in Guangzhou.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China dominates the processing of rare earths, the conversion of ore into refined oxides and metals used in electric vehicles, wind turbines and defence systems, a chokepoint deeper in the supply chain than mining itself.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its new licensing system reaches into processing and downstream incorporation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is not just a supply chain shortage. This is economic warfare,” said Nick Myers, chief executive of US rare-Earth startup Phoenix Tailings.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Pace of US export controls slows</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During Trump’s first term and under President Joe Biden, the US rapidly expanded export controls targeting China.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Annual China-related additions to the Entity List, which requires US exporters to obtain licences, often reviewed under a presumption of denial, surged from 47 in 2018 to 227 in 2020, reaching a record 257 in 2024, according to a Reuters analysis.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Since Trump’s return to office, that trajectory has reversed. China-related Entity List additions fell to 131 in 2025, roughly half the previous year’s pace.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this month, the Pentagon briefly published, then withdrew, an updated Military End User list that would have added Chinese tech giants Alibaba and Baidu while removing a couple of memory chipmakers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The White House and the US Commerce Department’s Bureau of Industry and Security did not respond to requests for comment. A Pentagon official said the list was removed as it may require changes based on new information and that an updated list would be published, without further elaborating.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The moderation has drawn criticism from bipartisan US lawmakers, who have faulted the administration for approving certain Nvidia AI chip exports and cutting BIS funding.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A Nvidia spokesperson said in a statement that criticism of the current administration’s decision to greenlight these semiconductor shipments to China was unintentionally promoting the interests of foreign competitors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“America should always want its industry to compete for vetted and approved commercial businesses, and thereby protecting national security, creating American jobs, and keeping America’s lead in AI,” the spokesperson said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia CEO Jensen Huang, who criticised Biden-era controls, said last year that “export control was a failure” and that Trump “realises it’s exactly the wrong goal.” REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/trump-reins-china-tech-curbs-beijings-export-controls-come-age",
            "pub_date": "2026-02-27 20:01:07",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Issue 184: OCBC hit by coal complaint; Parkway Life Reit secures green, social debt",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Sustainable finance</strong></p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">OCBC under pressure for coal-financing disclosures</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/esg/green-group-files-sgx-complaint-against-ocbc-alleging-disclosure-gaps-carbon-intensive-assets\" target=\"_blank\">OCBC</a> is the target in a complaint lodged with Singapore Exchange alleging inadequate disclosure by the Singapore lender on its exposure to coal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The complaint is the latest salvo by environmental group Market Forces, which had <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/esg/singapore-banks-flagged-financing-haritas-coal-powered-nickel-smelters-ocbc-tops-list-financiers\" target=\"_blank\">previously</a> identified OCBC and its Singapore peers UOB and DBS as financiers for Indonesian miner Harita Nickel, whose facilities rely largely on coal for energy.</p></div>",
            "link": "https://www.businesstimes.com.sg/newsletters/esg-insights/issue-184-ocbc-hit-coal-complaint-parkway-life-reit-secures-green-social-debt",
            "pub_date": "2026-02-27 20:01:07",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banyan Group H2 profit falls 7% despite 35% jump in revenue",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Resort operator Banyan Group reported a 7 per cent decline in net profit to S$33.5 million for the second half ended Dec 31, 2025, from S$35.9 million in the corresponding period a year ago.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This came despite revenue for the half-year surging 35 per cent to S$271.3 million, up from S$200.9 million previously. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for the half-year stood at S$0.0386, down from S$0.0414 in the year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The drop in the bottom line was largely due to higher depreciation and amortisation expenses, increased net finance costs and the absence of a S$23.3 million Covid-19 insurance compensation that boosted the previous year’s earnings.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The residences segment was the primary driver of top-line growth, with H2 revenue more than doubling year on year to S$139.6 million. This growth was underpinned by the completion and progressive handover of condominiums and higher unit recognition of 182 units, compared with 118 units in H2 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Conversely, H2 revenue from the hotel investments segment fell 4 per cent to S$90.9 million. Occupancy in Thailand decreased by 5 percentage points, and revenue per available room (RevPAR) fell 10 per cent in H2, weighed down by lower international arrivals and domestic and regional political uncertainties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue from the fee-based segment also dipped 7 per cent to S$40.8 million, primarily due to a lack of fee recognition from Korean branded residences projects.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full year ended Dec 31, 2025, Banyan Group’s net profit edged up 1 per cent to S$42.5 million from S$42.1 million in FY2024. Total revenue for FY2025 rose 25 per cent to S$477.4 million, driven by a record year in the residences segment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Full-year residences revenue surged 90 per cent to S$197.6 million. The hotel investments segment recorded a marginal full-year revenue growth of 1 per cent to S$198.8 million, while the fee-based segment saw a 2 per cent revenue increase to S$80.9 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for the full year was S$0.049, up from S$0.0485 the previous year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group proposed a first and final one-tier tax-exempt cash dividend of S$0.0135 per ordinary share for FY2025, up from S$0.0130, subject to shareholder approval.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Looking ahead, Banyan Group noted it has S$604.4 million in unrecognised revenue from its residences segment, with over 30 per cent expected to be recognised in 2026. The group also highlighted the milestone opening of its 100th resort, the Mandai Rainforest Resort by Banyan Tree in Singapore in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Banyan Tree rose 1.6 per cent to close S$0.01 higher at S$0.655 on Friday, before the results.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/banyan-group-h2-profit-falls-7-despite-35-jump-revenue",
            "pub_date": "2026-02-27 19:55:40",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Fok’s H2 FY2025 net profit rises 14.1% to S$23.1 million; proposes dividend of S$0.01",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Hong Fok’s earnings for H2 FY2025 rose 14.7 per cent to S$23.1 million, from S$20.1 million in the year-ago period. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 FY2025 fell 13.9 per cent to S$51.4 million, from S$59.7 million in H2 FY2024, based on the financial results filed on Friday (Feb 27) by the property player.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for H2 FY2025, consequently, rose to S$0.0360 from S$0.0313.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A first and final dividend of S$0.01 per share was proposed, and the quantum is unchanged from FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, revenue decreased by 6 per cent to S$98.3 million from S$104.3 million in FY2024. This was mainly due to lower revenue from the sale of residential units in Concourse Skyline, which was partially offset by higher rental income from investment properties. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The revaluation gain was S$16.2 million for FY2025, 36.8 per cent higher than the S$11.8 million in FY2024 for its investment properties,</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings for FY2025 rose 20 per cent to S$28.5 million from S$23.7 million in FY2024</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During the year, the company completed the acquisition of five units in International Building for S$27.8 million. This acquisition resulted in the group owning all the units in the building.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Net asset value per share stood at S$3.65 as at end-FY2025, up from S$3.61 as at end-FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company said that rental income for investment properties in 2026 is likely to remain stable, while the Singapore office market is expected to remain resilient despite macroeconomic and political uncertainties. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hong Fok will work towards higher-quality revenue through market segmentation discipline for its hotel, Yotel Singapore Orchard Road. It aims to protect margins through cost control, enhanced workforce stability, asset quality and guest experience. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It expects to continue recognising revenue from the sale of residential units in Concourse Skyline.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Hong Fok closed unchanged at S$0.83 on Friday before the results were posted.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/hong-foks-h2-fy2025-net-profit-rises-14-1-s23-1-million-proposes-dividend-s0-01",
            "pub_date": "2026-02-27 19:55:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL H2 net profit up over four times at S$538.5 million on improved showings across all segments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->City Developments Ltd’s (CDL)<!-- --> <!-- --> second-half earnings rose more than four times to S$538.5 million, from S$113.5 million in the previous corresponding period.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This more than trebled the group’s full-year earnings to S$629.7 million in the 2025 financial year, from S$201.3 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The improvements were primarily driven by robust residential sales in Singapore and strong capital recycling gains, notably, from the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/cdl-selling-its-50-1-south-beach-stake-its-malaysian-partner-ioi-s834-million-yielding-s465-million\" target=\"_blank\">sale of a 50.1 per cent stake in the South Beach mixed-use development</a> in H2 to Malaysian partner IOI Properties Group, said CDL on Friday (Feb 27). The S$834 million transaction yielded a S$465 million gain.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sherman Kwek, CDL’s group chief executive officer, said that strong residential sales in Singapore and accelerated capital recycling drove a “significant uplift” to the group’s earnings, despite the company facing a “challenging environment with ongoing economic uncertainties” in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” Kwek said. “We have taken decisive steps to unlock value from mature and non-core assets, while selectively redeploying capital to drive growth.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In early 2025, Kwek was embroiled in a public feud with his father and CDL executive chairman Kwek Leng Beng, but the matter was settled subsequently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For H2, CDL posted an earnings per share (EPS) of S$0.598, versus S$0.121 in the year-ago period. EPS for the full year rose to S$0.694, from S$0.213 in the previous financial year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 stood at S$1.9 billion, up 11.1 per cent on the year from S$1.7 billion. Full-year revenue grew 9.7 per cent to S$3.6 billion from S$3.3 billion.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Better results across all segments</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said that all its business segments reported improvements for H2 and FY2025, with the property development segment being the biggest contributor to revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, that segment’s revenue rose 24.1 per cent on the year to S$1.2 billion, supported by higher contributions from Singapore projects such as The Myst, Norwood Grand and Union Square Residences. The sales of the Ransome’s Wharf site in London and the office component of Suzhou Hong Leong City Center in China also boosted revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, the hotel operations segment saw a 1.7 per cent increase in revenue and improvements in revenue per available room, said CDL. This was supported by new additions including The Mayfair Hotel Christchurch, acquired in January 2025, and the Hilton Paris Opera, acquired in May 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the increase in gross profits for H2 and FY2025 was marginal, despite its revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its overall gross profit margin fell to 41 per cent for H2 and FY2025, from 45 per cent for both periods in 2024, as it was impacted by an S$80.5 million allowance for foreseeable losses that was made in relation to China development properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, CDL maintained strong cash reserves of S$2.1 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board proposed a final dividend of S$0.25 per share, payable on May 19, after the record date on May 4. Together with the special interim dividend of S$0.03 per share paid in September 2025, the total ordinary dividend for FY2025 amounts to S$0.28 per share, representing a 40 per cent dividend payout ratio. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of CDL ended 4.9 per cent or S$0.46 higher at S$9.82 on Friday.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/cdl-h2-net-profit-over-four-times-s538-5-million-improved-showings-across-all-segments",
            "pub_date": "2026-02-27 19:40:46",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "This Singapore deep-tech startup believes its paper batteries are an important part of the global clean energy transition",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Sustainable alternatives are often more expensive or come with compromises in terms of functionality, but one Singapore company is trying to buck the trend with a unique product – paper batteries. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Deep-tech startup Flint produces batteries made of cellulose – the key ingredient in paper production, hence their name – that are priced competitively with their lithium-based counterparts. Their performance is also comparable.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">These paper batteries can be used in devices such as keyboards, computer mice and wearables. The carbon footprint for manufacturing each one is around 30 per cent smaller than that for a conventional battery.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Paper batteries are also safer as they are fire-resistant; conventional batteries are made from flammable and reactive materials. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As Flint’s batteries are composed of cellulose, manganese and zinc, their production does not depend on the supply chains for the scarce resources used to manufacture conventional batteries, such as lithium and cobalt. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This allows the process to be decentralised from places where batteries are typically produced – an especially critical feature when the global battery supply chain has turned into a flashpoint for trade tensions. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Therefore, even a small country lacking natural resources such as Singapore can manufacture paper batteries, said Flint co-founder Carlo Charles. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With companies looking to move their supply chains out of China, he noted that geopolitical developments have boosted demand for Flint’s products. A large proportion of its clients, from sectors such as tech and electronics, hail from Europe and North America.  </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Supporting the clean energy transition</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In January, Flint was among more than 30 Singapore companies that showcased their products at the Consumer Electronics Show in Las Vegas – a milestone for the startup. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Flint began in 2019 as a passion project, driven by Charles’ desire to create a more sustainable alternative to conventional batteries, which are key components in the world’s transition to green energy. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“One of the most important aspects for climate change is clean energy, and to… transition (the world) to green energy, you really need to use a lot of batteries,” he said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“(The fact that) the batteries that we’re using today are not green themselves is such an irony.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Flint was incorporated in 2021 and today counts household names such as Amazon and Logitech among its clients. It is run by a 10-strong team and operates from an 8,000-square-foot space at 8 CleanTech Loop. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company takes on projects to build batteries for specific applications based on customers’ requests, including energy storage systems, toys and consumer electronics such as mobile phones, tablets and laptops, Charles said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Within the next five years, Flint intends to scale its production and get its batteries into every device that requires them, the co-founder added, noting that it hopes to develop batteries for electric vehicles (EVs). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“EVs are like the holy grail that we want... but we are not focusing on that yet.” He said that EV battery production requires gigafactories that need considerable amounts of money, resources and capital to be built. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For now, manufacturing constraints present a barrier to scalability. “The harsh truth of building a hard-tech company (is that) it really boils down to production.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Flint makes batteries at its office and lab in Singapore, where around five million units can be produced each year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Charles said that the startup is looking to build a facility in Europe that will expand its production to around 300 million batteries a year. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Profitability on the horizon </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With Flint expected to reach profitability this year, the goal is for the company to sustain its own growth, he said, although he is not closed off to funding. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He noted that Flint has completed its seed and pre-Series A rounds of fundraising, and now has sufficient funds to scale. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I guess the key reason is we don’t want to dilute ourselves too much. As a founder, I want to focus on what matters, (which is) the products and the innovation.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Going public is not off the table either, but the company has no plans for an initial public offering anytime soon, he added. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Plans beyond batteries  </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the longer term, his vision is for Flint to venture beyond batteries and tackle other environmental issues. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“In the next 10 years, our goal is to really focus on other problems that the world has, and to try to solve those... The main reason I started (this) was to combat climate change with technology, and batteries are really just the first step.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He said the areas the company could explore next are carbon capture and storage technology, or problems such as plastic pollution and ocean acidification. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“There’s a lot of things that we can focus on, but I guess I’m trying my best to not get diverted and lose focus. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I have a lot of ideas that I’m just keeping in my journal, but at the end of the day, I’m 100 per cent focused on Flint’s strategy for batteries today.” </p></div>",
            "link": "https://www.businesstimes.com.sg/singapore/singapore-deep-tech-startup-believes-its-paper-batteries-are-important-part-global-clean-energy",
            "pub_date": "2026-02-27 19:25:49",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UMS Q4 FY2025 earnings flat at S$11.1 million; declares dividend of S$0.02",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] UMS Integration reported a flat earnings of S$11.1 million for the fourth quarter ended Dec 31, 2025, as higher tax expenses offset improved gross material margins and lower personnel costs. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for the quarter eased 1 per cent to S$66.8 million, the company said in its financial results released on Friday (Feb 27). UMS Integration provides equipment manufacturing and engineering services to semiconductor original equipment manufacturers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for Q4 FY2025 were also flat, at S$0.0156.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A final dividend of S$0.02 per share for FY2025 was proposed, unchanged from the S$0.02 final dividend paid for FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Specifically, semiconductor segment sales were 1 per cent lower at S$56.8 million, due mainly to lower component sales.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sales in other segments, which includes the manufacture of water disinfection systems and metal distribution, surged 45 per cent. This was mainly due to revenue recognition of several completed projects under the group’s water treatment subsidiary, Kalf Engineering.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Geographically, all the group’s key markets, except Singapore and the US, posted higher revenue compared with the same period in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue from Taiwan soared 44 per cent due to the commencement of component sales to a new key customer’s location there, while revenue from Malaysia edged up 2 per cent to slightly above S$8 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sales in Singapore fell 2 per cent to S$42.4 million mainly due to lower overall semiconductor sales, while those in the US slumped 42 per cent to S$5.2 million on lower semiconductor and aerospace component sales.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, earnings rose 2 per cent to S$41.6 million from S$40.6 million in FY2024. Revenue for FY2025 grew 4 per cent to S$251.1 million from S$242.1 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for the full year stood at S$0.0585, up from S$0.0574 in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group also announced it has successfully renewed its Integrated System contract with an existing key customer for another three years as semiconductor demand accelerates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted it has invested more than S$155 million in the last four years to expand manufacturing capabilities to prepare for an “expected production ramp-up.” Its new facilities are now operational and equipped with capabilities to capture new market opportunities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group is currently working on many new product introductions from its new key customer to expand its product offerings in line with upbeat forecasts in the coming months.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Andy Luong, chief executive of UMS, said: “Both our key global customers have forecast robust demand growth for 2026 and 2027. With the acceleration of AI (artificial intelligence) applications, they are ramping execution velocity to drive multi-year outperformance targets.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of UMS closed up 5.1 per cent or S$0.07 to S$1.45 on Friday.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/ums-q4-fy2025-earnings-flat-s11-1-million-declares-dividend-s0-02",
            "pub_date": "2026-02-27 19:25:48",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sats Q3 profit rises 20.4% to S$84.7 million on record cargo volumes",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] In-flight caterer and ground handler Sats on Friday (Feb 27) reported a net profit of S$84.7 million for its third quarter ended Dec 31, 2025, representing a 20.4 per cent increase from the S$70.4 million booked for the previous corresponding period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The stronger performance came on the back of improved cargo volume growth across Asia, Europe and the Middle East, said the group. It added that its global network “continued to capture trade-flow shifts” driven by geopolitical developments and tariff policies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue rose 8 per cent to S$1.6 billion in Q3 FY2026, from S$1.5 billion a year earlier. The top-line growth was driven primarily by the group’s gateway services segment, in which cargo volumes rose 7.3 per cent year on year to a record-high 2.5 million tonnes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share came in at S$0.057, up from S$0.047 a year earlier.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the nine months ended Dec 31, 2025, Sats booked a 14.4 per cent increase in net profit to S$234.5 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nine-month revenue rose 8.7 per cent year on year to S$4.72 billion. This was supported by broad-based growth, including an 8.2 per cent increase in cargo tonnage, a 0.8 per cent rise in flights handled and a 3.6 per cent bump in aviation meals served.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sats president and chief executive officer Kerry Mok noted that the group’s latest showing was “driven by seasonal peak demand” and marked a “ninth consecutive quarter outperforming industry benchmarks”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For Q4, Sats expects passenger and cargo demand to moderate, though “overall cargo trends remain resilient”. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group also expects “continued volume growth across our network, driven by market share gains and new client wins”. This, it noted, comes despite the International Air Transport Association’s “modest” 2026 global growth forecast of 2.4 to 2.6 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sats added that its financial focus remains anchored in “operational excellence”, “strategic capital deployment”, “prudent cost discipline amid global trade uncertainties” and continued debt reduction.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Sats rose 1.3 per cent or S$0.05 to close at S$3.92 on Friday, before the results were announced.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/sats-q3-profit-rises-20-4-s84-7-million-record-cargo-volumes",
            "pub_date": "2026-02-27 19:20:43",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL undertakes review to relook strategy, optimise portfolio and capital recycling",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] City Developments Ltd (CDL) is taking a hard look at its global portfolio and capital allocation priorities under a sweeping strategic review, with plans to step up capital recycling and monetise assets. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” said group chief executive Sherman Kwek, at CDL’s earnings briefing on Friday (Feb 27). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We have taken decisive steps to unlock value from mature and non-core assets while selectively redeploying capital to drive growth.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The property giant engaged a global advisory firm around September last year to conduct a review of its strategy and operations. CDL expects to announce the outcome of the review by June this year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Key areas include rightsizing its portfolio and reviewing capital allocation priorities across geographies and asset classes, said Kwek, noting that formal targets will be provided once the review is completed. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Among assets under scrutiny is CDL’s UK development legacy portfolio, which comprises five properties with a total carrying value of about S$800 million as at end-December 2025, after two assets were sold over the last two years. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">UK development platform </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Acknowledging that the UK assets have “underperformed”, Kwek said the group is looking to “recycle this capital as quickly as possible” and hopes to do so by the end of the year. CDL entered into the UK before Kwek assumed the CEO role, and had to engage an external manager then as it had no presence in the UK. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Currently, CDL’s five properties in the platform are a carpark at 28 Pavilion Road, Knightsbridge, acquired in 2013; Stag Brewery at Mortlake, bought in 2015; office building Development House acquired in 2016; residential project Teddington Riverside bought in 2015; and the six-unit Chesham Street in Belgravia. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at end-December 2025, 148 of the 224 units in Teddington Riverside remain unsold, and three of the six units at Chesham Street remain unsold. CDL is exploring options including bulk sales for Teddington Riverside, said Kwek. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For its China commercial properties, Kwek said the market remains challenging and the group will take a pragmatic approach, assessing each asset individually and even accepting “some haircuts on it”, where necessary, to unlock capital. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We have to continue to drive forward with our capital recycling – it is not a one-off exercise. Capital recycling is very much a part of our business as property developer and asset manager.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2025, CDL secured around S$2 billion in contracted divestments globally, outpacing around S$1.7 billion of acquisitions, which included three Singapore government land sales sites for about S$1.2 billion, and the Holiday Inn London - Kensington High Street hotel for 280 million pounds (about S$480.2 million). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The contracted divestments included the sale of Quayside Isle @ Sentosa Cove for S$97.3 million, which was completed in February 2026. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL on Friday posted a net profit of S$538.5 million for the second-half ended Dec 31, 2025, rising more four times from S$113.5 million in the year-ago period. This more than trebled the group’s full-year earnings to S$629.7 million, from S$201.3 million in FY2024. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Robust growth</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bottom line growth was primarily driven by robust Singapore home sales and strong capital recycling gains, notably from the sale of a 50.1 per cent stake in the South Beach mixed-use development to Malaysian partner IOI Properties Group for S$834 million. The deal generated a gain of S$473.1 million. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Feb 25, 2026, CDL has sold 95 per cent of the 777-unit The Orie condo project in Toa Payoh. It also sold 87 per cent of the 706-unit Zyon Grand project, as well as 66 per cent of its 246-unit Newport Residences development. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Including executive condos, the group sold 1,657 units for FY2025, raking in total sales value of S$4.35 billion – marking the highest sales value in CDL’s history. In FY2024, the group sold 1,489 units with total sales value of S$2.97 billion. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said it is confident in the Singapore residential market for 2026, supported by stable demand in public and private housing. With moderating interest rates, buying interest is likely to remain resilient. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group is preparing to launch its Lakeside Drive project in Q3 2026 – featuring five 17-storey residential towers with 570 units and commercial space on the first storey. CDL clinched the site in June 2025 at S$608 million or S$1,132.08 per square foot per plot ratio (psf ppr). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It also plans to launch projects on the Woodlands Drive 17 and Senja Close EC sites in the first quarter of 2027. In August 2025, the residential heavyweight bid S$360.9 million or S$782 psf ppr for the Woodlands site, and S$252.9 million or S$771 psf ppr for the other plot. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On the commercial front, Kwek said the group has considered amalgamating Delfi with neighbouring Claymore Connect and Orchard Hotel to create a sizeable mixed-use development.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While CDL has taken some steps under the Strategic Development Incentive scheme, Kwek said the project will not start in the near term to avoid putting financial strain on the group. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Looking ahead, the group enters its next phase of growth with renewed vigour. As we embark on our value creation journey, we are well positioned to deliver sustainable growth and maximise returns for all shareholders,” said Kwek. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of <!-- --> <!-- -->CDL<!-- --> <!-- --> ended Friday 4.9 per cent or S$0.46 higher at S$9.82, after the release of the results. </p></div>",
            "link": "https://www.businesstimes.com.sg/property/cdl-undertakes-review-relook-strategy-optimise-portfolio-and-capital-recycling",
            "pub_date": "2026-02-27 19:11:18",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}