{
    "data": [
        {
            "title": "Wee Hur back in the black with H2 FY2025 earnings at S$29.8 million; proposes S$0.01 dividend",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Property company Wee Hur on Friday (Feb 27) posted H2 FY2025 earnings of S$29.8 million, a reversal from a loss of S$12.5 million in the period the year prior. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 FY2025 rose 52 per cent to S$139.5 million from S$91.7 million in H2 FY2025. This was driven mainly by progressive revenue recognition from the property segment, continued progress recognition from ongoing building construction projects and contributions from the workers’ dormitory segment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for H2 FY2025 stood at S$0.0324 compared with a loss of S$0.0136 in H2 FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board has recommended a final cash dividend of S$0.01 per ordinary share for the full year, an increase from S$0.008 in the year-ago period. Subject to approval at the upcoming annual general meeting, it will be paid on May 22 after the book closure date of May 8.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings for FY2025 rose 27 per cent to S$68.4 million from S$54 million in FY2024. Revenue for FY2025 rose 47 per cent to S$295.4 million from S$200.8 million in FY2024</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This translated to a earnings per share of S$0.0744, 27 per cent up from an EPS of S$0.0588 in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The improvement in the bottom line was driven by robust revenue growth across its core property, building construction and workers’ dormitory segments. Earnings for FY2025 also benefited from a one-off performance fee from a partial disposal of the purpose built.student accommodation portfolio under Wee Hur PBSA Master Trust.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This was partially offset by lower contributions from share of profits from a joint venture following the disposal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During the year, the group completed the disposal of properties under the Wee Hur PBSA Master Trust (Fund I) for A$1.6 billion (S$1.3 billion). The disposal allowed it to realise a significant part of its investment in the fund and reallocate capital to other investments, the group said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group remarked that it is “well-positioned to accelerate the growth of its business”, supported by a stable fund management revenue stream and an experienced management team.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Singapore property development segment was a major revenue contributor for the period. The segment’s revenue rose 83 per cent to S$82.9 million, amid progressive recognition of revenue from the Bartley Vue project, which reached 84.9 per cent completion and has been sold out.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Looking ahead, the company intends to capitalise on sustained demand for residential projects in Singapore and the Australian purpose-built student accommodation (PBSA) sector. It recently secured the government land sales development in Upper Thomson, and expects to launch the 596-unit project in the first half of 2027.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We endeavour to grow the platform in a disciplined manner to deliver sustainable, long-term value for our shareholders,” said Goh Yeow Lian, executive chairman and managing director of Wee Hur.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Wee Hur closed flat at S$0.795 on Friday before the earnings announcement. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/wee-hur-back-black-h2-fy2025-earnings-s29-8-million-proposes-s0-01-dividend",
            "pub_date": "2026-02-27 20:50:45",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vin’s Holdings posts S$1.7 million H2 net profit in turnaround",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Catalist-listed automotive dealer Vin’s Holdings reported a net profit of S$1.7 million for the second half ended Dec 31, 2025. This marked a turnaround from a net loss of S$535,000 in the corresponding period the year before. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This came despite a 3.8 per cent decline in H2 revenue to S$53.1 million, down from S$55.2 million in the year-ago period. The return to profitability for the half-year was buoyed by stronger margins, as gross profit surged 34.3 per cent to S$8.7 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for the half-year stood at S$0.0127, compared to a loss per share of S$0.0055 previously.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full year, however, the group’s net profit plunged 76.2 per cent to S$484,000, from S$2.04 million in FY2024. Full-year revenue fell 6.2 per cent to S$102 million, from S$108.7 million. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The top-line decline was mainly due to lower sales across its car sales, financing, and rental segments, though this was partially offset by higher revenue in its automobile after-sales segment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Car sales revenue, the group’s largest contributor, fell 7.4 per cent to S$80.9 million, driven by a sharp decline in dealer floor stock sales and a slight drop in pre-owned car sales.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The sharp drop in full-year earnings was heavily weighed down by a 29.1 per cent jump in administrative expenses to S$11.1 million. This was primarily driven by S$1.1 million in one-off listing expenses related to its <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/vins-holdings-closes-16-6-above-ipo-price-sgxs-first-listing-2025\" target=\"_blank\">SGX Catalist debut in April 2025</a>, alongside higher staff costs due to an increased headcount.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Excluding the one-off listing expenses, the group said it would have recorded a profit before tax of approximately S$1.9 million for the year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">An increase in net allowance for expected credit losses also dragged on profitability, rising 36.7 per cent to S$1.1 million due to specific provisions made on certain loan exposures.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">No dividend was declared for FY2025, as the group intends to retain its earnings for capital expenditure and working capital requirements.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It expects the operating landscape to stay competitive, noting that heightened competition has increased pressure on vehicle pricing and margins. Nevertheless, management remains cautiously optimistic, citing industry tailwinds such as an anticipated increase in certificate of entitlement supply and rising consumer acceptance of electrified vehicles.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its counter ended Friday (Feb 27) unchanged at S$0.265 before the results were released.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/vins-holdings-posts-s1-7-million-h2-net-profit-turnaround",
            "pub_date": "2026-02-27 20:20:38",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indofood Agri Resources’ H2 net profit rise 13.6% to 932.4 billion rupiah",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->Indofood Agri Resources<!-- --> <!-- --> on Friday (Feb 27) posted a 13.6 per cent rise in net profit to 932.4 billion rupiah (S$70.4 million) for its second half ended Dec 31, 2025, from 820.8 billion rupiah for the year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue came in at 11.7 trillion rupiah, up 30.8 per cent from 8.9 trillion rupiah a year earlier. The improved showing came on the back of “higher selling prices and increased volume” in its plantation and edible oils and fats (EOF) divisions.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the same time, the group’s other operating expenses fell, while foreign exchange gains rose; these offset a slight decline in gross profit caused by higher palm production costs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for H2 FY2025 rose to 668 rupiah from 588 rupiah previously.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The plantation segment’s revenue climbed 14 per cent amid “higher sales volume and selling prices of palm products”. However, its operating profit declined 5 per cent “due to higher palm production costs and lower fair-value gains on biological assets”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The EOF segment, meanwhile, clocked 23 per cent revenue growth through “competitive pricing strategies” and higher sales. Its operating profit fell 4 per cent year on year; the group said this was “largely due to lower income from the sale of export allocation rights”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full year, Indofood Agri’s net profit rose 13.5 per cent to 1.3 trillion rupiah; revenue grew 31.9 per cent to 21.1 trillion rupiah.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A first and final dividend was recommended for FY2025, with details to be “announced at a later date”. The dividend will be subject to shareholder approval at Indofood Agri’s annual general meeting in end-April.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Commodity volatility to persist </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With commodity prices “expected to remain volatile” due to supply-and-demand dynamics, weather patterns and geopolitical risks, Indofood Agri said it will “continue to focus on targeted action plans”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Through such plans, the group will seek to “improve operational outcomes, strengthen cost controls, drive agronomic innovations and prioritise capex in critical areas”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The expansion of Indofood Agri’s Tanjung Priok refinery, which was completed in the fourth quarter of 2025, added a third production line “capable of processing up to 450,000 tonnes of CPO (crude palm oil) per year”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group added that its EOF segment will leverage the expanded refining capacity and advanced technologies to “increase sales volumes through competitive pricing, strengthen distribution networks and ensure consistent product availability”.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/indofood-agri-resources-h2-net-profit-rise-13-6-932-4-billion-rupiah",
            "pub_date": "2026-02-27 20:20:37",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ST Engineering hit by S$689 million impairment as H2 net profit falls 83.6%; defence growth seen underpinning 2026",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] ST Engineering recognised S$689 million in one-off impairment losses in its 2025 financial year, tied largely to its satellite communications (Satcom) unit, iDirect. This weighed down its second-half net profit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But group president and chief executive officer Vincent Chong noted on Friday (Feb 27) at ST Engineering’s full-year results briefing that activity is picking up in 2026, with more orders secured and cost cuts under way as the company focuses on turning the business around.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our priority remains supporting customers, executing the turnaround and evaluating the strategic path forward for the Satcom business,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Even as it evaluates “strategic actions” for the business, ST Engineering has implemented S$43 million in annualised cost savings for the Satcom unit. It has more plans to bring these savings up to S$63 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For Satcom, the group is targeting H1 revenue that is stronger year on year, following its dive in net profit for H2 FY2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The urban solutions and Satcom segment sank into the red with a S$567.7 million loss in H2, reversing from earnings of S$31.1 million in the year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, the segment’s H2 revenue rose 6 per cent year on year to S$1.1 billion, from S$1 billion the previous year. Urban solutions drove the improvement, which was partially offset by lower Satcom contributions.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">ST Engineering reported a net profit of S$59.9 million for H2 FY2025, an 83.6 per cent decline from S$365.7 million in the previous corresponding period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group’s revenue came in at S$6.4 billion for the half-year, up from S$5.8 billion in H2 FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for FY2025 stood at S$0.1484. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Growth driven by defence and aerospace</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As the group irons out its urban solutions and Satcom business, its other two segments – commercial aerospace, and defence and public security – posted higher profits in FY2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">ST Engineering’s commercial aerospace profits for H2 rose to S$319 million, from S$210.5 million in the year-ago period. The segment’s revenue increased 23 per cent to S$2.6 billion, from S$2.2 billion the previous year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This growth was contributed by stronger sales from engines, MRO (maintenance, repair and operations) and nacelles,” said Cedric Foo, group chief financial officer of ST Engineering.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The defence and public security segment reported S$551.4 million in H2 earnings, up from S$311.9 the previous year. Its revenue stood at S$2.7 billion, rising 5 per cent on the year from S$2.6 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full year, commercial aerospace accounted for 40 per cent of the group’s revenue, and defence and public security made up 43 per cent. The urban solutions and Satcom segment contributed 16 per cent of the revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Overall, ST Engineering’s revenue stood at S$12.3 billion for FY2025, up 9.5 per cent from S$11.3 billion in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Full-year net profit fell 34.1 per cent year on year to S$462.8 million, from S$702.3 million. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nonetheless, the group’s fiscal outlook remains positive. It cited contract wins, a strong order book and a structural shift in global defence spending.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, 2025, its order book stood at S$33.2 billion, of which S$9.9 billion is expected to be delivered this year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our record order book is a clear leading indicator of revenue growth in the years ahead,” said Chong.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Mervyn Tan, group chief operating officer for technology and innovation, as well as president of defence and public security, said: “We continue to stick to our assessment that the increase that we see in the investment in defence for various countries (appears) to be a structural shift.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group proposed a final dividend of S$0.06 per ordinary share and a special dividend of S$0.05 a share.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In total, the dividend for FY2025 is S$0.23 per ordinary share, translating to a dividend yield of 3.52 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of <!-- --> <!-- -->ST Engineering<!-- --> <!-- --> ended Friday 0.5 per cent or S$0.05 lower at S$9.97, after the results were released.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/st-engineering-hit-s689-million-impairment-h2-net-profit-falls-83-6-defence-growth-seen-underpinning",
            "pub_date": "2026-02-27 20:15:38",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AvePoint Q4 profit swings into black at US$15.6 million as AI demand fuels software boom",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Data management firm AvePoint’s net profit in Q4 FY2025 swung into the black at US$15.6 million, reversing from a US$17.2 million loss the previous year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue of AvePoint also rose 29 per cent to US$114.7 million in the fourth quarter, from US$89.2 million in the previous corresponding period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We see healthy demand from companies spanning every size, vertical and region of the world,” said Dr Jiang Tianyi, chief executive of AvePoint at the earnings call on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He added that amid the rise of artificial intelligence (AI) and agentic AI adoption, organisations no longer view data governance as “simple back-office hygiene”, but as a “prerequisite”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He argued that the next stage of growth with AI agents lies in data governance and operational oversight for AI.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The increase in Q4 profit capped a full-year financial turnaround for the tech company, as it reported a profit of US$34.8 million for 2025, reversing from a US$29.1 million loss in the previous year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Saas (Software-as-a-service) continues to drive our business,” said Jim Caci, chief financial officer of the group. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">AvePoint provides platforms that help companies with operational oversight for data, ensuring that unstructured data – such as those in text format – will be able to be used for AI training.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Saas – referring to accessing software through cloud – accounted for 78 per cent of total fiscal Q4 revenue. Saas revenue in Q4 grew 37 per cent year on year to US$88.9 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our fourth-quarter results are a strong conclusion to an outstanding year,” said Dr Jiang. AvePoint was listed on the Singapore Exchange (SGX) in September last year, and has been listed on the Nasdaq since 2021.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, AvePoint is still facing some headwinds – particularly on the gross retention rates front.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its gross retention rate – which is a metric showing the percentage of recurring revenue retained from existing customers, excluding expansion – stood at 88 per cent in Q4, which was in line with the Q3 retention rate, noted Caci.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He added that in Q3 and Q4, AvePoint noted a higher migration contribution than in prior years, due to increased customer modernisation around AI deployment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nonetheless, both Dr Jiang and Caci remain optimistic that Avepoint will be able to attain its target of US$1 billion annual recurring revenue by 2029.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Annual recurring revenue (ARR) of AvePoint increased 27 per cent to US$416.8 million as at Dec 31. This was the eleventh consecutive quarter of double-digit net new ARR growth, Caci said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company ended the year with 820 customers with a total ARR of over US$100,000, a year over year increase of 24 per cent, said Caci.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He also added that it has more than 100 customers with ARR of over US$500,000, as well as 31 customers with ARR of more than US$1,000,000.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Taken together, these results demonstrate that we are meeting the demands of organisations looking for single-platform vendors that can address multiple strategic use cases,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of AvePoint closed 7.6 per cent or S$0.97 higher at S$13.80 on Friday.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/avepoint-q4-profit-swings-black-us15-6-million-ai-demand-fuels-software-boom",
            "pub_date": "2026-02-27 20:15:37",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Budget 2026 should affect Singaporean wallets",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN Singapore Budget 2026 was unveiled on Feb 12, the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-highlights-ai-champions-foreign-worker-policy-tweaks-more-cdc-vouchers\" target=\"_blank\">headline numbers</a> caught attention. For individuals, in particular: Community Development Council (CDC) Vouchers, cost-of-living payouts and education credits. But beneath the surface lies a deeper message. One that does not show up on the balance sheet yet will determine the financial futures of millions of Singaporeans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This Budget arrives in a world where artificial intelligence (AI) is reshaping careers, living costs still matter and family-building gets expensive fast. More than a fiscal document, the Budget quietly, but powerfully, challenges each of us to upgrade our money mindset alongside the nation’s economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s why every young career starter, aspiring parent and middle-class professional should read the Budget with as much interest as the next smartphone launch.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/how-budget-2026-should-affect-singaporean-wallets",
            "pub_date": "2026-02-27 20:06:31",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "As Trump reins in China tech curbs, Beijing’s export controls come of age",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BEIJING] Almost a year after China expanded rare-Earth export controls ostensibly aimed at preventing their use by foreign militaries, exporters are still asking a basic question: when does a small magnet turn an everyday product into a controlled item?</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Makers of products ranging from pill boxes, printed billboards, motor components and optical glass are among the growing number of companies that have queried the commerce ministry over whether they require export licences.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Beijing is expanding export enforcement manpower and imposing compliance nationwide, even as it raises costs for domestic firms and makes it harder for them to ship goods.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A Reuters review of over 200 public export-control compliance enquiries to China’s commerce ministry between 2019 and the start of this month showed a stark surge after rare-Earth controls were tightened last April.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the meantime, Washington has eased some export restrictions on products like advanced artificial-intelligence chips during President Donald Trump’s second term, after China’s curbs on rare earths exports threatened to hobble global supply chains spanning autos, technology, energy, aerospace, and defence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The export controls on both sides are expected to be in sharp focus as Trump and Chinese President Xi Jinping meet in Beijing in late March for their second in-person talks since Trump returned to office, setting up a high-stakes test of whether a fragile trade truce between the world’s two largest economies can hold.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“What we are seeing in China is ... the rapid construction of a comprehensive export-control apparatus designed to weaponize chokepoints across strategic and non-strategic sectors,” said Alfredo Montufar-Helu, a Beijing-based managing director at Ankura Consulting. “That the US is reining in some of its controls is a direct acknowledgement of China’s growing leverage.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China’s commerce ministry did not respond to a request for comment.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Export compliance queries jump</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Exporters have flooded the Chinese commerce ministry’s website with urgent compliance questions: whether magnetic sheets cross rare-Earth thresholds; whether gallium nitride chips are restricted; whether ultraviolet medical equipment counts as controlled technology.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From 2019 through 2024, only 43 export-control compliance enquiries were posted publicly. In 2025 alone, the number jumped to 135, with about 16 per cent of them complaints about issues such as shipment delays and increased regulatory burdens. The rate of complaints nearly doubled in early 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The actual number of queries from exporters is likely to be orders of magnitude larger as there are several private channels these companies can use, including contacting provincial and municipal commerce bureaux, many of which do not have public query platforms like the central government’s commerce ministry.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The official responses to the queries from Chinese exporters have been vague and formulaic, stopping short of confirming whether any individual product, from rare-Earth magnets to medical materials, required a licence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The enforcement push is also legal and bureaucratic. Since China enacted its Export Control Law in October 2020, it has introduced or expanded export control measures 29 times, compared to just six times between 2015-2020.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Recruitment documents show 45 commerce ministry posts available in this year’s national civil-service examination could be assigned to export-control-related work, compared with 11 such vacancies in both 2022 and 2023.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dozens of provincial and municipal governments have organised compliance seminars and policy briefings over the past year, while Beijing has convened national export-control work conferences bringing officials from across the country to the capital.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Beijing’s October 2025 revision to its rare-Earth export-control regime reflected lessons from the US Foreign Direct Product Rule, which allows Washington to assert jurisdiction over certain foreign-made goods produced with American technology.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“China’s use of rare earths as leverage is completely learned from the West – especially the US,” said Li Xing, professor at the Guangdong Institute for International Strategies, a think tank in Guangzhou.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China dominates the processing of rare earths, the conversion of ore into refined oxides and metals used in electric vehicles, wind turbines and defence systems, a chokepoint deeper in the supply chain than mining itself.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its new licensing system reaches into processing and downstream incorporation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is not just a supply chain shortage. This is economic warfare,” said Nick Myers, chief executive of US rare-Earth startup Phoenix Tailings.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Pace of US export controls slows</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During Trump’s first term and under President Joe Biden, the US rapidly expanded export controls targeting China.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Annual China-related additions to the Entity List, which requires US exporters to obtain licences, often reviewed under a presumption of denial, surged from 47 in 2018 to 227 in 2020, reaching a record 257 in 2024, according to a Reuters analysis.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Since Trump’s return to office, that trajectory has reversed. China-related Entity List additions fell to 131 in 2025, roughly half the previous year’s pace.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this month, the Pentagon briefly published, then withdrew, an updated Military End User list that would have added Chinese tech giants Alibaba and Baidu while removing a couple of memory chipmakers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The White House and the US Commerce Department’s Bureau of Industry and Security did not respond to requests for comment. A Pentagon official said the list was removed as it may require changes based on new information and that an updated list would be published, without further elaborating.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The moderation has drawn criticism from bipartisan US lawmakers, who have faulted the administration for approving certain Nvidia AI chip exports and cutting BIS funding.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A Nvidia spokesperson said in a statement that criticism of the current administration’s decision to greenlight these semiconductor shipments to China was unintentionally promoting the interests of foreign competitors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“America should always want its industry to compete for vetted and approved commercial businesses, and thereby protecting national security, creating American jobs, and keeping America’s lead in AI,” the spokesperson said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia CEO Jensen Huang, who criticised Biden-era controls, said last year that “export control was a failure” and that Trump “realises it’s exactly the wrong goal.” REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/trump-reins-china-tech-curbs-beijings-export-controls-come-age",
            "pub_date": "2026-02-27 20:01:07",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Issue 184: OCBC hit by coal complaint; Parkway Life Reit secures green, social debt",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Sustainable finance</strong></p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">OCBC under pressure for coal-financing disclosures</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/esg/green-group-files-sgx-complaint-against-ocbc-alleging-disclosure-gaps-carbon-intensive-assets\" target=\"_blank\">OCBC</a> is the target in a complaint lodged with Singapore Exchange alleging inadequate disclosure by the Singapore lender on its exposure to coal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The complaint is the latest salvo by environmental group Market Forces, which had <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/esg/singapore-banks-flagged-financing-haritas-coal-powered-nickel-smelters-ocbc-tops-list-financiers\" target=\"_blank\">previously</a> identified OCBC and its Singapore peers UOB and DBS as financiers for Indonesian miner Harita Nickel, whose facilities rely largely on coal for energy.</p></div>",
            "link": "https://www.businesstimes.com.sg/newsletters/esg-insights/issue-184-ocbc-hit-coal-complaint-parkway-life-reit-secures-green-social-debt",
            "pub_date": "2026-02-27 20:01:07",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banyan Group H2 profit falls 7% despite 35% jump in revenue",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Resort operator Banyan Group reported a 7 per cent decline in net profit to S$33.5 million for the second half ended Dec 31, 2025, from S$35.9 million in the corresponding period a year ago.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This came despite revenue for the half-year surging 35 per cent to S$271.3 million, up from S$200.9 million previously. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for the half-year stood at S$0.0386, down from S$0.0414 in the year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The drop in the bottom line was largely due to higher depreciation and amortisation expenses, increased net finance costs and the absence of a S$23.3 million Covid-19 insurance compensation that boosted the previous year’s earnings.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The residences segment was the primary driver of top-line growth, with H2 revenue more than doubling year on year to S$139.6 million. This growth was underpinned by the completion and progressive handover of condominiums and higher unit recognition of 182 units, compared with 118 units in H2 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Conversely, H2 revenue from the hotel investments segment fell 4 per cent to S$90.9 million. Occupancy in Thailand decreased by 5 percentage points, and revenue per available room (RevPAR) fell 10 per cent in H2, weighed down by lower international arrivals and domestic and regional political uncertainties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue from the fee-based segment also dipped 7 per cent to S$40.8 million, primarily due to a lack of fee recognition from Korean branded residences projects.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full year ended Dec 31, 2025, Banyan Group’s net profit edged up 1 per cent to S$42.5 million from S$42.1 million in FY2024. Total revenue for FY2025 rose 25 per cent to S$477.4 million, driven by a record year in the residences segment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Full-year residences revenue surged 90 per cent to S$197.6 million. The hotel investments segment recorded a marginal full-year revenue growth of 1 per cent to S$198.8 million, while the fee-based segment saw a 2 per cent revenue increase to S$80.9 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for the full year was S$0.049, up from S$0.0485 the previous year. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group proposed a first and final one-tier tax-exempt cash dividend of S$0.0135 per ordinary share for FY2025, up from S$0.0130, subject to shareholder approval.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Looking ahead, Banyan Group noted it has S$604.4 million in unrecognised revenue from its residences segment, with over 30 per cent expected to be recognised in 2026. The group also highlighted the milestone opening of its 100th resort, the Mandai Rainforest Resort by Banyan Tree in Singapore in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Banyan Tree rose 1.6 per cent to close S$0.01 higher at S$0.655 on Friday, before the results.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/banyan-group-h2-profit-falls-7-despite-35-jump-revenue",
            "pub_date": "2026-02-27 19:55:40",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Fok’s H2 FY2025 net profit rises 14.1% to S$23.1 million; proposes dividend of S$0.01",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Hong Fok’s earnings for H2 FY2025 rose 14.7 per cent to S$23.1 million, from S$20.1 million in the year-ago period. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 FY2025 fell 13.9 per cent to S$51.4 million, from S$59.7 million in H2 FY2024, based on the financial results filed on Friday (Feb 27) by the property player.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings per share for H2 FY2025, consequently, rose to S$0.0360 from S$0.0313.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A first and final dividend of S$0.01 per share was proposed, and the quantum is unchanged from FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, revenue decreased by 6 per cent to S$98.3 million from S$104.3 million in FY2024. This was mainly due to lower revenue from the sale of residential units in Concourse Skyline, which was partially offset by higher rental income from investment properties. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The revaluation gain was S$16.2 million for FY2025, 36.8 per cent higher than the S$11.8 million in FY2024 for its investment properties,</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earnings for FY2025 rose 20 per cent to S$28.5 million from S$23.7 million in FY2024</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During the year, the company completed the acquisition of five units in International Building for S$27.8 million. This acquisition resulted in the group owning all the units in the building.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Net asset value per share stood at S$3.65 as at end-FY2025, up from S$3.61 as at end-FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company said that rental income for investment properties in 2026 is likely to remain stable, while the Singapore office market is expected to remain resilient despite macroeconomic and political uncertainties. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hong Fok will work towards higher-quality revenue through market segmentation discipline for its hotel, Yotel Singapore Orchard Road. It aims to protect margins through cost control, enhanced workforce stability, asset quality and guest experience. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It expects to continue recognising revenue from the sale of residential units in Concourse Skyline.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of Hong Fok closed unchanged at S$0.83 on Friday before the results were posted.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/hong-foks-h2-fy2025-net-profit-rises-14-1-s23-1-million-proposes-dividend-s0-01",
            "pub_date": "2026-02-27 19:55:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}