{
    "data": [
        {
            "title": "Ossia’s Goh family picks up S$73 million bloc of 18 strata units at Orchard Shopping Centre",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The Goh family behind Ossia International has bought a portfolio of 18 freehold strata-titled retail units at Orchard Shopping Centre for S$73 million, amid a recent pick-up in deal activity and interest in Singapore’s prime shopping belt. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The acquisition price works out to S$8,171 per square foot (psf) on a strata area of 8,934 square feet (sq ft). The portfolio, owned and managed by JLL affiliate LaSalle Investment Management, comprises two ground-floor units occupied by Maybank, and 16 strata units on the second floor tenanted by RHB Bank and Xiao Long Kan Hotpot. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The price tag is some 19 per cent lower than the previous asking price of S$90 million, when the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/portfolio-of-18-strata-units-at-orchard-shopping-centre-for-sale-at-s90m-indicative-price\" target=\"_blank\">property was marketed in 2022</a>. </p></div>",
            "link": "https://www.businesstimes.com.sg/property/ossias-goh-family-picks-s73-million-bloc-18-strata-units-orchard-shopping-centre",
            "pub_date": "2026-03-01 17:31:25",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Opec+ debates oil output boost as US war on Iran disrupts shipments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON/MOSCOW] Opec+ will consider a larger-than-expected oil output increase on Sunday (Mar 1), two Opec+ sources said after the US-Israeli war on Opec+ member Iran and Teheran’s retaliation led to shipment disruptions in the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ has a history of raising oil output to cushion disruptions but analysts said the group currently has very little spare capacity to meaningfully add to supply, except for its leader Saudi Arabia and the United Arab Emirates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riyadh has been raising oil production and exports in recent weeks in preparation for US strikes on Iran, sources have told Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil, gas and other shipments from the Middle East via the Strait of Hormuz have come to a halt since Saturday after shipowners received a warning from Iran saying the area was closed for navigation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ will debate a production hike of 411,000 barrels per day or more at a meeting on Sunday, sources told Reuters, larger than the original expectations of 137,000 bpd.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil prices jumped on Friday to US$73 per barrel, the highest level since July, on fears of a wider conflict in the Middle East and supply disruptions through Hormuz, the world’s most important oil route amounting to over 20 per cent of global oil transit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Middle East leaders have warned Washington that a war on Iran could lead to oil prices jumping to over US$100 per barrel, said veteran Opec analyst Helima Croft from RBC. Analysts from Barclays also said prices could rise to US$100.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Croft said the market impact from any large Opec output increase will be limited due to a lack of actual production capabilities outside Saudi Arabia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The meeting on Sunday will start at 1100 GMT and will involve only eight members of Opec+ – Saudi Arabia, Russia, the UAE, Kazakhstan, Kuwait, Iraq, Algeria and Oman. Opec+ groups the Organization of the Petroleum Exporting Countries and allies like Russia but most production changes in the past years have been done by the eight members.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The eight members raised production quotas by about 2.9 million bpd from April through December 2025, roughly 3 per cent of global demand, before pausing increases for January to March 2026 due to seasonal weakness. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/opec-debates-oil-output-boost-us-war-iran-disrupts-shipments",
            "pub_date": "2026-03-01 17:25:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "People Systems Consultancy partners firms like Maybank to tackle poverty, help marginalised communities upskill",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Rocelito Jancinal from Cebu, the Philippines, lost his livelihood as a technician after an injury and fell into debt when he used his savings for medical treatment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2018, the father of four enrolled in People Systems Consultancy’s (PSC) entrepreneurial programme. He has since expanded into new ventures such as vinegar-making and herb sales, as well as learnt skills such as sales strategies, marketing and money management.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">His income after joining PSC has surged to US$2,300 a month from US$62. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As his business grew, he employed four persons with disabilities (PWDs) and now supports local farmers by getting his supplies from them, as well as trains aspiring organic farmers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Kuala Lumpur-based social enterprise focuses on beneficiaries with no or low income, and is on a mission to eradicate poverty around South-east Asia. It has already done so for nearly 115,000 families as at February. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Raymond Gabriel, co-founder and executive director of PSC, said: “Through an intervention that (takes) six months to a year, we build the capabilities of the people that we empower through entrepreneurship training, financial-literacy training and mentoring, to raise their incomes… and get them out of poverty.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He added that PSC has a “high” success rate: About 70 per cent of beneficiaries record an income increase of between 100 and 400 per cent in the short term. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We also look at how we have improved their access to education, utilities and healthcare, their confidence and knowledge improvement, and how they are helping their communities after they have come up. So it’s a pay-it-forward model.”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Key programmes</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">More than 20 years ago, Gabriel volunteered as a social worker to help the homeless in KL. While there were many organisations running programmes to provide basic needs, he realised that it would be more effective to tackle the root problem of poverty.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2008, when PSC was established, it was involved in a programme with Microsoft and Up Foundation to help 120 YWCA beneficiaries in Malaysia. PSC taught them soft skills such as financial literacy and building confidence to complement their vocational training. Ultimately, 90 per cent of them landed a job afterwards, or started their own business.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“In rural areas of Malaysia, sometimes jobs are scarce, so it’s good for (them) to start their own business and empower the local community by giving them jobs as well,” Gabriel said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He started developing and testing PSC’s own programmes. It partners government ministries to source for beneficiaries.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC also has a long-term partnership with Maybank. The Rise programme was piloted in 2014 and has since expanded to Singapore, Indonesia and other Asean markets. It is an entrepreneurship and financial-empowerment programme for disadvantaged communities – particularly for PWDs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Just like PSC’s own programmes, Rise covers topics to help beneficiaries run a business, such as operations planning, and includes ongoing mentoring. As at end-2025, it had more than 51,000 participants.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC’s standard entrepreneurship programme, which is free for beneficiaries, runs for three days and includes lessons in finance and money management. This is followed by six months of mentoring, where beneficiaries learn about digital marketing and customer service.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“They have to take action on the fourth day (after training)... We have a very rigorous profiling system to make sure that the people who join are serious about starting something,” Gabriel noted, adding that partners and government agencies fund the programmes as they “want to see economic uplift” within certain communities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In addition, PSC runs programmes on financial education, employability and youth empowerment.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Expansion into Singapore, new programmes</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC has branches in Malaysia, Cambodia, Laos, the Philippines and Indonesia, and expanded to Singapore in December 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gabriel said: “Singapore has good employment policies and there’re jobs for everyone, but not everyone is qualified or educated enough to get a high-paying job. Some people have an innate entrepreneurial spirit, and we can tap into that.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There are three targeted beneficiary groups in Singapore: PWDs and people with mental health issues; people who want to supplement their income; and small and medium-sized enterprises (SMEs). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC currently partners social service agencies such as SG Enable and Touch Community Services to reach beneficiaries.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gabriel added: “We have developed programmes for SMEs looking at going regional and how they can tap different markets, because we have so much experience working in Asean. There’s a lot that we can share with them to enable them to grow faster, from corporate structures to building local systems in place.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this year, PSC launched a tech entrepreneurship programme for those looking to build an online or app-based business.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In PSC’s pipeline is an environmental-focused programme to teach entrepreneurs about carbon reduction. </p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/people-systems-consultancy-partners-firms-maybank-tackle-poverty-help-marginalised-communities",
            "pub_date": "2026-03-01 16:25:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia forms alliance to make sure 6G networks embrace AI",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BARCELONA] Nvidia, the world’s most valuable company, is throwing its weight behind an effort to make sure the forthcoming 6G phone networks provide a strong platform for services and devices that take advantage of artificial intelligence. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia is teaming up with a group of telecommunications companies including Nokia, SoftBank Group and T-Mobile US that will commit to building sixth-generation networks based on computers and software capable of using AI to help direct radio traffic safely and efficiently. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The change is necessary because of myriad devices that will be attached to networks in the future and their more complex requirements, Nvidia said on Sunday (Mar 1) in a statement timed for the opening of a telecom industry conference in Barcelona. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The current generation, 5G, was designed to connect people via voice and data and provide them with retrieved information. It isn’t capable of supporting the widespread use of AI, Nvidia said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The networks of today simply aren’t ready for the use cases of tomorrow,” said Ronnie Vasishta, who heads Nvidia’s telecommunications business and strategy. “In the AI era, everything changes. Networks will deliver intelligence, not just for humans on their phones, but for machines.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Telecommunications networks will require “hundreds of thousands of times” more efficiency because there isn’t enough radio spectrum to support the new uses, he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The chipmaker, whose gear is at the centre of the AI explosion, is trying to carve out a new market and clear a potential roadblock. Nvidia already offers versions of its chips, computers and software for use in networks and hopes to expand that business. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the same time, the company needs AI to spread to more areas – in things termed physical AI, like robots and vehicles – to continue to fuel demand and pay for the data centres that are currently the biggest consumers of its technology. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Without wireless networks enabled for AI traffic, Nvidia’s vision of a world full of humanoid robots and self-driving cars might be slower to emerge. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Every decade or so the telecommunications business shifts to a new generation of wireless technology, the next “G.” In the run-up to setting standards that determine the parameters of new hardware and software, companies form alliances to steer the industry in a direction they believe will favour their products. That approach has a mixed record and has been undermined by competing efforts that have sometimes delayed new deployments or resulted in networks that are incompatible. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia argues that new gear and software needs to be fundamentally open. Instead of locked-down devices with bespoke hardware, the radios that send and receive wireless traffic should be controlled by software that can be updated and runs on more general purpose computers. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The data traffic should be routed by AI software that’s capable of responding to rapidly changing patterns and priorities in a way that’s simply not currently possible, according to the chipmaker. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In such an environment, the telecommunications industry will be far more open to the emergence of new providers, including startups that might rapidly attain billion-US dollar valuations, Nvidia’s Vasishta said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This will be how a new telecom unicorn is born,” he said. There have been far too few new entrants into the industry over the last decade, he added. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/nvidia-forms-alliance-make-sure-6g-networks-embrace-ai",
            "pub_date": "2026-03-01 16:00:38",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s policy summit puts tech, stimulus in focus for investors",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BEIJING] China kicks off its most important annual political meeting next week, with investors seeking clarity on how Beijing intends to press ahead with its tech ambitions while reviving a fragile consumer economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the weeklong gathering of the National People’s Congress starting Mar 5, officials are expected to set a 2026 growth target of 4.5 to 5 per cent, down from around 5 per cent in recent years – a sign leaders may tolerate slower expansion as a property slump and deflation continue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The meeting takes on added importance as policymakers will outline priorities tied to a new five-year plan. Investors will look for details on how Beijing intends to support innovation and rekindle momentum in Chinese stocks, which surged last year thanks to AI but have been subdued this year. They will also be seeking concrete measures to boost domestic demand – an oft-repeated goal that’s light on specifics so far. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The policy meeting “could provide a fresh catalyst for stocks, which have been lacklustre this year amid a lack of policy support,” said Marvin Chen, a strategist at Bloomberg Intelligence. He noted that cyclical and property stocks have historically delivered the strongest gains in the month following the event.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here are the key areas traders and analysts are watching ahead of the meeting:</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Technology</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From DeepSeek in early 2025 to a surge in robotics shares, tech stocks have powered China’s market rebound. Investors are now seeking reassurance that the rally still has further to run.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">An AI “scare trade” has rattled tech shares globally, triggered by potential disruptions to the economy. In China, the pressure has fallen on traditional Internet giants, with money moving out of Alibaba Group Holding and Tencent Holdings into smaller firms seen as more direct AI beneficiaries like MiniMax Group and Knowledge Atlas Technology.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Technology will remain a key focus for capital allocation,” according to a note by China International Capital Corp. Beyond established AI supply-chain leaders, the analysts see potential winners in cloud computing, smart driving and quantum technology.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Consumption</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reviving domestic demand has been a consistent theme in recent high-level policy meetings. The shift comes as more countries push back against China’s cheap exports, raising the pressure on Beijing to rely less on external demand.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We see meaningful likelihood of enhanced consumption support that goes beyond consumer durables,” said Homin Lee, a senior macro strategist at Lombard Odier in Singapore.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors rotated into consumer sectors earlier this year amid concerns about stretched tech valuations, but the rebound proved short-lived in the absence of a sustained pickup in consumer demand and prices. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The CSI 300 Consumer Discretionary Index and CSI 300 Consumer Staples Index both rank among the least favoured sub-sector gauges in China this year.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">‘Anti-involution’</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China launched the “anti-involution” campaign in 2025 to curb cut-throat competition marked by overcapacity and price wars. The government pushed industries such as solar and electric vehicles to shift their focus towards quality and innovation, rather than mere volume.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Early signs show the drive is gaining traction. Prices in parts of the solar and materials supply chains have rebounded, and shares of photovoltaic companies have climbed to near a two-year high.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While excess capacity remains an issue, UBS Group says the campaign could help steer the economy towards a reflationary environment in 2026. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Still, investors will be weighing policymakers’ resolve to keep curbing excess capacity while balancing growth and employment pressures.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Property</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A multiyear property slump has been a major drag on China’s economy, and reversing that would require much stronger policy intervention. Officials will likely reaffirm support for a new development model centreed on higher-quality housing and market stabilisation, with further easing likely left to local governments, according to Citigroup Inc.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shanghai recently eased homebuying rules, and Beijing and Shenzhen are expected to follow suit. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Morgan Stanley analysts including Stephen Cheung cautioned it may be too early to turn positive, flagging risks of policy disappointment at the NPC, more profit warnings and a renewed slide in home sales. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Bonds</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the bond market, attention will be on the fiscal budget and how much supply pressure government issuance may create, especially at the long end. Beijing is expected to ramp up sales of ultra-long special sovereign bonds to support domestic demand and stabilise growth. Morgan Stanley estimates issuance could reach 1.5 trillion yuan (S$276.4 billion), up from 1.3 trillion yuan last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China’s yield curve has already steepened on an accommodative monetary policy and a larger debt quota. The spread between 30- and 10-year government bond yields widened to more than 40 basis points at the end of 2025, from 24 basis points a year earlier, reflecting concerns about supply-demand imbalances in longer-dated debt.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Renminbi internationalisation</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Communist Party’s proposal for the next five-year plan through 2030 included a pledge to “push forward the internationalisation of the renminbi.” That’s a bolder stance compared with the previous plan, which called for advancing the goal in a “stable and prudent” manner.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors will look for signals on how China plans to capitalise on waning confidence in the US dollar and advance Xi’s ambition for a “powerful currency.” The onshore renminbi remains near a three-year high against the greenback, despite a modest pullback after the People’s Bank of China’s latest effort to cool the rally. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/chinas-policy-summit-puts-tech-stimulus-focus-investors",
            "pub_date": "2026-03-01 15:46:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The new age of chokepoints",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IRAN’S recent partial closure of the Strait of Hormuz has once again exposed how vulnerable global commerce remains to disruption at a handful of narrow passages.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Roughly a fifth of the world’s oil and a significant share of maritime trade pass through Hormuz alone. When tensions constrict such arteries, energy prices, freight rates, insurance premiums and corporate balance sheets <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/possible-hormuz-blockade-threatens-asias-energy-lifeline-unsettling-oil-market\" target=\"_blank\">react</a> almost immediately.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hormuz is not an anomaly. The global economy runs on a small number of critical passages, including the Suez Canal, Panama Canal and Strait of Malacca, that together carry more than half of global maritime trade.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/new-age-chokepoints",
            "pub_date": "2026-03-01 15:36:20",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "More strikes aimed at Iran after Supreme Leader Khamenei’s death, Trump issues new warning",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[TEL AVIV/DUBAI] Israel said on Sunday (Mar 1) it launched another wave of attacks on Iran, as Iranians grappled with uncertainty after the killing of their supreme leader in US and Israeli strikes, while President Donald Trump warned of consequences for retaliation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hours after both nations said an air strike killed Ayatollah Ali Khamenei in the military campaign to overthrow the government of the Islamic Republic, its state media confirmed the 86-year-old leader’s death on Saturday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In another blow for Iran’s leaders, Armed Forces chief of staff Abdolrahim Mousavi was killed in strikes, broadcaster Iran TV said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The US will hit Iran “with a force that has never been seen before,” Trump warned on Sunday, if the Middle East nation hit back after the strikes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Iran just stated that they are going to hit very hard today, harder than they have ever been hit before,” Trump said in a post on Truth Social.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He added, “They better not do that, however, because if they do, we will hit them with a force that has never been seen before!”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran’s top security official, Ali Larijani, said a temporary leadership council would be set up.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He accused the US and Israel of trying to plunder and disintegrate Iran and warned “secessionist groups” of a harsh response if they attempt action, state television said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In remarks directed at Trump and his close ally, Israeli Prime Minister Benjamin Netanyahu, Iran’s parliament speaker, Mohammad Baqer Qalibaf, said they had crossed a red line and would “pay for it”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A source briefed on the Israeli campaign told Reuters there had been no change in military strategy after the killing of Khamenei and that strikes would continue to target Iranian officials and missile infrastructure.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Second day of loud blasts heard</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Several loud blasts were heard for a second day on Sunday in regional business hub Dubai and over Qatar’s capital of Doha, witnesses said, after Iran launched retaliatory strikes on the neighbouring Gulf states.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Puffs of white smoke from missile interceptions were glimpsed in the skies over Dubai, while billows of dark smoke rose over its port of Jebel Ali, one of the busiest in the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran, which has said it would target US bases if attacked, hit a range of other targets, keeping the major oil-producing Gulf on edge.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Air raid sirens sounded repeatedly across Israel early on Sunday, with a series of explosions heard in Tel Aviv as Israel’s sophisticated air defence system sought to intercept the latest Iranian offensive.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There was no immediate report of damage or injuries.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump said the air strikes aimed to end a decades-long threat from Iran and ensure it could not develop a nuclear weapon.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He sought to justify a risky gambit that seemed to contradict his professed opposition to American involvement in complex overseas conflicts.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is not only Justice for the people of Iran, but for all Great Americans, and those people from many Countries throughout the World, that have been killed or mutilated by Khamenei and his gang of bloodthirsty thugs,” Trump wrote on Truth Social.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump and Netanyahu told Iranians to pursue a rare chance to topple their clerical leaders.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Leaders already faced pressure on several fronts</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The leadership had already been under pressure from an economy hammered by sanctions, protesters who proved ready again to take to the streets despite fierce crackdowns and regional proxies severely weakened by Israeli attacks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israel and the US timed the attacks to coincide with a meeting of Khamenei and his top aides, said two US sources and a US official familiar with the matter.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Khamenei was working in his office at the time of Saturday’s attack, state media said. It also killed his daughter, grandchild, daughter-in-law and son-in-law.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Experts said that while the deaths of Khamenei and other Iranian leaders would deal the country a major blow, it would not necessarily spell the end of Iran’s entrenched clerical rule or the sway of the elite Islamic Revolutionary Guards Corps over the population.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump evoked the 1979 storming of the US embassy in Teheran, when Iranian student activists in coordination with radical clerics took 52 American hostage for 444 days, demanding the extradition of the deposed Shah from the US.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israel’s military said it targeted Iran’s ballistic missile and air defence systems with strikes on Sunday morning.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran’s armed forces would soon retaliate again with their biggest offensive against US bases and Israel, the Revolutionary Guards vowed in a statement on Sunday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran responded to Saturday’s initial attacks by launching hundreds of missiles and drones targeting US troops and cities in Israel and Arab countries allied with Washington, prompting widespread cancellations of Middle East flights.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Pentagon said there were no US deaths or injuries.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">One of global aviation’s worst disruptions</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Major Middle Eastern airports, including Dubai, the world’s busiest international travel hub, were shut on Saturday after Iran’s missile retaliation unleashed one of global aviation’s most severe disruptions in years.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dubai’s landmark Burj Al Arab hotel and the airport, which handles more than 1,000 flights a day, were damaged in an overnight attack on sites across the Arab Gulf states that also hit airports in Abu Dhabi and Kuwait.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Saturday, Teheran warned that it had closed the Strait of Hormuz, the narrow conduit for about a fifth of global oil consumption, raising expectations of a sharp jump in oil prices.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Opec+ grouping of major oil producers is set to meet on Sunday and may consider a larger-than-planned output increase as several tanker owners, oil majors and trading houses suspended energy shipments through the Strait.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">After Israel pounded Iran in a 12-day air war in June, joined by the US, both warned they would strike again if Teheran persisted with nuclear and ballistic missile programs. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/more-strikes-aimed-iran-after-supreme-leader-khameneis-death-trump-issues-new-warning",
            "pub_date": "2026-03-01 15:30:41",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iranian state media confirms Supreme Leader Ayatollah Ali Khamenei killed; Trump says strikes will continue",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[WASHINGTON/JERUSALEM/DUBAI/DOHA] Iran’s Supreme Leader Ali Khamenei was killed on Saturday (Feb 28), state media confirmed, after the US and Israel launched the most ambitious attack on Iranian targets in decades.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iranian state media announced Khamenei’s death early on Sunday. Khamenei was working in his office at the time of Saturday’s attack, state media said. A senior Israeli official told Reuters earlier that the Iranian leader’s body had been found after a strike and US President Donald Trump said the US worked closely with Israel to target the man who led Iran since 1989.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Experts said that while the deaths of Khamenei and other Iranian leaders would deal the country a major blow, it would not necessarily spell the end of Iran’s entrenched clerical rule or the Revolutionary Guards’ sway over the population.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran has called the strikes unprovoked and illegal and responded with missiles fired at Israel and at least seven other countries, including Gulf states that host US bases.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump, making the biggest foreign-policy gamble of his presidency after campaigning for reelection as a “peace president,” said the strikes were aimed at ending a decades-long threat from Iran and ensuring it could not develop a nuclear weapon.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Intelligence and tracking systems monitored Khamenei’s whereabouts, Trump wrote in a Truth Social post, adding that “there was not a thing he, or the other leaders that have been killed along with him, could do.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump reiterated calls for Iranians to topple the government but warned: “The heavy and pinpoint bombing, however, will continue, uninterrupted throughout the week or, as long as necessary to achieve our objective of peace throughout the Middle East and, indeed, the world!”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israeli Prime Minister Benjamin Netanyahu said Khamenei’s compound had been destroyed.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Three sources familiar with the matter said Iranian Defence Minister Amir Nasirzadeh and Revolutionary Guards commander Mohammed Pakpour were among those killed in the attacks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israel’s military said it had confirmed that five other senior military commanders were also dead, including Ali Shamkhani, an adviser to Iran’s supreme leader. Iranian media had said Khamenei’s daughter, grandchild, son-in-law and daughter-in-law were also killed.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Celebrations, fears among Iranians</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Witnesses said some Iranians took to the streets in Teheran, the nearby city of Karaj and the central city of Isfahan to celebrate after the reports of Khamenei’s death. Videos posted on social media, which Reuters was unable to immediately verify, also showed celebrations in other locations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The explosions during the strikes caused widespread panic across Iran. “We are scared, we are terrified. My children are shaking, we have nowhere to go, we will die here,” mother-of-two Minou, 32, said weeping as she spoke to Reuters by phone from the northern city of Tabriz.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran launched hundreds of missiles and drones in response to the attacks, but the Pentagon said there were no US deaths or injuries.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran warned that the Strait of Hormuz, the narrow passage through which around a fifth of global oil consumption passes, had been closed. Traders expected a sharp jump in oil prices. Airlines cancelled flights in the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israel’s military said some 200 fighter jets had completed the largest flying mission in its history, hitting 500 targets throughout Iran, including strategic defence systems already damaged in strikes last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A girls’ primary school in the southern Iranian town of Minab was hit, killing 85 people, according to a local prosecutor cited by state media. Reuters could not independently confirm the reports. Israel’s military did not immediately respond to a request for comment.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Trump cites ‘imminent threats’</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In a video message on social media early on Saturday, Trump said the aim of the military campaign, which the US Department of Defense named Operation Epic Fury, was “eliminating imminent threats from the Iranian regime.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Iranian people should “take over” governance of their country, Trump said in the video. “It will be yours to take,” he said. “This will be probably your only chance for generations.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israeli military operations over the past two years had already killed some of Iran’s senior military officials and severely weakened several of Teheran’s once-feared proxy forces across the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">After Israel pounded Iran in a 12-day air war in June, joined by the US, the US and Israel had warned they would strike again if Iran pressed ahead with its nuclear and ballistic missile programmes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Negotiations between US and Iranian officials took place as recently as Thursday, but senior US officials said on Saturday that Iran had not been willing to give up its ability to enrich uranium, which the Iranians argued they wanted for nuclear energy but US officials said would enable the country to build a nuclear bomb.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">During a United Nations Security Council meeting on Saturday, envoys from Russia and China criticised the US and Israel for launching the strikes while Teheran was negotiating with Washington. Russia’s UN envoy Vasily Nebenzya said Iran had been “stabbed in the back” and disputed the US claim that preventing Iran from acquiring a nuclear weapon justified the attacks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">UN Secretary-General Antonio Guterres called for an immediate cessation of hostilities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Trump also faced pushback at home from opposition Democrats, and a few of his fellow Republicans, who said a prolonged campaign against Iran would be illegal without congressional approval and that lawmakers should vote within days.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Missiles fired at Arab Gulf states</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil markets have been closely watching the standoff. Jorge Leon, head of geopolitical analysis at Rystad Energy, predicted prices could shoot up by US$10 to US$20 per barrel when markets open on Monday, if there is no sign of de-escalation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran, the third-largest producer in the Organization of the Petroleum Exporting Countries, pumps about 4 per cent of global oil supplies, and a far larger share is shipped past its coast through the strait leading out of the Gulf.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Israel, sirens and mobile-phone warnings sent Israelis rushing to air raid shelters as Iran launched a series of missile barrages that were mostly intercepted, though some missiles hit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Emergency teams in Tel Aviv treated at least 20 people hurt by a missile that hit a residential building, Israel’s ambulance service said. Photos from the scene showed one side of the multi-storey building blown out and its roof caved in.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Iran fired missiles at Abu Dhabi, Dubai and Doha, all key east-west aviation gateways.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Aviation sources had told Reuters that an overnight Iranian attack damaged an airport terminal in Dubai. One of the city’s plush hotel districts was also hit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Loud explosions sounded in Abu Dhabi, capital of the United Arab Emirates, an oil producer and close US ally.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nada AlGarhy, 30, said she and her husband had been at the Waldorf Astoria hotel on Dubai’s luxury Palm development for Iftar, the evening meal during the fasting month of Ramadan, when they heard a loud blast.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bahrain said the service centre of the US Fifth Fleet – the base for American naval forces in the region – had been subjected to a missile attack. Video footage showed a thick grey plume of smoke rising from near the island state’s coastline.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Qatar said it had downed all missiles targeting the country and that it had a right to respond. Kuwait confirmed a missile attack on a US military base there.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Teheran promised a stronger response to come, with a senior Iranian Revolutionary Guards commander, Ebrahim Jabbari, saying it had so far used only “scrap missiles” and would soon unveil previously unseen weapons. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/iranian-state-media-confirms-supreme-leader-ayatollah-ali-khamenei-killed-trump-says-strikes-will",
            "pub_date": "2026-03-01 15:10:41",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saying yes, for less: Why lab-grown diamonds have cornered 80% of the engagement ring market",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/saying-yes-less-why-lab-grown-diamonds-have-cornered-80-engagement-ring-market",
            "pub_date": "2026-03-01 14:36:40",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Liquidity and capital – institutional participation continues to broaden across SGX",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Ahead of the final session of February, Singapore Exchange (SGX)-listed stocks have been averaging S$1.7 billion in average daily turnover over the first two months of 2026. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Institutions have been net buyers across the industrials, real estate (excluding real estate investment trusts, or Reits), telecommunications, consumer cyclicals, technology (hardware and software), consumer non-cyclicals, and materials and resources sectors. Meanwhile, retail has been net buying the financial services, Reits, utilities, healthcare and energy/oil and gas sectors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Across recent SGX corporate actions and results last week, <!-- --> <!-- -->Valuemax Group<!-- --> <!-- --> broadened its institutional investor base via a 34.8 million share block trade, <!-- --> <!-- -->CapitaLand India Trust<!-- --> <!-- --> (Clint) executed a S$150 million placement (2.6 times covered) to fund Bengaluru developments, and <!-- --> <!-- -->Marco Polo Marine<!-- --> <!-- --> received SGX approval for an equity placement and operational momentum to support growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"> <!-- -->iX Biopharma<!-- --> <!-- --> completed a placement on Feb 24, issuing 75.8 million new shares to raise gross proceeds of S$15 million. The placement was undertaken to strengthen liquidity and fund upfront working capital requirements for a newly secured US government contract, bridging the timing gap between project expenditures and reimbursement receipts to reduce execution risk.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The placement was conducted via an exempt offering to institutional and accredited investors, with no participation from directors or substantial shareholders.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Last week’s beachheads also illustrate how issuers are pairing shareholderbase initiatives with balance sheet funding and earnings delivery.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Valuemax </h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Valuemax Group’s executive chairman Yeah Hiang Nam and his spouse Tan Hong Yee sold 34.8 million existing shares via a block trade at S$1.16 per share, representing a 6.5 per cent discount to the previous closing price. This reduces their total interest to 81.53 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The sale attracted strong participation from long-only institutional investors, and was handled by OCBC as placement agent. Following the transaction, the vendors still control about 81.5 per cent of the company and have committed to a 90-day moratorium on further share sales, signalling continued commitment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The block trade was undertaken to diversify and institutionalise the shareholder base, improve free float and trading liquidity, and support potential index inclusion, with no dilution since no new shares were issued. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Long-only institutional investors that participated in the block trade included abrdn Asia, Amova Asset Management Asia, Avanda Investment Management and ICH Synergrowth Fund.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Valuemax Group is one of Singapore’s largest pawnbroking and jewellery retail chains, complemented by a substantial secured and unsecured money-lending business and gold trading operations across Singapore and Malaysia. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group delivered record financial performance in FY2024 (ended Dec 31) and then again in FY2025 with profit after tax surpassing S$100 million for the first time at S$103.6 million. This was driven by strong growth across its pawnbroking, jewellery retail and money-lending businesses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reflecting on the improved earnings, the board proposed a total dividend of S$0.0388 per share, a 44.8 per cent increase year on year, alongside a strengthened balance sheet with net assets of S$611.8 million and a conservative 1.43 times debt-to-equity ratio.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The average daily turnover of the stock has grown from S$39,000 in 2024 to S$190,000 in 2025 to S$799,000 in Q1 2026 to Feb 25.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Despite more than S$17 million of net institutional outflows from Singapore-listed consumer cyclical stocks in January, Valuemax Group was one of three gold-linked financial retailers that bucked the trend, attracting a combined S$8.5 million of inflows.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">CapitaLand India Trust</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Feb 24, Clint announced a fully underwritten private placement that subsequently raised about S$150 million through a private placement of 124.2 million new units at S$1.208 each, which was around 2.6 times covered, reflecting strong institutional demand. The issue price represented a modest discount to market volume weighted average price, balancing investor appeal with capital discipline.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On an illustrative historical pro forma basis, the trustee-manager expects the placement to be distribution per unt (DPU)-accretive by 5.1 per cent and to reduce gearing to 36.8 per cent after deployment of proceeds, while also potentially improving trading liquidity through a larger unitholder base.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025 (ended Dec 31), Clint’s DPU increased 15 per cent from FY 2024, to S$0.0787, while H2 FY2025 DPU rose 22 per cent to S$0.0390, supported by improved operating performance and higher interest income from forward purchase assets under development. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The valuations as at Dec 31 reported a 19 per cent year-on-year increase in Clint’s portfolio property value to 266.4 billion rupees (S$3.8 billion) on a like-for-like basis, excluding the divestments of CyberVale, Chennai and CyberPearl, Hyderabad.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The management said disciplined capital recycling, a visible development pipeline and balance sheet optimisation position the trust to support steady and resilient growth into FY 2026 and beyond.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Marco Polo Marine</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Feb 24, Marco Polo Marine announced a proposed placement of up to 144.9 million new shares at S$0.145 apiece, raising up to about S$21 million in gross proceeds. With Maybank Securities as placement agent, the new shares represent about 3.9 per cent of existing issued share capital. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Net proceeds are intended to be used entirely for capex tied to business expansion, including but not limited to fleet expansion and renewal, and the placement also aims to broaden the shareholder base to potentially improve liquidity; it is offered to institutional and accredited investors and excludes directors and substantial shareholders.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Marco Polo Marine highlighted that the placement has a positive impact on net tangible assets (NTA) per share, as the new equity is being raised at a premium to existing net assets. With the S$0.145 placement price sitting well above the S$0.0636 NTA per share, the issuance lifts NTA per share to S$0.0664 cents on a pro forma basis. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As a result, the equity injection more than offsets dilution, lifting net tangible assets per share even as earnings are diluted, and strengthening the balance sheet ahead of planned fleet expansion. As at Sep 30, the group was already in a net cash position of S$9.3 million, providing balance-sheet flexibility even before the placement.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Feb 16, Marco Polo Marine reported a strong start to its FY2026 (ended Dec 31), with Q1 FY2026 revenue rising 27 per cent, from Q1 FY2025, to S$32.8 million. This was primarily driven by a sharp expansion in its ship chartering operations following recent fleet additions. Gross profit for the quarter increased 32 per cent to S$14 million, with gross margin improving by two percentage points to 43 per cent. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that this reflected a more favourable revenue mix with a higher contribution from chartering, which carries structurally higher margins than shipyard activities. Moreover, the ship chartering segment drove Q1 FY2026 growth, with revenue rising 53 per cent year on year to S$23.2 million. This was supported by the deployment of the CSOV MP Wind Archer flagship and three additional crew transfer vessels, which lifted fleet utilisation to around 76 per cent from 71 per cent amid sustained offshore wind demand. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In February, the CSOV MP Wind Archer won the Offshore Energy Vessel of the Year Award 2026, at the Annual Offshore Support Journal Conference, Awards and Exhibition in London.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Marco Polo Marine also said that FY2026 will see a full-year contribution from the CSOV and three crew transfer vessels, compared with partial contributions in FY2025, supporting stronger topline and earnings momentum. The group also expects two new anchor handling tug supply vessels to join the fleet in 2026, expanding capacity and optionality across oil and gas, and offshore wind.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Marco Polo Marine’s pivot from shipbuilding and repair to ship chartering has more than doubled the latter’s contribution to the topline over the past decade. The Q1 FY2026 revenue mix of 71 per cent chartering and 29 per cent shipyard compared with less than 40 per cent and more than 60 per cent respectively in FY2016, underscoring the structural shift in the business. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Even so, the shipbuilding segment remains meaningful, anchored by an NT$4.68 billion (S$188 million) contract to build a 4,000 gross tonnage oceanographic research vessel for Taiwan’s National Academy of Marine Research. It is the largest shipbuilding project undertaken by the group to date.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Feb 19, Maybank Research maintained its “buy” call on the stock with a S$0.20 target price, citing a multiyear growth phase from FY2026 to FY2030 driven by fleet expansion, offshore wind exposure and potential shipbuilding wins. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Maybank’s head of small-mid caps research, Jarick Seet, sees Q1 FY2026 as the start of a seasonal uptrend, with Q2 FY2026 expected to beat Q1 FY2026, and Q3 FY2026 likely the peak given seasonality and rising utilisation, before a typical softening in Q4. The average daily turnover of the stock has grown from S$467,000 in H1 2025 to S$3.2 million in H2 2025 to S$6.4 million in Q1 2026 to Feb 25. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>The writer is the market strategist at SGX. To read SGX’s market research reports, visit </strong><em><strong>sgx.com/research</strong></em></p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/liquidity-and-capital-institutional-participation-continues-broaden-across-sgx",
            "pub_date": "2026-03-01 14:31:22",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}