{
    "data": [
        {
            "title": "Yangzijiang Shipbuilding rises nearly 10% on higher H2 profit",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Shares of Yangzijiang Shipbuilding rallied on Friday (Feb 27) morning after the Chinese vesselmaker posted higher earnings for its second half. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The counter climbed as much as S$4.31 in early trade, 9.9 per cent or S$0.39 higher than Thursday’s closing price of S$3.92. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at 9.17 am it had eased to S$4.26, up 8.7 per cent or S$0.34 with close to 20.6 million shares changing hands. It was one of the top traded counters on the stock exchange by volume. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company on Wednesday posted a 24.6 per cent rise in net profit to 4.5 billion yuan (S$827.4 million) for its second half ended Dec 31, from 3.6 billion yuan in the corresponding year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This brought its FY2025 earnings to 8.6 billion yuan, 30.2 per cent higher than the previous year’s 6.6 billion yuan. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/yangzijiang-shipbuilding-rises-nearly-10-higher-h2-profit",
            "pub_date": "2026-02-27 09:40:47",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seatrium delivers wind turbine installation vessel to Maersk Offshore Wind for Empire Wind project",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Seatrium has delivered a wind turbine installation vessel to its customer, Maersk Offshore Wind, which will facilitate the development of a wind farm. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The vessel, which was built and custom-engineered by Seatrium for the purpose of installing some of the world’s largest offshore wind turbines, is due to set sail in March for its first assignment at the Empire Wind project located off the coast of New York.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There, it will play a pivotal role in the project, in advancing the wind farm’s mission to deliver clean and reliable energy to 500,000 homes, said the offshore and marine specialist on Friday (Feb 27). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">William Gu, executive vice-president of Seatrium Energy (Marketing), noted that the vessel represents a “major step forward” for the global offshore wind sector.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are proud to deliver this unique vessel to our partner, Maersk Offshore Wind, to advance the progress of the end customer’s wind farm development,” Gu said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The vessel’s delivery on Thursday comes after the completion of sea trial activities and final readiness evaluations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Seatrium noted that the next-generation vessel has a feeder-based installation design that enhances operational efficiency, as it is equipped with a stabilising system that can hold feeder vessels for the transfer of offshore wind components in high sea states.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This feature improves installation efficiency by extending the operational weather window, Seatrium said. This ensures the vessel can carry out uninterrupted installations, improves operational efficiency and reduces total cost and time of installation. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the feeder-based installation solution design feature is compliant with the US Jones Act and can also be deployed in other geographies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Seatrium shares closed Thursday 3.2 per cent higher at S$2.28, before the news.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/seatrium-delivers-wind-turbine-installation-vessel-maersk-offshore-wind-empire-wind-project",
            "pub_date": "2026-02-27 09:35:44",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell expects AI server revenue to double in fiscal 2027 on data centre boom",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BENGALURU] Dell said that it expects revenue from its key artificial intelligence (AI)-optimised servers business to double in fiscal year 2027 and promised to return more cash to shareholders, sending its shares surging 10 per cent in extended trading.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company announced a 20 per cent hike in its cash dividend and an additional US$10 billion for its share repurchase programme. Big tech firms, such as Alphabet, Microsoft, Amazon, and Meta, are expected to spend at least US$630 billion to build AI infrastructure this year, which would boost demand for server and data centre equipment from vendors such as Dell and rival Super Micro Computer.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US trade regulations and surging memory chip costs due to the AI infrastructure buildout have forced companies such as Dell and HP to implement price increases, which are helping them offset cost pressures. Almost all servers have memory chips that hold data and instructions, keeping processors running at high speed, which is paramount for AI applications.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Initially, infrastructure clients experienced “sticker shock” but quickly grasped the supply constraints, shifting their focus to securing necessary components, which led large customers to aggressively acquire supply for their AI servers, traditional servers, and storage build-outs, Dell chief operating officer Jeff Clarke said on a post-earnings call.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company raised server prices on Dec 10, while price changes for PCs occurred on Jan 6, Clarke said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell expects AI server revenue to grow 103 per cent to about US$50 billion in fiscal 2027.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company said that it has more than 4,000 AI server customers, including Elon Musk’s AI startup xAI and CoreWeave.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell forecast annual revenue of US$138 billion to US$142 billion, above analysts’ average estimate of US$125.54 billion, according to data compiled by LSEG. The memory chip squeeze is expected to dampen global demand for consumer electronics, including PCs, smartphones, and gaming consoles. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HP said that it expected fiscal 2026 results to be at the low end of its prior forecasts, while China’s Lenovo warned about mounting pressures on PC shipments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“By proactively addressing rising memory costs, and demonstrating early success reflected in both its fiscal first quarter results and full-year guidance, the company showed it is getting ahead of a challenge that continues to pressure peers,” said Hendi Susanto, a portfolio manager and research analyst at Gabelli Funds, which holds Dell shares.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell expects annual adjusted earnings per share (EPS) of US$12.90, above estimates of US$11.59.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the first quarter, Dell expects revenue between US$34.7 billion and US$35.7 billion, above estimates of US$29.13 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The first-quarter adjusted EPS forecast of US$2.90 exceeded estimates of US$2.37.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It reported record revenue of US$33.4 billion in the fourth quarter, beating estimates of US$31.73 billion. Its adjusted EPS of US$3.89 also exceeded the US$3.53 estimate.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell’s revenue from its infrastructure solutions group, which includes its storage, software, and server offerings, jumped 73 per cent to US$19.60 billion, while sales from the client solutions group, home to PCs, rose 14 per cent to US$13.49 billion. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/dell-expects-ai-server-revenue-double-fiscal-2027-data-centre-boom",
            "pub_date": "2026-02-27 09:35:43",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anil Ambani’s US$410 million Mumbai condo seized in probe",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[MUMBAI] Indian investigators seized a US$410 million luxury condominium building owned by Anil Ambani as part of a widening probe into alleged bank fraud by the tycoon.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Enforcement Directorate, India’s anti-money laundering agency, said on Wednesday (Feb 25) that it had provisionally taken Ambani’s 17-storey property, known as “Abode”, in the upscale Pali Hill neighbourhood. The agency alleged Ambani has defaulted on over 400 billion rupees (S$4.4 billion) worth of loans from Indian and foreign banks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ambani, 66, runs Reliance Group and is the younger brother of Mukesh Ambani, Asia’s richest man. The two split the empire after their father’s death in 2002. Anil Ambani has faced financial distress for years, defaulting on bank loans and other debt since at least 2016. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Most recently, his name surfaced in documents related to Jeffrey Epstein, which showed that he had met the disgraced financier on several occasions to discuss business, politics and women.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The federal agency said the home was transferred into a private family trust in a restructuring designed to “shield it” from Ambani’s personal liabilities, mainly claims tied to guarantees he had given to bankers for company loans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reliance Group, which is separate from Mukesh Ambani’s Reliance Industries, did not respond to requests for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ambani “fraudulently mis-utilised” a substantial amount of borrowed funds into various privately held companies and personal investments, according to the agency’s November attachment order. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">So far, properties worth over 157 billion rupees have been seized, all linked to Anil Ambani’s Reliance Communications. A separate probe into alleged bank fraud and defaults by other group entities, including shadow banks previously owned by Ambani, is underway, the agency said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, India’s Central Bureau of Investigation (CBI) conducted searches at Ambani’s office and residence in a separate case, the federal law enforcement agency said in a statement on Thursday. The CBI has registered a second case against Ambani following a complaint from Bank of Baroda, alleging conspiracy, cheating and criminal misconduct, according to the statement.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Indian banks, led by the country’s largest lender, State Bank of India, classified Reliance Communications as a fraud account in July last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ambani appeared before the federal anti-money laundering agency on Thursday for a second round of questioning, according to a Press Trust of India report.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this month, India’s Supreme Court directed the Enforcement Directorate to set up a special investigations team for a deeper probe into various allegations of fraud involving Ambani’s companies. The next hearing is due on Mar 10.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As Ambani’s troubles mounted over the years, he sought to raise funds by selling assets and subsidiaries, while lenders and creditors eventually pushed the telecom arm and his shadow banking businesses into insolvency proceedings. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/anil-ambanis-us410-million-mumbai-condo-seized-probe",
            "pub_date": "2026-02-27 09:21:17",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CapitaLand Ascendas Reit enters Spain with S$185.4 million logistics portfolio acquisition",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] CapitaLand Ascendas Reit (Clar) made its maiden entry into the Spanish market, acquiring a portfolio of six Grade A logistics assets for S$185.4 million, the real estate investment trust’s (Reit) manager announced on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The portfolio comprises two logistics assets in Madrid and four in Barcelona.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The acquisition is expected to be distribution per unit (DPU) accretive for unitholders, the Reit manager said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On a pro forma basis, assuming the deal had been completed on Jan 1, 2025, the DPU accretion is estimated at S$0.00014, representing a 0.1 per cent increase.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The S$185.4 million price represents a 5.9 per cent discount to the portfolio’s independent market valuation of S$197 million as at Oct 31, 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The manager noted that the first-year net property income yield is expected to be 6.3 per cent before transaction costs and 6.5 per cent after costs.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Strategic push into Spain</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The portfolio comprises 98,825 square metres of Grade A space, consisting of:</p><ul class=\"list-outside list-disc mb-4 md:mb-6 [&amp;&gt;ul]:list-outside [&amp;&gt;ul]:list-decimal [&amp;&gt;ul]:pl-8 pl-8 md:pl-8\" data-testid=\"article-list-bulleted-component\"><li class=\"whitespace-pre-wrap text-xl\">Madrid (two assets): Located in Torrejon de Ardoz, these properties are situated along the A-2 highway and are within 15 minutes of Madrid’s international airport.</li><li class=\"whitespace-pre-wrap text-xl\">Barcelona (four assets): Located in Sant Feliu de Buixalleu, these assets sit near the AP-7 motorway, a key transport artery in Spain.</li></ul><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The portfolio is fully occupied, and features a weighted average lease to expiry of 9.1 years with index-linked rental adjustments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our first acquisition in Spain deepens Clar’s presence in the United Kingdom/Europe and enhances the scale, quality and geographic diversification of our logistics portfolio,” said William Tay, chief executive officer of the manager.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Funding</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Clar is expected to incur a total investment cost of S$181 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The transaction was financed through internal resources and existing debt facilities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Following the acquisition, Clar’s aggregate leverage will increase marginally to 39.1 per cent from 39 per cent as at Dec 31, 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The acquisition aligns with our disciplined investment strategy of acquiring modern, well-located assets in developed markets with healthy fundamentals,” said Tay.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The addition of the Spanish assets raises the proportion of logistics properties in Clar’s total S$18.5 billion portfolio to 26 per cent, up from 24 per cent at the end of last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Units of Clar ended 0.4 per cent or S$0.01 higher at S$2.70 on Thursday. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/capitaland-ascendas-reit-enters-spain-s185-4-million-logistics-portfolio-acquisition",
            "pub_date": "2026-02-27 09:15:46",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI and accountancy: Evolution or elimination?",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHENEVER a new wave of technology emerges, the same question follows: Will this <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/opinion-features/pursue-responsible-ai-growth-business-leaders-must-address-labour-displacement\" target=\"_blank\">replace jobs</a>?</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With artificial intelligence (AI), that question feels more urgent. AI can scan thousands of transactions in seconds. It can detect patterns humans might miss. Understandably, people are asking whether <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-why-singapores-white-collar-ai-training-drive-starting-law-and-accounting\" target=\"_blank\">accountants</a>, especially junior ones, will become obsolete. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From the lens of the Institute of Singapore Chartered Accountants (Isca), that is not where the profession is heading.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/ai-and-accountancy-evolution-or-elimination",
            "pub_date": "2026-02-27 09:15:45",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore’s Parf rebate cut likely to drive up EV sales, but financial and infrastructure hurdles linger",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Budget 2026 delivered a shock to the automotive sector through <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-parf-rebate-changes-could-boost-ev-adoption-and-coe-renewals-dampen-luxury-car-sales\" target=\"_blank\">a 45-percentage-point slash</a> to the preferential additional registration fee (Parf) rebate.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">By drastically lowering the scrap value of internal combustion engine (ICE) cars, the policy effectively acts as a heavy disincentive for petrol car ownership, steering buyers toward electric vehicles (EVs). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">EVs made up 45 per cent of <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/evs-made-record-45-new-car-registrations-singapore-2025\" target=\"_blank\">new registrations in 2025</a>, up from 34 per cent in 2024 and 18.2 per cent in 2023. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Not only that, in the first Certificate of Entitlement (COE) bidding session following the Parf cut, mainstream car premiums rose <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/coe-mainstream-car-premium-exceeds-large-cars-first-time-almost-6-years\" target=\"_blank\">higher than large-car premiums</a> for the first time in almost six years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Automotive consultant Say Kwee Neng attributed that to the “supercharged” Chinese dominance in the EV category.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But although policy levers are accelerating the EV transition, the market might be flashing warning signs. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/transport-logistics/more-singapore-drivers-plan-return-petrol-cars-ev-interest-dips-ey-study\" target=\"_blank\">January EY study</a> revealed that nearly a third of Singapore respondents plan to purchase an ICE vehicle in the next two years, an increase from about a quarter in 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This suggests that while early adopters are flocking to EVs, Singapore’s wider green-mobility ambitions could be colliding with an illiquid secondary EV market, structural power-grid constraints and a fractured daily charging infrastructure.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lars Nielsen, managing director at BMW Asia, said in an earlier interview: “Once (government incentives) are over or not the main driver anymore, then it’s really your daily life with the product.”  </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Frozen resale market</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Singapore, one of the most expensive places in the world to own a car, vehicles are treated as a financial asset class. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The rest of the world is speculating in crypto; Singaporeans are speculating in COEs,” Nielsen had joked.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, the secondary market for EVs is currently struggling to digest the influx of vehicles, upending the traditional financial math for buyers. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ng Lee Kwang, managing director of new and used car dealer Octagon Motors, noted that used petrol cars typically sell in six weeks to three months, but that his network suggests dealers are having to budget up to six months to move a used EV.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hesitance over battery technology becoming outdated means that some dealers now refuse to absorb inventory risk, and opt to take used EVs only on consignment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This uncertainty is exacerbated by new market entrants’ aggressive pricing strategies, which can wipe out a car’s resale value overnight.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For some high-net-worth buyers, the lower entry prices of mass-market EVs have turned them into novelty purchases for which steep depreciation is simply an afterthought.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ng noted that some wealthy individuals in his circle are buying affordable EV models like the BYD Sealion “just for fun” or to “try it out” – all while keeping their luxury petrol sports cars at home. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Insulated by their wealth, these buyers are largely unbothered by volatile EV resale values or the slashed Parf rebates, he added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Not only that, the end of a 10-year COE cycle brings steep hidden costs. Ng said that specialised disposal companies now charge between S$2,000 and S$3,000 just to scrap an old high-voltage battery. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With the Parf rebate now slashed, owners can no longer rely on a robust government payout to cushion these “end-of-life” expenses for their vehicles.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Even day-to-day operating savings are increasingly heavily scrutinised. Some drivers hail the lower cost of electricity relative to petrol, but others are finding the ledger balanced out by punitive administrative fees. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">N Meenakshi Sundaram, a procurement manager,  recently switched from a diesel BMW to an electric BYD Atto 3, and is finding that the operational savings are entirely offset by higher annual EV road taxes and insurance premiums.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“If you think about the road tax and everything, it’s cut to square,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Soh Ming, Singapore managing director of Chinese EV maker Dongfeng, countered that the used EV market’s current volatility reflects “rapid model turnover rather than a structural weakness in EV residual values”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Because EVs rely more on upfront green rebates than back-end Parf rebates, their depreciation curves are less affected by the Budget 2026 cuts, narrowing the lifecycle cost gap against petrol cars, he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Still, he admitted that the loss of a guaranteed scrap value remains a psychological hurdle. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The transition will be more about changing how value is framed, from ‘what I get back at the end’ to ‘what I spend each month’,” he said. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Potential gridlock</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Beyond the financial friction, EV adoption faces a hard physical ceiling. The current battery-charging landscape dictates that the EV lifestyle is highly dependent on housing type. EV owners living in condominiums and HDB estates need to share charging stations; those living in landed property have the luxury of personal charging points in their own homes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For private condominium resident Ashit Arora, who switched from a petrol Kia Cerato to a GAC Aion V electric crossover, the EV transition has been largely seamless. Residents in his estate, owning 20 to 30 EVs among them, share six chargers; they use an app to check on the availability of charging stations from the comfort of his living room. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A full charge costs him S$33, about 40 per cent less than a tank of petrol.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The reality is different for the majority of the market, however. As at last November, about 57 per cent of car-owning households were living in public HDB flats.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sundaram, who lives in an HDB flat, said EV owners in three blocks of flats in his estate now share just three chargers – and slow ones at that.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“If more (EVs come in), then we will fight each other,” he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Such issues are compounded by the rapid electrification of commercial fleets and private-hire vehicles. Dongfeng’s Soh noted, however, that while these high-mileage drivers increase charger utilisation and friction in the short term, they also strengthen the commercial case for a faster rollout of charging infrastructure. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ultimately, for mass-market buyers, “predictability matters more than the absolute number of chargers”, Soh said, calling reliable, overnight home-charging in HDB estates the “key unlock” for private ownership.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Last October, Acting Minister for Transport Jeffrey Siow disclosed that of the 25,000 EV charging points islandwide, more than 7,500 have been installed in about 85 per cent of HDB carparks. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are also on track to achieve our earlier target of deploying 60,000 charging points by 2030,” he had said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, Octagon Motors’ Ng believes that the national power grid’s capacity to handle mass charging might be a concern.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He suggested that it could be structurally impossible to outfit three-quarters of all 6,800 HDB multi-storey carparks with EV chargers without overwhelming local substations – and that Singapore’s pure EV population may top out at 50 to 55 per cent, with hybrids making up the rest.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The government is already bracing itself for this pressure. Minister-in-charge of Energy and Science and Technology Tan See Leng said last October that Singapore is taking measures to <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/esg/singapore-future-proofing-its-grid-meet-higher-energy-demand-evs-data-centres\" target=\"_blank\">“future-proof” its power grid</a> as demand from EVs and data centres increases. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Consequently, the Energy Market Authority (EMA) is working with transport operator ComfortDelGro on a 13-month sandbox to automatically adjust EV charger energy consumption in response to real-time power system needs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The EMA website also states that it is working with the Land Transport Authority to “study the long-term electrical infrastructure needs” for EV charging. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The energy regulator said that preliminary findings indicate that upgrades will be needed for the consumer intake substations at the local level, the distribution grid network, as well as power generation. These upgrades will be implemented over the “next two decades”.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Quality-of-life friction</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Charging limits compound daily consumer friction. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dr Bimlesh Wadhwa, a professor at the National University of Singapore (NUS) who has owned a Hyundai Ioniq 5 EV for over two years, said that the straightforward petrol run has been replaced by a fractured tech ecosystem requiring multiple apps, a range of payment gateways and frustration over unstable Wi-Fi in underground carparks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">To scale properly, she suggested that the charging infrastructure must reach “the vending machine level of usability” – to the point that a driver can simply tap a card, pay, and walk away.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Still, with EV chargers located closer to her NUS residence than petrol pumps, her experience of driving out to charge her car has not been too dissimilar from petrol runs with her previous car.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But such daily friction for others, combined with battery range anxiety, explains why automakers foresee a moderation in the EV sector. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ritu Chandy, head of sales for BMW in the Asia-Pacific, Eastern Europe, Middle East and Africa, told <em>The Business Times</em> in an earlier interview that she expects a potential plateau in EV sales, now that the initial wave of early adopters has bought in.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pushing EV adoption past its current tipping point will thus likely require the broader support ecosystem to catch up to government mandates. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With a significant chunk of prospective buyers still hesitant, the next phase of Singapore’s green transition will no longer be driven by early adopters willing to overlook growing pains. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Instead, mass-market success will ultimately be dictated by the government’s ability to unlock neighbourhood charging for the public housing majority, and unfreeze an illiquid secondary asset market.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Additional reporting by Derryn Wong</strong></p></div>",
            "link": "https://www.businesstimes.com.sg/singapore/singapores-parf-rebate-cut-likely-drive-ev-sales-financial-and-infrastructure-hurdles-linger",
            "pub_date": "2026-02-27 09:10:38",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong’s Budget is back in the black – but not without sacrifice",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">THE dice are finally rolling in Hong Kong’s favour again.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With good timing and some skilled accounting, including civil service job cuts and education funding reductions, Financial Secretary Paul Chan has brought the city out of the red three years earlier than expected.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hong Kong will post a fiscal surplus of HK$2.9 billion (S$469 million) for the 2025/2026 financial year that concludes on Mar 31, Chan announced in his Budget speech on Feb 25.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It is a significant turnaround from the HK$67 billion deficit he forecast only 12 months ago – and a reminder that a lot can change in a city’s financial situation in the short span of a year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The good news – after a three-year streak of large deficits initially expected to end only in 2028 – is thanks largely to an asset market boom and the government’s austerity measures.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The global environment has remained volatile, and Hong Kong has continued to undergo economic transformation,” Chan said. “Yet, Hong Kong has always thrived amid changes and progressed through innovation... Our economy has recalibrated its course and is advancing steadily.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He projected that Hong Kong’s economy will grow by 2.5 to 3.5 per cent in 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gross domestic product rose by a surprisingly strong 3.5 per cent in 2025, in a third straight year of growth after the city’s stretch in the doldrums from social unrest and the Covid-19 pandemic.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Between 2027 and 2030, it is expected to expand by an annual 3 per cent in real terms. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Economic sentiment in Hong Kong has improved markedly.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2025, home prices rose for the first time in four years, with banks now forecasting double-digit gains in property values for 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The benchmark Hang Seng Index ended 2025 up a whopping 28 per cent, and has risen a further 4 per cent so far in 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Initial public offerings (IPOs) have jumped, too, with the listing of more than 110 companies raising US$37 billion (S$47 billion) in 2025, and 100 more in the pipeline for 2026 so far.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Retail sales have also eked out gains for eight straight months, as the city welcomed 12 per cent more visitors in 2025, compared with the preceding year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">All these factors enabled Hong Kong to achieve an operating account surplus through its taxes collected. The capital account remains in deficit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The operating account covers the government’s short-term expenses to keep it running, while the capital account is for long-term investments to drive the city’s development and growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The consolidated amount comes up to a HK$2.9 billion surplus, which also includes bond sale proceeds that the government will have to repay when the bonds come due.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Fiscal reserves will reach HK$657.2 billion by the end of March 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hong Kong’s economic growth and improved financial situation – another HK$22.1 billion surplus is expected in the 2026/2027 fiscal year – allow Chan greater flexibility to invest in the city’s future.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Among his key measures, some HK$30 billion will go towards accelerating artificial intelligence (AI) adoption and developing the Northern Metropolis border tech hub near Shenzhen.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The finance chief will lead a new committee to facilitate AI use across industries, with an initial focus in biotech and smart robot technology. Societal initiatives will provide training for people and integrate AI into public service systems, including for traffic management and flood control.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The government is taking such an active role in investing so much into tech and AI because Hong Kong needs new growth pillars that can produce high profit margins and provide high value-added jobs,” economist Billy Mak told <em>The Straits Times</em> (ST).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The AI push is also a part of China’s broader strategic direction.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hong Kong is in the midst of formulating its first five-year plan to align its policies with Beijing’s 15th five-year plan.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The city’s big investments in its future – even in the face of existing constraints from its capital account deficit – will pay off given time, said Mak, an associate professor at Hong Kong Baptist University.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The investments can add to Hong Kong’s GDP, bringing returns in the form of corporate earnings, public listings and tax revenue in the long run.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Additionally, businesses and residents will enjoy a tax reduction on their profits and salaries, potentially increasing Hong Kong’s appeal to international firms and talents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But the funds for these expenses do not come without sacrifices.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While the city’s operating account is now in the black, the authorities have, over the past year, slashed funding for schools, clawed back university grants, cut budgets for social services, and raised public hospital fees for some.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some 10,000 jobs will also be axed in the civil service, which employs roughly 4.5 per cent of the city’s 3.8 million-strong workforce.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The government will cut recurrent expenditure by another 2 per cent over the next two fiscal years.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It is also set, for the first time in 40 years, to tap its Exchange Fund, which serves as the last line of defence to maintain the Hong Kong dollar’s peg against the US currency.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The government will transfer HK$150 billion from the fund’s profit account to support the development of the Northern Metropolis and other infrastructure projects.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ken Ip, associate director of Saint Francis University’s Innovative Incubation Centre, noted that the government had become more deliberate in its budget resource allocation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It appears to be shifting from relying heavily on land revenue, towards a more balanced approach that combines fiscal discipline with strategic investment in industry and infrastructure,” Ip told ST.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Resources are being channelled into technology, financial innovation and industrial policy rather than across-the-board expansion of recurrent spending.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The budget’s “striking” swing from an initially expected HK$67 billion deficit to a HK$2.9 billion surplus reflects the economy’s cyclical recovery more than any kind of structural reinvention, he added.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The key question is durability. If growth remains asset-market dependent, volatility will return. If diversification efforts succeed, this year’s rebound could mark a genuine fiscal reset,” Ip said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The real test will be whether the economy five years from now is more diversified and less exposed to asset cycles.” <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.straitstimes.com/asia/hong-kongs-budget-is-back-in-the-black-as-the-odds-tip-in-citys-favour\" target=\"_blank\">THE STRAITS TIMES</a></p></div>",
            "link": "https://www.businesstimes.com.sg/international/hong-kongs-budget-back-black-not-without-sacrifice",
            "pub_date": "2026-02-27 09:05:38",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK consumer confidence falls amid fear of job losses: survey",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] UK consumer confidence declined for the first time in three months as rising unemployment and stretched household budgets loomed over the economic outlook.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">GfK said on Friday (Feb 27) that its sentiment gauge fell three percentage points to minus 19 in February, with Britons less willing to splash out on big-ticket items amid growing pessimism about their personal financial prospects.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The survey suggests caution is once again gripping British consumers, whose spending contributes around 60 per cent of economic output. GfK’s headline confidence barometer has erased all the gains made since November, when Chancellor of the Exchequer Rachel Reeves’ decision to refrain from raising broad-based taxes lifted the public mood.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Relief is now giving way to renewed unease, with unemployment at a five-year high and forecast to climb further. Neil Bellamy, consumer insights director at GfK, warned that “this is increasing concerns about job security, particularly given the backdrop of weak wage growth”. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Bank of England (BOE) policymakers are closely watching the consumer picture as they debate when, and whether, to cut interest rates again. Catherine Mann, one of the BOE’s most hawkish voices, recently said she’s examining whether it’s the fear of job losses, rather than price pressures, that is keeping households reluctant to spend.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Fewer households on balance thought now is the right time to make major purchases, while an index tracking their personal financial outlook fell the most in almost a year, GfK said. Far more expected the economy as a whole to get worse than improve over the next year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Unemployment worries are rising rapidly among young people in particular, GfK’s data showed, as the youngest workers are bearing the brunt of the UK’s jobs crisis. The number of 16 to 24-year-olds left out of work and education climbed to almost one million at the end of last year, data on Thursday showed.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“With fewer entry-level opportunities available, those on lower incomes are already feeling the strain, and this trend risks undermining the typically more optimistic outlook held by younger age groups,” Bellamy said. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/uk-consumer-confidence-falls-amid-fear-job-losses-survey",
            "pub_date": "2026-02-27 09:05:37",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Board of Peace: Bold vision, uncertain future",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN US President Donald Trump announced the formation of the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/global/billion-dollar-membership-fee-what-know-about-trumps-board-peace-gaza\" target=\"_blank\">Board of Peace</a> in October 2025, many dismissed it as theatrical diplomacy – another headline-grabbing gesture dressed up in superlatives.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As representatives from more than 40 nations <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/over-20-countries-will-attend-trumps-board-peace-meeting-feb-19-white-house\" target=\"_blank\">gathered</a> at the US Institute of Peace in Washington for the board’s inaugural meeting on Feb 19, it became harder to wave it away entirely. But it also became harder to take it entirely at face value. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">What emerged from the day’s proceedings was a portrait of something genuinely unprecedented: an international body that is equal parts promising and problematic, visionary and vague.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/board-peace-bold-vision-uncertain-future",
            "pub_date": "2026-02-27 09:05:36",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}