{
    "data": [
        {
            "title": "Opec+ to raise oil output slightly even as US war on Iran disrupts shipments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON/MOSCOW] Opec+ has agreed in principle to a modest oil output increase on Sunday (Mar 1), five sources from the bloc said, after the US-Israeli war on Opec+ member Iran and Teheran’s retaliation led to shipment disruptions in the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ a history of raising oil output to cushion disruptions. But analysts said the group currently has little spare capacity to add to supply, except for its leader Saudi Arabia and the United Arab Emirates (UAE), which will also struggle to export oil until navigation in the Gulf returns to normal. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riyadh has been raising oil production and exports in recent weeks in preparation for US strikes on Iran, sources said. Oil, gas and other shipments from the Middle East via the Strait of Hormuz have come to a halt since Saturday after shipowners received a warning from Iran saying the area was closed for navigation. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ has agreed in principle to raise production by 206,000 barrels per day (bpd) after having debated options ranging from 137,000 bpd to 548,000 bpd, the five sources said on Sunday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil prices jumped on Friday to US$73 per barrel, the highest level since July, on fears of a wider conflict in the Middle East and supply disruptions through Hormuz, the world’s most important oil route amounting to more than 20 per cent of global oil transit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Middle East leaders have warned Washington that a war on Iran could lead to oil prices jumping to over US$100 per barrel, said veteran Opec analyst Helima Croft from RBC. Analysts from Barclays also said prices could rise to US$100.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Croft said the market impact from any large Opec output increase will be limited due to a lack of actual production capabilities outside Saudi Arabia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The meeting on Sunday involved only eight members of Opec+ – Saudi Arabia, Russia, the UAE, Kazakhstan, Kuwait, Iraq, Algeria and Oman. Opec+ groups the Organization of the Petroleum Exporting Countries and allies such as Russia but most production changes in the past years have been done by the eight members.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The eight members raised production quotas by about 2.9 million bpd from April till December 2025, roughly 3 per cent of global demand, before pausing increases for January to March 2026 due to seasonal weakness. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/energy-commodities/opec-raise-oil-output-slightly-even-us-war-iran-disrupts-shipments",
            "pub_date": "2026-03-01 20:01:28",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sias questions Vibrant Group on whether former CEO Eric Khua’s exit disclosure was ‘misleading’",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The Securities Investors Association (Singapore), or Sias, has queried mainboard-listed logistics company Vibrant Group as to why it did not disclose that, prior to his stepping down, its former chief executive officer Eric Khua had lost a High Court appeal and is facing a <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/vibrant-ceo-appeal-13-month-jail-sentence-causing-grievous-hurt-ex-ktl-chairman\" target=\"_blank\">13-month prison sentence</a>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In a letter to Vibrant’s board of directors dated Feb 27, Sias president and CEO David Gerald noted that the High Court of Singapore had upheld a prison sentence of 13 months that was handed to Khua for causing grievous hurt. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Vibrant said in a bourse filing on Feb 16 that, effective from Feb 13, Khua had ceased to be CEO and executive director due to “health reasons”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gerald asked if the group had verified the reason for Khua’s stepping down and what steps it had taken to ensure that the announcement was “true and accurate and not in any way misleading to the market”. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It is of paramount importance that the board expeditiously replies to the above questions and publish its responses on SGXNet as soon as possible, to ensure that the market has the complete and accurate information,” said Gerald. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Vibrant’s filing, submitted by group executive director and chief financial officer Francis Lee, stated that Khua had been on leave of absence since Oct 27, 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In response to a question in the filing about whether there was “any matter in relation to the cessation that needs to be brought to the attention of shareholders of the listed issuer”, the answer was negative. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Appeal failed</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Jul 24, 2024, Khua – now 57 – was sentenced to 13 months’ jail for assaulting Tan Tock Han, 76, the former chairman of KTL Global, an investment holding company that was delisted from the Singapore Exchange (SGX) in 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the time, Vibrant said in a bourse filing that Khua had been sentenced to a period of incarceration for a personal matter not related to the company. But given that he would appeal against both the conviction and his sentence, he would continue in his roles, it added. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It is unclear when Khua filed his appeal and when it was turned down by the High Court. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Tan’s son, <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/ktl-global-ex-ceo-tan-kheng-yeow-jailed-two-years-eight-months-s1m-cbt\" target=\"_blank\">Wilson Tan Kheng Yeow</a> was a friend of Khua. Khua lent the younger Tan more than S$2.4 million in 2014 and 2015, as he needed financial assistance. \n\nOver the years, Khua attempted to get his money back from both father and son, but failed. In 2021, he pushed the elder Tan down a flight of stairs, causing injury. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/sias-questions-vibrant-group-whether-former-ceo-eric-khuas-exit-disclosure-was-misleading",
            "pub_date": "2026-03-01 19:21:42",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The new age of chokepoints",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IRAN’S recent partial closure of the Strait of Hormuz has once again exposed how vulnerable global commerce remains to disruption at a handful of narrow passages.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Roughly a fifth of the world’s oil and a significant share of maritime trade pass through Hormuz alone. When tensions constrict such arteries, energy prices, freight rates, insurance premiums and corporate balance sheets <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/possible-hormuz-blockade-threatens-asias-energy-lifeline-unsettling-oil-market\" target=\"_blank\">react</a> almost immediately.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hormuz is not an anomaly. The global economy runs on a small number of critical passages, including the Suez Canal, Panama Canal and Strait of Malacca, that together carry more than half of global maritime trade.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/new-age-chokepoints",
            "pub_date": "2026-03-01 18:56:23",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asian oil buyers assess stockpiles, Mid-East alternatives as Iran conflict escalates",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SEOUL/NEW DELHI] Asian governments and refiners rushed to assess oil stockpiles as well as alternative shipping routes and supplies as the Iran conflict disrupted shipping in the crucial Strait of Hormuz, with oil prices expected to rise when trading resumes on Monday (Mar 2).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Asia will feel the biggest impact from any disruption in Middle East oil supply as it buys two-thirds of its crude from the Gulf, with half of top global importer China’s supply and 90 per cent of Japan’s coming from the region.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Strait of Hormuz is the narrow waterway between Iran and Oman connecting the Gulf to the Arabian Sea. On a typical day, tankers carrying the equivalent of 20 per cent of global oil consumption pass through it with cargoes from producers such as Saudi Arabia, Iraq, Iran, the United Arab Emirates, Kuwait and Qatar.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Japanese shipping companies said they are halting operations around the Strait of Hormuz, although Chief Cabinet Secretary Minoru Kihara said Tokyo had not received any reports of an immediate impact on supply for Japan.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">However, Indian state refiners have already started scouting for alternative supplies, two refining officials said, declining to be identified. India, the world’s No 2 oil importer, has been increasing imports from the Middle East to replace Russian crude.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our team is already engaged with other suppliers,” one of the officials said, adding that Indian state refiners have reserves of 20 days of crude and liquefied petroleum gas, which is sufficient if the situation eases in coming days.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">June Goh, senior analyst at Sparta Commodities, said oil prices would likely trade higher, with the impact tempered by an expected increase in production from the Opec+ producers group. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">She noted that oil infrastructure was not yet affected. “The industry is currently grappling with a slowdown in shipping activity via the Strait of Hormuz due to insurability, not an outright blockade,” she said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Several tanker owners, oil majors and trading houses have suspended crude, fuel and liquefied natural gas shipments via the Strait.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The South Korean government will offer petroleum from its stockpiles to local industries if any supply disruptions are prolonged, the industry ministry said in a statement on Sunday following an emergency meeting.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">An official from a local refiner said South Korea’s oil stockpiles held jointly with state-run Korean National Oil Corp can last seven months.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are checking if any vessels are still allowed to sail through the Strait now,” he added. “But if the Strait of Hormuz is closed ... we will seek spot supplies in Asia. We need to see which countries release such spot supplies then.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">South Korean refiners HD Hyundai Oilbank and GS Caltex said they are monitoring the situation. Hyundai Oilbank said it has yet to halt oil loadings in the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China has bulked up its crude stockpiles in recent months, with imports hitting a record in December.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Taiwan, oil and liquefied natural gas suppliers are proceeding with shipments as scheduled, the economy ministry said, adding that the portion of oil and gas imports from the Middle East has been decreasing annually. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/energy-commodities/asian-oil-buyers-assess-stockpiles-mid-east-alternatives-iran-conflict-escalates",
            "pub_date": "2026-03-01 18:50:38",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Yangzijiang Financial sinks into red in H2, posts FY2025 loss on China property provisions",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->Yangzijiang Financial<!-- --> <!-- --> swung into the red in the second half of FY2025 with a net loss of S$142.9 million, from a net profit of S$197.3 million in the same period a year earlier.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The decline was driven largely by credit loss allowances of S$304 million, on the back of changes in market conditions and recovery expectations within China’s property and credit markets. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Total income for H2 FY2025 was down 16 per cent at S$52.1 million, primarily pulled down by a drop in interest income – the group’s primary source of revenue derived from debt investments, including debt securities and microfinancing loans – amid a lower average balance of debt investments in China.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">No dividend was declared for FY2025, compared with a final dividend of S$0.0345 in the previous year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full-year, Yangzijiang Financial had a loss of S$5.2 million, reversing from a profit of S$304.6 million in FY2024. Profit before allowances remained positive at S$92.2 million, reflecting continued income contributions from performing assets and associated investments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, total income fell 19 per cent to S$103.7 million.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Future plans</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In a statement on Saturday (Feb 28), the group said that its immediate focus is on portfolio optimisation, accelerating cash recovering and resolving non-performing exposures.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As part of its rebalancing strategy,  it plans to move towards a long-term allocation framework comprising about 40 per cent income-generating debt investments, 40 per cent equity investments (including private equity and listed equities), and 20 per cent cash and cash equivalents to preserve liquidity and flexibility. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Within the 40 per cent equity allocation, about 20 per cent of assets under management will be deployed into private equity, targeting “fundamentally strong businesses with restructuring or value-enhancement potential”, while the remaining portion will be deployed to selected listed public equities across China and South-east Asia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the first half of 2026, the group plans to progressively deploy up to one billion yuan (S$184.4 million) into selected high-yield (more than 4.5 per cent) listed equities and value-accretive investment opportunities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Liu Hua, executive chairman of Yangzijiang Financial, noted: “The recognition of FY2025 allowances reflects prevailing market conditions and aligns our portfolio valuations on a more conservative basis.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“With a strengthened balance sheet and zero external borrowings, we are focused on disciplined capital redeployment and building a more resilient and diversified earnings base over time.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ahead of the results, Yangzijiang Financial climbed 5.1 per cent, or S$0.015, to end at S$0.31 on Friday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It had earlier issued a profit warning for its FY2025 results, which saw its <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/yangzijiang-financial-drops-14-5-2-year-low-expected-reversal-red\" target=\"_blank\">shares falling to a two-year low</a> on Thursday amid heavy trading. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/yangzijiang-financial-sinks-red-h2-posts-fy2025-loss-china-property-provisions",
            "pub_date": "2026-03-01 18:25:41",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saying yes, for less: Why lab-grown diamonds have cornered 80% of the engagement ring market",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/saying-yes-less-why-lab-grown-diamonds-have-cornered-80-engagement-ring-market",
            "pub_date": "2026-03-01 18:11:20",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street turns to ‘haven-first’ strategies amid Iran attacks",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] The fast-moving conflict across the Middle East is heightening investor anxiety and strengthening the case for safe-haven trades such as Treasuries, gold and the Swiss franc.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Macro traders said all eyes will be on energy markets when trading fully re-opens on Monday (Mar 2), with early indications of volatility also expected when the US dollar and other currencies start to trade in Australia. The possibility of prolonged turmoil in the Middle East and the ripple effects of higher oil prices are giving money managers fresh reasons to sell equities and shift into safety. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Traders will be adopting the strategy of “haven first, ask questions later,” according to John Briggs, head of US rates strategy at Natixis. “The scale of the attacks and Iranian retaliation is larger than what the market expected,” he said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Briggs said Treasuries are likely to extend moves from Friday, when short-term yields sank to levels last seen in 2022. Others are watching energy chokepoints. Roundhill Financial’s Dave Mazza said he is closely tracking what happens to traffic at the Strait of Hormuz, a narrow waterway handling about a quarter of the world’s seaborne oil trade. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is about Hormuz risk, not retaliation. If shipping stays open, stocks can work through it,” he said. “If it doesn’t, all bets are off.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rich valuations across global equities and credit also make it easier for investors to trim risk, said Ed Al-Hussainy, a portfolio manager at Columbia Threadneedle Investments. Markets have already been on edge over shifting US tariff policy, the disruption from artificial intelligence and stresses tied to private credit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The extent of the de-risking is anyone’s guess,” Al-Hussainy said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Saudi Arabia’s Tadawul All Share Index opened almost five per cent lower before paring most of that decline in Sunday trading. Meanwhile, Bitcoin recovered and was trading around US$68,000. Put options on the cryptocurrency worth US$1.87 billion were concentrated at the US$60,000 level on Deribit, signalling persistent demand for downside protection.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Anxiety over the looming military action had started to filter into markets on Friday. Brent crude closed at the highest price since July, while the S&amp;P 500 lost 0.4 per cent on the day, capping its biggest monthly loss since March. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Strategists at Barclays warned against quickly buying any dip. Investors have grown accustomed to geopolitical flare-ups that fade fast, but this episode risks lasting longer, wrote Ajay Rajadhyaksha, the firm’s global chairman of research, citing the potential for US casualties, strikes on Iranian leadership and disruption to Hormuz traffic. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The risk-reward doesn’t seem compelling,” he said. “If equities pull back enough (say over 10 per cent in the S&amp;P 500), there is likely to come a time to buy. But not yet.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s what other investors and strategists had to say: </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Kevin Gordon, head of macro research and strategy for Charles Schwab</strong> </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To the extent that sends oil prices higher on a somewhat sustained basis, there could be a near-term inflationary scare that spooks the equity market. I do think investors need to continue to think about the distinction between front-page risk and bottom-line risk, though. If this conflict has no meaningful downstream impacts on growth or earnings, any negative stock market response has the potential to be short-lived.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Francis Tan, chief Asia strategist at Indosuez Wealth Management</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“There is a high probability that Asia, and onward to Europe and the US will experience a risk-off gap down. The immediate impact will be on airline and travel stocks, as we see news from closures of airspace over the Middle East, and also potentially cancellations of flights that needed to use the airspace en-route to Europe.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Should the situation in the Gulf be sustained over a few months, oil price could be priced above US$100 a barrel and this will reduce any expectations of more Fed rate hikes in 2026. This would be a dampener to growth stocks, particularly tech stocks could experience a decline.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Gregory Faranello, head of US rates at Amerivet Securities</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The military operation with Iran could last for a few weeks. We don’t believe it drags on. In the context of the past four years, US Treasuries have been range bound and there is room below for yields, if investors want safe haven. Ultimately yields will be driven by the Fed and economy. This operation in Iran does not change US fundamentals.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Frank Monkam, head of cross asset macro strategy and trading at Buffalo Bayou Commodities</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This Iran strike over the weekend constitutes an almost a perfect sell-off catalyst for an already fragile equity market, and the recent uptick in volatility is likely to extend in the shorter term. That being said, geopolitical flare-ups typically tend to create temporary sell-offs rather than sustained bear markets, so I expect equities to eventually stabilise once Middle East developments are fully digested.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the grander scheme, the macro question is around the potential impact of an oil shock on an economy that’s flashing signs of stagflation-lite based on recent readings. Therefore, I also expect policy volatility to move back to forefront in response over the weeks and months ahead.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Rajeev de Mello, global macro portfolio manager at Gama Asset Management </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“A prolonged escalation in hostilities between the US and Iran would transmit to emerging markets first and foremost through the oil complex.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The majority of large EM economies are net oil importers, and energy remains a meaningful share of both their import bills and inflation baskets. Higher crude oil prices widen current account deficits, compress real incomes, and force central banks to choose between supporting growth and containing inflation expectations. This is particularly relevant given the strong recent performance across EM risk assets: positioning and sentiment have improved, leaving less margin for an adverse terms-of-trade shock.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Joe Gilbert, portfolio manager at Integrity Asset Management </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Energy stocks and metals will be the leaders as well as real estate and utilities – the more classic defensive groups. Defense stocks will get a bid as well because of the increased demand for their products. Consumer discretionary stocks will be losers because of higher oil prices, which will hurt airlines and retailers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Madison Faller, global investment strategist, and Erik Wytenus, head of EMEA investment strategy, at JPMorgan Private Bank</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“For investors, the ripple effects could reach across the global economy and financial system. Energy is central to these risks, with the Middle East serving as a critical hub for global oil and gas flows. Even the possibility of disruption can quickly affect production costs, consumer prices, monetary policy expectations, market sentiment, and the broader outlook for growth and inflation.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our constructive outlook for the year stands, but these events reinforce the reality of a fragmenting global order. Now more than ever, portfolios should be built for resilience-with both gold and exposure to sectors governments consider strategically vital.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Maxence Visseau, Dubai-based director of research at investment firm Arkevium</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I’d expect yields down five to 10 basis points at a minimum on the initial move,” he said referring to Treasuries. “But the complication is oil. If crude spikes towards US$80 to US$90 on any Hormuz disruption, the long-end gets caught in a tug of war between safe-haven demand and repricing of inflation expectations. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">You could see the curve steepen aggressively as the market starts pricing out Fed cuts and breakevens blow wider. The Fed is already stuck at 3.5 to 3.75 per cent with inflation near three per cent – an energy shock makes the an energy shock makes their job significantly harder and could force a hawkish tilt.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/wall-street-turns-haven-first-strategies-amid-iran-attacks",
            "pub_date": "2026-03-01 18:05:43",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US-Iran conflict disrupts thousands of flights as travel chaos deepens",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[DUBAI] Global air travel remained heavily disrupted on Sunday (Mar 1) as continued air strikes kept major Middle Eastern airports, including Dubai, the world’s busiest international hub, closed in one of the sharpest aviation shocks in recent years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Key transit airports, including Dubai and Abu Dhabi in the UAE and Doha in Qatar, were shut or severely restricted as much of the region’s airspace remained closed after US and Israeli strikes killed Iranian Supreme Leader Ayatollah Ali Khamenei on Saturday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israel said it launched another wave of strikes on Iran on Sunday while loud blasts were heard for a second day near Dubai and over Doha after Iran launched retaliatory air attacks on the neighbouring Gulf states.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dubai International Airport sustained damage during Iran’s attacks while airports in Abu Dhabi and Kuwait were also hit. Thousands of flights have been affected across the Middle East, according to data on flight-tracking platform FlightAware.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Airspace over Iran, Iraq, Kuwait, Israel, Bahrain, the UAE and Qatar remained virtually empty, maps by Flightradar24 showed early on Sunday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The flight-tracking service said that a new “Notice to Airmen” (NOTAM) had extended closure of Iranian airspace until at least 0830 GMT on Mar 3.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Ripple effects</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The airport closures have rippled far beyond the Middle East. Dubai and neighbouring Doha sit at the crossroads of east-west air travel, funnelling long-haul traffic between Europe and Asia through tightly scheduled networks of connecting flights. With those hubs idle, aircraft and crews remained stranded out of position, disrupting airline schedules worldwide.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It’s the sheer volume of people and the complexity,” said UK-based aviation analyst John Strickland.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It is not only customers, it is the crews and aircraft all over place.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Airlines across Europe, Asia and the Middle East cancelled or rerouted flights to avoid closed or restricted airspace, lengthening journeys and driving up fuel costs. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The disruption has been intensified by the loss of Iranian and Iraqi overflight routes, which had grown more important since the Russia-Ukraine war forced airlines to avoid both countries’ airspace. The Middle East airspace closures were squeezing airlines into narrower corridors, with fighting between Pakistan and Afghanistan adding a further risk, said Ian Petchenik, communications director at Flightradar24.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The risk of protracted disruption is the main concern from a commercial aviation perspective,” Petchenik said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Any escalation in the conflict between Pakistan and Afghanistan that results in the closure of airspace would have drastic consequences for travel between Europe and Asia.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Highlighting the scale of the disruption, Air India cancelled its flights on Sunday departing from Delhi, Mumbai and Amritsar for major cities in Europe and North America. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/us-iran-conflict-disrupts-thousands-flights-travel-chaos-deepens",
            "pub_date": "2026-03-01 17:36:44",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ossia’s Goh family picks up S$73 million bloc of 18 strata units at Orchard Shopping Centre",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The Goh family behind Ossia International has bought a portfolio of 18 freehold strata-titled retail units at Orchard Shopping Centre for S$73 million, amid a recent pick-up in deal activity and interest in Singapore’s prime shopping belt. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The acquisition price works out to S$8,171 per square foot (psf) on a strata area of 8,934 square feet (sq ft). The portfolio, owned and managed by JLL affiliate LaSalle Investment Management, comprises two ground-floor units occupied by Maybank, and 16 strata units on the second floor tenanted by RHB Bank and Xiao Long Kan Hotpot. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The price tag is some 19 per cent lower than the previous asking price of S$90 million, when the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/portfolio-of-18-strata-units-at-orchard-shopping-centre-for-sale-at-s90m-indicative-price\" target=\"_blank\">property was marketed in 2022</a>. </p></div>",
            "link": "https://www.businesstimes.com.sg/property/ossias-goh-family-picks-s73-million-bloc-18-strata-units-orchard-shopping-centre",
            "pub_date": "2026-03-01 17:31:25",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Opec+ debates oil output boost as US war on Iran disrupts shipments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON/MOSCOW] Opec+ will consider a larger-than-expected oil output increase on Sunday (Mar 1), two Opec+ sources said after the US-Israeli war on Opec+ member Iran and Teheran’s retaliation led to shipment disruptions in the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ has a history of raising oil output to cushion disruptions but analysts said the group currently has very little spare capacity to meaningfully add to supply, except for its leader Saudi Arabia and the United Arab Emirates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riyadh has been raising oil production and exports in recent weeks in preparation for US strikes on Iran, sources have told Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil, gas and other shipments from the Middle East via the Strait of Hormuz have come to a halt since Saturday after shipowners received a warning from Iran saying the area was closed for navigation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ will debate a production hike of 411,000 barrels per day or more at a meeting on Sunday, sources told Reuters, larger than the original expectations of 137,000 bpd.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil prices jumped on Friday to US$73 per barrel, the highest level since July, on fears of a wider conflict in the Middle East and supply disruptions through Hormuz, the world’s most important oil route amounting to over 20 per cent of global oil transit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Middle East leaders have warned Washington that a war on Iran could lead to oil prices jumping to over US$100 per barrel, said veteran Opec analyst Helima Croft from RBC. Analysts from Barclays also said prices could rise to US$100.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Croft said the market impact from any large Opec output increase will be limited due to a lack of actual production capabilities outside Saudi Arabia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The meeting on Sunday will start at 1100 GMT and will involve only eight members of Opec+ – Saudi Arabia, Russia, the UAE, Kazakhstan, Kuwait, Iraq, Algeria and Oman. Opec+ groups the Organization of the Petroleum Exporting Countries and allies like Russia but most production changes in the past years have been done by the eight members.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The eight members raised production quotas by about 2.9 million bpd from April through December 2025, roughly 3 per cent of global demand, before pausing increases for January to March 2026 due to seasonal weakness. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/opec-debates-oil-output-boost-us-war-iran-disrupts-shipments",
            "pub_date": "2026-03-01 17:25:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}