{
    "data": [
        {
            "title": "SAP’s new bonus system sparks outcry over rewards for underperforming bosses",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BERLIN] SAP’s new bonus system ended up rewarding underperforming managers while holding lower-ranking workers to a higher standard for their payouts, prompting an outcry from employees and leaders alike at the German software company, people familiar with the matter said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP has since set aside millions of euros to appease angered staff and improve the new global system, which wound up rewarding senior-level employees who did not meet all expectations in their roles, according to documents reviewed by Bloomberg and people familiar with the situation. The people asked not to be identified because the matter isn’t public. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The compensation programme riled SAP employees, who have already signalled in surveys that they are losing trust in the company’s executive board amid job cuts and a restructuring process that dragged on for months. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As artificial intelligence tools threaten traditional enterprise software models, SAP’s stock has lost about 135 billion euros (S$201.7 billion) in value after reaching an all-time-high a year ago. SAP reported on Thursday (Feb 26) that chief executive officer Christian Klein made 16.2 million euros in 2025, about 14 per cent below his compensation a year earlier. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP confirmed that it had introduced a new performance-based compensation framework. During the rollout, the firm “identified additional areas for refinement related to stock-based compensation for non-executives,” a company spokesperson said. The topics were reviewed and addressed “to the extent possible prior to the process finalisation,” he added, saying that “fair and competitive compensation for performance is a priority for SAP.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Klein had set a goal of overhauling the employee reward system in 2023 to better incentivise high performance. He put chief people officer Gina Vargiu-Breuer in charge of the development of the new stock incentive plan, which was rolled out to employees this month, two of the people said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Klein told Vargiu-Breuer’s team to rework the system after employees and managers complained that it was unfair, the two people said. The fallout could threaten her future at the company after her contract ends in early 2027, they said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“As is standard practice, SAP does not comment on individual personnel or contractual matters,” a company spokesperson said by email. Gina Vargiu-Breuer did not respond to a request for comment sent through SAP.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP categorised its general staff in five levels, ranging from the lowest (T1) to managers or senior employees (T5), the documents reviewed by Bloomberg show. While the three bottom ranks had to surpass expectations to receive stock-based bonuses, T4 and T5 employees who did not meet all their benchmarks still qualified for incentives, according to the documents and people familiar with the situation. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">SAP has seen high executive board turnover in the past six years, and several contracts were terminated prematurely, costing the firm millions of euros in payouts. Klein’s co-CEO Jennifer Morgan left after months in the role in 2020. Starting in 2023, chief financial officer Luka Mucic and executive board members Sabine Bendiek, Scott Russell, Julia White and Jürgen Müller also departed. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Separately, Muhammad Alam, who leads product engineering, does not plan to renew his contract when it ends next year, the people said. Alam did not respond to a request for comment, and SAP declined to comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In an internal survey in November, 59 per cent of employees said they trusted the executive board, down six percentage points from half a year earlier, according to an internal email sent by Vargiu-Breuer and seen by Bloomberg News. In April 2021, more than 80 per cent of employees said they trusted the executive team.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The turnover at the top level has added another layer of instability as SAP works to rearrange its business around the threats of the new AI era. Some early users of the company’s flagship AI assistant, Joule – designed to help users navigate complex SAP systems and make tasks like coding easier – have been disappointed, customers and partners have said, asking to not be identified discussing their relationship with the vendor. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/saps-new-bonus-system-sparks-outcry-over-rewards-underperforming-bosses",
            "pub_date": "2026-02-27 17:00:47",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Budget 2026 should affect Singaporean wallets",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN Singapore Budget 2026 was unveiled on Feb 12, the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-highlights-ai-champions-foreign-worker-policy-tweaks-more-cdc-vouchers\" target=\"_blank\">headline numbers</a> caught attention. For individuals, in particular: Community Development Council (CDC) Vouchers, cost-of-living payouts and education credits. But beneath the surface lies a deeper message. One that does not show up on the balance sheet yet will determine the financial futures of millions of Singaporeans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This Budget arrives in a world where artificial intelligence (AI) is reshaping careers, living costs still matter and family-building gets expensive fast. More than a fiscal document, the Budget quietly, but powerfully, challenges each of us to upgrade our money mindset alongside the nation’s economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s why every young career starter, aspiring parent and middle-class professional should read the Budget with as much interest as the next smartphone launch.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/how-budget-2026-should-affect-singaporean-wallets",
            "pub_date": "2026-02-27 17:00:47",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Budget 2026 should affect Singaporean wallets",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN Singapore Budget 2026 was unveiled on Feb 12, the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-highlights-ai-champions-foreign-worker-policy-tweaks-more-cdc-vouchers\" target=\"_blank\">headline numbers</a> caught attention. For individuals, in particular: Community Development Council (CDC) Vouchers, cost-of-living payouts and education credits. But beneath the surface lies a deeper message. One that does not show up on the balance sheet yet will determine the financial futures of millions of Singaporeans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This Budget arrives in a world where artificial intelligence (AI) is reshaping careers, living costs still matter and family-building gets expensive fast. More than a fiscal document, the Budget quietly, but powerfully, challenges each of us to upgrade our money mindset alongside the nation’s economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s why every young career starter, aspiring parent and middle-class professional should read the Budget with as much interest as the next smartphone launch.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/how-budget-2026-should-affect-singaporean-wallets",
            "pub_date": "2026-02-27 17:00:46",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nintendo announces 290 billion yen share sale by Kyoto bank and others",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[TOKYO] Nintendo announced on Friday (Feb 27) an unwinding of strategic shareholdings that will see companies including MUFG Bank and the Bank of Kyoto selling shares in the company behind gaming franchises such as “Super Mario”.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The sale, which was first reported by Reuters, will total about 290 billion yen (S$2.35 billion) at Friday’s closing price, excluding an overallotment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Kyoto-based Nintendo also said it would spend up to 100 billion yen buying back up to 14 million shares.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nintendo’s shares pared gains and closed up nearly 3 per cent following the Reuters report. Shares in Kyoto Financial Group, a regional lender, leapt almost 10 per cent.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Resona Bank, part of Resona Holdings, and DeNA will also sell shares in Nintendo. MUFG Bank, Japan’s largest and a part of Mitsubishi UFJ Financial Group, will sell Nintendo shares held by a trust bank.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Regulators and the Tokyo Stock Exchange have encouraged Japanese companies to unwind their cross-shareholdings and the banks have outlined policies to reduce their stakes.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A share sale in 2019 saw banks offload some 71 billion yen worth of Nintendo’s shares.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Toyota is planning an unwinding of strategic shareholdings that would involve banks and insurers selling around US$19 billion of its shares, Reuters reported on Thursday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The practice, which involves firms holding shares in each other to cement business ties, has been criticised by governance experts and overseas investors as insulating management from shareholders. Although the practice has been widespread in Japan for decades, it is less common in the West. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/nintendo-announces-290-billion-yen-share-sale-kyoto-bank-and-others",
            "pub_date": "2026-02-27 16:55:32",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL H2 net profit up over four times at S$538.5 million on improved showings across all segments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->City Developments Ltd’s (CDL)<!-- --> <!-- --> second-half earnings rose more than four times to S$538.5 million, from S$113.5 million in the previous corresponding period.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This more than trebled the group’s full-year earnings to S$629.7 million, from S$201.3 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The improvements were primarily driven by robust residential sales in Singapore and strong capital recycling gains, notably, from the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/cdl-selling-its-50-1-south-beach-stake-its-malaysian-partner-ioi-s834-million-yielding-s465-million\" target=\"_blank\">sale of a 50.1 per cent stake in the South Beach mixed-use development</a> in H2 to Malaysian partner IOI Properties Group, said CDL on Friday (Feb 27). The S$834 million transaction yielded a S$465 million gain.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sherman Kwek, CDL’s group chief executive officer, said that strong residential sales in Singapore and accelerated capital recycling drove a “significant uplift” to the group’s earnings, despite the company facing a “challenging environment with ongoing economic uncertainties” in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” Kwek said. “We have taken decisive steps to unlock value from mature and non-core assets while selectively redeploying capital to drive growth.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In early 2025, Kwek was embroiled in a public feud with his father and CDL executive chairman Kwek Leng Beng, but the matter was settled subsequently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the second half, CDL posted an earnings per share (EPS) of S$0.598, versus S$0.121 in the year-ago period. EPS for the full year rose to S$0.694, from S$0.213 in the previous financial year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 stood at S$1.9 billion, up 11.1 per cent on the year from S$1.7 billion. Full-year revenue grew 9.7 per cent to S$3.6 billion from S$3.3 billion.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Better results across all segments</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said that all its business segments reported improvements for H2 and FY2025, with the property development segment being the biggest contributor to revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, that segment’s revenue rose 24.1 per cent on the year to S$1.2 billion, supported by higher contributions from Singapore projects such as The Myst, Norwood Grand and Union Square Residences. The sales of the Ransome’s Wharf site in London and the office component of Suzhou Hong Leong City Center in China also boosted revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, the hotel operations segment saw a 1.7 per cent increase in revenue and improvements in revenue per available room, said CDL. This was supported by new additions including The Mayfair Hotel Christchurch, acquired in January 2025, and the Hilton Paris Opera, acquired in May 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the increase in gross profits for H2 and FY2025 was marginal, despite its revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its overall gross profit margin fell to 41 per cent for H2 and FY2025, from 45 per cent for both periods in 2024, as it was impacted by an S$80.5 million allowance for foreseeable losses that was made in relation to China development properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, CDL maintained strong cash reserves of S$2.1 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board proposed a final dividend of S$0.25 per share, payable on May 19, after the record date of May 4. Together with the special interim dividend of S$0.03 per share paid in September 2025, the total ordinary dividend for FY2025 amounts to S$0.28 per share, representing a 40 per cent dividend payout ratio. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of CDL ended Thursday 6 per cent or S$0.60 down at S$9.36.  </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/cdl-h2-net-profit-over-four-times-s538-5-million-improved-showings-across-all-segments",
            "pub_date": "2026-02-27 16:55:32",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The argument that never ends",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IN RECENT weeks, we watched “nobody is actually using artificial intelligence (AI)” become “AI is devouring us whole”. The speed of this pivot was breathtaking. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The sceptics changed their arguments with the terrified fervour of late converts. They did not change their underlying conclusions. The conclusion always came first. The evidence was always completely negotiable. Fear simply found a new vocabulary. \n\nThe extreme optimists are equally guilty of intellectual fraud. They dip aggressively into historical archives for psychological comfort. They point blindly to the invention of the mechanical loom. They cite the widespread adoption of the car. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">They even weaponise the invention of flash-frozen food. They dress blind hope in the respectable garments of historical analysis. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Neither side can paint a credible road map of the coming decades. Both sides plunder the past for convenient anecdotes. History is stripped of its complex context to serve modern dogmas. We are using dead centuries to comfort our living fears.\n\nWhat both camps share is a stubborn refusal to accept reality. We are standing in a genuinely unrecognisable era. A fourth economic sector – beyond agriculture, industry and services – is rising vertically. Its workers are machines.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Historical precedents offer zero intellectual protection. Outsourcing physical labour to machines was easy for our egos. Outsourcing cognition is a direct assault on human pride. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Forecasting the trajectory of machine intelligence with historical analogies is fundamentally absurd. It is like predicting the arc of a modern cricket match by analysing a forgotten sport played in 18th-century Rajasthan. The rules are entirely alien. The fundamental players are no longer exclusively human. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The realisation that our history books are utterly useless will take years to accept. The future has no precedent, but the opportunists already have a script.\n\nMachines themselves are helping us build the most fanatical scenarios imaginable, engineered not for accuracy but for virality, calibrated to stoke the basest emotions of hope and dread in equal measure. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Some of these visions will be proven right. Most will not. It will not matter. By the time any verdict arrives, there will be exponentially more to process, more to fear, more to celebrate, more to argue about. \n\nFor now, the arrow of history points towards a few cold truths. AI will not be useless. It will not suddenly plateau on some invisible scaling law. It will not go unused by the masses. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This reveals exactly how the technology will infiltrate every future argument. It will be used as a blank canvas for human insecurity. It will be weaponised for political ends, financial positioning and bitter personal agendas. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">We are seeing only the first skirmishes of a permanent war of interpretation. People will take aggressive stances on algorithms simply to secure their own relevance. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">History will be dragged from its grave to serve preformed conclusions. It will be shouted loudly across every platform. Volume is the only compensation for the total absence of evidence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">But the true crisis is not societal. The true crisis is fiercely intimate. Most of us wear two fundamentally incompatible masks. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Economists hide this trauma behind sterile terminology. They speak casually of producer utility. They speak academically of consumer utility. The reality is simpler and far more brutal. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In different domains of our lives, we sit on completely different sides of the AI divide. We sit on opposite sides of our own lives. And, we switch sides constantly. Sometimes within the same hour. We are haunted by our own hypocrisy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Imagine waking up drowning in profound gratitude. An AI perfectly diagnoses a loved one. It spots the invisible anomaly. It actively saves a human life – never mind the career of the displaced radiologist. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nightfall brings a radically different reality. A child returns home with an expensive engineering degree to discover that the job market has shifted beneath them. Fury rapidly replaces the morning gratitude. We are desperate to quarantine the magic from the massacre.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Then, before bed, the portfolio notification arrives. The AI infrastructure company posted record earnings. The retirement account is up. Three emotional states. None of them is dishonest. They inhabit one body. They occur on the exact same day. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A child in a remote village finally receives a world-class education. An algorithm tailors every lesson to her specific mind. It is a beautiful triumph of accessibility. It is also a quiet tragedy. That same child will never secure the offshore service job her older sibling cherished. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Our wallets celebrate the very efficiency that breaks our hearts. The ladder that lifted hundreds of millions into the middle class is being pulled up while a different, unfamiliar ladder is being lowered. Nobody knows if the new one reaches the same floors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Every convenience comes twinned with a threat. Every gain in one role is shadowed by a loss in another. It is the modern condition of trying to reason with a moody, two-faced Gemini hovering in the OpenAI clouds, never quite knowing if today’s X factor will be benevolence or foreclosure. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The bribe of convenience is simply too sweet to refuse. We willingly fund the exact forces we deeply fear.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">These internal divisions are not temporary. They are permanent features of the new economy.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">We will beg to separate the warmth of the fire from its devastating burn. The separation is impossible. We harbour a personal AI left and a personal AI right. Our political stance shifts dynamically with our daily convenience. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The trauma crosses generations seamlessly. Parents who cheat death via medical algorithms raise children who starve for economic relevance. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nobody designed it this way. It is simply what happens when a force this large moves this fast through a species this complicated.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>The writer is chief executive officer of Singapore-based, global innovation investment company, GenInnov</strong>\n<strong>This is an edited excerpt of an article published on </strong><em><strong>https://www.geninnov.ai/blog</strong></em></p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/argument-never-ends",
            "pub_date": "2026-02-27 16:15:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saying yes, for less: Why lab-grown diamonds have cornered 80% of the engagement ring market",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/saying-yes-less-why-lab-grown-diamonds-have-cornered-80-engagement-ring-market",
            "pub_date": "2026-02-27 16:06:22",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saying yes, for less: Why lab-grown diamonds have cornered 80% of the engagement ring market",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/saying-yes-less-why-lab-grown-diamonds-have-cornered-80-engagement-ring-market",
            "pub_date": "2026-02-27 16:06:21",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "British Airways owner IAG beats profit estimates as premium demand lifts earnings",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] British Airways owner IAG reported a better-than-expected annual profit on Friday (Feb 27), as it benefited from lower fuel costs and resilience on its core transatlantic routes, particularly for its premium services.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">European airlines have been riding strong premium demand across the North Atlantic, a key profit engine, even as US-sold economy fares softened, mirroring an industry-wide trend, in which affluent travellers continue to spend. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, price-sensitive flyers pull back amid tariff-related uncertainty and shifting US demand signals. European peers have been capitalising on strong premium-travel demand, with Lufthansa rolling out new premium seats and Air France-KLM boosting premium products through upgraded cabins, lounges, and onboard services.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On Thursday, IAG said it would return 1.5 billion euros (S$2.24 billion) in excess cash to shareholders over the next 12 months, starting with a 500 million euro share buyback to be completed by the end of May 2026.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IAG reported an operating profit before exceptional items of 5.02 million euros, compared with 4.97 billion euros projected by analysts polled by LSEG. That’s up 3.5 per cent from last year’s adjusted operating profit of 4.44 billion euros. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/british-airways-owner-iag-beats-profit-estimates-premium-demand-lifts-earnings",
            "pub_date": "2026-02-27 16:00:40",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The new rules of engagement: Forget mined diamonds, go lab-grown",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/new-rules-engagement-forget-mined-diamonds-go-lab-grown",
            "pub_date": "2026-02-27 15:35:36",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}