{
    "data": [
        {
            "title": "Yangzijiang Financial sinks into red in H2, posts FY2025 loss on China property provisions",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->Yangzijiang Financial<!-- --> <!-- --> swung into the red in the second half of FY2025 with a net loss of S$142.9 million, from a net profit of S$197.3 million in the same period a year earlier.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The decline was driven largely by credit loss allowances of S$304 million, on the back of changes in market conditions and recovery expectations within China’s property and credit markets. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Total income for H2 FY2025 was down 16 per cent at S$52.1 million, primarily pulled down by a drop in interest income – the group’s primary source of revenue derived from debt investments, including debt securities and microfinancing loans – amid a lower average balance of debt investments in China.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">No dividend was declared for FY2025, compared with a final dividend of S$0.0345 in the previous year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the full-year, Yangzijiang Financial had a loss of S$5.2 million, reversing from a profit of S$304.6 million in FY2024. Profit before allowances remained positive at S$92.2 million, reflecting continued income contributions from performing assets and associated investments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, total income fell 19 per cent to S$103.7 million.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Future plans</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In a statement on Saturday (Feb 28), the group said that its immediate focus is on portfolio optimisation, accelerating cash recovering and resolving non-performing exposures.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As part of its rebalancing strategy,  it plans to move towards a long-term allocation framework comprising about 40 per cent income-generating debt investments, 40 per cent equity investments (including private equity and listed equities), and 20 per cent cash and cash equivalents to preserve liquidity and flexibility. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Within the 40 per cent equity allocation, about 20 per cent of assets under management will be deployed into private equity, targeting “fundamentally strong businesses with restructuring or value-enhancement potential”, while the remaining portion will be deployed to selected listed public equities across China and South-east Asia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the first half of 2026, the group plans to progressively deploy up to one billion yuan (S$184.4 million) into selected high-yield (more than 4.5 per cent) listed equities and value-accretive investment opportunities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Liu Hua, executive chairman of Yangzijiang Financial, noted: “The recognition of FY2025 allowances reflects prevailing market conditions and aligns our portfolio valuations on a more conservative basis.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“With a strengthened balance sheet and zero external borrowings, we are focused on disciplined capital redeployment and building a more resilient and diversified earnings base over time.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ahead of the results, Yangzijiang Financial climbed 5.1 per cent, or S$0.015, to end at S$0.31 on Friday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It had earlier issued a profit warning for its FY2025 results, which saw its <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/companies-markets/yangzijiang-financial-drops-14-5-2-year-low-expected-reversal-red\" target=\"_blank\">shares falling to a two-year low</a> on Thursday amid heavy trading. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/yangzijiang-financial-sinks-red-h2-posts-fy2025-loss-china-property-provisions",
            "pub_date": "2026-03-01 18:25:41",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saying yes, for less: Why lab-grown diamonds have cornered 80% of the engagement ring market",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] For decades, the mined diamond was the undisputed centrepiece of a marriage proposal, including in Singapore. But pragmatic couples are breaking with tradition by opting for lab-grown stones instead.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Lab-grown diamonds now account for about 80 per cent of engagement ring sales, jewellery stores across the island tell <em>The Business Times</em>.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Part of a worldwide trend, the transition was helped along by the US Federal Trade Commission, which in 2018 stopped defining a diamond as strictly “natural”. </p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/saying-yes-less-why-lab-grown-diamonds-have-cornered-80-engagement-ring-market",
            "pub_date": "2026-03-01 18:11:20",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street turns to ‘haven-first’ strategies amid Iran attacks",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[NEW YORK] The fast-moving conflict across the Middle East is heightening investor anxiety and strengthening the case for safe-haven trades such as Treasuries, gold and the Swiss franc.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Macro traders said all eyes will be on energy markets when trading fully re-opens on Monday (Mar 2), with early indications of volatility also expected when the US dollar and other currencies start to trade in Australia. The possibility of prolonged turmoil in the Middle East and the ripple effects of higher oil prices are giving money managers fresh reasons to sell equities and shift into safety. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Traders will be adopting the strategy of “haven first, ask questions later,” according to John Briggs, head of US rates strategy at Natixis. “The scale of the attacks and Iranian retaliation is larger than what the market expected,” he said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Briggs said Treasuries are likely to extend moves from Friday, when short-term yields sank to levels last seen in 2022. Others are watching energy chokepoints. Roundhill Financial’s Dave Mazza said he is closely tracking what happens to traffic at the Strait of Hormuz, a narrow waterway handling about a quarter of the world’s seaborne oil trade. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is about Hormuz risk, not retaliation. If shipping stays open, stocks can work through it,” he said. “If it doesn’t, all bets are off.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Rich valuations across global equities and credit also make it easier for investors to trim risk, said Ed Al-Hussainy, a portfolio manager at Columbia Threadneedle Investments. Markets have already been on edge over shifting US tariff policy, the disruption from artificial intelligence and stresses tied to private credit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The extent of the de-risking is anyone’s guess,” Al-Hussainy said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Saudi Arabia’s Tadawul All Share Index opened almost five per cent lower before paring most of that decline in Sunday trading. Meanwhile, Bitcoin recovered and was trading around US$68,000. Put options on the cryptocurrency worth US$1.87 billion were concentrated at the US$60,000 level on Deribit, signalling persistent demand for downside protection.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Anxiety over the looming military action had started to filter into markets on Friday. Brent crude closed at the highest price since July, while the S&amp;P 500 lost 0.4 per cent on the day, capping its biggest monthly loss since March. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Strategists at Barclays warned against quickly buying any dip. Investors have grown accustomed to geopolitical flare-ups that fade fast, but this episode risks lasting longer, wrote Ajay Rajadhyaksha, the firm’s global chairman of research, citing the potential for US casualties, strikes on Iranian leadership and disruption to Hormuz traffic. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The risk-reward doesn’t seem compelling,” he said. “If equities pull back enough (say over 10 per cent in the S&amp;P 500), there is likely to come a time to buy. But not yet.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here’s what other investors and strategists had to say: </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Kevin Gordon, head of macro research and strategy for Charles Schwab</strong> </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To the extent that sends oil prices higher on a somewhat sustained basis, there could be a near-term inflationary scare that spooks the equity market. I do think investors need to continue to think about the distinction between front-page risk and bottom-line risk, though. If this conflict has no meaningful downstream impacts on growth or earnings, any negative stock market response has the potential to be short-lived.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Francis Tan, chief Asia strategist at Indosuez Wealth Management</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“There is a high probability that Asia, and onward to Europe and the US will experience a risk-off gap down. The immediate impact will be on airline and travel stocks, as we see news from closures of airspace over the Middle East, and also potentially cancellations of flights that needed to use the airspace en-route to Europe.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Should the situation in the Gulf be sustained over a few months, oil price could be priced above US$100 a barrel and this will reduce any expectations of more Fed rate hikes in 2026. This would be a dampener to growth stocks, particularly tech stocks could experience a decline.” </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Gregory Faranello, head of US rates at Amerivet Securities</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The military operation with Iran could last for a few weeks. We don’t believe it drags on. In the context of the past four years, US Treasuries have been range bound and there is room below for yields, if investors want safe haven. Ultimately yields will be driven by the Fed and economy. This operation in Iran does not change US fundamentals.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Frank Monkam, head of cross asset macro strategy and trading at Buffalo Bayou Commodities</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This Iran strike over the weekend constitutes an almost a perfect sell-off catalyst for an already fragile equity market, and the recent uptick in volatility is likely to extend in the shorter term. That being said, geopolitical flare-ups typically tend to create temporary sell-offs rather than sustained bear markets, so I expect equities to eventually stabilise once Middle East developments are fully digested.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the grander scheme, the macro question is around the potential impact of an oil shock on an economy that’s flashing signs of stagflation-lite based on recent readings. Therefore, I also expect policy volatility to move back to forefront in response over the weeks and months ahead.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Rajeev de Mello, global macro portfolio manager at Gama Asset Management </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“A prolonged escalation in hostilities between the US and Iran would transmit to emerging markets first and foremost through the oil complex.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The majority of large EM economies are net oil importers, and energy remains a meaningful share of both their import bills and inflation baskets. Higher crude oil prices widen current account deficits, compress real incomes, and force central banks to choose between supporting growth and containing inflation expectations. This is particularly relevant given the strong recent performance across EM risk assets: positioning and sentiment have improved, leaving less margin for an adverse terms-of-trade shock.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Joe Gilbert, portfolio manager at Integrity Asset Management </strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Energy stocks and metals will be the leaders as well as real estate and utilities – the more classic defensive groups. Defense stocks will get a bid as well because of the increased demand for their products. Consumer discretionary stocks will be losers because of higher oil prices, which will hurt airlines and retailers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Madison Faller, global investment strategist, and Erik Wytenus, head of EMEA investment strategy, at JPMorgan Private Bank</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“For investors, the ripple effects could reach across the global economy and financial system. Energy is central to these risks, with the Middle East serving as a critical hub for global oil and gas flows. Even the possibility of disruption can quickly affect production costs, consumer prices, monetary policy expectations, market sentiment, and the broader outlook for growth and inflation.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our constructive outlook for the year stands, but these events reinforce the reality of a fragmenting global order. Now more than ever, portfolios should be built for resilience-with both gold and exposure to sectors governments consider strategically vital.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><strong>Maxence Visseau, Dubai-based director of research at investment firm Arkevium</strong></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“I’d expect yields down five to 10 basis points at a minimum on the initial move,” he said referring to Treasuries. “But the complication is oil. If crude spikes towards US$80 to US$90 on any Hormuz disruption, the long-end gets caught in a tug of war between safe-haven demand and repricing of inflation expectations. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">You could see the curve steepen aggressively as the market starts pricing out Fed cuts and breakevens blow wider. The Fed is already stuck at 3.5 to 3.75 per cent with inflation near three per cent – an energy shock makes the an energy shock makes their job significantly harder and could force a hawkish tilt.” BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/wall-street-turns-haven-first-strategies-amid-iran-attacks",
            "pub_date": "2026-03-01 18:05:43",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US-Iran conflict disrupts thousands of flights as travel chaos deepens",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[DUBAI] Global air travel remained heavily disrupted on Sunday (Mar 1) as continued air strikes kept major Middle Eastern airports, including Dubai, the world’s busiest international hub, closed in one of the sharpest aviation shocks in recent years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Key transit airports, including Dubai and Abu Dhabi in the UAE and Doha in Qatar, were shut or severely restricted as much of the region’s airspace remained closed after US and Israeli strikes killed Iranian Supreme Leader Ayatollah Ali Khamenei on Saturday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Israel said it launched another wave of strikes on Iran on Sunday while loud blasts were heard for a second day near Dubai and over Doha after Iran launched retaliatory air attacks on the neighbouring Gulf states.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dubai International Airport sustained damage during Iran’s attacks while airports in Abu Dhabi and Kuwait were also hit. Thousands of flights have been affected across the Middle East, according to data on flight-tracking platform FlightAware.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Airspace over Iran, Iraq, Kuwait, Israel, Bahrain, the UAE and Qatar remained virtually empty, maps by Flightradar24 showed early on Sunday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The flight-tracking service said that a new “Notice to Airmen” (NOTAM) had extended closure of Iranian airspace until at least 0830 GMT on Mar 3.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Ripple effects</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The airport closures have rippled far beyond the Middle East. Dubai and neighbouring Doha sit at the crossroads of east-west air travel, funnelling long-haul traffic between Europe and Asia through tightly scheduled networks of connecting flights. With those hubs idle, aircraft and crews remained stranded out of position, disrupting airline schedules worldwide.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It’s the sheer volume of people and the complexity,” said UK-based aviation analyst John Strickland.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“It is not only customers, it is the crews and aircraft all over place.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Airlines across Europe, Asia and the Middle East cancelled or rerouted flights to avoid closed or restricted airspace, lengthening journeys and driving up fuel costs. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The disruption has been intensified by the loss of Iranian and Iraqi overflight routes, which had grown more important since the Russia-Ukraine war forced airlines to avoid both countries’ airspace. The Middle East airspace closures were squeezing airlines into narrower corridors, with fighting between Pakistan and Afghanistan adding a further risk, said Ian Petchenik, communications director at Flightradar24.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The risk of protracted disruption is the main concern from a commercial aviation perspective,” Petchenik said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Any escalation in the conflict between Pakistan and Afghanistan that results in the closure of airspace would have drastic consequences for travel between Europe and Asia.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Highlighting the scale of the disruption, Air India cancelled its flights on Sunday departing from Delhi, Mumbai and Amritsar for major cities in Europe and North America. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/us-iran-conflict-disrupts-thousands-flights-travel-chaos-deepens",
            "pub_date": "2026-03-01 17:36:44",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ossia’s Goh family picks up S$73 million bloc of 18 strata units at Orchard Shopping Centre",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The Goh family behind Ossia International has bought a portfolio of 18 freehold strata-titled retail units at Orchard Shopping Centre for S$73 million, amid a recent pick-up in deal activity and interest in Singapore’s prime shopping belt. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The acquisition price works out to S$8,171 per square foot (psf) on a strata area of 8,934 square feet (sq ft). The portfolio, owned and managed by JLL affiliate LaSalle Investment Management, comprises two ground-floor units occupied by Maybank, and 16 strata units on the second floor tenanted by RHB Bank and Xiao Long Kan Hotpot. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The price tag is some 19 per cent lower than the previous asking price of S$90 million, when the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/portfolio-of-18-strata-units-at-orchard-shopping-centre-for-sale-at-s90m-indicative-price\" target=\"_blank\">property was marketed in 2022</a>. </p></div>",
            "link": "https://www.businesstimes.com.sg/property/ossias-goh-family-picks-s73-million-bloc-18-strata-units-orchard-shopping-centre",
            "pub_date": "2026-03-01 17:31:25",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Opec+ debates oil output boost as US war on Iran disrupts shipments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON/MOSCOW] Opec+ will consider a larger-than-expected oil output increase on Sunday (Mar 1), two Opec+ sources said after the US-Israeli war on Opec+ member Iran and Teheran’s retaliation led to shipment disruptions in the Middle East.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ has a history of raising oil output to cushion disruptions but analysts said the group currently has very little spare capacity to meaningfully add to supply, except for its leader Saudi Arabia and the United Arab Emirates.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riyadh has been raising oil production and exports in recent weeks in preparation for US strikes on Iran, sources have told Reuters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil, gas and other shipments from the Middle East via the Strait of Hormuz have come to a halt since Saturday after shipowners received a warning from Iran saying the area was closed for navigation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Opec+ will debate a production hike of 411,000 barrels per day or more at a meeting on Sunday, sources told Reuters, larger than the original expectations of 137,000 bpd.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Oil prices jumped on Friday to US$73 per barrel, the highest level since July, on fears of a wider conflict in the Middle East and supply disruptions through Hormuz, the world’s most important oil route amounting to over 20 per cent of global oil transit.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Middle East leaders have warned Washington that a war on Iran could lead to oil prices jumping to over US$100 per barrel, said veteran Opec analyst Helima Croft from RBC. Analysts from Barclays also said prices could rise to US$100.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Croft said the market impact from any large Opec output increase will be limited due to a lack of actual production capabilities outside Saudi Arabia.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The meeting on Sunday will start at 1100 GMT and will involve only eight members of Opec+ – Saudi Arabia, Russia, the UAE, Kazakhstan, Kuwait, Iraq, Algeria and Oman. Opec+ groups the Organization of the Petroleum Exporting Countries and allies like Russia but most production changes in the past years have been done by the eight members.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The eight members raised production quotas by about 2.9 million bpd from April through December 2025, roughly 3 per cent of global demand, before pausing increases for January to March 2026 due to seasonal weakness. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/opec-debates-oil-output-boost-us-war-iran-disrupts-shipments",
            "pub_date": "2026-03-01 17:25:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "People Systems Consultancy partners firms like Maybank to tackle poverty, help marginalised communities upskill",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Rocelito Jancinal from Cebu, the Philippines, lost his livelihood as a technician after an injury and fell into debt when he used his savings for medical treatment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2018, the father of four enrolled in People Systems Consultancy’s (PSC) entrepreneurial programme. He has since expanded into new ventures such as vinegar-making and herb sales, as well as learnt skills such as sales strategies, marketing and money management.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">His income after joining PSC has surged to US$2,300 a month from US$62. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As his business grew, he employed four persons with disabilities (PWDs) and now supports local farmers by getting his supplies from them, as well as trains aspiring organic farmers.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Kuala Lumpur-based social enterprise focuses on beneficiaries with no or low income, and is on a mission to eradicate poverty around South-east Asia. It has already done so for nearly 115,000 families as at February. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Raymond Gabriel, co-founder and executive director of PSC, said: “Through an intervention that (takes) six months to a year, we build the capabilities of the people that we empower through entrepreneurship training, financial-literacy training and mentoring, to raise their incomes… and get them out of poverty.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He added that PSC has a “high” success rate: About 70 per cent of beneficiaries record an income increase of between 100 and 400 per cent in the short term. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We also look at how we have improved their access to education, utilities and healthcare, their confidence and knowledge improvement, and how they are helping their communities after they have come up. So it’s a pay-it-forward model.”</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Key programmes</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">More than 20 years ago, Gabriel volunteered as a social worker to help the homeless in KL. While there were many organisations running programmes to provide basic needs, he realised that it would be more effective to tackle the root problem of poverty.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2008, when PSC was established, it was involved in a programme with Microsoft and Up Foundation to help 120 YWCA beneficiaries in Malaysia. PSC taught them soft skills such as financial literacy and building confidence to complement their vocational training. Ultimately, 90 per cent of them landed a job afterwards, or started their own business.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“In rural areas of Malaysia, sometimes jobs are scarce, so it’s good for (them) to start their own business and empower the local community by giving them jobs as well,” Gabriel said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He started developing and testing PSC’s own programmes. It partners government ministries to source for beneficiaries.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC also has a long-term partnership with Maybank. The Rise programme was piloted in 2014 and has since expanded to Singapore, Indonesia and other Asean markets. It is an entrepreneurship and financial-empowerment programme for disadvantaged communities – particularly for PWDs.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Just like PSC’s own programmes, Rise covers topics to help beneficiaries run a business, such as operations planning, and includes ongoing mentoring. As at end-2025, it had more than 51,000 participants.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC’s standard entrepreneurship programme, which is free for beneficiaries, runs for three days and includes lessons in finance and money management. This is followed by six months of mentoring, where beneficiaries learn about digital marketing and customer service.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“They have to take action on the fourth day (after training)... We have a very rigorous profiling system to make sure that the people who join are serious about starting something,” Gabriel noted, adding that partners and government agencies fund the programmes as they “want to see economic uplift” within certain communities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In addition, PSC runs programmes on financial education, employability and youth empowerment.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Expansion into Singapore, new programmes</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC has branches in Malaysia, Cambodia, Laos, the Philippines and Indonesia, and expanded to Singapore in December 2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gabriel said: “Singapore has good employment policies and there’re jobs for everyone, but not everyone is qualified or educated enough to get a high-paying job. Some people have an innate entrepreneurial spirit, and we can tap into that.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There are three targeted beneficiary groups in Singapore: PWDs and people with mental health issues; people who want to supplement their income; and small and medium-sized enterprises (SMEs). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">PSC currently partners social service agencies such as SG Enable and Touch Community Services to reach beneficiaries.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gabriel added: “We have developed programmes for SMEs looking at going regional and how they can tap different markets, because we have so much experience working in Asean. There’s a lot that we can share with them to enable them to grow faster, from corporate structures to building local systems in place.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this year, PSC launched a tech entrepreneurship programme for those looking to build an online or app-based business.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In PSC’s pipeline is an environmental-focused programme to teach entrepreneurs about carbon reduction. </p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/people-systems-consultancy-partners-firms-maybank-tackle-poverty-help-marginalised-communities",
            "pub_date": "2026-03-01 16:25:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia forms alliance to make sure 6G networks embrace AI",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BARCELONA] Nvidia, the world’s most valuable company, is throwing its weight behind an effort to make sure the forthcoming 6G phone networks provide a strong platform for services and devices that take advantage of artificial intelligence. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia is teaming up with a group of telecommunications companies including Nokia, SoftBank Group and T-Mobile US that will commit to building sixth-generation networks based on computers and software capable of using AI to help direct radio traffic safely and efficiently. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The change is necessary because of myriad devices that will be attached to networks in the future and their more complex requirements, Nvidia said on Sunday (Mar 1) in a statement timed for the opening of a telecom industry conference in Barcelona. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The current generation, 5G, was designed to connect people via voice and data and provide them with retrieved information. It isn’t capable of supporting the widespread use of AI, Nvidia said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The networks of today simply aren’t ready for the use cases of tomorrow,” said Ronnie Vasishta, who heads Nvidia’s telecommunications business and strategy. “In the AI era, everything changes. Networks will deliver intelligence, not just for humans on their phones, but for machines.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Telecommunications networks will require “hundreds of thousands of times” more efficiency because there isn’t enough radio spectrum to support the new uses, he said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The chipmaker, whose gear is at the centre of the AI explosion, is trying to carve out a new market and clear a potential roadblock. Nvidia already offers versions of its chips, computers and software for use in networks and hopes to expand that business. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the same time, the company needs AI to spread to more areas – in things termed physical AI, like robots and vehicles – to continue to fuel demand and pay for the data centres that are currently the biggest consumers of its technology. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Without wireless networks enabled for AI traffic, Nvidia’s vision of a world full of humanoid robots and self-driving cars might be slower to emerge. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Every decade or so the telecommunications business shifts to a new generation of wireless technology, the next “G.” In the run-up to setting standards that determine the parameters of new hardware and software, companies form alliances to steer the industry in a direction they believe will favour their products. That approach has a mixed record and has been undermined by competing efforts that have sometimes delayed new deployments or resulted in networks that are incompatible. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Nvidia argues that new gear and software needs to be fundamentally open. Instead of locked-down devices with bespoke hardware, the radios that send and receive wireless traffic should be controlled by software that can be updated and runs on more general purpose computers. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The data traffic should be routed by AI software that’s capable of responding to rapidly changing patterns and priorities in a way that’s simply not currently possible, according to the chipmaker. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In such an environment, the telecommunications industry will be far more open to the emergence of new providers, including startups that might rapidly attain billion-US dollar valuations, Nvidia’s Vasishta said. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This will be how a new telecom unicorn is born,” he said. There have been far too few new entrants into the industry over the last decade, he added. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/nvidia-forms-alliance-make-sure-6g-networks-embrace-ai",
            "pub_date": "2026-03-01 16:00:38",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China’s policy summit puts tech, stimulus in focus for investors",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BEIJING] China kicks off its most important annual political meeting next week, with investors seeking clarity on how Beijing intends to press ahead with its tech ambitions while reviving a fragile consumer economy.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">At the weeklong gathering of the National People’s Congress starting Mar 5, officials are expected to set a 2026 growth target of 4.5 to 5 per cent, down from around 5 per cent in recent years – a sign leaders may tolerate slower expansion as a property slump and deflation continue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The meeting takes on added importance as policymakers will outline priorities tied to a new five-year plan. Investors will look for details on how Beijing intends to support innovation and rekindle momentum in Chinese stocks, which surged last year thanks to AI but have been subdued this year. They will also be seeking concrete measures to boost domestic demand – an oft-repeated goal that’s light on specifics so far. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The policy meeting “could provide a fresh catalyst for stocks, which have been lacklustre this year amid a lack of policy support,” said Marvin Chen, a strategist at Bloomberg Intelligence. He noted that cyclical and property stocks have historically delivered the strongest gains in the month following the event.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Here are the key areas traders and analysts are watching ahead of the meeting:</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Technology</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From DeepSeek in early 2025 to a surge in robotics shares, tech stocks have powered China’s market rebound. Investors are now seeking reassurance that the rally still has further to run.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">An AI “scare trade” has rattled tech shares globally, triggered by potential disruptions to the economy. In China, the pressure has fallen on traditional Internet giants, with money moving out of Alibaba Group Holding and Tencent Holdings into smaller firms seen as more direct AI beneficiaries like MiniMax Group and Knowledge Atlas Technology.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Technology will remain a key focus for capital allocation,” according to a note by China International Capital Corp. Beyond established AI supply-chain leaders, the analysts see potential winners in cloud computing, smart driving and quantum technology.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Consumption</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reviving domestic demand has been a consistent theme in recent high-level policy meetings. The shift comes as more countries push back against China’s cheap exports, raising the pressure on Beijing to rely less on external demand.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We see meaningful likelihood of enhanced consumption support that goes beyond consumer durables,” said Homin Lee, a senior macro strategist at Lombard Odier in Singapore.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors rotated into consumer sectors earlier this year amid concerns about stretched tech valuations, but the rebound proved short-lived in the absence of a sustained pickup in consumer demand and prices. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The CSI 300 Consumer Discretionary Index and CSI 300 Consumer Staples Index both rank among the least favoured sub-sector gauges in China this year.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">‘Anti-involution’</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China launched the “anti-involution” campaign in 2025 to curb cut-throat competition marked by overcapacity and price wars. The government pushed industries such as solar and electric vehicles to shift their focus towards quality and innovation, rather than mere volume.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Early signs show the drive is gaining traction. Prices in parts of the solar and materials supply chains have rebounded, and shares of photovoltaic companies have climbed to near a two-year high.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">While excess capacity remains an issue, UBS Group says the campaign could help steer the economy towards a reflationary environment in 2026. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Still, investors will be weighing policymakers’ resolve to keep curbing excess capacity while balancing growth and employment pressures.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Property</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A multiyear property slump has been a major drag on China’s economy, and reversing that would require much stronger policy intervention. Officials will likely reaffirm support for a new development model centreed on higher-quality housing and market stabilisation, with further easing likely left to local governments, according to Citigroup Inc.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shanghai recently eased homebuying rules, and Beijing and Shenzhen are expected to follow suit. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Morgan Stanley analysts including Stephen Cheung cautioned it may be too early to turn positive, flagging risks of policy disappointment at the NPC, more profit warnings and a renewed slide in home sales. </p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Bonds</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the bond market, attention will be on the fiscal budget and how much supply pressure government issuance may create, especially at the long end. Beijing is expected to ramp up sales of ultra-long special sovereign bonds to support domestic demand and stabilise growth. Morgan Stanley estimates issuance could reach 1.5 trillion yuan (S$276.4 billion), up from 1.3 trillion yuan last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">China’s yield curve has already steepened on an accommodative monetary policy and a larger debt quota. The spread between 30- and 10-year government bond yields widened to more than 40 basis points at the end of 2025, from 24 basis points a year earlier, reflecting concerns about supply-demand imbalances in longer-dated debt.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Renminbi internationalisation</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Communist Party’s proposal for the next five-year plan through 2030 included a pledge to “push forward the internationalisation of the renminbi.” That’s a bolder stance compared with the previous plan, which called for advancing the goal in a “stable and prudent” manner.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Investors will look for signals on how China plans to capitalise on waning confidence in the US dollar and advance Xi’s ambition for a “powerful currency.” The onshore renminbi remains near a three-year high against the greenback, despite a modest pullback after the People’s Bank of China’s latest effort to cool the rally. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/chinas-policy-summit-puts-tech-stimulus-focus-investors",
            "pub_date": "2026-03-01 15:46:39",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The new age of chokepoints",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">IRAN’S recent partial closure of the Strait of Hormuz has once again exposed how vulnerable global commerce remains to disruption at a handful of narrow passages.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Roughly a fifth of the world’s oil and a significant share of maritime trade pass through Hormuz alone. When tensions constrict such arteries, energy prices, freight rates, insurance premiums and corporate balance sheets <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/possible-hormuz-blockade-threatens-asias-energy-lifeline-unsettling-oil-market\" target=\"_blank\">react</a> almost immediately.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Hormuz is not an anomaly. The global economy runs on a small number of critical passages, including the Suez Canal, Panama Canal and Strait of Malacca, that together carry more than half of global maritime trade.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/new-age-chokepoints",
            "pub_date": "2026-03-01 15:36:20",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}