{
    "data": [
        {
            "title": "Cancer risk is lower for vegetarians but not vegans, study finds",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[LONDON] Vegetarian diets are linked with a lower risk of several cancers, including pancreatic, breast and prostate, according to a study that found no similar benefit – and even a higher chance of colon cancer – among vegans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Researchers found people on vegetarian diets had a lower risk of five cancers compared with their meat-eating counterparts, though vegetarians had nearly double the risk of a cancer in the oesophagus called squamous cell carcinoma. The pioneering study, published on Friday (Feb 27) in the <em>British Journal of Cancer</em>, looked at pooled data from more than 1.8 million people across three continents.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The findings come at a time of renewed focus on diet after the US President Donald Trump’s administration updated US nutrition guidelines with an emphasis on animal-based protein. Concerns around the impact of ultra-processed foods, which the study did not look at, are also growing in the US and globally.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Though the study did not probe the cause of a higher or lower risk of certain cancers, researchers hypothesised that diets higher in fruit, vegetables, fibre and without processed meat could lower risks. The lack of meat is likely to be the reason for the different risk, according to Tim Key, emeritus professor of epidemiology at Oxford Population Health and co-investigator of the study.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Perhaps the biggest surprise was the finding for vegans. Red meat intake has long been associated with bowel cancer, yet vegans – who eat no meat or dairy – had a higher risk of this cancer in the study.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That may have been because many of the meat eaters in the study only ate moderate amounts of processed meat, according to the researchers. There were also relatively few overall cases of colon cancer among the vegans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Still, the researchers said dairy might hold the key. “We are postulating that it could be because vegans have no dairy intake,” said Yashvee Dunneram, first author of the study. “Their calcium intake are really low in this consortium.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The reduction in key vitamins and minerals might also be in play when it comes to the significantly higher risk among vegetarians of squamous cell carcinoma. “It may be related with a low intake of riboflavin,” said Aurora Perez Cornago, principal investigator of the study, while stressing that this was just a hypothesis. Riboflavin, also known as vitamin B2, is found in foods such as beef liver, eggs, fortified cereals, and milk.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Vegetarians in the study did have a lower risk of pancreatic, breast, prostate, kidney and multiple myeloma. One possible factor is weight. The vegetarians in the study had a lower body mass index, and while the researchers adjusted for this in the results, they hypothesised that this weight difference could still be behind the lower risk of breast cancer, for example.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">People on pescatarian diets, meaning they eat seafood and dairy but do not eat meat, also showed a lower risk of colon, breast and kidney cancer in the study.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">One thing missing from the study was a comparison to a diet based on guidelines from the UK’s National Health Service, where meat and fish are consumed but only in moderation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">That provides important nutrients and may be the optimum diet for reducing the risk of diet-associated cancer, according to Jules Griffin, director of the Rowett Institute at the University of Aberdeen, who was not involved in the study. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/cancer-risk-lower-vegetarians-not-vegans-study-finds",
            "pub_date": "2026-02-27 10:05:42",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "English Premier League set to launch direct-to-consumer streaming in Singapore",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] The English Premier League (EPL) is set to launch a direct-to-consumer streaming service in Singapore, its chief executive Richard Masters reportedly announced at the <em>Financial Times</em>’ Business of Football conference on Feb 26.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">He told the audience at the Peninsula Hotel, London, that the Premier League will go direct to consumer with its own streaming offering for the first time, after electing to launch a service in Singapore “in partnership” with StarHub, its existing rights holder.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As reported in British tabloid <em>The Sun</em>, Masters said: “For the first time, we are going direct-to-consumer in Singapore. It’s a very long, considered process, carefully chosen.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We have a six-year agreement with StarHub, one of the two providers out there. “So from next season onwards, Premier League Plus – rather than Premflix – finally, it’s going to happen.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">StarHub holds the Premier League rights in Singapore from 2022 to 2028, showing all 380 matches per season.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reporting on the development,<em> The Athletic </em>of <em>The New York Times</em> noted that the move means that the EPL has finally decided to cut out the middleman by launching its own direct-to-consumer streaming channel in Singapore – a move that may signal the end of a decades-old broadcasting model.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In its report, Masters was quoted as saying: “It will be a new app that you can download on your smart TV or laptop. You’ll be able to watch 380 games a season, with lots of shoulder content and a 24/7 dedicated channel.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Will it be replicable elsewhere? That’s what we are going to find out.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In 2020, the Premier League boss first revealed that the league was looking into plans to sell content via a direct streaming platform in a move that could see lower subscription costs for fans. This would eliminate the middleman and allow the league to provide content straight to viewers, rather than via rights sales to TV broadcasters.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Premier League Plus model could be similar to the National Basketball Association’s (NBA) subscription service, which offers annual and monthly plans for fans here to watch matches on the official app. <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.straitstimes.com/sport/football/english-premier-league-set-to-launch-direct-to-consumer-streaming-in-singapore?ref=top-stories\" target=\"_blank\">THE STRAITS TIMES</a></p></div>",
            "link": "https://www.businesstimes.com.sg/lifestyle/english-premier-league-set-launch-direct-consumer-streaming-singapore",
            "pub_date": "2026-02-27 09:55:37",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Board of Peace: Bold vision, uncertain future",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN US President Donald Trump announced the formation of the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/global/billion-dollar-membership-fee-what-know-about-trumps-board-peace-gaza\" target=\"_blank\">Board of Peace</a> in October 2025, many dismissed it as theatrical diplomacy – another headline-grabbing gesture dressed up in superlatives.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As representatives from more than 40 nations <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/over-20-countries-will-attend-trumps-board-peace-meeting-feb-19-white-house\" target=\"_blank\">gathered</a> at the US Institute of Peace in Washington for the board’s inaugural meeting on Feb 19, it became harder to wave it away entirely. But it also became harder to take it entirely at face value. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">What emerged from the day’s proceedings was a portrait of something genuinely unprecedented: an international body that is equal parts promising and problematic, visionary and vague.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/board-peace-bold-vision-uncertain-future",
            "pub_date": "2026-02-27 09:55:36",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell expects AI server revenue to double in fiscal 2027 on data centre boom",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BENGALURU] Dell said that it expects revenue from its key artificial intelligence (AI)-optimised servers business to double in fiscal year 2027 and promised to return more cash to shareholders, sending its shares surging 10 per cent in extended trading.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company announced a 20 per cent hike in its cash dividend and an additional US$10 billion for its share repurchase programme. Big tech firms, such as Alphabet, Microsoft, Amazon, and Meta, are expected to spend at least US$630 billion to build AI infrastructure this year, which would boost demand for server and data centre equipment from vendors such as Dell and rival Super Micro Computer.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US trade regulations and surging memory chip costs due to the AI infrastructure buildout have forced companies such as Dell and HP to implement price increases, which are helping them offset cost pressures. Almost all servers have memory chips that hold data and instructions, keeping processors running at high speed, which is paramount for AI applications.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Initially, infrastructure clients experienced “sticker shock” but quickly grasped the supply constraints, shifting their focus to securing necessary components, which led large customers to aggressively acquire supply for their AI servers, traditional servers, and storage build-outs, Dell chief operating officer Jeff Clarke said on a post-earnings call.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company raised server prices on Dec 10, while price changes for PCs occurred on Jan 6, Clarke said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell expects AI server revenue to grow 103 per cent to about US$50 billion in fiscal 2027.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company said that it has more than 4,000 AI server customers, including Elon Musk’s AI startup xAI and CoreWeave.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell forecast annual revenue of US$138 billion to US$142 billion, above analysts’ average estimate of US$125.54 billion, according to data compiled by LSEG. The memory chip squeeze is expected to dampen global demand for consumer electronics, including PCs, smartphones, and gaming consoles. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HP said that it expected fiscal 2026 results to be at the low end of its prior forecasts, while China’s Lenovo warned about mounting pressures on PC shipments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“By proactively addressing rising memory costs, and demonstrating early success reflected in both its fiscal first quarter results and full-year guidance, the company showed it is getting ahead of a challenge that continues to pressure peers,” said Hendi Susanto, a portfolio manager and research analyst at Gabelli Funds, which holds Dell shares.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell expects annual adjusted earnings per share (EPS) of US$12.90, above estimates of US$11.59.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the first quarter, Dell expects revenue between US$34.7 billion and US$35.7 billion, above estimates of US$29.13 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The first-quarter adjusted EPS forecast of US$2.90 exceeded estimates of US$2.37.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It reported record revenue of US$33.4 billion in the fourth quarter, beating estimates of US$31.73 billion. Its adjusted EPS of US$3.89 also exceeded the US$3.53 estimate.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell’s revenue from its infrastructure solutions group, which includes its storage, software, and server offerings, jumped 73 per cent to US$19.60 billion, while sales from the client solutions group, home to PCs, rose 14 per cent to US$13.49 billion. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/global/dell-expects-ai-server-revenue-double-fiscal-2027-data-centre-boom",
            "pub_date": "2026-02-27 09:46:19",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Yangzijiang Shipbuilding rises nearly 10% on higher H2 profit",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Shares of Yangzijiang Shipbuilding rallied on Friday (Feb 27) morning after the Chinese vesselmaker posted higher earnings for its second half. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The counter climbed as much as S$4.31 in early trade, 9.9 per cent or S$0.39 higher than Thursday’s closing price of S$3.92. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at 9.17 am it had eased to S$4.26, up 8.7 per cent or S$0.34 with close to 20.6 million shares changing hands. It was one of the top traded counters on the stock exchange by volume. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company on Wednesday posted a 24.6 per cent rise in net profit to 4.5 billion yuan (S$827.4 million) for its second half ended Dec 31, from 3.6 billion yuan in the corresponding year-ago period.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This brought its FY2025 earnings to 8.6 billion yuan, 30.2 per cent higher than the previous year’s 6.6 billion yuan. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/yangzijiang-shipbuilding-rises-nearly-10-higher-h2-profit",
            "pub_date": "2026-02-27 09:40:47",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seatrium delivers wind turbine installation vessel to Maersk Offshore Wind for Empire Wind project",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Seatrium has delivered a wind turbine installation vessel to its customer, Maersk Offshore Wind, which will facilitate the development of a wind farm. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The vessel, which was built and custom-engineered by Seatrium for the purpose of installing some of the world’s largest offshore wind turbines, is due to set sail in March for its first assignment at the Empire Wind project located off the coast of New York.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">There, it will play a pivotal role in the project, in advancing the wind farm’s mission to deliver clean and reliable energy to 500,000 homes, said the offshore and marine specialist on Friday (Feb 27). </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">William Gu, executive vice-president of Seatrium Energy (Marketing), noted that the vessel represents a “major step forward” for the global offshore wind sector.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“We are proud to deliver this unique vessel to our partner, Maersk Offshore Wind, to advance the progress of the end customer’s wind farm development,” Gu said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The vessel’s delivery on Thursday comes after the completion of sea trial activities and final readiness evaluations.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Seatrium noted that the next-generation vessel has a feeder-based installation design that enhances operational efficiency, as it is equipped with a stabilising system that can hold feeder vessels for the transfer of offshore wind components in high sea states.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This feature improves installation efficiency by extending the operational weather window, Seatrium said. This ensures the vessel can carry out uninterrupted installations, improves operational efficiency and reduces total cost and time of installation. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the feeder-based installation solution design feature is compliant with the US Jones Act and can also be deployed in other geographies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Seatrium shares closed Thursday 3.2 per cent higher at S$2.28, before the news.</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/seatrium-delivers-wind-turbine-installation-vessel-maersk-offshore-wind-empire-wind-project",
            "pub_date": "2026-02-27 09:35:44",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell expects AI server revenue to double in fiscal 2027 on data centre boom",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BENGALURU] Dell said that it expects revenue from its key artificial intelligence (AI)-optimised servers business to double in fiscal year 2027 and promised to return more cash to shareholders, sending its shares surging 10 per cent in extended trading.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company announced a 20 per cent hike in its cash dividend and an additional US$10 billion for its share repurchase programme. Big tech firms, such as Alphabet, Microsoft, Amazon, and Meta, are expected to spend at least US$630 billion to build AI infrastructure this year, which would boost demand for server and data centre equipment from vendors such as Dell and rival Super Micro Computer.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US trade regulations and surging memory chip costs due to the AI infrastructure buildout have forced companies such as Dell and HP to implement price increases, which are helping them offset cost pressures. Almost all servers have memory chips that hold data and instructions, keeping processors running at high speed, which is paramount for AI applications.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Initially, infrastructure clients experienced “sticker shock” but quickly grasped the supply constraints, shifting their focus to securing necessary components, which led large customers to aggressively acquire supply for their AI servers, traditional servers, and storage build-outs, Dell chief operating officer Jeff Clarke said on a post-earnings call.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company raised server prices on Dec 10, while price changes for PCs occurred on Jan 6, Clarke said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell expects AI server revenue to grow 103 per cent to about US$50 billion in fiscal 2027.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The company said that it has more than 4,000 AI server customers, including Elon Musk’s AI startup xAI and CoreWeave.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell forecast annual revenue of US$138 billion to US$142 billion, above analysts’ average estimate of US$125.54 billion, according to data compiled by LSEG. The memory chip squeeze is expected to dampen global demand for consumer electronics, including PCs, smartphones, and gaming consoles. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">HP said that it expected fiscal 2026 results to be at the low end of its prior forecasts, while China’s Lenovo warned about mounting pressures on PC shipments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“By proactively addressing rising memory costs, and demonstrating early success reflected in both its fiscal first quarter results and full-year guidance, the company showed it is getting ahead of a challenge that continues to pressure peers,” said Hendi Susanto, a portfolio manager and research analyst at Gabelli Funds, which holds Dell shares.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell expects annual adjusted earnings per share (EPS) of US$12.90, above estimates of US$11.59.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In the first quarter, Dell expects revenue between US$34.7 billion and US$35.7 billion, above estimates of US$29.13 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The first-quarter adjusted EPS forecast of US$2.90 exceeded estimates of US$2.37.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">It reported record revenue of US$33.4 billion in the fourth quarter, beating estimates of US$31.73 billion. Its adjusted EPS of US$3.89 also exceeded the US$3.53 estimate.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Dell’s revenue from its infrastructure solutions group, which includes its storage, software, and server offerings, jumped 73 per cent to US$19.60 billion, while sales from the client solutions group, home to PCs, rose 14 per cent to US$13.49 billion. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/dell-expects-ai-server-revenue-double-fiscal-2027-data-centre-boom",
            "pub_date": "2026-02-27 09:35:43",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anil Ambani’s US$410 million Mumbai condo seized in probe",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[MUMBAI] Indian investigators seized a US$410 million luxury condominium building owned by Anil Ambani as part of a widening probe into alleged bank fraud by the tycoon.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Enforcement Directorate, India’s anti-money laundering agency, said on Wednesday (Feb 25) that it had provisionally taken Ambani’s 17-storey property, known as “Abode”, in the upscale Pali Hill neighbourhood. The agency alleged Ambani has defaulted on over 400 billion rupees (S$4.4 billion) worth of loans from Indian and foreign banks.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ambani, 66, runs Reliance Group and is the younger brother of Mukesh Ambani, Asia’s richest man. The two split the empire after their father’s death in 2002. Anil Ambani has faced financial distress for years, defaulting on bank loans and other debt since at least 2016. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Most recently, his name surfaced in documents related to Jeffrey Epstein, which showed that he had met the disgraced financier on several occasions to discuss business, politics and women.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The federal agency said the home was transferred into a private family trust in a restructuring designed to “shield it” from Ambani’s personal liabilities, mainly claims tied to guarantees he had given to bankers for company loans.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Reliance Group, which is separate from Mukesh Ambani’s Reliance Industries, did not respond to requests for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ambani “fraudulently mis-utilised” a substantial amount of borrowed funds into various privately held companies and personal investments, according to the agency’s November attachment order. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">So far, properties worth over 157 billion rupees have been seized, all linked to Anil Ambani’s Reliance Communications. A separate probe into alleged bank fraud and defaults by other group entities, including shadow banks previously owned by Ambani, is underway, the agency said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, India’s Central Bureau of Investigation (CBI) conducted searches at Ambani’s office and residence in a separate case, the federal law enforcement agency said in a statement on Thursday. The CBI has registered a second case against Ambani following a complaint from Bank of Baroda, alleging conspiracy, cheating and criminal misconduct, according to the statement.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Indian banks, led by the country’s largest lender, State Bank of India, classified Reliance Communications as a fraud account in July last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Ambani appeared before the federal anti-money laundering agency on Thursday for a second round of questioning, according to a Press Trust of India report.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this month, India’s Supreme Court directed the Enforcement Directorate to set up a special investigations team for a deeper probe into various allegations of fraud involving Ambani’s companies. The next hearing is due on Mar 10.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As Ambani’s troubles mounted over the years, he sought to raise funds by selling assets and subsidiaries, while lenders and creditors eventually pushed the telecom arm and his shadow banking businesses into insolvency proceedings. BLOOMBERG</p></div>",
            "link": "https://www.businesstimes.com.sg/international/anil-ambanis-us410-million-mumbai-condo-seized-probe",
            "pub_date": "2026-02-27 09:21:17",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CapitaLand Ascendas Reit enters Spain with S$185.4 million logistics portfolio acquisition",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] CapitaLand Ascendas Reit (Clar) made its maiden entry into the Spanish market, acquiring a portfolio of six Grade A logistics assets for S$185.4 million, the real estate investment trust’s (Reit) manager announced on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The portfolio comprises two logistics assets in Madrid and four in Barcelona.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The acquisition is expected to be distribution per unit (DPU) accretive for unitholders, the Reit manager said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">On a pro forma basis, assuming the deal had been completed on Jan 1, 2025, the DPU accretion is estimated at S$0.00014, representing a 0.1 per cent increase.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The S$185.4 million price represents a 5.9 per cent discount to the portfolio’s independent market valuation of S$197 million as at Oct 31, 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The manager noted that the first-year net property income yield is expected to be 6.3 per cent before transaction costs and 6.5 per cent after costs.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Strategic push into Spain</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The portfolio comprises 98,825 square metres of Grade A space, consisting of:</p><ul class=\"list-outside list-disc mb-4 md:mb-6 [&amp;&gt;ul]:list-outside [&amp;&gt;ul]:list-decimal [&amp;&gt;ul]:pl-8 pl-8 md:pl-8\" data-testid=\"article-list-bulleted-component\"><li class=\"whitespace-pre-wrap text-xl\">Madrid (two assets): Located in Torrejon de Ardoz, these properties are situated along the A-2 highway and are within 15 minutes of Madrid’s international airport.</li><li class=\"whitespace-pre-wrap text-xl\">Barcelona (four assets): Located in Sant Feliu de Buixalleu, these assets sit near the AP-7 motorway, a key transport artery in Spain.</li></ul><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The portfolio is fully occupied, and features a weighted average lease to expiry of 9.1 years with index-linked rental adjustments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“Our first acquisition in Spain deepens Clar’s presence in the United Kingdom/Europe and enhances the scale, quality and geographic diversification of our logistics portfolio,” said William Tay, chief executive officer of the manager.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Funding</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Clar is expected to incur a total investment cost of S$181 million.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The transaction was financed through internal resources and existing debt facilities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Following the acquisition, Clar’s aggregate leverage will increase marginally to 39.1 per cent from 39 per cent as at Dec 31, 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“The acquisition aligns with our disciplined investment strategy of acquiring modern, well-located assets in developed markets with healthy fundamentals,” said Tay.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The addition of the Spanish assets raises the proportion of logistics properties in Clar’s total S$18.5 billion portfolio to 26 per cent, up from 24 per cent at the end of last year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Units of Clar ended 0.4 per cent or S$0.01 higher at S$2.70 on Thursday. </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/capitaland-ascendas-reit-enters-spain-s185-4-million-logistics-portfolio-acquisition",
            "pub_date": "2026-02-27 09:15:46",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI and accountancy: Evolution or elimination?",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHENEVER a new wave of technology emerges, the same question follows: Will this <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/opinion-features/pursue-responsible-ai-growth-business-leaders-must-address-labour-displacement\" target=\"_blank\">replace jobs</a>?</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With artificial intelligence (AI), that question feels more urgent. AI can scan thousands of transactions in seconds. It can detect patterns humans might miss. Understandably, people are asking whether <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-why-singapores-white-collar-ai-training-drive-starting-law-and-accounting\" target=\"_blank\">accountants</a>, especially junior ones, will become obsolete. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From the lens of the Institute of Singapore Chartered Accountants (Isca), that is not where the profession is heading.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/ai-and-accountancy-evolution-or-elimination",
            "pub_date": "2026-02-27 09:15:45",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}