{
    "data": [
        {
            "title": "Panama officials search CK Hutchison’s subsidiary office: source",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[PANAMA CITY] Panamanian authorities conducted a search of an office unit of Hong Kong conglomerate CK Hutchison in Panama on Thursday (Feb 26), according to a source familiar with the operation.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The raid on CK Hutchison’s Panama Ports Company (PPC) did not relate to a government decision to annul deals that gave the company control of two strategic port canals in Panama, this source said.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The source declined to be identified because the information had not yet been made public.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CK Hutchison did not immediately respond to a request for comment.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“This is an independent investigation carried out exclusively by the Public Ministry of Panama in the exercise of its legal powers,” the Panamanian government said in a statement without naming CK Hutchison as the target of the raid.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CK Hutchison’s shares fell 0.9 per cent in early trading in Hong Kong on Friday.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Local media reported the raid earlier. Television station TVN showed images of about a dozen people, some wearing vests emblazoned with the initials of Panama’s investigative police, or DIJ, in an underground parking lot that the station said was in the high-end Albrook area of Panama City.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The images showed some of the people loading cardboard boxes into the back of a police truck.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The name of the location was not visible in the images, and Reuters could not independently verify the report.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">A judicial official interviewed on a local television station confirmed a search had taken place, but did not name the business or what materials had been seized.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Panama’s top court recently declared unconstitutional CK Hutchison’s contracts to operate port terminals at the entrance to the Panama Canal, leading the government to annul the deals.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The decision sparked a battle embroiling both Beijing and Washington, after pressure from US President Donald Trump for Panama to curb Chinese influence over the Panama Canal, which carries about 5 per cent of global maritime trade.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CK Hutchison has said that it sees the decision as unlawful and is considering legal action. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/panama-officials-search-ck-hutchisons-subsidiary-office-source",
            "pub_date": "2026-02-27 11:50:43",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia court jails ex-CEOs of Pertamina units in major graft case",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[JAKARTA] An Indonesian court has jailed nine people in a major corruption case involving subsidiaries of state energy firm Pertamina, including two former chief executives of its units, which prosecutors say caused US$17 billion in state losses.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The case, which centres on alleged illegal leasing of a fuel terminal and illegal imports of crude oil, among other offences, is one of the biggest launched under the administration of President Prabowo Subianto, who has vowed to eradicate corruption.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The nine were sentenced by the Central Jakarta Court, with the reading of the verdicts starting on Thursday (Feb 26) afternoon and continuing into the early hours of Friday. The defendants were sentenced to prison terms ranging from nine years to 15 years, after prosecutors had sought terms of 14 to 18 years. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Yoki Firnandi, former chief executive of Pertamina International Shipping, and Riva Siahaan, former Pertamina Patra Niaga chief executive, each received a nine-year sentence from the panel of judges. Muhamad Kerry Adrianto Riza, a beneficial owner of a fuel terminal leased by Pertamina, was jailed for 15 years for his involvement, less than the 18 years sought by prosecutors.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riza is the son of businessman Mohammad Riza Chalid, who has been named a suspect in the case and who the police said is now at large.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The three men had each denied the charges against them and pleaded not guilty, local media reported during the trial.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Riza’s lawyer Patra Zen said on Friday that his client rejected the ruling and would appeal.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Outside the court on Friday, Firnandi said that he was disappointed by a verdict that he called a farce, and said he would discuss with his counsel about appealing.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Siahaan’s lawyer Luhut Pangaribuan said that he was saddened and disappointed by the verdict.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Pertamina did not immediately respond to a request for comment. The company has previously said that it respected the legal process and had cooperated with the investigation. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/international/asean/indonesia-court-jails-ex-ceos-pertamina-units-major-graft-case",
            "pub_date": "2026-02-27 11:35:41",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Board of Peace: Bold vision, uncertain future",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHEN US President Donald Trump announced the formation of the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/global/billion-dollar-membership-fee-what-know-about-trumps-board-peace-gaza\" target=\"_blank\">Board of Peace</a> in October 2025, many dismissed it as theatrical diplomacy – another headline-grabbing gesture dressed up in superlatives.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As representatives from more than 40 nations <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/international/over-20-countries-will-attend-trumps-board-peace-meeting-feb-19-white-house\" target=\"_blank\">gathered</a> at the US Institute of Peace in Washington for the board’s inaugural meeting on Feb 19, it became harder to wave it away entirely. But it also became harder to take it entirely at face value. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">What emerged from the day’s proceedings was a portrait of something genuinely unprecedented: an international body that is equal parts promising and problematic, visionary and vague.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/board-peace-bold-vision-uncertain-future",
            "pub_date": "2026-02-27 11:21:14",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "450 high-net-worth investors granted Singapore PR under Global Investor Programme from 2015 to 2025",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] Around 450 high-net-worth investors were granted permanent residency under the Global Investor Programme (GIP) between 2015 and 2025, injecting about S$500 million directly into Singapore-based entities, Minister of State for Trade and Industry Gan Siow Huang said in Parliament on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The GIP grants PR status to eligible global investors who make significant investments to drive business growth in Singapore.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">More than half of the S$500 million invested went to the professional services, info-communications and financial services sub-sectors, said Gan. Another S$430 million was placed in GIP-select funds investing in Singapore-based companies.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Qualified investors may apply for the GIP through three options: investing at least S$10 million in a Singapore-based business; placing at least S$25 million in a GIP-select fund; or establishing a single family office with at least S$200 million in assets under management, of which at least S$50 million must be deployed in Economic Development Board (EDB)-specified investments.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">About half of the investors invested directly in Singapore-based businesses, 40 per cent placed money in GIP-select funds, and the remaining 10 per cent set up single family offices.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“EDB works with the GIP recipients to ensure that they continue to fulfil the government’s specified economic and residency commitments during their stay,” said Gan, in response to questions from Workers’ Party MP Fadli Fawzi.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Qualified investors are required to submit evidence of the Singapore-based companies that they have invested in. EDB also conducts visits to these companies to assess their business activities.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Asked by Fadli if the profile and volume of GIP applicants has changed since the 2023 review – when investment thresholds for all three options were raised – Gan replied that there has not been a major change yet.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">She noted, however, that the composition of GIP-select funds have shifted since the review: “In fact, I would say that prior to 2023, the GIP funds comprised mainly of local funds.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">GIP applicants who have chosen to invest through the select funds since the review are still going through the application process and have yet to confirm their investments, Gan added. </p></div>",
            "link": "https://www.businesstimes.com.sg/singapore/450-high-net-worth-investors-granted-singapore-pr-under-global-investor-programme-2015-2025",
            "pub_date": "2026-02-27 11:16:16",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold steady as investors weigh progress in US-Iran talks",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[BENGALURU] Gold prices held broadly steady on Friday (Feb 27), with investors digesting the previous day’s US-Iran nuclear talks, while the US dollar, hovering near three-week highs, pressured the yellow metal. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Spot gold was steady at US$5,187.39 per ounce by 9.46 am. Bullion hit a more than three-week high on Tuesday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">US gold futures for April delivery were up 0.2 per cent at US$5,204.10. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The US dollar held steady to hover near three-week highs, making US dollar-denominated gold more expensive for holders of other currencies. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The number of Americans filing new applications for jobless benefits increased slightly last week, and the unemployment rate appeared to hold steady in February amid a stable labour market. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meanwhile, Federal Reserve chair nominee Kevin Warsh’s path to out-of-the-gate interest rate cuts in alignment with US President Donald Trump’s expectations could be narrowing amid emerging bullishness about the US economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank’s policymakers. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Markets currently expect three 25-basis-point rate cuts from the Federal Reserve this year, according to CME’s FedWatch Tool. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Gold looks neutral in a range of US$5,158 to US$5,201 per ounce, and an escape could suggest a direction, Reuters technical analyst Wang Tao said, adding that the bias might be towards the upside, it is supposed to travel to US$5,243 or a much higher level. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In Geneva, the US and Iran made progress in talks over Tehran’s nuclear programme on Thursday, mediator Oman said, but hours of negotiation ended with no sign of a breakthrough that could avert potential US strikes amid a massive military buildup.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Spot silver rose 0.6 per cent to US$88.81 per ounce, after climbing to a three-week high on Wednesday. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Spot platinum added 0.6 per cent to US$2,286.53 per ounce, while palladium gained 0.5 per cent to US$1,794.13. REUTERS </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/energy-commodities/gold-steady-investors-weigh-progress-us-iran-talks",
            "pub_date": "2026-02-27 11:12:06",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sweet succession: The heir rewriting Vietnam’s largest sugar empire",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\"><em><strong>Inside Asia’s family empires: How they are transforming to seize the next stage of growth</strong></em></p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[HO CHI MINH CITY] Far from the cane fields that built her family’s fortune, Dang Huynh Uc My, or Omi Dang – the daughter of a couple once dubbed Vietnam’s “sugar king and sugar queen” – set up a modest three-person office in Singapore to plot an unlikely overseas push for AgriS. It would prove to be a sweet spot.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Fifteen years on, that tentative outpost has become the nerve centre of AgriS’ international expansion – a strategy that helped transform a domestic sugar champion into a group with more than US$1 billion in annual revenue and exports to nearly 80 countries.</p></div>",
            "link": "https://www.businesstimes.com.sg/international/asean/sweet-succession-heir-rewriting-vietnams-largest-sugar-empire",
            "pub_date": "2026-02-27 11:05:42",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL H2 net profit up over four times at S$538.5 million on improved showings across all segments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->City Developments Ltd’s (CDL)<!-- --> <!-- --> second-half earnings rose 374.3 per cent to S$538.5 million, from S$113.5 million in the previous corresponding period.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This more than tripled the group’s full-year earnings to S$629.7 million, from S$201.3 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The improvements were primarily driven by robust residential sales in Singapore and strong capital recycling gains, notably, from the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/cdl-selling-its-50-1-south-beach-stake-its-malaysian-partner-ioi-s834-million-yielding-s465-million\" target=\"_blank\">sale of a 50.1 per cent stake in the South Beach mixed-use development</a> in H2 to Malaysian partner IOI Properties Group, said CDL on Friday (Feb 27). The S$834 million transaction yielded a S$465 million gain.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sherman Kwek, CDL’s group chief executive officer, said that strong residential sales in Singapore and accelerated capital recycling drove a “significant uplift” to the group’s earnings, despite the company facing a “challenging environment with ongoing economic uncertainties” in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” Kwek said. “We have taken decisive steps to unlock value from mature and non-core assets while selectively redeploying capital to drive growth.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In early 2025, Kwek was embroiled in a public feud with his father and CDL executive chairman Kwek Leng Beng, but the matter was settled subsequently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the second half, CDL posted an earnings per share (EPS) of S$0.598, versus S$0.121 in the year-ago period. EPS for the full year rose to S$0.694, from S$0.213 in the previous financial year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 stood at S$1.9 billion, up 11.1 per cent on the year from S$1.7 billion. Full-year revenue grew 9.7 per cent to S$3.6 billion from S$3.3 billion.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Better results across all segments</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said that all its business segments reported improvements for H2 and FY2025, with the property development segment being the biggest contributor to revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, that segment’s revenue rose 24.1 per cent on the year to S$1.2 billion, supported by higher contributions from Singapore projects such as The Myst, Norwood Grand and Union Square Residences. The sales of the Ransome’s Wharf site in London and the office component of Suzhou Hong Leong City Center in China also boosted revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, the hotel operations segment saw a 1.7 per cent increase in revenue and improvements in revenue per available room, said CDL. This was supported by new additions including The Mayfair Hotel Christchurch, acquired in January 2025, and the Hilton Paris Opera, acquired in May 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the increase in gross profits for H2 and FY2025 was marginal, despite its revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its overall gross profit margin fell to 41 per cent for H2 and FY2025, from 45 per cent for both periods in 2024, as it was impacted by an S$80.5 million allowance for foreseeable losses that was made in relation to China development properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, CDL maintained strong cash reserves of S$2.1 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board proposed a final dividend of S$0.25 per share, payable on May 19, after the record date of May 4. Together with the special interim dividend of S$0.03 per share paid in September 2025, the total ordinary dividend for FY2025 amounts to S$0.28 per share, representing a 40 per cent dividend payout ratio. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of CDL ended Thursday 6 per cent or S$0.60 down at S$9.36.  </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/cdl-h2-net-profit-over-four-times-s538-5-million-improved-showings-across-all-segments",
            "pub_date": "2026-02-27 10:56:21",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDL H2 net profit up over four times at S$538.5 million on improved showings across segments",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[SINGAPORE] <!-- --> <!-- -->City Developments Ltd’s (CDL)<!-- --> <!-- --> second-half earnings rose 374.3 per cent to S$538.5 million, from S$113.5 million in the previous corresponding period.  </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">This more than tripled the group’s full-year earnings to S$629.7 million, from S$201.3 million in FY2024.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The improvements were primarily driven by robust residential sales in Singapore and strong capital recycling gains, notably, from the <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/property/cdl-selling-its-50-1-south-beach-stake-its-malaysian-partner-ioi-s834-million-yielding-s465-million\" target=\"_blank\">sale of a 50.1 per cent stake in the South Beach mixed-use development</a> in H2 to IOI Properties Group, said CDL on Friday (Feb 27).</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Sherman Kwek, CDL’s group chief executive officer, said that strong residential sales in Singapore and accelerated capital recycling drove a “significant uplift” to the group’s earnings, despite the company facing a “challenging environment with ongoing economic uncertainties” in 2025.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">“To maximise shareholder returns, we are actively reviewing our growth strategy, portfolio structures and capital allocation priorities,” Kwek said. “We have taken decisive steps to unlock value from mature and non-core assets while selectively redeploying capital to drive growth.”</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">In early 2025, Kwek was embroiled in a public feud with his father and CDL executive chairman Kwek Leng Beng, but the matter was settled subsequently.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For the second half, CDL posted an earnings per share (EPS) of S$0.598, versus S$0.121 in the year-ago period. EPS for the full year rose to S$0.694, from S$0.213 in the previous financial year.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Revenue for H2 stood at S$1.9 billion, up 11.1 per cent on the year from S$1.7 billion. Full-year revenue grew 9.7 per cent to S$3.6 billion from S$3.3 billion.</p><h2 class=\"-tracking-5% mb-4 md:mb-6\" data-testid=\"heading-component\">Better results across all segments</h2><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">CDL said that all its business segments reported improvements for H2 and FY2025, with the property development segment being the biggest contributor to revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">For FY2025, that segment’s revenue rose 24.1 per cent on the year to S$1.2 billion, supported by higher contributions from Singapore projects such as The Myst, Norwood Grand and Union Square Residences. The sales of the Ransome’s Wharf site in London and the office component of Suzhou Hong Leong City Center in China also boosted revenue.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Notably, the hotel operations segment saw a 1.7 per cent increase in revenue and improvements in revenue per available room, said CDL. This was supported by new additions including The Mayfair Hotel Christchurch, acquired in January 2025, and the Hilton Paris Opera, acquired in May 2024. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The group noted that the increase in gross profits for H2 and FY2025 was marginal, despite its revenue growth.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Its overall gross profit margin fell to 41 per cent for H2 and FY2025, from 45 per cent for both periods in 2024, as it was impacted by an S$80.5 million allowance for foreseeable losses that was made in relation to China development properties.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">As at Dec 31, CDL maintained strong cash reserves of S$2.1 billion.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The board proposed a final dividend of S$0.25 per share, payable on May 19, after the record date of May 4. Together with the special interim dividend of S$0.03 per share paid in September 2025, the total ordinary dividend for FY2025 amounts to S$0.28 per share, representing a 40 per cent dividend payout ratio. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Shares of CDL ended Thursday 6 per cent or S$0.60 down at S$9.36.  </p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/cdl-h2-net-profit-over-four-times-s538-5-million-improved-showings-across-segments",
            "pub_date": "2026-02-27 10:50:35",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Meta signs multi-billion-dollar deal to rent Google AI chips: report",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">[MEXICO CITY] Meta Platforms has signed a multi-billion dollar deal to rent artificial intelligence (AI) chips from Google to develop new AI models, The Information reported on Thursday (Feb 26), citing a source involved in the talks. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The report of the multi-year deal comes as companies pour billions into chips and AI infrastructure to meet demand for artificial intelligence.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Meta and Google declined Reuters’ request for comment. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Earlier this week, Advanced Micro Devices said that it would sell up to US$60 billion in AI chips to Meta. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Facebook owner, earlier this month, also signed a deal with Nvidia to buy its current and future AI chips. Reuters reported in December that Google was pushing to make its Tensor Processing Units (TPUs) a viable alternative to Nvidia’s market-leading GPUs. TPU sales have become a crucial growth engine of Google’s cloud revenue as it seeks to prove to investors that its AI investments are generating returns.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">The Information reported on Thursday that Meta is also in talks with Google to buy the TPUs for its data centres as early as next year, though the status of those discussions could not be determined.</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">Google has also signed an agreement with an unidentified large investment firm to fund a joint venture that would lease TPUs to other customers, the report added. REUTERS</p></div>",
            "link": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/meta-signs-multi-billion-dollar-deal-rent-google-ai-chips-report",
            "pub_date": "2026-02-27 10:25:41",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI and accountancy: Evolution or elimination?",
            "description": "<div class=\"mx-auto my-4 font-lucida text-xl leading-8 -tracking-5% text-gray-850 md:mb-6 md:px-8\" data-testid=\"article-body-container\"><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">WHENEVER a new wave of technology emerges, the same question follows: Will this <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/opinion-features/pursue-responsible-ai-growth-business-leaders-must-address-labour-displacement\" target=\"_blank\">replace jobs</a>?</p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">With artificial intelligence (AI), that question feels more urgent. AI can scan thousands of transactions in seconds. It can detect patterns humans might miss. Understandably, people are asking whether <a class=\"text-verticals-btblue underline\" data-testid=\"article-annotation-link-component\" href=\"https://www.businesstimes.com.sg/singapore/budget-2026-why-singapores-white-collar-ai-training-drive-starting-law-and-accounting\" target=\"_blank\">accountants</a>, especially junior ones, will become obsolete. </p><p class=\"whitespace-pre-wrap break-words mb-4 md:mb-6\" data-testid=\"article-paragraph-component\">From the lens of the Institute of Singapore Chartered Accountants (Isca), that is not where the profession is heading.</p></div>",
            "link": "https://www.businesstimes.com.sg/opinion-features/ai-and-accountancy-evolution-or-elimination",
            "pub_date": "2026-02-27 10:25:41",
            "source": "businesstimes-news",
            "kind": 1,
            "language": "en"
        }
    ]
}