{
    "data": [
        {
            "title": "nLight (LASR) Q4 earnings beat estimates by 133.33% with EPS $0.14 vs $0.06. Revenue up $33.80 million from last year.",
            "id": "bdfa102b-458d-4622-bd7a-4e72355ff600",
            "description": "nLight (NASDAQ: LASR) released its Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. The results exceeded expectations with an EPS of $0.14, surpassing the estimated $0.06 by 133.33%. Revenue witnessed a significant increase of $33.80 million compared to the previous year. In the past quarter, nLight has shown impressive growth in earnings and overall financial performance. For more details, the complete report is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/bdfa102b-458d-4622-bd7a-4e72355ff600",
            "pub_date": "2026-02-27 05:15:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baldwin Insurance beats Q4 earnings, EPS at $0.31 (Est. $0.24), revenue up $17.39 million from last year.",
            "id": "196f2174-7f5a-4353-b7ac-b7ecb877aa77",
            "description": "Baldwin Insurance (NASDAQ: BWIN) announced its Q4 earnings on February 26, 2026, at 04:09 PM. The company exceeded estimated earnings by 29.17%, with an EPS of $0.31 compared to the expected $0.24. Revenue saw a $17.39 million increase from the previous year. Baldwin Insurance has shown strong performance in previous earnings reports. Explore more about this on financial news platform Benzinga.com.",
            "link": "https://www.markets.news/headlines/196f2174-7f5a-4353-b7ac-b7ecb877aa77",
            "pub_date": "2026-02-27 05:15:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Monster Beverage beats Q4 earnings with EPS of $0.51 (6.25% higher than estimate) and revenue up $319.00 million.",
            "id": "f881f99c-99f4-4a50-8abd-9d2bfa4aed02",
            "description": "Monster Beverage (NASDAQ: MNST) released its Q4 earnings report on Thursday, February 26, 2026, at 04:10 PM. In a positive development for investors, the company exceeded earnings expectations by 6.25%, posting an EPS of $0.51 compared to the estimated $0.48. Revenue also saw a significant increase, rising by $319.00 million from the previous year. The analysis of previous earnings highlights a consistent trend of outperforming expectations. Visit Benzinga.com for more details on this story.",
            "link": "https://www.markets.news/headlines/f881f99c-99f4-4a50-8abd-9d2bfa4aed02",
            "pub_date": "2026-02-27 05:15:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fox Factory Holding's Q4 earnings report exceeded expectations by 33.33% with EPS of $0.2. Revenue increased by $8.23 million from last year.",
            "id": "3be262f2-99d5-4d7b-af76-f05aedd45856",
            "description": "Fox Factory Holding, a company listed on NASDAQ under the ticker symbol FOXF, released its Q4 earnings report on February 26, 2026, at 04:05 PM. The earnings report revealed that the company exceeded estimated earnings by 33.33%, posting an EPS of $0.2 compared to the estimated $0.15. Additionally, the revenue saw an increase of $8.23 million compared to the corresponding period in the previous year. It is worth noting that in the previous quarter, the company did not meet its earnings expectations. For more details, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/3be262f2-99d5-4d7b-af76-f05aedd45856",
            "pub_date": "2026-02-27 05:15:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Emergent BioSolutions (EBS) Q4 earnings disappoint, EPS at $-0.43 vs. expected $0.32, revenue down $46M.",
            "id": "c0fad6d7-e683-40cd-98da-d798ccf9b6ca",
            "description": "Emergent BioSolutions (NYSE: EBS) released its Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. The company missed estimated earnings by -234.38%, reporting an EPS of $-0.43 compared to the expected $0.32. Revenue decreased by $46.00 million from the previous year. For more details, refer to the complete story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/c0fad6d7-e683-40cd-98da-d798ccf9b6ca",
            "pub_date": "2026-02-27 05:15:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OneStream (NASDAQ: OS) Q4 earnings beat estimates by 140% with EPS of $0.12 vs $0.05. Revenue increased by $31.26M year-over-year.",
            "id": "baef43cd-885a-454c-ad4c-76ddff8e42c8",
            "description": "OneStream (NASDAQ: OS) unveiled its Q4 earnings on February 26, 2026, at 04:05 PM. The key highlights reveal that OneStream surpassed earnings estimates significantly, with an EPS of $0.12 compared to the expected $0.05, marking a 140.0% beat. Furthermore, the revenue surged by $31.26 million compared to the corresponding period last year. In the prior quarter, the company also outperformed in terms of EPS. Additional details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/baef43cd-885a-454c-ad4c-76ddff8e42c8",
            "pub_date": "2026-02-27 05:15:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rocket Lab Q4 earnings revealed - missed estimates by 0.0%, with EPS -$0.09 vs. estimate. Revenue up $47.26M YoY.",
            "id": "75d1f043-1242-4a07-8b93-2c367a489c84",
            "description": "Rocket Lab (NASDAQ: RKLB) released its Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. The company fell short of estimated earnings by 0.0%, posting an EPS of $-0.09 compared to the expected $-0.09. Revenue showed an increase of $47.26 million from the previous year. In the prior quarter, Rocket Lab... This information can be found in detail on Benzinga.com.",
            "link": "https://www.markets.news/headlines/75d1f043-1242-4a07-8b93-2c367a489c84",
            "pub_date": "2026-02-27 05:15:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "National Health Investors (NYSE: NHI) beat Q4 earnings estimate by 25.77% with EPS $1.22 (vs $0.97). Revenue rose $20.07M from previous year.",
            "id": "4e866ed5-5c05-4661-88e6-af19d4f4a6c9",
            "description": "National Health Investors (NYSE: NHI) released its Q4 earnings report on February 26, 2026, exceeding expectations. The reported EPS of $1.22 surpassed the estimated $0.97 by 25.77%. Revenue also saw a significant increase of $20.07 million compared to the previous year. Investors should take note of this impressive performance. For more details, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/4e866ed5-5c05-4661-88e6-af19d4f4a6c9",
            "pub_date": "2026-02-27 05:15:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sollio Cooperative Group reports impressive financials: $8.4 billion in sales, $562.3 million in EBITDA, $211.9 million in earnings.",
            "id": "1827608a-4c5e-4332-a690-840edf319425",
            "description": "In its annual general meeting in Québec City, QC on Feb. 26, 2026, Sollio Cooperative Group (SCG) presented robust financial numbers showcasing their solid execution and effective cooperative model. For the fiscal year ending on October 25, 2025, SCG reported consolidated sales amounting to $8.4 billion, with adjusted EBITDA at $562.3 million and earnings before patronage refunds and income taxes hitting $211.9 million, a significant increase from $129.5 million in 2024. These figures underscore the organization's operational prowess and disciplined decision-making approach. The results for the 2024–2025 fiscal year highlight SCG's financial strength and operational efficiency. For more details, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1827608a-4c5e-4332-a690-840edf319425",
            "pub_date": "2026-02-27 05:15:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elastic (ESTC) Q3 earnings beat estimates by 87.18% with EPS of $0.73. Revenue up $67.80 million from last year.",
            "id": "910281b1-1f95-41b0-a8bf-23dd5d91dded",
            "description": "Elastic, listed on NYSE as ESTC, unveiled its Q3 earnings on Thursday, February 26, 2026, at 04:05 PM. The report highlighted impressive results as they surpassed estimated earnings by 87.18%, reporting an EPS of $0.73 compared to the expected $0.39. Additionally, revenue experienced a substantial $67.80 million increase from the corresponding period last year. In the previous quarter, Elastic had exceeded EPS expectations by $0.31, leading to a subsequent 14.67% decline in the company's shares. For more details, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/910281b1-1f95-41b0-a8bf-23dd5d91dded",
            "pub_date": "2026-02-27 05:16:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DoubleVerify's revenue for 2025 grew by 14% to $748.3 million, boosted by social, CTV, and programmatic growth.",
            "id": "10de251b-cc98-4e5a-a937-b2ba7eab5c25",
            "description": "Revenue for the year 2025 experienced a 14% rise compared to the previous year, reaching $748.3 million. This increase was primarily fueled by the company's expansion in social media, CTV measurement, and programmatic activation on a global scale.",
            "link": "https://www.markets.news/headlines/10de251b-cc98-4e5a-a937-b2ba7eab5c25",
            "pub_date": "2026-02-27 05:09:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PureCycle Technologies had record PureFive® production of 7.5 million pounds in Q4 2025, appointed new CFO, and advances Gen-2 designs.",
            "id": "58a50abe-3dd2-442c-b319-db2f5ccea312",
            "description": "In the fourth quarter, PureCycle reported a new production record of 7.5 million pounds of PureFive®. Additionally, they announced the appointment of Donald Carpenter as the new Chief Financial Officer. The company is also making strides in advancing their Gen-2 designs.",
            "link": "https://www.markets.news/headlines/58a50abe-3dd2-442c-b319-db2f5ccea312",
            "pub_date": "2026-02-27 05:09:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coterra Energy (NYSE: CTRA) reports 2025 results, offers 2026 guidance, and declares $0.22 quarterly dividend.",
            "id": "22df8565-02bb-4508-9e93-fb8df46831e6",
            "description": "Coterra Energy Inc. (NYSE: CTRA) announced its Q4 and full-year 2025 financial results, along with full-year 2026 guidance. The company declared a quarterly dividend of $0.22 per share. Tom Jorden, Chairman, CEO, and President, attributed the strong performance to effective capital allocation and operational efficiency. The results highlight the quality of their assets and the commitment of their team.",
            "link": "https://www.markets.news/headlines/22df8565-02bb-4508-9e93-fb8df46831e6",
            "pub_date": "2026-02-27 05:09:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b85f6157-52c1-4d64-89d0-3405ea041552",
            "description": "Energy company Talen announces 2025 Q4 and full-year results.",
            "link": "https://www.markets.news/headlines/b85f6157-52c1-4d64-89d0-3405ea041552",
            "pub_date": "2026-02-27 05:09:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AvePoint's 2025 financial results: $319.2M SaaS revenue (38% YoY), $419.5M total revenue (27% YoY), $416.8M ARR (27% YoY).",
            "id": "49375b10-feba-45a3-94f4-416dc28418dd",
            "description": "In the past year, Software as a Service (SaaS) revenue reached $319.2 million, marking a 38% increase compared to the previous year. On a constant currency basis, the growth was 36%. Total revenue for the same period amounted to $419.5 million, with a year-over-year growth of 27% or 25% when adjusted for currency fluctuations. The total Annual Recurring Revenue (ARR) stood at $416.8 million, showing a 27% increase year-over-year or 26% growth when adjusted for foreign exchange rates.",
            "link": "https://www.markets.news/headlines/49375b10-feba-45a3-94f4-416dc28418dd",
            "pub_date": "2026-02-27 05:09:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock indexes decline, Nvidia stock drops post-earnings, Dow turns positive. Chip spinoff soars. ",
            "id": "d14ee8e0-fa76-4903-98d1-e6e13a12dfed",
            "description": "On Thursday, stock indexes experienced a decline as Nvidia stock retreated following a post-earnings surge. The post-market today shows the Dow shifting into positive territory in response to Nvidia's earnings report, as well as a notable increase in the chip spinoff's performance. This live coverage highlights the dynamic movement in the market following key events, indicating a mixed day for investors.",
            "link": "https://www.markets.news/headlines/d14ee8e0-fa76-4903-98d1-e6e13a12dfed",
            "pub_date": "2026-02-27 05:09:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Organogenesis Holdings Inc. (Nasdaq: ORGO) reports record revenue for the fourth quarter and year ended Dec. 31, 2025.",
            "id": "6dfce7d5-8bc0-46a9-ac14-32de40573476",
            "description": "Organogenesis Holdings Inc., based in Canton, announced its financial results for the fourth quarter and full year ending on December 31, 2025. The company, listed on Nasdaq as ORGO, specializes in regenerative medicine and tissue innovations. They focus on developing, manufacturing, and selling products for advanced wound care, surgical, and sports medicine markets. The report provides insights into their performance during this period.",
            "link": "https://www.markets.news/headlines/6dfce7d5-8bc0-46a9-ac14-32de40573476",
            "pub_date": "2026-02-27 05:09:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zscaler surpasses Q2 earnings expectations: EPS $1.01, revenue up by $167.85 million from last year.",
            "id": "e0bf5388-2cfc-4df9-8610-e520c70b761a",
            "description": "Zscaler (NASDAQ: ZS) released its Q2 earnings report on Thursday, February 26, 2026, at 04:05 PM. In a significant beat, the company reported an EPS of $1.01, surpassing the estimated $0.52 by 94.23%. Revenue saw a strong increase of $167.85 million compared to the previous year. Looking back, in the last quarter, Zscaler exceeded EPS expectations by $0.46, resulting in a 13.03% decrease in share value. For further details, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e0bf5388-2cfc-4df9-8610-e520c70b761a",
            "pub_date": "2026-02-27 05:10:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AvePoint Q4 earnings missed estimates by 0.0%. EPS $0.07 vs estimated $0.07. Revenue up $25.5M from last year.",
            "id": "c3955dff-5977-44d1-a295-617420a024d7",
            "description": "AvePoint (NASDAQ: AVPT) released its Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. The company fell short of estimated earnings by 0.0%, with an EPS of $0.07 compared to the expected $0.07. Revenue showed growth, jumping by $25.50 million from the previous year. In the prior quarter, AvePoint's financial performance had... The detailed report can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/c3955dff-5977-44d1-a295-617420a024d7",
            "pub_date": "2026-02-27 05:10:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Definitive Healthcare (NASDAQ: DH) beat Q4 earnings by 20% with EPS of $0.06. Revenue decreased by $754K. Full story on Benzinga.com.",
            "id": "412e37a4-19cc-42a1-9a24-0a3bc9ca3ed5",
            "description": "Healthcare company Definitive Healthcare (NASDAQ: DH) released its Q4 earnings report on Thursday, February 26, 2026, at 04:05 PM. The report revealed that Definitive Healthcare exceeded estimated earnings by 20.0%, posting an EPS of $0.06 compared to the forecasted $0.05. However, revenue saw a decrease of $754 thousand from the same period the previous year. In the previous quarter, the company surpassed EPS expectations by $0.03, leading to a 10.57% increase in share price. Detailed information can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/412e37a4-19cc-42a1-9a24-0a3bc9ca3ed5",
            "pub_date": "2026-02-27 05:10:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}