{
    "data": [
        {
            "title": "InventHelp 123Invent client from Morenci, Mich. develops new hour logging & license scanning system called A B C (ALL - BOUT - COMPLIANCE).",
            "id": "1ca33c2f-b680-46ef-8690-ca30523dee6d",
            "description": "In Pittsburgh on February 27, 2026, an inventor from Morenci, Michigan shared their motivation for creating a new logging and scanning system for hours and licenses by stating, \"As a truck driver, I wanted to ensure compliance.\" The invention, known as A B C (ALL - BOUT - COMPLIANCE), offers a solution to monitor and maintain adherence to regulations in the industry. This innovative design provides an alternative approach to tracking and managing important data, contributing to safer and more efficient operations.",
            "link": "https://www.markets.news/headlines/1ca33c2f-b680-46ef-8690-ca30523dee6d",
            "pub_date": "2026-02-28 02:47:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Former Biden advisor Jared Bernstein criticizes crypto, noting 'almost zero legal use cases' and calling it 'pretty good for scammers'. Bitcoin's 40% decline despite Trump's support emphasized. Regulatory concerns highlighted, with Bernstein questioning asset's value proposition. Crypto industry's influence on Congress and president noted. Regulatory shift seen as impacting prices negatively. ",
            "id": "e672e446-9419-4504-9228-0bb5f1d0997d",
            "description": "Jared Bernstein, former Chair of the Biden Council of Economic Advisors, criticized cryptocurrency, referring to it as an asset with minimal legal applications and a magnet for scammers. He highlighted a 40% decline in Bitcoin's value and dismissed the notion that even Donald Trump's support could salvage its situation. Bernstein argued that the industry's claim of being in its early stages no longer justifies its extreme price fluctuations, noting that regulatory challenges had initially masked its true worth until the Trump administration embraced it. According to Bernstein, the backing of Congress and the president did little to enhance crypto's reputation and actually exacerbated its negative perception in the market, leading to a swift depreciation in value. For the full article, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/e672e446-9419-4504-9228-0bb5f1d0997d",
            "pub_date": "2026-02-28 02:49:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royce Micro-Cap Trust (RMT) reports average weekly trading volume of 684,629 shares, adviser has 50yrs exp. Closing prices as of 01/31/26: NAV 12.91, MKT 11.49.",
            "id": "9324ee42-cd5d-44ae-95e6-aadc69ef4ebb",
            "description": "In the latest update from New York on February 27, 2026, it was reported that the average weekly trading volume for shares reached around 684,629. The fund's adviser boasts over 50 years of expertise in small- and micro-cap investments. As of January 31, 2026, the closing prices stood at NAV 12.91 and MKT 11.49. Additionally, the average annual total return as of the same date was reported to be (%)...",
            "link": "https://www.markets.news/headlines/9324ee42-cd5d-44ae-95e6-aadc69ef4ebb",
            "pub_date": "2026-02-28 02:51:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Betterness debuts real-world augmented games with AI-powered human competitions across three Florida locations on March 13.",
            "id": "6bf7e3a5-800b-451a-8690-601c8f7f4212",
            "description": "An event in Miami on March 13 will introduce an innovative wellness infrastructure that employs artificial intelligence to guide human athletes at three PADL locations in Virginia Key, Florida. The event, organized by Betterness, is set to reveal the culmination of a year-long stealth development effort.",
            "link": "https://www.markets.news/headlines/6bf7e3a5-800b-451a-8690-601c8f7f4212",
            "pub_date": "2026-02-28 02:39:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Proper acquires 6 multifamily operators, now in 15 states with 20,000 units. Consolidating property managers for growth.",
            "id": "91b88824-d290-4f8d-a0c0-bb1c412892ff",
            "description": "Proper has extended its operations into 15 states, now overseeing close to 20,000 units. The company aims to provide property management owners with opportunities for liquidity and expansion. This expansion was revealed in a press release issued on February 27, 2026, in Chicago. Proper, which functions as a national acquisitions and property management platform with the goal of consolidating property managers, is focused on facilitating growth within the industry.",
            "link": "https://www.markets.news/headlines/91b88824-d290-4f8d-a0c0-bb1c412892ff",
            "pub_date": "2026-02-28 02:39:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bobby Garnett, a pioneer in vintage retail, revolutionized men's fashion sales with his store.",
            "id": "6e093ba0-2274-417f-b51d-0b658dacd7e2",
            "description": "The boutique, known as Bobby From Boston, revolutionized the vintage men’s fashion industry by introducing a new approach to retail. This store became a benchmark for many retailers and set a standard for selling vintage men’s wear.",
            "link": "https://www.markets.news/headlines/6e093ba0-2274-417f-b51d-0b658dacd7e2",
            "pub_date": "2026-02-28 02:41:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bank stocks tumbled as AI concerns rise, with Nasdaq down 0.6%, S&P 500 0.7%, Dow Jones 1.3%, and Russell 2000 2.1%. Financials like Goldman Sachs, Wells Fargo, Bank of America, Morgan Stanley, and Citigroup plunged 5-7%. Diversified financials like Jefferies Financial and Western Alliance Bancorp sank 11%. Private equity firms like Blackstone and Blue Owl Capital dropped 4.58-6.06% on Wall Street.",
            "id": "caed0f13-3c3b-4562-a05d-347261250bc8",
            "description": "Wall Street experienced a significant banking selloff amid concerns over AI-driven economic disruption. By 1:00 p.m. in New York, major indices were down: Nasdaq 100 by 0.6%, S&P 500 by 0.7%, Dow Jones by 1.3%, and Russell 2000 by 2.1%. Leading the decline were financials like GS, WFC, BAC, MS, and C, dropping by 5% to 7%, their worst performance since early April. Diversified financials also suffered, with JEF and WAL plummeting by 11%. Private equity firms were not spared, as BX fell by 4.58%, OWL by 6.06%, and others also trading lower due to impairment fears. More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/caed0f13-3c3b-4562-a05d-347261250bc8",
            "pub_date": "2026-02-28 02:42:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d1b26d3f-edf3-42b5-852f-e9021bd9b92c",
            "description": "U.S. TREASURY TO SEND SENIOR OFFICIAL TO SWITZERLAND MARCH 2-3 TO MEET WITH SWISS GOVERNMENT AND PRIVATE SECTOR OFFICIALS ON PRIORITIES FOR SANCTIONS AND COUNTERING ILLICIT FINANCE -TREASURY SPOKESPERSON",
            "link": "https://www.markets.news/headlines/d1b26d3f-edf3-42b5-852f-e9021bd9b92c",
            "pub_date": "2026-02-28 02:43:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BTC, ETH, XRP, BNB, SOL, DOGE, BCH, ADA, HYPE, LINK price forecast for 2/27: Bitcoin aims for $70k, altcoins maintain gains.",
            "id": "76cfa8c4-5ecc-4ec8-a268-d5432e5b9834",
            "description": "The rise in Bitcoin's value to over $70,000 faced resistance over the week, resulting in a stall. However, analysts remain optimistic, predicting a limited short-term decline. The question now is whether alternative cryptocurrencies, known as altcoins, will maintain their gains from the week.",
            "link": "https://www.markets.news/headlines/76cfa8c4-5ecc-4ec8-a268-d5432e5b9834",
            "pub_date": "2026-02-28 02:43:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock futures drop on Friday, after Jan wholesale inflation data release. 0.5% PPI increase, 0.3% goods prices decline, 0.8% services jump noted. Treasury bond yields at 4.00% and 3.42%. Fed unlikely to change rates in March. Index performance: Dow Jones -0.86%, S&P 500 -0.89%, Nasdaq 100 -0.72%, Russell 2000 -1.19%. Netflix up 8.66% premarket. Read more on Benzinga.com.",
            "id": "1c0112d9-a109-46a8-a023-88269b3041ee",
            "description": "U.S. stock futures dropped after a mixed Thursday close, with major benchmark indices seeing negative trends. The U.S. Bureau of Labor Statistics reported a 0.5% increase in the Producer Price Index for final demand in January, driven by a 0.8% jump in services offsetting a 0.3% decline in goods prices. The 10-year Treasury bond yielded 4.00%, and the two-year bond stood at 3.42%. Markets projected a 96.1% chance of the Federal Reserve maintaining current interest rates in March. Index performance showed a decline: Dow Jones -0.86%, S&P 500 -0.89%, Nasdaq 100 -0.72%, Russell 2000 -1.19%. ETFs tracking S&P 500 and Nasdaq 100 also decreased: SPDR S&P 500 ETF Trust (NYSE: SPY) by 0.75% to $684.15, and Invesco QQQ Trust ETF (NASDAQ: QQQ) dipped 0.78% to $604.50. Netflix saw an 8.66% increase in premarket trading after withdrawing from a bidding war. Warner Bros Discovery Inc. (NASDAQ: WBD) and Paramount Skydance Corp. (NASDAQ: PSKY) also saw rises.",
            "link": "https://www.markets.news/headlines/1c0112d9-a109-46a8-a023-88269b3041ee",
            "pub_date": "2026-02-28 02:44:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ZScaler stock drops after Q2 earnings report, raised revenue outlook corrected. Quarterly earnings of $1.01 per share.",
            "id": "8c160e0f-0066-488e-8ad2-a719363dd36d",
            "description": "**Update**: Zscaler Inc. (NASDAQ: ZS) saw a decline in shares during extended trading on Thursday following the release of its second-quarter earnings report, where the company adjusted its fiscal 2026 revenue guidance. The company reported quarterly earnings of $1.01 per share, surpassing the analyst consensus of 90 cents. Investors are advised to monitor the stock movement closely in light of this development. For more information, refer to the complete article on Benzinga.com.",
            "link": "https://www.markets.news/headlines/8c160e0f-0066-488e-8ad2-a719363dd36d",
            "pub_date": "2026-02-28 02:44:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow drops on surprise inflation data, CoreWeave & Rocket Lab plunge. Inflation data impacting market.",
            "id": "19b0d0e9-08d0-4551-97a0-ed99d4a1e8ca",
            "description": "Today, the Dow Jones index saw a significant decline due to unexpected inflation figures. CoreWeave, a partner of Nvidia, experienced a sharp drop in earnings, leading to a plunge in their stock value. This news comes amidst a volatile day in the stock market, with investors closely monitoring these developments. The sudden inflation data has caused concerns among traders, reflecting in the downward movement of key indices. Additionally, Rocket Lab also experienced a notable decrease in its stock value. Stay updated on the latest market trends with live coverage as the situation continues to unfold.",
            "link": "https://www.markets.news/headlines/19b0d0e9-08d0-4551-97a0-ed99d4a1e8ca",
            "pub_date": "2026-02-28 02:45:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MDJM LTD in Letham, Scotland priced a $2.5 million registered direct offering, selling 24.6M Class A shares.",
            "id": "1caee5a3-56ad-4db7-95e7-08f752e8a665",
            "description": "In Letham, Scotland, on February 27, 2026, MDJM LTD (Nasdaq: UOKA) disclosed the sale of 24,600,000 Class A ordinary shares in a registered direct offering through a global cultural innovation company.",
            "link": "https://www.markets.news/headlines/1caee5a3-56ad-4db7-95e7-08f752e8a665",
            "pub_date": "2026-02-28 02:45:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lifeway Foods marks 40 years with new kefir products at Expo West 2026; showcasing Muscle Mates™ and Probiotic Kefir Butter™.",
            "id": "847c617a-0138-4f21-837e-96854c66a730",
            "description": "In Morton Grove, Illinois, on February 27th, 2026, Lifeway Foods, Inc. a prominent American provider of kefir and probiotic products, plans to reveal their newest cultured dairy creations, Muscle Mates™ and Probiotic Kefir Butter™. The company, listed on Nasdaq as LWAY, is known for its innovative offerings in the industry.",
            "link": "https://www.markets.news/headlines/847c617a-0138-4f21-837e-96854c66a730",
            "pub_date": "2026-02-28 02:33:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Inventor unveils 3-in-1 recycling machine in Pittsburgh, aims to simplify recycling process for plastic, metal, and glass bottles all in one location.",
            "id": "da9e9253-4d7f-4107-9603-46cd67b632b5",
            "description": "In Pittsburgh on February 27, 2026, an inventor from Endicott, New York, discussed creating a 3 IN 1 RECYCLING MACHINE to conveniently recycle plastic, metal, and glass bottles at a single location. This design aims to streamline the process and save time, providing a solution to manage all three types of bottles efficiently. This innovation addresses the concerns of having to use three separate methods for recycling various materials.",
            "link": "https://www.markets.news/headlines/da9e9253-4d7f-4107-9603-46cd67b632b5",
            "pub_date": "2026-02-28 02:33:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3003b007-f287-43e8-9066-a9dcae54cd16",
            "description": "AG BONDI: DOJ UNSEALED INDICTMENT CHARGING 30 MORE PEOPLE WHO TOOK PART IN THE \"ATTACK ON CITIES CHURCH IN MINNESOTA\"",
            "link": "https://www.markets.news/headlines/3003b007-f287-43e8-9066-a9dcae54cd16",
            "pub_date": "2026-02-28 02:33:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "74f2e3c8-6236-4b7b-8e7f-c06851234576",
            "description": "US PRESIDENT TRUMP: TARIFFS HAVE INFLUENCED NOVARTIS, AND ITS GREAT LEADER, VASANT (VAS) NARASIMHAN, M.D., TO BUILD 7+ MANUFACTURING AND R&D FACILITIES, CREATING THOUSANDS OF JOBS - TSL",
            "link": "https://www.markets.news/headlines/74f2e3c8-6236-4b7b-8e7f-c06851234576",
            "pub_date": "2026-02-28 02:33:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Company affiliated with former US President considers launching Truth Social platform due to recent cryptocurrency investments.",
            "id": "fc0e1bb1-54ca-41bf-947d-eff57e819a5e",
            "description": "In recent data, it has been disclosed that there has been a sharp increase of 25% in the number of reported cases of cyberbullying among teenagers aged 13 to 18 in the last year. This rise in cyberbullying incidents brings the total number of reported cases to more than 15,000, marking a concerning trend. Experts have attributed this surge to the widespread use of social media platforms and online communication among the youth. Additionally, the data revealed that girls are more likely to experience cyberbullying compared to boys, with a ratio of 3:1. Authorities urge parents and educators to be vigilant and proactive in addressing cyberbullying issues to ensure the safety and well-being of teenagers in the digital age.",
            "link": "https://www.markets.news/headlines/fc0e1bb1-54ca-41bf-947d-eff57e819a5e",
            "pub_date": "2026-02-28 02:34:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Biglari Capital demands resignation of Jack in the Box chairman David Goebel, rejected by stockholders; ISS, BlackRock, Vanguard, and State Street defended.",
            "id": "05d26355-a525-456e-9b47-b9e9222f7e24",
            "description": "The company must not use the treatment of abstain votes as a shield - Chairman Goebel did not secure a majority of votes cast. Jack in the Box shareholders cannot bear another year under David Goebel. ISS, BlackRock, Vanguard, and State Street oddly supported the long-serving David.",
            "link": "https://www.markets.news/headlines/05d26355-a525-456e-9b47-b9e9222f7e24",
            "pub_date": "2026-02-28 02:35:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LTK introduces chatbot LTK AI in consumer app for personalized recommendations, powered by creator content.",
            "id": "378d1f77-fdc1-4a29-a4bc-cddb0ae1692e",
            "description": "Based in Dallas, LTK introduced LTK AI, a chatbot integrated into the LTK consumer app for tailored discovery. This innovative tool utilizes genuine creator content and reliable suggestions to assist users in deciding what to wear, style, pack, gift, or experiment with. By incorporating a conversational element, LTK AI enhances the user experience by providing authentic and personalized recommendations. This launch marks a significant development in turning influence into a global economy, showcasing LTK's commitment to leveraging technology for enhanced user engagement.",
            "link": "https://www.markets.news/headlines/378d1f77-fdc1-4a29-a4bc-cddb0ae1692e",
            "pub_date": "2026-02-28 02:35:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}