{
    "data": [
        {
            "title": "Great Elm Capital Corp (GECC) to release Q4 and full year 2025 earnings with conference call.",
            "id": "4667e317-72c0-402c-8949-6a0da78e9e1a",
            "description": "GECC has announced their plans to release their earnings report for the fourth quarter and full year of 2025. The company will be hosting a conference call alongside the release.",
            "link": "https://www.markets.news/headlines/4667e317-72c0-402c-8949-6a0da78e9e1a",
            "pub_date": "2026-02-28 05:25:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aberdeen Investments U.S. Closed-End Funds (NYSE: ASGI, THQ) announced distributions on Feb. 27, 2026.",
            "id": "2fdf2b40-1f78-4647-9e0f-a55fbc507e1b",
            "description": "On February 27, 2026, the Aberdeen Investments U.S. Closed-End Funds (NYSE: ASGI, THQ) disclosed the distributions made to investors. The Funds paid these distributions per share, with specific amounts outlined in a provided table.",
            "link": "https://www.markets.news/headlines/2fdf2b40-1f78-4647-9e0f-a55fbc507e1b",
            "pub_date": "2026-02-28 05:18:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FCS Foundation raises awareness for Familial Chylomicronemia Syndrome on Rare Disease Day, helping millions affected globally.",
            "id": "12f0a523-6ad5-4040-8e47-4c4a05ae6213",
            "description": "On February 27, 2026, in Boulder, Colorado, the FCS Foundation utilized Rare Disease Day, an annual global observance on the last day of February, to bring attention to the millions impacted by rare diseases. This is an opportunity to raise awareness about Familial Chylomicronemia Syndrome (FCS). This day is crucial for shedding light on rare conditions and the individuals affected by them worldwide.",
            "link": "https://www.markets.news/headlines/12f0a523-6ad5-4040-8e47-4c4a05ae6213",
            "pub_date": "2026-02-28 05:18:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "University of Phoenix College of Doctoral Studies released a white paper on autonomy-driven leadership reducing burnout.",
            "id": "5b9f6cc5-c9ee-4afc-a276-eac1e7a17310",
            "description": "A recent study conducted by Dr. Julie Overbey and Dr. Pamela Gordon has delved into the impact of autonomy-focused leadership approaches on mitigating workplace burnout and enhancing organizational effectiveness. The research, unveiled on Feb. 27, 2026, in Phoenix, suggests that autonomous leadership models can play a significant role in reducing burnout levels among employees, thereby bolstering overall performance within the organization. The study, released by the University of Phoenix College of Doctoral Studies, emphasizes the importance of autonomy in leadership and its potential to transform workplace dynamics. This research could provide valuable insights for organizations looking to improve employee well-being and productivity.",
            "link": "https://www.markets.news/headlines/5b9f6cc5-c9ee-4afc-a276-eac1e7a17310",
            "pub_date": "2026-02-28 05:18:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "da828b42-09bb-450f-870c-08fa6566f0aa",
            "description": "US bank deposits rose to $18.778 trln from $18.764 trln in prior week",
            "link": "https://www.markets.news/headlines/da828b42-09bb-450f-870c-08fa6566f0aa",
            "pub_date": "2026-02-28 05:18:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Keysight and MediaTek develop AI-driven uplink optimization for RANs, to be showcased at Mobile World Congress 2026.",
            "id": "70918bd7-ce8a-4ae8-ae33-c4957d30354b",
            "description": "In Santa Rosa, California, Keysight Technologies, Inc. (NYSE: KEYS) and MediaTek have unveiled a cutting-edge prototype at Mobile World Congress 2026. The prototype showcases advancements in AI-powered uplink optimization and model life cycle management for future radio access networks. This innovative technology, utilizing AI-enabled RAN-assisted intelligence, demonstrates real-time enhancements in uplink performance and ensures long-term effectiveness through practical model retraining and over-the-air (OTA) capabilities. This collaboration aims to revolutionize network capabilities, with the demonstration highlighting the potential benefits of integrating AI in next-generation RAN systems.",
            "link": "https://www.markets.news/headlines/70918bd7-ce8a-4ae8-ae33-c4957d30354b",
            "pub_date": "2026-02-28 05:18:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MAX Power starts drilling at new site to test natural hydrogen model; also advancing their platform, with a focus on system repeatability and scale. 325 km from initial concept.",
            "id": "e514c181-fa4d-4d77-9598-d7ffff4ab2dc",
            "description": "A new play concept located 325 kilometers from Lawson has been developed to showcase system reliability and scope, while also expediting the advancement of the MAXX LEMI predictive platform. The project aims to highlight the scalability of the system and drive innovation in the field.",
            "link": "https://www.markets.news/headlines/e514c181-fa4d-4d77-9598-d7ffff4ab2dc",
            "pub_date": "2026-02-28 05:19:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AvalonBay Communities, Inc. to participate in 2026 Citi Global Property CEO Conference on March 2 at 11:40am. CEO and team to discuss business update.",
            "id": "60784e7d-a484-4903-adf2-ae952a5d3719",
            "description": "A real estate company, AVALONBAY COMMUNITIES, INC. (NYSE: AVB), revealed that its CEO and President, Benjamin W. Schall, along with several management members, will take part in a roundtable talk at the 2026 Citi Global Property CEO Conference on March 2, 2026, at 11:40 AM ET. Topics for discussion may include the organization's operational status, trends, and strategies regarding development, redevelopment, sale, and acquisition.",
            "link": "https://www.markets.news/headlines/60784e7d-a484-4903-adf2-ae952a5d3719",
            "pub_date": "2026-02-28 05:20:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Acadia Realty Trust sets 2026 Annual Shareholder Meeting on May 13, 1:00 PM EST, to be held virtually. Visit website to attend and vote.",
            "id": "c9cad294-4b75-40f3-9ddf-87ef2c205842",
            "description": "In Rye, New York, Acadia Realty Trust (NYSE: AKR) disclosed the schedule for its 2026 Annual Shareholder Meeting. The meeting is slated for Wednesday, May 13, 2026, at 1:00 PM Eastern Time. It will be held virtually to enable shareholders to participate, vote, and ask questions through a live webcast accessible at www.virtualshareholdermeeting.com/AKR26. Prior to the meeting, shareholders will have the opportunity to cast their votes.",
            "link": "https://www.markets.news/headlines/c9cad294-4b75-40f3-9ddf-87ef2c205842",
            "pub_date": "2026-02-28 05:20:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Camden Property Trust joins Citi’s 2026 Global Property CEO Conference on March 3 at 1:30 PM, webcast live on camdenliving.com.",
            "id": "781e8d42-f5d2-42b9-8178-9143ac68300b",
            "description": "Houston-based real estate company Camden Property Trust, listed on NYSE as CPT, will be taking part in Citi’s 2026 Global Property CEO Conference. The company's roundtable discussion is set for March 3, 2026, at 1:30 PM ET. The event will be live webcast on camdenliving.com under the Investors section in a listen-only format. An audio recording will also be accessible on the company's website post-event. For further details, visit the Company's site.",
            "link": "https://www.markets.news/headlines/781e8d42-f5d2-42b9-8178-9143ac68300b",
            "pub_date": "2026-02-28 05:20:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banco Santander filed its 2025 20-F report with SEC, available for shareholders/investors on website.",
            "id": "2b7fcb49-adcb-4882-b2ad-1d50642a05f3",
            "description": "In Madrid on February 27, 2026, Banco Santander, S.A. disclosed the submission of its 2025 Annual Report on Form 20-F to the U.S. Securities and Exchange Commission. This report can now be accessed on the dedicated section for \"Shareholders and Investors.\"",
            "link": "https://www.markets.news/headlines/2b7fcb49-adcb-4882-b2ad-1d50642a05f3",
            "pub_date": "2026-02-28 05:20:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Crown Holdings, Inc. (NYSE: CCK) raises dividend by 35% to $0.35 per share, payable on March 31, 2026.",
            "id": "666e7654-eba1-4d44-90bf-87d199db1f14",
            "description": "In Tampa, Florida on February 27, 2026, Crown Holdings, Inc. (NYSE: CCK) shared news of the declaration of a cash dividend of $0.35 per share by the company's Board of Directors. The dividend is set to be paid on March 31, 2026, to shareholders listed on March 17, 2026. This quarterly dividend marks an increase from previous payouts.",
            "link": "https://www.markets.news/headlines/666e7654-eba1-4d44-90bf-87d199db1f14",
            "pub_date": "2026-02-28 05:08:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mainstay Maritime selling Canadian companies/fleet to Algoma Central Corp. to focus on US Jones Act ops due to demand.",
            "id": "7ef32570-168d-4310-bec1-3c5b7cd538a2",
            "description": "Mainstay Maritime Inc. based in Williamsville, New York, announces its strategic move to strengthen its focus on core U.S. Jones Act operations. The company aims to capitalize on the increasing demand for reliable U.S. Jones Act marine services, particularly in Great Lakes shipping. This decision positions Mainstay to enhance its investment in this sector. The announcement was made on February 27, 2026.",
            "link": "https://www.markets.news/headlines/7ef32570-168d-4310-bec1-3c5b7cd538a2",
            "pub_date": "2026-02-28 05:08:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blue Moon Metals Inc. acquires Apex Germanium and Gallium Mine from Teck Resources to advance US critical mineral projects.",
            "id": "c6907cf5-47f1-4b7a-8839-8ac515050883",
            "description": "Blue Moon Metals Inc. has recently disclosed that Teck American Incorporated, a subsidiary of Teck Resources Limited, has agreed to sell 100% ownership of the past-producing Apex germanium (Ge) mine. This transaction involves Blue Moon and Teck, wherein Teck will vend the Apex mine to Blue Moon. This milestone is significant for Blue Moon, listed on the Toronto Stock Venture Exchange (TSXV: MOON) and the NASDAQ exchange (NASDAQ: BMM), as it secures full control over the Apex mine's operations.",
            "link": "https://www.markets.news/headlines/c6907cf5-47f1-4b7a-8839-8ac515050883",
            "pub_date": "2026-02-28 05:08:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Partners LP files 2025 Annual Report on Form 10-K with SEC on Feb 27, 2026. Report available online.",
            "id": "fd56b785-276c-4893-a530-7884987e4e41",
            "description": "Global Partners LP, headquartered in Waltham, Massachusetts, disclosed that its Annual Report on Form 10-K for the period ending on December 31, 2025, has been officially submitted to the U.S. Securities and Exchange Commission (SEC) on February 27, 2026. This comprehensive report is accessible for viewing or downloading on the Partnership's investor relations website, as well as on the SEC's website at www.sec.gov. Furthermore, interested parties can request a physical copy of the report.",
            "link": "https://www.markets.news/headlines/fd56b785-276c-4893-a530-7884987e4e41",
            "pub_date": "2026-02-28 05:09:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6a7c71b7-7f73-4c43-8f57-f920186b1207",
            "description": "S&P: Portugal Outlook Revised To Positive On Resilient Economy And Declining Debt; 'A+' Ratings Affirmed www.spglobal.com/ratings/en/r...",
            "link": "https://www.markets.news/headlines/6a7c71b7-7f73-4c43-8f57-f920186b1207",
            "pub_date": "2026-02-28 05:09:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1235acd3-bf01-4fc1-9015-649e38039214",
            "description": "Morningstar DBRS Confirms Netherlands At AAA, Stable Trend dbrs.morningstar.com/research/475...",
            "link": "https://www.markets.news/headlines/1235acd3-bf01-4fc1-9015-649e38039214",
            "pub_date": "2026-02-28 05:09:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HEI reports full year 2025 net income of $123M, $0.71 per share, a significant improvement from 2024's loss of $1.426B.",
            "id": "3c4d79ac-e5ee-4ef0-802c-db2f6b5fba25",
            "description": "Hawaiian Electric Industries, Inc. disclosed its financial results, with a reported net income of $123 million for the entire year of 2025, translating to $0.71 per share. This marks a significant improvement from the previous year's net loss of $1,426 million, or $11.23 per share in 2024. Adjusting for Maui wildfire-related expenses and costs associated with reviewing strategic options for Pacific Current, the core income from continuing operations stood at $149 million, equivalent to $0.86 per share. This indicates an increase compared to the $124 million, or $0.98 per share achieved in 2024.",
            "link": "https://www.markets.news/headlines/3c4d79ac-e5ee-4ef0-802c-db2f6b5fba25",
            "pub_date": "2026-02-28 05:09:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4f55bef2-6014-4767-91af-35b14c1bf328",
            "description": "Scope Affirms Switzerland’s AAA Rating With Stable Outlook www.scoperatings.com/announcement...",
            "link": "https://www.markets.news/headlines/4f55bef2-6014-4767-91af-35b14c1bf328",
            "pub_date": "2026-02-28 05:09:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PrimeEnergy Resources Corp. (NASDAQ: PNRG) confirms borrowing base and price reduction under credit facility with Citibank, N.A.",
            "id": "045f40ab-0b68-4f18-8085-f2915828e024",
            "description": "On February 27, 2026, PrimeEnergy Resources Corporation (NASDAQ: PNRG) revealed its recent agreement by joining a Fifth Amendment to the Fourth Amended and Restated Credit Agreement with its bank consortium. Citibank, N.A. takes the lead as the administrative agent for this revised agreement.",
            "link": "https://www.markets.news/headlines/045f40ab-0b68-4f18-8085-f2915828e024",
            "pub_date": "2026-02-28 05:11:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}