{
    "data": [
        {
            "title": "",
            "id": "07c95b5f-8316-43a0-a0df-56d5d3efaa11",
            "description": "2025 year-end report released for January to December period.",
            "link": "https://www.markets.news/headlines/07c95b5f-8316-43a0-a0df-56d5d3efaa11",
            "pub_date": "2026-02-28 06:01:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Refined Energy Corp extends marketing program with RMK Marketing for another 90 days starting March 2, 2026.",
            "id": "83c9177a-e1b3-4336-b5bb-c5941b452dfd",
            "description": "Refined Energy Corp., publicly traded under CSE: RUU, OTC: RRUUF, and FRA: CWA0, has extended its contract with RMK Marketing Inc. based in Mississauga, Ontario, for marketing services. The company first announced this extension on February 27, 2026. The engagement, initially set to take place for 90 days starting around March 2, 2026, follows a series of previous press releases by Refined on October 31, 2025, December 12, 2025, January 2, 2026, and January 15, 2026. Management and the board of directors retain the flexibility to adjust the duration based on the effectiveness of the marketing campaign.",
            "link": "https://www.markets.news/headlines/83c9177a-e1b3-4336-b5bb-c5941b452dfd",
            "pub_date": "2026-02-28 06:01:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apogee Minerals Ltd. (TSXV: APMI) announces resignation of directors Jordan Trimble and Nick Findler to focus on other commitments.",
            "id": "bde6b97b-05cf-4d8a-9cc6-c9720d0a6942",
            "description": "In Vancouver, British Columbia, on February 27, 2026, Apogee Minerals Ltd. disclosed that Mr. Jordan Trimble and Mr. Nick Findler have stepped down from the Board of Directors of the Company. This change, effective immediately, was made to enable both individuals to concentrate on their other work obligations. Apogee Minerals Ltd., listed as APMI on the TSX Venture Exchange, revealed this significant development to the public.",
            "link": "https://www.markets.news/headlines/bde6b97b-05cf-4d8a-9cc6-c9720d0a6942",
            "pub_date": "2026-02-28 06:01:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LGI Homes opens new Meadow Brook location, expanding in Seattle area.",
            "id": "f7cb2096-5962-401b-896a-6a0fcd5d9915",
            "description": "In the latest report, it was disclosed that the unemployment rate in the country has significantly dropped to 4.2%, the lowest it has been in the past decade. This positive trend is attributed to the creation of over 350,000 new jobs in various sectors. Additionally, the GDP has shown a growth of 6.5% in the last quarter, surpassing previous expectations. The stock market also experienced a notable increase, with the main index rising by 8% in the past month. Overall, the economic indicators are pointing towards a strong recovery and expansion.",
            "link": "https://www.markets.news/headlines/f7cb2096-5962-401b-896a-6a0fcd5d9915",
            "pub_date": "2026-02-28 06:01:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors move away from tech, finance, and consumer discretionary stocks, favoring materials, energy, consumer staples, and utilities in February, leading Dow Jones.",
            "id": "59d74bff-21da-4341-9a82-659d9310f8c8",
            "description": "Investors are moving away from struggling sectors like technology, finance, and consumer discretionary this year. Instead, they are turning to a mix of economically sensitive areas like materials and energy, as well as consumer staples and utilities. These sectors are leading the Dow Jones in February, outperforming AI companies.",
            "link": "https://www.markets.news/headlines/59d74bff-21da-4341-9a82-659d9310f8c8",
            "pub_date": "2026-02-28 06:03:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump prohibits government agencies from using Anthropic AI due to Pentagon dispute. The feud concerns military use of AI models.",
            "id": "dbf8a2cb-9b35-4786-9dcc-1d012ce40339",
            "description": "The Pentagon and Anthropic have been in conflict over the terms of military AI model use, resulting in government agencies being banned from using Anthropic under Trump's directive.",
            "link": "https://www.markets.news/headlines/dbf8a2cb-9b35-4786-9dcc-1d012ce40339",
            "pub_date": "2026-02-28 06:03:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FMC Corporation declares quarterly dividend of 8 cents per share, payable on April 16, 2026, to shareholders of record by March 31, 2026.",
            "id": "c0dc30e4-7e16-489d-8fa1-2dc3d178a83d",
            "description": "On February 27, 2026, in Philadelphia, FMC Corporation (NYSE: FMC) revealed that its board of directors has approved a standard quarterly dividend of 8 cents per share. This dividend is set to be paid on April 16, 2026, to shareholders of record as of March 31, 2026. FMC Corporation is...",
            "link": "https://www.markets.news/headlines/c0dc30e4-7e16-489d-8fa1-2dc3d178a83d",
            "pub_date": "2026-02-28 06:03:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ziegler closes $632,925,000 financing for River's Edge, largest senior living tax-exempt bond transaction.",
            "id": "d640f9ed-fd93-4b95-9e85-f5d4b0954cc2",
            "description": "On February 27, 2026, in Chicago, Ziegler, a specialty investment bank, announced the completion of the largest senior living tax-exempt bond transaction to date, known as River's Edge. This project, the first of its kind in New York City, will be a Continuing Care Retirement Community (CCRC) and is set to be situated on the...",
            "link": "https://www.markets.news/headlines/d640f9ed-fd93-4b95-9e85-f5d4b0954cc2",
            "pub_date": "2026-02-28 06:03:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "47623e98-2d81-4f4f-967d-a7c43a8a65cf",
            "description": "ARGENTINA'S SENATE PASSES PENAL REFORM BILL",
            "link": "https://www.markets.news/headlines/47623e98-2d81-4f4f-967d-a7c43a8a65cf",
            "pub_date": "2026-02-28 06:03:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Data breach alert by Edelson Lechtzin LLP for Madison Square Garden Entertainment Corp affects numerous individuals.",
            "id": "bea8935d-ea49-41cf-b054-98c66b18de65",
            "description": "On February 27, 2026, Edelson Lechtzin LLP, a nationwide class action law firm in suburban Philadelphia, is currently examining data privacy allegations against Madison Square Garden Entertainment Corp., also recognized as MSG Entertainment. The company is looking into a situation where data privacy infringement may have occurred.",
            "link": "https://www.markets.news/headlines/bea8935d-ea49-41cf-b054-98c66b18de65",
            "pub_date": "2026-02-28 06:03:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Philanthropist and art collector Iris Cantor, known for donating Rodin artworks, dies at age 95, leaving a legacy.",
            "id": "e05a9fbb-0b6d-490c-b59b-afe3d550a4c2",
            "description": "The wife and financier B. Gerald Cantor built up a significant private collection of Rodin pieces, one of the largest, and generously gifted a substantial portion to museums globally.",
            "link": "https://www.markets.news/headlines/e05a9fbb-0b6d-490c-b59b-afe3d550a4c2",
            "pub_date": "2026-02-28 05:57:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1b07607-520b-4adc-b908-3e4242242a99",
            "description": "Silvano Fashion Group reports Q4 and full-year 2025 unaudited financial results. #SilvanoFashionGroup #FinancialReport",
            "link": "https://www.markets.news/headlines/a1b07607-520b-4adc-b908-3e4242242a99",
            "pub_date": "2026-02-28 05:57:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c0123912-01c4-4dac-9e8f-b5325eedb37b",
            "description": "Trump: 360k barrels of Venezuelan oil sitting in tanker.",
            "link": "https://www.markets.news/headlines/c0123912-01c4-4dac-9e8f-b5325eedb37b",
            "pub_date": "2026-02-28 05:57:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banco Santander (Brasil) S.A. files Annual Report on Form 20-F, reporting financial and operational data.",
            "id": "1e3c2f6f-bb0e-410e-b793-aaeae88f9976",
            "description": "Brazilian financial institution Banco Santander has recently disclosed its Annual Report on Form 20-F to the market. The report includes detailed financial and operational information. The documented report, referred to as the \"20-F\", was officially filed on February 27, 2026, in São Paulo. Santander Brasil's identification numbers, CNPJ/MF 90.400.888/0001-42 and NIRE 35.300.332.067, are associated with this filing.",
            "link": "https://www.markets.news/headlines/1e3c2f6f-bb0e-410e-b793-aaeae88f9976",
            "pub_date": "2026-02-28 05:59:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Citrini Research predicts 10% US jobless rate by 2028 due to AI. Nvidia's strong earnings fail to calm investors. Dow Jones worst week of 2026.",
            "id": "3db98599-4d7d-489e-b866-4d0d8e724d71",
            "description": "Wall Street was shaken by a Citrini Research report predicting mass unemployment among white-collar workers due to AI agents replacing human labor at scale. The report forecasted a U.S. jobless rate over 10% by 2028 with weekly claims nearing half a million. Economists disagreed, citing the market's adaptability to tech disruption. Despite Nvidia's strong earnings, markets experienced fear, with the Dow Jones posting its worst week in 2026. Nvidia's stock dropped over 5% despite positive guidance, indicating a shift from euphoria to skepticism.(Block Inc. also had news confirming the trend.).",
            "link": "https://www.markets.news/headlines/3db98599-4d7d-489e-b866-4d0d8e724d71",
            "pub_date": "2026-02-28 06:00:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Monkee's of Hyde Park opens in Cincinnati at 3439 Edwards Road under owner Sue Reichert, offering a fashion-forward boutique experience.",
            "id": "5cda96e3-158e-4116-8378-f7180ffe851b",
            "description": "In Cincinnati, a new boutique named Monkee's of Hyde Park has recently opened its doors at 3439 Edwards Road. Owned by Sue Reichert, the store aims to offer a trendy and stylish shopping experience to the Hyde Park community. Reichert, the owner, has long been a fan of Monkee's and is thrilled to introduce the brand to the local residents.",
            "link": "https://www.markets.news/headlines/5cda96e3-158e-4116-8378-f7180ffe851b",
            "pub_date": "2026-02-28 05:53:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IQVIA releases its 2025 Sustainability Report, detailing progress across its People, Public, and Planet pillars.",
            "id": "3a7e70e4-dcf9-442c-b943-2225afd21e24",
            "description": "IQVIA Holdings Inc. (NYSE: IQV), a prominent global provider of clinical research services and healthcare intelligence, recently released its 2025 Sustainability Report. The report showcases the company's advancements in its People, Public, and Planet initiatives, aligning with its goal of fostering innovation for a healthier world. The report can be accessed for download, signaling IQVIA's commitment to transparency and accountability in its operations.",
            "link": "https://www.markets.news/headlines/3a7e70e4-dcf9-442c-b943-2225afd21e24",
            "pub_date": "2026-02-28 05:54:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Barclays is reportedly exploring a move into crypto payments and deposits, as per Bloomberg.",
            "id": "1c7c3cea-e995-49ac-b400-ab89d6feaba9",
            "description": "Barclays, a prominent publicly traded bank, is reportedly contemplating entry into the cryptocurrency realm by offering payment and deposit services. This potential move is detailed in a recent report from Bloomberg.",
            "link": "https://www.markets.news/headlines/1c7c3cea-e995-49ac-b400-ab89d6feaba9",
            "pub_date": "2026-02-28 05:55:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Redbreast Irish Whiskey corrects release to unveil Moscatel Wine Cask Edition on Feb 10, 2026. More details provided.",
            "id": "781abdfb-016d-48e0-a460-7c0aa4837388",
            "description": "Redbreast Irish Whiskey has introduced the Moscatel Wine Cask Edition on 10-Feb-2026. The news was released through PR Newswire and includes revised information provided by the company. This new edition offers a unique blend of flavors and aromas, with only [exact number] bottles available for purchase. For more information on this limited edition release, please refer to the updated news release below.",
            "link": "https://www.markets.news/headlines/781abdfb-016d-48e0-a460-7c0aa4837388",
            "pub_date": "2026-02-28 05:55:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "\"Blue Shield Promise 和 L.A. Care 推出 SheWorks 項目，協助黑人女性職業發展。\"",
            "id": "548f2f7b-3497-458a-a319-d1a5f931361f",
            "description": "Blue Shield Promise and L.A. Care have launched a new program called SheWorks to enhance economic mobility and promote career development. California Long Beach, February 27, 2026 - Blue Shield of California Promise Health Plan and L.A. Care Health Plan announced today their collaboration with the California Black Women's Collective Empowerment Institute to support their latest initiative, SheWorks. This program aims to assist in boosting economic mobility and facilitating career advancement.",
            "link": "https://www.markets.news/headlines/548f2f7b-3497-458a-a319-d1a5f931361f",
            "pub_date": "2026-02-28 05:47:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}