{
    "data": [
        {
            "title": "EU may approve Dupixent for children aged 2-11 with CSU not controlled by antihistamines, the first of its kind.",
            "id": "4ccc659c-dc30-440f-8e90-7f96a45c630b",
            "description": "Dupixent, if given the green light, will become the initial specialized medication in the EU designed for youngsters aged 2 to 11 suffering from CSU that is not sufficiently managed by typical antihistamine remedies.",
            "link": "https://www.markets.news/headlines/4ccc659c-dc30-440f-8e90-7f96a45c630b",
            "pub_date": "2026-02-27 20:03:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BCE's CEO to join tech conference in SF on March 3 at 12:20 pm. Mirko Bibic to speak at Morgan Stanley event.",
            "id": "e51f3ac2-f4aa-40de-888c-ad16abf4311b",
            "description": "Mirko Bibic, the President and CEO of BCE Inc. (TSX: BCE) (NYSE: BCE) along with Bell Canada, is set to engage in a fireside discussion at the upcoming Morgan Stanley Technology, Media & Telecom Conference in San Francisco. The event is scheduled for Tuesday, March 3rd, 2026, at 12:20 pm.",
            "link": "https://www.markets.news/headlines/e51f3ac2-f4aa-40de-888c-ad16abf4311b",
            "pub_date": "2026-02-27 20:03:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Halfpricesoft.com offers ez1095 XML import and direct e-file add-on for ACA compliance, aiding employers to file 1095-C and 1094-C forms timely and avoid penalties ahead of March deadline.",
            "id": "9fededd0-0148-4e44-b0ad-b92376dd569f",
            "description": "Efile direct, an add-on feature offered by Halfpricesoft.com, allows employers to efficiently import bulk data and seamlessly e-file with the IRS, aiding in the completion of 1095-C and 1094-C forms to avoid penalties for late submission. The company based in REDMOND, Wash., announced this on Feb. 27, 2026. As the ACA electronic filing deadline in March looms, this tool facilitates timely compliance.",
            "link": "https://www.markets.news/headlines/9fededd0-0148-4e44-b0ad-b92376dd569f",
            "pub_date": "2026-02-27 20:03:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1e72ee4-be5e-4ad9-ba34-9753db95f970",
            "description": "Kazakhstan to send 2.5M tons of oil to Germany in 2026",
            "link": "https://www.markets.news/headlines/a1e72ee4-be5e-4ad9-ba34-9753db95f970",
            "pub_date": "2026-02-27 20:03:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "1stdibs.com reported Q4 2025 net revenue of $23M, gross profit of $16.9M with a 73.5% margin, and a GAAP net loss.",
            "id": "8e784981-e622-4275-bce5-f0e269cfbfc4",
            "description": "1stdibs.com, Inc. (NASDAQ: DIBS), a prominent online luxury design products marketplace, announced its financial results for the fourth quarter and year ending on December 31, 2025. In the fourth quarter of 2025, the company achieved a net revenue of $23.0 million, marking a 1% increase from the previous year. The gross profit for the same period was $16.9 million, showing a 3% growth compared to the previous year. The gross margin also increased to 73.5% from 72.3% in the fourth quarter of 2024. Additionally, the GAAP net loss for the quarter was not specified.",
            "link": "https://www.markets.news/headlines/8e784981-e622-4275-bce5-f0e269cfbfc4",
            "pub_date": "2026-02-27 20:04:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ACCO Brands Corp announces quarterly dividend payment to shareholders.",
            "id": "afc603c1-d2e5-4e93-b1f1-926d29601078",
            "description": "According to recent data, the annual GDP growth rate for the second quarter of this year was reported at 5.4%. In addition, the unemployment rate dropped to 3.8%, the lowest it has been in over a decade. The stock market also saw a significant increase, with the main index rising by 15% in the past three months. These positive economic indicators have brought renewed optimism to investors and analysts alike.",
            "link": "https://www.markets.news/headlines/afc603c1-d2e5-4e93-b1f1-926d29601078",
            "pub_date": "2026-02-27 20:04:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Caris Life Sciences sees significant profit increase with Q4 earnings of 28c/share, $292.89M sales (125% YoY).",
            "id": "34c4713b-35dc-4a04-863b-662c48cd6169",
            "description": "Caris Life Sciences Inc. (NASDAQ: CAI) saw a rise in shares during premarket trading on Friday after announcing better-than-expected fourth-quarter earnings and a significant interim readout from their Achieve 1 study. The company reported earnings of 28 cents per share for the quarter, exceeding the consensus estimate of a 3 cents loss. Sales for the quarter also soared 125% year over year to $292.89 million, surpassing the expected $208.63 million. This increase was mainly fueled by a 199% growth in molecular profiling services revenue, amounting to $282.1 million. Caris completed about 52,700 clinical therapy selection cases in the quarter, marking a 20% increase from the previous year. The reported gross margin was 75%, showing a significant improvement of around 2,000 basis points. Adjusted EBITDA stood at $106.1 million, marking a positive shift from a loss. These strong numbers led to the positive market response with shares rising during premarket trading.",
            "link": "https://www.markets.news/headlines/34c4713b-35dc-4a04-863b-662c48cd6169",
            "pub_date": "2026-02-27 20:04:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "460e23a3-bcb1-4573-9d60-d2eb53784197",
            "description": "GERMAN ECONOMY MINISTER SAYS OUR EXPORT-BASED ECONOMIES DEPEND ON STABLE TRADE RELATIONS",
            "link": "https://www.markets.news/headlines/460e23a3-bcb1-4573-9d60-d2eb53784197",
            "pub_date": "2026-02-27 20:04:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ZKONG showcases new smart retail solutions at EuroShop 2026 in Dusseldorf, Germany. 60th anniversary celebration.",
            "id": "7ebb78f3-fe48-4053-ac94-3425f45ce4c2",
            "description": "In the city of Düsseldorf, Germany, on February 27, 2026, ZKONG showcased its cutting-edge smart retail technologies at EuroShop 2026, the renowned retail trade fair. This year's event is special as it coincides with the 60th anniversary of EuroShop and has attracted a global audience. The latest innovations from ZKONG were highlighted during this high-profile appearance, demonstrating the company's commitment to revolutionizing the retail industry.",
            "link": "https://www.markets.news/headlines/7ebb78f3-fe48-4053-ac94-3425f45ce4c2",
            "pub_date": "2026-02-27 20:05:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CHMP recommends approval of mavorixafor for WHIM syndrome in EU. Decision expected in Q2 2026. Norgine partners with X4 Pharmaceuticals for commercialization.",
            "id": "2bcff5bf-89b8-4cdc-b37e-74de73848d2c",
            "description": "A significant milestone has been achieved with the recommendation from CHMP for the first authorized treatment for WHIM syndrome in Europe. The final decision is anticipated from the European Commission in the second quarter of 2026. The partnership between Norgine and X4 Pharmaceuticals will be leading the commercialization efforts in Europe. This development was announced in Amsterdam on February 27, 2026.",
            "link": "https://www.markets.news/headlines/2bcff5bf-89b8-4cdc-b37e-74de73848d2c",
            "pub_date": "2026-02-27 20:05:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1ec15176-1a79-4d4d-8d51-350683545ac1",
            "description": "GERMAN ECONOMY MINISTER SAYS WE MUST INCREASE OUR COMPETITIVENESS",
            "link": "https://www.markets.news/headlines/1ec15176-1a79-4d4d-8d51-350683545ac1",
            "pub_date": "2026-02-27 19:52:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NY judge denies Binance request to move pre-2019 US crypto claims to arbitration, keeps case in court.",
            "id": "2ef7cbc6-602b-4cac-9a27-8bd131999961",
            "description": "The recent ruling has determined that investor claims made before 2019 will remain in open court. Moreover, Binance’s attempt to move the dispute to private arbitration in Singapore has been denied.",
            "link": "https://www.markets.news/headlines/2ef7cbc6-602b-4cac-9a27-8bd131999961",
            "pub_date": "2026-02-27 19:52:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ba14a381-a816-4664-9a33-eb71f860abca",
            "description": "AUSTRIAN ECONOMY MINISTER SAYS AT TIMES OF GEOPOLITICAL TURMOIL, IT'S IMPORTANT FOR EUROPE TO STICK TOGETHER",
            "link": "https://www.markets.news/headlines/ba14a381-a816-4664-9a33-eb71f860abca",
            "pub_date": "2026-02-27 19:54:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Natural Resource Partners L.P. reported $136,367 net income for 2025, generated $169 million free cash flow, and announced a special distribution of $0.12 per common unit.",
            "id": "5d0a9c91-d020-4282-9d7b-d368933150cb",
            "description": "Natural Resource Partners L.P. reported its 2025 results, including net income of $30,998 for the fourth quarter and $136,367 for the year, operating cash flow of $44,765 for the fourth quarter and $165,863 for the full year, and free cash flow of $45,508 for the fourth quarter and $168,748 for the full year. The company generated $169 million of free cash flow, retired $109 million of debt, and paid total distributions of $4.21 per common unit in 2025. NRP's liquidity was $211.2 million at the end of the year. The board declared a special cash distribution of $0.12 per common unit to cover unitholder tax liabilities. The mineral rights segment saw decreased income due to lower coal sales prices and volumes, while the soda ash segment also experienced declines. NRP announced a capital investment in Sisecam Wyoming. Corporate and financing costs improved in 2025. NRP declared a Q4 2025 cash distribution of $0.75 per common unit and a special distribution of $0.12 per common unit. The company's consolidated leverage ratio was 0.2x at year-end. Revenue, income statements, cash flows, assets, liabilities, and capital were detailed in the financial tables. NRP is a master limited partnership based in Houston, TX, focusing on natural resources in the U.S., including coal and industrial minerals. The company continues to face challenges due to low coal and soda ash prices. Natural Resource Partners is taking steps to strengthen its position amidst the challenging market conditions.",
            "link": "https://www.markets.news/headlines/5d0a9c91-d020-4282-9d7b-d368933150cb",
            "pub_date": "2026-02-27 19:56:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zoomcar Holdings, Inc. offers exchange of outstanding warrants for common stock in India, as per recent SEC filings.",
            "id": "473f21c5-8195-45fe-be35-a96979de7459",
            "description": "On February 27, 2026, in Bengaluru, India, Zoomcar Holdings, Inc. (OTCQB: ZCAR) announced a voluntary offer to exchange outstanding common stock purchase warrants from its recent private placement for shares of common stock. This initiative follows a private placement completed on February 25, 2026. The company is a prominent peer-to-peer self-drive car-sharing marketplace in India. The warrants were outstanding as of February 26, 2026. The offer is detailed in the Company's Tender Offer Statement on Schedule TO, filed with the SEC on February 27, 2026. The warrants will be exchanged for shares of the Company's common stock, which has a par value of $0.0001 per share, subject to the conditions outlined in the Schedule TO.",
            "link": "https://www.markets.news/headlines/473f21c5-8195-45fe-be35-a96979de7459",
            "pub_date": "2026-02-27 19:59:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Off-highway Plastics Market projected to reach $13.08 billion by 2030 as per MarketsandMarkets report.",
            "id": "92845c0c-0777-44bf-aac3-527ba2cb8cb6",
            "description": "In Delray Beach, Florida on February 27, 2026, a report by MarketsandMarkets revealed key insights on the Off-highway Plastics Market. The report focused on various material types including Polypropylene, Polyvinyl Chloride, Polyethylene, Polyamide, Acrylonitrile Butadiene Styrene, Polycarbonate, Polyoxymethylene, Thermoplastic Elastomer, and Bio-based materials. The market analysis provided crucial data and trends for this sector, highlighting growth opportunities and challenges. This information aims to guide industry stakeholders in making informed decisions.",
            "link": "https://www.markets.news/headlines/92845c0c-0777-44bf-aac3-527ba2cb8cb6",
            "pub_date": "2026-02-27 20:00:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2a284e50-2098-40a6-a5cd-ba4be5373a9e",
            "description": "Zelenskyy: 'Just now, the President is talking with the Prime Minister of Slovakia, Robert Fico. The President invites him to Ukraine to discuss all the existing issues'",
            "link": "https://www.markets.news/headlines/2a284e50-2098-40a6-a5cd-ba4be5373a9e",
            "pub_date": "2026-02-27 19:46:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b79c3f42-e765-48ed-8e20-6f120591c246",
            "description": "S&P 500, NASDAQ 100 FUTURES FALL TO SESSION LOW OF 0.6%",
            "link": "https://www.markets.news/headlines/b79c3f42-e765-48ed-8e20-6f120591c246",
            "pub_date": "2026-02-27 19:46:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "815582a2-aa32-40b2-b5e2-4cd81440b550",
            "description": "BLACKSTONE AND BROOKFIELD SAID AMONG BIDDERS FOR €8B VW UNIT",
            "link": "https://www.markets.news/headlines/815582a2-aa32-40b2-b5e2-4cd81440b550",
            "pub_date": "2026-02-27 19:47:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9481df28-267d-4770-b7f9-421c88f16f10",
            "description": "SWISS ECONOMY MINISTER SAYS IMPORTANT TO STRENGTHEN ECONOMIC COOPERATION AT TIMES OF GLOBAL TENSIONS, SPEAKING AT MEETING OF ECONOMY MINISTERS FROM GERMAN-SPEAKING COUNTRIES",
            "link": "https://www.markets.news/headlines/9481df28-267d-4770-b7f9-421c88f16f10",
            "pub_date": "2026-02-27 19:47:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}