{
    "data": [
        {
            "title": "LingoAce gains WASC accreditation, setting new standards in supplemental education, joining elite institutions.",
            "id": "868bcde4-11e1-401e-80a8-178d9463085e",
            "description": "A prominent Edtech company, LingoAce, has recently achieved full accreditation from a highly respected accrediting body. This recognition places LingoAce among an exclusive group that includes private schools, public schools, and institutions. The accreditation was awarded in Singapore and San Mateo, California on February 27, 2026. LingoAce, known for its innovative educational solutions, is now part of a select few recognized for meeting the rigorous standards set by this accrediting body.",
            "link": "https://www.markets.news/headlines/868bcde4-11e1-401e-80a8-178d9463085e",
            "pub_date": "2026-02-27 21:33:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c66cba2e-72d4-4d45-bb10-3cfd22903074",
            "description": "OpenAI is expanding long standing pact with Nvidia. $NVDA",
            "link": "https://www.markets.news/headlines/c66cba2e-72d4-4d45-bb10-3cfd22903074",
            "pub_date": "2026-02-27 21:34:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "E.U. moves forward with South American trade deal despite legal challenge, involving Brazil, Argentina, Paraguay, and Uruguay. #trade #E.U.",
            "id": "97e3cfe3-c879-42af-bc58-937cdc566e20",
            "description": "The implementation of the deal with Brazil, Argentina, Paraguay, and Uruguay aims to broaden Europe's trade connections.",
            "link": "https://www.markets.news/headlines/97e3cfe3-c879-42af-bc58-937cdc566e20",
            "pub_date": "2026-02-27 21:34:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Obagi Medical and Schweiger Dermatology collaborate for ALOHA Program to provide real-world evidence for Obagi® saypha® MagIQ™.",
            "id": "41499e9e-505b-407e-9e4a-9d37bf41a367",
            "description": "Schweiger has been chosen as a top dermatology platform partner for its focus on clinical excellence, quick access to care, and wide presence in its national network of practices. This selection highlights Schweiger's dedication to providing quality dermatological services efficiently across a large number of locations.",
            "link": "https://www.markets.news/headlines/41499e9e-505b-407e-9e4a-9d37bf41a367",
            "pub_date": "2026-02-27 21:35:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "National Hardware Show Concept to Commerce in Las Vegas, March 31-April 2, 2026. Renovated format connecting retail industry.",
            "id": "de124867-e41c-4c7b-9550-96f50af46673",
            "description": "From March 31 to April 2, 2026, Las Vegas will host the leading event for product discovery and sourcing in the retail industry. Known as NHS Concept to Commerce 2026, this event aims to revolutionize the way retailers engage with new products. It will feature a new format and promises to be a must-attend for industry professionals.",
            "link": "https://www.markets.news/headlines/de124867-e41c-4c7b-9550-96f50af46673",
            "pub_date": "2026-02-27 21:35:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Afghan artist Sonita launches \"Donate Your Voice\" campaign with UNICEF to give voice to silenced Afghan women.",
            "id": "746134fb-fc0b-4389-8714-c21113169332",
            "description": "Singer and activist Sonita Alizadeh has introduced the \"Donate Your Voice\" campaign to combat the silence faced by women in Afghanistan. This initiative, in collaboration with UNICEF, encourages individuals worldwide to contribute their voices using a TikTok filter. The campaign was launched in Paris on February 27, 2026.",
            "link": "https://www.markets.news/headlines/746134fb-fc0b-4389-8714-c21113169332",
            "pub_date": "2026-02-27 21:35:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Metacon received EUR 2.6 million payment from Motor Oil Hellas for a 50 MW electrolysis plant project milestone.",
            "id": "6f06d8f2-9809-4f8f-b501-e3d20af1c9c3",
            "description": "In a recent development, Metacon, based in Stockholm, announced on Feb. 27, 2026, that they have successfully received a payment of EUR 2.6 million from Motor Oil Hellas. This amount corresponds to approximately SEK 27.7 million based on the current exchange rate. This payment was made in relation to achieving a significant milestone in the project to supply a 50 MW electrolysis plant. The project's progress underscores the partnership between Metacon and Motor Oil Hellas as they work towards the successful delivery of this substantial electrolysing facility.",
            "link": "https://www.markets.news/headlines/6f06d8f2-9809-4f8f-b501-e3d20af1c9c3",
            "pub_date": "2026-02-27 21:35:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2c727796-dbe3-4d46-b987-7b94d02ba00f",
            "description": "Microsoft: New funding doesn't change relationship with OpenAI. $MSFT",
            "link": "https://www.markets.news/headlines/2c727796-dbe3-4d46-b987-7b94d02ba00f",
            "pub_date": "2026-02-27 21:35:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "deab1ff4-352d-4b9a-bb9c-c7136ef08257",
            "description": "Iran MFA: 'Phone conversation between the Foreign Ministers of Iran and Iraq Fouad Hussein, the Foreign Minister of Iraq, in a phone call with Seyed Abbas Araghchi, the Foreign Minister of the Islamic Republic of Iran, discussed regional and international developments. Our",
            "link": "https://www.markets.news/headlines/deab1ff4-352d-4b9a-bb9c-c7136ef08257",
            "pub_date": "2026-02-27 21:36:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banco Santander Chile filed its 2025 Annual Report on Form 20-F with the SEC. Symbol NYSE: BSAC; SSE: Bsantander.",
            "id": "5a7ca812-de68-482d-8b19-4dfe1ca39645",
            "description": "Chilean bank Santander Chile has recently disclosed its 2025 Annual Report to the U.S. Securities and Exchange Commission. This report covers the fiscal year ending on December 31, 2025. The company, traded under the tickers NYSE: BSAC and SSE: Bsantander, officially submitted its Form 20-F for the mentioned period. This filing provides crucial financial information and performance details to regulators and shareholders.",
            "link": "https://www.markets.news/headlines/5a7ca812-de68-482d-8b19-4dfe1ca39645",
            "pub_date": "2026-02-27 21:36:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dcaf831e-2d1a-429e-bd25-22b7527b32f2",
            "description": "SPOT GOLD RISES NEARY 1% TO $5,236.99/OZ",
            "link": "https://www.markets.news/headlines/dcaf831e-2d1a-429e-bd25-22b7527b32f2",
            "pub_date": "2026-02-27 21:27:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Just Women's Sports launches new soccer podcast 'Time Wasting' with Kelley O'Hara and Ali Riley, providing insider analysis.",
            "id": "36b53477-21b5-40aa-a112-efad8444fe01",
            "description": "LOS ANGELES, February 27, 2026 - A new weekly show is set to debut, showcasing the insights of two prominent soccer stars on the international scene. The program will offer viewers insider analysis, in-depth tactical discussions, and candid narratives from prestigious soccer venues around the globe. Just Women's Sports, known for its diverse sports content, is extending its original programming with the introduction of this series. Stay tuned for the latest developments in sports as this exciting show unfolds.",
            "link": "https://www.markets.news/headlines/36b53477-21b5-40aa-a112-efad8444fe01",
            "pub_date": "2026-02-27 21:27:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6cc1cc62-e000-41d0-bc91-995572ce5f30",
            "description": "The American legal entity of the Anti-Corruption Foundation (FBK) has been added to the list of terrorist and extremist organizations, according to Russia's Rosfinmonitoring",
            "link": "https://www.markets.news/headlines/6cc1cc62-e000-41d0-bc91-995572ce5f30",
            "pub_date": "2026-02-27 21:27:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fe3a1d8f-9fcf-4a03-8dc0-6430f4288764",
            "description": "COCOA BEAN DEMAND SHOULD REMAIN UNDER PRESSURE IN 2025-2026 CYCLE -HEDGEPOINT",
            "link": "https://www.markets.news/headlines/fe3a1d8f-9fcf-4a03-8dc0-6430f4288764",
            "pub_date": "2026-02-27 21:27:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Duolingo's Q4 sales beat estimates at $282.868 million but forecasts for FY2026 at $1.197-1.221 billion were lower than expected.",
            "id": "31fceac2-c634-4cd1-89f4-274c8e3b3399",
            "description": "Duolingo Inc (DUOL) announced strong fourth-quarter sales of $282.868 million, surpassing market expectations of $275.925 million. However, their sales forecast for FY2026 falls below estimates, with expected revenues between $1.197 billion to $1.221 billion, compared to the projected $1.264 billion. The company highlighted the impact of AI advancements on learning methods and expressed a strategic shift towards prioritizing user growth and enhancing teaching quality. Duolingo aims to enhance the free learner experience to drive organic growth and expand into new sectors like chess, math, and music, which may temporarily impact financial growth. This shift positions Duolingo for future success. For more information, refer to the complete story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/31fceac2-c634-4cd1-89f4-274c8e3b3399",
            "pub_date": "2026-02-27 21:28:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "516c0fad-d059-49f9-b511-372bb3535a5d",
            "description": "CATALAN HEALTH DEPARTMENT ON SWINE FLU CASE DETECTED: RISK TO POPULATION CONSIDERED VERY LOW",
            "link": "https://www.markets.news/headlines/516c0fad-d059-49f9-b511-372bb3535a5d",
            "pub_date": "2026-02-27 21:28:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d5d13be9-401d-45d4-bc03-5b209e8a86f6",
            "description": "CATALAN HEALTH DEPARTMENT: PERSON WHO CONTRACTED VIRUS DID NOT SHOW FLU-LIKE SYMPTOMS, DID NOT TRANSMIT TO CLOSEST CONTACTS",
            "link": "https://www.markets.news/headlines/d5d13be9-401d-45d4-bc03-5b209e8a86f6",
            "pub_date": "2026-02-27 21:29:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b548de1e-4f17-404d-8d73-f2a49e0a28e9",
            "description": "IVORY COAST COCOA OUTPUT IN 2025-2026 CROP FORECAST AT 1.78 MLN METRIC TONS -HEDGEPOINT",
            "link": "https://www.markets.news/headlines/b548de1e-4f17-404d-8d73-f2a49e0a28e9",
            "pub_date": "2026-02-27 21:30:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2b94bd8a-c75b-4870-ab6c-2df6a8f5b755",
            "description": "Oman FM: 'The Sultanate of Oman participated in the extraordinary meeting of the open-ended Executive Committee at the level of foreign ministers of the member states of the Organization of Islamic Cooperation to discuss the decisions of the Israeli occupation, held in the city",
            "link": "https://www.markets.news/headlines/2b94bd8a-c75b-4870-ab6c-2df6a8f5b755",
            "pub_date": "2026-02-27 21:30:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frontline plc will present Q4 2025 results on 27 Feb at 15:00 CET via webcast/conference call.",
            "id": "39bbacb6-e135-4147-8f57-a9417444e7db",
            "description": "Frontline plc will be presenting the results for the fourth quarter of 2025 during a webcast/conference call on 27 February, 2026, starting at 15:00 CET. This presentation will offer insights into the performance of the company during this period. Shareholders and investors are encouraged to participate in this event to gain a better understanding of Frontline plc's financial standing.",
            "link": "https://www.markets.news/headlines/39bbacb6-e135-4147-8f57-a9417444e7db",
            "pub_date": "2026-02-27 21:30:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}