{
    "data": [
        {
            "title": "Mobile Infrastructure (AMEX: BEEP) to report quarterly earnings with estimated EPS of $-0.11 on 2026-03-02. Negative trend in stock performance with shares at $3.02, down 15.95% in 52 weeks. Guidance key for stock movement, not just beating estimates.",
            "id": "d5913198-9d3a-4c0a-b5d1-1ffa00622ee3",
            "description": "Mobile Infrastructure (AMEX: BEEP) is set to report its quarterly earnings on March 2, 2026. Analysts predict an EPS of $-0.11, with hopes for positive guidance for future growth. In the previous quarter, the company missed EPS by $0.06, resulting in a 0.31% share price drop. As of February 26, shares were at $3.02, down 15.95% over the last 52 weeks. Shareholders are mostly bearish leading up to the earnings release. Mobile Infrastructure focuses on acquiring and owning mobile infrastructure assets. For more details, the full story is available on Benzinga.com",
            "link": "https://www.markets.news/headlines/d5913198-9d3a-4c0a-b5d1-1ffa00622ee3",
            "pub_date": "2026-02-28 03:05:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Compugen's earnings report on 3/2 expected EPS $0.10. Strong historical performance saw 2.99% stock increase last quarter. Trading at $1.79, shares up 1.38% over last 52 weeks. Investors eagerly await report.",
            "id": "fcef53dd-32cc-4022-b8d8-100f10738ff6",
            "description": "Biotech company Compugen (NASDAQ: CGEN) is scheduled to release its quarterly earnings results on Monday, March 2, 2026. Analysts are anticipating an earnings per share (EPS) of $0.10. Investors are eagerly awaiting the announcement, hoping for results that exceed expectations and positive guidance for the upcoming quarter. It is important to highlight that guidance provided can heavily impact stock price movements, especially for new investors. Compugen outperformed expectations by $0.02 in the last quarter, resulting in a 2.99% increase in share price the following day. Here's a breakdown of Compugen's recent earnings performances and the subsequent stock price changes: Q3 2025: Estimated EPS -0.09, Actual EPS -0.07, Price Change 2.99%; Q2 2025: Estimated EPS -0.08, Actual EPS -0.08, Price Change -1.37%; Q1 2025: Estimated EPS -0.05, Actual EPS -0.08, Price Change 1.44%; Q4 2024: Estimated EPS 0.07, Actual EPS -0.07, Price Change 7.74%. As of February 26, Compugen shares were trading at $1.79, marking a 1.38% increase over the past 52 weeks. Investors can access the full story on Benzinga.com for more insights.",
            "link": "https://www.markets.news/headlines/fcef53dd-32cc-4022-b8d8-100f10738ff6",
            "pub_date": "2026-02-28 03:05:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gaia to report quarterly earnings on 2026-03-02. Analysts estimate EPS of $-0.01. Past missed EPS led to share price drop. Stock at $3.36.",
            "id": "2edb3d18-74b3-42fe-8235-3362df78b9b1",
            "description": "Gaia (NASDAQ: GAIA) is scheduled to release its latest quarterly earnings report on Monday, March 2, 2026. Analysts are expecting the company to report an earnings per share (EPS) of -$0.01. Investors are eagerly awaiting the announcement, hoping for results that exceed expectations and positive guidance for the following quarter. It's important to highlight that guidance can significantly impact stock price movement, especially for new investors. Looking back at Gaia's previous performance, in the last quarter, the company missed its EPS estimate by $0.00, resulting in an 8.71% decrease in the share price the following day. In the third quarter of 2025, the EPS estimate was -$0.05, and the actual figure reported was also -$0.05, leading to an 8.71% price decrease. In the second quarter of 2025, the EPS estimate was -$0.08, with the actual reported EPS at -$0.07, causing a 16.21% price increase. In the first quarter of 2025, the EPS estimate was -$0.03, and the company reported an EPS of -$0.04, resulting in a 10.32% decrease in price. In the fourth quarter of 2024, both the estimate and actual EPS were -$0.03, resulting in no price change. As of February 26, Gaia shares were trading at $3.36. Over the past 52 weeks, the shares have experienced a decline. Investors can find more details on this news at Benzinga.com.",
            "link": "https://www.markets.news/headlines/2edb3d18-74b3-42fe-8235-3362df78b9b1",
            "pub_date": "2026-02-28 03:05:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRC to release earnings report on March 2, with anticipated EPS of $0.01. Past performance shows a 7.04% price drop on EPS beat. Shares trading at $0.6404, down 75.49% over last 52 weeks. Investors eager for positive guidance.",
            "id": "254b70c2-c212-4b6d-a450-4e8563eedbc0",
            "description": "BRC (NYSE: BRCC) is set to release its quarterly earnings report on March 2, 2026. Analysts predict an earnings per share (EPS) of $0.01. In the previous quarter, BRC beat EPS estimates by $0.01, resulting in a 7.04% drop in share price the following day. The stock was trading at $0.6404 as of February 26, with shares down 75.49% over the last 52 weeks. Investors are eager for positive news and guidance from the company to potentially influence stock prices. Stock performance has been consistently negative, making long-term shareholders likely bearish ahead of the earnings release.",
            "link": "https://www.markets.news/headlines/254b70c2-c212-4b6d-a450-4e8563eedbc0",
            "pub_date": "2026-02-28 03:05:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kaltra introduces new technology to boost microchannel evaporator performance in cooling systems, making it more efficient.",
            "id": "891b8734-91b7-4e8d-ad0c-f204c6761e81",
            "description": "In ALTMUNSTER, Austria on February 27, 2026, Kaltra revealed a groundbreaking refrigerant distribution technology that enhances the efficiency of microchannel evaporators. These evaporators are vital components in contemporary cooling and heat pump systems. This innovation is set to revolutionize the industry by optimizing the performance of these systems.",
            "link": "https://www.markets.news/headlines/891b8734-91b7-4e8d-ad0c-f204c6761e81",
            "pub_date": "2026-02-28 03:05:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VICTOR Pet Food advises dog owners on essential protein requirements for pet food; Focus on quality.",
            "id": "942cdd28-b432-44ed-b952-203519065c1a",
            "description": "To commemorate National Protein Day, VICTOR Pet Food from MOUNT PLEASANT, Texas, released a guide on essential protein considerations for dog owners when purchasing their next pet food bag. The aim is to emphasize the significance of high-quality protein in pet nutrition. This initiative was launched on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/942cdd28-b432-44ed-b952-203519065c1a",
            "pub_date": "2026-02-28 03:05:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart settles lawsuit for $100M, gains market share, stock rises. Analyst reinstates Buy rating, sets price target at $150.",
            "id": "6e485c62-ba1d-45c2-8ccc-d8b2a0fa7af9",
            "description": "Shares of Walmart Inc. (NASDAQ: WMT) are experiencing an increase in trading value, following the disclosure that the company has settled a lawsuit by paying $100 million. The lawsuit alleged that Walmart had mislead its delivery drivers regarding their compensation, leading to significant income losses for them. The positive movement in Walmart stock is attributed to BofA Securities analyst Christopher Nardone reinstating a Buy rating on the stock and setting a price target of $150. Nardone's analysis highlighted the company's... (Full story can be found on Benzinga.com)",
            "link": "https://www.markets.news/headlines/6e485c62-ba1d-45c2-8ccc-d8b2a0fa7af9",
            "pub_date": "2026-02-28 03:06:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSC excelled in event security and crowd management at Super Bowl LX in Santa Clara, largest sporting event.",
            "id": "139057fa-0201-4050-8a0d-694fa46b0961",
            "description": "In Santa Clara, California on February 27, 2026, Contemporary Services Corporation (CSC) effectively provided event security and crowd management services for Super Bowl LX. CSC's operations supported the renowned sporting event, known as one of the largest and most intricate globally, with their extensive expertise.",
            "link": "https://www.markets.news/headlines/139057fa-0201-4050-8a0d-694fa46b0961",
            "pub_date": "2026-02-28 03:09:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Geographic Solutions wins top prize at DaVinci Awards for innovative reentry system; earned three-star rating.",
            "id": "f15dbef3-8f42-4801-b03a-1f1073f635a1",
            "description": "A company based in Palm Harbor, Florida, named Geographic Solutions, has recently gained recognition for its innovative reentry employment system. The system has earned a three-star rating in The DaVinci Awards® judging. A leading provider of workforce development software in the nation, Geographic Solutions has been acknowledged for its exceptional contributions in this field. The announcement was made on February 27, 2026, showcasing the company's commitment to excellence and creativity in supporting individuals reentering the workforce.",
            "link": "https://www.markets.news/headlines/f15dbef3-8f42-4801-b03a-1f1073f635a1",
            "pub_date": "2026-02-28 03:09:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Perezdiaz, LLC is among fewer than 100 authorized assessment bodies for CMMC, serving 80,000+ defense contractors.",
            "id": "56a55ed7-a8b8-4886-a741-b247e0cf84b9",
            "description": "A company, approved by The Cyber AB on February 24, 2026, has been granted authorization to conduct official CMMC Level 2 certification assessments as per 32 CFR Part 170 in the DALLAS-FORT WORTH METROPLEX, Texas. Perezdiaz Federal, the assessment arm of Perezdiaz, LLC, made this announcement on February 27, 2026.",
            "link": "https://www.markets.news/headlines/56a55ed7-a8b8-4886-a741-b247e0cf84b9",
            "pub_date": "2026-02-28 02:59:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royce Global Trust (NYSE: RGT) invests in global equities with 190,192 shares traded weekly; adviser has over 50 yrs experience.",
            "id": "c01ae04b-29b1-4f7d-b1cf-bada88f12b59",
            "description": "On Feb. 27, 2026, in New York, a closed-end fund specializing in global equities with a value-based strategy was discussed. The fund has an average weekly trading volume of around 190,192 shares. The adviser of the fund boasts over 50 years of expertise in investing in small- and micro-cap markets. Specific closing prices were also mentioned in the news.",
            "link": "https://www.markets.news/headlines/c01ae04b-29b1-4f7d-b1cf-bada88f12b59",
            "pub_date": "2026-02-28 02:59:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Magic Eden halts Bitcoin & Ethereum support, shifts focus to Solana. No more multi-chain approach.",
            "id": "3a9ea8c2-2652-4381-86a9-8a9f708a0652",
            "description": "Magic Eden has announced the discontinuation of support for Ethereum-compatible and Bitcoin-based assets, signaling a departure from its previous multi-chain strategy for user adoption. This decision will affect a significant number of users who hold these assets on the platform.",
            "link": "https://www.markets.news/headlines/3a9ea8c2-2652-4381-86a9-8a9f708a0652",
            "pub_date": "2026-02-28 02:59:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin manipulation accusations challenged amid ETFs ending 5-week outflows: Analysts refute daily dump, ETFs see 3 days of inflows & DeFi focuses on revenue.",
            "id": "9f34da7b-5d43-47d7-b7e1-7b3326bf8099",
            "description": "Some analysts are questioning the reported daily dumping of Bitcoin by Jane Street, as spot Bitcoin ETFs have recorded three consecutive days of inflows. Discussions within the DeFi community are now focusing more on tangible revenue opportunities.",
            "link": "https://www.markets.news/headlines/9f34da7b-5d43-47d7-b7e1-7b3326bf8099",
            "pub_date": "2026-02-28 03:01:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "bdcd89f3-ac86-46e1-b62d-f12c85c62fc4",
            "description": "OPENAI TO RAISE AN ADDITIONAL $10 BLN IN FUNDING FROM FINANCIAL INVESTORS - THEINFORMATION",
            "link": "https://www.markets.news/headlines/bdcd89f3-ac86-46e1-b62d-f12c85c62fc4",
            "pub_date": "2026-02-28 03:01:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDIC and Utah Dept of Financial Institutions approves Edward Jones Bank, expanding client services with integrated banking solutions.",
            "id": "d6240b40-2b65-44f0-b7c2-ab25a5b4712b",
            "description": "A significant achievement reflects the company's dedication to assisting customers in streamlining their financial affairs with comprehensive banking services. On February 27, 2026, in St. Louis, a milestone was reached. The Federal Deposit Insurance Corporation (FDIC) and the Utah Department of Financial Institutions were involved in the event.",
            "link": "https://www.markets.news/headlines/d6240b40-2b65-44f0-b7c2-ab25a5b4712b",
            "pub_date": "2026-02-28 02:51:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5f34e4e1-0557-4bbe-a8a7-5fc4efd5ab0d",
            "description": "Nordic Fibreboard AS reports unaudited Q4 2025 results, showing strong performance with revenue up by 15%.",
            "link": "https://www.markets.news/headlines/5f34e4e1-0557-4bbe-a8a7-5fc4efd5ab0d",
            "pub_date": "2026-02-28 02:51:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zscaler beats Q2 expectations with earnings of $1.01/share and revenue of $815.75 million. Raises FY26 sales guidance.",
            "id": "8de20faf-4acc-4378-bd73-498268bc246e",
            "description": "Zscaler Inc. (NASDAQ: ZS) exceeded expectations in Q2 with earnings of $1.01 per share, surpassing the estimated 90 cents, and quarterly revenue of $815.75 million, above the projected $798.82 million. The company updated its FY26 revenue guidance upwards. CEO Jay Chaudhry stated, \"We believe Zscaler is the cybersecurity platform for the AI age.\" The innovative Zero Trust platform is designed to secure the rapid growth and scale of AI and agentic workflows. For more details, the full article can be accessed online.",
            "link": "https://www.markets.news/headlines/8de20faf-4acc-4378-bd73-498268bc246e",
            "pub_date": "2026-02-28 02:52:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp 123Invent client from Morenci, Mich. develops new hour logging & license scanning system called A B C (ALL - BOUT - COMPLIANCE).",
            "id": "1ca33c2f-b680-46ef-8690-ca30523dee6d",
            "description": "In Pittsburgh on February 27, 2026, an inventor from Morenci, Michigan shared their motivation for creating a new logging and scanning system for hours and licenses by stating, \"As a truck driver, I wanted to ensure compliance.\" The invention, known as A B C (ALL - BOUT - COMPLIANCE), offers a solution to monitor and maintain adherence to regulations in the industry. This innovative design provides an alternative approach to tracking and managing important data, contributing to safer and more efficient operations.",
            "link": "https://www.markets.news/headlines/1ca33c2f-b680-46ef-8690-ca30523dee6d",
            "pub_date": "2026-02-28 02:47:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Former Biden advisor Jared Bernstein criticizes crypto, noting 'almost zero legal use cases' and calling it 'pretty good for scammers'. Bitcoin's 40% decline despite Trump's support emphasized. Regulatory concerns highlighted, with Bernstein questioning asset's value proposition. Crypto industry's influence on Congress and president noted. Regulatory shift seen as impacting prices negatively. ",
            "id": "e672e446-9419-4504-9228-0bb5f1d0997d",
            "description": "Jared Bernstein, former Chair of the Biden Council of Economic Advisors, criticized cryptocurrency, referring to it as an asset with minimal legal applications and a magnet for scammers. He highlighted a 40% decline in Bitcoin's value and dismissed the notion that even Donald Trump's support could salvage its situation. Bernstein argued that the industry's claim of being in its early stages no longer justifies its extreme price fluctuations, noting that regulatory challenges had initially masked its true worth until the Trump administration embraced it. According to Bernstein, the backing of Congress and the president did little to enhance crypto's reputation and actually exacerbated its negative perception in the market, leading to a swift depreciation in value. For the full article, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/e672e446-9419-4504-9228-0bb5f1d0997d",
            "pub_date": "2026-02-28 02:49:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royce Micro-Cap Trust (RMT) reports average weekly trading volume of 684,629 shares, adviser has 50yrs exp. Closing prices as of 01/31/26: NAV 12.91, MKT 11.49.",
            "id": "9324ee42-cd5d-44ae-95e6-aadc69ef4ebb",
            "description": "In the latest update from New York on February 27, 2026, it was reported that the average weekly trading volume for shares reached around 684,629. The fund's adviser boasts over 50 years of expertise in small- and micro-cap investments. As of January 31, 2026, the closing prices stood at NAV 12.91 and MKT 11.49. Additionally, the average annual total return as of the same date was reported to be (%)...",
            "link": "https://www.markets.news/headlines/9324ee42-cd5d-44ae-95e6-aadc69ef4ebb",
            "pub_date": "2026-02-28 02:51:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}