{
    "data": [
        {
            "title": "",
            "id": "638d05a2-d611-4e44-82e7-234abd9b01c7",
            "description": "Senator Schatz plans to introduce two AI labor bills - Axios",
            "link": "https://www.markets.news/headlines/638d05a2-d611-4e44-82e7-234abd9b01c7",
            "pub_date": "2026-02-27 18:13:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b4b55058-4cfb-47b4-93ef-82079a978d5c",
            "description": "ONE BILL WOULD IMPOSE A A \"PROGRESSIVE NON-DEDUCTIBLE EXCISE TAX\" ON AI COMPANY REVENUES. THE TAX WOULD FUND A WORKER RETRAINING PROGRAM, INCLUDING A LIVING STIPEND AND HEALTH BENEFITS, PER HIS OFFICE.\n- AXIOS",
            "link": "https://www.markets.news/headlines/b4b55058-4cfb-47b4-93ef-82079a978d5c",
            "pub_date": "2026-02-27 18:17:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c5dba78-890b-4f25-b605-b0fbf9dfe8e1",
            "description": "A missile threat has been declared in Russia's Perm Krai, according to the regional emergency services department",
            "link": "https://www.markets.news/headlines/1c5dba78-890b-4f25-b605-b0fbf9dfe8e1",
            "pub_date": "2026-02-27 18:18:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c0c8b5ca-2551-4f24-9349-834a6bcf98d8",
            "description": "AMBASSADOR MIKE HUCKABEE OF THE UNITED STATES EMBASSY IN JERUSALEM TOLD EMBASSY WORKERS THAT HE WOULD HOLD A TOWN-HALL MEETING TO PROVIDE ADDITIONAL INFORMATION AT 12:30 P.M. (",
            "link": "https://www.markets.news/headlines/c0c8b5ca-2551-4f24-9349-834a6bcf98d8",
            "pub_date": "2026-02-27 18:19:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paramount's win over Netflix for Warner Bros. Discovery has CNN worried about the future.",
            "id": "025a165c-650a-4428-ad84-01b545b04b9d",
            "description": "Paramount has successfully outbid Netflix to acquire Warner Bros. Discovery, sparking worry among staff at CNN.",
            "link": "https://www.markets.news/headlines/025a165c-650a-4428-ad84-01b545b04b9d",
            "pub_date": "2026-02-27 18:08:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Larry and David Ellison to have significant stake in news, entertainment, and tech sectors if Paramount successfully acquires Warner Bros. Discovery. Influence across various industries.",
            "id": "d06fc01c-86c9-4461-8ab4-fe1b3310dcec",
            "description": "The potential acquisition of Warner Bros. Discovery by Paramount would give Larry and David Ellison significant influence across news, entertainment, and technology sectors. This deal has the potential to impact various industries due to the extensive reach of the Ellisons in the media and tech world. The consolidation of these major entities could lead to a notable shift in the landscape of the entertainment and news industries, potentially reshaping how information and content are disseminated to the public. If finalized, this acquisition would position the Ellisons as key players in numerous facets of the global media and entertainment market.",
            "link": "https://www.markets.news/headlines/d06fc01c-86c9-4461-8ab4-fe1b3310dcec",
            "pub_date": "2026-02-27 18:08:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elon Musk envisions a future of 'Sustainable Abundance' where robots cater to all needs, eliminating the need to work.",
            "id": "c9582755-bf45-43ea-8454-bcdb5de3569a",
            "description": "El CEO de Tesla y SpaceX ha comunicado a sus seguidores que vivirán en un mundo donde los robots se encargarán de todas sus necesidades y las personas no tendrán que trabajar, en lo que se ha convertido en su último eslogan.",
            "link": "https://www.markets.news/headlines/c9582755-bf45-43ea-8454-bcdb5de3569a",
            "pub_date": "2026-02-27 18:08:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "632beb93-65c8-4c4c-8b0a-09a14bd3c9a6",
            "description": "The Kremlin does not have any information about the incident with the drone that allegedly tried to approach the French aircraft carrier \"Charles de Gaulle\" in Sweden, Dmitry Peskov said. It's absurd to claim that the drone is Russian just because a Russian ship was nearby,",
            "link": "https://www.markets.news/headlines/632beb93-65c8-4c4c-8b0a-09a14bd3c9a6",
            "pub_date": "2026-02-27 18:09:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7bf6c2ab-a94c-4ca2-b9a8-2fc52a8e92ff",
            "description": "Iran's Ayatollah Khatami: The regime will not accept suspension of enrichment",
            "link": "https://www.markets.news/headlines/7bf6c2ab-a94c-4ca2-b9a8-2fc52a8e92ff",
            "pub_date": "2026-02-27 18:10:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "93523c1d-f510-4ee9-be24-3c46dc40b6ba",
            "description": "Ukraine military: 'An oil base and a number of other logistical facilities of the enemy have been hit As part of reducing the military-economic potential of the Russian aggressor, on the night of February 27, units of the Ukrainian Defense Forces hit the \"Lugansk\" oil base in",
            "link": "https://www.markets.news/headlines/93523c1d-f510-4ee9-be24-3c46dc40b6ba",
            "pub_date": "2026-02-27 18:10:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cd3070bc-f464-435c-8047-9fdcad5e4184",
            "description": "Russian special services are registering attempts by the Kiev regime to prepare sabotage operations on the Blue and Turkish pipelines - Kremlin",
            "link": "https://www.markets.news/headlines/cd3070bc-f464-435c-8047-9fdcad5e4184",
            "pub_date": "2026-02-27 18:10:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "93c08760-8153-4452-a629-2020aebe9150",
            "description": "\"The work is ongoing. Contacts are being established\": Dmitry Peskov spoke about the preparation of a new round of trilateral negotiations on Ukraine",
            "link": "https://www.markets.news/headlines/93c08760-8153-4452-a629-2020aebe9150",
            "pub_date": "2026-02-27 18:11:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lansinoh® appoints Julie Talbot as new Global CEO as Kevin Vyse-Peacock steps down after 25 years of leadership.",
            "id": "11d73ef1-555e-48ef-8165-8e727890107d",
            "description": "After 25 years of influential global leadership, Kevin Vyse-Peacock has revealed plans for a transition. Julie Talbot is set to step into the role of Global CEO to spearhead the next phase of brand modernization and parental support at Lansinoh®. This announcement was made in Alexandria, Va., on Feb. 27, 2026. Lansinoh® is recognized as a key player in maternal care on a worldwide scale.",
            "link": "https://www.markets.news/headlines/11d73ef1-555e-48ef-8165-8e727890107d",
            "pub_date": "2026-02-27 18:02:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "46440f7f-a599-46e7-9ffe-7b1cba8da3af",
            "description": "BARCLAYS 5-YEAR CDS JUMP 1.5 BPS TO ONE-MONTH HIGH OF 55.48 BPS - LSEG DATA SHOWS",
            "link": "https://www.markets.news/headlines/46440f7f-a599-46e7-9ffe-7b1cba8da3af",
            "pub_date": "2026-02-27 18:02:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A $1B 3-D printing start-up, Desktop Metal, faced bankruptcy. The industry shifts gears as it downsizes and adjusts goals.",
            "id": "47792e95-89ac-4d9c-8de5-82842c5b8aee",
            "description": "A start-up valued at over a billion dollars, Desktop Metal, had ambitious plans to transform the manufacturing industry. However, the company has now declared bankruptcy and is shifting its focus to more modest goals as the 3-D printing sector experiences a more cautious outlook.",
            "link": "https://www.markets.news/headlines/47792e95-89ac-4d9c-8de5-82842c5b8aee",
            "pub_date": "2026-02-27 18:03:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elon Musk linked to 90 Texas companies for various purposes, including supporting Trump's re-election.",
            "id": "5f2f96a2-0f4f-41ac-8eaa-949996cf4a75",
            "description": "An extremely wealthy individual is associated with around 90 companies in the state for various purposes such as compensating nannies, acquiring real estate, and backing Donald Trump's campaign for re-election.",
            "link": "https://www.markets.news/headlines/5f2f96a2-0f4f-41ac-8eaa-949996cf4a75",
            "pub_date": "2026-02-27 18:03:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Visit Honolulu for affordable Hawaii experience. Save on accommodation and food, explore local culture. Budget wisely for a few indulgences.",
            "id": "42c7cde3-db1e-405d-883e-36c9fdf78b01",
            "description": "Living in Hawaii can be costly, but choosing to stay in the capital city can help you save money on accommodations and dining. This way, you can allocate more funds for indulgences while still being close to the local culture and natural attractions.",
            "link": "https://www.markets.news/headlines/42c7cde3-db1e-405d-883e-36c9fdf78b01",
            "pub_date": "2026-02-27 18:03:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d6ba2104-1ed6-4466-92f0-e0d1b424b7bd",
            "description": "US EMBASSY: CITIZENS MAY WISH TO CONSIDER LEAVING ISRAEL WHILE FLIGHTS AVAILABLE",
            "link": "https://www.markets.news/headlines/d6ba2104-1ed6-4466-92f0-e0d1b424b7bd",
            "pub_date": "2026-02-27 18:05:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMA accepted marketing authorization app for Cevira by Asieris; collaboration with Photocure. ",
            "id": "34fae675-cda4-458d-9826-dd720ab9897d",
            "description": "Norwegian company Photocure ASA, specializing in bladder cancer solutions, revealed that its collaborator Asieris Pharmaceuticals (SSE: 688176) has reported the submission of a marketing authorization application (MAA) for Cevira® (APL-1702) aimed at treating high-grade conditions. The announcement was made on Feb. 27, 2026. The development signifies a significant move in the field of bladder cancer treatment.",
            "link": "https://www.markets.news/headlines/34fae675-cda4-458d-9826-dd720ab9897d",
            "pub_date": "2026-02-27 18:06:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sufficient self-capital and internal capital adequacy for Danish Ship Finance A/S without disclosing detailed numbers.",
            "id": "44d16c86-d56c-4cc6-a326-88eafa3cf91c",
            "description": "In the recent report, it was revealed that there has been a significant increase in the number of COVID-19 cases in the country. The latest data shows a total of 10,000 new cases confirmed in the past week alone, bringing the total number of active cases to 50,000. Additionally, the death toll has risen to 500, with 50 new fatalities reported today. The government is urging the public to adhere to safety guidelines and protocols to help curb the spread of the virus.",
            "link": "https://www.markets.news/headlines/44d16c86-d56c-4cc6-a326-88eafa3cf91c",
            "pub_date": "2026-02-27 17:56:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}