{
    "data": [
        {
            "title": "Ethan Allen's Mexico plant in Silao, Guanajuato, honored for 7th year for socially and environmentally responsible practices.",
            "id": "8efb0884-aa0a-4ed5-8e79-801272312246",
            "description": "In Danbury, Connecticut on February 26, 2026, Ethan Allen's upholstery manufacturing facility in Silao, Guanajuato, Mexico has received the \"Empresa Socialmente Responsable\" (Environmentally and Socially Responsible Company) designation for the seventh year in a row. This prestigious recognition is awarded by the Mexican Center for Corporate Philanthropy and the Alliance for Corporate Social Responsibility, highlighting the plant's ongoing commitment to environmental and social responsibility.",
            "link": "https://www.markets.news/headlines/8efb0884-aa0a-4ed5-8e79-801272312246",
            "pub_date": "2026-02-27 02:46:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EDF's successful senior green bond issue raises 2.75 billion euros.",
            "id": "3070f2d4-f7d4-4d90-a741-66a676812104",
            "description": "EDF has reported the accomplishment of its senior green multi-tranche bond issuance, totaling 2.75 billion euros in nominal value.",
            "link": "https://www.markets.news/headlines/3070f2d4-f7d4-4d90-a741-66a676812104",
            "pub_date": "2026-02-27 02:47:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IonQ (NYSE: IONQ) reported Q4 revenue of $61.9 million, up 429% YoY, surpassing expectations. Stock up 20% in response. Company hit $130 million for full year, signaling strong commercial growth in quantum computing sector. Investors optimistic about future.",
            "id": "0e2f3bcc-5e52-4ed7-820d-bbd8358890d9",
            "description": "IonQ Inc. (NYSE: IONQ) has reported impressive fourth-quarter results, marking a significant shift in the quantum computing sector from theoretical promise to tangible commercial growth. The company's stock is on the rise, reflecting investor confidence. In Q4, IonQ recorded a substantial revenue beat of $61.9 million, showcasing a remarkable 429% increase from the previous year and surpassing Wall Street's projections. This robust performance extended to the full year, with IonQ achieving $130 million in revenue, becoming the first pure-play quantum company to surpass the $100 million annual revenue milestone. As a result, shares surged by nearly 20% in a single trading session. IonQ's success not only benefitted the company but also boosted the entire quantum sector, demonstrating the increasing willingness of customers to invest in quantum services. This development signifies a promising start for quantum businesses as they move into a phase of commercial viability.",
            "link": "https://www.markets.news/headlines/0e2f3bcc-5e52-4ed7-820d-bbd8358890d9",
            "pub_date": "2026-02-27 02:48:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teladoc Health beats Q4 earnings, posts sales of $642.269M vs $635.235M estimates; FY2026 loss forecast cut to $(1.10)-$(0.70) vs $(0.76) estimates; expects sales of $2.47B-$2.587B vs $2.548B estimates.",
            "id": "e721c43b-e0a3-4426-954a-8999c336801d",
            "description": "Teladoc Health Inc (NYSE: TDOC) reported a strong performance for Q4 with a quarterly loss of 14 cents per share, surpassing market expectations of an 18 cents per share loss. The company's sales reached $642.269 million, exceeding estimates of $635.235 million. For FY2026, Teladoc Health anticipates a GAAP loss ranging between $(1.10)-$(0.70) compared to market projections of $(0.76). Revenue outlook for the year is between $2.470 billion-$2.587 billion, while estimates stood at $2.548 billion. The company's CEO expressed optimism about the results, highlighting achievements in various strategic areas.",
            "link": "https://www.markets.news/headlines/e721c43b-e0a3-4426-954a-8999c336801d",
            "pub_date": "2026-02-27 02:48:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FedEx may refund customers for tariffs after suing administration post Supreme Court ruling against duties.",
            "id": "595569d7-43ab-498b-81f1-1a9f6f94ec5e",
            "description": "The company took legal action against the administration a few days following the Supreme Court's decision against the president's responsibilities.",
            "link": "https://www.markets.news/headlines/595569d7-43ab-498b-81f1-1a9f6f94ec5e",
            "pub_date": "2026-02-27 02:48:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EventWorks 4D collaborates on Europe's first interactive AI Holocaust testimony theater, expanding immersive capabilities.",
            "id": "501b5da3-3b57-410e-ae50-1ede0da012c9",
            "description": "In Essen, Germany, on February 26, 2026, EventWorks 4D revealed their partnership in introducing Europe's pioneering interactive AI Holocaust testimony theater, known as the Holo-Voices Theater. This innovative project was created in conjunction with TU Dortmund University and received support from the Ministry of Culture and Science of the State. The Holo-Voices Theater promises to provide a unique experience, blending historical narratives with cutting-edge technology for educational purposes.",
            "link": "https://www.markets.news/headlines/501b5da3-3b57-410e-ae50-1ede0da012c9",
            "pub_date": "2026-02-27 02:50:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Daymond John to speak at WiresConnect conference in Seattle, March 11, 2026. Exclusive event for leaders in retail & technology. CEO Kimberly Carney hosts at The Rainier Club.",
            "id": "3d2ff0e8-2db8-4bc0-9d8b-20eb067b2967",
            "description": "In Seattle, WiresConnect is organizing its third conference on March 11, at The Rainier Club. The event, established by Kimberly Carney, CEO & Founder of The Wires, aims to unite leaders from retail, innovation, and technology sectors. This exclusive, by-invitation-only gathering focuses on discussions related to AI, leadership, and other pertinent topics. Previous events in New York saw significant attendance, marking a successful series of engagements. The upcoming conference anticipates participation from decision-makers in retail, technology, media, and culture industries for high-level exchanges.",
            "link": "https://www.markets.news/headlines/3d2ff0e8-2db8-4bc0-9d8b-20eb067b2967",
            "pub_date": "2026-02-27 02:50:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PatentVest report analyzes 1,200+ patent docs on Oral Small-Molecule GLP-1, highlighting exclusivity trends.",
            "id": "5371b4ee-94ea-4c7c-9a74-955c12b8b4e0",
            "description": "Examination of over 1,200 patent documents highlights the programs that are establishing long-lasting exclusivity rights, as well as those that may not be.",
            "link": "https://www.markets.news/headlines/5371b4ee-94ea-4c7c-9a74-955c12b8b4e0",
            "pub_date": "2026-02-27 02:37:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rider Jet Center at Hagerstown Regional Airport wins regional and national awards; recognized for excellence.",
            "id": "5fcdfed5-4fbc-42f3-8f9e-664b637fc3d1",
            "description": "In Hagerstown, Maryland on February 26, 2026, Rider Jet Center, a comprehensive Fixed Base Operator (FBO) located at Hagerstown Regional Airport, has received prestigious regional and national accolades. The center achieved victory in the 2026 Washington County Business Awards, affirming its commitment to excellence in its services...",
            "link": "https://www.markets.news/headlines/5fcdfed5-4fbc-42f3-8f9e-664b637fc3d1",
            "pub_date": "2026-02-27 02:37:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cancun All Inclusive unveils new resorts and exclusive deals for Spring Break 2026. All you need in one place.",
            "id": "da5ce6e3-e51b-4e07-8c25-f7baa5c5b97a",
            "description": "Get ready for an unforgettable Spring Break experience in Cancun, Mexico! Cancun All Inclusive offers a wide range of amenities including All Inclusive Resorts, Airport Transportation, and Tours. Visit their website at www.cancunallinclusive.com for more information. Plan your trip now for the upcoming Spring Break 2026!",
            "link": "https://www.markets.news/headlines/da5ce6e3-e51b-4e07-8c25-f7baa5c5b97a",
            "pub_date": "2026-02-27 02:39:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fc151c9d-5a20-4a72-892c-186a558c61fc",
            "description": "Taliban spokesperson: ‘The major headquarters of the Pakistani regime located at Anzar Sar, under the Babrak post in the Alisher–Terezi district of Khost Province, has just been captured. Dozens of soldiers are killed and wounded, and a large quantity of weapons has fallen into",
            "link": "https://www.markets.news/headlines/fc151c9d-5a20-4a72-892c-186a558c61fc",
            "pub_date": "2026-02-27 02:40:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DPCG wins 2 virtual patient monitoring awards for VA locations in Atlanta and Alabama. Small business based in Waco, Texas.",
            "id": "558fb684-1c90-4316-b510-ab933e963270",
            "description": "Decisive Point Consulting Group, LLC (DPCG), a Small Business Administration verified Service-Disabled Veteran-Owned Small Business and Woman-Owned Small Business based in Waco, Texas, disclosed securing two contracts for the Department of Veterans Affairs. The contracts, awarded for services at the Atlanta VA Medical Center and the Central Alabama VA Medical Centers, mark a significant milestone for DPCG. These new agreements signify an expansion in the implementation of DPCG’s advanced Virtual Patient Monitoring technology.",
            "link": "https://www.markets.news/headlines/558fb684-1c90-4316-b510-ab933e963270",
            "pub_date": "2026-02-27 02:41:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Video editor at MrBeast suspended amid insider probe by Beast Industries after allegations of insider trading. CEO Jeff Housenbold confirms.",
            "id": "9d5c67b5-aa6a-4cfb-9b1e-cf4fcfac558b",
            "description": "The CEO of Beast Industries, Jeff Housenbold, has confirmed that the company has temporarily suspended an employee amidst allegations of engaging in insider trading. The employee in question is currently under internal investigation by the company.",
            "link": "https://www.markets.news/headlines/9d5c67b5-aa6a-4cfb-9b1e-cf4fcfac558b",
            "pub_date": "2026-02-27 02:41:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lowe's beats earnings estimates, raises price target; maintains Outperform rating with price target raised to $95.",
            "id": "4ef4308a-d739-4a56-a02b-19f2ac75c254",
            "description": "Lowe's Companies Inc (LOW) outperformed expectations in its recent earnings report, following a trend similar to Home Depot (HD). However, the company's 2026 guidance fell short of projections, as indicated by Telsey Advisory Group. Analyst Joseph Feldman, representing Lowe's Companies, maintained an Outperform rating and raised the price target from $85 to $95. The company's earnings stood at $1.98 per share, surpassing the estimated $1.94 per share, primarily due to increased sales and gross margins, per Feldman. For more insights and analyst stock ratings, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/4ef4308a-d739-4a56-a02b-19f2ac75c254",
            "pub_date": "2026-02-27 02:41:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "World Hearing Day on March 3 raises awareness for hearing healthcare and reducing stigma; led by IHS and WHO.",
            "id": "83ac4c09-9cc9-4eb5-a881-0a84abd2f7dc",
            "description": "On February 26, 2026, in Farmington Hills, Michigan, the International Hearing Society (IHS) and the World Health Organization (WHO) designated March 3 as World Hearing Day in efforts to bolster awareness about hearing healthcare and combat the stigma surrounding the use of hearing aids. The initiative aims to emphasize the importance of maintaining good hearing health and promote accessibility to hearing aids.",
            "link": "https://www.markets.news/headlines/83ac4c09-9cc9-4eb5-a881-0a84abd2f7dc",
            "pub_date": "2026-02-27 02:45:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Retail traders are abandoning crypto for equities in 2026 due to plunging crypto volatility and a new AI-powered edge in the stock market. $2.3 trillion digital asset market sees capital outflow. Retailers treating stocks as direct substitutes. Dip-buying behavior shifting to stock market.",
            "id": "f44da5d0-37b2-4280-a8fd-b559423ded4a",
            "description": "Bitcoin (CRYPTO: BTC) and the wider digital asset market worth $2.3 trillion are experiencing an outflow of retail capital as traders are shifting focus towards equities. This change in preference is driven by the decreasing volatility in cryptocurrencies and the emergence of a new AI-powered edge in the stock market. Recent flow data from JPMorgan and Wintermute indicates a breakdown in the historical relationship between retail stock and crypto investments in late 2024. Retail traders now view stocks and crypto as direct substitutes rather than complementary risk-on assets, resulting in a negative correlation. When retail investors are actively buying stock market dips, they are staying away from the crypto market. The movement of money out of crypto is a shift from the previous trend where retail participation influenced major crypto cycles through dip-buying and capital rotation. This behavioral change is now being observed in the stock market. For the full story, refer to Benzinga.com.",
            "link": "https://www.markets.news/headlines/f44da5d0-37b2-4280-a8fd-b559423ded4a",
            "pub_date": "2026-02-27 02:31:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thousands of schools nationwide participate in National No One Eats Alone® Day, a program by Sandy Hook Promise to tackle social isolation.",
            "id": "5b6814de-81fd-4165-80c0-3bf8e44e2b45",
            "description": "In Louisville, Kentucky, Sandy Hook Promise and WellCare collaboratively organized an event on Feb. 26, 2026, to promote student connections within schools. The initiative, National No One Eats Alone® Day, was observed in numerous educational institutions nationwide. This program, spearheaded by Sandy Hook Promise with the goal of combatting social isolation, saw participation from thousands of schools. The event aimed to foster inclusivity and unity among students, emphasizing the importance of interaction among classmates.",
            "link": "https://www.markets.news/headlines/5b6814de-81fd-4165-80c0-3bf8e44e2b45",
            "pub_date": "2026-02-27 02:31:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CINC Systems introduces AI-powered payables solution for CAM industry. Largest tech partner in CAM, launched on Feb. 26, 2026.",
            "id": "52575ee1-a7c4-4e1e-bac9-97a1f2178764",
            "description": "In Duluth, Georgia on February 26, 2026, CINC Systems, a prominent technology partner in the community association management (CAM) sector, unveiled a new CAM solution. This innovative system aims to streamline invoice ingestion, ledger coding, and digital vendor payments. As a leader in the industry, CINC Systems' launch of this automated solution marks a significant advancement in CAM technology. The company's dedication to revolutionizing processes in the field is evident, solidifying their position as a top player.",
            "link": "https://www.markets.news/headlines/52575ee1-a7c4-4e1e-bac9-97a1f2178764",
            "pub_date": "2026-02-27 02:31:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1f23acc4-f7c1-41a9-9c17-1732a5158ea1",
            "description": "Eu council: ‘#Sanctions against terrorism: expands the scope of the EU terrorist list to better address the continued threat posed by terrorism & violent extremism + prolongs the list’s validity by 1 year’",
            "link": "https://www.markets.news/headlines/1f23acc4-f7c1-41a9-9c17-1732a5158ea1",
            "pub_date": "2026-02-27 02:32:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8584c825-83dc-4904-ac62-f863ac6b05e7",
            "description": "Cars from the US delegation in the Iran talks leave the venue - Iran State TV.",
            "link": "https://www.markets.news/headlines/8584c825-83dc-4904-ac62-f863ac6b05e7",
            "pub_date": "2026-02-27 02:33:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}