{
    "data": [
        {
            "title": "Conflux (CFX) v3.0.3 Testnet launched with CIP-166 and 7 bug fixes. Node operators can upgrade for new CLZ opcode & RPC enhancements.",
            "id": "149ff152-4faf-4236-b5c7-bb0b71e54a26",
            "description": "The Conflux (CFX) Network has released a new testnet upgrade, version 3.0.3, which includes several key features. These enhancements consist of the introduction of the new CLZ opcode, addressing seven bug fixes, and improving RPC functionality. Node operators now have the option to upgrade to this latest version.",
            "link": "https://www.markets.news/headlines/149ff152-4faf-4236-b5c7-bb0b71e54a26",
            "pub_date": "2026-02-28 17:32:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LDO price may see reversal, with support at $0.26 and targets $0.31-$0.33 short-term, $0.26-$0.44 medium-term. Bullish at $0.33.",
            "id": "677a662f-9ba4-4683-bb8e-c7bd582d8e98",
            "description": "Summary of LDO Price Prediction: In the short term (1 week), the price target is between $0.31 and $0.33. Looking ahead to the medium term (1 month), the forecasted range is $0.26 to $0.44. A bullish breakout is expected at $0.33, while the critical support level stands at $0.26.",
            "link": "https://www.markets.news/headlines/677a662f-9ba4-4683-bb8e-c7bd582d8e98",
            "pub_date": "2026-02-28 17:32:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hedera's HBAR may hit $0.11 resistance by March 2026, currently trading at $0.094 with RSI at 44.88. MACD shows bearish signals.",
            "id": "5735fcce-7e61-4bf7-b7de-7217292659a1",
            "description": "The cryptocurrency HBAR is currently trading at $0.094 with a neutral Relative Strength Index (RSI) of 44.88. Technical analysis indicates a possible increase to the $0.11 resistance level. However, bearish signals from the Moving Average Convergence Divergence (MACD) indicator raise caution for investors in Hedera, suggesting a possible downturn.",
            "link": "https://www.markets.news/headlines/5735fcce-7e61-4bf7-b7de-7217292659a1",
            "pub_date": "2026-02-28 17:27:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PEPE price shows bearish signs in March as RSI drops to 35.21 and MACD signals turn negative. Key support levels may be tested by March 2026.",
            "id": "ad7b2903-5098-4567-a8dd-d63eb2534422",
            "description": "PEPE is currently experiencing a downward trend as indicated by its Relative Strength Index (RSI) at 35.21 and negative Moving Average Convergence Divergence (MACD) signals. Analysts predict a potential decrease in value with the possibility of testing key support levels in March 2026.",
            "link": "https://www.markets.news/headlines/ad7b2903-5098-4567-a8dd-d63eb2534422",
            "pub_date": "2026-02-28 17:18:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Peter Schiff warns Bitcoin is overvalued at $65,000, urges investors to sell. Says holders are delusional. Full story at Benzinga.com.",
            "id": "3c933ecb-a3b5-4f0b-970a-015c6c571bb8",
            "description": "Bitcoin (BTC) is currently trading close to the $65,000 mark, as veteran crypto critic Peter Schiff has reiterated his negative stance on the leading cryptocurrency. Schiff advised investors to exit their positions while they still have the chance, as he believes the market is offering ample opportunity to sell above $65,000. Despite acknowledging Bitcoin's significant growth over the past decade, Schiff cautioned that many holders have unrealistic expectations about its future performance. He expressed his skepticism on Bitcoin reaching new highs and predicted that those who remain optimistic will sustain losses. Schiff shared his views on X platform, emphasizing that the current price is a favorable opportunity to cash out, considering Bitcoin's much lower value a decade ago. For further details, the complete article can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/3c933ecb-a3b5-4f0b-970a-015c6c571bb8",
            "pub_date": "2026-02-28 17:20:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dehua showcases 30+ white porcelain pieces in Geneva to boost cultural exchange and industrial cooperation.",
            "id": "5bbe4d2e-152c-4975-8f89-1940f5963963",
            "description": "On February 24th, 2026, over 30 exquisite pieces of Dehua white porcelain were showcased at the Palais des Nations in Geneva. The collection demonstrated the modern interpretation of traditional Chinese artistry, combining classical beauty with contemporary design.",
            "link": "https://www.markets.news/headlines/5bbe4d2e-152c-4975-8f89-1940f5963963",
            "pub_date": "2026-02-28 17:21:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WIF expected to reach $0.21-$0.25 by March 2026 with RSI rebounding from oversold levels at $0.19, indicating potential recovery.",
            "id": "c9991ce8-1b3a-4af7-b1d6-9d9a25648960",
            "description": "The cryptocurrency Dogwifhat (WIF) is currently trading at $0.19, indicating oversold conditions. Technical indicators point towards a possible recovery, projecting a price range of $0.21 to $0.25 within the next four weeks. The Relative Strength Index (RSI) is showing signs of bouncing back from neutral territory, supporting the potential upward movement in price.",
            "link": "https://www.markets.news/headlines/c9991ce8-1b3a-4af7-b1d6-9d9a25648960",
            "pub_date": "2026-02-28 17:23:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ALGO price aims $0.095-$0.16 by March 2026 amid technical recovery signs. Currently at $0.082557, down 8.01% in 24 hours.",
            "id": "8e8c1433-79d7-453e-9da9-ce2fe75f307a",
            "description": "Algorand (ALGO) is showing promising technical indicators for a potential rebound as the digital currency is currently trading at $0.082557, marking an 8.01% decline in the last 24 hours. Despite this recent drop, numerous trends suggest a potential turnaround in the near future.",
            "link": "https://www.markets.news/headlines/8e8c1433-79d7-453e-9da9-ce2fe75f307a",
            "pub_date": "2026-02-28 17:08:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin plunges to $63K amid US, Israel airstrikes on Iran, isolating itself from disrupted traditional markets. Support remains intact.",
            "id": "0253c48b-37d7-43d4-b3bd-62ec66c1472a",
            "description": "Over the weekend, Bitcoin navigated geopolitical instability on its own as markets in Iran were closed. Despite this, the cryptocurrency managed to maintain key support levels, showcasing resilience in the face of external pressures.",
            "link": "https://www.markets.news/headlines/0253c48b-37d7-43d4-b3bd-62ec66c1472a",
            "pub_date": "2026-02-28 17:10:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "INJ price target $3.44 by March with RSI at 37.49; currently at $2.90 post 11.74% decline. Technical indicators point to potential recovery.",
            "id": "a3fc57b1-bd0a-4738-8299-2b9dae4df8c0",
            "description": "The price of Injective (INJ) is currently at $2.90, reflecting an 11.74% decrease. However, the Relative Strength Index (RSI) stands at 37.49, indicating a possible turnaround. Analysis of Bollinger Bands positions suggests a potential rebound to $3.44 resistance level in the coming weeks.",
            "link": "https://www.markets.news/headlines/a3fc57b1-bd0a-4738-8299-2b9dae4df8c0",
            "pub_date": "2026-02-28 16:58:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CRV aiming for $0.27 rebound by March 2026, showing oversold conditions at $0.23 with RSI at 38.69. Possible range $0.27-$0.32 amid bearish trend.",
            "id": "ec9ee6bd-e50b-4028-937a-a8bbf01ad70a",
            "description": "The current price of CRV stands at $0.23, indicating oversold conditions as per the Relative Strength Index (RSI) reading of 38.69. Based on technical analysis, there is a potential for a recovery towards the range of $0.27 to $0.32. This prediction comes as Curve navigates through bearish momentum expected in the upcoming weeks.",
            "link": "https://www.markets.news/headlines/ec9ee6bd-e50b-4028-937a-a8bbf01ad70a",
            "pub_date": "2026-02-28 16:52:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FLOKI oversold at $0.00002676, RSI 35.10. Predicted recovery to $0.000048-$0.000050 by March 2026. Technically bullish.",
            "id": "19ef078d-2d6b-4181-951e-c6d9dbb12d13",
            "description": "The cryptocurrency FLOKI is currently experiencing oversold conditions, trading at $0.00002676 with a Relative Strength Index (RSI) of 35.10. Technical analysis indicates a possible recovery in March 2026, with a target range of $0.000048 to $0.000050.",
            "link": "https://www.markets.news/headlines/19ef078d-2d6b-4181-951e-c6d9dbb12d13",
            "pub_date": "2026-02-28 16:47:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Price forecast for TON: $1.43-$1.66 by March 2026. Short-term target: $1.36-$1.40, breakout level $1.95.",
            "id": "d923ba83-f789-4955-a24f-10002ac92392",
            "description": "The price forecast for TON (Token) indicates a short-term target of $1.36-$1.40 within one week, with a medium-term forecast ranging between $1.25 and $1.66 over a month. A bullish breakout is expected at the $1.95 mark, while critical support levels are yet to be determined.",
            "link": "https://www.markets.news/headlines/d923ba83-f789-4955-a24f-10002ac92392",
            "pub_date": "2026-02-28 16:42:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SHIB's critical support at RSI 35.09, facing bearish momentum. Analysts cautious with resistance breaks in sight.",
            "id": "ec195436-b1a3-45a4-a2b1-4ccc50c7d6e5",
            "description": "The cryptocurrency SHIB is currently facing a critical support test where its Relative Strength Index (RSI) stands at 35.09, indicating bearish momentum according to the Moving Average Convergence Divergence (MACD) indicator. Analysts are closely watching for potential resistance breaks, but caution is advised due to the technical indicators showing potential risks in the near future.",
            "link": "https://www.markets.news/headlines/ec195436-b1a3-45a4-a2b1-4ccc50c7d6e5",
            "pub_date": "2026-02-28 16:40:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Worldcoin aims for $0.43 rebound by March, anticipating 16% increase after 9.39% drop. Technical signs support short-term recovery.",
            "id": "5dba9306-ff10-4e99-b6ad-50a80855e326",
            "description": "The digital currency Worldcoin (WLD) has displayed promise with a potential 16% increase to reach the $0.43 resistance level, following a recent decline of 9.39%. Technical analyses indicate that oversold conditions may prompt a short-term rebound in its price.",
            "link": "https://www.markets.news/headlines/5dba9306-ff10-4e99-b6ad-50a80855e326",
            "pub_date": "2026-02-28 16:40:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Price of OP expected to reach $0.14 by March 2026, as technical indicators show optimism with RSI at 21.27.",
            "id": "22ad2531-e640-4083-9525-9d4231731054",
            "description": "Indicators suggest strong optimism as they indicate extreme oversold conditions, with the Relative Strength Index (RSI) currently at 21.27. This points towards a potential price recovery target of $0.14 in the coming weeks. The price prediction summary forecasts a short-term target reaching: [...]",
            "link": "https://www.markets.news/headlines/22ad2531-e640-4083-9525-9d4231731054",
            "pub_date": "2026-02-28 16:40:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ARB price set to reach $0.12 by March, short-term target is $0.11, and critical support at $0.08. Bullish breakout expected at $0.12.",
            "id": "e2f2b0ba-20b0-43b3-9aa5-6c4a2f0694d7",
            "description": "The price predictions for ARB are as follows: In the short term (1 week), the target price is $0.11. For the medium term (1 month), the forecasted range is between $0.09 and $0.14. The bullish breakout level is set at $0.12, and the critical support level stands at $0.08.",
            "link": "https://www.markets.news/headlines/e2f2b0ba-20b0-43b3-9aa5-6c4a2f0694d7",
            "pub_date": "2026-02-28 16:40:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "APT price predicted at $1.24 by March 2026 despite bearish trend; short-term target $0.95, breakout at $1.08. Support at $0.79.",
            "id": "62cad81d-1c75-4ea3-84e7-fd11928d6af9",
            "description": "The latest price predictions for APT indicate a short-term target of $0.95 within a week. Looking ahead, the medium-term forecast ranges between $0.91 and $1.24 over the course of a month. For a bullish breakout, investors should keep an eye on the $1.08 mark. On the downside, critical support is seen at $0.79, signaling a point at which the price may face significant resistance. This information provides valuable insights for crypto analysts and investors looking to make informed decisions regarding APT.",
            "link": "https://www.markets.news/headlines/62cad81d-1c75-4ea3-84e7-fd11928d6af9",
            "pub_date": "2026-02-28 16:40:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NEAR Protocol aims for $1.35 rebound by April, trading at $1.06 with RSI at 45.11. Chart analysis hints at recovery in 4-6 weeks with a pivot takeover by bulls.",
            "id": "9ac8a9b2-63e1-4d18-9c37-4ce3a5d2acac",
            "description": "Currently, the NEAR Protocol is trading at $1.06 with a neutral RSI of 45.11. Technical analysis indicates a possible move towards the $1.35 resistance level over the next 4-6 weeks if buyers manage to regain control.",
            "link": "https://www.markets.news/headlines/9ac8a9b2-63e1-4d18-9c37-4ce3a5d2acac",
            "pub_date": "2026-02-28 16:40:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stellar (XLM) aims for $0.18-$0.20 recovery by mid-March 2026, short-term target $0.16-$0.17, bullish breakout at $0.17, critical support at $0...",
            "id": "2b103d52-8677-4529-b2bd-f75f411c9a9b",
            "description": "A prediction summary for XLM's price forecast indicates a short-term target of $0.16-$0.17 within a week. The medium-term forecast over the next month is expected to range between $0.18-$0.20. A bullish breakout is anticipated at $0.17. For critical support, the price is expected to remain above a certain threshold, though the specific value is not provided.",
            "link": "https://www.markets.news/headlines/2b103d52-8677-4529-b2bd-f75f411c9a9b",
            "pub_date": "2026-02-28 16:40:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}