{
    "data": [
        {
            "title": "Ripple deploys $550M to XRPL since 2017, shifting to distributed funding model in 2026, supporting 200 projects globally.",
            "id": "00940bd8-5988-4eb5-8f07-d1897579f352",
            "description": "Ripple has invested over $550 million in the XRP Ledger ecosystem since 2017, supporting nearly 200 projects worldwide in areas like payments, DeFi, tokenization, AI, and enterprise applications. The company is shifting its funding model in 2026, moving towards distributed funding with programs like the FinTech Builder Program. This program provides support for startups developing financial applications such as stablecoin payments and credit infrastructure, offering structured support from product design to market launch. Ripple's new approach includes partnerships with accelerators and a focus on independent organizations and regional hubs to support builders.",
            "link": "https://www.markets.news/headlines/00940bd8-5988-4eb5-8f07-d1897579f352",
            "pub_date": "2026-02-27 03:28:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin price drops to $67,681.84, while Ethereum, XRP, Dogecoin fall by 2%. $415.80 million losses from 148,693 liquidated traders.",
            "id": "0677f990-9fc9-43a0-8632-a379795cd6c9",
            "description": "Bitcoin dropped below $68,000 on Thursday, reversing its two-day upward trend as money moved away from alternative and meme cryptocurrencies in a broader risk-off market sentiment. The latest prices for cryptocurrencies are as follows: Bitcoin (BTC) at $67,681.84, Ethereum (ETH) at $2,022.21, Solana (SOL) at $86.00, XRP at $1.39, Dogecoin (DOGE) at $0.09692, and Shiba Inu (SHIB) at $0.005980. According to Coinglass data, 148,693 traders were liquidated in the last 24 hours, totaling $415.80 million in losses. SoSoValue data indicates that spot Bitcoin ETFs had net inflows of $506.5 million on Wednesday, while spot Ethereum ETFs saw net inflows of $157.1 million. For further details, the complete article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/0677f990-9fc9-43a0-8632-a379795cd6c9",
            "pub_date": "2026-02-27 03:28:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1f4a5c65-4c03-425f-9aeb-86f509f10d0d",
            "description": "STATE DEPT SAYS IT APPROVES POTENTIAL SALE OF KU BAND MULTI-FUNCTION RADIO FREQUENCY SYSTEM (KUMRFS) RADARS TO JORDAN FOR $280 MILLION",
            "link": "https://www.markets.news/headlines/1f4a5c65-4c03-425f-9aeb-86f509f10d0d",
            "pub_date": "2026-02-27 03:28:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a77422f9-cb59-4c8f-920a-a86eda54fcb7",
            "description": "IRAN'S ARAQCHI: TECHNICAL TALKS WILL START IN VIENNA FROM MONDAY",
            "link": "https://www.markets.news/headlines/a77422f9-cb59-4c8f-920a-a86eda54fcb7",
            "pub_date": "2026-02-27 03:28:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ERI offers zero waste, zero emissions ITAD solutions in Indiana with 8 recycling facilities. ISO 27001, SOC 2 Type II certified.",
            "id": "7f039d76-af1a-4e86-8edd-185896b70931",
            "description": "ERI, a top provider in material resource recovery, ITAD, mobility, and data destruction, is also the largest electronics recycler in the U.S. They operate eight e-waste recycling facilities that are zero waste, zero emissions, and carbon-neutral. Among these facilities is their advanced flagship location in Plainfield, Indiana. ERI has been offering electronic waste circularity services in Indiana since 2008. The company adheres to ISO 27001, SOC 2 Type II, and NAI standards for data security and processing.",
            "link": "https://www.markets.news/headlines/7f039d76-af1a-4e86-8edd-185896b70931",
            "pub_date": "2026-02-27 03:28:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "337a6833-52df-4863-bec5-5f18bf53d85e",
            "description": "Iran's Araghchi: Discussed US sanctions and UN Security Council.",
            "link": "https://www.markets.news/headlines/337a6833-52df-4863-bec5-5f18bf53d85e",
            "pub_date": "2026-02-27 03:29:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Info-Tech Research Group warns of construction inefficiency due to poor CMS selection, stressing need for disciplined processes.",
            "id": "3c51bc1d-0a43-4038-9457-a12742dc9ef7",
            "description": "The process of selecting and implementing a Construction Management System (CMS) necessitates meticulous requirements mapping, governance alignment, and a methodical evaluation of vendors to avoid operational instability and the automation of inefficient workflows. Recent findings from Info-Tech Research Group shed light on the importance of these steps.",
            "link": "https://www.markets.news/headlines/3c51bc1d-0a43-4038-9457-a12742dc9ef7",
            "pub_date": "2026-02-27 03:30:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Phillips to showcase Alice Baber: Sacred Spaces exhibition in New York from March 6-26, 2026 in collaboration with Jody Klotz Fine Art.",
            "id": "401611a9-8975-4699-a788-3bb5dd907262",
            "description": "PhillipsX has unveiled \"Alice Baber: Sacred Spaces,\" a noteworthy selling exhibition honoring the American Abstract Expressionist. This event is in collaboration with Jody Klotz Fine Art and will be showcased at Phillips New York from March 6th to March 26th, 2026. The exhibit celebrates the work of Alice Baber, featuring a collection of her pioneering artworks.",
            "link": "https://www.markets.news/headlines/401611a9-8975-4699-a788-3bb5dd907262",
            "pub_date": "2026-02-27 03:30:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b813eb62-fc80-4c46-a9ba-29ac9b0507be",
            "description": "IRAN'S ARAQCHI: BOTH SIDES NEED TO CONSULT WITH THEIR RESPECTIVE CAPITALS",
            "link": "https://www.markets.news/headlines/b813eb62-fc80-4c46-a9ba-29ac9b0507be",
            "pub_date": "2026-02-27 03:30:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock market down as Nvidia falls after earnings, software stocks bounce post-AI news. Dow in red today.",
            "id": "ab201b17-3080-4401-965a-94b9e82b949c",
            "description": "On Thursday, stock indexes reversed course, with Nvidia stock retracting after an initial surge following earnings. The Dow was in negative territory as Nvidia saw a decline. Software stocks experienced a rebound after a boost from artificial intelligence developments. The market fluctuation reflected a dynamic trading day with notable movements in key indices.",
            "link": "https://www.markets.news/headlines/ab201b17-3080-4401-965a-94b9e82b949c",
            "pub_date": "2026-02-27 03:31:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novavax reports Q4 earnings of 11 cents per share, a shift from a loss of 51 cents last year, with revenue of $147 million, up by 67%. Moving forward, the company plans to reduce expenses with targets set at $325 million in 2026, $225 million in 2027, and $200 million in 2028. Management is optimistic about their progress and achievements in 2025.",
            "id": "1b5c6e5b-b917-4ace-964b-8f5008918991",
            "description": "Novavax Inc. (NASDAQ: NVAX) shares rose on Thursday after revealing its fourth-quarter and full-year 2025 financial results. The company reported fourth-quarter earnings of 11 cents per share, a notable improvement from a loss of 51 cents in the same period last year. Revenue for the quarter reached $147 million, reflecting a substantial 67% year-over-year increase. Novavax surpassed its 2025 cost-cutting targets in both GAAP and Non-GAAP R&D and SG&A spending and is now adjusting future expense goals. It anticipates Non-GAAP R&D and SG&A expenses of $325 million in 2026, $225 million in 2027, and $200 million or less in 2028 (a newly introduced target). The company's management highlighted progress made in 2025, including key milestones achieved under its Sanofi agreement and the signing of multiple MTAs with other parties to explore its Matrix-M adjuvant technology. For more details, access the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1b5c6e5b-b917-4ace-964b-8f5008918991",
            "pub_date": "2026-02-27 03:22:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nano Banana 2 by Google overtakes as AI imaging champ, trumping with rapid world info processing. Seedream 5 by ByteDance challenges for the throne.",
            "id": "24270d93-f6e5-4e69-b7e4-aee0a42cf4da",
            "description": "Nano Banana 2 offers advanced global insights quickly, boasting exceptional text management and thematic coherence. However, Seedream 5 by ByteDance has entered the same arena with robust competition.",
            "link": "https://www.markets.news/headlines/24270d93-f6e5-4e69-b7e4-aee0a42cf4da",
            "pub_date": "2026-02-27 03:23:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dd72df19-55fa-41ca-a50f-36e1f7b5a88b",
            "description": "Taliban spox: ‘Along the so-called Durand Line, heavy retaliatory offensive operations have been launched against the enemy by the Islamic Emirate of Afghanistan through the 203 Mansouri Corps and the 201 Khalid bin Walid Corps at various points in the provinces of Paktia,",
            "link": "https://www.markets.news/headlines/dd72df19-55fa-41ca-a50f-36e1f7b5a88b",
            "pub_date": "2026-02-27 03:23:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e51e387-e240-488d-ab4e-449a5f3d07a2",
            "description": "IDF Spokesperson: Earlier today (Thursday), combat team forces of the 'Iron Fist' Brigade (205) operating in the northern Gaza Strip identified several terrorists in the yellow line area who approached the forces in a manner that posed an immediate threat to them. Immediately",
            "link": "https://www.markets.news/headlines/8e51e387-e240-488d-ab4e-449a5f3d07a2",
            "pub_date": "2026-02-27 03:23:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lubrizol introduces LED chlorination tech in CPVC manufacturing, boosting resin quality and efficiency in Kentucky plant.",
            "id": "559e0aa5-e8e0-4e55-8c42-5e1579e74396",
            "description": "In a recent announcement, Lubrizol unveiled a significant development in its CPVC manufacturing by implementing LED reactor technology at its facility in Louisville, Kentucky. This cutting-edge manufacturing method marks a substantial enhancement in CPVC resin quality and processing efficiency. Through this innovation, Lubrizol enhances its position as a leader in technical resin production and gains increased operational versatility to respond to global market needs. The integration of LED reactor technology addresses a key performance factor of CPVC resin, thermal stability, and is poised to elevate production standards.",
            "link": "https://www.markets.news/headlines/559e0aa5-e8e0-4e55-8c42-5e1579e74396",
            "pub_date": "2026-02-27 03:13:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Glenfarne and TotalEnergies sign agreement for 2 MTPA LNG off Alaska LNG project.",
            "id": "32858cc8-ca20-4a3e-858e-b2b4c7c07642",
            "description": "In Washington, Glenfarne, the primary owner and developer of the Alaska LNG project, has partnered with TotalEnergies to secure an offtake agreement for the purchase of 2 million metric tons per annum (MTPA) of liquefied natural gas (LNG) from the Alaska LNG project.",
            "link": "https://www.markets.news/headlines/32858cc8-ca20-4a3e-858e-b2b4c7c07642",
            "pub_date": "2026-02-27 03:13:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Peoples Ltd. (OTC: PPLL) declares $0.34 per share first quarter dividend, payable on March 31, 2026.",
            "id": "fbc45bdd-ffed-4c30-9387-6353a1d4234c",
            "description": "In Wyalusing, Pennsylvania on February 26, 2026, Peoples Ltd. (OTC: PPLL) disclosed that their President and CEO, Anthony J. Gabello, revealed that the Board of Directors has sanctioned a cash dividend of $0.34 per share for the first quarter. This dividend is scheduled to be paid out on March 31, 2026.",
            "link": "https://www.markets.news/headlines/fbc45bdd-ffed-4c30-9387-6353a1d4234c",
            "pub_date": "2026-02-27 03:14:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3a0d5435-0854-4718-8c26-4a8bd3f8666b",
            "description": "UKRAINE'S ZELENSKIY SAYS NEXT TRILATERAL TALKS WILL LIKELY TAKE PLACE IN ABU DHABI IN EARLY MARCH",
            "link": "https://www.markets.news/headlines/3a0d5435-0854-4718-8c26-4a8bd3f8666b",
            "pub_date": "2026-02-27 03:14:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Socure named in Forbes Fintech 50 for 2nd time in 2026, leading identity and risk provider for digital economy.",
            "id": "ef33b88b-d61d-488f-9458-7ab7dc7748b9",
            "description": "Socure, a leading identity and risk platform in the AI realm, has been recognized on the 2026 Forbes Fintech 50 list. This marks the company’s second time on the esteemed list, showcasing its prominence as a provider of identity and risk infrastructure for the digital economy. The Forbes Fintech 50, now in its 11th year, highlights private fintech entities that exhibit robust revenue growth, product innovation, and overall market impact. This acknowledgment underscores Socure's continued success and importance in the industry.",
            "link": "https://www.markets.news/headlines/ef33b88b-d61d-488f-9458-7ab7dc7748b9",
            "pub_date": "2026-02-27 03:15:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Higginbotham partners with Monarch Solutions Inc. to enhance services for high-net-worth clients.",
            "id": "051dfa99-2605-4c6d-a281-88dd9a2ee5aa",
            "description": "Monarch has joined forces with Higginbotham, an employee-owned insurance and financial services firm based in Texas. The collaboration, effective as of February 26, 2026, brings specialized capabilities to Higginbotham while providing access to resources for both clients and the team. The partnership aims to combine their expertise to better serve their customers.",
            "link": "https://www.markets.news/headlines/051dfa99-2605-4c6d-a281-88dd9a2ee5aa",
            "pub_date": "2026-02-27 03:16:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}