{
    "data": [
        {
            "title": "Correction sent regarding Iceland Seafood International hf's financial statements submission on 26.02.2026.",
            "id": "83263592-c47e-4d0f-89b4-784505134d34",
            "description": "On February 26, 2026, a company announced that it had submitted its financial statements. The announcement was made after the company finalized its financial reports for the fiscal year. The financial statements include important figures such as revenue, expenses, profits, and other relevant financial data. The submission of these statements is a standard practice for companies to provide transparency and accountability to stakeholders, investors, and regulatory bodies. This process ensures that the company's financial performance is accurately documented and reported. The detailed financial information within the statements allows for analysis of the company's financial health and performance over the specified period.",
            "link": "https://www.markets.news/headlines/83263592-c47e-4d0f-89b4-784505134d34",
            "pub_date": "2026-02-27 22:37:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "af8a1def-b326-467b-b923-c724d4c82c6f",
            "description": "UNITED STATES SEEKS FORFEITURE OF OIL TANKER AND 1.8M BARRELS OF CRUDE OIL -THAT SUPPORTED IRAN AND VENEZUELA -JUSTICE DEPARTMENT",
            "link": "https://www.markets.news/headlines/af8a1def-b326-467b-b923-c724d4c82c6f",
            "pub_date": "2026-02-27 22:38:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "da180cf4-8ff1-4e81-96d1-3544c4fa9ea4",
            "description": "IMF'S DEPUTY UKRAINE MISSION CHIEF: MONITORING SITUATION REGARDING UKRAINE'S BONDHOLDERS CLOSELY",
            "link": "https://www.markets.news/headlines/da180cf4-8ff1-4e81-96d1-3544c4fa9ea4",
            "pub_date": "2026-02-27 22:38:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hunt Military Communities invest $3.65M in upgrades at Robins AFB, emphasizing housing quality and readiness.",
            "id": "72ed29f6-6bec-4c8e-b89c-9d0947027588",
            "description": "Warner Robins, Georgia - Hunt Military Communities (HMC) has revealed a $3.65 million capital improvement initiative at Robins Air Force Base. The project emphasizes HMC's dedication to enhancing housing quality and long-term readiness through strategic reinvestment. This investment will concentrate on essential infrastructure enhancements in the Turner Park and Crestview neighborhoods. It highlights the commitment of both the Air Force and HMC to proactive capital planning and responsiveness.",
            "link": "https://www.markets.news/headlines/72ed29f6-6bec-4c8e-b89c-9d0947027588",
            "pub_date": "2026-02-27 22:39:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6d40619f-6a51-439d-897e-7fee2836b4e8",
            "description": "Maersk has seen unforeseen constraints in the Red Sea.",
            "link": "https://www.markets.news/headlines/6d40619f-6a51-439d-897e-7fee2836b4e8",
            "pub_date": "2026-02-27 22:39:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "National Police Association supports ICE Protection Act amidst rising incidents of protestors using vehicles as weapons against officers.",
            "id": "5e4fcb8d-4890-4be6-ace7-9877939017c6",
            "description": "In Indianapolis as of February 27, 2026, the Department of Homeland Security has revealed that demonstrators opposing Immigration and Customs Enforcement (ICE) have increasingly resorted to using their vehicles as dangerous weapons to target officers. The alarming trend includes incidents of officers being deliberately rammed, dragged, and trapped. The DHS has documented a significant rise in the number of these incidents, highlighting a concerning pattern of aggression towards law enforcement.",
            "link": "https://www.markets.news/headlines/5e4fcb8d-4890-4be6-ace7-9877939017c6",
            "pub_date": "2026-02-27 22:40:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8dc1a878-f9d9-4bee-b492-13851f459b75",
            "description": "UK FINANCE MINISTER REEVES WILL APPROVE DEAL TO BUY 23 HELICOPTERS FROM ITALY'S LEONARDO - REPORTS",
            "link": "https://www.markets.news/headlines/8dc1a878-f9d9-4bee-b492-13851f459b75",
            "pub_date": "2026-02-27 22:41:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "71cd422d-b437-481c-bd94-fdd7c40d4706",
            "description": "Israel's COGAT: 'Tomorrow, on 28/02/2026, it will be 60 days since MSF and other organizations who refused to comply with the registration process received notice to cease operations in Gaza. The registration process is a transparent and basic process designed to ensure Hamas",
            "link": "https://www.markets.news/headlines/71cd422d-b437-481c-bd94-fdd7c40d4706",
            "pub_date": "2026-02-27 22:31:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "98302a66-21bf-4313-81b5-26bae3a4558b",
            "description": "Pakistan bombed Taliban government forces in Afghanistan's major cities overnight, the first time it has directly targeted its former allies, and described the situation as \"open war\", raising tensions in a volatile, nuclear-armed region. The Pakistani strikes hit the capital",
            "link": "https://www.markets.news/headlines/98302a66-21bf-4313-81b5-26bae3a4558b",
            "pub_date": "2026-02-27 22:31:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7425a69b-a93f-42ff-b3ca-f7b5fe3f7f8d",
            "description": "U.S. STOCKS EXTEND FALL, NASDAQ DOWN 1.22%",
            "link": "https://www.markets.news/headlines/7425a69b-a93f-42ff-b3ca-f7b5fe3f7f8d",
            "pub_date": "2026-02-27 22:31:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brookfield Renewable has completed its 2025 annual filings, including audited financial statements for the year ended December 31, 2025.",
            "id": "a37ba034-d2cb-480a-8fb5-3179080ee4f9",
            "description": "On February 27, 2026, Brookfield Renewable disclosed the submission of its 2025 annual reports and audited financial statements for the period ending December 31, 2025. The documents were filed on Forms 20-F through the SEC on EDGAR and with Canadian securities regulatory bodies on SEDAR. Brookfield Renewable is listed on NYSE under the tickers BEP and BEPC, as well as on TSX under BEP.UN and BEPC.",
            "link": "https://www.markets.news/headlines/a37ba034-d2cb-480a-8fb5-3179080ee4f9",
            "pub_date": "2026-02-27 22:32:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LHV Group purchased its own shares on Nasdaq Tallinn Stock Exchange between 20th and 26th Feb 2026.",
            "id": "93857eff-8c96-47e4-a172-b403b3f4928d",
            "description": "LHV Group has revealed its recent acquisition of its own shares on the Nasdaq Tallinn Stock Exchange from 20th to 26th February 2026. The specific details of the share acquisition were announced by the company.",
            "link": "https://www.markets.news/headlines/93857eff-8c96-47e4-a172-b403b3f4928d",
            "pub_date": "2026-02-27 22:32:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "52966747-f887-4d51-992c-c49899e7b3a1",
            "description": "UK GOVERNMENT: UK STAFF HAVE BEEN TEMPORARILY WITHDRAWN FROM IRAN",
            "link": "https://www.markets.news/headlines/52966747-f887-4d51-992c-c49899e7b3a1",
            "pub_date": "2026-02-27 22:32:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "00451a21-8d82-41d6-827d-0bd7e672cd6c",
            "description": "MOO Imbalance S&P 500: -303 mln Nasdaq 100: -9 mln Dow 30: -12 mln Mag 7: -3 mln",
            "link": "https://www.markets.news/headlines/00451a21-8d82-41d6-827d-0bd7e672cd6c",
            "pub_date": "2026-02-27 22:32:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fa7542e3-f70e-4441-b7f4-8b0cfc4c0ade",
            "description": "DOW JONES DOWN 475.73 POINTS, OR 0.96 %, AT 49,023.47 AFTER MARKET OPEN NASDAQ DOWN 279.69 POINTS, OR 1.22 PERCENT, AT 22,598.70 AFTER MARKET OPEN S&P 500 DOWN 60.45 POINTS, OR 0.87 PERCENT, AT 6,848.41 AFTER MARKET OPEN",
            "link": "https://www.markets.news/headlines/fa7542e3-f70e-4441-b7f4-8b0cfc4c0ade",
            "pub_date": "2026-02-27 22:32:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xiaomi is back on top in wearable band market in 2025 with 18% share, followed by Apple with 17% and Huawei with 16%.",
            "id": "d85237d0-8177-48f8-b24b-51fcbe7fdfe7",
            "description": "In 2025, global shipments of wearable devices surpassed 200 million units, marking a 6% increase from the previous year as reported by Omdia. Xiaomi regained the leading position, holding an 18% market share and becoming the largest wearable vendor by annual shipments, a title it last held in 2020. Apple closely followed in second place with 17%, while Huawei secured the third spot with 16%. The market is witnessing a trend of consolidation, with the top five vendors, including Samsung (9%) and Garmin, dominating the industry.",
            "link": "https://www.markets.news/headlines/d85237d0-8177-48f8-b24b-51fcbe7fdfe7",
            "pub_date": "2026-02-27 22:33:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frontline (FRO) beats Q4 earnings estimates by 0.98% with EPS of $1.03, revenue up $198.86 million from last year.",
            "id": "8a37c0ff-4180-4a68-8a53-cbb45cd39762",
            "description": "Frontline, traded on NYSE under the symbol FRO, released its Q4 earnings report on Friday, February 27, 2026, at 02:00 AM. The company exceeded estimated earnings by 0.98%, with an EPS of $1.03 compared to the expected $1.02. Revenue saw a significant increase of $198.86 million compared to the previous year. In the last quarter, Frontline did not meet the earnings expectations. For more details, the complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/8a37c0ff-4180-4a68-8a53-cbb45cd39762",
            "pub_date": "2026-02-27 22:34:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3ce8992d-7f6b-4c55-81dd-bb4bca8839c4",
            "description": "Lebanon military: 'Within the framework of combating drug trafficking in various Lebanese regions, and following precise surveillance and monitoring operations, a patrol from the Directorate of Intelligence managed to seize a mobile laboratory inside a van equipped for",
            "link": "https://www.markets.news/headlines/3ce8992d-7f6b-4c55-81dd-bb4bca8839c4",
            "pub_date": "2026-02-27 22:26:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JBT Marel completed a major renovation of its Customer Innovation Center in Lakeland, Florida, becoming the premier destination for sustainable food tech.",
            "id": "055cff36-d492-402d-9f02-03e1407871dc",
            "description": "In Lakeland, Florida, JBT Marel, a leading provider of advanced automation solutions for the food and beverage sector, has revealed its updated Customer Innovation Center. The revamped facility serves as the company's main customer hub for sustainable food technology, covering the entire production process from fresh produce to ready-to-eat meals, beverages, and dairy products. With numerous CIC locations globally, JBT Marel's facilities offer customers the opportunity to collaborate closely with specialists.",
            "link": "https://www.markets.news/headlines/055cff36-d492-402d-9f02-03e1407871dc",
            "pub_date": "2026-02-27 22:29:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ethereum Foundation introduces Project Odin for sustainable funding, embedding advisors with key teams like Vyper. Initial cohort already underway.",
            "id": "2e1caa39-e18e-49b8-b031-38b73276be45",
            "description": "A 12-month program by EF involves embedding advisors within critical infrastructure teams such as Vyper to establish sustainable funding methods beyond grants. The inaugural cohort of this program is currently in progress.",
            "link": "https://www.markets.news/headlines/2e1caa39-e18e-49b8-b031-38b73276be45",
            "pub_date": "2026-02-27 22:30:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}