{
    "data": [
        {
            "title": "",
            "id": "32f78135-7067-4608-b294-67914784ecd3",
            "description": "2025's second half and full-year report show promising growth with revenue up by 15% to $500 million.",
            "link": "https://www.markets.news/headlines/32f78135-7067-4608-b294-67914784ecd3",
            "pub_date": "2026-02-28 03:15:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. economy grew modestly at end of 2025, with GDP expanding at 1.4% annual rate in Q4 due to government shutdown.",
            "id": "c2341eba-df00-482b-8582-41541bb53eef",
            "description": "The national economy experienced a 1.4% growth rate in the final quarter of the year, primarily influenced by the ramifications of the government shutdown.",
            "link": "https://www.markets.news/headlines/c2341eba-df00-482b-8582-41541bb53eef",
            "pub_date": "2026-02-28 03:15:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In 2025, goods trade deficit hit all-time high, despite overall trade deficit narrowing due to increased services surplus.",
            "id": "5f1f265c-981e-47cd-8f0e-c807bf3e0463",
            "description": "On Thursday, the Census Bureau revealed that the total trade deficit with the world decreased due to a growing trade surplus in services. However, the trade deficit in goods reached a record high. The data indicates a significant shift in trade dynamics, with the goods deficit standing out as particularly noteworthy.",
            "link": "https://www.markets.news/headlines/5f1f265c-981e-47cd-8f0e-c807bf3e0463",
            "pub_date": "2026-02-28 03:15:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "W&T Offshore (NYSE: WTI) to release Q4 and full year 2025 earnings, with conference call on Feb 27, 2026 in Houston.",
            "id": "0dbb047a-8c04-4e31-9bdf-5b2f64bb0198",
            "description": "Houston-based company W&T Offshore, Inc. (NYSE: WTI) has disclosed the schedule for its earnings release and conference call for the fourth quarter and full year of 2025. The announcement was made today, on February 27, 2026. This update provides investors and stakeholders with important financial information about the company's performance during that period. Shareholders and interested parties are encouraged to participate in the conference call to gain insights into the earnings report.",
            "link": "https://www.markets.news/headlines/0dbb047a-8c04-4e31-9bdf-5b2f64bb0198",
            "pub_date": "2026-02-28 03:15:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump considers forming a trade pact with Mexico, excluding Canada. It may bring significant changes. (Character count: 95)",
            "id": "7f18b9b0-9ad4-4781-a9a4-8e5757776fc1",
            "description": "American authorities are considering significant alterations to a trade deal involving Mexico and Canada that could revolutionize business practices and potentially isolate Canada from the agreement.",
            "link": "https://www.markets.news/headlines/7f18b9b0-9ad4-4781-a9a4-8e5757776fc1",
            "pub_date": "2026-02-28 03:15:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federal Reserve may continue to hold rates steady amid strong labor market and inflation. No rush to restart rate cuts.",
            "id": "89c678e9-6f20-40fd-992f-0df7aebff875",
            "description": "Unless there is a sharp decline in the labor market or a notable decrease in inflation, it seems likely that the Federal Reserve will maintain its current position for an extended period.",
            "link": "https://www.markets.news/headlines/89c678e9-6f20-40fd-992f-0df7aebff875",
            "pub_date": "2026-02-28 03:15:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Presurance Holdings closed its rights offering as detailed in Form 8-K on Jan 28, 2026. ",
            "id": "fb7a0275-6e48-4054-98bf-752731b7250c",
            "description": "TROY, Michigan - On February 27, 2026, Presurance Holdings, Inc. (Nasdaq: PRHI) concluded its rights offering as mentioned in the Current Report on Form 8-K filed on January 28, 2026. The offering saw significant participation from investors, showcasing a strong interest in the company's future prospects.",
            "link": "https://www.markets.news/headlines/fb7a0275-6e48-4054-98bf-752731b7250c",
            "pub_date": "2026-02-28 03:15:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jamieson Greer, a discreet lawyer, is reshaping global economy at president's request.",
            "id": "54efc1e5-fbf9-4e00-baa6-39e3798adb96",
            "description": "Jamieson Greer, a humble lawyer from a modest upbringing, has been tasked by the president to reshape the dynamics of the worldwide economy.",
            "link": "https://www.markets.news/headlines/54efc1e5-fbf9-4e00-baa6-39e3798adb96",
            "pub_date": "2026-02-28 03:15:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "00de6701-0ac6-4807-ae49-84af7d5f4954",
            "description": "Company buyback: Purchased 10,000 shares for $100,000.",
            "link": "https://www.markets.news/headlines/00de6701-0ac6-4807-ae49-84af7d5f4954",
            "pub_date": "2026-02-28 03:15:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e0589b0-95c7-4325-894d-1b279c84f59a",
            "description": "TRUMP ON IRAN: NOT HAPPY WITH THE WAY THEY'VE BEEN",
            "link": "https://www.markets.news/headlines/8e0589b0-95c7-4325-894d-1b279c84f59a",
            "pub_date": "2026-02-28 03:15:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mobile Infrastructure (AMEX: BEEP) to report quarterly earnings with estimated EPS of $-0.11 on 2026-03-02. Negative trend in stock performance with shares at $3.02, down 15.95% in 52 weeks. Guidance key for stock movement, not just beating estimates.",
            "id": "d5913198-9d3a-4c0a-b5d1-1ffa00622ee3",
            "description": "Mobile Infrastructure (AMEX: BEEP) is set to report its quarterly earnings on March 2, 2026. Analysts predict an EPS of $-0.11, with hopes for positive guidance for future growth. In the previous quarter, the company missed EPS by $0.06, resulting in a 0.31% share price drop. As of February 26, shares were at $3.02, down 15.95% over the last 52 weeks. Shareholders are mostly bearish leading up to the earnings release. Mobile Infrastructure focuses on acquiring and owning mobile infrastructure assets. For more details, the full story is available on Benzinga.com",
            "link": "https://www.markets.news/headlines/d5913198-9d3a-4c0a-b5d1-1ffa00622ee3",
            "pub_date": "2026-02-28 03:05:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Compugen's earnings report on 3/2 expected EPS $0.10. Strong historical performance saw 2.99% stock increase last quarter. Trading at $1.79, shares up 1.38% over last 52 weeks. Investors eagerly await report.",
            "id": "fcef53dd-32cc-4022-b8d8-100f10738ff6",
            "description": "Biotech company Compugen (NASDAQ: CGEN) is scheduled to release its quarterly earnings results on Monday, March 2, 2026. Analysts are anticipating an earnings per share (EPS) of $0.10. Investors are eagerly awaiting the announcement, hoping for results that exceed expectations and positive guidance for the upcoming quarter. It is important to highlight that guidance provided can heavily impact stock price movements, especially for new investors. Compugen outperformed expectations by $0.02 in the last quarter, resulting in a 2.99% increase in share price the following day. Here's a breakdown of Compugen's recent earnings performances and the subsequent stock price changes: Q3 2025: Estimated EPS -0.09, Actual EPS -0.07, Price Change 2.99%; Q2 2025: Estimated EPS -0.08, Actual EPS -0.08, Price Change -1.37%; Q1 2025: Estimated EPS -0.05, Actual EPS -0.08, Price Change 1.44%; Q4 2024: Estimated EPS 0.07, Actual EPS -0.07, Price Change 7.74%. As of February 26, Compugen shares were trading at $1.79, marking a 1.38% increase over the past 52 weeks. Investors can access the full story on Benzinga.com for more insights.",
            "link": "https://www.markets.news/headlines/fcef53dd-32cc-4022-b8d8-100f10738ff6",
            "pub_date": "2026-02-28 03:05:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gaia to report quarterly earnings on 2026-03-02. Analysts estimate EPS of $-0.01. Past missed EPS led to share price drop. Stock at $3.36.",
            "id": "2edb3d18-74b3-42fe-8235-3362df78b9b1",
            "description": "Gaia (NASDAQ: GAIA) is scheduled to release its latest quarterly earnings report on Monday, March 2, 2026. Analysts are expecting the company to report an earnings per share (EPS) of -$0.01. Investors are eagerly awaiting the announcement, hoping for results that exceed expectations and positive guidance for the following quarter. It's important to highlight that guidance can significantly impact stock price movement, especially for new investors. Looking back at Gaia's previous performance, in the last quarter, the company missed its EPS estimate by $0.00, resulting in an 8.71% decrease in the share price the following day. In the third quarter of 2025, the EPS estimate was -$0.05, and the actual figure reported was also -$0.05, leading to an 8.71% price decrease. In the second quarter of 2025, the EPS estimate was -$0.08, with the actual reported EPS at -$0.07, causing a 16.21% price increase. In the first quarter of 2025, the EPS estimate was -$0.03, and the company reported an EPS of -$0.04, resulting in a 10.32% decrease in price. In the fourth quarter of 2024, both the estimate and actual EPS were -$0.03, resulting in no price change. As of February 26, Gaia shares were trading at $3.36. Over the past 52 weeks, the shares have experienced a decline. Investors can find more details on this news at Benzinga.com.",
            "link": "https://www.markets.news/headlines/2edb3d18-74b3-42fe-8235-3362df78b9b1",
            "pub_date": "2026-02-28 03:05:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRC to release earnings report on March 2, with anticipated EPS of $0.01. Past performance shows a 7.04% price drop on EPS beat. Shares trading at $0.6404, down 75.49% over last 52 weeks. Investors eager for positive guidance.",
            "id": "254b70c2-c212-4b6d-a450-4e8563eedbc0",
            "description": "BRC (NYSE: BRCC) is set to release its quarterly earnings report on March 2, 2026. Analysts predict an earnings per share (EPS) of $0.01. In the previous quarter, BRC beat EPS estimates by $0.01, resulting in a 7.04% drop in share price the following day. The stock was trading at $0.6404 as of February 26, with shares down 75.49% over the last 52 weeks. Investors are eager for positive news and guidance from the company to potentially influence stock prices. Stock performance has been consistently negative, making long-term shareholders likely bearish ahead of the earnings release.",
            "link": "https://www.markets.news/headlines/254b70c2-c212-4b6d-a450-4e8563eedbc0",
            "pub_date": "2026-02-28 03:05:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kaltra introduces new technology to boost microchannel evaporator performance in cooling systems, making it more efficient.",
            "id": "891b8734-91b7-4e8d-ad0c-f204c6761e81",
            "description": "In ALTMUNSTER, Austria on February 27, 2026, Kaltra revealed a groundbreaking refrigerant distribution technology that enhances the efficiency of microchannel evaporators. These evaporators are vital components in contemporary cooling and heat pump systems. This innovation is set to revolutionize the industry by optimizing the performance of these systems.",
            "link": "https://www.markets.news/headlines/891b8734-91b7-4e8d-ad0c-f204c6761e81",
            "pub_date": "2026-02-28 03:05:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VICTOR Pet Food advises dog owners on essential protein requirements for pet food; Focus on quality.",
            "id": "942cdd28-b432-44ed-b952-203519065c1a",
            "description": "To commemorate National Protein Day, VICTOR Pet Food from MOUNT PLEASANT, Texas, released a guide on essential protein considerations for dog owners when purchasing their next pet food bag. The aim is to emphasize the significance of high-quality protein in pet nutrition. This initiative was launched on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/942cdd28-b432-44ed-b952-203519065c1a",
            "pub_date": "2026-02-28 03:05:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart settles lawsuit for $100M, gains market share, stock rises. Analyst reinstates Buy rating, sets price target at $150.",
            "id": "6e485c62-ba1d-45c2-8ccc-d8b2a0fa7af9",
            "description": "Shares of Walmart Inc. (NASDAQ: WMT) are experiencing an increase in trading value, following the disclosure that the company has settled a lawsuit by paying $100 million. The lawsuit alleged that Walmart had mislead its delivery drivers regarding their compensation, leading to significant income losses for them. The positive movement in Walmart stock is attributed to BofA Securities analyst Christopher Nardone reinstating a Buy rating on the stock and setting a price target of $150. Nardone's analysis highlighted the company's... (Full story can be found on Benzinga.com)",
            "link": "https://www.markets.news/headlines/6e485c62-ba1d-45c2-8ccc-d8b2a0fa7af9",
            "pub_date": "2026-02-28 03:06:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSC excelled in event security and crowd management at Super Bowl LX in Santa Clara, largest sporting event.",
            "id": "139057fa-0201-4050-8a0d-694fa46b0961",
            "description": "In Santa Clara, California on February 27, 2026, Contemporary Services Corporation (CSC) effectively provided event security and crowd management services for Super Bowl LX. CSC's operations supported the renowned sporting event, known as one of the largest and most intricate globally, with their extensive expertise.",
            "link": "https://www.markets.news/headlines/139057fa-0201-4050-8a0d-694fa46b0961",
            "pub_date": "2026-02-28 03:09:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Geographic Solutions wins top prize at DaVinci Awards for innovative reentry system; earned three-star rating.",
            "id": "f15dbef3-8f42-4801-b03a-1f1073f635a1",
            "description": "A company based in Palm Harbor, Florida, named Geographic Solutions, has recently gained recognition for its innovative reentry employment system. The system has earned a three-star rating in The DaVinci Awards® judging. A leading provider of workforce development software in the nation, Geographic Solutions has been acknowledged for its exceptional contributions in this field. The announcement was made on February 27, 2026, showcasing the company's commitment to excellence and creativity in supporting individuals reentering the workforce.",
            "link": "https://www.markets.news/headlines/f15dbef3-8f42-4801-b03a-1f1073f635a1",
            "pub_date": "2026-02-28 03:09:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Perezdiaz, LLC is among fewer than 100 authorized assessment bodies for CMMC, serving 80,000+ defense contractors.",
            "id": "56a55ed7-a8b8-4886-a741-b247e0cf84b9",
            "description": "A company, approved by The Cyber AB on February 24, 2026, has been granted authorization to conduct official CMMC Level 2 certification assessments as per 32 CFR Part 170 in the DALLAS-FORT WORTH METROPLEX, Texas. Perezdiaz Federal, the assessment arm of Perezdiaz, LLC, made this announcement on February 27, 2026.",
            "link": "https://www.markets.news/headlines/56a55ed7-a8b8-4886-a741-b247e0cf84b9",
            "pub_date": "2026-02-28 02:59:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}