{
    "data": [
        {
            "title": "Codere Online posts record net gaming revenue of €224.1 million and Adj. EBITDA of €13.8 million for FY 2025.",
            "id": "e2d979b0-6ee7-4c83-95a9-e72dd90994cd",
            "description": "The Company achieved impressive results, generating a record net gaming revenue of €224.1 million and posting an Adjusted EBITDA of €13.8 million for the fiscal year 2025.",
            "link": "https://www.markets.news/headlines/e2d979b0-6ee7-4c83-95a9-e72dd90994cd",
            "pub_date": "2026-02-26 20:46:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Matador Resources offers $500 million cash to buy back 6.875% Senior Notes Due 2028, using $750 million New Notes for funding.",
            "id": "bc717ccf-91ac-4bec-867b-63deb66692b6",
            "description": "In Dallas, Matador Resources Company (NYSE: MTDR) has started a cash tender offer called the “Tender Offer” to buy up to $500 million worth of its 6.875% senior notes due 2028 (the “2028 Notes”). This move is being funded by a portion of the net proceeds from their recent private placement of $750 million in senior unsecured notes due 2034 (the “New Notes”). The company aimed to use the funds from the New Notes offering to repurchase outstanding 2028 Notes, marking a significant financial strategy shift.",
            "link": "https://www.markets.news/headlines/bc717ccf-91ac-4bec-867b-63deb66692b6",
            "pub_date": "2026-02-26 20:46:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Matador Resources plans $750 million senior notes offering due 2034, to repurchase $500 million 2028 notes. ",
            "id": "9a1d6071-86d7-4cc5-a42a-1f02509e64a8",
            "description": "Matador Resources Company (NYSE: MTDR) has disclosed its plan to offer $750 million of senior unsecured notes due 2034, subject to market conditions. The offering will be carried out as a private placement to eligible buyers. The company aims to utilize the net proceeds from this offering to repurchase all $500 million of its outstanding 6.875% senior notes due 2028. This repayment will be executed through a cash tender offer.",
            "link": "https://www.markets.news/headlines/9a1d6071-86d7-4cc5-a42a-1f02509e64a8",
            "pub_date": "2026-02-26 20:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2a14db52-6751-4b21-b97a-a19586b69011",
            "description": "Israel's COGAT: 'Two mobile clinics by the Latin Patriarchate of Jerusalem have entered the Gaza Strip today. The clinics are composed of four separate containers, fully equipped with medical devices and essential medications designed to bolster the medical response in Gaza.",
            "link": "https://www.markets.news/headlines/2a14db52-6751-4b21-b97a-a19586b69011",
            "pub_date": "2026-02-26 20:46:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cronos Group Q4 earnings missed estimates by -100%, EPS at $0.0 vs. $0.02. Revenue up by $14.23 million.",
            "id": "2bbe2524-8da3-4a51-998b-8d1d05f51d4f",
            "description": "Cronos Group (NASDAQ: CRON) disclosed its Q4 earnings on February 26, 2026, at 07:35 AM. The key points from the release include missing estimated earnings by -100.0%, with an EPS of $0.0 compared to the anticipated $0.02. The revenue saw an increase of $14.23 million from the equivalent period last year. In the preceding quarter, the company exceeded expectations. For further details, the complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/2bbe2524-8da3-4a51-998b-8d1d05f51d4f",
            "pub_date": "2026-02-26 20:48:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6691aee5-dc26-4679-ade6-abb791bb50bc",
            "description": "Some of Germany’s top business leaders have been expressing their hopes for the growing partnership with China during their visit with German Chancellor Friedrich Merz. CGTN spoke to Dr. Roland Busch, Chairman, President and CEO of Siemens AG, Ola Källenius, Chairman of",
            "link": "https://www.markets.news/headlines/6691aee5-dc26-4679-ade6-abb791bb50bc",
            "pub_date": "2026-02-26 20:49:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cronos Group's Q4 earnings missed estimates by -100%, with revenue up $14.23 million. Full article on Benzinga.com.",
            "id": "712233fd-9072-4637-9534-7185873af07f",
            "description": "Cronos Group (NASDAQ: CRON) released its Q4 earnings on Thursday, February 26, 2026, at 07:35 AM. Despite expectations, the company fell short on earnings by -100%, posting an EPS of $0.0 instead of the estimated $0.02. However, revenue saw a significant increase, rising by $14.23 million compared to the previous year. For a more detailed account, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/712233fd-9072-4637-9534-7185873af07f",
            "pub_date": "2026-02-26 20:40:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gibraltar Industries Q4 earnings beat estimates by 2.7%, with EPS at $0.76 vs $0.74. Revenue dropped $33.37M from last year.",
            "id": "d1e947aa-77cd-448b-b794-21ccbde16807",
            "description": "Gibraltar Industries (NASDAQ: ROCK) recently released its Q4 earnings report on February 26, 2026, at 07:30 AM. The report revealed that the company exceeded expected earnings by 2.7%, posting an EPS of $0.76 compared to an estimated $0.74. However, there was a decrease in revenue by $33.37 million from the previous year's same period. For more details on the company's performance in previous earnings, refer to the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/d1e947aa-77cd-448b-b794-21ccbde16807",
            "pub_date": "2026-02-26 20:40:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Public Service Enterprise (NYSE: PEG) beat earnings by 1.41%, reporting EPS of $0.72 vs an estimate of $0.71, with revenue up $450M.",
            "id": "3498da54-e0ba-4d2e-9cbf-f9a549ffcaa2",
            "description": "Public Service Enterprise, listed as NYSE: PEG, released its Q4 earnings on February 26, 2026, at 07:30 AM. The earnings report showed a beat on estimated earnings by 1.41%, with an EPS of $0.72 compared to the estimated $0.71. This quarter's revenue saw an increase of $450.00 million from the corresponding period in the previous year. For more details on the previous earnings records and the full story, the information is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/3498da54-e0ba-4d2e-9cbf-f9a549ffcaa2",
            "pub_date": "2026-02-26 20:40:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lindblad Expeditions Q4 earnings report: EPS at $-0.45 (missed estimate by -40.62%), revenue increased by $34.57 million.",
            "id": "0de955fe-a68e-4703-936e-212914eff41e",
            "description": "Lindblad Expeditions (NASDAQ: LIND) recently disclosed its Q4 earnings report on February 26, 2026, at 07:30 AM. The report revealed a notable -40.62% earnings miss, with an EPS of $-0.45 compared to the estimated $-0.32. Despite this, revenue witnessed a positive trend, increasing by $34.57 million from the corresponding period in the previous year. The full details and comprehensive analysis, including Lindblad Expeditions' past earnings performance and comparisons, can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/0de955fe-a68e-4703-936e-212914eff41e",
            "pub_date": "2026-02-26 20:41:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere Energy (NYSE: LNG) beat estimated earnings by 176.68%, reporting an EPS of $10.68 vs $3.86. Revenue up $1.01B from last year.",
            "id": "a33bfb35-9f3e-464c-80fd-3c79844af9a5",
            "description": "Cheniere Energy, a company listed on the NYSE under the ticker LNG, disclosed its fourth-quarter financial results on Thursday, February 26, 2026, at 07:30 AM. The earnings report revealed that the company exceeded expectations significantly, surpassing estimated earnings by 176.68%. Their earnings per share (EPS) stood at $10.68, notably higher than the projected $3.86. Additionally, Cheniere Energy experienced an increase in revenue, with a growth of $1.01 billion compared to the corresponding period last year. For a detailed analysis of their past financial performance and a more comprehensive report, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/a33bfb35-9f3e-464c-80fd-3c79844af9a5",
            "pub_date": "2026-02-26 20:41:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Collegium Pharmaceutical (NASDAQ: COLL) Q4 earnings missed estimates by 2.39%, EPS of $2.04 vs. $2.09. Revenue up by $23.50 million.",
            "id": "454b47b1-3920-4779-bcd2-29c7d3ae1759",
            "description": "Collegium Pharmaceutical (NASDAQ: COLL) recently released its Q4 earnings report on Thursday, February 26, 2026, at 07:30 AM. The company fell short of estimated earnings by -2.39%, revealing an EPS of $2.04 in comparison to the projected $2.09. Moreover, their revenue increased by $23.50 million from the previous year's corresponding period. In terms of past earnings performance, Collegium Pharmaceutical exceeded EPS predictions by... (For the complete story, visit Benzinga.com)",
            "link": "https://www.markets.news/headlines/454b47b1-3920-4779-bcd2-29c7d3ae1759",
            "pub_date": "2026-02-26 20:41:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c2683ab-4dc1-4710-ace2-6c10c076e1d4",
            "description": "NATO Secretary General Mark Rutte and Lithuania's Prime Minister Inga Ruginienė hold a joint press conference",
            "link": "https://www.markets.news/headlines/1c2683ab-4dc1-4710-ace2-6c10c076e1d4",
            "pub_date": "2026-02-26 20:44:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kearney predicts 2.3-4% increase in supply chain costs above inflation with a 95% accuracy rate; tariff rates, critical minerals, geopolitical risks, and global inventory impacting industries.",
            "id": "c61b8cef-77cb-4aef-98d4-309b5bb2da32",
            "description": "Kearney's tool has demonstrated an accuracy of over 95% in predicting performance across 10 consecutive quarters. Factors such as tariff rates, critical minerals, geopolitical risks, and elevated global inventory levels are consistently impacting industries and regions. There is sustained pressure being exerted as cost pressures on commodity prices are gradually easing.",
            "link": "https://www.markets.news/headlines/c61b8cef-77cb-4aef-98d4-309b5bb2da32",
            "pub_date": "2026-02-26 20:44:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bybit reassures community with stability & long-term commitment as Crypto Fear and Greed Index hits historic lows.",
            "id": "59382e06-26b4-4763-824a-513610a96ce5",
            "description": "In Dubai, UAE on Feb. 26, 2026, the Crypto Fear and Greed Index hit record lows as Bitcoin experienced a significant decrease from its peak levels. Bybit, ranked as the world's second-largest cryptocurrency platform based on trading volume, is emphasizing a fundamental principle amidst this uncertainty.",
            "link": "https://www.markets.news/headlines/59382e06-26b4-4763-824a-513610a96ce5",
            "pub_date": "2026-02-26 20:44:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BioCryst Pharma missed Q4 earnings estimate by -21.43%, EPS of $0.055. Revenue up $31.75M YoY. Details on Benzinga.com.",
            "id": "dab12eb1-4751-47b5-aaf7-cf4952d105d3",
            "description": "BioCryst Pharma (NASDAQ: BCRX) released its Q4 earnings on February 26, 2026, at 07:00 AM. The earnings report revealed that the company missed estimated earnings by -21.43%, with an EPS of $0.055 compared to the expected $0.07. Revenue showed a significant increase of $31.75 million from the previous year. In the prior quarter, BioCryst Pharma had outperformed expectations. For more details, the full story can be found on the Benzinga website.",
            "link": "https://www.markets.news/headlines/dab12eb1-4751-47b5-aaf7-cf4952d105d3",
            "pub_date": "2026-02-26 20:45:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Payoneer Global (NASDAQ: PAYO) Q4 earnings missed estimates by -16.67% with EPS $0.05 vs. $0.06. Revenue up $12.95M.",
            "id": "9289d5bc-a650-4f53-972e-4c7e8c5df415",
            "description": "Payoneer Global (NASDAQ: PAYO) unveiled its Q4 financial results on February 26, 2026, at 7:30 AM. The company fell short of estimated earnings by -16.67%, revealing an EPS of $0.05 compared to the projected $0.06. Revenue saw a rise of $12.95 million from the previous year. In past earnings, Payoneer Global had also missed on EPS... For more details, the complete story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/9289d5bc-a650-4f53-972e-4c7e8c5df415",
            "pub_date": "2026-02-26 20:34:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asahi Kasei buys Aicuris Anti-infective Cures AG, acquiring all issued shares for strengthened global pharma platform.",
            "id": "b7de91b0-f91c-4620-a1ff-e1ec4125c029",
            "description": "In a recent announcement, Asahi Kasei has revealed its plans to purchase all outstanding shares of Aicuris Anti-infective Cures AG. The acquisition agreement has been finalized between the two companies.",
            "link": "https://www.markets.news/headlines/b7de91b0-f91c-4620-a1ff-e1ec4125c029",
            "pub_date": "2026-02-26 20:34:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sinch introduces agentic conversations for AI-powered customer engagement across global channels.",
            "id": "797729ff-6d88-4913-8961-9ac2538e83d7",
            "description": "On February 26, 2026, in Stockholm, Sinch (publ) introduced agentic conversations, a fresh range of features that aim to implement AI agents on a global scale. This allows businesses to utilize intelligent agents over various communication channels like messaging, voice, and email in a widespread manner.",
            "link": "https://www.markets.news/headlines/797729ff-6d88-4913-8961-9ac2538e83d7",
            "pub_date": "2026-02-26 20:34:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fiera Capital Q4 2025: AUM $164.1B, total revenues $180.1M. Adjusted EBITDA $54.7M, net earnings $7.6M. Dividend of 10.8 cents/share.",
            "id": "5a41a248-0539-4c3f-b765-8e6eccf65862",
            "description": "Fiera Capital Corporation reported its financial results for Q4 and fiscal year ending in December 2025. End of period AUM was $164.1 billion, with total revenues of $180,062 thousand. Base management fees were $153,950 thousand, performance fees were $13,505 thousand, and commitment and transaction fees were $7,667 thousand. Net earnings were $7,667 thousand, and adjusted EBITDA was $54,672 thousand. They saw growth in AUM in Private Markets and new mandates in Public Markets. The Board approved a dividend of 10.8 cents per share. Total debt decreased, with the net debt ratio at 3.4x. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/5a41a248-0539-4c3f-b765-8e6eccf65862",
            "pub_date": "2026-02-26 20:34:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}