{
    "data": [
        {
            "title": "Titan Intl (NYSE: TWI) Q4 earnings missed estimates by 0.0%, with EPS at $-0.27. Revenue rose by $26.87 million from last year. Beat past EPS by $0.06. Full story on Benzinga.com.",
            "id": "0fc3566f-ba99-4dda-8964-83b7fa10dc9f",
            "description": "Titan Intl, a company listed on NYSE under the symbol TWI, released its Q4 earnings on Thursday, February 26, 2026, at 06:00 AM. The earnings report showed that the company missed estimated earnings by 0.0%, with an EPS of $-0.27 compared to the estimated $-0.27. However, Titan Intl saw an increase in revenue, up by $26.87 million from the previous year. In terms of past earnings performance, the company exceeded expectations on EPS by $0.06. For more details, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/0fc3566f-ba99-4dda-8964-83b7fa10dc9f",
            "pub_date": "2026-02-26 19:22:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trulieve Cannabis Q4 earnings beat estimates by 33.33%, EPS $-0.02 vs. $-0.03. Revenue down $8 million YoY.",
            "id": "d817c233-836d-4831-9503-145a6c9b373a",
            "description": "Trulieve Cannabis (OTC: TCNNF) released their Q4 earnings results on Thursday, February 26, 2026, at 06:15 AM. They exceeded estimated earnings by 33.33%, with an EPS of $-0.02 compared to the expected $-0.03. Revenue experienced an $8.00 million decrease from the previous year. In the past, the company had missed earnings expectations. For further details, the complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/d817c233-836d-4831-9503-145a6c9b373a",
            "pub_date": "2026-02-26 19:22:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a7d3a43c-c767-406e-bca0-52b6d9647acd",
            "description": "Zelenskyy: When we say that the aggressor should not receive any reward for war, so that peace can be truly lasting, everyone must understand: these are not just words. Unfortunately, the world already had the opportunity to verify this 12 years ago. The Russian war against",
            "link": "https://www.markets.news/headlines/a7d3a43c-c767-406e-bca0-52b6d9647acd",
            "pub_date": "2026-02-26 19:22:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1a2914d4-9ac4-4dc3-96c6-996980eab28c",
            "description": "SWEDEN POWER GRID OPERATOR SVENSKA KRAFTNAT: HAS INCREASED VIGILANCE AT ITS FACILITIES",
            "link": "https://www.markets.news/headlines/1a2914d4-9ac4-4dc3-96c6-996980eab28c",
            "pub_date": "2026-02-26 19:23:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "50b6169e-b8aa-49b3-9c0a-d728437991b0",
            "description": "STELLANTIS: IN TALKS TO USE LEAPMOTOR EV TECH FOR CARS IN EUROPE",
            "link": "https://www.markets.news/headlines/50b6169e-b8aa-49b3-9c0a-d728437991b0",
            "pub_date": "2026-02-26 19:24:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Acushnet Holdings Corp. (NYSE: GOLF) announces full year & Q4 2025 financial results, conference call at 8:30 a.m ET. Total characters: 112",
            "id": "71778f04-de7f-47dd-a62e-33f517708117",
            "description": "Fairhaven, Massachusetts-based Acushnet Holdings Corp. (NYSE: GOLF) released its financial results for the full year and fourth quarter of 2025 on February 26, 2026. These results can be accessed on the Acushnet Investor Relations website and the U.S. Securities and Exchange Commission website. Acushnet will conduct an investor conference call at 8:30 a.m. Eastern Time.",
            "link": "https://www.markets.news/headlines/71778f04-de7f-47dd-a62e-33f517708117",
            "pub_date": "2026-02-26 19:24:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0053e00b-2169-43d3-bdc9-a24575e99fe1",
            "description": "STELLANTIS: CHINA'S LEAPMOTOR DISCUSS DEEPENING JV WITH EV TECH",
            "link": "https://www.markets.news/headlines/0053e00b-2169-43d3-bdc9-a24575e99fe1",
            "pub_date": "2026-02-26 19:24:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brainstorm Cell Therapeutics raised a total of $2 million in February with a second $1 million strategic placement.",
            "id": "3c26ad31-d649-40c6-add2-8792b0d1ffc7",
            "description": "In New York on February 26, 2026, Brainstorm Cell Therapeutics Inc. (OTCQB: BCLI), a prominent company specializing in adult stem cell treatments for neurodegenerative illnesses, disclosed a new contract. They have finalized a second agreement, securing an extra $1 million through a strategic private investment.",
            "link": "https://www.markets.news/headlines/3c26ad31-d649-40c6-add2-8792b0d1ffc7",
            "pub_date": "2026-02-26 19:25:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global demand for building and furniture solutions showcased at Canton Fair's March event in Guangzhou.",
            "id": "b5989507-60ca-4cbc-9ff0-82762cdfbe68",
            "description": "The city of Guangzhou in China will host the Canton Fair's March Industry Thematic Event on February 26, 2026. This event will concentrate on the Building & Furniture sector to meet the changing demand in residential, commercial, and infrastructure areas worldwide. The spotlight will be on showcasing innovative products and solutions.",
            "link": "https://www.markets.news/headlines/b5989507-60ca-4cbc-9ff0-82762cdfbe68",
            "pub_date": "2026-02-26 19:25:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MDP+ appoints Jason Wi as CEO to lead global growth & operational excellence. Focus on derma beauty. Owned by Morgan Stanley PE Asia.",
            "id": "29027aef-2334-48b5-8493-3edec5323325",
            "description": "A highly experienced individual in managing global operations and partnerships will lead the international expansion efforts. The brand is undergoing operational changes to enhance its position in the derma beauty sector. Headquartered in SEOUL, South Korea, the initiative began on Feb. 26, 2026. MDP+, primarily owned by Morgan Stanley Private Equity Asia, is driving this transformation.",
            "link": "https://www.markets.news/headlines/29027aef-2334-48b5-8493-3edec5323325",
            "pub_date": "2026-02-26 19:25:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Barbara Ann Karmanos Cancer Institute partners with WSU to offer three CrossFit sessions for cancer survivors in Michigan.",
            "id": "d66dc998-44f2-46f2-acfc-dcc4a6da580c",
            "description": "Registration has officially begun for the upcoming CAPABLE sessions taking place in Farmington Hills, Grand Blanc, and Detroit. These sessions will be held in Detroit on February 26, 2026. The Barbara Ann Karmanos Cancer Institute has teamed up with Wayne State University (WSU) School of Medicine as well as three athletic facilities to provide access to cancer services.",
            "link": "https://www.markets.news/headlines/d66dc998-44f2-46f2-acfc-dcc4a6da580c",
            "pub_date": "2026-02-26 19:13:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "022daf94-6a75-47a9-ab17-7396a95084e3",
            "description": "Israel MFA: ''Hamas’ Ministry of Social Development reports distributing $3 million to 19,306 widows of “martyrs,” meaning 19,306 MARRIED Hamas terrorists were killed. This, without counting UNMARRIED terrorists (likely a similar number), their own misfired rockets which",
            "link": "https://www.markets.news/headlines/022daf94-6a75-47a9-ab17-7396a95084e3",
            "pub_date": "2026-02-26 19:13:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gray Media's Q4 earnings: EPS $-0.24 missed estimates by -33.33%, Revenue down $253 million from last year.",
            "id": "53a898d6-abd0-46b1-954c-eae10ccf121b",
            "description": "Gray Media (NYSE: GTN) released its Q4 earnings report on February 26, 2026 at 06:00 AM. The company fell short of estimated earnings by -33.33%, posting an EPS of $-0.24 compared to the expected $-0.18. Revenue decreased by $253.00 million from the previous year. For a detailed analysis, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/53a898d6-abd0-46b1-954c-eae10ccf121b",
            "pub_date": "2026-02-26 19:14:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e5a34654-93ea-412c-856f-28488a7dfee5",
            "description": "HORMEL Q1 2026 EARNINGS: ADJ EPS 34C (EST 32C)  NET SALES USD 3.03B (EST USD 3.07B)  SEES FY EPS USD 1.37 TO USD 1.46 (EST USD 1.45)  STILL SEES FY NET SALES USD 12.28 TO USD 12.58 (EST USD 12.39B)",
            "link": "https://www.markets.news/headlines/e5a34654-93ea-412c-856f-28488a7dfee5",
            "pub_date": "2026-02-26 19:16:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c7739041-116a-4238-a12a-841bce457932",
            "description": "INDIA PM MODI: INDIA WILL CONTINUE TO CONSULT AND COOPERATE WITH ALL PARTNERS ON ESTABLISHING PEACE IN WEST ASIA",
            "link": "https://www.markets.news/headlines/c7739041-116a-4238-a12a-841bce457932",
            "pub_date": "2026-02-26 19:16:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c551df0d-e19c-426a-a735-74b0b73c3347",
            "description": "Lukashenko and Putin hold meeting",
            "link": "https://www.markets.news/headlines/c551df0d-e19c-426a-a735-74b0b73c3347",
            "pub_date": "2026-02-26 19:17:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trulieve's 2025 results: $1.2B revenue, 60% gross margin, $273M cash flow, 50.1M products sold, 11 dispensaries added. CEO optimistic for 2026.",
            "id": "32c9d6ee-e1b3-401e-b82b-bf8ef9a4c35d",
            "description": "Trulieve Cannabis Corp reported strong financial results for 2025, with a full-year revenue of $1.2 billion and a 60% gross margin. The company achieved record cash flow from operations of $273 million and free cash flow of $229 million in 2025. They sold a record 50.1 million branded product units, a 5% increase from the previous year. The company also reported a net loss attributable to common shareholders of $116 million. They closed a $140 million private placement of senior secured notes due 2030 and granted conditional approval for a Dispensing Organization license in Texas. Trulieve CEO, Kim Rivers, expressed optimism for 2026, focusing on expanded access, customer loyalty, branded products, and growth initiatives. The company operates 234 dispensaries and over four million square feet of cultivation and processing capacity in the U.S.",
            "link": "https://www.markets.news/headlines/32c9d6ee-e1b3-401e-b82b-bf8ef9a4c35d",
            "pub_date": "2026-02-26 19:17:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bouygues selects Buildots to monitor construction of 44,000 m² logistics platform in Val-d'Oise using AI.",
            "id": "753bb61d-31c0-44d8-a527-b13e97d21762",
            "description": "In Paris on February 26, 2026, Bouygues Bâtiment Industrie, a subsidiary of Bouygues Construction specializing in industrial projects, announced its partnership with Buildots, an AI-based construction progress monitoring tool. This collaboration will aid in the development of the P3 Persan project, covering an area of 44,000 square meters.",
            "link": "https://www.markets.news/headlines/753bb61d-31c0-44d8-a527-b13e97d21762",
            "pub_date": "2026-02-26 19:17:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bilt introduces Neighborhood Concierge service to handle various tasks for members in largest home network, rewarding millions monthly.",
            "id": "ad8a8d82-bb16-4c11-a611-d0f07c195173",
            "description": "In a recent announcement, Bilt Founder and CEO Ankur Jain addressed Bilt Members in a letter, highlighting the evolution of the service into a comprehensive membership program designed to manage various aspects of home and neighborhood life. Over the past five years, Bilt has expanded to become the largest network of homes in the nation, offering rewards to millions of members monthly, particularly on rent and mortgage payments. This transformation has effectively imbued the concept of housing with a newfound level of benefits for the residents.",
            "link": "https://www.markets.news/headlines/ad8a8d82-bb16-4c11-a611-d0f07c195173",
            "pub_date": "2026-02-26 19:19:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AEON releases 2025 payment data, showcasing growth of AI-native payments in new economy, highlighting demand for AI-native and crypto-based payment infrastructure.",
            "id": "0a297cbb-0989-4aae-9ed6-9c14578a3b1c",
            "description": "In Hong Kong on February 26, 2026, AEON, a key payment and settlement platform for the evolving AI economy, has unveiled its payment performance data for 2025. The data underscores the increasing need for AI-integrated and cryptocurrency-driven payment systems. As the year concluded in 2025, AEON experienced a significant rise in demand, showcasing a shift towards AI-centric financial mechanisms.",
            "link": "https://www.markets.news/headlines/0a297cbb-0989-4aae-9ed6-9c14578a3b1c",
            "pub_date": "2026-02-26 19:19:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}