{
    "data": [
        {
            "title": "Orvana Minerals reports Taguas exploration update, attending PDAC 2026 convention in Toronto at booth #2243.",
            "id": "ad1cd306-6d5f-4777-b9a4-b3a94d9fe568",
            "description": "Participating in the PDAC 2026 convention in Toronto from March 1-4, Orvana Minerals Corp. (TSX: ORV) will showcase its developments at booth #2243. The Company is excited to share exploration progress from Taguas, Argentina. The convention will be a platform for Orvana to present its latest achievements and engage with stakeholders.",
            "link": "https://www.markets.news/headlines/ad1cd306-6d5f-4777-b9a4-b3a94d9fe568",
            "pub_date": "2026-02-28 10:32:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Morgan Stanley seeks OCC bank charter to hold crypto assets; aims to debut Bitcoin, Ether, and Solana ETFs in January.",
            "id": "99003361-819c-4228-9469-dc4826ce97e4",
            "description": "In January, the prominent Wall Street bank has stepped up its expansion into the cryptocurrency sector by submitting applications to introduce exchange-traded funds (ETFs) for Bitcoin, Ether, and Solana.",
            "link": "https://www.markets.news/headlines/99003361-819c-4228-9469-dc4826ce97e4",
            "pub_date": "2026-02-28 10:07:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Cannabist Co. extends forbearance agreement with senior noteholders for 9.25% Sr. Secured Notes & 9.00% Sr. Secured Convertible Notes.",
            "id": "beb5b12a-5845-4a82-9cbf-ed801ecba45e",
            "description": "In Chelmsford, Massachusetts, The Cannabist Company Holdings Inc. revealed that the ad hoc group of noteholders of the Company’s 9.25% Senior Secured Notes due December 31, 2028 and the 9.00% Senior Secured Convertible Notes due December 31, 2028 (together known as the “Notes”), have made an announcement. The notes include $100 million of 9.25% Senior Secured Notes and $50 million of 9.00% Senior Secured Convertible Notes. The Cannabist Company is recognized as a prominent cultivator, manufacturer, and retailer of cannabis products in the US.",
            "link": "https://www.markets.news/headlines/beb5b12a-5845-4a82-9cbf-ed801ecba45e",
            "pub_date": "2026-02-28 09:58:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Purito Seoul launches 'From Soil to Seoul' slogan, 'Oat Latte Campaign' with major pop-up in NYC's West Village, date changed.",
            "id": "86395a9f-6282-4779-8a46-ebbde012c159",
            "description": "Purito Seoul has introduced its new brand slogan 'From Soil to Seoul' and initiated the 'Oat Latte Campaign.' The campaign includes a major pop-up event in New York's West Village. The announcement was made on 27-Feb-2026 by HINATURE INC. via PR Newswire. The company has updated the date for the pop-up event, indicating a shift in plans.",
            "link": "https://www.markets.news/headlines/86395a9f-6282-4779-8a46-ebbde012c159",
            "pub_date": "2026-02-28 09:53:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GoldMining Inc. files annual financial statements, MD&A, and Annual Information Form and Report on Form 40-F. TSX: GOLD, GLDG.",
            "id": "5fca8777-9cc6-47db-bef8-8302c92dc980",
            "description": "GoldMining Inc. (TSX: GOLD) (NYSE American: GLDG) based in Vancouver, BC, disclosed on Feb. 27, 2026, the submission of its yearly financial statements, management's discussion and analysis (\"MD&A\"), and annual information form (collectively referred to as \"Annual Filings\").",
            "link": "https://www.markets.news/headlines/5fca8777-9cc6-47db-bef8-8302c92dc980",
            "pub_date": "2026-02-28 09:41:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kirin Hyoketsu expands into US RTD market with 2 flavors - Strawberry and Pineapple. Launching in Hawaii, Tampa, FL, and EPCOT on March 2.",
            "id": "5a065e8a-b4bf-4a4a-b453-c69ebb01dd7d",
            "description": "New Belgium Brewing, a subsidiary of the Kirin Group focusing on alcoholic beverages in the U.S., is set to introduce two new flavors – KIRIN HYOKETSU STRAWBERRY and KIRIN HYOKETSU PINEAPPLE – as part of the KIRIN HYOKETSU (HYOKETSU) brand. These ready-to-drink cocktails will be produced and marketed by Kirin Brewery Company, Limited (Kirin Brewery). The launch is scheduled for March 2 in Hawaii, Tampa, FL, and The Japan Pavilion at EPCOT theme park, managed by Mitsukoshi (U.S.A.). The beverages have been crafted with a mix of American-inspired flavors.",
            "link": "https://www.markets.news/headlines/5a065e8a-b4bf-4a4a-b453-c69ebb01dd7d",
            "pub_date": "2026-02-28 09:33:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AgriBank reports strong financial results for Q4 2025 and full year, reflecting successful business model.",
            "id": "bf83ba49-a8d4-4c56-81f3-431d9f998da8",
            "description": "AgriBank, headquartered in St. Paul, Minnesota, revealed its financial outcomes for the final quarter and entire year of 2025, showcasing robust performance. The company's business model and the Association's accomplishments contributed to this success. The announcement was made on February 27, 2026, without specifying the exact figures.",
            "link": "https://www.markets.news/headlines/bf83ba49-a8d4-4c56-81f3-431d9f998da8",
            "pub_date": "2026-02-28 09:35:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA approves BioMarin's PALYNZIQ for adolescents 12+ with PKU, reduces blood Phe levels. Only approved enzyme substitution therapy.",
            "id": "4fec910e-34ca-42b7-a292-d8416253ba49",
            "description": "In the pivotal Phase 3 PEGASUS study, treatment using PALYNZIQ demonstrated a significant reduction in blood phenylalanine (Phe) levels compared to relying solely on dietary measures. This enzyme substitution therapy stands as the exclusive treatment approved for individuals with PKU. The study, conducted in SAN RAFAEL, Calif., unveiled these findings on February 27, 2026.",
            "link": "https://www.markets.news/headlines/4fec910e-34ca-42b7-a292-d8416253ba49",
            "pub_date": "2026-02-28 09:01:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8eea07ef-f689-4049-9016-0234c64dd4d8",
            "description": "Shareholders approve EQV Ventures Acquisition Corp.'s business combination with Presidio.",
            "link": "https://www.markets.news/headlines/8eea07ef-f689-4049-9016-0234c64dd4d8",
            "pub_date": "2026-02-28 09:02:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rocket Lab launches 2nd hypersonic test mission in 3 months for the Defense Innovation Unit, supporting national priority.",
            "id": "7aa55251-5074-4bcd-99c6-2cb74a1e1071",
            "description": "In Long Beach, California, on February 27, 2026, Rocket Lab Corporation (Nasdaq: RKLB) conducted a successful hypersonic test mission on its HASTE rocket for the Defense Innovation Unit (DIU) of the Department of War. Rocket Lab, a renowned figure in launch services and space systems, contributed to advancing hypersonic technology for the United States and its allies. This venture is crucial for national security, emphasizing the Company's commitment to innovation and collaboration in the space industry.",
            "link": "https://www.markets.news/headlines/7aa55251-5074-4bcd-99c6-2cb74a1e1071",
            "pub_date": "2026-02-28 08:41:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese President Xi Jinping met German Chancellor Friedrich Merz; 1st foreign leader to visit China in Year of Horse, discussed further cooperation.",
            "id": "2bbb3fb5-3171-4d8e-a1fc-9f2b8eb5faf7",
            "description": "On February 27, 2026, in Beijing, Chinese President Xi Jinping held a meeting with German Chancellor Friedrich Merz. This marks the inaugural visit by a foreign leader to China in the Year of the Horse. During the meeting, President Xi put forth three suggestions to advance the relationship between the two nations.",
            "link": "https://www.markets.news/headlines/2bbb3fb5-3171-4d8e-a1fc-9f2b8eb5faf7",
            "pub_date": "2026-02-28 08:43:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Memoir draft reveals Binance founder's secret talks leading to prison time and encounter with ICE.",
            "id": "70f510d5-0286-4977-b4dd-82282f276682",
            "description": "The founder of Binance, Changpeng Zhao, revealed in an early version of his memoir the covert discussions that ended in his incarceration and a confrontation with ICE.",
            "link": "https://www.markets.news/headlines/70f510d5-0286-4977-b4dd-82282f276682",
            "pub_date": "2026-02-28 08:37:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump bans Anthropic from government agencies and contractors after Pentagon deal collapses amid disputes over military use of AI models.",
            "id": "97d4a114-083e-4f74-bda5-f60e00d3ad7b",
            "description": "Anthropic and the Pentagon have been in a dispute regarding the specific guidelines for military use of AI models. In light of this disagreement, it has been reported that the US President Trump has prohibited Anthropic from engaging with government agencies and contractors. This decision comes after a deal between Anthropic and the Pentagon fell through. The restrictions on Anthropic’s involvement with these entities have been put in place following these developments.",
            "link": "https://www.markets.news/headlines/97d4a114-083e-4f74-bda5-f60e00d3ad7b",
            "pub_date": "2026-02-28 08:07:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Major indexes below 50-day moving averages, but strength underneath; S&P 500's top stock setting up.",
            "id": "5d3939cf-b032-4ab9-9bdc-3538261109eb",
            "description": "All of the primary stock market indicators are currently trading below their 50-day moving averages. Despite this, there is significant resilience and vigor in the market. The S&P 500's leading stock is currently showing promising signs of forming a potential setup for growth.",
            "link": "https://www.markets.news/headlines/5d3939cf-b032-4ab9-9bdc-3538261109eb",
            "pub_date": "2026-02-28 08:01:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YY Group Holding Limited has announced a US$20 million At-The-Market Offering Facility with sales agents Spartan Capital Securities, LLC and Wilson-Davis & Co., Inc.",
            "id": "f347811a-ac46-4ab4-bae8-4665abe3154c",
            "description": "Singapore, February 27, 2026 - YY Group Holding Limited, a global leader in on-demand workforce solutions and integrated facilities management, disclosed it has signed an At The Market Sales Agreement with Spartan Capital Securities, LLC and Wilson-Davis & Co., Inc. The agreement allows the company to potentially offer and sell up to $20,000,000 of its Class A Ordinary Shares through the Sales Agents as sales agents.",
            "link": "https://www.markets.news/headlines/f347811a-ac46-4ab4-bae8-4665abe3154c",
            "pub_date": "2026-02-28 08:01:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Instagram will notify parents if their teen searches for self-harm terms. Opt-in required for alerts.",
            "id": "cf859bdb-3c47-469a-9156-b91d51d627ba",
            "description": "If a child frequently searches for terms related to suicide or self-harm on the platform, parents will be notified. However, users are required to opt in to receive these notifications.",
            "link": "https://www.markets.news/headlines/cf859bdb-3c47-469a-9156-b91d51d627ba",
            "pub_date": "2026-02-28 08:02:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Crypto VC Paradigm invests $1.5B in AI, robotics, citing strong overlap with crypto. Co-founder sees AI developments as compelling.",
            "id": "1ceee7e1-3266-4cb6-8840-de539fd30f7a",
            "description": "Matt Huang from Paradigm stated that advancements in AI are too intriguing to overlook and emphasized the significant intersection between AI and cryptocurrency.",
            "link": "https://www.markets.news/headlines/1ceee7e1-3266-4cb6-8840-de539fd30f7a",
            "pub_date": "2026-02-28 08:02:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google stock's IPO set a high standard for traders with technical conditions, serving as a benchmark in new market debuts.",
            "id": "fbf2174c-2182-44d2-8b92-9e0500e3ddb1",
            "description": "The initial public offering (IPO) of Google stock showcased exceptional technical conditions, setting a high standard for traders seeking to evaluate new market debuts. Google's IPO continues to be a key reference point for investors analyzing IPOs. The information was featured in an article on Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/fbf2174c-2182-44d2-8b92-9e0500e3ddb1",
            "pub_date": "2026-02-28 08:02:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paramount's stock up 20% after acquiring Warner Bros, Democrats warn of investigation.",
            "id": "f1905c99-dfe9-46b5-b1a1-a0e5671182e3",
            "description": "After months of pursuit, Paramount has successfully acquired Warner Bros. in a significant business deal. However, Democrats have urged against premature celebrations, emphasizing that the merger is not finalized yet. Paramount's stock has surged by 20% following the news of this acquisition. Nevertheless, Democrats have stressed the need for a thorough and robust investigation into the deal. This cautionary approach suggests that the merger may face scrutiny and challenges in the upcoming stages despite the positive market response.",
            "link": "https://www.markets.news/headlines/f1905c99-dfe9-46b5-b1a1-a0e5671182e3",
            "pub_date": "2026-02-28 08:02:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil prices rise to 7-month high due to stalled US-Iran talks, tensions in the region. Pakistan and Afghanistan engage in war.",
            "id": "f6ff1d54-ec79-4ad3-8f18-711be2ae4ddc",
            "description": "Oil prices experienced an increase on Friday following a delay in nuclear discussions between the U.S. and Iran. Additionally, Pakistan and Afghanistan have engaged in a conflict. The surge in oil prices led to a 7-month high. These events were reported in an article by Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/f6ff1d54-ec79-4ad3-8f18-711be2ae4ddc",
            "pub_date": "2026-02-28 08:02:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}