{
    "data": [
        {
            "title": "DOJ seized $580M in crypto from Chinese criminals. $580M frozen by DC's Scam Center. US Attorney Pirro founded Strike Force.",
            "id": "9b50adc7-2209-41f0-a53b-f9038b8705b1",
            "description": "In the past three months, a total of seizures and freezing operations were carried out by the Scam Center Strike Force of the District of Columbia. The strike force was founded by US Attorney Jeanine Pirro in November and has been working to combat scams and fraudulent activities in the region.",
            "link": "https://www.markets.news/headlines/9b50adc7-2209-41f0-a53b-f9038b8705b1",
            "pub_date": "2026-02-28 03:52:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LeMaitre Vascular, Inc. (Nasdaq: LMAT) to attend 5 investor conferences in March.",
            "id": "8a7c61c0-c65a-41f5-820a-030e02028d75",
            "description": "On February 27, 2026, LeMaitre Vascular, Inc., listed on Nasdaq as LMAT, revealed plans to engage in five investor conferences in March. This initiative reflects the company's proactive approach to investor engagement and highlights a strong commitment to transparency. Such conferences offer a platform for stakeholders to interact directly with management, fostering a deeper understanding of the company's operations and strategic direction. By participating in these events, LeMaitre Vascular aims to enhance its investor relations and possibly attract potential investors looking to engage with a dynamic and forward-thinking organization.",
            "link": "https://www.markets.news/headlines/8a7c61c0-c65a-41f5-820a-030e02028d75",
            "pub_date": "2026-02-28 03:52:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TomoCredit offers 30-day plan to boost credit using tax refunds for 120 million Americans.",
            "id": "202bf7bc-4603-4755-a404-40d60b7c5858",
            "description": "In San Francisco on February 27, 2026, TomoCredit, an AI startup focused on creating a more inclusive credit framework, unveiled fresh financial advice aimed at being user-friendly for all, particularly the 120 million Americans managing credit without substantial histories.",
            "link": "https://www.markets.news/headlines/202bf7bc-4603-4755-a404-40d60b7c5858",
            "pub_date": "2026-02-28 03:55:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones drops on surprise inflation, Nvidia partner CoreWeave plunges on earnings. Live coverage by Investor's Business Daily.",
            "id": "9f63968e-04b1-482c-b1b2-7ecaf43cf99b",
            "description": "Today, the Dow Jones index experienced a decrease due to unexpected inflation data. CoreWeave, a partner of Nvidia, saw a significant drop in earnings. The market reaction was influenced by these events, with the Dow sinking and Nvidia shares declining following an agreement with OpenAI. The latest market movements can be followed through live coverage updates.",
            "link": "https://www.markets.news/headlines/9f63968e-04b1-482c-b1b2-7ecaf43cf99b",
            "pub_date": "2026-02-28 03:48:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3b5100bb-1472-42f7-b7db-371a42343da4",
            "description": "WARNER EXPECTED TO ANNOUNCE PARAMOUNT DEAL AGREEMENT FRIDAY",
            "link": "https://www.markets.news/headlines/3b5100bb-1472-42f7-b7db-371a42343da4",
            "pub_date": "2026-02-28 03:49:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7d818356-deba-4691-a66b-c55e876d83ca",
            "description": "No intel shows Iran is planning an ICBM able to hit the US - CNN.",
            "link": "https://www.markets.news/headlines/7d818356-deba-4691-a66b-c55e876d83ca",
            "pub_date": "2026-02-28 03:49:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "58ce4bcf-2be6-40dd-a13d-f4e2547d5025",
            "description": "BRENT CRUDE FUTURES SETTLE AT $72.48/BBL, UP $1.73, 2.45 PCT",
            "link": "https://www.markets.news/headlines/58ce4bcf-2be6-40dd-a13d-f4e2547d5025",
            "pub_date": "2026-02-28 03:49:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RECX partners with TRL Outdoors to boost MAX ATV dealer expansion, targeting disciplined growth nationwide.",
            "id": "89fc7f9c-3ba0-48b5-990a-d50cae4b6dcc",
            "description": "The agreement between RECX and its manufacturer’s representative facilitates the onboarding of dealers nationwide. It also promotes disciplined growth based on achieving milestones. This initiative aims to drive expansion and reach a wider audience.",
            "link": "https://www.markets.news/headlines/89fc7f9c-3ba0-48b5-990a-d50cae4b6dcc",
            "pub_date": "2026-02-28 03:49:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell stock surges after beat-and-raise earnings report driven by AI data center business growth.",
            "id": "e0374c41-1163-4f0f-8712-67ce2465bf79",
            "description": "Shares of Dell soared on Friday following the release of their exceptional earnings report, which exceeded expectations and resulted in a boost-and-raise scenario for investors. The company's stock witnessed a significant increase due to the success of its AI data center business, driving growth prospects. This news was reported on Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/e0374c41-1163-4f0f-8712-67ce2465bf79",
            "pub_date": "2026-02-28 03:50:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Supreme Court may affect Trump tariffs, impact federal budget amid big spending plans. - Investor's Business Daily.",
            "id": "62e705f2-d0a0-4388-9a5d-832be8f1ca6c",
            "description": "The recent Supreme Court ruling could potentially mitigate certain tariffs implemented by the Trump administration, causing strain on the federal budget due to the White House's intention to increase spending. This development has the potential to disrupt significant spending plans as indicated by Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/62e705f2-d0a0-4388-9a5d-832be8f1ca6c",
            "pub_date": "2026-02-28 03:41:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AS PRFoods 2nd quarter and 6-month report for 2025/2026 financial year shows challenges due to weak consumption, price sensitivity, and increased cost. Management focuses on core activities.",
            "id": "f4073ef2-ec20-41fa-ab9c-c9b5a1764d21",
            "description": "During the second quarter of the financial year, PRFoods faced difficulties in a tough economic setting with low consumption and heightened price sensitivity, leading to increased costs. These challenges predominantly impacted the company's operations in Estonia and neighboring markets. Despite this, management maintained its concentration on essential functions, managing costs effectively, and reinforcing the financial framework.",
            "link": "https://www.markets.news/headlines/f4073ef2-ec20-41fa-ab9c-c9b5a1764d21",
            "pub_date": "2026-02-28 03:41:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin holds at $65,000 as other cryptos dip. 96,079 traders liquidated, losing $259.25 million in 24h. ETH at $1,921.84.",
            "id": "e793bbb2-e046-4be3-a1dd-6bd3ecff4da0",
            "description": "Bitcoin is holding steady at the $65,000 mark with significant interest from institutional investors as the weekend approaches. Current cryptocurrency prices include Bitcoin at $65,364.43, Ethereum at $1,921.84, Solana at $81.58, XRP at $1.35, Dogecoin at $0.09324, and Shiba Inu at $0.05740. Recent data reveals that 96,079 traders were liquidated in the last 24 hours, resulting in losses totaling $259.25 million. Additionally, there were net inflows of $254.5 million from spot Bitcoin ETFs and $6.6 million from spot Ethereum ETFs on Thursday, as reported by Coinglass and SoSoValue respectively. For more details, the full article is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e793bbb2-e046-4be3-a1dd-6bd3ecff4da0",
            "pub_date": "2026-02-28 03:41:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Green Rain Energy Holdings (OTCID: GREH) announces special stock dividend and stock buyback program on 25-Feb-2026.",
            "id": "392f0de4-37e9-4bc1-85d4-f9a9729abb01",
            "description": "Green Rain Energy Holdings (OTCID: GREH) has recently issued a news release providing a corporate update. The company has finalized a special stock dividend and introduced a voluntary stock buyback program. In addition, they have also outlined strategic growth initiatives. This update was released by Green Rain Energy Holdings, Inc. on 25-Feb-2026. Investors and stakeholders are encouraged to take note of these significant developments.",
            "link": "https://www.markets.news/headlines/392f0de4-37e9-4bc1-85d4-f9a9729abb01",
            "pub_date": "2026-02-28 03:43:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brown Plus named #13 Best Small/Medium Remote Hybrid Workplace in America 2026 by Best Companies Group.",
            "id": "7406cb9c-7076-4ed7-9027-2e0c56181401",
            "description": "In Frederick, Maryland, on February 27, 2026, Brown Plus, a prominent accounting and advisory firm, proudly revealed its ranking as the 13th Best Remote and Hybrid Workplace in America for 2026 in the small/medium employer division. This recognition was bestowed upon them by Best Companies Group.",
            "link": "https://www.markets.news/headlines/7406cb9c-7076-4ed7-9027-2e0c56181401",
            "pub_date": "2026-02-28 03:43:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Minerals Technologies Inc. (NYSE: MTX) will participate in upcoming investor conferences on Feb. 27, 2026.",
            "id": "148883cd-df65-4bb3-b5b8-d1669616be07",
            "description": "On February 27, 2026, Minerals Technologies Inc. (NYSE: MTX) disclosed its involvement in upcoming investor conferences. The company, known as MTI, will be partaking in the events to engage with investors.",
            "link": "https://www.markets.news/headlines/148883cd-df65-4bb3-b5b8-d1669616be07",
            "pub_date": "2026-02-28 03:45:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "855ab3b1-b1cb-4cd1-8d79-21c6f4f02b9a",
            "description": "U.S. CRUDE OIL FUTURES SETTLE AT $67.02/BBL, UP $1.81, 2.78 PCT",
            "link": "https://www.markets.news/headlines/855ab3b1-b1cb-4cd1-8d79-21c6f4f02b9a",
            "pub_date": "2026-02-28 03:33:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zilliz Cloud BYOC now available on Microsoft Azure, expanding availability to major cloud platforms.",
            "id": "64609746-bacd-47e8-910b-54aecb513ffc",
            "description": "Zilliz, the tech company based in Redwood City, California, unveiled the availability of Zilliz Cloud BYOC on Microsoft Azure on February 27, 2026. The company is known for developing Milvus, the leading open-source vector database. Zilliz Cloud BYOC marks a significant milestone for Zilliz as it expands its services to one of the major cloud platforms in the industry. This move is anticipated to provide users with enhanced flexibility and scalability options. Zilliz Cloud BYOC allows users to bring their own cloud resources to leverage the services offered by Zilliz. The launch on Microsoft Azure opens up new opportunities for customers to utilize the capabilities of Zilliz Cloud BYOC. This announcement comes amidst a growing demand for cloud-based solutions, with Zilliz positioning itself as a key player in this space.",
            "link": "https://www.markets.news/headlines/64609746-bacd-47e8-910b-54aecb513ffc",
            "pub_date": "2026-02-28 03:33:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CobbleStone Software wins RepVue Reppy Award as top sales organization in Philadelphia. Feb 27, 2026.",
            "id": "862fe9cc-9b6e-442f-ad8b-925ec2b1925f",
            "description": "CobbleStone Software has recently been honored with a prestigious Reppy Award by RepVue for its exceptional performance as a leading sales organization in the Philadelphia region. The award was received on February 27, 2026, in Princeton, N.J. CobbleStone Software is well-known for its expertise in contract lifecycle management (CLM) and contract artificial intelligence.",
            "link": "https://www.markets.news/headlines/862fe9cc-9b6e-442f-ad8b-925ec2b1925f",
            "pub_date": "2026-02-28 03:33:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "360training acquires Canadian Food Safety Group, including SafeCheck Learning and SafeCheck Safety, expanding leadership in Canadian food safety.",
            "id": "c44d3735-2443-43ba-842e-d390b62b6060",
            "description": "In Austin, Texas on February 27, 2026, 360training.com, Inc., a prominent provider of online training and compliance solutions, revealed the purchase of specific assets from Canadian Food Safety Group. This acquisition encompassed SafeCheck® Learning and SafeCheck Safety®.",
            "link": "https://www.markets.news/headlines/c44d3735-2443-43ba-842e-d390b62b6060",
            "pub_date": "2026-02-28 03:33:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f57ad915-1209-477f-b25b-e1fa3c31bdd5",
            "description": "NYMEX WTI crude April futures settle at $67.02 a barrel up $1.81, 2.78% NYMEX Nat Gas April futures settle at $2.8590/MMBTU NYMEX Gasoline March futures settle at $2.0779 a gallon NYMEX Diesel March futures settle at $2.6709 a gallon",
            "link": "https://www.markets.news/headlines/f57ad915-1209-477f-b25b-e1fa3c31bdd5",
            "pub_date": "2026-02-28 03:33:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}