{
    "data": [
        {
            "title": "",
            "id": "a1873a3f-8ef8-438c-87d5-1aea286394b6",
            "description": "PARAMOUNT SKYDANCE CORP: BANK OF AMERICA MERRILL LYNCH, CITI AND APOLLO PROVIDING $57.5B DEBT COMMITMENT FOR DEAL",
            "link": "https://www.markets.news/headlines/a1873a3f-8ef8-438c-87d5-1aea286394b6",
            "pub_date": "2026-02-27 05:38:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orion S.A. (NYSE: OEC) declares $0.0207 per share dividend for Q2 2026, totaling $1.2 million; payment on April 2.",
            "id": "5dcb4300-de49-4ca3-93f4-456f894def9b",
            "description": "Orion S.A. (NYSE: OEC), a specialty chemicals company based in Houston, has declared an interim dividend for the second quarter of 2026. The dividend of $0.0207 per common share amounts to a total of approximately $1.2 million based on the current outstanding shares. Shareholders of record as of the closing of business in New York will receive the dividend on April 2, 2026.",
            "link": "https://www.markets.news/headlines/5dcb4300-de49-4ca3-93f4-456f894def9b",
            "pub_date": "2026-02-27 05:39:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Floor & Decor opens 2 new stores in NC and CA, creating over 90 new jobs, supporting expansion.",
            "id": "c5c92ef1-ced6-4d2a-8a55-86e500d9606f",
            "description": "Atlanta-based company Floor & Decor (NYSE: FND) has unveiled new warehouse-format stores and design centers in Fayetteville, North Carolina, and Vacaville, California. These openings are part of the company's expansion strategy and are expected to create over 90 new jobs in the two areas. The initiative reflects Floor & Decor's commitment to providing quality hard-surface flooring options for homeowners and professionals. The introduction of these new locations aligns with the company's mission to make its products and services more accessible to a wider audience.",
            "link": "https://www.markets.news/headlines/c5c92ef1-ced6-4d2a-8a55-86e500d9606f",
            "pub_date": "2026-02-27 05:40:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Betterware de Mexico SAPI (NYSE: BWMX) Q4 earnings missed estimates by -32.73%, with EPS $0.37 vs. $0.55. Revenue increased by $20.68 million.",
            "id": "41201127-2ea3-43f4-8dc3-990db1ebb93f",
            "description": "Betterware de Mexico SAPI (NYSE: BWMX) disclosed its Q4 earnings report on February 26, 2026, at 04:15 PM. The report revealed that the company fell short of estimated earnings by -32.73%, with an EPS of $0.37 instead of the anticipated $0.55. Despite this, revenue saw a $20.68 million increase compared to the previous period. Investors can find more details on this update at Benzinga.com.",
            "link": "https://www.markets.news/headlines/41201127-2ea3-43f4-8dc3-990db1ebb93f",
            "pub_date": "2026-02-27 05:40:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block Inc. plans to cut nearly 50% of its workforce and reported 65 cents per share earnings, missing revenue estimates.",
            "id": "29be53c1-c5d3-4aef-a055-870ee3eda549",
            "description": "Shares of Block Inc. (NYSE: XYZ) surged in after-hours trading following the release of its fourth-quarter earnings report, which revealed quarterly earnings of 65 cents per share, meeting analysts' expectations. However, quarterly revenue fell slightly short at $6.25 billion compared to the estimated $6.28 billion. In response, Block announced a significant headcount reduction of over 40%. The company expressed the challenges faced, leading to the difficult decision to cut nearly half of its workforce. For more, visit Benzinga.com for the complete story.",
            "link": "https://www.markets.news/headlines/29be53c1-c5d3-4aef-a055-870ee3eda549",
            "pub_date": "2026-02-27 05:40:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chemours to issue $700M of 7.875% Senior Notes Due 2034, up from initial amount.",
            "id": "e380723e-b374-40bf-a348-229992cbc273",
            "description": "In Wilmington, Delaware on February 26, 2026, the Chemours Company (Chemours) (NYSE: CC) disclosed the pricing details of its private offering of $700,000,000 principal amount of new 7.875% senior notes due in 2034 (referred to as the \"Notes\"). It was stated that the offering size had been raised...",
            "link": "https://www.markets.news/headlines/e380723e-b374-40bf-a348-229992cbc273",
            "pub_date": "2026-02-27 05:40:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RealReal (NASDAQ: REAL) beat earnings estimates by 200% in Q4, with EPS at $0.06 vs. $0.02 estimate. Revenue up $30.06 million from previous year.",
            "id": "b660253b-f785-4c91-8c4d-9b2d2e4f907d",
            "description": "RealReal (NASDAQ: REAL) released their Q4 earnings on Thursday, February 26, 2026, at 04:10 PM. They exceeded estimated earnings by 200%, with an EPS of $0.06 compared to the expected $0.02. Revenue saw a significant increase, going up by $30.06 million from the previous year. In the previous quarter... (the complete report can be found on Benzinga.com)",
            "link": "https://www.markets.news/headlines/b660253b-f785-4c91-8c4d-9b2d2e4f907d",
            "pub_date": "2026-02-27 05:40:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Expert Mariah Tritz discusses how integrative care accelerates recovery in Thornton, CO; featured in a HelloNation article.",
            "id": "ebe19778-640e-4015-9a66-023344bfb86b",
            "description": "In a recent article by HelloNation, Mariah Tritz from Intrepid Bodyworks in Thornton, Colorado discusses how integrative care can accelerate recovery for individuals managing pain, injury, or post-surgery healing. This approach is gaining attention for its effectiveness in improving rehabilitation outcomes.",
            "link": "https://www.markets.news/headlines/ebe19778-640e-4015-9a66-023344bfb86b",
            "pub_date": "2026-02-27 05:40:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MARA Holdings (NASDAQ: MARA) missed Q4 earnings estimates by -4009.09%, reporting EPS of $-4.52 vs. estimated $-0.11. Revenue down $12.09M.",
            "id": "953488e8-341f-47f6-8a3f-36d9663fdc3f",
            "description": "MARA Holdings (NASDAQ: MARA) released its Q4 earnings on Thursday, February 26, 2026. The company reported an EPS of $-4.52, missing estimated earnings by -4009.09% compared to the expected $-0.11. Revenue showed a decrease of $12.09 million from the previous year. In the previous quarter, MARA Holdings had exceeded expectations. For the full story, visit a financial news website.",
            "link": "https://www.markets.news/headlines/953488e8-341f-47f6-8a3f-36d9663fdc3f",
            "pub_date": "2026-02-27 05:40:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Natera reported Q4 earnings beating estimations by 172% with an EPS of $0.36 and revenue up $189.40 million.",
            "id": "d41b8e91-3505-4696-ae7e-b05d241161cc",
            "description": "Natera (NASDAQ: NTRA) revealed its Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. The report displayed impressive results with Natera surpassing estimated earnings by 172.0%, boasting an EPS of $0.36 compared to the expected $-0.5. Revenue soared by $189.40 million from the corresponding period the previous year. However, in the prior quarter, Natera fell short on EPS. For further details, the complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/d41b8e91-3505-4696-ae7e-b05d241161cc",
            "pub_date": "2026-02-27 05:40:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Prologis executives to present at Citi 2026 Global Property CEO Conference on March 2 at 11:00 a.m. ET.",
            "id": "1b6ab6d0-0c7a-4c1d-8403-99efb2252955",
            "description": "In San Francisco on February 26, 2026, Prologis, Inc. revealed that CEO Dan Letter and CFO Tim Arndt will be speaking at the Citi 2026 Global Property CEO Conference on March 2nd at 11:00 a.m. Eastern Time. Prologis is listed on NYSE under the ticker symbol PLD.",
            "link": "https://www.markets.news/headlines/1b6ab6d0-0c7a-4c1d-8403-99efb2252955",
            "pub_date": "2026-02-27 05:32:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Encompass Health (NYSE: EHC) will join Barclays Global Healthcare Conference on March 10-12, 2026 in Alabama. President & CEO Mark Tarr will attend.",
            "id": "123c1aae-8d14-4b5e-81cb-029102593f84",
            "description": "In Birmingham, Alabama, on February 26, 2026, Encompass Health Corp. (NYSE: EHC) revealed its upcoming involvement in the Barclays Global Healthcare Conference scheduled for March 10-12, 2026. Mark Tarr, the President and Chief Executive Officer of Encompass Health, along with the Executive Vice President, will be representing the company at the event.",
            "link": "https://www.markets.news/headlines/123c1aae-8d14-4b5e-81cb-029102593f84",
            "pub_date": "2026-02-27 05:32:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TXNM Energy Board declares $0.4225 per share dividend on common stock, payable on May 15, 2026.",
            "id": "9f90b9e8-6326-4b6c-a7e3-346f1ee10fe7",
            "description": "A regular meeting was held in Albuquerque, N.M. today by the Board of Directors of TXNM Energy, Inc. (NYSE: TXNM). They declared a quarterly dividend of $0.4225 per share for the company's common stock. Shareholders of record as of May 15, 2026, will be eligible to receive this dividend.",
            "link": "https://www.markets.news/headlines/9f90b9e8-6326-4b6c-a7e3-346f1ee10fe7",
            "pub_date": "2026-02-27 05:32:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novavax (Nasdaq: NVAX) to participate in TD Cowen 46th Annual Health Care Conference on March 3, 2026 at 2:30 p.m. ET.",
            "id": "22f20fcd-b59c-42ee-acc9-2c0511a2d9f5",
            "description": "Novavax, Inc. (Nasdaq: NVAX) of Gaithersburg, Maryland revealed its scheduled participation in investor conferences, including the TD Cowen 46th Annual Health Care Conference for a Fireside Chat on March 3, 2026, at 2:30 p.m. Eastern Time.",
            "link": "https://www.markets.news/headlines/22f20fcd-b59c-42ee-acc9-2c0511a2d9f5",
            "pub_date": "2026-02-27 05:32:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BNY priced public offering of $500M depositary shares representing interests in Preferred Stock.",
            "id": "0c5aa678-d42d-43f3-be10-9791569883ef",
            "description": "On February 26, 2026, The Bank of New York Mellon Corporation (BNY) disclosed the pricing details of its underwritten public offering. The offering consists of 500,000 depositary shares, with each share representing a 1/100th interest in a single share of BNY. This global financial services company is listed on the NYSE under the ticker symbol BK.",
            "link": "https://www.markets.news/headlines/0c5aa678-d42d-43f3-be10-9791569883ef",
            "pub_date": "2026-02-27 05:32:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "06f84e63-5763-44a3-ab90-77fd48eb4e21",
            "description": "HOUSE CHINA PANEL REPORTS CHINA TIES FOUND IN LATIN AMERICAN SPACE FACILITIES",
            "link": "https://www.markets.news/headlines/06f84e63-5763-44a3-ab90-77fd48eb4e21",
            "pub_date": "2026-02-27 05:34:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Progress Rail and Wabtec settle antitrust case; companies reach agreement, emphasizing benefits for both parties and consumers.",
            "id": "c4ba76a7-b9c7-4e79-ad5b-9017a3c5ccdd",
            "description": "Albertville, Alabama, and Pittsburgh - Progress Rail, a subsidiary of Caterpillar, and Wabtec Corporation (NYSE: WAB) have come to a mutual settlement in the case of Progress Rail v. Wabtec. The agreement, deemed advantageous for both entities, customers, and consumers, aims to avoid further legal proceedings that could be detrimental to all parties involved. Notably, no acknowledgment of fault is made. Both companies recognize their roles as providers of long-haul freight services.",
            "link": "https://www.markets.news/headlines/c4ba76a7-b9c7-4e79-ad5b-9017a3c5ccdd",
            "pub_date": "2026-02-27 05:35:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SolSource Solutions and TriBeam Financial launch Propel to simplify TPO solutions for residential solar and battery financing.",
            "id": "cc4b3260-aee2-416a-b2ef-52570135fe41",
            "description": "In Miami, SolSource Solutions and TriBeam Financial have unveiled Propel, a new third-party ownership (TPO) product aiming to enhance the financing of residential solar and battery systems. The collaboration merges SolSource's expertise in residential solar and storage finance with TriBeam's technology platform connecting sales channels to capital providers. Propel sets out to streamline the process, making it more transparent and accessible to consumers. This initiative represents a fresh approach to residential solar financing, proffering a user-friendly solution to leverage solar power efficiently.",
            "link": "https://www.markets.news/headlines/cc4b3260-aee2-416a-b2ef-52570135fe41",
            "pub_date": "2026-02-27 05:35:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Accelerant Holdings (NYSE: ARX) reports unaudited 2025 financial results in Atlanta, showing Q4 and full year highlights.",
            "id": "420d46cf-ae43-49a3-ba9f-bf8b2130b71c",
            "description": "Accelerant Holdings disclosed initial unaudited financial results for the fourth quarter and full year concluding on December 31, 2025. These figures are subject to change pending final audit. Accelerant Holdings trades on the New York Stock Exchange under the ticker symbol ARX.",
            "link": "https://www.markets.news/headlines/420d46cf-ae43-49a3-ba9f-bf8b2130b71c",
            "pub_date": "2026-02-27 05:35:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amplify Desmos Math program earns all-green rating from EdReports across all gateways.",
            "id": "b39c8386-50a9-4141-8cdd-c566e08b7ef7",
            "description": "Amplify's Desmos Math program, which is supported by research and focused on nurturing curiosity, has achieved top scores in all three key evaluation areas by EdReport. The program received the highest rating in all metrics, signifying its exceptional quality. This announcement was made by Amplify, a company known for creating innovative educational programs. The success of Amplify Desmos Math highlights its effectiveness and validation, further solidifying its reputation as a leading math program.",
            "link": "https://www.markets.news/headlines/b39c8386-50a9-4141-8cdd-c566e08b7ef7",
            "pub_date": "2026-02-27 05:28:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}