{
    "data": [
        {
            "title": "TP reports 2025 results with a new CEO to execute strategic plan, with top executives stepping down by March 15, 2026.",
            "id": "a858d2fa-a4ec-4d0e-bd3d-6588cd6b6935",
            "description": "In Paris, TP (Paris:TEP) has announced a new governance strategy to enhance the execution of their strategic plan. Jorge Amar, a reputable expert in AI-native customer operations on a global scale, has been appointed as Group CEO. Current executives Daniel Julien and Thomas Mackenbrock will step down from their roles, with Julien also resigning from the Board of Directors on March 15, 2026. Olivier Rigaudy, responsible for finance, will also step down as Deputy CEO. Additionally, four new members will be co-opted to the Board of Directors.",
            "link": "https://www.markets.news/headlines/a858d2fa-a4ec-4d0e-bd3d-6588cd6b6935",
            "pub_date": "2026-02-27 01:18:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ACMG celebrates 2026 Medical Genetics Awareness Week, highlighting professionals making a difference together.",
            "id": "aea1e90f-6edd-4f7f-9e1c-e4d19b5874c4",
            "description": "ACMG has announced the celebration of the 2026 Medical Genetics Awareness Week, emphasizing the theme \"Making a Difference Together\" to honor professionals in the field. The news was issued on 27-Jan-2026 by the American College of Medical Genetics and Genomics through PR Newswire. This event aims to recognize the contributions of individuals involved in medical genetics and genomics, highlighting the importance of their work. This year’s celebration will take place from [start date] to [end date], with various activities and events planned. Join us in acknowledging the vital role of these professionals in shaping the future of healthcare.",
            "link": "https://www.markets.news/headlines/aea1e90f-6edd-4f7f-9e1c-e4d19b5874c4",
            "pub_date": "2026-02-27 01:18:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Health Gorilla files Motion to Dismiss lawsuit by Epic, reaffirms commitment to interoperability for safe data exchange.",
            "id": "6de071e6-a696-4b85-bc59-56b1ba7022d3",
            "description": "In Coral Gables, Florida, Health Gorilla has taken a significant step by filing a Motion to Dismiss a lawsuit brought against them by Epic. In this legal action, Health Gorilla has emphasized its dedication to robust interoperability frameworks that facilitate the secure exchange of patient data among providers throughout the country. The Motion to Dismiss argues that the lawsuit launched by Epic is viewed as a threat to interoperability, potentially jeopardizing patient well-being and the effectiveness of healthcare services at a national level.",
            "link": "https://www.markets.news/headlines/6de071e6-a696-4b85-bc59-56b1ba7022d3",
            "pub_date": "2026-02-27 01:18:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Private premiere of Holiguards Saga held in Berlin on Feb. 16 at ASTOR Film Lounge with invited industry guests.",
            "id": "d61139b0-4147-4591-aada-28eb99ffeb8e",
            "description": "On February 16, 2026, a private premiere screening of the first installment of the Holiguards Saga franchise, titled \"The Portal of Force,\" was held at ASTOR Film Lounge Berlin. The event, held in a closed format with industry guests, marked the launch of the planned franchise.",
            "link": "https://www.markets.news/headlines/d61139b0-4147-4591-aada-28eb99ffeb8e",
            "pub_date": "2026-02-27 01:18:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1af555f5-e761-4581-bc57-0d944f7bf969",
            "description": "New York Governor Hochul sends a letter to US Treasury Secretary Bessent calling for tariff refunds.",
            "link": "https://www.markets.news/headlines/1af555f5-e761-4581-bc57-0d944f7bf969",
            "pub_date": "2026-02-27 01:18:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teladoc Health stock rises after earnings report with $642.27M sales, $521.6M access fees revenue, and $120.7M other revenue.",
            "id": "d1ae5715-e470-4226-a6a5-ed0071d81d8c",
            "description": "Teladoc Health's shares on NYSE (TDOC) rose after its recent earnings report, amidst a mixed market day. While Nasdaq was down 1.57% and S&P 500 down 0.87%, Teladoc saw positive movement possibly due to business-specific reasons. The company reported a loss of 14 cents per share versus an expected 18 cents. Sales increased to $642.27 million, beating estimates of $635.24 million. Access fees revenue dropped by 4% to $521.6 million, but other revenue surged by 24% to $120.7 million. U.S. revenue decreased by 3% to $517.3 million, while international revenue rose by 19% to $125.0 million. Integrated Care segment revenue rose by 5% to $409.1 million, while BetterHelp segment revenue fell by 7% to $233.2 million. Adjusted EBITDA climbed 12% to $83.8 million. Teladoc's management expressed positivity for the year ahead as seen by their closing remarks.",
            "link": "https://www.markets.news/headlines/d1ae5715-e470-4226-a6a5-ed0071d81d8c",
            "pub_date": "2026-02-27 01:19:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Insurance Expert Kim Lego from Saint Johns, FL gives advice on selecting insurance coverage in HelloNation article.",
            "id": "3f36d061-4df1-48dd-9d7d-4a022da847b8",
            "description": "In an article published on Feb. 26, 2026, in Saint Johns, Florida, residents were provided valuable insights on selecting the most suitable insurance coverage. The piece, by insurance expert Kim Lego, aimed to assist Saint Johns and Jacksonville residents in making informed decisions regarding their insurance needs. The ideas shared in the article sought to enhance individuals' confidence in choosing appropriate insurance plans tailored to their requirements.",
            "link": "https://www.markets.news/headlines/3f36d061-4df1-48dd-9d7d-4a022da847b8",
            "pub_date": "2026-02-27 01:20:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "454f0d1d-309b-4fe1-aaed-d421af4d5221",
            "description": "UK BETS ON LIGHTER CRYPTO RULES WITH STABLECOIN SANDBOX TRIALS – YAHOO",
            "link": "https://www.markets.news/headlines/454f0d1d-309b-4fe1-aaed-d421af4d5221",
            "pub_date": "2026-02-27 01:20:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "245ef553-caab-4c39-a307-62f99f41dc8e",
            "description": "EUROPEAN UNION'S 'OLAF' ANTI-FRAUD BODY CONFIRMS IT IS LOOKING INTO SITUATION REGARDING PETER MANDELSON",
            "link": "https://www.markets.news/headlines/245ef553-caab-4c39-a307-62f99f41dc8e",
            "pub_date": "2026-02-27 01:20:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c4a78408-7f00-4af4-828a-5360577fb88a",
            "description": "TRUMP–XI SUMMIT PREPARATIONS FALTER AS PLANNING GAPS UNSETTLE BEIJING – SCMP",
            "link": "https://www.markets.news/headlines/c4a78408-7f00-4af4-828a-5360577fb88a",
            "pub_date": "2026-02-27 01:20:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "de539580-a612-4aed-a7c2-cbff3f086363",
            "description": "TRUMP TO MEET NEW YORK CITY MAYOR MAMDANI IN WASHINGTON ON THURSDAY -REPORTS",
            "link": "https://www.markets.news/headlines/de539580-a612-4aed-a7c2-cbff3f086363",
            "pub_date": "2026-02-27 01:11:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b624988b-9854-45cd-b331-6094e9803ea9",
            "description": "Air defense forces shot down 167 Ukrainian UAVs in six hours, including 12 flying toward Moscow- The Russian Ministry of Defense",
            "link": "https://www.markets.news/headlines/b624988b-9854-45cd-b331-6094e9803ea9",
            "pub_date": "2026-02-27 01:11:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Luxury home community Ascente by Toll Brothers coming to South Reno, NV with Platinum Heights Collection.",
            "id": "95e53175-ca2a-44fe-8930-2499c6c3b41e",
            "description": "The Platinum Heights Collection at Ascente by Toll Brothers presents breathtaking views and exceptional home designs.",
            "link": "https://www.markets.news/headlines/95e53175-ca2a-44fe-8930-2499c6c3b41e",
            "pub_date": "2026-02-27 01:11:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "78fd2b23-0534-43d8-9b74-af751b72123d",
            "description": "Trifork Group wraps up buyback program in December 2026.",
            "link": "https://www.markets.news/headlines/78fd2b23-0534-43d8-9b74-af751b72123d",
            "pub_date": "2026-02-27 01:12:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NRP Group starts upscale 353-unit community in Mesa's Medina Station, part of a 60-acre plan in Arizona.",
            "id": "5908aeda-fc8c-47a2-8bed-ac95377d5d8d",
            "description": "Phoenix-based company The NRP Group has recently secured financing and initiated construction on a new upscale multifamily development in Mesa, Arizona. The development will consist of 353 apartment units and will be located within the larger Medina Station master planned community spanning 60 acres. Situated on a 10-acre plot in the northeast section of the master plan, the four-story building will feature elevator access. The project aims to provide well-designed living spaces for families in the area.",
            "link": "https://www.markets.news/headlines/5908aeda-fc8c-47a2-8bed-ac95377d5d8d",
            "pub_date": "2026-02-27 01:12:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TKF Burnside Real Estate Partners buys White Plains office property.",
            "id": "df14fa10-44a2-40ef-a80e-f77500ec9d89",
            "description": "In a recent announcement, TKF Burnside Real Estate Partners revealed the acquisition of an office property in White Plains. The move signifies a significant investment in the area's real estate market. This acquisition adds to TKF Burnside's growing portfolio of properties. The specific details regarding the property's size, value, and future plans were not disclosed. This development underscores the company's commitment to expanding its presence in the real estate sector.",
            "link": "https://www.markets.news/headlines/df14fa10-44a2-40ef-a80e-f77500ec9d89",
            "pub_date": "2026-02-27 01:12:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New: U.S. mortgage rates dip below 6%, sparking debate on impact of rate drop amidst administration's housing changes.",
            "id": "d1d8e3fe-c109-47a9-a827-25f79cd00763",
            "description": "There is mixed evidence on whether reduced rates have significantly increased activity, as the Trump administration considers implementing measures aimed at increasing housing affordability.",
            "link": "https://www.markets.news/headlines/d1d8e3fe-c109-47a9-a827-25f79cd00763",
            "pub_date": "2026-02-27 01:13:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Franco and Pietro Gussalli Beretta receive WFSA Dr. Vito Genco Shooting Ambassador Award in Nuremberg, Germany.",
            "id": "848a7d93-bbe2-4d6c-9324-12afcb5a7e87",
            "description": "In Nuremberg, Germany, on February 26, 2026, the World Forum on Shooting Activities (WFSA) awarded the prestigious Dr. Vito Genco Shooting Ambassador Award to brothers Franco Gussalli Beretta and Pietro Gussalli Beretta. This honor recognizes their outstanding contributions to the shooting sports community. Franco Gussalli Beretta was specifically mentioned for his remarkable dedication to promoting shooting activities worldwide.",
            "link": "https://www.markets.news/headlines/848a7d93-bbe2-4d6c-9324-12afcb5a7e87",
            "pub_date": "2026-02-27 01:14:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bybit EU launches 3% APY campaign in EEA for better returns on digital assets in evolving markets.",
            "id": "dbfc8aa6-2460-4e70-b564-65792f9a4950",
            "description": "Bybit EU has recently launched a temporary campaign offering a 3% annual percentage yield (APY) in response to changing market conditions and increasing investor interest in managing digital asset exposure. This campaign is open to individuals in the European Economic Area (EEA) and aims to provide structured opportunities for capital growth.",
            "link": "https://www.markets.news/headlines/dbfc8aa6-2460-4e70-b564-65792f9a4950",
            "pub_date": "2026-02-27 01:14:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eight big cats rescued from Honduras arrived safely at US sanctuaries with DHL's help, marking Honduras' first international big cat rescue mission.",
            "id": "c1cf7475-5ff2-411e-a00a-41906c98c2af",
            "description": "A group of eight large felines from Honduras, whose ongoing care requirements were no longer being fulfilled, have been successfully transported to reputable sanctuaries in the United States. The operation, organized by DHL Global Forwarding and DHL Express, marked Honduras' initial international rescue mission for big cats, with constant veterinary care provided throughout. This initiative by DHL signifies their commitment to animal welfare and further efforts are underway to ensure the successful continuation of the mission.",
            "link": "https://www.markets.news/headlines/c1cf7475-5ff2-411e-a00a-41906c98c2af",
            "pub_date": "2026-02-27 01:08:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}