{
    "data": [
        {
            "title": "",
            "id": "2b515dc1-dae8-4998-9380-19e50ddce098",
            "description": "Kallas: ‘We call on all actors for immediate de-escalation and a halt of hostilities following the sharp increase of violence in Afghanistan and Pakistan, including cross-border attacks and reported strikes over the past 24 hours, which could have serious implications for the",
            "link": "https://www.markets.news/headlines/2b515dc1-dae8-4998-9380-19e50ddce098",
            "pub_date": "2026-02-28 07:52:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "972f28a5-0efb-4c73-98d5-d8ce5b42c1d7",
            "description": "BOLIVIA NATIONAL AIRLINE BOLIVIANA SAYS EL ALTO INTERNATIONAL AIRPORT IS TEMPORARILY CLOSED AFTER PLANE CRASH",
            "link": "https://www.markets.news/headlines/972f28a5-0efb-4c73-98d5-d8ce5b42c1d7",
            "pub_date": "2026-02-28 07:52:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "996f89a8-00d3-44b6-b745-420adc340e40",
            "description": "BOLIVIA AIR FORCE PLANE CRASHES IN EL ALTO- REPORTS",
            "link": "https://www.markets.news/headlines/996f89a8-00d3-44b6-b745-420adc340e40",
            "pub_date": "2026-02-28 07:52:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d417a170-973b-46ab-853b-d3d6df19af2f",
            "description": "FIREFIGHTERS TRYING TO BRING UNDER CONTROL A TANK ABLAZE AT OIL REFINERY IN SOUTHERN RUSSIA'S KRASNODAR REGION, LOCAL OFFICIALS SAY",
            "link": "https://www.markets.news/headlines/d417a170-973b-46ab-853b-d3d6df19af2f",
            "pub_date": "2026-02-28 07:52:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "25d4514b-96e7-444a-a754-e069c6bafdff",
            "description": "U.S. STATE DEPT SAYS WASHINGTON SUPPORTS PAKISTAN'S 'RIGHT TO DEFEND ITSELF' AGAINST AFGHAN TALIBAN",
            "link": "https://www.markets.news/headlines/25d4514b-96e7-444a-a754-e069c6bafdff",
            "pub_date": "2026-02-28 07:52:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0d139b96-0a6d-4473-8312-4a2a1ab71495",
            "description": "TRUMP: IRAN WANTS TO ENRICH A LITTLE BIT, THEY DON'T NEED TO WITH SO MUCH OIL",
            "link": "https://www.markets.news/headlines/0d139b96-0a6d-4473-8312-4a2a1ab71495",
            "pub_date": "2026-02-28 07:52:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f24f1be6-fabc-4d49-aba1-bc3bc15c96e5",
            "description": "TRUMP ON IRAN: I WOULD RATHER DO IT THE PEACEFUL WAY",
            "link": "https://www.markets.news/headlines/f24f1be6-fabc-4d49-aba1-bc3bc15c96e5",
            "pub_date": "2026-02-28 07:52:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sec. of War Pete Hegseth tours L3Harris site in Camden, AR during \"Arsenal of Freedom\" tour, meets 1,500 employees.",
            "id": "ca182cb0-71c6-4298-80c7-6848451f5ba4",
            "description": "Pete Hegseth, the Secretary of War, recently visited the L3Harris Technologies site in Camden, Arkansas. The visit was part of his \"Arsenal of Freedom\" tour, focused on emphasizing the crucial role of American manufacturing in enhancing the defense industrial base and aiding U.S. and allied warfighters. During the visit, Secretary Hegseth toured multiple solid rocket motor production facilities at the site and engaged with approximately 1,500 employees responsible for designing, constructing, and providing propulsion systems. L3Harris Technologies, listed on NYSE as LHX, plays a significant role in supporting national defense efforts through its operations in Camden.",
            "link": "https://www.markets.news/headlines/ca182cb0-71c6-4298-80c7-6848451f5ba4",
            "pub_date": "2026-02-28 07:49:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "University Credit Union (UCU) receives GreenPath Growth Guru Partner Excellence Award for financial wellness impact. Los Angeles, Feb 27, 2026.",
            "id": "79818cb3-deb4-4671-9e25-098616d6b9e7",
            "description": "University Credit Union (UCU) based in Los Angeles, has received the prestigious GreenPath Growth Guru Partner Excellence Award on Feb. 27, 2026. The award acknowledges UCU's exceptional leadership in financial wellness, member impact, and strategic collaboration. This recognition showcases UCU's dedication to promoting financial well-being.",
            "link": "https://www.markets.news/headlines/79818cb3-deb4-4671-9e25-098616d6b9e7",
            "pub_date": "2026-02-28 07:37:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Survey of 1,000 U.S. hiring managers by Sunlight.com reveals 1 in 5 are less likely to hire overweight candidates, highlighting weight bias in workplace.",
            "id": "6a47c3c6-9ee3-4d66-8e35-f6c1e5f50dee",
            "description": "In Kirkland, Washington, a recent survey conducted by Sunlight.com of 1,000 U.S. hiring managers revealed widespread weight discrimination in the workplace. The survey, conducted on February 27, 2026, indicated that weight bias significantly influences decisions related to hiring, compensation, and promotions. This highlights a concerning issue affecting employment practices across the country.",
            "link": "https://www.markets.news/headlines/6a47c3c6-9ee3-4d66-8e35-f6c1e5f50dee",
            "pub_date": "2026-02-28 07:31:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brookfield Property Partners finishes 2025 annual filings with SEC and Canadian authorities, available at bpy.brookfield.com.",
            "id": "cdd62179-45d0-476e-a919-4683f9468528",
            "description": "On February 27, 2026, Brookfield Property Partners disclosed the submission of its 2025 annual report on Form 20-F, encompassing its audited financial statements for the period concluding on December 31, 2025. The submission was made to the SEC on EDGAR and to Canadian securities authorities on SEDAR+. Interested parties can access these documents at bpy.brookfield.com.",
            "link": "https://www.markets.news/headlines/cdd62179-45d0-476e-a919-4683f9468528",
            "pub_date": "2026-02-28 07:24:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jane Federoff recognized as a Pinnacle Professional Member Inner Circle of Excellence for Residential Real Estate Excellence and Client Advocacy by The Inner Circle.",
            "id": "bf5bf9f1-94fb-4b48-80a9-aaba0a2877a5",
            "description": "In Largo, Florida on February 27, 2026, Jane Federoff was recognized as a distinguished figure in The Inner Circle and honored as a Pinnacle Professional Member Inner Circle of Excellence for her exceptional performance in Residential Real Estate Excellence and Client Advocacy. Federoff's notable contributions have led to her receiving this prestigious acknowledgement.",
            "link": "https://www.markets.news/headlines/bf5bf9f1-94fb-4b48-80a9-aaba0a2877a5",
            "pub_date": "2026-02-28 07:25:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dawn Mattera Corsi recognized as a Pinnacle Professional Member Inner Circle of Excellence for empowering women over 50.",
            "id": "68d0dc35-30b4-40f2-aae8-35839dc23d5a",
            "description": "In Providence, Rhode Island on February 27, 2026, Dawn Mattera Corsi has been recognized in The Inner Circle as a distinguished Pinnacle Professional Member of the Inner Circle of Excellence. She is commended for her efforts in empowering women over the age of 50 to transform their lives through coaching, literature, and other means.",
            "link": "https://www.markets.news/headlines/68d0dc35-30b4-40f2-aae8-35839dc23d5a",
            "pub_date": "2026-02-28 07:25:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Globant S.A. filed 2025 Annual Report on Form 20-F with SEC, accessible online or via request for hard copy.",
            "id": "d9b959ab-517f-44c1-9cc4-03bf86864a3f",
            "description": "Luxembourg, Feb. 27, 2026 - Today, Globant S.A. (NYSE: GLOB), a digitally native tech services company, disclosed the filing of its 2025 Annual Report on Form 20-F with the SEC. Interested parties can access the report on the SEC's website or Globant's investor site. Shareholders may request a free hard copy of the audited financial statements from the company. Contact information for physical copy requests is available at Globant S.A., 37A Avenue J.F. Kennedy, L-1855, Luxembourg. For further details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/d9b959ab-517f-44c1-9cc4-03bf86864a3f",
            "pub_date": "2026-02-28 07:25:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Today's article highlights National Condom Month with Dr. Deb Laino advocating for safer sex practices for pleasure and connection in relationships.",
            "id": "7667ab37-e0d8-4c57-b26c-a50e01832fb5",
            "description": "In Philadelphia, sex and relationship therapist Dr. Deb Laino is promoting safer sex practices during National Condom Month. Emphasizing the importance of emotional and relational benefits, particularly for young adults. Dr. Laino highlights that condoms go beyond protection, fostering security and alignment with your partner. As discussions on consent and sexual wellness progress, she stresses that condoms facilitate a mutual sense of responsibility.",
            "link": "https://www.markets.news/headlines/7667ab37-e0d8-4c57-b26c-a50e01832fb5",
            "pub_date": "2026-02-28 07:03:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frontier Lithium discusses participation in key industry events & announces Q3 financial results. Key events include Precious Metals & Critical Minerals Virtual Investor Conference, BMO Global Metals Conference. Focus on lithium demand, US Gov support, and exploration partnerships. Will attend PDAC 2026. Q3 ended with $12 million in funds. ",
            "id": "939d35d2-68a5-4b9a-9a09-e98cd7bdc530",
            "description": "Frontier Lithium Inc. recently participated in key industry events to promote its investment-ready lithium assets, presenting at conferences in the U.S. and Europe. The company highlighted the growing demand for energy storage and concerns over reliance on Chinese supply, with discussions emphasizing national security and capital access as key challenges. Frontier attended conferences in Florida, and Europe, including engagements in Rome, Munich, and Paris. They reaffirmed their commitment to safe, sustainable, and long-term development to support North American and European battery supply chains. The company will also be exhibiting at the Prospectors & Developers Association of Canada (PDAC) 2026 Convention in Toronto. The third quarter financial results for the company showed a closing of $12 million.",
            "link": "https://www.markets.news/headlines/939d35d2-68a5-4b9a-9a09-e98cd7bdc530",
            "pub_date": "2026-02-28 07:05:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "muVpix completes production of live-action series \"Swipe Left: Dying for Love\" for vertical storytelling.",
            "id": "7f8ad01d-dc11-4d26-bc1f-e99ad13e89d2",
            "description": "The latest original series, Swipe Left: Dying for Love, has completed production via muVpix, the American vertical storytelling platform under BlackForge Distribution. The live-action romantic thriller is tailored for the fast-growing vertical format. This release comes from Los Angeles on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/7f8ad01d-dc11-4d26-bc1f-e99ad13e89d2",
            "pub_date": "2026-02-28 06:56:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equity Residential to join Citi 2026 Global Property CEO Conf on March 3. CEO Mark Parrell to speak at 11am ET. Webcast available on company site.",
            "id": "e2d11d27-2050-4798-8e60-44182833edb4",
            "description": "Equity Residential (EQR) shared that key senior management, such as President and CEO Mark J. Parrell, will partake in a roundtable discussion at the Citi 2026 Global Property CEO Conference on March 3, 2026, at 11:00 a.m. ET. The occurrence will be live-streamed, with the webcast link accessible in the Investor section of the company's website at www.equityapartment.",
            "link": "https://www.markets.news/headlines/e2d11d27-2050-4798-8e60-44182833edb4",
            "pub_date": "2026-02-28 06:57:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA approves YUVIWEL for kids with Achondroplasia. Once-weekly treatment to increase growth. Developed by Ascendis Pharma.",
            "id": "898489bc-8a17-45e8-af45-b06d2378a161",
            "description": "Today, Ascendis Pharma A/S (Nasdaq: ASND) disclosed that the U.S. Food & Drug Administration (FDA) has given approval for YUVIWEL ® (navepegritide; previously known as TransCon ® CNP) under the FDA’s Accelerated Approval Program. This marks the first once-weekly treatment sanctioned to enhance linear growth in children aged 2 and above with achondroplasia having open epiphyses. YUVIWEL ® is distinguished as the sole treatment offering consistent systemic exposure to CNP throughout the weekly dosing period. The approval, which was supported by enhanced annualized growth velocity (AGV), is subject to confirmation and detailing of clinical benefit in future trial(s).",
            "link": "https://www.markets.news/headlines/898489bc-8a17-45e8-af45-b06d2378a161",
            "pub_date": "2026-02-28 06:58:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wellness Workdays announces 2026 conference with leading experts in wellness, safety, psychology, leadership. ",
            "id": "939d8fb0-dbd7-464f-b813-a7cea1ef060f",
            "description": "The upcoming 13th Annual Emerging Trends in Workplace Wellness Conference, set to take place in Boston on February 27, 2026, will showcase prominent figures in the field of workplace wellness. The event will focus on various topics including construction safety, positive psychology, leadership, and organizational performance. Wellness Workdays, a notable provider of workplace wellness solutions, is hosting the conference. This event is expected to draw a significant number of attendees seeking insights and expertise in these crucial areas.",
            "link": "https://www.markets.news/headlines/939d8fb0-dbd7-464f-b813-a7cea1ef060f",
            "pub_date": "2026-02-28 06:52:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}