{
    "data": [
        {
            "title": "FLSmidth finishes buy-back program.",
            "id": "76950df6-f81e-4338-aac4-00097099e86c",
            "description": "A recent report reveals that the global economy is projected to grow at a rate of 4.1% in the upcoming year. This growth is primarily driven by emerging markets, which are expected to increase by 6.5%, while advanced economies are projected to grow by 2.4%. The main contributors to this growth are industries such as technology, healthcare, and renewable energy. However, there are concerns over inflation, with the forecast showing a 5.8% increase globally. These figures indicate a positive outlook for the global economy in the coming year, with emerging markets leading the way in economic expansion.",
            "link": "https://www.markets.news/headlines/76950df6-f81e-4338-aac4-00097099e86c",
            "pub_date": "2026-02-28 00:32:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d540b743-e243-48d9-b9a1-f220eede72c6",
            "description": "BRITAIN'S FTSE 100 UP 0.7%; GERMANY'S DAX UP 0.09%",
            "link": "https://www.markets.news/headlines/d540b743-e243-48d9-b9a1-f220eede72c6",
            "pub_date": "2026-02-28 00:32:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client creates Safe Release Gun Holster (MBQ-983) in Jersey City, N.J., to prevent unwanted releases of the weapon.",
            "id": "f836099b-07cb-4f53-84a0-9e4c25f336a2",
            "description": "In Pittsburgh on February 27, 2026, a creator from Jersey City, N.J., discussed their innovation of a customized gun holster aimed at averting accidental weapon discharges. The inventor introduced the SAFE RELEASE GUN HOLSTER, which enhances the secure release of a gun to minimize the risk of unexpected firing incidents.",
            "link": "https://www.markets.news/headlines/f836099b-07cb-4f53-84a0-9e4c25f336a2",
            "pub_date": "2026-02-28 00:32:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GOFO partners with QLS to enhance e-commerce logistics in the Netherlands amid growing volumes.",
            "id": "64be1455-ef4c-4abe-9728-043d496faa77",
            "description": "In Amsterdam on February 27, 2026, GOFO, a rapidly expanding last-mile delivery service operating in the Netherlands, announced a strategic alliance with QLS, a prominent Dutch logistics and fulfillment expert, in response to the increasing e-commerce traffic. This partnership aims to capitalize on the rising e-commerce trends by combining the strengths of both companies in providing efficient delivery services. The move highlights the significant growth in e-commerce activities and signifies the companies' commitment to enhancing last-mile delivery capabilities in the competitive market.",
            "link": "https://www.markets.news/headlines/64be1455-ef4c-4abe-9728-043d496faa77",
            "pub_date": "2026-02-28 00:32:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "62f97cbf-ba75-4700-8dda-53b388b0ad3d",
            "description": "INDIA, EU TO BAR NEW IMPORT-EXPORT CURBS BEYOND WTO RULES, SCRAP CONSULAR REQUIREMENTS UNDER PROPOSED FTA GOODS PACT - REPORTS",
            "link": "https://www.markets.news/headlines/62f97cbf-ba75-4700-8dda-53b388b0ad3d",
            "pub_date": "2026-02-28 00:33:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "06538326-b038-482b-9303-cccee67b158a",
            "description": "FRANCE'S CAC 40 DOWN 0.23%; SPAIN'S IBEX DOWN 0.63%",
            "link": "https://www.markets.news/headlines/06538326-b038-482b-9303-cccee67b158a",
            "pub_date": "2026-02-28 00:33:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0546bafe-fc94-4eed-8a21-995e11ddf1cc",
            "description": "INDIA-EU TO GRANT MOST-FAVOURED-NATION TREATMENT FOR FIVE YEARS AFTER PACT ENTERS INTO FORCE -REPORTS",
            "link": "https://www.markets.news/headlines/0546bafe-fc94-4eed-8a21-995e11ddf1cc",
            "pub_date": "2026-02-28 00:34:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Groundbreaking Omnis Quantum Reformer technology completes successful year-long testing at Pleasants Power Station in West Virginia. #HydrogenFuel",
            "id": "d19a5899-d94a-4eec-adfa-058efdf61fca",
            "description": "In West Virginia's Pleasants County, Quantum Pleasants made a significant announcement on Feb. 27, 2026, revealing the successful completion of a one-year assessment of their groundbreaking Omnis Quantum Reformer® (\"OQR®\") technology at the Pleasants Power Station. This achievement marks a key milestone for the company as they showcased the capabilities of their innovative technology in a real-world setting.",
            "link": "https://www.markets.news/headlines/d19a5899-d94a-4eec-adfa-058efdf61fca",
            "pub_date": "2026-02-28 00:26:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "$839B Pentagon funding for 2026 approved by Congress, $8B more than requested; focus on space, missiles.",
            "id": "c2e69d04-c4ca-417f-93d9-e7d29aae48c1",
            "description": "Starfighters Space, representing VANCOUVER, BC, disclosed on Feb. 27, 2026, that Congress has sanctioned $839 billion in Pentagon funding for the fiscal year 2026. This amount exceeds the Department of Defense's original request by $8 billion. A significant portion of this sum has been allocated for space and missile programs.",
            "link": "https://www.markets.news/headlines/c2e69d04-c4ca-417f-93d9-e7d29aae48c1",
            "pub_date": "2026-02-28 00:26:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Erik Castaneda joins Stateside Associates as VP of Attorneys General & State Issues Practices, enhancing the company's government relations team.",
            "id": "714b9d49-ad98-41df-b130-9fd28c9471a6",
            "description": "On February 26, 2026, in Washington, Stateside Associates, a leading state and local government relations firm, revealed that Erik Castaneda has been appointed as the Vice President of Attorneys General & State Issues Practices. Castaneda will be responsible for overseeing the company's operations in this realm, bringing his expertise to support their initiatives.",
            "link": "https://www.markets.news/headlines/714b9d49-ad98-41df-b130-9fd28c9471a6",
            "pub_date": "2026-02-28 00:26:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cipla launches generic Saxenda (Liraglutide Injection) in US after Orbicular receives ANDA approval, Feb 27, 2026.",
            "id": "99ef625e-21e0-4532-8063-620fe71cd37e",
            "description": "In a recent development, Cipla, a leading pharmaceutical company, announced that its subsidiary Cipla USA Inc. has received approval from the US Food and Drug Administration (USFDA) for its Abbreviated New Drug Application (ANDA) for Liraglutide Injection. The approval was granted on February 27, 2026. Cipla Limited, listed on the Bombay Stock Exchange (BSE: 500087) and the National Stock Exchange (NSE: CIPLA), shared this significant achievement. The subsidiary, Orbicular, will be responsible for the distribution and marketing of the newly approved product in the United States. This approval opens up new opportunities for Cipla in the pharmaceutical market, showcasing their commitment to innovation and expansion.",
            "link": "https://www.markets.news/headlines/99ef625e-21e0-4532-8063-620fe71cd37e",
            "pub_date": "2026-02-28 00:30:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "International Petroleum Corporation announces share capital update per Swedish Financial Instruments Trading Act.",
            "id": "ebbe754b-83f1-48e5-98a5-a7986609596e",
            "description": "On February 27, 2026, in Toronto, International Petroleum Corporation (IPC), also known as the Corporation, disclosed information in compliance with the Swedish Financial Instruments Trading Act. The stock is traded on the Toronto Stock Exchange (TSX) and Nasdaq Stockholm under the ticker symbol IPCO.",
            "link": "https://www.markets.news/headlines/ebbe754b-83f1-48e5-98a5-a7986609596e",
            "pub_date": "2026-02-28 00:31:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7cad500d-4b6b-4ecc-ae3a-eea9cf805dfd",
            "description": "Sanoma Corporation buys back shares on 27/02/2026.",
            "link": "https://www.markets.news/headlines/7cad500d-4b6b-4ecc-ae3a-eea9cf805dfd",
            "pub_date": "2026-02-28 00:31:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI is reshaping crypto for the next bull run, focusing on trust & regulation. AI detects fraud, manages risk, and aids adoption. AI reduces operational complexity, accelerating adoption as a financial service. Regulators can enforce compliance effectively at scale.",
            "id": "a549fad6-25e0-45c4-8739-eea5f8c7d9b0",
            "description": "The article discusses how the traditional cycles of the crypto market may be shifting, with artificial intelligence (AI) playing a key role in reshaping trust, regulation, and market risk. AI is being increasingly used as an infrastructure layer in the crypto industry to monitor activity, control automated decisions, and enhance user safety in transactions. This adoption of AI is seen as crucial in reducing operational risks such as fraud and protocol exploits. Platforms like Aurum are prioritizing AI-driven controls to enhance trust and facilitate advanced automation. The CEO of Aurum emphasized the importance of trust in driving growth and highlighted the role of AI in fraud detection, compliance, and risk management. The article also mentions how AI can help in reducing friction in crypto transactions, leading to increased adoption by institutions and retail investors. Furthermore, AI is transforming regulatory oversight, making it continuous and proactive rather than reactive. Overall, the integration of AI in the crypto industry could potentially lead to significant changes in how the market operates.",
            "link": "https://www.markets.news/headlines/a549fad6-25e0-45c4-8739-eea5f8c7d9b0",
            "pub_date": "2026-02-28 00:21:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4bd4f1a7-b0c2-4c26-a5ae-a5d2896c5d76",
            "description": "TRUMP FACES 2,000 TARIFF LAWSUITS FOLLOWING SUPREME COURT LOSS After the US Supreme Court ruled most tariffs illegal, lawsuits against Donald Trump’s policy have surged past 2,000, with major firms like FedEx and L'Oréal joining smaller businesses. At stake is over $170 billion",
            "link": "https://www.markets.news/headlines/4bd4f1a7-b0c2-4c26-a5ae-a5d2896c5d76",
            "pub_date": "2026-02-28 00:22:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2c50f43d-a3eb-421a-ac8b-64d2e9e5179f",
            "description": "OPENAI'S NICK TURLEY: CHATGPT JUST CROSSED 900M WEEKLY USERS AND 50M PAYING SUBSCRIBERS - X POST",
            "link": "https://www.markets.news/headlines/2c50f43d-a3eb-421a-ac8b-64d2e9e5179f",
            "pub_date": "2026-02-28 00:23:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deep Fission to hold public meeting in Parsons, Kansas on March 12 from 5-7pm CT to discuss advanced nuclear energy.",
            "id": "9b0f7aa1-e732-4bb5-9651-247135ac6fba",
            "description": "Deep Fission, Inc., an innovative nuclear energy company, will hold a public meeting in Parsons, Kansas on Thursday, March 12, from 5:00–7:00 p.m. CT. The event will be at the Wall Event Center, 2605 Main St., Parsons, KS 67357. Deep Fission aims to install small modular pressurized water reactors one mile underground. Community members are welcome to attend the meeting to gain insights into the project, raise queries, and engage with company representatives.",
            "link": "https://www.markets.news/headlines/9b0f7aa1-e732-4bb5-9651-247135ac6fba",
            "pub_date": "2026-02-28 00:24:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New guide released for GitHub Copilot CLI as it becomes generally available for paid subscribers in Feb 2026.",
            "id": "699897a3-376d-47ee-b8b0-8b6fc445812e",
            "description": "In February 2026, GitHub made available a practical guide for the Copilot CLI, the AI coding assistant, upon its general availability to all paid subscribers. This guide aims to assist users in effectively utilizing the Copilot CLI tool.",
            "link": "https://www.markets.news/headlines/699897a3-376d-47ee-b8b0-8b6fc445812e",
            "pub_date": "2026-02-28 00:24:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Inventor from Vallejo creates GREEN HAVEN bathroom product for dogs to feel comfortable; released on Feb. 27, 2026.",
            "id": "69262ba9-97c0-4a0f-b9fc-0bacde56d53d",
            "description": "An inventor from Vallejo, California, shared their motivation behind creating a new bathroom solution for dogs in Pittsburgh on February 27, 2026. Their innovation, known as the GREEN HAVEN, is crafted to provide a welcoming environment for dogs during their bathroom breaks. This product aims to offer dogs a comfortable space, resembling a haven, while attending to their needs.",
            "link": "https://www.markets.news/headlines/69262ba9-97c0-4a0f-b9fc-0bacde56d53d",
            "pub_date": "2026-02-28 00:16:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock market down for week, major indexes below 50-day lines. Nvidia tumbles despite strong earnings.",
            "id": "f135b720-01d2-480c-b8dd-283e1dacff62",
            "description": "During the week, the stock market experienced a decline, with all major indexes falling below their 50-day moving averages. Despite posting strong earnings, Nvidia saw a significant drop in its stock price. The overall market sentiment was negative due to concerns regarding artificial intelligence. This resulted in a challenging week for investors, with the stock market unable to sustain key levels. Overall, it was a difficult week with notable declines in major indexes and specific stocks like Nvidia.",
            "link": "https://www.markets.news/headlines/f135b720-01d2-480c-b8dd-283e1dacff62",
            "pub_date": "2026-02-28 00:17:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}