{
    "data": [
        {
            "title": "",
            "id": "c1e45706-1fb1-4d38-a7ed-e88f32b17d39",
            "description": "PEMEX 4Q NET LOSS MXN155.2M  4Q OPER INCOME MXN20.27B  4Q REV. MXN362.45B",
            "link": "https://www.markets.news/headlines/c1e45706-1fb1-4d38-a7ed-e88f32b17d39",
            "pub_date": "2026-02-27 23:43:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "705e2c2a-71c5-4731-9b87-e6a5062f701a",
            "description": "Josh Gottheimer has reported additional stock transactions involving UBER, NOW, GILD, SNDR, NSRGY, and one more company.",
            "link": "https://www.markets.news/headlines/705e2c2a-71c5-4731-9b87-e6a5062f701a",
            "pub_date": "2026-02-27 23:45:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin has dropped 26% in a month, but large wallet holders are increasing, nearing 20,000 with 100 BTC each, valued at $6.78 million per wallet, signaling accumulation by big players.",
            "id": "ce401619-65ec-422a-a47b-508e3e8b3605",
            "description": "Bitcoin (CRYPTO: BTC) has experienced a 26% decrease in value in the last month, however, on-chain data indicates a continuous increase in the number of large wallet holders which is often associated with accumulation phases. The number of wallets containing at least 100 BTC is nearing 20,000, with each wallet holding around $6.78 million at current prices according to Santiment data. These wallets are typically connected to wealthy individuals, funds, long-term holders, or institutions. The rise in the number of wallets holding 100+ BTC during a price decline is seen as a positive sign, suggesting that major players are accumulating assets.",
            "link": "https://www.markets.news/headlines/ce401619-65ec-422a-a47b-508e3e8b3605",
            "pub_date": "2026-02-27 23:45:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Poposoap's campaign for World Wildlife Day aims to transform backyards into wildlife-friendly spaces, starting March 3.",
            "id": "14c9b4dd-cd6f-4a91-8d2f-d7df06f016f1",
            "description": "On February 27, 2026, Poposoap announced a new campaign in honor of World Wildlife Day on March 3. The initiative aims to transform backyards into easy-to-maintain wildlife-friendly spaces. With a focus on starting conservation efforts at home, the campaign encourages people to create habitats that support local wildlife. This initiative underlines the idea that small steps in individual backyards can collectively make a significant impact on global biodiversity.",
            "link": "https://www.markets.news/headlines/14c9b4dd-cd6f-4a91-8d2f-d7df06f016f1",
            "pub_date": "2026-02-27 23:31:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Venture Global signs 20-year deal with Hanwha Aerospace to supply 1.5 MTPA of LNG from 2030, expanding global market presence.",
            "id": "6164e893-872f-4fab-acbb-13f786db4e82",
            "description": "Shares of Venture Global (NYSE: VG) are on the rise on Friday morning after the company announced a new 20-year partnership with Hanwha Aerospace. This marks their first collaboration with a Korean entity and is aimed at enhancing their LNG supply capabilities in Asia. The agreement involves the purchase of 1.5 million tonnes per annum (MTPA) of U.S. liquefied natural gas starting in 2030. This deal, expected to bolster Venture Global's presence in the global energy market, brings their long-term contracted portfolio to over 46 MTPA. CEO Mike Sabel expressed enthusiasm for the partnership, citing the importance of reliable, low-cost American LNG to address the increasing global energy demand and fortify strategic energy alliances. This move comes as Venture Global stock faces downward pressure, prompting speculation on its future performance.",
            "link": "https://www.markets.news/headlines/6164e893-872f-4fab-acbb-13f786db4e82",
            "pub_date": "2026-02-27 23:32:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1f351c47-ccd3-40bd-ae8c-2471089ed944",
            "description": "SENATE DEMS RAMP UP PRESSURE FOR TARIFF REFUNDS - PUNCHBOWL",
            "link": "https://www.markets.news/headlines/1f351c47-ccd3-40bd-ae8c-2471089ed944",
            "pub_date": "2026-02-27 23:32:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "35ed51b5-595d-43d5-b8b9-e3d6df1a512b",
            "description": "U.S. STATE DEPARTMENT: SECRETARY OF STATE RUBIO WILL TRAVEL TO ISRAEL FROM MARCH 2-3, WILL DISCUSS IRAN, LEBANON AND GAZA",
            "link": "https://www.markets.news/headlines/35ed51b5-595d-43d5-b8b9-e3d6df1a512b",
            "pub_date": "2026-02-27 23:35:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "10af7485-e6bb-47d7-98b9-8fb155576b1f",
            "description": "5.0 MAG. EARTHQUAKE 61 KM NNW OF HIRARA JAPAN - USGS",
            "link": "https://www.markets.news/headlines/10af7485-e6bb-47d7-98b9-8fb155576b1f",
            "pub_date": "2026-02-27 23:36:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CarMax introduces CarMax App in ChatGPT, offering nationwide inventory and online offers through OpenAI.",
            "id": "362f7c13-d56e-4db2-87bd-c7b8ed5056c7",
            "description": "An extensive retailer is expanding its services by integrating nationwide inventory and online offer functions with OpenAI through the launch of the latest CarMax App on ChatGPT. This development will allow customers to access a wide range of products from various locations across the country and make online offers conveniently.",
            "link": "https://www.markets.news/headlines/362f7c13-d56e-4db2-87bd-c7b8ed5056c7",
            "pub_date": "2026-02-27 23:37:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Real estate expert Terri Ditty of Lake Ariel discusses Poconos market trends, focusing on inventory, mortgage rates, and community rules.",
            "id": "14a1a5b9-a6a6-4f50-be2d-a52d155c5865",
            "description": "In Lake Ariel, Pennsylvania, on February 27, 2026, a recent article suggests that buyers and sellers in the Poconos real estate market should focus on key factors to make informed decisions. These include property inventory, mortgage rates, and community rules. By analyzing these aspects carefully, individuals can navigate the fast-paced market effectively. This advice aims to help stakeholders stay ahead in a market that is subject to rapid changes and fluctuations.",
            "link": "https://www.markets.news/headlines/14a1a5b9-a6a6-4f50-be2d-a52d155c5865",
            "pub_date": "2026-02-27 23:37:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gallant partners with MWI Animal Health to deliver FDA-approved stem cell therapy to veterinary clinics.",
            "id": "40de570f-d5f9-45c9-a6cd-45033da2f165",
            "description": "In a recent development, a groundbreaking agreement has been reached to create the initial ultra-low temperature cold chain system in the field of veterinary medicine. This innovation comes in anticipation of potentially securing the first FDA approval for an off-the-shelf stem cell therapy. The company at the forefront of this advancement, Gallant, is an animal health biotechnology firm based in San Diego. The deal marks a significant milestone in the industry and is poised to revolutionize veterinary care. Stay tuned for updates as this exciting initiative progresses.",
            "link": "https://www.markets.news/headlines/40de570f-d5f9-45c9-a6cd-45033da2f165",
            "pub_date": "2026-02-27 23:40:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stanford study shows Reading Intervention by Lindamood-Bell improves reading skills and rewires dyslexic brain. Published in Nature Communications.",
            "id": "8183d48b-3498-48ba-a640-492d209540a7",
            "description": "A recent peer-reviewed study, published in Nature Communications, has validated the effectiveness of Lindamood-Bell's Seeing Stars® program in enhancing reading abilities and reinforcing neural connections in children diagnosed with dyslexia. Conducted in San Luis Obispo, California, the research showcased significant improvements in reading skills and brain circuitry strength among participants. This study, spearheaded by Stanford University researchers, was conducted on a notable number of children with dyslexia, highlighting the program's success in aiding this demographic.",
            "link": "https://www.markets.news/headlines/8183d48b-3498-48ba-a640-492d209540a7",
            "pub_date": "2026-02-27 23:40:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ademi Firm investigating if European Wax Center is obtaining a fair price for public shareholders in the transaction with Searchlight Capital Partners and Abry Partners. ",
            "id": "1b687412-52d3-46f0-a4bd-7b465d4bd7ca",
            "description": "Milwaukee, on February 27th, 2026 - Ademi LLP is currently looking into European Wax Center (NASDAQ: EWCZ) for potential breaches of fiduciary duty and other legal violations surrounding its latest deal with Searchlight Capital Partners and Abry Partners. To find out more about this investigation and how to...",
            "link": "https://www.markets.news/headlines/1b687412-52d3-46f0-a4bd-7b465d4bd7ca",
            "pub_date": "2026-02-27 23:27:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f654bd41-804a-4078-ace0-6b16972f62ad",
            "description": "ISS: 'A Dragon splashed down off the coast of California at 11:44pm PST on Thursday returning thousands of pounds of science experiments and station hardware.'",
            "link": "https://www.markets.news/headlines/f654bd41-804a-4078-ace0-6b16972f62ad",
            "pub_date": "2026-02-27 23:27:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flam appoints Noriyuki Imai as Head of Agency Partnerships in Japan, with 20 years of experience in AdTech.",
            "id": "ca3a3787-cf4f-4b9d-b4a6-52b34aa0cb6f",
            "description": "In San Francisco, Flam, a deep-tech startup specializing in AI-native content, has named Noriyuki Imai as the Head of Agency Partnerships for Japan. With more than 20 years of experience in commercial leadership, Noriyuki has a proven track record in launching, expanding, and establishing global AdTech, MarTech, and SaaS platforms in Japan. He has been instrumental in market entry, forming strategic partnerships, and driving revenue growth for leading companies such as LiveRamp, Yahoo! Ad Exchange, MediaMath, and Sizm.",
            "link": "https://www.markets.news/headlines/ca3a3787-cf4f-4b9d-b4a6-52b34aa0cb6f",
            "pub_date": "2026-02-27 23:28:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysts predict Bitcoin hitting lows between $30K and $45K in late 2026 amidst bear market extension. Exchange reserves rise.",
            "id": "c573d4c2-9e03-4069-80fd-7aeddbca39b8",
            "description": "Many experts are predicting that Bitcoin will continue its bear market until late 2026. During this time, the cryptocurrency is expected to reach cycle lows ranging from $30,000 to $45,000. This trend is supported by the increasing reserves on exchanges.",
            "link": "https://www.markets.news/headlines/c573d4c2-9e03-4069-80fd-7aeddbca39b8",
            "pub_date": "2026-02-27 23:29:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GitHub and Codio join forces to extend GitHub Classroom benefits to Codio's advanced CS learning platform as exclusive commercial partners on Feb 25, 2026.",
            "id": "77a77814-efb3-498c-8fe9-c4d1e046a2ec",
            "description": "GitHub has chosen Codio as its sole commercial partner to expand the benefits of GitHub Classroom to Codio's advanced computer science learning platform. The news was announced on 25-Feb-2026 and released by Codio through PR Newswire. This partnership aims to enhance the use of GitHub Classroom features on Codio's platform, providing students and educators with a more robust learning experience. This collaboration signifies a significant milestone for both companies, as they strive to revolutionize computer science education.",
            "link": "https://www.markets.news/headlines/77a77814-efb3-498c-8fe9-c4d1e046a2ec",
            "pub_date": "2026-02-27 23:29:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Billionaire investors bet on Block as Jack Dorsey announces cutting 40% of workforce; stock up 17% to $63.90/share.",
            "id": "b3abc525-3df1-4f86-9e92-8296a8091f1d",
            "description": "Prominent billionaire investors were already showing interest in Block Inc (NYSE: XYZ) before CEO Jack Dorsey's recent announcement. The company's shares skyrocketed by approximately 20% in premarket trading following the news that they will be slashing almost 4,000 jobs, amounting to about 40% of their workforce. This move is aimed at restructuring the company to focus more on artificial intelligence, making it more streamlined and efficient. The stock is currently performing well, surging over 17% and trading at about $63.90 per share, recovering from a previous double-digit year-to-date decline. Dorsey's new strategy marks a significant shift in the company's operational approach. In the previous quarter, top investment firms like ARK Investment Management, headed by Cathie Wood, increased their share in Block by more than 26%, owning about 3.4 million shares. Similarly, Tiger Global Management, managed by Chase Coleman, upped its stake by almost 44%, possessing around 6.4 million shares. These moves by influential investors highlight their confidence in Block's potential, especially as the company focuses on platform businesses with operational efficiency.",
            "link": "https://www.markets.news/headlines/b3abc525-3df1-4f86-9e92-8296a8091f1d",
            "pub_date": "2026-02-27 23:29:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Caesars Entertainment stock rising on takeover interest, with offers including from Tilman Fertitta. Quarterly revenue $2.92 billion.",
            "id": "cb3ce972-f777-402a-92f8-e5dc01eef796",
            "description": "Shares of Caesars Entertainment Inc (NASDAQ: CZR) are on the rise due to ongoing takeover talks, with interest from billionaire Tilman Fertitta and discussions surrounding a potential management-led buyout. The stock is currently consolidating as potential offers are being reviewed, including one from Fertitta Entertainment, owner of the Golden Nugget casino brand. Additionally, Caesars is considering an internal management-led buyout to retain current leadership. The company's improving operating metrics also contribute to the takeover speculation, following its recent quarterly revenue report of $2.92 billion, slightly exceeding expectations and marking an increase from $2.8 billion the previous year. Same-store adjusted EBITDA has risen to $901 million from $882 million, demonstrating strong cash flow generation. This news is detailed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/cb3ce972-f777-402a-92f8-e5dc01eef796",
            "pub_date": "2026-02-27 23:31:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Surgical Simulation Market to reach $349.4M by 2030, growing at 14.7% CAGR from $176.0M in 2025.",
            "id": "4391c10f-e9bc-4733-a007-e5b03f1798de",
            "description": "A report from a leading market research firm projects that the Surgical Simulation Market in Delray Beach, Fla. is expected to increase from USD 176.0 million in 2025 to USD 349.4 million by 2030, showing a Compound Annual Growth Rate (CAGR) of 14.7%. The report includes analysis across 300 market data tables and 50 figures spread throughout the analysis.",
            "link": "https://www.markets.news/headlines/4391c10f-e9bc-4733-a007-e5b03f1798de",
            "pub_date": "2026-02-27 23:31:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}