{
    "data": [
        {
            "title": "MongoDB (MDB) set to report EPS of $0.92 on 2026-03-02. Previous quarter saw EPS beat of $1.06, leading to 22.23% share price increase. Shares currently at $336.61, up 29.96% over 52 weeks. Investors hopeful for positive guidance.",
            "id": "a7acef95-ac99-42ca-ade3-4cf141ac4b4b",
            "description": "MongoDB (NASDAQ: MDB) is scheduled to release its quarterly earnings report on Monday, March 2, 2026. Analysts are projecting an earnings per share (EPS) of $0.92 for MongoDB. Investors are eager for the announcement, anticipating the company to exceed expectations and offer positive guidance for the upcoming quarter. It's crucial for new investors to recognize that guidance can heavily influence stock prices. In the previous quarter, MongoDB surpassed expectations by $1.06, resulting in a 22.23% rise in share price the following day. Looking at the historical performance, in Q3 2026, Q2 2026, Q1 2026, and Q4 2025, the EPS estimates and actual figures were as follows: 0.26/1.32, 0.14/1.00, 0.66/1.00, and 0.67/1.28 respectively, with price changes of 22.23%, 37.96%, 12.84%, and -26.94%. As of February 26, MongoDB shares were trading at $336.61, reflecting a 29.96% increase over the past year. For more details, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/a7acef95-ac99-42ca-ade3-4cf141ac4b4b",
            "pub_date": "2026-02-27 22:19:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Credo Technology Group to report EPS of $0.84 on March 2, 2026. Past earnings beat by $0.25 led to 10.12% stock increase. Trading at $114.48.",
            "id": "23d9f58a-66ac-4714-9a83-e0a536736407",
            "description": "Credo Technology Group (NASDAQ: CRDO) is set to release its quarterly earnings report on March 2, 2026, with analysts expecting an EPS of $0.84. In the previous quarter, the company exceeded expectations by $0.25, resulting in a 10.12% increase in share price the following day. The stock was trading at $114.48 as of February 26. Investors are eagerly awaiting the announcement, hoping for positive guidance for the next quarter, as future projections heavily impact stock prices. It's important for new investors to consider these projections rather than just past performance.",
            "link": "https://www.markets.news/headlines/23d9f58a-66ac-4714-9a83-e0a536736407",
            "pub_date": "2026-02-27 22:19:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AST SpaceMobile (NASDAQ: ASTS) to report $-0.19 EPS on 2026-03-02, investors watch for guidance. Shares at $85.76 on 26 Feb.",
            "id": "58e72d89-7295-4c57-ab5c-ee03dbfaa656",
            "description": "AST SpaceMobile (NASDAQ: ASTS) is scheduled to release its latest quarterly earnings report on March 2, 2026. Analysts predict an EPS of $-0.19 for the company. Investors are eager to see if AST SpaceMobile will surpass this estimate and offer positive guidance for the upcoming quarter. The company's previous earnings report showed an EPS miss of $0.22, resulting in a 1.18% share price drop. In the last four quarters, AST SpaceMobile has frequently missed EPS estimates, impacting its stock price. Despite this, the company's shares were trading at $85.76 on February 26. The upcoming earnings report will be crucial for investors and could influence the stock's performance moving forward.",
            "link": "https://www.markets.news/headlines/58e72d89-7295-4c57-ab5c-ee03dbfaa656",
            "pub_date": "2026-02-27 22:19:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kaspi.kz (NASDAQ: KSPI) to report earnings of $3.10 per share on 2026-03-02. Past misses led to price increases. Stock down 30.85% in 52 weeks.",
            "id": "274fd6a0-a504-42d4-bd84-af53758bf3a3",
            "description": "Kaspi.kz is set to release its quarterly earnings on March 2, 2026, with analysts expecting an EPS of $3.10. The company aims to surpass this estimate and provide positive guidance for future growth. In the previous quarter, Kaspi.kz missed its EPS estimate by $1.58, resulting in a 1.83% increase in share price the next day. The stock was trading at $71.29 on February 26, marking a 30.85% decrease over the past 52 weeks. Investors should focus not only on earnings beat/miss but also on forecasted guidance, as it can significantly impact stock prices. Full details are available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/274fd6a0-a504-42d4-bd84-af53758bf3a3",
            "pub_date": "2026-02-27 22:19:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "98b3cdc8-5417-4c8f-9435-07ed9ef37121",
            "description": "OPENAI’S ALTMAN TELLS STAFF GOING TO SEE IF THERE IS A DEAL WITH THE DOW THAT ALLOWS OUR MODELS TO BE DEPLOYED IN CLASSIFIED ENVIRONMENTS - REPORTS",
            "link": "https://www.markets.news/headlines/98b3cdc8-5417-4c8f-9435-07ed9ef37121",
            "pub_date": "2026-02-27 22:19:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a4e4bb3-547f-485b-a4d7-3bc64450337a",
            "description": "COLOMBIA COMMERCE MINISTER SAYS WILL PROPOSE RECIPROCAL TARIFF OF 50% ON SOME ECUADOREAN GOODS",
            "link": "https://www.markets.news/headlines/0a4e4bb3-547f-485b-a4d7-3bc64450337a",
            "pub_date": "2026-02-27 22:19:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "598083a4-95d1-45f5-9411-21df83be1d23",
            "description": "OPENAI’S ALTMAN TELLS STAFF CO WORKING ON A DEAL THAT MIGHT HELP SOLVE THE IMPASSE BETWEEN ANTHROPIC AND PENTAGON - WSJ",
            "link": "https://www.markets.news/headlines/598083a4-95d1-45f5-9411-21df83be1d23",
            "pub_date": "2026-02-27 22:19:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones futures up after Trump speech. Nvidia earnings awaited. President's State of the Union address noted.",
            "id": "a90fb1c9-41d7-4b8e-b9a1-e2b469fc1217",
            "description": "Following President Donald Trump's State of the Union speech, futures saw an increase, particularly with a focus on Nvidia's earnings. On Tuesday, Dow Jones Futures experienced a rise, indicating positive market sentiment. Investors are closely monitoring these developments, eager to see the impact of Trump's speech and Nvidia's performance.",
            "link": "https://www.markets.news/headlines/a90fb1c9-41d7-4b8e-b9a1-e2b469fc1217",
            "pub_date": "2026-02-27 22:19:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coherent's CEO and CFO to join fireside chat at Morgan Stanley 2026 TMT Conference on March 3, 2026.",
            "id": "156f025c-9924-41c3-8520-e051d6580778",
            "description": "The CEO and CFO of Coherent are scheduled to engage in a fireside chat during the Morgan Stanley 2026 TMT Conference on March 3, 2026. This event is crucial for both Coherent and the conference, offering attendees insights from top leadership. The chat will provide an opportunity for discussions related to the company, industry trends, and potential future developments. The participation of Coherent's key executives in this conference signifies the company's commitment to engaging with investors and stakeholders. It is a platform where current and prospective investors can gain valuable information and understand the strategic direction of Coherent. This engagement is expected to draw significant interest, highlighting the importance of the event for Coherent's stakeholders.",
            "link": "https://www.markets.news/headlines/156f025c-9924-41c3-8520-e051d6580778",
            "pub_date": "2026-02-27 22:20:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PayPal, MoonPay, and M0 introduce PYUSDx for app developers to create custom stablecoins, backed by PayPal USD. Fast launch and cross-chain support offered.",
            "id": "9393c2d5-6887-4629-8a31-56a22c445281",
            "description": "PYUSDx is a platform that enables developers to create stablecoins specific to their applications, backed by PayPal USD. The platform offers a quick launch process, supports cross-chain functionality, and allows for customized branding of the tokens.",
            "link": "https://www.markets.news/headlines/9393c2d5-6887-4629-8a31-56a22c445281",
            "pub_date": "2026-02-27 22:09:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Albertsons appoints Brian Rice to Board of Directors, effective Feb. 25, 2026.",
            "id": "ea7a558b-288f-4fde-8ec4-a4c2629f1990",
            "description": "Albertsons Companies has recently appointed Brian Rice to its Board of Directors, with the effective date set for Feb. 25, 2026.",
            "link": "https://www.markets.news/headlines/ea7a558b-288f-4fde-8ec4-a4c2629f1990",
            "pub_date": "2026-02-27 22:09:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RAW Nutrition introduces new RAW Protein Bars with 18–21g protein and 1–5g sugar, offering candy-bar taste.",
            "id": "05d475a8-b30c-4aa0-bae6-044071463046",
            "description": "A sport nutrition brand, RAW Nutrition, has released RAW Protein Bars in Port St. Lucie, Fla. These bars offer 18–21 grams of protein and only 1–5 grams of added sugar in four tasty flavors. For many, protein bars have been a compromise between taste and nutrition, often lacking in one aspect. RAW Protein Bars aim to bridge this gap by providing both flavor and solid macronutrient content, unlike traditional candy bars which cater more to cravings.",
            "link": "https://www.markets.news/headlines/05d475a8-b30c-4aa0-bae6-044071463046",
            "pub_date": "2026-02-27 22:09:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AECOM secures 3 contracts from Sound Transit in Seattle for engineering, environmental review, and construction management services, potentially worth $1 billion.",
            "id": "59fe1838-9910-4987-a719-5e5c7336f0ee",
            "description": "Engineering firm AECOM (NYSE: ACM) recently secured three contracts from Sound Transit to assist with transportation projects in Seattle. The contracts involve providing engineering design, environmental review, and construction management services for rail and bus system enhancements. These contracts, awarded through multiple-award task order agreements, will span over five years. Sound Transit has granted a total of 19 contracts as part of the initiative, with an estimated value of around $1 billion for engineering services throughout the contract duration. AECOM will play a crucial role in driving these projects forward.",
            "link": "https://www.markets.news/headlines/59fe1838-9910-4987-a719-5e5c7336f0ee",
            "pub_date": "2026-02-27 22:09:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canoly's C16 Cold Press Juicer surpasses 100,000 sales in 6 months, establishing brand in kitchen appliance market.",
            "id": "5b86e75c-530c-48d0-a074-b6321660abb8",
            "description": "In Atlanta on February 27, 2026, Canoly, a rising kitchen appliance company, shared news that their leading product, the C16 cold press juicer, has achieved over 100,000 units sold in just six months since its introduction in 2025. This achievement solidifies Canoly's position as a prominent player in the market.",
            "link": "https://www.markets.news/headlines/5b86e75c-530c-48d0-a074-b6321660abb8",
            "pub_date": "2026-02-27 22:11:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VNET raises US$138 million through private placement of 81.0 million shares. Leader in China's data center services.",
            "id": "7055d913-0b4b-437e-bf7b-091f5052daea",
            "description": "On February 27, 2026, VNET Group, Inc. (Nasdaq: VNET), a prominent internet data center services provider in China, disclosed a private placement of 81.0 million fresh Class A ordinary shares.",
            "link": "https://www.markets.news/headlines/7055d913-0b4b-437e-bf7b-091f5052daea",
            "pub_date": "2026-02-27 22:11:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Professional vegan haircare brand DESIGNME launches Rooting for All Women campaign celebrating transformation, strength, and collective impact.",
            "id": "83c608bf-08a6-4eb0-838a-48d5fecbb4d4",
            "description": "In Montreal on February 27, 2026, DESIGNME, a Canadian haircare brand known for its vegan products, launched a special campaign called Rooting for All Women. This limited-edition initiative is dedicated to celebrating women, highlighting their growth, and recognizing the strength of change in all phases of life. The campaign showcases the talents of hairstylists and advocates for female empowerment.",
            "link": "https://www.markets.news/headlines/83c608bf-08a6-4eb0-838a-48d5fecbb4d4",
            "pub_date": "2026-02-27 22:11:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hudson Pacific Properties (NYSE: HPP) CEO to join roundtable at Citi’s 2026 Global Property CEO Conference on March 2. Live webcast available.",
            "id": "1a31aba1-288e-4681-ad93-9c82eb54a4c3",
            "description": "In Los Angeles, Hudson Pacific Properties, Inc. (NYSE: HPP) revealed that Victor Coleman, Chairman and CEO, and other senior executives will join a roundtable at Citi’s 2026 Global Property CEO Conference on March 2, 2026, at 2:10 p.m. ET. Those interested can access the live webcast of the discussion on the company's website, with a replay becoming available one hour post-event.",
            "link": "https://www.markets.news/headlines/1a31aba1-288e-4681-ad93-9c82eb54a4c3",
            "pub_date": "2026-02-27 22:11:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US PPI lifts gold to 1-month peak, pushes Bitcoin towards 3% dip as inflation concerns grip markets.",
            "id": "4e9bde64-045c-4833-a5fd-864f14a8a882",
            "description": "The latest data on US PPI inflation, indicating higher temperatures, has had contrasting effects on different assets. Precious metals saw a boost while Bitcoin bulls faced a setback, resulting in a nearly 3% decrease in BTC price for the day.",
            "link": "https://www.markets.news/headlines/4e9bde64-045c-4833-a5fd-864f14a8a882",
            "pub_date": "2026-02-27 22:11:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9cfbbf85-69ee-468d-88f9-a80209734307",
            "description": "The European Union will implement a mammoth trade deal with the South American Mercosur bloc while waiting for a top court's ruling on its legality, EU chief Ursula von der Leyen said Friday. The European Commission's move, announced after Argentina and Uruguay ratified the",
            "link": "https://www.markets.news/headlines/9cfbbf85-69ee-468d-88f9-a80209734307",
            "pub_date": "2026-02-27 22:15:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Domo to release Q4 and FY 2026 earnings on March 10, 2026 after market close. Conference call at 3pm (MT) / 5pm (ET).",
            "id": "02130749-a5e1-4d68-9273-0c181a95d063",
            "description": "Domo (Nasdaq: DOMO) based in Silicon Slopes, Utah, announced that it will release its fourth-quarter and full-year fiscal 2026 results on Tuesday, March 10, 2026. The fiscal year ended on January 31, 2026. Following the market close, the company will host a conference call at 3:00 p.m. (MT) / 5:00 p.m. (ET) to discuss its financial performance with investors. Those interested can join the call live by dialing (877) 484-6065 or (201) 689-8846. Additionally, a live webcast of the event will be accessible on Domo Inves.",
            "link": "https://www.markets.news/headlines/02130749-a5e1-4d68-9273-0c181a95d063",
            "pub_date": "2026-02-27 22:04:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}