{
    "data": [
        {
            "title": "",
            "id": "e3bd8809-61c7-4281-ab6b-2577b4738815",
            "description": "Delegations arrive back at US iran talks negotiations site",
            "link": "https://www.markets.news/headlines/e3bd8809-61c7-4281-ab6b-2577b4738815",
            "pub_date": "2026-02-27 00:31:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ee36d614-057b-4d10-97f8-5c790ae97cf5",
            "description": "Sanoma Corporation purchased its own shares on 26 Feb 2026.",
            "link": "https://www.markets.news/headlines/ee36d614-057b-4d10-97f8-5c790ae97cf5",
            "pub_date": "2026-02-27 00:31:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client from Alameda creates AI financial system TKI-1266 to address systemic gaps in equity, trust, data sovereignty.",
            "id": "04abd9e8-d3ef-47fb-8ec0-def480a73123",
            "description": "In Pittsburgh on February 26, 2026, an inventor from Alameda, California, discussed their development of a system aimed at addressing the persistent issue of financial equity, trust automation, and data sovereignty. The inventor expressed a desire to implement a self-sustaining AI-driven trust framework to tackle these challenges.",
            "link": "https://www.markets.news/headlines/04abd9e8-d3ef-47fb-8ec0-def480a73123",
            "pub_date": "2026-02-27 00:32:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boyd Gaming is selling Sam's Town Shreveport to Bally's Corporation, according to an agreement announced on Feb. 26, 2026.",
            "id": "6ca2d8a1-37bf-4af7-a881-8f3190d970cf",
            "description": "In Las Vegas on February 26, 2026, Boyd Gaming Corporation (NYSE: BYD) revealed plans to sell Sam's Town Hotel & Casino in Shreveport, Louisiana, known as Sam's Town Shreveport, to Bally's Corporation (NYSE: BALY). This definitive agreement marks a strategic move in the gaming industry. Sam's Town Shreveport, situated next to Bally's, will change ownership as part of this deal.",
            "link": "https://www.markets.news/headlines/6ca2d8a1-37bf-4af7-a881-8f3190d970cf",
            "pub_date": "2026-02-27 00:32:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c03422ba-3fd5-4319-a990-cb48f99dc2bd",
            "description": "US 4-Week Bill Auction High Yield 3.625% Bid-to-cover 2.88 US sells $105 bln Awards 72.51% of bids at high",
            "link": "https://www.markets.news/headlines/c03422ba-3fd5-4319-a990-cb48f99dc2bd",
            "pub_date": "2026-02-27 00:33:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WBD reports earnings of $9.46 billion revenue, $252 million net loss, $2.22 billion adjusted EBITDA, and decline in TV and content revenues.",
            "id": "547cb550-8dbd-4e5a-908d-49effc524838",
            "description": "Warner Bros. Discovery, Inc. (NASDAQ: WBD) reported its fiscal fourth-quarter results with quarterly revenue at $9.46 billion, a 7% year-on-year decrease, exceeding analyst estimates. The company reported a net loss of 10 cents per share, wider than expected, with a quarterly net loss of $252 million, an improvement from the previous year. Adjusted EBITDA stood at $2.22 billion, a 20% decrease primarily due to the decline in the Global Linear Networks segment. Distribution revenues declined by 3% to $4.79 billion, advertising revenues decreased by 9% to $1.70 billion, and content revenues decreased by 10% to $2.66 billion. The company generated $1.80 billion in operating cash flow and $1.38 billion in free cash flow.",
            "link": "https://www.markets.news/headlines/547cb550-8dbd-4e5a-908d-49effc524838",
            "pub_date": "2026-02-27 00:33:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Halper Sadeh LLC investigating EWCZ, CWAN, BKKT deals to ensure fair shareholder treatment, potential conflicts. Shareholders advised to seek advice.",
            "id": "1e25a87b-227b-4c83-81c3-53688f98412e",
            "description": "Company insiders could potentially receive significant financial advantages that regular shareholders may not have access to. The planned deals might include conditions that could restrict better competing bids. Shareholders are advised to get in touch with the company to talk about their rights and opportunities free of charge.",
            "link": "https://www.markets.news/headlines/1e25a87b-227b-4c83-81c3-53688f98412e",
            "pub_date": "2026-02-27 00:34:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CHOP & Penn Medicine launch CRISPR platform to identify AML drivers in patient cells, Feb 26, 2026.",
            "id": "11fc2a71-12bd-4d68-a08c-25d3f1702c1a",
            "description": "Researchers have developed a new toolkit that enables testing of potential cancer targets within patient leukemia cells. This innovative CRISPR-based tool can pinpoint genes and regulatory elements responsible for driving acute myeloid leukemia. By directly applying this tool in patient cells, scientists aim to enhance understanding of the disease mechanisms. The toolkit is set to revolutionize cancer research by facilitating personalized treatment approaches. The breakthrough was announced in Philadelphia, with the tool showing promising results in identifying crucial factors in leukemia development. This development signifies a major advancement in cancer therapeutics, with significant potential to improve patient outcomes.",
            "link": "https://www.markets.news/headlines/11fc2a71-12bd-4d68-a08c-25d3f1702c1a",
            "pub_date": "2026-02-27 00:34:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Batteries Plus named Best Retail Franchise of 2025 at IFA Annual Convention in Las Vegas by Global Franchise Awards.",
            "id": "8829f3fe-6f6f-4c1b-b6cb-89779de81533",
            "description": "Recognized at the IFA Annual Convention in Las Vegas, a distinguished battery and power solutions franchise based in HARTLAND, Wis., achieved accolades for its exceptional systemwide services in 2025. Batteries Plus, the premier battery and power solutions service center in the country, was honored as the Best Retail company. This acknowledgment signifies the franchise's commitment to excellence and customer service. The ceremony took place on February 26, 2026.",
            "link": "https://www.markets.news/headlines/8829f3fe-6f6f-4c1b-b6cb-89779de81533",
            "pub_date": "2026-02-27 00:34:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Native will attend AAAAI 2026 Annual Meeting, introducing their Sensitive Series with hypoallergenic fragrances excluding 81 allergens.",
            "id": "1019adbd-b522-4f4c-8c91-6a23189d6786",
            "description": "In San Francisco, personal care brand Native shared at the American Academy of Allergy, Asthma and Immunology (AAAAI) 2026 Annual Meeting about their new Sensitive Series. This line features hypoallergenic fragrances made without 81 known allergens and using only 7-10 perfume raw materials. The ceramides in the products are sourced from nature. Native aims to address skin sensitivities with this new range, providing a clean and simplified option for consumers attending the meeting and beyond.",
            "link": "https://www.markets.news/headlines/1019adbd-b522-4f4c-8c91-6a23189d6786",
            "pub_date": "2026-02-27 00:35:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trial attorneys advise on weather preparedness for trucking companies in Texas and New Mexico to prevent accidents. #SafetyFirst.",
            "id": "fd1568f9-b1e1-42d6-8939-e8d77b0b7887",
            "description": "In the latest updates from Houston on February 26, 2026, the National Weather Service (NWS) is ramping up its Weather Awareness campaign for the upcoming season. Focusing on Tornado, Lightning, and Flood safety, this initiative aims to educate the public on staying safe during severe weather events. Trial attorneys Joel Simon and Ryan Perdue of Simon Perdue Law, PLLC are encouraging trucking companies to take heed of these precautions. This proactive stance will help mitigate risks for drivers and the general public. Stay tuned for more updates on this important safety campaign.",
            "link": "https://www.markets.news/headlines/fd1568f9-b1e1-42d6-8939-e8d77b0b7887",
            "pub_date": "2026-02-27 00:26:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AuthMind enhances identity protection for vaults, secrets, and AI workloads. Bethesda, Md., Feb. 26, 2026.",
            "id": "94f5cc31-5e83-4a5a-a499-6b98210ac93d",
            "description": "AuthMind, a leading identity observability-driven threat protection company, has expanded its end-to-end identity protection services to cover vault and secrets manager access, secret usage, and workload execution. The company's move comes as agentic AI technologies continue to advance rapidly. The announcement was made in Bethesda, Md., on February 26, 2026. AuthMind's initiative reflects the increasing importance of safeguarding against cyber threats, with a growing emphasis on protecting sensitive information.",
            "link": "https://www.markets.news/headlines/94f5cc31-5e83-4a5a-a499-6b98210ac93d",
            "pub_date": "2026-02-27 00:26:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AGBT awards 2026 Next Gen Leadership Awards to early-career researchers and grad students for AGBT meeting in Orlando.",
            "id": "f3b9b6fe-40d7-4705-80bc-92864b6412b0",
            "description": "AGBT has revealed the winners of the 2026 Next Gen Leadership Awards at the AGBT General Meeting in Orlando, Florida. This prestigious award acknowledges exceptional early-career researchers and graduate students contributing to innovation in genomics and related fields. Recipients are granted financial assistance to present their research at the conference, enabling scientific collaboration and career development.",
            "link": "https://www.markets.news/headlines/f3b9b6fe-40d7-4705-80bc-92864b6412b0",
            "pub_date": "2026-02-27 00:26:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "464954ac-d21c-4b1f-95b0-28be619900ac",
            "description": "IDF Spokesperson: The IDF struck eight military camps used for storing weapons and training by the 'Radwan Force' unit in Lebanon Earlier today (Thursday), the IDF struck military camps of the 'Radwan Force' unit of the Hezbollah terrorist organization in the Baalbek area in",
            "link": "https://www.markets.news/headlines/464954ac-d21c-4b1f-95b0-28be619900ac",
            "pub_date": "2026-02-27 00:26:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hagar hf. releases financial calendar for 2026/27, including annual and interim financial statements and Annual General Meeting.",
            "id": "6715cad6-23d5-44a3-b718-077ab002d37c",
            "description": "Hagar has announced its schedule for releasing financial statements for the 2026/27 financial year and conducting the Annual General Meeting. The company plans to publish its annual financial report by March 1, 2027, followed by the interim financial statements on June 15, 2027. The Annual General Meeting is scheduled to take place on July 30, 2027. These dates mark important milestones for stakeholders and investors to track the company's performance and strategic direction.",
            "link": "https://www.markets.news/headlines/6715cad6-23d5-44a3-b718-077ab002d37c",
            "pub_date": "2026-02-27 00:26:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MT Sobek introduces small-group adventures for 2026, making it more social. 30% of guests seek independent travel with meaningful connection.",
            "id": "6bec6a99-5b75-4729-876c-cdbbde75435c",
            "description": "In Emeryville, California, on February 26, 2026, MT Sobek announced that adventure doesn't have to be experienced alone. The company highlights the importance of meaningful connections in travel, noting that close to 30% of its guests now prefer engaging in independent travel while still seeking connection.",
            "link": "https://www.markets.news/headlines/6bec6a99-5b75-4729-876c-cdbbde75435c",
            "pub_date": "2026-02-27 00:28:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c54fc81b-baf9-4be3-b779-57ae607bc1c8",
            "description": "Iranian News Agency: The Iranian delegation has headed to the Geneva talks venue to resume nuclear negotiations - Al Jazeera.",
            "link": "https://www.markets.news/headlines/c54fc81b-baf9-4be3-b779-57ae607bc1c8",
            "pub_date": "2026-02-27 00:28:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Auditor enforcement decreased in 2025 due to SEC changes, with significant transition at agencies.",
            "id": "17dbe833-a6d6-429c-bb95-2f8d2f8e5ee5",
            "description": "In Chicago on February 26, 2026, a recent report from The Brattle Group revealed a significant decrease in enforcement actions against auditors in 2025. This decline signifies a period of major changes at the US Securities and Exchange Commission (SEC) and the Public Company.",
            "link": "https://www.markets.news/headlines/17dbe833-a6d6-429c-bb95-2f8d2f8e5ee5",
            "pub_date": "2026-02-27 00:30:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin's price isn't being manipulated under $150,000. The issue is with ETF authorized participants. Full story on Benzinga.com.",
            "id": "6e0e158c-8372-45b8-9d2f-72758a0dfd02",
            "description": "According to Bitwise Invest Chief Investment Officer Jeff Park, Bitcoin (BTC) is not facing suppression as suggested on social media. The problem actually lies with ETF authorized participants who have certain privileges. Park elaborates that these participants can short ETF shares without incurring borrowing costs, capital requirements, or deadlines to close positions due to a regulatory carve-out. Any authorized participant has the ability to create shares whenever they want through their involvement in ETF creation and redemption. This exemption is not exclusive to Jane Street, as nine firms including JPMorgan, Macquarie, Virtu Americas, Goldman Sachs, and others hold this power for BlackRock's IBIT. For further information, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/6e0e158c-8372-45b8-9d2f-72758a0dfd02",
            "pub_date": "2026-02-27 00:30:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Claritas Rx introduces solution to improve specialty drug first fill and persistence rates with integrated data and Consent Clearinghouse.",
            "id": "b8185485-1a52-460e-a037-aa95351f0b72",
            "description": "In South San Francisco, California, Claritas Rx has introduced its Foundational Data Aggregation including the unique patient Consent Clearinghouse™. This aims to enhance initial fill and continuity for specialty and rare disease brands. The innovative solution consolidates data from various sources and prepares it for analysis, providing commercial, patient services, and data teams with a dependable insight into the specialty patient journey. This offering is set to improve first fill and persistence rates, benefitting specialty and rare disease brands.",
            "link": "https://www.markets.news/headlines/b8185485-1a52-460e-a037-aa95351f0b72",
            "pub_date": "2026-02-27 00:16:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}