{
    "data": [
        {
            "title": "",
            "id": "44399b6e-71f7-453d-bce4-3dae91c4f26b",
            "description": "AI SPENDING TO SURPASS DOT-COM BUBBLE, WARNS MORGAN STANLEY Morgan Stanley says hyperscaler AI investment is set to exceed dot-com era levels, with capex intensity projected to hit up to 45% of sales by 2028. Analyst Todd Castagno warns spending is surging far faster than",
            "link": "https://www.markets.news/headlines/44399b6e-71f7-453d-bce4-3dae91c4f26b",
            "pub_date": "2026-02-26 22:49:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8917ec32-cc55-4ffa-a68f-41d40fb0c2e9",
            "description": "$NVDA - NVIDIA SHARES EXTEND LOSSES, LAST DOWN 3.3%",
            "link": "https://www.markets.news/headlines/8917ec32-cc55-4ffa-a68f-41d40fb0c2e9",
            "pub_date": "2026-02-26 22:49:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "99c59353-446a-4632-aa80-c1083c746a08",
            "description": "Panama to send a letter to China today on ports - President.",
            "link": "https://www.markets.news/headlines/99c59353-446a-4632-aa80-c1083c746a08",
            "pub_date": "2026-02-26 22:49:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1d40c8c7-c2be-443e-be6f-49538201a351",
            "description": "EU COMMISSION: EU COUNTRIES MAY USE EXISTING EU FUNDS TO PAY FOR SAFE ABORTION FOR WOMEN IN VULNERABLE SITUATIONS WHO COULD NOT OTHERWISE AFFORD IT",
            "link": "https://www.markets.news/headlines/1d40c8c7-c2be-443e-be6f-49538201a351",
            "pub_date": "2026-02-26 22:52:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4eceae03-f413-46ff-b56d-7cd46e9df6be",
            "description": "HUNGARY MOL SAYS IT WILL TURN TO EUROPEAN COMMISSION IN CASE OF NEGATIVE REPLY FROM JANAF",
            "link": "https://www.markets.news/headlines/4eceae03-f413-46ff-b56d-7cd46e9df6be",
            "pub_date": "2026-02-26 22:52:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c1076d3e-74bd-4c5b-b315-5e33efbb23ba",
            "description": "EU COMMISSION: BECAUSE EXISTING EU FUNDS CAN BE USED, IT IS NOT NECESSARY TO SUBMIT NEW PROPOSAL FOR SUCH FUNDS AS ASKED BY THE EUROPEAN CITIZENS' INITIATIVE",
            "link": "https://www.markets.news/headlines/c1076d3e-74bd-4c5b-b315-5e33efbb23ba",
            "pub_date": "2026-02-26 22:52:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "04fd8b24-5736-497e-b61c-ea6377bb9021",
            "description": "HUNGARY MOL: IT CALLS ON CROATIA'S JANAF TO LET THROUGH MARITIME RUSSIAN CRUDE SHIPMENTS THAT ARE NOT UNDER SANCTIONS",
            "link": "https://www.markets.news/headlines/04fd8b24-5736-497e-b61c-ea6377bb9021",
            "pub_date": "2026-02-26 22:52:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Luminate Bank leaders Taryn Reuter and Eric Lovins named 2025 Mortgage Leaders of the Year by Minnesota Mortgage Association.",
            "id": "902619ff-3680-414d-b431-a4d9d1ed9556",
            "description": "Minneapolis, February 26, 2026 - Luminate Bank® recognized Taryn Reuter, President and Chief Revenue Officer, and Eric Lovins, President of Mortgage, for their contributions to advancing transparency, professionalism, and trust in lending. The Minnesota Mortgage Association presented this honor to the longstanding partners. This recognition highlights their commitment to the industry.",
            "link": "https://www.markets.news/headlines/902619ff-3680-414d-b431-a4d9d1ed9556",
            "pub_date": "2026-02-26 22:53:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "280763cc-88da-41c9-a766-2e3a46e6fd4a",
            "description": ".US EXTENDS DEADLINE FOR POTENTIAL BUYERS OF LUKOIL INTERNATIONAL ASSETS TO APRIL 1.",
            "link": "https://www.markets.news/headlines/280763cc-88da-41c9-a766-2e3a46e6fd4a",
            "pub_date": "2026-02-26 22:54:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6e469967-e28d-465c-941b-a3df1e844566",
            "description": "UK 20-YEAR GILT YIELDS FALL 4 BPS ON THE DAY TO 4.964%, LOWEST SINCE APRIL 2025",
            "link": "https://www.markets.news/headlines/6e469967-e28d-465c-941b-a3df1e844566",
            "pub_date": "2026-02-26 22:42:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a0c9f9f5-93b0-4669-9521-de13f0be8881",
            "description": "GULF PETROSTATES RUSH TO EXPORT CRUDE AMID FEARS OF US STRIKE ON IRAN - FT",
            "link": "https://www.markets.news/headlines/a0c9f9f5-93b0-4669-9521-de13f0be8881",
            "pub_date": "2026-02-26 22:42:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Registration now open for 4th annual QSR Evolution Conference by WTWH Media, held on Sep 8-10, 2026 at Hyatt Regency Atlanta.",
            "id": "aa732b21-31e8-4847-a65b-23f8c0bb8647",
            "description": "Cleveland, 26th February 2026 - Registration is currently available for the QSR Evolution Conference's fourth edition. Scheduled for September 8-10, 2026, at the Hyatt Regency Atlanta, the event invites participants to a welcome reception before the main activities commence.",
            "link": "https://www.markets.news/headlines/aa732b21-31e8-4847-a65b-23f8c0bb8647",
            "pub_date": "2026-02-26 22:43:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors of Kyndryl Holdings, Inc. (NYSE: KD) alerted of an April 13, 2026 deadline due to class action lawsuit.",
            "id": "b2a20ac7-bc48-49a3-a467-5d78f197443f",
            "description": "Philadelphia-based law firm Berger Montague PC has reported the filing of a class action lawsuit against Kyndryl Holdings, Inc. (NYSE: KD) on February 26, 2026. The lawsuit represents investors who bought or acquired shares of Kyndryl. The firm has not disclosed the specific details of the allegations. Kyndryl, the defendant in the case, is a publicly traded company on the New York Stock Exchange. The lawsuit, brought forth on behalf of affected investors, is seeking resolution through legal channels. Berger Montague PC, known for representing plaintiffs in significant legal matters, is spearheading the case against Kyndryl.",
            "link": "https://www.markets.news/headlines/b2a20ac7-bc48-49a3-a467-5d78f197443f",
            "pub_date": "2026-02-26 22:43:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "3D visualization boosts sales by 67% and improves in-store satisfaction, according to Provoke Insights study.",
            "id": "bb15f2d3-f457-45e0-a031-4432ae54ba71",
            "description": "A study conducted in 2026 by Provoke Insights revealed that shoppers who utilize 3D tools in-store, alongside assistance from a salesperson, exhibit a 67% increased likelihood of making high-ticket purchases. These individuals also reported considerably higher levels of satisfaction with their in-store experience. The research, released by 3D Cloud on February 26, 2026, in St. Petersburg, Florida, highlights the impact of incorporating advanced technology like 3D tools in retail settings.",
            "link": "https://www.markets.news/headlines/bb15f2d3-f457-45e0-a031-4432ae54ba71",
            "pub_date": "2026-02-26 22:43:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Auguste Escoffier Global Solutions partners with LDEI International to expand access to culinary & hospitality training.Chars: 100",
            "id": "f76cc6de-5781-4fc3-a642-1a8444fc4fab",
            "description": "In Schaumburg, Illinois, on February 26, 2026, Auguste Escoffier Global Solutions (AEGS), a prominent company offering culinary and hospitality workforce training, unveiled a fresh endeavor in partnership with Les Dames d'Escoffier International (LDEI). This initiative will bring together their expertise to create impactful solutions within the industry.",
            "link": "https://www.markets.news/headlines/f76cc6de-5781-4fc3-a642-1a8444fc4fab",
            "pub_date": "2026-02-26 22:43:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vista Gold Corp. prices public offering at US$2.50/share, raising US$39.0 million with 15,600,000 common shares.",
            "id": "2855c73d-bb63-495a-bc05-e9680d7b27d6",
            "description": "In Denver on February 26, 2026, Vista Gold Corp. (NYSE American and TSX: VGZ) disclosed the pricing details for its underwritten public offering of 15,600,000 common shares. Each share was priced at US$2.50, marking the total proceeds from the offering to be US$39 million. Vista Gold Corp. expressed satisfaction with the pricing and the response to the offering.",
            "link": "https://www.markets.news/headlines/2855c73d-bb63-495a-bc05-e9680d7b27d6",
            "pub_date": "2026-02-26 22:44:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Potential crisis if China takes over Taiwan, shuts down chip exports to US. Tech industry and economy at risk.",
            "id": "029fb828-bbc9-4ffc-9466-b71b0f76f3c1",
            "description": "If Taiwan is invaded by China and its chip exports to American companies are halted, it could severely impact the tech industry and the U.S. economy. The loss of these chip exports, which account for a significant portion of the technology sector, could lead to a substantial economic slowdown in the U.S. Increased tensions surrounding this issue have sparked concerns about the potential ramifications for global trade and economic stability. It is estimated that over $50 billion worth of chips are exported from Taiwan to the United States annually, highlighting the significant economic consequences of such a disruption.",
            "link": "https://www.markets.news/headlines/029fb828-bbc9-4ffc-9466-b71b0f76f3c1",
            "pub_date": "2026-02-26 22:40:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures fluctuated after Monday's sell-off. Trump's tariff threat impacted market sentiment. Futures of major benchmark indices were mixed. Whirlpool plunged 7.46% in premarket with $800 million offerings.alsy, Nasdaq 100 up 0.29% .",
            "id": "4c2acafd-755e-4b54-94d6-13e46b511ae8",
            "description": "U.S. stock futures fluctuated on Tuesday following a sell-off, partly due to fears raised by a report on a potential \"Global Intelligence Crisis\" sparking concerns of a deflationary depression caused by an AI revolution. Geopolitical tensions, including President Trump's proposal to increase global tariffs to 15% and friction with Iran, added to market uncertainty. The 10-year Treasury bond yielded 4.03%, with a 3.45% yield on the two-year bond. The CME Group's FedWatch tool projected a 95.9% likelihood of the Federal Reserve keeping interest rates unchanged in March. Index Performance showed small gains for major benchmarks. ETFs like SPDR S&P 500 (SPY) and Invesco QQQ Trust (QQQ) were mixed in premarket trading. Whirlpool Corp. (WHR) saw a 7.46% premarket plunge after announcing plans for public offerings to raise $800 million. WHR had weak price trends and a moderate quality ranking.",
            "link": "https://www.markets.news/headlines/4c2acafd-755e-4b54-94d6-13e46b511ae8",
            "pub_date": "2026-02-26 22:40:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OTC Markets Group welcomes Dryden Gold Corp. to OTCQX, a junior gold exploration company that upgraded from OTCQB.",
            "id": "4fe8a3b4-ca71-43aa-98d6-324100780f7c",
            "description": "On February 24, 2026, OTC Markets Group Inc. revealed that Dryden Gold Corp., a junior gold exploration company, has met the requirements to be listed on the OTCQX® Best Market. OTC Markets Group Inc. operates regulated trading platforms for 12,000 U.S. and international securities. Dryden Gold Corp. was previously listed on the OTCQB® Venture Market and now trades under the tickers TSX-V: DRY, FSE: X7W, and OTCQX: DRYGF. This advancement signifies the company's move up from the OTCQB® Venture Market to the OTCQX® Best Market for enhanced visibility and trading opportunities.",
            "link": "https://www.markets.news/headlines/4fe8a3b4-ca71-43aa-98d6-324100780f7c",
            "pub_date": "2026-02-26 22:40:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CyberBay 2026 Summit in Tampa, FL, to focus on closing cyber risk-to-business risk gap for senior cybersecurity leaders through CCLS program.",
            "id": "5c79e126-8bcd-413c-929f-eed48d75d55a",
            "description": "In Tampa, Florida, the importance of senior cybersecurity leaders effectively communicating risks, investments, and priorities to executives is emphasized. Despite this integral role, many security leaders find it challenging to articulate cyber risks in a manner that resonates with the C-suite, leading to difficulties in securing funding. The 2026 CyberBay Summit will showcase the Certified Cybersecurity Leadership Strategist (CCLS) program as a solution to bridge this communication gap. This three-day in-person event will focus on empowering leaders to translate cyber risks into tangible business risks that the C-suite can comprehend, prioritize, and support financially.",
            "link": "https://www.markets.news/headlines/5c79e126-8bcd-413c-929f-eed48d75d55a",
            "pub_date": "2026-02-26 22:40:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}