{
    "data": [
        {
            "title": "DoubleVerify's revenue for 2025 grew by 14% to $748.3 million, boosted by social, CTV, and programmatic growth.",
            "id": "10de251b-cc98-4e5a-a937-b2ba7eab5c25",
            "description": "Revenue for the year 2025 experienced a 14% rise compared to the previous year, reaching $748.3 million. This increase was primarily fueled by the company's expansion in social media, CTV measurement, and programmatic activation on a global scale.",
            "link": "https://www.markets.news/headlines/10de251b-cc98-4e5a-a937-b2ba7eab5c25",
            "pub_date": "2026-02-27 05:09:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PureCycle Technologies had record PureFive® production of 7.5 million pounds in Q4 2025, appointed new CFO, and advances Gen-2 designs.",
            "id": "58a50abe-3dd2-442c-b319-db2f5ccea312",
            "description": "In the fourth quarter, PureCycle reported a new production record of 7.5 million pounds of PureFive®. Additionally, they announced the appointment of Donald Carpenter as the new Chief Financial Officer. The company is also making strides in advancing their Gen-2 designs.",
            "link": "https://www.markets.news/headlines/58a50abe-3dd2-442c-b319-db2f5ccea312",
            "pub_date": "2026-02-27 05:09:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coterra Energy (NYSE: CTRA) reports 2025 results, offers 2026 guidance, and declares $0.22 quarterly dividend.",
            "id": "22df8565-02bb-4508-9e93-fb8df46831e6",
            "description": "Coterra Energy Inc. (NYSE: CTRA) announced its Q4 and full-year 2025 financial results, along with full-year 2026 guidance. The company declared a quarterly dividend of $0.22 per share. Tom Jorden, Chairman, CEO, and President, attributed the strong performance to effective capital allocation and operational efficiency. The results highlight the quality of their assets and the commitment of their team.",
            "link": "https://www.markets.news/headlines/22df8565-02bb-4508-9e93-fb8df46831e6",
            "pub_date": "2026-02-27 05:09:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b85f6157-52c1-4d64-89d0-3405ea041552",
            "description": "Energy company Talen announces 2025 Q4 and full-year results.",
            "link": "https://www.markets.news/headlines/b85f6157-52c1-4d64-89d0-3405ea041552",
            "pub_date": "2026-02-27 05:09:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AvePoint's 2025 financial results: $319.2M SaaS revenue (38% YoY), $419.5M total revenue (27% YoY), $416.8M ARR (27% YoY).",
            "id": "49375b10-feba-45a3-94f4-416dc28418dd",
            "description": "In the past year, Software as a Service (SaaS) revenue reached $319.2 million, marking a 38% increase compared to the previous year. On a constant currency basis, the growth was 36%. Total revenue for the same period amounted to $419.5 million, with a year-over-year growth of 27% or 25% when adjusted for currency fluctuations. The total Annual Recurring Revenue (ARR) stood at $416.8 million, showing a 27% increase year-over-year or 26% growth when adjusted for foreign exchange rates.",
            "link": "https://www.markets.news/headlines/49375b10-feba-45a3-94f4-416dc28418dd",
            "pub_date": "2026-02-27 05:09:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock indexes decline, Nvidia stock drops post-earnings, Dow turns positive. Chip spinoff soars. ",
            "id": "d14ee8e0-fa76-4903-98d1-e6e13a12dfed",
            "description": "On Thursday, stock indexes experienced a decline as Nvidia stock retreated following a post-earnings surge. The post-market today shows the Dow shifting into positive territory in response to Nvidia's earnings report, as well as a notable increase in the chip spinoff's performance. This live coverage highlights the dynamic movement in the market following key events, indicating a mixed day for investors.",
            "link": "https://www.markets.news/headlines/d14ee8e0-fa76-4903-98d1-e6e13a12dfed",
            "pub_date": "2026-02-27 05:09:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Organogenesis Holdings Inc. (Nasdaq: ORGO) reports record revenue for the fourth quarter and year ended Dec. 31, 2025.",
            "id": "6dfce7d5-8bc0-46a9-ac14-32de40573476",
            "description": "Organogenesis Holdings Inc., based in Canton, announced its financial results for the fourth quarter and full year ending on December 31, 2025. The company, listed on Nasdaq as ORGO, specializes in regenerative medicine and tissue innovations. They focus on developing, manufacturing, and selling products for advanced wound care, surgical, and sports medicine markets. The report provides insights into their performance during this period.",
            "link": "https://www.markets.news/headlines/6dfce7d5-8bc0-46a9-ac14-32de40573476",
            "pub_date": "2026-02-27 05:09:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zscaler surpasses Q2 earnings expectations: EPS $1.01, revenue up by $167.85 million from last year.",
            "id": "e0bf5388-2cfc-4df9-8610-e520c70b761a",
            "description": "Zscaler (NASDAQ: ZS) released its Q2 earnings report on Thursday, February 26, 2026, at 04:05 PM. In a significant beat, the company reported an EPS of $1.01, surpassing the estimated $0.52 by 94.23%. Revenue saw a strong increase of $167.85 million compared to the previous year. Looking back, in the last quarter, Zscaler exceeded EPS expectations by $0.46, resulting in a 13.03% decrease in share value. For further details, the full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/e0bf5388-2cfc-4df9-8610-e520c70b761a",
            "pub_date": "2026-02-27 05:10:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AvePoint Q4 earnings missed estimates by 0.0%. EPS $0.07 vs estimated $0.07. Revenue up $25.5M from last year.",
            "id": "c3955dff-5977-44d1-a295-617420a024d7",
            "description": "AvePoint (NASDAQ: AVPT) released its Q4 earnings on Thursday, February 26, 2026, at 04:05 PM. The company fell short of estimated earnings by 0.0%, with an EPS of $0.07 compared to the expected $0.07. Revenue showed growth, jumping by $25.50 million from the previous year. In the prior quarter, AvePoint's financial performance had... The detailed report can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/c3955dff-5977-44d1-a295-617420a024d7",
            "pub_date": "2026-02-27 05:10:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Definitive Healthcare (NASDAQ: DH) beat Q4 earnings by 20% with EPS of $0.06. Revenue decreased by $754K. Full story on Benzinga.com.",
            "id": "412e37a4-19cc-42a1-9a24-0a3bc9ca3ed5",
            "description": "Healthcare company Definitive Healthcare (NASDAQ: DH) released its Q4 earnings report on Thursday, February 26, 2026, at 04:05 PM. The report revealed that Definitive Healthcare exceeded estimated earnings by 20.0%, posting an EPS of $0.06 compared to the forecasted $0.05. However, revenue saw a decrease of $754 thousand from the same period the previous year. In the previous quarter, the company surpassed EPS expectations by $0.03, leading to a 10.57% increase in share price. Detailed information can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/412e37a4-19cc-42a1-9a24-0a3bc9ca3ed5",
            "pub_date": "2026-02-27 05:10:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b68f8dcc-42e3-4f7b-9ff4-04734ce9b2c3",
            "description": "TRUMP OPEN TO TALKS WITH NORTH KOREA’S KIM AS AT LEAST ONE US CITIZEN IS KILLED IN CUBA BOAT SHOOTOUT INVOLVING STOLEN VESSEL – YONHAP, AXIOS",
            "link": "https://www.markets.news/headlines/b68f8dcc-42e3-4f7b-9ff4-04734ce9b2c3",
            "pub_date": "2026-02-27 04:56:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Centerline is designing pickleball-specific apparel for fast-paced play; caters to quick pivots, lateral movement, and stop-and-go action.",
            "id": "b104b6ab-e733-457d-9d5f-14ee6701d609",
            "description": "In San Diego on February 9, 2026, Centerline is developing apparel tailored for the high-paced nature of pickleball games. The sport demands more from clothing than commonly understood, with extended rallies, continuous lateral movements, rapid pivots, and frequent stop-and-go maneuvers. The focus is on designing gear that can sustain the demands of pickleball's fast-paced nature.",
            "link": "https://www.markets.news/headlines/b104b6ab-e733-457d-9d5f-14ee6701d609",
            "pub_date": "2026-02-27 04:57:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "225 Sysco drivers and warehouse workers in Montana secure 33% wage increase, better benefits in new five-year contract with Teamsters Local 2, 120, and 190.",
            "id": "aae10ce0-6727-4ff8-8f86-8fad1a063dc4",
            "description": "Over 225 drivers and warehouse employees at Sysco in Montana, who are represented by Teamsters Local 2, 120, and 190, have successfully negotiated a new five-year collective bargaining agreement. This agreement includes a substantial 33% wage increase and enhancements to their benefits package.",
            "link": "https://www.markets.news/headlines/aae10ce0-6727-4ff8-8f86-8fad1a063dc4",
            "pub_date": "2026-02-27 04:57:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Children’s Hospital LA launches 11th annual Make March Matter campaign to raise $1 million for children’s healthcare.",
            "id": "7d9dd9b8-3876-40ee-9725-ad2d6af1c62f",
            "description": "Los Angeles - Children’s Hospital Los Angeles (CHLA) has initiated its 11th annual Make March Matter campaign, starting off with an event supported by actor and CHLA advocate John Stamos. The goal of the month-long fundraising effort is to bring in $1 million or more during March to aid children’s health in Los Angeles. This campaign brings together local businesses and the community to raise awareness and funds for the cause. The collaborative effort aims to make a significant impact on children’s healthcare in the region.",
            "link": "https://www.markets.news/headlines/7d9dd9b8-3876-40ee-9725-ad2d6af1c62f",
            "pub_date": "2026-02-27 04:51:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3a074840-c58b-4dc5-a750-54b35c20ad62",
            "description": "Nvidia CEO Huang on Fox Business: Nvidia is Micron's largest customer. $NVDA $MU",
            "link": "https://www.markets.news/headlines/3a074840-c58b-4dc5-a750-54b35c20ad62",
            "pub_date": "2026-02-27 04:53:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lineweaver Wealth Advisors hits $1 billion in assets under management, a milestone since its inception 25 years ago.",
            "id": "200d34c9-39a5-42f3-aa5c-27a06f5626cf",
            "description": "On February 26, 2026, Lineweaver Wealth Advisors revealed a major achievement by exceeding $1 billion in assets under management. Lineweaver Financial Group, established almost 25 years ago, serves as the enduring affiliate of Lineweaver.",
            "link": "https://www.markets.news/headlines/200d34c9-39a5-42f3-aa5c-27a06f5626cf",
            "pub_date": "2026-02-27 04:55:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ba658a33-5508-4373-b286-7aa806b66461",
            "description": "CUBAN FOREIGN MINISTRY OFFICIAL SAYS CUBA HAD BEEN IN CONTACT WITH US STATE DEPT AND COAST GUARD SINCE SPEEDBOAT INCIDENT",
            "link": "https://www.markets.news/headlines/ba658a33-5508-4373-b286-7aa806b66461",
            "pub_date": "2026-02-27 04:41:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ac4d0f81-fa0e-4885-b7cc-f148918d818b",
            "description": "CUBA SAYS ANTI-CUBAN GROUPS IN US HAVE OPERATED WITH IMPUNITY",
            "link": "https://www.markets.news/headlines/ac4d0f81-fa0e-4885-b7cc-f148918d818b",
            "pub_date": "2026-02-27 04:41:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mollie Williams to lead National Mobile Health Policy Center at Mission Mobile Medical Group, advancing access nationwide.",
            "id": "23219beb-7635-4b89-b989-6e7a8601e7b6",
            "description": "In Kernersville, North Carolina, Mission Mobile Medical Group revealed the appointment of Mollie Williams, DrPH, MPH, to head the newly established National Mobile Health Policy Center. This initiative aims to promote policies facilitating mobile health programs in providing care nationwide. The Policy Center is set to be a central repository for knowledge and analysis, translating practical insights from mobile health initiatives into policy recommendations to enhance access.",
            "link": "https://www.markets.news/headlines/23219beb-7635-4b89-b989-6e7a8601e7b6",
            "pub_date": "2026-02-27 04:42:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "83221e1f-e1a3-4862-9fe7-a06b73ae3a5d",
            "description": "MEXICAN PRESIDENT SHEINBAUM SAYS COCA-COLA CEO INFORMED HER OF $6 BLN INVESTMENT IN MEXICO",
            "link": "https://www.markets.news/headlines/83221e1f-e1a3-4862-9fe7-a06b73ae3a5d",
            "pub_date": "2026-02-27 04:43:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}