{
    "data": [
        {
            "title": "Eli Lilly's new oral weight loss drug outperforms Novo Nordisk's drug in a Phase 3 trial with 1,698 participants, eyeing US approval in Q2.",
            "id": "0607fd38-4447-445a-851f-204e8ff0a441",
            "description": "Shares of Eli Lilly and Co. (NYSE: LLY) experienced a decline on Thursday following the company's announcement of positive results for its oral GLP-1 medication, orforglipron. In the ACHIEVE-3 trial, the first head-to-head Phase 3 study comparing orforglipron with Novo Nordisk A/S' (NYSE: NVO) oral semaglutide in adults with type 2 diabetes inadequately managed with metformin, 1,698 participants were enrolled for the 52-week trial. The outcomes revealed that orforglipron surpassed oral semaglutide in primary and secondary endpoints, demonstrating notable enhancements in A1C levels and weight loss. In the most recent update, Eli Lilly disclosed that orforglipron 36 mg exhibited superior efficacy compared to oral semaglutide 14 mg in a Phase 3 trial, achieving a substantial 2.2% decrease in A1C levels.",
            "link": "https://www.markets.news/headlines/0607fd38-4447-445a-851f-204e8ff0a441",
            "pub_date": "2026-02-27 02:02:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9eee5061-3826-4eee-a805-254e1402f507",
            "description": "Apple: iPhone & iPad have been approved to handle classified NATO information. $AAPL",
            "link": "https://www.markets.news/headlines/9eee5061-3826-4eee-a805-254e1402f507",
            "pub_date": "2026-02-27 02:02:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Health care workers to rally at Doug Ford’s office over 10% hospital funding cut by 2027-28, causing staff shortages.",
            "id": "8b2e8a9f-ee85-460b-94e1-631054bd6ce7",
            "description": "In Toronto, healthcare workers under the Canadian Union of Public Employees are set to stage a rally outside Premier Doug Ford’s office in Etobicoke. This comes as a response to funding reductions by the provincial government. As per the government’s fall economic statement, there is a proposed plan to decrease hospital funding by 10% in real terms over three years, reaching 2027-28. This decision has been motivated by the fact that the projected spending does not suffice to cover the annual cost inflation of six percent for hospitals, according to CUPE. The repercussions of these fiscal measures are likely to impact the healthcare sector significantly.",
            "link": "https://www.markets.news/headlines/8b2e8a9f-ee85-460b-94e1-631054bd6ce7",
            "pub_date": "2026-02-27 02:02:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "869616f6-861e-4ab4-94a6-b49f15ab0258",
            "description": "US 7-Year Note Sale: - High Yield Rate: 3.790% (prev 4.018%) - Bid-Cover Ratio: 2.50 (prev 2.45) - Direct Accepted: 26.0% (prev 22.2%) - Indirect Accepted: 63.6% (prev 66.9%) - WI: 3.790%",
            "link": "https://www.markets.news/headlines/869616f6-861e-4ab4-94a6-b49f15ab0258",
            "pub_date": "2026-02-27 02:03:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bluevine introduces tools for small business invoicing & payments, including ACH positive pay. JERSEY CITY, N.J., Feb. 26, 2026.",
            "id": "a94d2572-b7d6-410c-8e28-a361f900afff",
            "description": "Bluevine has introduced new features aimed at simplifying and securing the payment process for businesses. These include the ability to generate estimates, incorporate discounts into invoices, and offer ACH positive pay for Premier customers. The company, based in Jersey City, N.J., unveiled the updates on Feb. 26, 2026. Bluevine is recognized as the leading digital banking platform, catering to a large customer base. Businesses can now leverage these enhancements to streamline their financial transactions and ensure enhanced security measures.",
            "link": "https://www.markets.news/headlines/a94d2572-b7d6-410c-8e28-a361f900afff",
            "pub_date": "2026-02-27 02:03:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wildbrine introduces first fermented bean salad - Mediterranean and Kimchi-Style, hitting Whole Foods Markets on April 1.",
            "id": "8d5a3260-8a66-4543-9160-c987af7ff6bf",
            "description": "Wildbrine, known for their sauerkraut and kimchi products, is launching a groundbreaking line of Mediterranean and Kimchi-Style Fermented Chickpea Salads. This marks the first time fermented bean salads will be available in packaged form. The debut is set for April 1st at Whole Foods Markets. The announcement was made in Madison, Wisconsin on February 26, 2026. This innovation is expected to revolutionize the fermented foods market, with wide-reaching implications for health-conscious consumers.",
            "link": "https://www.markets.news/headlines/8d5a3260-8a66-4543-9160-c987af7ff6bf",
            "pub_date": "2026-02-27 02:03:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arna Pharma Inc. & Slate Run Pharmaceuticals to form joint venture for U.S. specialty pharmaceutical market.",
            "id": "b1996daf-9362-419d-a7c2-9af74db238f3",
            "description": "In Austin, Texas on February 26, 2026, it was reported that Arna Pharma Inc. and Slate Run Pharmaceuticals have entered into a Memorandum of Understanding to establish a larger U.S.-based specialty pharmaceutical partnership. This venture will prioritize branded products, 505(b)(2) medications, and specialized generics. The agreement marks a significant collaboration in the pharmaceutical industry, signaling a strategic move towards expanding product offerings and market presence.",
            "link": "https://www.markets.news/headlines/b1996daf-9362-419d-a7c2-9af74db238f3",
            "pub_date": "2026-02-27 02:03:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arthrex introduces TightRope® SB all-suture implant for ACL fixation, offering least invasive ACL reconstruction. Feb. 26, 2026.",
            "id": "7e58fb4b-941a-4044-9e64-7ca3733ab724",
            "description": "Arthrex, a reputable company known for its minimally invasive surgical technology, has recently unveiled the TightRope® SB implant in Naples, Florida on February 26, 2026. This innovative device is designed specifically for anterior cruciate ligament (ACL) reconstruction procedures. Marketed as the least invasive option, the TightRope® SB implant boasts an all-inside approach with no metal components, setting it apart as a unique solution for patients. This release marks a significant advancement in the field of orthopedic surgery, providing a safer and more effective option for ACL reconstructions.",
            "link": "https://www.markets.news/headlines/7e58fb4b-941a-4044-9e64-7ca3733ab724",
            "pub_date": "2026-02-27 02:03:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a4bfe64b-a5ff-451c-beaf-4071efd5526a",
            "description": "The UK holds talks with oil and gas firms on ending windfall tax.",
            "link": "https://www.markets.news/headlines/a4bfe64b-a5ff-451c-beaf-4071efd5526a",
            "pub_date": "2026-02-27 02:03:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ACM Research reported $244.43 million in Q4 FY'25 revenue, up 9.4% Y/Y, missing EPS, stock tanks, margins shrink.",
            "id": "6fcd8b1e-d1f2-44ae-8bdc-777f4dd89e8d",
            "description": "ACM Research, Inc. (NASDAQ: ACMR) recently disclosed its financial performance for Q4 of fiscal 2025, unveiling revenues totaling $244.43 million. This figure surpassed the analyst consensus of $238.96 million, marking a notable 9.4% increase compared to the previous year. Despite revenue growth, the adjusted earnings per share (EPS) stood at 25 cents, falling short of the street's expectation of 34 cents. Consequently, the stock price experienced a decline post-announcement. The rise in revenues was attributed to heightened sales in single-wafer cleaning, Tahoe, and semi-critical cleaning equipment, as well as strong performance in advanced packaging (excluding ECP), services, and spares. Total shipments for the quarter amounted to $228 million, a decrease from $264 million year-over-year. Additionally, the adjusted gross margin saw a decline of 880 basis points, landing at 41.0%, below the projected range of 42%-48% detailed in ACM's long-term business model. As of December 31, 2025, the company held $1.13 billion in cash and equivalents. CEO Dr. David Wang helms ACM Research, overseeing these recent results. For the full report, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/6fcd8b1e-d1f2-44ae-8bdc-777f4dd89e8d",
            "pub_date": "2026-02-27 02:06:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lohman Technologies appoints 2 industry leaders to drive AI-enabled remote cardiac innovation. Board expansion aims to accelerate commercialization pipeline. Dr. Daniel DeBehnke & Peter E. Aftosmes join Board of Directors.",
            "id": "0982e484-7ebb-41bb-a852-3ac23e1bbc59",
            "description": "Lohman Technologies has recently welcomed Dr. Daniel DeBehnke and Peter E. Aftosmes to its Board of Directors in an effort to speed up their commercialization pipeline for explainable AI and scalable RPM partnerships. This move comes as the company aims to expand its reach and enhance its capabilities. The board expansion is expected to bring valuable expertise and strategic guidance to the company as it continues to grow.",
            "link": "https://www.markets.news/headlines/0982e484-7ebb-41bb-a852-3ac23e1bbc59",
            "pub_date": "2026-02-27 01:57:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c1c94b9b-d0e0-4cf2-89c6-de286a2b7538",
            "description": "TRUMP’S IRAN STRIKE PLAN SEEN AS SYMBOLIC The Trump administration is weighing targeted strikes on Iran’s nuclear and missile sites, but objectives remain unclear. Officials say the immediate goal is to damage Iran’s capabilities, while a broader aim may be to force Tehran to",
            "link": "https://www.markets.news/headlines/c1c94b9b-d0e0-4cf2-89c6-de286a2b7538",
            "pub_date": "2026-02-27 01:57:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4eed463e-f274-4a9a-b8cd-e1afb7ddcf70",
            "description": "Geopolitics keeps blowing up longer-term trades. Tariff views shifted. Election-driven FX moves reversed at key levels. In this tape, you trade the level, take profits, and stay nimble.",
            "link": "https://www.markets.news/headlines/4eed463e-f274-4a9a-b8cd-e1afb7ddcf70",
            "pub_date": "2026-02-27 01:58:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9fe17461-3d29-4a1a-9db1-e09d0e13a288",
            "description": "Treasury WI 7-year yield 3.790% before $44 billion auction.",
            "link": "https://www.markets.news/headlines/9fe17461-3d29-4a1a-9db1-e09d0e13a288",
            "pub_date": "2026-02-27 02:00:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROC Orthopedics and Dr. Mark Wagner win Silver Award for Best Orthopedics in 2025 Best of the Rose City, Portland.",
            "id": "095fc191-1c88-4cda-898f-3f0604f7fc8f",
            "description": "Portland, Oregon on February 26, 2026 - ROC Orthopedics in Portland has received the Silver Award for Best Orthopedics in the 2025 Best of the Rose City awards. This recognition underscores the community's acknowledgment of the quality and patient-centered care offered by the orthopedic center. The award highlights the dedication of ROC Orthopedics in providing trusted orthopedic services in Portland.",
            "link": "https://www.markets.news/headlines/095fc191-1c88-4cda-898f-3f0604f7fc8f",
            "pub_date": "2026-02-27 01:51:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Krispy Kreme (NASDAQ: DNUT) beats profit expectations, shares rise as it reports Q4 EPS of 9 cents (>3 cents est) with sales of $392.367M (> $386.715M est). Company focuses on expansion and cash generation.",
            "id": "3af3da04-1132-49b4-9a32-263e9042fd66",
            "description": "Shares of Krispy Kreme, Inc. (NASDAQ: DNUT) climbed on Thursday following the company's strong financial performance. The popular doughnut chain exceeded profit expectations and surpassed Wall Street's sales forecast. Investors were impressed by the company's efforts in optimizing its store presence and plans to expand distribution, while also focusing on improving cash generation. Krispy Kreme's stock has emerged as one of the top performers of the day. In the fourth quarter, the company reported adjusted earnings per share of nine cents, beating the estimated three cents. Quarterly sales totaled $392.367 million, higher than the expected $386.715 million. Despite a 3.9% decrease in organic revenue, attributed to the strategic closure of underperforming locations, Krispy Kreme's performance has left a positive impact.",
            "link": "https://www.markets.news/headlines/3af3da04-1132-49b4-9a32-263e9042fd66",
            "pub_date": "2026-02-27 01:51:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baidu reported Q4 2025 revenue of RMB 26.1 billion, with AI Cloud Infra revenue up 34% year-over-year, and Apollo Go providing over 20 million rides.",
            "id": "e0884b7f-6fa7-4125-be5f-c01ff72de9a1",
            "description": "Baidu, Inc. reported its fourth-quarter and fiscal year earnings in 2025 with total revenue in Q4 reaching RMB 26.1 billion. Revenue from the core AI-powered business exceeded RMB 11 billion, representing 43% of the total revenue. Apollo Go, their autonomous ride-hailing service, provided 3.4 million fully driverless rides in the quarter with total rides increasing by over 200% year over year. Revenue from AI Cloud Infra reached around RMB 20 billion, up 34% year over year. Revenue from AI applications surpassed RMB 10 billion in 2025. They announced the proposed spin-off and separate listing of Kunlunxing, their self-developed AI chips. The AI accelerator infrastructure saw a 143% year-over-year growth in subscription-based revenue. Apollo Go expanded its services to new cities globally, reaching a total of 26 cities by February 2026. In Q4, they were testing autonomous vehicles in London, and Abu Dhabi and Dubai as part of their global expansion plans. They also announced a partnership with Uber to bring autonomous ride-hailing services to Dubai. Baidu is focusing on safety, aiming to enhance operational excellence and unit economics while ensuring safety standards are met. With AI integrated across their portfolio, they aim to transform mobility for billions of people globally.",
            "link": "https://www.markets.news/headlines/e0884b7f-6fa7-4125-be5f-c01ff72de9a1",
            "pub_date": "2026-02-27 01:51:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orion introduces Denali AI Enterprise version with Report Assistant and Query Studio, enhancing advisor productivity. #Orion #AI #Advisors",
            "id": "ee1b3cd2-7c9c-485a-9e57-3af9f14bbd23",
            "description": "Orion, based in Omaha, Nebraska, has reached a significant development in its AI platform strategy at Ascent 2026 by launching the enterprise version of Orion Denali AI. This version is currently live, and there are plans to expand availability later this year to provide the integrated AI experience to advisors and firms of various sizes. In addition to this launch, Orion has introduced two new AI Assistants, namely the Report Assistant and Query Studio. These advancements align with Orion's ongoing leadership in the industry and its momentum in AI technology. This announcement comes after the recent introduction of the AI platform.",
            "link": "https://www.markets.news/headlines/ee1b3cd2-7c9c-485a-9e57-3af9f14bbd23",
            "pub_date": "2026-02-27 01:52:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AHF sues Florida over emergency rule cutting AIDS drugs to 16,000. Action filed to challenge validity, protect public health.",
            "id": "c569daec-934d-4839-9466-b013c13da76a",
            "description": "In Tallahassee, Florida, AIDS Healthcare Foundation (AHF) has taken action by filing an administrative challenge against a recent emergency rule implemented by the Florida Department of Health. This move comes ahead of a scheduled hearing with State Administrative Law Judge W. David Watkins. The Department of Health has utilized emergency powers to safeguard public health, but the consequence has led to 16,000 individuals in Florida being denied access to their HIV medications. This legal dispute has emerged on the brink of a court hearing.",
            "link": "https://www.markets.news/headlines/c569daec-934d-4839-9466-b013c13da76a",
            "pub_date": "2026-02-27 01:52:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tungsten prices have surged fivefold in the past year due to underinvestment and Chinese export restrictions.",
            "id": "1d6573d5-301a-4826-b2ee-1ee5d3f87f8f",
            "description": "GoldHaven Resources Corp. announced in Vancouver, BC on Feb. 26, 2026 that Tungsten prices have increased significantly over the last year, experiencing a fivefold surge. This rise in prices can be attributed to prolonged underinvestment in the industry and a reduction in Chinese exports, leading to market tightness. Analysts at BMO have warned about the potential implications of this trend.",
            "link": "https://www.markets.news/headlines/1d6573d5-301a-4826-b2ee-1ee5d3f87f8f",
            "pub_date": "2026-02-27 01:53:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}