{
    "data": [
        {
            "title": "Flowco Holdings Inc. (NYSE: FLOC) reports Q4 and full year 2025 results for oil and gas industry solutions.",
            "id": "90f4efe4-07f0-44b0-b490-686126f9a689",
            "description": "Houston-based company Flowco Holdings Inc. (NYSE: FLOC) recently disclosed their financial results for Q4 and the entire year ending on December 31, 2025. Flowco specializes in offering production optimization, artificial lift, and emissions management services for the oil and natural gas sector. The figures for 2024 mentioned in the report are from a time when their operating subsidiary, Flowco MergeCo LLC (“Flowco LLC”), was privately owned.",
            "link": "https://www.markets.news/headlines/90f4efe4-07f0-44b0-b490-686126f9a689",
            "pub_date": "2026-02-26 19:04:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royal Bank of Canada reports Q1 2026 results: Net income $5.8B, up 13% YoY. Diluted EPS $4.03, up 14% YoY. ROE 17.6%, CET1 ratio 13.7%.",
            "id": "f3c91676-67e7-47d9-be7e-176d192d1895",
            "description": "Royal Bank of Canada reported record net income of $5.8 billion, up 13% from the prior year, with diluted EPS at $4.03, up 14%. Adjusted net income was $5.9 billion, a 12% increase, and adjusted diluted EPS was $4.08, up 13%. The bank achieved record pre-provision pre-tax earnings of $8.5 billion, a 14% rise, driven by higher net interest income and fee-based revenue. The PCL on loans ratio increased by 2 bps to 41 bps QoQ. CET1 ratio was 13.7%, exceeding regulatory requirements. Capital Markets showed a 3% increase in net income to $1.47 billion, with higher revenue in Global Markets partially offset by higher PCL. Personal Banking, Commercial Banking, Wealth Management, and Capital Markets displayed strong performance, while Insurance showed a decrease. Total ACL stood at $7.8 billion, up 2 bps QoQ. RBC also returned $3.3 billion to shareholders through buybacks and dividends, maintaining a robust capital position.",
            "link": "https://www.markets.news/headlines/f3c91676-67e7-47d9-be7e-176d192d1895",
            "pub_date": "2026-02-26 19:05:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dd51965e-69ea-42f7-8c91-0645358b9500",
            "description": "AMAZON: LAUNCHED THE AWS EDUCATION EQUITY INITIATIVE, COMMITTING UP TO $100 MLN IN CLOUD AND AI TECHNOLOGY THROUGH 2029",
            "link": "https://www.markets.news/headlines/dd51965e-69ea-42f7-8c91-0645358b9500",
            "pub_date": "2026-02-26 19:05:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "606fc8e2-dfbd-4014-aca8-cd9e028518de",
            "description": "Belarusian President Alexander Lukashenko arrives in Moscow",
            "link": "https://www.markets.news/headlines/606fc8e2-dfbd-4014-aca8-cd9e028518de",
            "pub_date": "2026-02-26 19:05:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "11a95145-2830-420b-93dd-b6804386c3b6",
            "description": "ROYAL BANK OF CANADA Q1 NET INCOME CAD 5,785 MILLION  Q1 EPS CAD 4.03  Q1 ROE 17.6%  Q1 REVENUE CAD 17,960 MILLION VS ESTIMATE CAD 17,458 MILLION  Q1 ADJUSTED EPS CAD 4.08 VS ESTIMATE CAD 3.85  Q1 PROVISION FOR CREDIT LOSSES CAD 1,100 MILLION  Q1 CET1 CAPITAL RATIO",
            "link": "https://www.markets.news/headlines/11a95145-2830-420b-93dd-b6804386c3b6",
            "pub_date": "2026-02-26 19:05:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Millicom (Tigo) Q4 2025 earnings: Revenue $1.7B, up 4.7% organically; Operating profit $469M; Net profit $252M. FY 2025: Revenue $5.8B, Operating profit $1.6B, Net profit $1.3B.",
            "id": "74b6767f-450d-4d29-9c56-37a5b32cb5f1",
            "description": "Millicom (Tigo) reported its Q4 2025 earnings with revenue at $1.7 billion, a 4.7% organic yearly increase, and operating profit at $469 million. Adjusted EBITDA reached $778 million, with a net profit of $252 million. For FY 2025, revenue was $5.8 billion, a 2.0% organic increase, operating profit reached $1.6 billion, and Adjusted EBITDA was $2.7 billion. Net profit totaled $1.3 billion, including $727 million from infrastructure transactions. Equity free cash flow stood at $278 million for Q4 2025 and $916 million for FY 2025. Leverage was at 2.31x including Uruguay and Ecuador profitability post-acquisition. This growth is showcased through financial highlights in revenue up by 15.7% (Q4 2025) and 2.0% (FY 2025) with operating profit up by 25.7% (Q4 2025) and 22.2% (FY 2025). For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/74b6767f-450d-4d29-9c56-37a5b32cb5f1",
            "pub_date": "2026-02-26 19:05:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Privia Health reported strong financial results for 2025: Net Cash Provided by Operating Activities +49.5% from 2024, Adjusted EBITDA $125.5M (+38.8%), and Cash Balance $479.7M. Guidance for 2026 includes ~20% Adjusted EBITDA growth.",
            "id": "e0878c76-2503-4038-a499-01fe2d83e59d",
            "description": "Privia Health Group, Inc. announced its financial and operating results for the fourth quarter and full year ended December 31, 2025. The company's metrics for the year exceeded the high end of its guidance ranges, with key figures including: Total revenue for 2025 was $2.1 billion, a 22.3% increase from 2024. Net income saw a significant rise of 59.3% to $22.9 million. Adjusted EBITDA also increased by 38.8% to $125.5 million. The company ended 2025 with a cash balance of $479.7 million and no debt. Financial outlook for 2026 includes projected revenue growth of 10.7% to 15.4% across various metrics like attributed lives, practice collections, and adjusted EBITDA. The company aims to convert approximately 80% of adjusted EBITDA to free cash flow in 2026 and end the year with around $600 million in cash and cash equivalents. The company is focused on organic provider growth, performance in value-based arrangements, achieving operating leverage, and strategic business development activities for further expansion. The company will host a conference call to discuss these results and its future outlook. Additional information and financial statements are available on the company's Investor Relations website.",
            "link": "https://www.markets.news/headlines/e0878c76-2503-4038-a499-01fe2d83e59d",
            "pub_date": "2026-02-26 19:05:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Victor Technology launches new fidget spinner calculators - SpinCalc and SpinShield - to tackle classroom distractions.",
            "id": "d40811e8-d8ff-482c-936b-1c49a266b631",
            "description": "A company based in Bolingbrook, Illinois, Victor Technology, announced on February 26, 2026, the release of two new fidget spinner calculator solutions - SpinCalc and SpinShield. These products integrate fidget spinner functionality with calculator features. Victor Technology is known for providing innovative workplace solutions.",
            "link": "https://www.markets.news/headlines/d40811e8-d8ff-482c-936b-1c49a266b631",
            "pub_date": "2026-02-26 19:05:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mars launches $85M Mars Impact Fund to support community resilience, scientific opportunity, and animal wellbeing by 2027.",
            "id": "2ab1266b-3be1-4cc5-ae0f-4b8fff37761c",
            "description": "A new philanthropic organization is enhancing Mars' dedication to supporting community resilience, scientific advancement, and the wellbeing of companion animals. They have pledged $85 million from 2025 to 2027, with an annual funding commitment of $50 million from 2028 onwards. The initial grants are focused on bolstering community resilience in Indonesia.",
            "link": "https://www.markets.news/headlines/2ab1266b-3be1-4cc5-ae0f-4b8fff37761c",
            "pub_date": "2026-02-26 19:05:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target and Roller Rabbit collaborate on 250+ item collection; featuring luggage and exclusive prints. Launches Mar 7 online.",
            "id": "c4668638-a16e-4842-b628-2eef3e12b42d",
            "description": "A diverse assortment of over 250 products covering various categories is set to be released, featuring notable highlights such as Roller Rabbit venturing into the luggage segment for the first time. Additionally, an exclusive print designed specifically for the Roller Rabbit x Target collaboration will be introduced. The launch date for this collection is scheduled for March 7, available online and at the majority of Target stores. Exclusive in-store items will also be offered. The launch event will take place in MINNEAPOLIS on Feb. 26, 2026.",
            "link": "https://www.markets.news/headlines/c4668638-a16e-4842-b628-2eef3e12b42d",
            "pub_date": "2026-02-26 19:05:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9c7b9653-7b06-43b9-b50e-8e3fe27b34bd",
            "description": "India and Israel sign MOU in field of geophysical exploration",
            "link": "https://www.markets.news/headlines/9c7b9653-7b06-43b9-b50e-8e3fe27b34bd",
            "pub_date": "2026-02-26 18:53:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "bb5a8e8f-449e-45a4-83e3-433aadc2a1d1",
            "description": "Peskov: attempts to supply Kyiv with nuclear weapons cannot be ignored in negotiations on a Ukrainian settlement",
            "link": "https://www.markets.news/headlines/bb5a8e8f-449e-45a4-83e3-433aadc2a1d1",
            "pub_date": "2026-02-26 18:55:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Employee representatives elected to the Supervisory Board of Jyske Bank A/S. A total of X representatives chosen.",
            "id": "405a41ad-ba92-4e16-b616-392d64d8a571",
            "description": "An election was conducted for employee representatives and their alternates to the Supervisory Board of Jyske Bank A/S. The process saw participation from a significant number of employees, with a total of X candidates running for various positions. This election reflects a commitment to ensuring employee representation within the governance structure of the bank, with the results set to bring in new voices and perspectives to the Supervisory Board. The outcome of this election is likely to influence the decision-making processes and strategic direction of Jyske Bank A/S moving forward, showcasing a dedication to inclusivity and diversity in corporate leadership.",
            "link": "https://www.markets.news/headlines/405a41ad-ba92-4e16-b616-392d64d8a571",
            "pub_date": "2026-02-26 18:58:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canadian Imperial Bank (NYSE: CM) exceed Q1 estimated earnings by 13.79%, reporting EPS of $1.98. Revenue increased by $897.00 million year-over-year.",
            "id": "feb02708-d79c-486b-8e6f-0e34c60c6aed",
            "description": "Canadian Imperial Bank, trading on NYSE under the ticker CM, released its Q1 earnings report on February 26, 2026 at 05:30 AM. The bank surpassed estimated earnings by 13.79%, achieving an EPS of $1.98 compared to the expected $1.74. Revenue saw a significant increase, rising by $897.00 million compared to the previous year. In the previous quarter, the company also outperformed expectations. For more details, the complete story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/feb02708-d79c-486b-8e6f-0e34c60c6aed",
            "pub_date": "2026-02-26 18:58:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Demand for Bitcoin surges with US Spot ETFs attracting $506M, marking first rebound in months as Coinbase premium turns positive.",
            "id": "1432314d-904c-4367-af77-648a96a65bc8",
            "description": "Demand for Bitcoin has seen a resurgence for the first time since November, with Exchange-Traded Fund (ETF) inflows reaching $506 million. Additionally, the premium for Coinbase has turned positive, indicating renewed interest in the cryptocurrency.",
            "link": "https://www.markets.news/headlines/1432314d-904c-4367-af77-648a96a65bc8",
            "pub_date": "2026-02-26 18:59:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Multitude AG to publish financial reports under German Securities Act (WpHG) Articles 114, 115, 117.",
            "id": "01946e5e-ffd0-4ed9-9b04-95061076c9be",
            "description": "Multitude AG has issued a preliminary notice regarding the upcoming release of financial reports in compliance with Articles 114, 115, and 117 of the WpHG [German Securities Act]. Stay tuned for further updates on the company's financial performance.",
            "link": "https://www.markets.news/headlines/01946e5e-ffd0-4ed9-9b04-95061076c9be",
            "pub_date": "2026-02-26 18:46:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8bf6b0c4-f220-4136-8d1a-6157ba82cd73",
            "description": "Israel PM office: 'Meeting between Prime Minister Benjamin Netanyahu and Indian Prime Minister Narendra Modi. The two leaders will sign a series of agreements between Israel and India in economic, security, and diplomatic fields that will boost cooperation between the countries",
            "link": "https://www.markets.news/headlines/8bf6b0c4-f220-4136-8d1a-6157ba82cd73",
            "pub_date": "2026-02-26 18:47:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a8ae0049-165e-4c8b-aee8-fc38d4ac374d",
            "description": "NORDIC COUNTRIES INVESTIGATE A THREAT TO THE REGION'S ENERGY INFRASTRUCTURE- REPORTS",
            "link": "https://www.markets.news/headlines/a8ae0049-165e-4c8b-aee8-fc38d4ac374d",
            "pub_date": "2026-02-26 18:47:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ExperTrait launches UK's first emergency-ready platform, aims to eliminate quote delays in £58B professional services market; tackles trust deficit with multi-layered verification system.",
            "id": "4a77625c-4e4e-47c6-a765-65a7ed373b65",
            "description": "ExperTrait, a digital marketplace platform based in Gillingham, England, has recently been introduced on iOS and Android. The platform, available at www.expertrait.com, aims to combat the trust issues prevalent in the UK's professional services industry. Through a multi-layered verification system, ExperTrait is addressing key concerns in the sector. Research indicates that 67% of UK consumers are hesitant to bring unverified individuals into their homes. Additionally, tradespeople experience income loss while waiting for work opportunities. With its launch, ExperTrait seeks to alleviate these challenges by providing a secure environment for both service providers and consumers.",
            "link": "https://www.markets.news/headlines/4a77625c-4e4e-47c6-a765-65a7ed373b65",
            "pub_date": "2026-02-26 18:48:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "18c08739-13d0-4d4f-a241-cb411ed5e841",
            "description": "AMAZON: REFUSED PERMISSION TO APPEAL GO-AHEAD FOR TWO UK LAWSUITS FROM RETAILERS, CONSUMERS",
            "link": "https://www.markets.news/headlines/18c08739-13d0-4d4f-a241-cb411ed5e841",
            "pub_date": "2026-02-26 18:49:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}