{
    "data": [
        {
            "title": "NREF reported Q4 2025 net income of $13.6 million, or 0.52 per diluted share; gives Q1 2026 guidance.",
            "id": "f559f0b7-fbeb-44cd-bf93-9318c448fbce",
            "description": "In Dallas on February 26, 2026, NexPoint Real Estate Finance, Inc. (NREF) announced their financial results for the quarter ending December 31, 2025. The company disclosed a net income of $13.6 million for common stockholders, equivalent to 0.52 per diluted share. NREF is listed on the NYSE under the ticker symbol NREF.",
            "link": "https://www.markets.news/headlines/f559f0b7-fbeb-44cd-bf93-9318c448fbce",
            "pub_date": "2026-02-26 21:18:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Manulife | Comvest Credit Partners leads recapitalization of AC Milan, acting as administrative agent on credit facility.",
            "id": "55f97c5d-3d66-4ca9-b32f-0a4824568900",
            "description": "In West Palm Beach, Florida, on February 26, 2026, Manulife | Comvest Credit Partners revealed its role as the administrative agent in a credit facility for Associazione Calcio Milan (\"AC Milan\" or \"the club\"). The club will be receiving financial support through this arrangement.",
            "link": "https://www.markets.news/headlines/55f97c5d-3d66-4ca9-b32f-0a4824568900",
            "pub_date": "2026-02-26 21:18:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rithm Property Trust authorizes $10M stock repurchase program by March 1, 2027, under applicable securities laws.",
            "id": "9044a7cf-7704-4cce-9b20-b3bb126c08f2",
            "description": "Rithm Property Trust Inc. (NYSE: RPT) disclosed plans for a $10 million repurchase of the company's Common Stock by March 1, 2027. This decision was approved by the Board of Directors and allows for repurchases through various methods such as open market transactions, privately negotiated deals, or block trades, in adherence to relevant securities laws. The repurchase strategy will also follow regulations outlined in repurchase plans to ensure compliance with governing rules and regulations.",
            "link": "https://www.markets.news/headlines/9044a7cf-7704-4cce-9b20-b3bb126c08f2",
            "pub_date": "2026-02-26 21:18:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quantum Health partners with Lantern to offer value-based specialty care to self-insured employers. Healthcare costs expected to rise 6.5% by 2026.",
            "id": "bd97d9fd-a66c-42bd-99bd-518bdd152e6b",
            "description": "In Dublin, Ohio, Quantum Health, a prominent healthcare navigation firm, has revealed a fresh collaboration with Lantern, a value-centered specialty care platform. This partnership broadens the choices accessible to self-insured employers in search of top-notch Centers of Excellence (COEs) and results-oriented specialty care alternatives. Anticipated for 2026 is a noteworthy spike in healthcare expenses for employers, marking the most substantial increase in 15 years at a projected 6.5% surge. Businesses are progressively emphasizing superior...",
            "link": "https://www.markets.news/headlines/bd97d9fd-a66c-42bd-99bd-518bdd152e6b",
            "pub_date": "2026-02-26 21:19:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CACI plans to issue $500 million senior notes due 2033. Proceeds will be used alongside credit facility borrowings.",
            "id": "eeb4d1b5-b064-4e17-bcf4-0d6a6831cd33",
            "description": "RESTON, Virginia - CACI International Inc (NYSE: CACI) has initiated an offering of $500 million in unsecured senior notes due 2033. The notes, part of the same series as the Company’s 6.375% senior notes due 2033 issued in June 2025, will be used alongside borrowings under its revolving credit facility. This move is aimed at raising funds for unspecified purposes.",
            "link": "https://www.markets.news/headlines/eeb4d1b5-b064-4e17-bcf4-0d6a6831cd33",
            "pub_date": "2026-02-26 21:19:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Proxima Fusion, RWE, Bavaria, & IPP to build world's 1st commercial fusion plant in Europe. Stellarator Alpha key.",
            "id": "1178471a-2937-49f1-8d03-c925a6fcc812",
            "description": "A notable fusion energy company, Proxima Fusion, headquartered in Munich, has recently inked a significant deal with the Free State of Bavaria, RWE, and Max Planck Institute for Plasma Physics (IPP). This collaboration aims to establish the world's pioneering commercial stellarator fusion power plant within Europe. The Memorandum of Understanding (MoU) sets out a strategic path towards achieving commercial fusion energy in Europe, starting with the construction of the demonstration stellarator named Alpha. This groundbreaking initiative marks a crucial step forward in the fusion energy sector.",
            "link": "https://www.markets.news/headlines/1178471a-2937-49f1-8d03-c925a6fcc812",
            "pub_date": "2026-02-26 21:19:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Burford Capital's Q4 earnings report shows EPS of $-0.17, missing estimated earnings by -144.74%, with revenue down $48.47 million.",
            "id": "46118ebe-76bf-4c62-958a-8f621369af70",
            "description": "Burford Capital (NYSE: BUR) released its Q4 earnings report on February 26, 2026, at 08:00 AM. The report revealed that the company missed estimated earnings by -144.74%, reporting an EPS of $-0.17 compared to an estimate of $0.38. Additionally, revenue decreased by $48.47 million from the same period last year. This marks a significant decline in performance for the company. More detailed analysis of past earnings and the implications of this latest announcement can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/46118ebe-76bf-4c62-958a-8f621369af70",
            "pub_date": "2026-02-26 21:20:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zscaler likely to report 2Q earnings of 90 cents/share, revenue at $798.92M. Shares rose 4.2% to $155.70. Acquisition announced.",
            "id": "02d9e24e-dfae-443f-9372-eb97c825a364",
            "description": "Zscaler, Inc. (ZS) is set to report its second-quarter earnings on Thursday, Feb. 26, with analysts predicting earnings of 90 cents per share compared to 78 cents per share a year ago. Revenue for the quarter is estimated to be around $798.92 million, an increase from $647.9 million in the previous year. This data is sourced from Benzinga Pro. Additionally, on Feb. 5, Zscaler acquired SquareX. Preceding the earnings release, Zscaler's shares climbed by 4.2%, closing at $155.70 on Wednesday. For further insights into analyst ratings, Benzinga readers can visit the Analyst Stock Ratings page to filter by stock ticker, company name, analyst firm, or rating changes. The complete article can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/02d9e24e-dfae-443f-9372-eb97c825a364",
            "pub_date": "2026-02-26 21:20:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IGY Marinas renews management agreement for St. Katharine Docks Marina, London, offers charm with 200 years of history.",
            "id": "1acd4f33-99c6-4fb0-b8a0-5381e3afb126",
            "description": "MarineMax, Inc., a leading recreational boat and yacht retailer (NYSE: HZO), renewed its management and marketing agreement for St. Katharine Docks Marina in London, England. The agreement was announced by its subsidiary, IGY Marinas, reflecting the company's strong presence in the industry. St. Katharine Docks Marina is a historic nautical destination in London, boasting 200 years of charm. The marina's strategic location in one of the world's renowned cities attracts marine enthusiasts worldwide. This renewal signifies the company's commitment to maintaining and enhancing its portfolio in key global destinations.",
            "link": "https://www.markets.news/headlines/1acd4f33-99c6-4fb0-b8a0-5381e3afb126",
            "pub_date": "2026-02-26 21:20:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3359cc6a-fc23-470b-b9c3-05103e026fc3",
            "description": "TALKS BETWEEN THE US AND IRAN IN GENEVA THIS MORNING WERE BOTH INDIRECT AND DIRECT, PER SOURCE WITH KNOWLEDGE - AXIOS REPORTER ON X",
            "link": "https://www.markets.news/headlines/3359cc6a-fc23-470b-b9c3-05103e026fc3",
            "pub_date": "2026-02-26 21:20:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Data Center World 2026 expands program lineup in Washington, D.C., April 20–23, with record-breaking expo floor and new conference experiences.",
            "id": "2881520b-e5e4-4ac4-9c80-ab50a507ffb2",
            "description": "A major event in the data center industry, Data Center World, has revealed its 2026 program lineup which is set to take place from April 20-23 at the Walter E. Washington Convention Center in Washington, D.C. The event will focus on positioning the industry in the midst of the AI era and will boast a larger expo floor than ever before. This edition of the event emphasizes \"Innovation at Scale\" and will showcase new conference experiences and executive forums, aiming to bring together data center experts and thought leaders. With a record-breaking expo floor, the event is expected to draw a significant number of participants and showcase the latest developments in the field.",
            "link": "https://www.markets.news/headlines/2881520b-e5e4-4ac4-9c80-ab50a507ffb2",
            "pub_date": "2026-02-26 21:10:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CRA Intl Q4 earnings: Misses estimates by 0.0% with $2.06 EPS, revenue up $20.53M. Past quarter beat on earnings.",
            "id": "9ad1d240-cfc2-4de5-8e4c-dea34661e7f8",
            "description": "CRA Intl (NASDAQ: CRAI) released its Q4 earnings on February 26, 2026, at 08:05 AM. The report revealed that the company missed estimated earnings by 0.0%, with an EPS of $2.06 compared to the estimated $2.06. Revenue showed a significant increase of $20.53 million from the prior year's same period. In the previous quarter, CRA Intl exceeded expectations. For further details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/9ad1d240-cfc2-4de5-8e4c-dea34661e7f8",
            "pub_date": "2026-02-26 21:10:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTT DATA and Ericsson partner to boost enterprise use of private 5G & physical AI. Enables AI-driven transformation.",
            "id": "68c94c73-8fc5-49a3-ad32-0be449c37710",
            "description": "In London, NTT DATA, a prominent player in AI and technology services, along with Ericsson (NASDAQ: ERIC), revealed a long-term strategic collaboration to hasten the implementation of private 5G in businesses and unleash advanced edge AI and physical AI applications. This partnership aims to facilitate the integration of intelligence at the edge on a global scale, fostering transformative outcomes through AI-driven solutions. By merging Ericsson’s Private 5G and Edge platforms with NTT DATA's expertise, the collaboration is poised to revolutionize enterprise operations.",
            "link": "https://www.markets.news/headlines/68c94c73-8fc5-49a3-ad32-0be449c37710",
            "pub_date": "2026-02-26 21:10:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Skillsoft, a global company, recognized as a leader in IT training services by IDC MarketScape in North America and Europe.",
            "id": "06dc703d-6320-41fe-a82a-ccdef7418e2b",
            "description": "Skillsoft, a prominent AI-native skills management platform listed on NYSE as SKIL, has recently been recognized as a Leader in the field of IT Training Services in North America and Europe by IDC MarketScapes. This acknowledgment is significant as businesses are increasingly aiming to leverage their AI investments effectively. As per the IDC MarketScape report on North America Training Services, it is estimated that global economic losses due to skills shortages could potentially reach a significant amount by the end of next year.",
            "link": "https://www.markets.news/headlines/06dc703d-6320-41fe-a82a-ccdef7418e2b",
            "pub_date": "2026-02-26 21:10:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Energy executives in the US are optimistic about 2026 growth, according to Pathward's survey. Sioux Falls, S.D (BUSINESS WIRE)",
            "id": "55662e8c-d20b-41c4-9334-bb629d2ee2b8",
            "description": "A recent survey conducted by Pathward in Sioux Falls, South Dakota reveals that U.S. energy executives are highly optimistic about growth in 2026. The executives showed confidence in the industry's potential for expansion, with a majority expressing positive outlooks for the coming year. This survey provides valuable insights into the sentiments among key decision-makers, indicating a promising future for the energy sector.",
            "link": "https://www.markets.news/headlines/55662e8c-d20b-41c4-9334-bb629d2ee2b8",
            "pub_date": "2026-02-26 21:11:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia's strong earnings fail to boost markets as investor concerns persist amidst AI growth.",
            "id": "b5ea3bc9-2d58-4475-9aeb-e1a392e64b9f",
            "description": "The leading chip company in the artificial intelligence sector surpassed expectations once more. However, concerns from investors persisted despite their positive performance.",
            "link": "https://www.markets.news/headlines/b5ea3bc9-2d58-4475-9aeb-e1a392e64b9f",
            "pub_date": "2026-02-26 21:11:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Polyrizon Ltd. (PLRZ) confirms enhanced nasal deposition profile of its naloxone formulation compared to commercial reference product.",
            "id": "e139d577-0fbc-4972-88aa-a6ddec123249",
            "description": "An Israeli company, Polyrizon Ltd. (Nasdaq: PLRZ), recently released findings from a study comparing the nasal deposition profiles of its naloxone product and a competing commercial item. Polyrizon Ltd. specializes in pre-clinical biotechnology and focuses on intranasally administered solutions. The study examined how well the company's formulation of naloxone targeted specific nasal regions in comparison to the reference product. This study contributes to the ongoing research and development efforts of Polyrizon Ltd. in the field of nasal drug delivery.",
            "link": "https://www.markets.news/headlines/e139d577-0fbc-4972-88aa-a6ddec123249",
            "pub_date": "2026-02-26 21:13:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CrowdStrike offers FalconID for multi-factor authentication with real-time protection against phishing attacks.",
            "id": "ca7e19ff-6ed3-4618-9578-9acd86530608",
            "description": "In Austin, Texas, CrowdStrike (NASDAQ: CRWD) has launched FalconID, which is now widely accessible, expanding the Falcon® platform by adding zero-friction, phishing-resistant MFA. Recognizing the critical role of identity in contemporary attacks, this launch reinforces CrowdStrike’s position as a leader in Next-Gen Identity Security by offering real-time, risk-conscious defense against AI-driven phishing attacks and credential exploitation during authentication. Their intelligent security framework provides comprehensive protection, covering identity security challenges efficiently.",
            "link": "https://www.markets.news/headlines/ca7e19ff-6ed3-4618-9578-9acd86530608",
            "pub_date": "2026-02-26 21:14:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IEI highlights secure Edge Infrastructure at Embedded World 2026, combining Edge AI, cybersecurity, & resilience.",
            "id": "e5e22b39-6e87-4fbe-84d0-beffd14d66fb",
            "description": "Unveiling at Embedded World 2026 in TAIPEI on February 26, 2026, IEI Integration Corp. (IEI) reveals cutting-edge industrial platforms that prioritize security. These platforms seamlessly integrate Edge AI capabilities, robust lifecycle cybersecurity measures, and essential mission-critical resilience features. IEI's showcase at Hall 3 exemplifies their commitment to innovation in the industry.",
            "link": "https://www.markets.news/headlines/e5e22b39-6e87-4fbe-84d0-beffd14d66fb",
            "pub_date": "2026-02-26 21:14:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dbe3cab0-65b1-4ec5-bd0a-7eebec2483df",
            "description": "WARNER BROS CEO SAYS CO HAS ENGAGED WITH 4 BIDDERS, WHICH LED TO 8 PRICE INCREASES AND HAVE THUS FAR ACHIEVED 63% INCREASE IN VALUE VERSUS FIRST OFFER RECEIVED IN SEPTEMBER",
            "link": "https://www.markets.news/headlines/dbe3cab0-65b1-4ec5-bd0a-7eebec2483df",
            "pub_date": "2026-02-26 21:15:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}