{
    "data": [
        {
            "title": "",
            "id": "47ae5617-b19a-4e1d-86d3-2bb1a42b06bd",
            "description": "INDIA, EU TO PROMOTE PAPERLESS TRADE, LEGALLY RECOGNISE ELECTRONIC CONTRACTS, SIGNATURES AND AUTHENTICATION UNDER FTA DIGITAL RULES- DRAFT TEXT SHOWS",
            "link": "https://www.markets.news/headlines/47ae5617-b19a-4e1d-86d3-2bb1a42b06bd",
            "pub_date": "2026-02-28 00:56:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SEGG Media highlights Veloce's $61 million majority acquisition, expecting over $20 million revenue from it in 2026.",
            "id": "f061a713-0335-4af2-8f0b-1185c7c94755",
            "description": "The acquisition is anticipated to generate more than $20 million in revenue in the year 2026.",
            "link": "https://www.markets.news/headlines/f061a713-0335-4af2-8f0b-1185c7c94755",
            "pub_date": "2026-02-28 00:56:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Societe Generale reports number of shares and voting rights as of 23 Feb 2026 in regulated information.",
            "id": "9cf73c36-036e-4b97-9b5e-06890aa3f5ad",
            "description": "On 23rd February 2026, the current share capital of the company is represented by a total of shares. This composition further corresponds to the total number of voting rights available within the organization. This information is disclosed as regulated data and is relevant for stakeholders and investors.",
            "link": "https://www.markets.news/headlines/9cf73c36-036e-4b97-9b5e-06890aa3f5ad",
            "pub_date": "2026-02-28 00:57:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UCP accused of mismanagement in Alberta budget: 6x royalty revenue, tax hikes, deficits, service cuts. CUPE demands new approach.",
            "id": "1915e432-a4bc-4f25-b616-a416a4a08728",
            "description": "In Edmonton, the UCP government has increased royalties, resulting in nearly six times higher revenue compared to the previous administration. Despite this, they are implementing tax hikes, deficits, and service cuts. CUPE Alberta President Raj Uppal criticizes the UCP's approach, stating that over the past six years, corporate taxes were slashed, education and healthcare were underfunded, and funding for post-secondary and municipalities was cut. The recent budget reveals a significant deficit, tax raises, and unresolved issues in governmental funding.",
            "link": "https://www.markets.news/headlines/1915e432-a4bc-4f25-b616-a416a4a08728",
            "pub_date": "2026-02-28 00:58:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NextNav Inc. (NASDAQ:NN) appoints Lisa Hook to its Board of Directors, effective Feb. 24, 2026. She will also become Lead Independent Director.",
            "id": "06ca29b7-2700-41ac-b3c7-280f4da92125",
            "description": "NextNav Inc. (NASDAQ: NN), a key player in advanced terrestrial Positioning, Navigation, and Timing (PNT) and 3D geolocation solutions, has named Lisa Hook to its Board of Directors, starting from February 24, 2026. Ms. Hook will take on the role of Lead Independent Director and join the Company’s Technology and National Defense as well as Compensation and Human Capital Committees. The appointment marks an important development for NextNav Inc. as it continues to strengthen its leadership team to drive growth and innovation in the industry.",
            "link": "https://www.markets.news/headlines/06ca29b7-2700-41ac-b3c7-280f4da92125",
            "pub_date": "2026-02-28 00:58:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "California American Water invests over $200 million in 2025 for statewide infrastructure upgrades, prioritizing system reliability and water quality for customers.",
            "id": "d38f6e09-0087-46e8-9301-92ad0f733d6c",
            "description": "Enhancing System Dependability and Water Purity for Consumers In San Diego on February 27, 2026, California American Water disclosed its investment summary for 2025 focusing on enhancing system reliability and water quality. The total investment surpassed $200 million, allocated towards upgrading water and wastewater systems across the region.",
            "link": "https://www.markets.news/headlines/d38f6e09-0087-46e8-9301-92ad0f733d6c",
            "pub_date": "2026-02-28 00:58:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "bbda9360-912e-4e7d-b881-842b2280f736",
            "description": "PANAMA PORTS COMPANY: PPC AND ITS INVESTORS EXPRESSLY AND CONTINUOUSLY RESERVE ALL APPLICABLE RIGHTS",
            "link": "https://www.markets.news/headlines/bbda9360-912e-4e7d-b881-842b2280f736",
            "pub_date": "2026-02-28 00:59:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump Media plans to separate Truth Social, a money-losing social media platform, amid merger talks with a fusion power company.",
            "id": "72ba23c4-97fe-42db-9f9c-8ea88cf8be02",
            "description": "As part of its strategic plan, the company is planning to separate its unprofitable social media platform. This decision comes as the company aims to merge with a fusion power corporation. The separated social media platform has been incurring losses. The company believes that this move will better position them for the upcoming merger.",
            "link": "https://www.markets.news/headlines/72ba23c4-97fe-42db-9f9c-8ea88cf8be02",
            "pub_date": "2026-02-28 01:01:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client unveils new MTK-103 system for overspray containment, developed by a construction worker from Alabama.",
            "id": "bb92752b-d201-4dae-9653-b2cb8e338d0c",
            "description": "In Pittsburgh on February 27, 2026, an inventor from Prattville, Alabama, shared his inspiration for creating a new folding device. This device aims to provide a better solution for controlling overspray from airless paint sprayers commonly used in interior painting projects. The inventor expressed his motivation to innovate in the construction industry and introduced the device under the name CHAMPION'S.",
            "link": "https://www.markets.news/headlines/bb92752b-d201-4dae-9653-b2cb8e338d0c",
            "pub_date": "2026-02-28 00:48:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "20fd5977-35d3-4d93-aa2d-2399ccfdfb1f",
            "description": "UK GOVERNMENT: WE HAVE TAKEN THE PRECAUTIONARY MEASURE TO TEMPORARILY MOVE SOME OF OUR STAFF AND THEIR DEPENDENTS FROM TEL AVIV TO ANOTHER LOCATION WITHIN ISRAEL",
            "link": "https://www.markets.news/headlines/20fd5977-35d3-4d93-aa2d-2399ccfdfb1f",
            "pub_date": "2026-02-28 00:49:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ginkgo Bioworks shifts focus to AI and robotics post challenging quarter. Plans divestment of biosecurity business. Loss of $1.41 per share, sales down 24% to $33.32 million in Q4 2025.",
            "id": "09c5c403-6bbc-4e28-9bac-7306f9e3cc0f",
            "description": "Ginkgo Bioworks reported a loss of $1.41 per share for the fourth quarter of 2025, below the expected $1.36 per share loss. The company's sales were $33.32 million, a decrease of 24% compared to the previous year. Ginkgo Bioworks is shifting its focus towards investing in autonomous labs, leading to plans to divest its biosecurity business to a group of investors for a minority stake. CEO Jason Kelly highlighted the company's collaboration with the Department of Energy and OpenAI. The biosecurity business will operate independently to attract new investors and enhance growth opportunities. This strategic move aims to take advantage of the growing interest in defense technology and private capital markets.",
            "link": "https://www.markets.news/headlines/09c5c403-6bbc-4e28-9bac-7306f9e3cc0f",
            "pub_date": "2026-02-28 00:52:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Levels launches new brand experience, The Founding Udders, introducing Sir Bovine Cowley. Jupiter, Fla., Feb. 27, 2026.",
            "id": "c40e3980-89dd-4426-ba62-af777d2438d3",
            "description": "A well-known brand named The New Brand World has revealed The Founding Udders and Sir Bovine Cowley in Jupiter, Florida on February 27, 2026. Recognized for its natural, simple ingredient whey protein products, Levels has introduced The Founding Udders as a fresh creative concept to stand out in the market.",
            "link": "https://www.markets.news/headlines/c40e3980-89dd-4426-ba62-af777d2438d3",
            "pub_date": "2026-02-28 00:52:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Legislators in Minnesota are mulling a ban on Bitcoin and crypto ATMs due to rise in scams, legislation proposed.",
            "id": "ce289e3f-7714-4a2e-acdb-52c644a20438",
            "description": "Legislators in Minnesota are currently reviewing a proposal to prohibit Bitcoin and cryptocurrency ATMs due to an uptick in fraudulent activities. The proposed legislation is a response to an increasing number of scams involving these machines. The ban aims to curb such incidents and protect consumers from financial losses.",
            "link": "https://www.markets.news/headlines/ce289e3f-7714-4a2e-acdb-52c644a20438",
            "pub_date": "2026-02-28 00:53:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c145e6b4-3edc-4440-a707-f6c29022b097",
            "description": "INDIA, EU AGREE ON DIGITAL TRADE RULES TO CURB UNJUSTIFIED BARRIERS, ENSURE OPEN, SECURE ONLINE ENVIRONMENT UNDER PROPOSED FTA- DRAFT TEXT",
            "link": "https://www.markets.news/headlines/c145e6b4-3edc-4440-a707-f6c29022b097",
            "pub_date": "2026-02-28 00:53:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ray Data teams up with Docling to address Enterprise AI's main challenge, processing over 10k complex files for RAG applications in hours, not days.",
            "id": "fdc936d4-9180-4623-911f-49a612ed625f",
            "description": "A recent collaboration has merged Ray Data's distributed processing technology with Docling's document parsing software to efficiently handle over 10,000 intricate files for RAG applications within a matter of hours, significantly reducing processing time from days to mere hours. This integration marks a major advancement in data processing capabilities, streamlining the workflow and increasing efficiency for large-scale document analysis tasks.",
            "link": "https://www.markets.news/headlines/fdc936d4-9180-4623-911f-49a612ed625f",
            "pub_date": "2026-02-28 00:54:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bryan Regele promoted to Chief Loan Officer at Webster First Federal Credit Union in Worcester, MA succeeding Talat Mufti.",
            "id": "c4285686-fe86-4ac9-8456-0aa6a8975623",
            "description": "In Worcester, Massachusetts on February 27, 2026, Webster First Federal Credit Union announced the promotion of Bryan T. Regele to Senior Vice President and Chief Loan Officer. Regele will be taking over from former CLO Talat Mufti. This promotion highlights Regele's outstanding performance and dedication to the company.",
            "link": "https://www.markets.news/headlines/c4285686-fe86-4ac9-8456-0aa6a8975623",
            "pub_date": "2026-02-28 00:54:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "eb4c6b27-a7e2-46c5-af1a-5f7d54ca2651",
            "description": "GERMANY'S KBA: BMW LAUNCHES NEW RECALL FOR 337,374 VEHICLES WORLDWIDE - DPA NEWS  RECALL AFFECTS I7, I5, 5, 7, M5 SERIES MANUFACTURED BETWEEN 2022 AND 2025  RECALL POTENTIALLY AFFECTS 337,374 VEHICLES WORLDWIDE, 29,441 IN GERMANY",
            "link": "https://www.markets.news/headlines/eb4c6b27-a7e2-46c5-af1a-5f7d54ca2651",
            "pub_date": "2026-02-28 00:55:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2f83997a-71e7-4910-b8f7-02454bd07558",
            "description": "INDIA, EU RECOGNISE PRIVACY AS FUNDAMENTAL RIGHT, RETAIN FULL AUTHORITY OVER PERSONAL DATA PROTECTION, CROSS-BORDER TRANSFER RULES UNDER FTA-DRAFT TEXT",
            "link": "https://www.markets.news/headlines/2f83997a-71e7-4910-b8f7-02454bd07558",
            "pub_date": "2026-02-28 00:55:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "lululemon responds to Chip Wilson's director nominations at 2026 Annual Meeting, emphasizing ongoing engagement.",
            "id": "92380ac6-93d0-4987-828f-5e947c3499a1",
            "description": "lululemon athletica inc. made a statement regarding Chip Wilson's press release about nominating three board director candidates for the company's 2026 Annual Meeting of Shareholders. The company has been engaging with Mr. Wilson in good faith, holding numerous meetings over the past few months to foster productive dialogue. Despite efforts, there seems to be a disagreement on certain matters. The company, listed as (NASDAQ:LULU), is headquartered in Vancouver, British Columbia.",
            "link": "https://www.markets.news/headlines/92380ac6-93d0-4987-828f-5e947c3499a1",
            "pub_date": "2026-02-28 00:45:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9b9ed239-1f90-4fca-a0c6-e2c5c3f98143",
            "description": "EU TO MOBILISE FINANCE AND INVESTMENT TO BACK INDIA’S EMISSIONS CUTS UNDER PROPOSED FTA- REPORTS",
            "link": "https://www.markets.news/headlines/9b9ed239-1f90-4fca-a0c6-e2c5c3f98143",
            "pub_date": "2026-02-28 00:45:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}