{
    "data": [
        {
            "title": "PatentVest report analyzes 1,200+ patent docs on Oral Small-Molecule GLP-1, highlighting exclusivity trends.",
            "id": "5371b4ee-94ea-4c7c-9a74-955c12b8b4e0",
            "description": "Examination of over 1,200 patent documents highlights the programs that are establishing long-lasting exclusivity rights, as well as those that may not be.",
            "link": "https://www.markets.news/headlines/5371b4ee-94ea-4c7c-9a74-955c12b8b4e0",
            "pub_date": "2026-02-27 02:37:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rider Jet Center at Hagerstown Regional Airport wins regional and national awards; recognized for excellence.",
            "id": "5fcdfed5-4fbc-42f3-8f9e-664b637fc3d1",
            "description": "In Hagerstown, Maryland on February 26, 2026, Rider Jet Center, a comprehensive Fixed Base Operator (FBO) located at Hagerstown Regional Airport, has received prestigious regional and national accolades. The center achieved victory in the 2026 Washington County Business Awards, affirming its commitment to excellence in its services...",
            "link": "https://www.markets.news/headlines/5fcdfed5-4fbc-42f3-8f9e-664b637fc3d1",
            "pub_date": "2026-02-27 02:37:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cancun All Inclusive unveils new resorts and exclusive deals for Spring Break 2026. All you need in one place.",
            "id": "da5ce6e3-e51b-4e07-8c25-f7baa5c5b97a",
            "description": "Get ready for an unforgettable Spring Break experience in Cancun, Mexico! Cancun All Inclusive offers a wide range of amenities including All Inclusive Resorts, Airport Transportation, and Tours. Visit their website at www.cancunallinclusive.com for more information. Plan your trip now for the upcoming Spring Break 2026!",
            "link": "https://www.markets.news/headlines/da5ce6e3-e51b-4e07-8c25-f7baa5c5b97a",
            "pub_date": "2026-02-27 02:39:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fc151c9d-5a20-4a72-892c-186a558c61fc",
            "description": "Taliban spokesperson: ‘The major headquarters of the Pakistani regime located at Anzar Sar, under the Babrak post in the Alisher–Terezi district of Khost Province, has just been captured. Dozens of soldiers are killed and wounded, and a large quantity of weapons has fallen into",
            "link": "https://www.markets.news/headlines/fc151c9d-5a20-4a72-892c-186a558c61fc",
            "pub_date": "2026-02-27 02:40:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DPCG wins 2 virtual patient monitoring awards for VA locations in Atlanta and Alabama. Small business based in Waco, Texas.",
            "id": "558fb684-1c90-4316-b510-ab933e963270",
            "description": "Decisive Point Consulting Group, LLC (DPCG), a Small Business Administration verified Service-Disabled Veteran-Owned Small Business and Woman-Owned Small Business based in Waco, Texas, disclosed securing two contracts for the Department of Veterans Affairs. The contracts, awarded for services at the Atlanta VA Medical Center and the Central Alabama VA Medical Centers, mark a significant milestone for DPCG. These new agreements signify an expansion in the implementation of DPCG’s advanced Virtual Patient Monitoring technology.",
            "link": "https://www.markets.news/headlines/558fb684-1c90-4316-b510-ab933e963270",
            "pub_date": "2026-02-27 02:41:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Video editor at MrBeast suspended amid insider probe by Beast Industries after allegations of insider trading. CEO Jeff Housenbold confirms.",
            "id": "9d5c67b5-aa6a-4cfb-9b1e-cf4fcfac558b",
            "description": "The CEO of Beast Industries, Jeff Housenbold, has confirmed that the company has temporarily suspended an employee amidst allegations of engaging in insider trading. The employee in question is currently under internal investigation by the company.",
            "link": "https://www.markets.news/headlines/9d5c67b5-aa6a-4cfb-9b1e-cf4fcfac558b",
            "pub_date": "2026-02-27 02:41:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lowe's beats earnings estimates, raises price target; maintains Outperform rating with price target raised to $95.",
            "id": "4ef4308a-d739-4a56-a02b-19f2ac75c254",
            "description": "Lowe's Companies Inc (LOW) outperformed expectations in its recent earnings report, following a trend similar to Home Depot (HD). However, the company's 2026 guidance fell short of projections, as indicated by Telsey Advisory Group. Analyst Joseph Feldman, representing Lowe's Companies, maintained an Outperform rating and raised the price target from $85 to $95. The company's earnings stood at $1.98 per share, surpassing the estimated $1.94 per share, primarily due to increased sales and gross margins, per Feldman. For more insights and analyst stock ratings, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/4ef4308a-d739-4a56-a02b-19f2ac75c254",
            "pub_date": "2026-02-27 02:41:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "World Hearing Day on March 3 raises awareness for hearing healthcare and reducing stigma; led by IHS and WHO.",
            "id": "83ac4c09-9cc9-4eb5-a881-0a84abd2f7dc",
            "description": "On February 26, 2026, in Farmington Hills, Michigan, the International Hearing Society (IHS) and the World Health Organization (WHO) designated March 3 as World Hearing Day in efforts to bolster awareness about hearing healthcare and combat the stigma surrounding the use of hearing aids. The initiative aims to emphasize the importance of maintaining good hearing health and promote accessibility to hearing aids.",
            "link": "https://www.markets.news/headlines/83ac4c09-9cc9-4eb5-a881-0a84abd2f7dc",
            "pub_date": "2026-02-27 02:45:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Retail traders are abandoning crypto for equities in 2026 due to plunging crypto volatility and a new AI-powered edge in the stock market. $2.3 trillion digital asset market sees capital outflow. Retailers treating stocks as direct substitutes. Dip-buying behavior shifting to stock market.",
            "id": "f44da5d0-37b2-4280-a8fd-b559423ded4a",
            "description": "Bitcoin (CRYPTO: BTC) and the wider digital asset market worth $2.3 trillion are experiencing an outflow of retail capital as traders are shifting focus towards equities. This change in preference is driven by the decreasing volatility in cryptocurrencies and the emergence of a new AI-powered edge in the stock market. Recent flow data from JPMorgan and Wintermute indicates a breakdown in the historical relationship between retail stock and crypto investments in late 2024. Retail traders now view stocks and crypto as direct substitutes rather than complementary risk-on assets, resulting in a negative correlation. When retail investors are actively buying stock market dips, they are staying away from the crypto market. The movement of money out of crypto is a shift from the previous trend where retail participation influenced major crypto cycles through dip-buying and capital rotation. This behavioral change is now being observed in the stock market. For the full story, refer to Benzinga.com.",
            "link": "https://www.markets.news/headlines/f44da5d0-37b2-4280-a8fd-b559423ded4a",
            "pub_date": "2026-02-27 02:31:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thousands of schools nationwide participate in National No One Eats Alone® Day, a program by Sandy Hook Promise to tackle social isolation.",
            "id": "5b6814de-81fd-4165-80c0-3bf8e44e2b45",
            "description": "In Louisville, Kentucky, Sandy Hook Promise and WellCare collaboratively organized an event on Feb. 26, 2026, to promote student connections within schools. The initiative, National No One Eats Alone® Day, was observed in numerous educational institutions nationwide. This program, spearheaded by Sandy Hook Promise with the goal of combatting social isolation, saw participation from thousands of schools. The event aimed to foster inclusivity and unity among students, emphasizing the importance of interaction among classmates.",
            "link": "https://www.markets.news/headlines/5b6814de-81fd-4165-80c0-3bf8e44e2b45",
            "pub_date": "2026-02-27 02:31:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CINC Systems introduces AI-powered payables solution for CAM industry. Largest tech partner in CAM, launched on Feb. 26, 2026.",
            "id": "52575ee1-a7c4-4e1e-bac9-97a1f2178764",
            "description": "In Duluth, Georgia on February 26, 2026, CINC Systems, a prominent technology partner in the community association management (CAM) sector, unveiled a new CAM solution. This innovative system aims to streamline invoice ingestion, ledger coding, and digital vendor payments. As a leader in the industry, CINC Systems' launch of this automated solution marks a significant advancement in CAM technology. The company's dedication to revolutionizing processes in the field is evident, solidifying their position as a top player.",
            "link": "https://www.markets.news/headlines/52575ee1-a7c4-4e1e-bac9-97a1f2178764",
            "pub_date": "2026-02-27 02:31:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1f23acc4-f7c1-41a9-9c17-1732a5158ea1",
            "description": "Eu council: ‘#Sanctions against terrorism: expands the scope of the EU terrorist list to better address the continued threat posed by terrorism & violent extremism + prolongs the list’s validity by 1 year’",
            "link": "https://www.markets.news/headlines/1f23acc4-f7c1-41a9-9c17-1732a5158ea1",
            "pub_date": "2026-02-27 02:32:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8584c825-83dc-4904-ac62-f863ac6b05e7",
            "description": "Cars from the US delegation in the Iran talks leave the venue - Iran State TV.",
            "link": "https://www.markets.news/headlines/8584c825-83dc-4904-ac62-f863ac6b05e7",
            "pub_date": "2026-02-27 02:33:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fd1a3663-2add-4b4c-8bed-db8ce8153d84",
            "description": "Afghanistan spokesperson: ‘40 Pakistani soldiers have been killed in Kunar Province, and the bodies of 13 of them have been transferred by the Mujahideen.’",
            "link": "https://www.markets.news/headlines/fd1a3663-2add-4b4c-8bed-db8ce8153d84",
            "pub_date": "2026-02-27 02:34:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c167548c-2863-4431-adf3-09dc0eb07c1c",
            "description": "Oman FM: We have finished the day after significant progress in the negotiation between the United States and Iran. We will resume soon after consultation in the respective capitals. Discussions on a technical level will take place next week in Vienna. I am grateful to all",
            "link": "https://www.markets.news/headlines/c167548c-2863-4431-adf3-09dc0eb07c1c",
            "pub_date": "2026-02-27 02:35:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "14608800-2325-4b74-a6ce-af2a1e358e77",
            "description": "Iran US talks end - Oman FM",
            "link": "https://www.markets.news/headlines/14608800-2325-4b74-a6ce-af2a1e358e77",
            "pub_date": "2026-02-27 02:36:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SambaNova launches SN50 AI chip 5X faster than competitors, partners with Intel, secures $350M+.",
            "id": "154a0d3a-76ba-4530-8d78-3b11a37732e4",
            "description": "In Dubai, the United Arab Emirates, SambaNova unveiled the SN50 AI chip with a maximum speed 5 times faster than rivals. The company revealed a partnership with Intel for advanced AI inference solutions, along with over $350 million in funding from both new and existing investors. Positioned as the top choice for efficient AI, the SN50 chip promises enterprises a 3 times lower total cost of ownership, making it a reliable foundation for cutting-edge technology.",
            "link": "https://www.markets.news/headlines/154a0d3a-76ba-4530-8d78-3b11a37732e4",
            "pub_date": "2026-02-27 02:27:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apex Media Partners brings Dr. Charles Stanley's teachings to Comcast Florida via In Touch+, expanding reach in the Sunshine State.",
            "id": "30068e4b-c708-49ab-9b39-2cc116e35fc6",
            "description": "A prominent cable provider in Florida has begun airing the teachings of Dr. Charles Stanley. In Touch+, which offers religious teachings from In Touch Ministries, has been officially introduced in Scottsdale, Arizona on February 26, 2026. This new channel broadcasts a range of biblical lessons and has gained traction in the Sunshine State.",
            "link": "https://www.markets.news/headlines/30068e4b-c708-49ab-9b39-2cc116e35fc6",
            "pub_date": "2026-02-27 02:27:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chewy appoints Amazon veteran Chris Deppe as CFO, stock up despite sector downturn. Deppe brings 16 years experience.",
            "id": "44dfc169-a8d0-490f-a25d-2404b31568f3",
            "description": "Chewy, Inc. (CHWY) saw its shares rise despite a general downturn in the Consumer Discretionary sector, which was at -0.21%. The company appointed Chris Deppe as CFO, who brings over 16 years of experience from Amazon.com (AMZN). This move is seen as a step to strengthen Chewy's financial foundation and enhance its position in the e-commerce space. The stock has declined by 23% in the past year but is currently trading 3.2% above its 20-day SMA and 15.7% below its 100-day SMA. This leadership transition signals potential strategic shifts or stability for Chewy.",
            "link": "https://www.markets.news/headlines/44dfc169-a8d0-490f-a25d-2404b31568f3",
            "pub_date": "2026-02-27 02:29:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f820e421-4905-44fa-83d7-ebd897e62cf4",
            "description": "SBM Offshore begins EUR227M share buyback after finishing 2025 program.",
            "link": "https://www.markets.news/headlines/f820e421-4905-44fa-83d7-ebd897e62cf4",
            "pub_date": "2026-02-27 02:23:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}