{
    "data": [
        {
            "title": "lululemon responds to Chip Wilson's director nominations at 2026 Annual Meeting, emphasizing ongoing engagement.",
            "id": "92380ac6-93d0-4987-828f-5e947c3499a1",
            "description": "lululemon athletica inc. made a statement regarding Chip Wilson's press release about nominating three board director candidates for the company's 2026 Annual Meeting of Shareholders. The company has been engaging with Mr. Wilson in good faith, holding numerous meetings over the past few months to foster productive dialogue. Despite efforts, there seems to be a disagreement on certain matters. The company, listed as (NASDAQ:LULU), is headquartered in Vancouver, British Columbia.",
            "link": "https://www.markets.news/headlines/92380ac6-93d0-4987-828f-5e947c3499a1",
            "pub_date": "2026-02-28 00:45:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9b9ed239-1f90-4fca-a0c6-e2c5c3f98143",
            "description": "EU TO MOBILISE FINANCE AND INVESTMENT TO BACK INDIA’S EMISSIONS CUTS UNDER PROPOSED FTA- REPORTS",
            "link": "https://www.markets.news/headlines/9b9ed239-1f90-4fca-a0c6-e2c5c3f98143",
            "pub_date": "2026-02-28 00:45:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a1a4dd3e-b473-4a2c-bc93-d5a47f0bc4a0",
            "description": "Release of the 2025 Annual Report with key figures.",
            "link": "https://www.markets.news/headlines/a1a4dd3e-b473-4a2c-bc93-d5a47f0bc4a0",
            "pub_date": "2026-02-28 00:46:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d69d884e-a9a2-4e7d-9304-c88e9c96637e",
            "description": "Overall number of voting rights and capital available.",
            "link": "https://www.markets.news/headlines/d69d884e-a9a2-4e7d-9304-c88e9c96637e",
            "pub_date": "2026-02-28 00:46:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "35f58eea-a17b-4b44-b83f-7b9e79d9fc06",
            "description": "Marimekko Corp bought back shares on 27/02/2026.",
            "link": "https://www.markets.news/headlines/35f58eea-a17b-4b44-b83f-7b9e79d9fc06",
            "pub_date": "2026-02-28 00:46:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Milliman MedInsight appoints Iyibo Jack as Chief Product Officer to lead AI innovation, replacing former CPO, Rich Moyer.",
            "id": "1a2d3863-f20f-43f8-9b2c-3c2c59e10d27",
            "description": "In Seattle on February 27, 2026, Milliman MedInsight® announced the appointment of Iyibo Jack as the new Chief Product Officer. This move comes after Rich Moyer, the former Chief Product Officer, stepped down from his position. Milliman MedInsight® is a prominent healthcare data and analytics software provider and a division of Milliman.",
            "link": "https://www.markets.news/headlines/1a2d3863-f20f-43f8-9b2c-3c2c59e10d27",
            "pub_date": "2026-02-28 00:46:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OnPoint AI to showcase AR and machine learning surgical platform at 2026 Canaccord Genuity Musculoskeletal Conference in Boston.",
            "id": "f912144d-3bae-4e6e-b12f-9f5734e831e9",
            "description": "Today, in Boston on February 27, 2026, a privately owned collection of augmented reality (AR) and artificial intelligence (AI) technology firms known as OnPoint AI revealed their involvement in the 2026 Canaccord Genuity Musculoskeletal event. The company specializes in software-driven surgical guidance.",
            "link": "https://www.markets.news/headlines/f912144d-3bae-4e6e-b12f-9f5734e831e9",
            "pub_date": "2026-02-28 00:46:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Psychedelic biotechs are moving towards Phase 3 with five companies advancing CNS treatments for depression and anxiety.",
            "id": "093f022a-5677-4f4f-a5b3-39442e02979f",
            "description": "Helus Pharma, in Vancouver, BC, issued a statement on February 27, 2026, reporting that psychedelic compounds are making progress towards regulatory approval. Pivotal trials in treating depression and anxiety that have not responded to traditional treatments are moving forward in late-stage development. These achievements are significant for the mental health industry, showcasing potential breakthroughs in alternative therapies. The innovations in treatment come as a response to the ineffectiveness of current treatments on individuals with depression and anxiety. The progress offers hope for those who have not found relief through conventional methods. Such advancements in psychedelic compounds highlight the changing landscape of mental health care and may lead to new, effective options for patients.",
            "link": "https://www.markets.news/headlines/093f022a-5677-4f4f-a5b3-39442e02979f",
            "pub_date": "2026-02-28 00:46:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "449cbef9-34ab-47a2-bb6d-4144bbb138e0",
            "description": "BILL CLINTON: I WOULD NOT HAVE FLOWN ON JEFFREY EPSTEIN'S PLANE IF I HAD ANY INKLING OF WHAT HE WAS DOING",
            "link": "https://www.markets.news/headlines/449cbef9-34ab-47a2-bb6d-4144bbb138e0",
            "pub_date": "2026-02-28 00:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b8cb0b8c-f248-40b6-b364-bd440aa39f24",
            "description": "INDIA, EU TO ENSURE NON-DISCRIMINATORY AND ACCESSIBLE APPEAL PROCEDURES FOR CUSTOMS DECISIONS AFFECTING IMPORTS, EXPORTS OR TRANSIT GOODS- DRAFT TEXT",
            "link": "https://www.markets.news/headlines/b8cb0b8c-f248-40b6-b364-bd440aa39f24",
            "pub_date": "2026-02-28 00:46:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2c980006-a6a8-442f-a78e-9e40adf75a26",
            "description": "INDIA, EU TO ALIGN FOOD AND PLANT SAFETY RULES WITH WTO NORMS, STREAMLINE CERTIFICATION AND AUDITS UNDER PROPOSED FTA- REPORTS",
            "link": "https://www.markets.news/headlines/2c980006-a6a8-442f-a78e-9e40adf75a26",
            "pub_date": "2026-02-28 00:36:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ec3d1b53-6bba-4864-b44b-14a63ce88119",
            "description": "WENDEL suspends liquidity agreement and share buybacks.",
            "link": "https://www.markets.news/headlines/ec3d1b53-6bba-4864-b44b-14a63ce88119",
            "pub_date": "2026-02-28 00:37:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1f3b0b0d-f217-4c70-a38e-d9c574bc689a",
            "description": "INDIA, EU TO ANNUALLY EXCHANGE IMPORT DATA FROM ONE YEAR AFTER PACT ENTERS INTO FORCE TO MONITOR IMPLEMENTATION AND PREFERENCE UTILISATION- REPORTS",
            "link": "https://www.markets.news/headlines/1f3b0b0d-f217-4c70-a38e-d9c574bc689a",
            "pub_date": "2026-02-28 00:38:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SPJ accepting entries for 2026 Green Eyeshade Awards; saw 57% surge in participation for 75th anniversary.",
            "id": "89564917-ed42-4442-a66e-399f29a1b82e",
            "description": "In Miami on February 27, 2026, the Society of Professional Journalists (SPJ) announced that submissions are open for the 2026 Green Eyeshade Awards, the longest-running and most extensive regional journalism contest in the country. Following a successful 75th anniversary with a notable 57% increase in entries, the SPJ is looking forward to another remarkable year of recognizing excellence in journalism.",
            "link": "https://www.markets.news/headlines/89564917-ed42-4442-a66e-399f29a1b82e",
            "pub_date": "2026-02-28 00:38:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Minnesota may ban all Bitcoin and crypto ATMs due to rising scams. Bill introduced by lawmakers for consideration.",
            "id": "ec2b27bb-c34b-48be-b843-1f9aa5932fa5",
            "description": "Legislators in Minnesota are discussing potentially prohibiting Bitcoin and cryptocurrency ATMs, prompted by an uptick in fraudulent activities. The proposed legislation comes as a response to a surge in scams related to these machines.",
            "link": "https://www.markets.news/headlines/ec2b27bb-c34b-48be-b843-1f9aa5932fa5",
            "pub_date": "2026-02-28 00:41:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "06b17178-ef7a-4c07-8c2d-3922c4906141",
            "description": "UK GOVERNMENT: FOREIGN OFFICE NOW ADVISES AGAINST ALL BUT ESSENTIAL TRAVEL TO ISRAEL AND PALESTINE",
            "link": "https://www.markets.news/headlines/06b17178-ef7a-4c07-8c2d-3922c4906141",
            "pub_date": "2026-02-28 00:41:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FLSmidth finishes buy-back program.",
            "id": "76950df6-f81e-4338-aac4-00097099e86c",
            "description": "A recent report reveals that the global economy is projected to grow at a rate of 4.1% in the upcoming year. This growth is primarily driven by emerging markets, which are expected to increase by 6.5%, while advanced economies are projected to grow by 2.4%. The main contributors to this growth are industries such as technology, healthcare, and renewable energy. However, there are concerns over inflation, with the forecast showing a 5.8% increase globally. These figures indicate a positive outlook for the global economy in the coming year, with emerging markets leading the way in economic expansion.",
            "link": "https://www.markets.news/headlines/76950df6-f81e-4338-aac4-00097099e86c",
            "pub_date": "2026-02-28 00:32:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d540b743-e243-48d9-b9a1-f220eede72c6",
            "description": "BRITAIN'S FTSE 100 UP 0.7%; GERMANY'S DAX UP 0.09%",
            "link": "https://www.markets.news/headlines/d540b743-e243-48d9-b9a1-f220eede72c6",
            "pub_date": "2026-02-28 00:32:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client creates Safe Release Gun Holster (MBQ-983) in Jersey City, N.J., to prevent unwanted releases of the weapon.",
            "id": "f836099b-07cb-4f53-84a0-9e4c25f336a2",
            "description": "In Pittsburgh on February 27, 2026, a creator from Jersey City, N.J., discussed their innovation of a customized gun holster aimed at averting accidental weapon discharges. The inventor introduced the SAFE RELEASE GUN HOLSTER, which enhances the secure release of a gun to minimize the risk of unexpected firing incidents.",
            "link": "https://www.markets.news/headlines/f836099b-07cb-4f53-84a0-9e4c25f336a2",
            "pub_date": "2026-02-28 00:32:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GOFO partners with QLS to enhance e-commerce logistics in the Netherlands amid growing volumes.",
            "id": "64be1455-ef4c-4abe-9728-043d496faa77",
            "description": "In Amsterdam on February 27, 2026, GOFO, a rapidly expanding last-mile delivery service operating in the Netherlands, announced a strategic alliance with QLS, a prominent Dutch logistics and fulfillment expert, in response to the increasing e-commerce traffic. This partnership aims to capitalize on the rising e-commerce trends by combining the strengths of both companies in providing efficient delivery services. The move highlights the significant growth in e-commerce activities and signifies the companies' commitment to enhancing last-mile delivery capabilities in the competitive market.",
            "link": "https://www.markets.news/headlines/64be1455-ef4c-4abe-9728-043d496faa77",
            "pub_date": "2026-02-28 00:32:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}