{
    "data": [
        {
            "title": "",
            "id": "2a284e50-2098-40a6-a5cd-ba4be5373a9e",
            "description": "Zelenskyy: 'Just now, the President is talking with the Prime Minister of Slovakia, Robert Fico. The President invites him to Ukraine to discuss all the existing issues'",
            "link": "https://www.markets.news/headlines/2a284e50-2098-40a6-a5cd-ba4be5373a9e",
            "pub_date": "2026-02-27 19:46:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b79c3f42-e765-48ed-8e20-6f120591c246",
            "description": "S&P 500, NASDAQ 100 FUTURES FALL TO SESSION LOW OF 0.6%",
            "link": "https://www.markets.news/headlines/b79c3f42-e765-48ed-8e20-6f120591c246",
            "pub_date": "2026-02-27 19:46:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "815582a2-aa32-40b2-b5e2-4cd81440b550",
            "description": "BLACKSTONE AND BROOKFIELD SAID AMONG BIDDERS FOR €8B VW UNIT",
            "link": "https://www.markets.news/headlines/815582a2-aa32-40b2-b5e2-4cd81440b550",
            "pub_date": "2026-02-27 19:47:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9481df28-267d-4770-b7f9-421c88f16f10",
            "description": "SWISS ECONOMY MINISTER SAYS IMPORTANT TO STRENGTHEN ECONOMIC COOPERATION AT TIMES OF GLOBAL TENSIONS, SPEAKING AT MEETING OF ECONOMY MINISTERS FROM GERMAN-SPEAKING COUNTRIES",
            "link": "https://www.markets.news/headlines/9481df28-267d-4770-b7f9-421c88f16f10",
            "pub_date": "2026-02-27 19:47:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GFL Environmental Inc. renews share repurchase program on TSX, with a 12-month NCIB. Feb. 27, 2026.",
            "id": "419b3729-0082-4a9f-85e5-9e8a150bc1c7",
            "description": "In Miami Beach, Florida on February 27, 2026, GFL Environmental Inc. (NYSE: GFL) (TSX: GFL) disclosed its plans to renew a normal course issuer bid (NCIB) for the next 12 months. The Toronto Stock Exchange (TSX) has approved the Company's intention.",
            "link": "https://www.markets.news/headlines/419b3729-0082-4a9f-85e5-9e8a150bc1c7",
            "pub_date": "2026-02-27 19:48:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3fb1cc0a-de02-40dc-ab23-8eeb9e49e884",
            "description": "GERMAN ECONOMY MINISTER SAYS WE ARE IN DIFFICULT TIMES",
            "link": "https://www.markets.news/headlines/3fb1cc0a-de02-40dc-ab23-8eeb9e49e884",
            "pub_date": "2026-02-27 19:49:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Endeavour Silver Corp announces Q4 2025 results: produced 6,486,661 oz of silver, $467.5 million revenue. Operating & mine earnings rose significantly. Commercial production at Terronera started. Company closed a $350 million convertible notes offering. 2025 marked by growth, record revenue, strategic milestones. Operations disrupted in Mexico due to security concerns. Resume normal operations. Conference call at 10AM PST today. For more details, visit the company's website.",
            "id": "b3c8a0b1-e8d3-4b0f-8dd9-54e7b34f7b84",
            "description": "Endeavour Silver Corp. reported its financial and operating results for the year ended December 31, 2025, highlighting significant growth in production and revenue. The company recorded 6,486,661 ounces of silver and 37,164 ounces of gold production in 2025, with total silver equivalent production reaching 11.2 million ounces, a 48% increase over the previous year. Revenue totaled $467.5 million, driven by the sale of 6,562,106 ounces of silver and 43,430 ounces of gold at higher average realized prices compared to 2024. The company reported a strong cash position of $215.4 million as of December 31, 2025. Key milestones included the commissioning of the Terronera mine, the acquisition of Kolpa, and the sale of the Bolañitos mine. The company also completed a $350 million convertible notes offering to advance its strategic objectives. The financial overview for the year showed an increase in revenue, operating earnings, and cash flow compared to 2024. However, the company reported a net loss for the year of $119.1 million. Additionally, an update on the impact of security concerns in Mexico on operations was addressed, with operations at Terronera being temporarily paused and later resumed. The company provided a detailed breakdown of its financial performance, measures, and ratios, highlighting key figures such as EBITDA, adjusted net earnings, mine operating cash flow, and direct operating costs per tonne. The detailed financial information including direct costs, EBITDA, and adjusted EBITDA were provided for the fourth quarter and the full year of 2025. Investors were invited to a conference call to discuss the Q4 2025 financial results further. Further updates and disclosures can be found on the company's website.",
            "link": "https://www.markets.news/headlines/b3c8a0b1-e8d3-4b0f-8dd9-54e7b34f7b84",
            "pub_date": "2026-02-27 19:50:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ANI Pharmaceuticals reported record Q4 and full year 2025 financial results with net revenues of $247.1 million and $883.4 million, up 29.6% and 43.8% y-o-y. Rare Disease net revenue was $131.3 million and $422.6 million, Generics net revenue was $100.8 million and $384.1 million. Quarterly GAAP net income was $27.5 million, full year was $77.2 million. Adjusted non-GAAP EBITDA was $65.4 million quarterly and $229.8 million full year, with EPS at $1.18 and $2.33 quarterly, $3.32 and $7.89 full year. ANI projected over $1 billion revenue in 2026. They had $285.6 million in cash as of Dec 31, 2025. For 2026, they forecast net revenue between $1.055B - $1.115B, Cortrophin Gel net revenue of $540M - $575M, ILUVIEN net revenue of $78M - $83M, adjusted non-GAAP EBITDA of $275M - $290M, and adjusted non-GAAP EPS of $8.83 - $9.34. The Company's focus areas include Rare Disease, Generics, and Brands businesses.",
            "id": "2e270a1c-c0fe-48d2-9880-3e1d9e41b57d",
            "description": "ANI Pharmaceuticals, Inc. announced its financial results for the fourth quarter and full year ending December 31, 2025, with record net revenues of $247.1 million and $883.4 million, up 29.6% and 43.8% year-over-year, respectively. Rare Disease quarterly and full-year net revenues were $131.3 million and $422.6 million, up 50.8% and 84.1% year-over-year. Purified Cortrophin Gel net revenues were $111.4 million and $347.8 million, up 87.6% and 75.6%. ILUVIEN and YUTIQ net revenues were $19.8 million and $74.9 million. GAAP net income for the quarter was $27.5 million and $77.2 million for the full year. Adjusted non-GAAP EBITDA was $65.4 million for the quarter and $229.8 million for the full year. Quarterly diluted GAAP income per share was $1.18 and adjusted non-GAAP diluted earnings per share was $2.33. The company expects over $1 billion in revenue in 2026, with Rare Disease representing about 60% of total revenue. ANI's total net revenues for the fourth quarter were $247.1 million, up 29.6% over the prior year period. The company's liquidity included $285.6 million in cash and cash equivalents. ANI reaffirmed its full-year 2026 financial guidance, with expected growth in various segments including Cortrophin Gel, ILUVIEN, adjusted non-GAAP EBITDA, and adjusted non-GAAP diluted EPS. Further details were provided on various non-GAAP financial measures used by the company, and its strategy moving forward to drive growth.",
            "link": "https://www.markets.news/headlines/2e270a1c-c0fe-48d2-9880-3e1d9e41b57d",
            "pub_date": "2026-02-27 19:51:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6561e3bc-9d4b-432e-9981-d9ad8d614b3e",
            "description": "Kremlin: 'The President held an operational meeting with the permanent members of the Security Council via video link Issues related to strengthening the foundations of the constitutional system were discussed. A report was presented by the Minister of Justice, Konstantin",
            "link": "https://www.markets.news/headlines/6561e3bc-9d4b-432e-9981-d9ad8d614b3e",
            "pub_date": "2026-02-27 19:51:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "71cda6ee-b095-4944-877c-b74ce108839f",
            "description": "PAKISTAN MILITARY SPOKESPERSON: HIT MILITARY TARGETS IN 22 LOCATIONS IN AIR STRIKES IN AFGHANISTAN",
            "link": "https://www.markets.news/headlines/71cda6ee-b095-4944-877c-b74ce108839f",
            "pub_date": "2026-02-27 19:41:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a446b75-729e-460b-a7ec-bb74be39e2e2",
            "description": "PAKISTAN MILITARY SPOKESPERSON: AT LEAST 12 PAKISTANI SOLDIERS KILLED",
            "link": "https://www.markets.news/headlines/0a446b75-729e-460b-a7ec-bb74be39e2e2",
            "pub_date": "2026-02-27 19:42:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "White Oil Market to reach $2.77 billion by 2030, per MarketsandMarkets™ - Delray Beach, Fla., Feb. 27, 2026 /PRNewswire.",
            "id": "68ef5e7a-bbf1-4486-9462-ff73d4ed9509",
            "description": "In Delray Beach, Florida, recent data from MarketsandMarkets revealed findings on the global white oil market. The report, titled \"White Oil Market by Grade (Pharmaceutical, Food, Technical), Application (Polymers, Personal Care, Textiles, Pharmaceuticals, Adhesives & Sealants, Food), and Region,\" forecasts trends up to 2030. This comprehensive analysis covers various sectors like pharmaceuticals, food, and technical grades, with key applications including polymers, personal care products, textiles, pharmaceuticals, adhesives, sealants, and food. The report provides crucial insights into market dynamics and anticipates significant growth in the industry in the coming years.",
            "link": "https://www.markets.news/headlines/68ef5e7a-bbf1-4486-9462-ff73d4ed9509",
            "pub_date": "2026-02-27 19:42:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Judge denies Binance's request for arbitration in crypto loss dispute. Customers can pursue claims. US District Judge Andrew Carter rules in Southern District of NY. Binance failed to inform customers about changes to terms.",
            "id": "b9955f44-e311-4ebb-a387-8fba497749e4",
            "description": "A federal judge in the Southern District of New York rejected a request for arbitration from cryptocurrency exchange Binance (CRYPTO: BNB) in a case related to customer claims on losses from unregistered tokens. Judge Andrew Carter stated that Binance did not sufficiently notify its customers about changes to its terms of usage, which included an arbitration mandate and a class-action waiver. Customers are now permitted to pursue their claims against Binance. This ruling follows a dispute over the alleged class-action waiver within Binance’s terms. The full story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/b9955f44-e311-4ebb-a387-8fba497749e4",
            "pub_date": "2026-02-27 19:43:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7e87a438-8dd1-4c50-bc17-5e70eac4ff5a",
            "description": "The UK's Green Party has shocked the country with its first ever Westminster by-election win. Prime Minister Keir Starmer's Labour Party suffered defeat in Gorton and Denton, an area of Greater Manchester, that it had dominated for almost a century, a loss that underscores the",
            "link": "https://www.markets.news/headlines/7e87a438-8dd1-4c50-bc17-5e70eac4ff5a",
            "pub_date": "2026-02-27 19:45:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TXNM Energy (NYSE: TXNM) Q4 earnings showed EPS of $0.48 vs $0.57 estimated, with revenue up $56.27 million.",
            "id": "abccc811-45db-4b3a-bcf4-0ab997c11857",
            "description": "TXNM Energy (NYSE: TXNM) unveiled its Q4 earnings on February 27th, 2026, at 06:30 AM. Key highlights from the report show that the company fell short of expected earnings by -15.79%, with an EPS of $0.48 compared to the estimated $0.57. Additionally, revenue witnessed a $56.27 million increase from the corresponding period the year prior. Looking back at the last quarter, TXNM Energy also missed its earnings target. For further details, the complete article can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/abccc811-45db-4b3a-bcf4-0ab997c11857",
            "pub_date": "2026-02-27 19:45:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b779ed6d-9047-43e3-8cd3-a8d460a11283",
            "description": "Poll: US crude oil expected to average $60.38/bbl in 2026 versus $58.72 forecast in January",
            "link": "https://www.markets.news/headlines/b779ed6d-9047-43e3-8cd3-a8d460a11283",
            "pub_date": "2026-02-27 19:35:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federal Reserve challenges subpoenas in Jerome Powell investigation privately. Legal battle ongoing with undisclosed grounds, tensions with Trump admin.",
            "id": "9db4e432-aa79-409a-a8bf-022518f6e408",
            "description": "The Federal Reserve is contesting two subpoenas issued in a criminal investigation by U.S. Attorney Jeanine Pirro involving Chair Jerome Powell. The Fed is pushing for the dismissal of the subpoenas in sealed proceedings, potentially relieving it from the need to respond, according to a report by The Wall Street Journal. The specific legal grounds being asserted by the Fed have not been disclosed. Typically, in high-profile cases, parties challenge subpoenas as excessively broad or seeking protected information. This legal showdown is happening in private due to secrecy rules governing criminal investigations before a grand jury. No immediate response was provided by the Federal Reserve to Benzinga's request for comment. This development is occurring amidst mounting tensions between the Federal Reserve and the Trump administration. Jerome Powell disclosed in January that... Note: Full article available on Benzinga.com",
            "link": "https://www.markets.news/headlines/9db4e432-aa79-409a-a8bf-022518f6e408",
            "pub_date": "2026-02-27 19:35:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Delek Logistics (NYSE: DKL) reported record Q4 2025 results. President highlighted strong year with Libby 2 gas plant startup.",
            "id": "6bb03635-de49-41ef-8cbc-1e5873dfd3e2",
            "description": "In Brentwood, Tennessee, Delek Logistics Partners, LP (NYSE: DKL) revealed their financial performance for Q4 2025. The President, Avigal Soreq, expressed pride in the record-breaking year attributed to efficient operations in crude, gas, and water sectors. The company's success in 2025 was underscored by launching the Libby 2 gas plant.",
            "link": "https://www.markets.news/headlines/6bb03635-de49-41ef-8cbc-1e5873dfd3e2",
            "pub_date": "2026-02-27 19:36:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Delek US Holdings reports Q4 2025 results, highlighting improved cash flow profile and cost reduction strategies. CEO comments.",
            "id": "3ea21dc0-fdeb-4983-be98-50bb0cd6f7d5",
            "description": "Delek US Holdings, Inc. (NYSE: DK) based in Brentwood, Tenn., has released its financial report for Q4 of 2025. The company highlighted a significant improvement in its cash flow by implementing the Enterprise Optimization Plan which led to reduced costs of Inventory Intermediation Agreements. Avigal Soreq, President and Chief Executive Officer of Delek US, mentioned that the year 2025 marked a transformation for the company in terms of its financial performance. The progress also includes advancing its economic separation with Delek Logistics.",
            "link": "https://www.markets.news/headlines/3ea21dc0-fdeb-4983-be98-50bb0cd6f7d5",
            "pub_date": "2026-02-27 19:36:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LandBridge (LB) Q4 earnings: EPS $0.24 (missed estimate by 45.45%), revenue up $20.28 million. Full details on Benzinga.com.",
            "id": "d018e07a-dd6c-4105-b114-cde40536074b",
            "description": "LandBridge (NYSE: LB) released its Q4 earnings on Wednesday, February 25, 2026, at 04:00 PM. The report showed that the company fell short of expected earnings by -45.45%, with an EPS of $0.24 compared to the estimated $0.44. However, revenue saw an increase of $20.28 million compared to the same period the previous year. This follows a pattern where in the previous earnings report, LandBridge missed the EPS estimate by $0.19. More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/d018e07a-dd6c-4105-b114-cde40536074b",
            "pub_date": "2026-02-27 19:36:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}