{
    "data": [
        {
            "title": "",
            "id": "7136b3e3-cae9-4ef7-b0c9-be19e8e65e51",
            "description": "ALPHABET AND OTHER BIG TECH COULD BORROW HUNDREDS OF BILLIONS EACH – THEINFORMATION",
            "link": "https://www.markets.news/headlines/7136b3e3-cae9-4ef7-b0c9-be19e8e65e51",
            "pub_date": "2026-02-26 22:26:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5cf0426a-2770-4dc5-ade3-7ab0b51a8c66",
            "description": "PENTAGON SENT ANTHROPIC FINAL OFFER FOR USE OF ITS AI - CBS",
            "link": "https://www.markets.news/headlines/5cf0426a-2770-4dc5-ade3-7ab0b51a8c66",
            "pub_date": "2026-02-26 22:27:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "60d76feb-2009-40e0-a89d-ff83a736d0c7",
            "description": "Iran's Spokesperson of the Iranian Foreign Ministry: Baqaei: 'Both sides are seriously pursuing the work We are focused on the practical agenda that has been communicated to us and we are trying to secure Iran's interests. Both delegations are seriously pursuing the work.",
            "link": "https://www.markets.news/headlines/60d76feb-2009-40e0-a89d-ff83a736d0c7",
            "pub_date": "2026-02-26 22:27:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "314f31db-029a-46a9-b0de-b49215a179d1",
            "description": "The air defense system shot down 5 drones flying towards Moscow, mayor reported",
            "link": "https://www.markets.news/headlines/314f31db-029a-46a9-b0de-b49215a179d1",
            "pub_date": "2026-02-26 22:28:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JIAN Group represents OMEGA Products in transaction with CEMEX in Fredericksburg, VA.",
            "id": "dda51d4f-e578-46a3-8975-e03063b5d2fa",
            "description": "In a recent deal facilitated by The JIAN Group, OMEGA Products International successfully completed a transaction with CEMEX in Fredericksburg, Virginia. Specific details of the transaction, including financial figures or terms, were not disclosed to the public.",
            "link": "https://www.markets.news/headlines/dda51d4f-e578-46a3-8975-e03063b5d2fa",
            "pub_date": "2026-02-26 22:29:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Curator Hotel & Resort Collection's 30 members rank in top 10 of 2026 U.S. News & World Report Best Hotels, also recognized in Forbes Travel Guide Awards.",
            "id": "9cbcf088-1a01-4415-8fc2-5560b39ac96b",
            "description": "In Bethesda, Maryland, the Curator Hotel & Resort Collection reveals that 30 of its esteemed members have achieved top 10 rankings in the 2026 U.S. News & World Report Best Hotels list. Additionally, numerous member hotels and resorts were commended in the Forbes Travel Guide Awards. These honors highlight the excellence of Curator's membership, consisting of unique independent properties providing genuine experiences and outstanding hospitality.",
            "link": "https://www.markets.news/headlines/9cbcf088-1a01-4415-8fc2-5560b39ac96b",
            "pub_date": "2026-02-26 22:29:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Time is running out to claim the exclusive Athens Rock Lobsters Edition Ford Bronco at Akins Ford in Winder, GA.",
            "id": "5413ca05-5ee6-4cfd-87b7-daf0048a71bc",
            "description": "In Winder, Georgia, a special opportunity awaits automotive and hockey enthusiasts as they have the chance to participate in a unique vehicle giveaway. Akins Ford, based in Winder, is offering the community the chance to win a Ford Bronco. The deadline for entry is quickly approaching, making it a time-sensitive offer that fans won't want to miss out on. This giveaway presents a rare chance for individuals to potentially drive away in a coveted Ford Bronco, generating excitement among participants.",
            "link": "https://www.markets.news/headlines/5413ca05-5ee6-4cfd-87b7-daf0048a71bc",
            "pub_date": "2026-02-26 22:29:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Frank Jacquez appointed as Senior Director of Learning and Enablement at BCN for business customers.",
            "id": "055d1077-349a-423b-9ca9-8ea501e8d79b",
            "description": "In Boca Raton, Florida on February 26, 2026, BCN introduced Frank Jacquez as the new Senior Director of Learning and Enablement. BCN specializes in managed network and technology services for businesses. Jacquez will oversee the development of a revamped Learning and Enablement department within the company. This move signifies BCN's commitment to enhancing employee training and knowledge.",
            "link": "https://www.markets.news/headlines/055d1077-349a-423b-9ca9-8ea501e8d79b",
            "pub_date": "2026-02-26 22:29:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MP Materials is setting up \"10X\" rare earth magnet manufacturing campus on 120-acre site in Northlake, Texas, less than 10 miles from its Independence facility in Fort Worth, cementing North Texas as U.S. rare earth magnet hub. #MP #rareearth",
            "id": "050074a9-397e-40ec-8732-c19bbacf3e69",
            "description": "In Northlake, Texas, MP Materials Corp. revealed its choice of a 120-acre location for the development of \"10X,\" the company's upcoming rare earth magnet manufacturing campus. This site is situated near MP's current Independence facility in Fort Worth, less than 10 miles away. 10X aims to solidify North Texas as the focal point for the U.S.'s rare earth magnet supply chain. The project will substantially enhance MP's integrated U.S. rare earth magnet production capabilities.",
            "link": "https://www.markets.news/headlines/050074a9-397e-40ec-8732-c19bbacf3e69",
            "pub_date": "2026-02-26 22:30:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "aad838ea-131e-4c19-b445-54db7e0f5230",
            "description": "RUSSIA SLAMS EU OIL BAN AS “MADNESS” Russia’s Foreign Ministry has condemned the European Union’s plan to permanently ban Russian oil imports. Spokeswoman Maria Zakharova called the proposal “madness,” saying only a “madman” would support it. The European Commission is expected",
            "link": "https://www.markets.news/headlines/aad838ea-131e-4c19-b445-54db7e0f5230",
            "pub_date": "2026-02-26 22:30:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d79200ea-8017-44dd-bb1b-4a50fd6147af",
            "description": "Temporary restrictions have been imposed at Moscow Vnukovo and Sheremetyevo airports - Rosaviatsia",
            "link": "https://www.markets.news/headlines/d79200ea-8017-44dd-bb1b-4a50fd6147af",
            "pub_date": "2026-02-26 22:20:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysts reduced Snowflake forecasts following Q4 results; Revenue at $1.28B, earnings at 34 cents/share, expects $1.26-1.27B revenue in Q1.",
            "id": "1ea4ac08-2ece-4583-a570-2a0f59d32cf3",
            "description": "Snowflake Inc (NYSE: SNOW) exceeded expectations with its fourth-quarter fiscal 2026 financial results. The company reported revenue of $1.28 billion, surpassing analyst estimates of $1.26 billion. Additionally, Snowflake achieved adjusted earnings of 34 cents per share, exceeding predictions of 27 cents per share. CEO Sridhar Ramaswamy expressed how the past year has been transformative for all businesses, with Snowflake playing a pivotal role in the enterprise AI revolution. Looking ahead, Snowflake projects first-quarter product revenue between $1.26 billion and $1.27 billion, indicating a 27% increase compared to the previous year. More details can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1ea4ac08-2ece-4583-a570-2a0f59d32cf3",
            "pub_date": "2026-02-26 22:20:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tevogen considers acquiring Sciometrix for Clinicus platform to boost revenue goals by 2026.",
            "id": "db71c26c-1fa4-4fc0-a5fa-bcf4646daa0c",
            "description": "Tevogen is currently considering acquiring Sciometrix, a move aimed at developing a comprehensive clinical infrastructure to support its revenue targets for 2026. This potential acquisition highlights Tevogen's strategic plans to enhance its operations and achieve its financial objectives within the next five years.",
            "link": "https://www.markets.news/headlines/db71c26c-1fa4-4fc0-a5fa-bcf4646daa0c",
            "pub_date": "2026-02-26 22:21:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JFrog in Sunnyvale, CA sets $300 million share repurchase program approved by Board of Directors.",
            "id": "d0cff752-4550-423b-adda-53d048f0215c",
            "description": "In Sunnyvale, California, the Board of Directors at JFrog has approved a share buyback program totaling $300 million for the company's ordinary shares.",
            "link": "https://www.markets.news/headlines/d0cff752-4550-423b-adda-53d048f0215c",
            "pub_date": "2026-02-26 22:21:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "192beb3d-2cbc-4562-9e87-7b998678d642",
            "description": "BOEING: AFRICA NOW EXPECTS TO SELL 1,700 PLANES OVER THE NEXT TWO DECADES VS LAST YEAR’S FORECAST OF 1,200 AND 1,000 THREE YEARS AGO",
            "link": "https://www.markets.news/headlines/192beb3d-2cbc-4562-9e87-7b998678d642",
            "pub_date": "2026-02-26 22:22:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "41995f48-1437-4cea-a256-939b1770e4be",
            "description": "It looks like a fight, but every punch is a lesson. Watch as our reporter goes head-to-head with Unitree’s humanoid robots to test their balance, control, and recovery. Full episode coming across CGTN Europe social platforms on March 4.",
            "link": "https://www.markets.news/headlines/41995f48-1437-4cea-a256-939b1770e4be",
            "pub_date": "2026-02-26 22:24:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Altrata study shows how tenure, deal experience & sector expertise impact leadership teams in PE-owned businesses. NY, Feb 26, 2026 /PRNewswire.",
            "id": "7ac15eea-1563-41dd-89dd-3732af20c563",
            "description": "A recent extensive study by Altrata explores the impact of factors such as hiring practices, length of employment, previous deal involvement, and industry knowledge on the makeup of leadership teams in companies owned by private equity firms. This study, the largest of its kind, provides insights into the dynamics of leadership teams. The research was conducted by Altrata, a reputable company known for its expertise in executive and wealth management. The findings were unveiled in New York on February 26, 2026. This study offers valuable information for businesses navigating the private equity landscape.",
            "link": "https://www.markets.news/headlines/7ac15eea-1563-41dd-89dd-3732af20c563",
            "pub_date": "2026-02-26 22:25:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2af00df7-9f02-430f-8b6e-50f343fb4707",
            "description": "Investors pledge ~A$8.2m in placement.",
            "link": "https://www.markets.news/headlines/2af00df7-9f02-430f-8b6e-50f343fb4707",
            "pub_date": "2026-02-26 22:25:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "iQuanti receives 2026 Great Place To Work Certification, driving growth for better client outcomes.",
            "id": "422f681d-2358-41dc-860a-a9882116da2c",
            "description": "In Jersey City, New Jersey, iQuanti is dedicated to fostering continuous improvement among its employees. They not only encourage growth but also provide the necessary tools, freedom, and opportunities for their staff. Recently, on February 26, 2026, iQuanti celebrated being re-certified by Great Place To Work® for the second time. This recognition highlights their commitment to creating a supportive and conducive work environment.",
            "link": "https://www.markets.news/headlines/422f681d-2358-41dc-860a-a9882116da2c",
            "pub_date": "2026-02-26 22:25:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A live auction featuring Gwyneth Paltrow's style collection will be held on March 24 and 25, 2026, with online bidding starting on February 25, 2026 at The Peninsula Beverly Hills. (Characters: 123)",
            "id": "3830a73d-f2a0-4d0c-b425-d0e922700a9e",
            "description": "A live auction event is scheduled for March 24th and 25th, 2026 at The Peninsula Beverly Hills in Beverly Hills, California. Online bidding will commence on February 25th, 2026. Julien's Auctions has announced the auction showcasing the bold and luxurious collections of Gwyneth Paltrow, including the \"Lexicon of Style\" and \"The Archival.\"",
            "link": "https://www.markets.news/headlines/3830a73d-f2a0-4d0c-b425-d0e922700a9e",
            "pub_date": "2026-02-26 22:17:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}