{
    "data": [
        {
            "title": "Waterdrop Filter introduces whole-house RO system at KBIS 2026, gathering over 622 participants in Orlando.",
            "id": "5ae414c8-3f3c-4b6d-9c31-95f8aa8f776a",
            "description": "On March 1, 2026, in Los Angeles, Waterdrop Filter, a prominent player in water purification, concluded a fruitful presentation at the 2026 Kitchen & Bath Industry Show (KBIS) held in Orlando. Being the biggest gathering for kitchen and bath design in North America, the event attracted more than 622 attendees.",
            "link": "https://www.markets.news/headlines/5ae414c8-3f3c-4b6d-9c31-95f8aa8f776a",
            "pub_date": "2026-02-28 23:19:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway sees earnings decline under new CEO Abel as insurance business falters in Buffett's final year.",
            "id": "7464e4ae-00ae-4089-81ab-57706265f75f",
            "description": "Gregory Abel, the new CEO, opted for a direct approach in his initial report, contrasting Warren Buffett's usual casual style. The decrease in earnings was primarily influenced by reductions in the insurance sector.",
            "link": "https://www.markets.news/headlines/7464e4ae-00ae-4089-81ab-57706265f75f",
            "pub_date": "2026-02-28 23:04:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Four-year data shows long-term benefit and safety of AYVAKIT in Indolent Systemic Mastocytosis. 12 presentations at AAAAI Meeting.",
            "id": "49a6263f-4f05-4be7-b97f-298383b891e6",
            "description": "A recent real-world study on AYVAKIT has shown significant improvements in symptoms related to Indolent Systemic Mastocytosis (ISM). 12 data presentations were showcased at the 2026 Annual Meeting of the American Academy of Allergy, Asthma & Immunology (AAAAI), underscoring Blueprint Medicines' leading role in enhancing care for Systemic Mastocytosis (SM). The study was conducted by Blueprint Medicines, now a subsidiary of Sanofi, and was revealed in Cambridge, Massachusetts on February 28, 2026.",
            "link": "https://www.markets.news/headlines/49a6263f-4f05-4be7-b97f-298383b891e6",
            "pub_date": "2026-02-28 22:47:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cogent Biosciences presents positive data from SUMMIT trial on bezuclastinib at 2026 AAAAI Meeting, showing significant improvements in patients with NonAdvSM.",
            "id": "86009242-dae9-4180-8e7d-a6af5cf3ef4a",
            "description": "Cogent Biosciences, Inc. (Nasdaq: COGT), a biotech company in Waltham, Mass. and Boulder, Colo., shared more clinical data from the SUMMIT trial with bezuclastinib for NonAdvanced Systemic Mastocytosis patients at the American Academy of Allergy Asthma & Immunology Annual Meeting. The trial showed significant improvements in primary and secondary endpoints and emphasized increased benefits with longer treatment and in high unmet need populations. Bezuclastinib also positively affected bone mineral density, indicating disease modification. The results were presented on Feb. 28, 2026, highlighting the therapy's potential for genetically defined diseases.",
            "link": "https://www.markets.news/headlines/86009242-dae9-4180-8e7d-a6af5cf3ef4a",
            "pub_date": "2026-02-28 22:47:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Biglari Holdings Inc. posted its 2025 earnings: Q4 - $XXX thousands, Full year - $XXX thousands. Annual report available online.",
            "id": "78f540b5-23eb-4dc3-a262-b995ba51d4c1",
            "description": "Biglari Holdings Inc. has released its 2025 Annual Report online, featuring Sardar Biglari's letter to shareholders. The report can be found at www.biglariholdings.com. The company's earnings for the fourth quarter and full year of 2025 and 2024 are summarized below. Shareholders are urged to review the detailed results in the 10-K posted on the website. For the fourth quarter ending December 31, in 2025, earnings were in the thousands of dollars. More information can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/78f540b5-23eb-4dc3-a262-b995ba51d4c1",
            "pub_date": "2026-02-28 22:47:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VEON Ltd. will release its FY25 earnings on March 13, 2026 for Q4 and full-year results ended Dec 31, 2025.",
            "id": "4598b8f9-9608-4d3e-a4ff-f9f75826819c",
            "description": "On February 26, 2026, VEON Ltd. (NASDAQ: VEON), a worldwide digital operator, announced that the VEON Group will disclose its consolidated financial and operating results for the fourth quarter and full-year ending on December 31, 2025, at 8:00 GST (0:00 EST) on March 13, 2026.",
            "link": "https://www.markets.news/headlines/4598b8f9-9608-4d3e-a4ff-f9f75826819c",
            "pub_date": "2026-02-28 22:34:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Goliath Resources seeks to extend 2,590,673 warrants held by McEwen Inc. to acquire shares at $2.50 each.",
            "id": "235e5fb3-b8a0-4e77-af47-b2936b9be467",
            "description": "Toronto, February 28, 2026 - Goliath Resources Limited (TSX-V: GOT) (OTCQX: GOTRF) (FSE: B4IF) has requested an extension from the TSX Venture Exchange for 2,590,673 common share purchase warrants. Each warrant allows the purchase of one common share at $2.50 per share. These warrants were issued on March 10, 2025, as part of a $10,000,000 non-brokered private placement to McEwen Inc. (NYSE: MUX) (TSX: MUX), resulting in the issuance of 5,181,347 units at C$1.93 per unit. In exchange, Goliath received 868,056 shares of common stock of McEwen at a deemed price of C$11.52 per share.",
            "link": "https://www.markets.news/headlines/235e5fb3-b8a0-4e77-af47-b2936b9be467",
            "pub_date": "2026-02-28 22:40:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway's net earnings fall to $66,968M in 2025. Greg Abel takes over as CEO amidst speculation on the firm's $300B cash deployment strategy.",
            "id": "f303072c-d94b-4dda-bb2f-2786fdb70fd6",
            "description": "Berkshire Hathaway Inc. reported fourth-quarter and full-year 2025 results, with net earnings standing at $66,968 million for the year compared to $88,995 million in 2024. Fourth-quarter net earnings were $19,199 million, slightly less than $19,694 million the previous year, and operating earnings decreased to $10,200 million from $14,527 million. Full-year operating earnings also dropped to $44,486 million from $47,437 million in 2024. Investors were expecting quarterly revenue of $92.91 billion, lower than the prior year's $94.92 billion. The spotlight shifted to new CEO Greg Abel and potential changes in Berkshire's cash management post-Warren Buffett's era, with over $300 billion in cash to deploy. Abel's leadership marks a new era, as he takes over from Buffett, signaling a possible shift in investment strategies, including new deals, equity purchases, or a dividend policy change. Berkshire planned to sell its stake in Kraft Heinz and has been reducing its holdings in Apple Inc. Full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/f303072c-d94b-4dda-bb2f-2786fdb70fd6",
            "pub_date": "2026-02-28 22:27:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway's earnings down 25%, net income drops to $66.9B from $88.9B in 2024. Greg Abel takes over as CEO.",
            "id": "97c01ea5-3710-4ee7-bc76-7cc4ceacc18b",
            "description": "Berkshire Hathaway Inc. reported 2025 net earnings of $66,968 million, down from $88,995 million in 2024, with fourth-quarter net earnings at $19,199 million, slightly below the previous year. Operating earnings decreased to $10,200 million in Q4 from $14,527 million in 2024, and to $44,486 million for the full year against $47,437 million. Revenue was expected to be $92.91 billion for the quarter, a drop from the previous year, but Berkshire has consistently surpassed revenue expectations. Greg Abel is now the CEO, succeeding Warren Buffett, leading to speculation on potential changes to Berkshire's investment strategies and cash deployment of over $300 billion. Berkshire is also reportedly selling its position in Kraft Heinz and reducing its stake in Apple Inc. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/97c01ea5-3710-4ee7-bc76-7cc4ceacc18b",
            "pub_date": "2026-02-28 22:11:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Richardson Paris Baguette Café to open Feb. 27, 2026 at 7615 Campbell Rd., Suite 106, TX. Brand has over 4,000 worldwide units.",
            "id": "60871165-3535-498e-804b-7554c2e3a1bd",
            "description": "Four individuals, specifically Sweta Goyal, Puneet Mittal, Mamta Singhal, and Rajneesh Singhal, are preparing to launch a Paris Baguette café at the address 7615 Campbell Rd., Suite 106, Richardson, TX 75248 in Dallas. The announcement was made on Feb. 28, 2026, through PRNewswire. Paris Baguette, known for its bakery café offerings, currently operates more than 4,000 locations globally and is rapidly expanding.",
            "link": "https://www.markets.news/headlines/60871165-3535-498e-804b-7554c2e3a1bd",
            "pub_date": "2026-02-28 22:13:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2b5dcda6-e093-4a99-b498-80dcb9836be5",
            "description": "TRUMP: IRAN DOES NOT WANT TO GO QUITE FAR ENOUGH AND IT'S TOO BAD .",
            "link": "https://www.markets.news/headlines/2b5dcda6-e093-4a99-b498-80dcb9836be5",
            "pub_date": "2026-02-28 22:01:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's economy gears up for 15th Five-Year Plan period (2026-2030) with strong domestic growth drivers.",
            "id": "b75c16e5-dc66-43b3-8fbd-d361d4973964",
            "description": "In Beijing, on February 28, 2026, a report on the Chinese economy indicates that the year 2026 signifies the commencement of China's 15th Five-Year Plan spanning from 2026 to 2030. In order to ensure a robust and steady initiation, China is depending on robust internal growth factors, along with other strategies to bolster its economy.",
            "link": "https://www.markets.news/headlines/b75c16e5-dc66-43b3-8fbd-d361d4973964",
            "pub_date": "2026-02-28 22:02:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hold Bitcoin for 3+ years to avoid losses; those who bought 3-5 years ago are up 90% on average despite recent dips.",
            "id": "1aaa0aa3-d2e0-4095-bb94-4e89c56e95f1",
            "description": "On average, traders who purchased Bitcoin between three to five years ago are currently experiencing a profit of approximately 90%, despite the recent market correction.",
            "link": "https://www.markets.news/headlines/1aaa0aa3-d2e0-4095-bb94-4e89c56e95f1",
            "pub_date": "2026-02-28 22:06:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "11 senators push for federal investigation into Binance amid concerns over sanctions compliance and Iran transactions.",
            "id": "54bc07f5-a64c-42fa-8c4a-66147490a49c",
            "description": "Members of Congress are calling on regulatory authorities in the US to conduct a thorough assessment of Binance's anti-money laundering (AML) and sanctions protocols. This comes in response to reports indicating transactions associated with Iran and potential risks of evading sanctions. Lawmakers are emphasizing the need for a stringent review of Binance’s compliance measures to ensure they are effectively preventing illicit activities.",
            "link": "https://www.markets.news/headlines/54bc07f5-a64c-42fa-8c4a-66147490a49c",
            "pub_date": "2026-02-28 21:39:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Washington has a stake in the AI IPO boom on Wall Street; concerns arise if they fail.",
            "id": "c8555792-718a-4bfe-966c-189083e79bb6",
            "description": "Wall Street is set to experience a surge in artificial intelligence technology, and the government has a significant interest in the results.",
            "link": "https://www.markets.news/headlines/c8555792-718a-4bfe-966c-189083e79bb6",
            "pub_date": "2026-02-28 21:34:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "El-Erian warns of a rational bubble in AI and corporate debt. Stock prices seem frothy, with a potential loss of $20 trillion in shareholder wealth. Leaders include Nvidia and Microsoft.",
            "id": "8a9692b4-d054-461f-86e1-2871d02216e9",
            "description": "Economist Mohamed El-Erian warns of a \"rational bubble\" in AI and a surge in corporate debt that could lead to a broader sell-off. He notes that despite the substantial value of AI, the market is experiencing overinvestment with companies using \"AI labels\" to attract capital. Moody's Analytics also expresses concern about overvaluation in AI companies, with a potential $20 trillion loss in shareholder wealth in a \"AI Falls Flat\" scenario. Leading AI companies like Nvidia Corp. and Microsoft Corp. are at risk in this speculative environment. More details on Benzinga.com.",
            "link": "https://www.markets.news/headlines/8a9692b4-d054-461f-86e1-2871d02216e9",
            "pub_date": "2026-02-28 21:34:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones futures rise, S&P 500 above 50-day line; Nvidia gains in buy zone post strong earnings.",
            "id": "1c98e23f-bbc3-429f-a057-9ed6a5d2a432",
            "description": "Stock index futures showed uncertainty as the technology company Nvidia maintained its position in the buy zone following impressive earnings report and guidance. The S&P 500 index surpassed its 50-day line, indicating a positive trend in the market. Dow Jones futures also saw an increase.",
            "link": "https://www.markets.news/headlines/1c98e23f-bbc3-429f-a057-9ed6a5d2a432",
            "pub_date": "2026-02-28 21:34:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq jumps ahead of Nvidia earnings; Goldman leads bank bounce. Dow Jones rises, First Solar stock sinks.",
            "id": "48032043-617a-46dd-8136-286f24b7cda5",
            "description": "Today, the Dow Jones index saw an increase on Wednesday as investors anticipated Nvidia's earnings report. On the other hand, First Solar stock plummeted due to lower-than-expected revenue guidance. Meanwhile, the Nasdaq experienced a notable jump, particularly in anticipation of Nvidia's earnings, with Goldman Sachs leading the rebound in the banking sector.",
            "link": "https://www.markets.news/headlines/48032043-617a-46dd-8136-286f24b7cda5",
            "pub_date": "2026-02-28 21:34:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IMF warns Trump tariffs could hinder growth, criticizes cuts to federal workforce. Tarrifs create negative impact.",
            "id": "6a33d042-ad01-42d2-8f97-f07b025f01bc",
            "description": "The International Monetary Fund has issued a strong caution to the Donald Trump administration, stating that its trade and labor policies could hinder national growth and disrupt essential regulatory frameworks. After conducting an Article IV consultation on the U.S. economy, the IMF advised the White House to adopt alternative policies to prevent self-imposed economic harm. While recognizing the administration's worries about the trade deficit, IMF Managing Director Kristalina Georgieva criticized the current heavy reliance on tariffs as a substantial error. According to Georgieva, these tariffs lead to a negative supply effect, ultimately impeding stronger growth prospects. Despite facing legal challenges over emergency powers used to implement tariffs, President Trump remains steadfast in his trade approach. The IMF plans to offer more insights into the potential impact of the latest tariffs in the near future.",
            "link": "https://www.markets.news/headlines/6a33d042-ad01-42d2-8f97-f07b025f01bc",
            "pub_date": "2026-02-28 21:34:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Entera Bio CEO to speak at Leerink Partners Global Healthcare Conf 2026; Miranda Toledano to participate in fireside chat.",
            "id": "b8aacb6e-f969-4de3-950f-0d71ae2ecf53",
            "description": "On February 26, 2026, in Tel Aviv, Entera Bio Ltd. disclosed that its Chief Executive Officer, Miranda Toledano, is set to engage in a fireside chat at the Leerink Partners Global Healthcare Conference 2026. Entera, a frontrunner in oral peptide and protein replacement therapies, traded under the ticker ENTX on NASDAQ. This event marks a significant moment for the company as it strives to advance its innovative solutions in the medical field. CEO Miranda Toledano's participation underscores Entera's commitment to engaging with key stakeholders and industry peers.",
            "link": "https://www.markets.news/headlines/b8aacb6e-f969-4de3-950f-0d71ae2ecf53",
            "pub_date": "2026-02-28 21:35:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}