{
    "data": [
        {
            "title": "Commerce Media Tech partners with IPinfo to adopt accuracy-first IP data in AdTech, breaking from consensus-based models.",
            "id": "9111f9d1-e6cc-4190-a9d0-dbe3c2339fcd",
            "description": "In Krakow, Poland, and Seattle, a leading AdTech platform, CMT, has made a groundbreaking move by departing from traditional geolocation models based on consensus and instead embracing a more precise approach. This shift towards accuracy-first, evidence-driven IP data sets CMT apart as a pioneer in the industry.",
            "link": "https://www.markets.news/headlines/9111f9d1-e6cc-4190-a9d0-dbe3c2339fcd",
            "pub_date": "2026-02-27 07:28:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Steers REIT and Preferred and Income Fund (RNP) to distribute on Feb 27, 2026, with details on sources of distribution.",
            "id": "5a175328-5658-46c8-b11d-2dfe50b9119a",
            "description": "On February 26, 2026, in New York, a press release was issued for shareholders of Cohen & Steers REIT and Preferred and Income Fund, Inc. (NYSE: RNP), detailing the sources of the upcoming distribution scheduled for February 27, 2026. This release also includes information on the cumulative distributions already paid out by the Fund.",
            "link": "https://www.markets.news/headlines/5a175328-5658-46c8-b11d-2dfe50b9119a",
            "pub_date": "2026-02-27 07:28:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Veea Inc. introduces TerraFabric at Mobile World Congress 2026, enabling AI operations at the edge efficiently. #EdgeComputing",
            "id": "a0f4965b-2cf4-4fd9-b7bc-531ea55dad3a",
            "description": "Veea will showcase its innovative control plane for distributed edge environments at the Mobile World Congress 2026 in Barcelona from March 2 to 4. This technology is designed to help organizations with numerous deployments streamline the administration of AI workloads across their networks. It offers automated management capabilities, policy enforcement, and software lifecycle management through prpl LCM. This advancement will enable organizations to efficiently manage their fleets of devices.",
            "link": "https://www.markets.news/headlines/a0f4965b-2cf4-4fd9-b7bc-531ea55dad3a",
            "pub_date": "2026-02-27 07:28:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Strategic Storage Trust VI, Inc. opens new Class A self-storage facility in Toronto, expanding its Canadian platform.",
            "id": "27751790-6704-4315-897f-8ad363722289",
            "description": "A new Class A self-storage facility has been launched in Toronto, Ontario by Strategic Storage Trust VI, Inc. The facility, situated at 1983 Kipling Ave., represents the company's dedication to expanding its Canadian presence with top-notch development in areas with limited supply. Strategic Storage Trust VI, Inc. is a publicly registered real estate investment trust affiliated with SmartStop Self Storage REIT, Inc. (NYSE: SMA). This move highlights their strategy for growth, emphasizing quality ventures in strategic locations.",
            "link": "https://www.markets.news/headlines/27751790-6704-4315-897f-8ad363722289",
            "pub_date": "2026-02-27 07:32:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "First Horizon Corp (NYSE: FHN) to join 2026 RBC Capital Markets Global Financial Institutions Conference. CEO Bryan Jordan to participate.",
            "id": "0e65272f-1228-453f-b31d-6743e51cc460",
            "description": "In Memphis, Tennessee, on February 26, 2026, First Horizon Corporation (NYSE: FHN) shared that Bryan Jordan, Chairman of the Board, President, and Chief Executive Officer, is set to attend the 2026 RBC Capital Markets Global Financial Institutions Conference on March 10, 2026. The conference is scheduled to take place at a venue mentioned in the original news article.",
            "link": "https://www.markets.news/headlines/0e65272f-1228-453f-b31d-6743e51cc460",
            "pub_date": "2026-02-27 07:32:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sparx Hockey wins iF DESIGN AWARD 2026 for Sparx Sharpener 3 and Sparx BEAM™, showcasing leadership in precision engineering.",
            "id": "cb0ced4b-d00a-46da-9dc8-180b35f65a98",
            "description": "Sparx Hockey, based in ACTON, Massachusetts, was recently recognized for their excellence in precision engineering, user experience, and industrial design. The company, known for being at the forefront of automated skate sharpening technology, received an award on Feb. 26, 2026. This acknowledgment further solidifies Sparx Hockey's leading position in the industry.",
            "link": "https://www.markets.news/headlines/cb0ced4b-d00a-46da-9dc8-180b35f65a98",
            "pub_date": "2026-02-27 07:34:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blueprint Capital Advisors reveals 2026 Power100 Advocates list, honoring individuals/organizations for promoting equitable opportunities and amplifying diverse voices.",
            "id": "5c558c6b-e887-4f82-a105-558a53ae22d6",
            "description": "New York, February 26, 2026 - The 2026 Power100 Advocates list has been released, showcasing individuals and organizations dedicated to promoting equality and inclusivity. These advocates have focused on championing fair opportunities and ensuring all voices are valued. Through their work, they have made a significant impact and wield considerable influence in driving positive change.",
            "link": "https://www.markets.news/headlines/5c558c6b-e887-4f82-a105-558a53ae22d6",
            "pub_date": "2026-02-27 07:22:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "E.J. Ward Inc. names Adam Shaible as CTO and Chase McLaughlin as CFO to boost growth and innovation in fuel management and telematics solutions.",
            "id": "e82ff3af-9e4c-4753-9646-0444a9315fc5",
            "description": "In a recent update on February 25, 2026, E.J. Ward, Inc., a prominent company specializing in automated fuel management and fleet telematics solutions, shared news of appointing key executives. Adam Shaible has been named Chief Technology Officer, while Chase McLaughlin will take on the role of Chief Financial Officer. This move is aimed at enhancing the company's management team and driving innovation in their industry.",
            "link": "https://www.markets.news/headlines/e82ff3af-9e4c-4753-9646-0444a9315fc5",
            "pub_date": "2026-02-27 07:24:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4b6c32e3-9739-4edc-8f3b-fc343a8df6cc",
            "description": "STRONG QUAKE FELT IN LIMA, CAPITAL OF PERU - WITNESS",
            "link": "https://www.markets.news/headlines/4b6c32e3-9739-4edc-8f3b-fc343a8df6cc",
            "pub_date": "2026-02-27 07:25:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix declines to raise offer for Warner Bros. Discovery, stock climbs. NFLX stock rises in extended trading.",
            "id": "65d82b4a-ef1e-4442-bcf6-26b3469f21eb",
            "description": "In extended trading on Thursday, shares of Netflix, Inc. (NASDAQ: NFLX) rose after the company announced it will not increase its bid to acquire Warner Bros. Discovery Inc. (NASDAQ: WBD). NFLX stock is on the rise following this news. The decision was reached as Netflix prioritizes financial discipline over engaging in a bidding war. For further details, the complete article can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/65d82b4a-ef1e-4442-bcf6-26b3469f21eb",
            "pub_date": "2026-02-27 07:26:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Clarus to discuss Q4 and full year 2025 results in conference call on March 5 at 5:00 pm ET. Press release to follow.",
            "id": "604f3ca0-d2c4-400f-b504-e4c8b04bbcf4",
            "description": "On February 26, 2026, Clarus Corporation (NASDAQ: CLAR) announced that they will be conducting a conference call on March 5, 2026, at 5:00 pm Eastern Time to review their financial performance for the fourth quarter and full year ending December 31, 2025. The company, known for its global focus on outdoor enthusiast markets, will release its financial results in a press release after the stock market closes on the day of the conference call. This event will be an opportunity for stakeholders to gain insights into the company's performance in the specified period.",
            "link": "https://www.markets.news/headlines/604f3ca0-d2c4-400f-b504-e4c8b04bbcf4",
            "pub_date": "2026-02-27 07:17:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dcc85703-8b50-4276-a026-f9b003c80b01",
            "description": "Aura unveils Q4 '25 & FY '25 financial and operational results; strong growth with revenue up by 15% to $100M.",
            "link": "https://www.markets.news/headlines/dcc85703-8b50-4276-a026-f9b003c80b01",
            "pub_date": "2026-02-27 07:17:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9f642a7e-7e59-4124-8283-55cd0738d046",
            "description": "US ENERGY SECRETARY WRIGHT SAYS VENEZUELAN CRUDE BEING SOLD AT ABOUT $50 PER BARREL, 40 MLN BARRELS EXPECTED TO HAVE BEEN SOLD BY END OF FEB",
            "link": "https://www.markets.news/headlines/9f642a7e-7e59-4124-8283-55cd0738d046",
            "pub_date": "2026-02-27 07:17:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASU's GAME School partners with Gen.G, starting with youth summer program in June in Downtown LA.",
            "id": "2adafaf6-c624-4532-86a1-55706c48215f",
            "description": "In Los Angeles on February 26, 2026, Arizona State University (ASU) and esports organization Gen.G revealed a collaboration. This partnership will commence with a youth summer program in June and aims to establish a talent pathway. The initiative seeks to foster growth in the gaming industry and nurture upcoming talent.",
            "link": "https://www.markets.news/headlines/2adafaf6-c624-4532-86a1-55706c48215f",
            "pub_date": "2026-02-27 07:06:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rising trend: More parents refusing newborns' vitamin K injections, putting babies at risk due to vitamin K deficiency.",
            "id": "bcdff14f-f672-4931-a128-10b2e4d1a95d",
            "description": "Recent research has revealed a concerning trend showing an increase in the number of parents choosing to decline vitamin K injections for their newborns. Vitamin K, an important vitamin naturally lacking in newborns, is crucial for blood clotting at birth. Despite being a vital supplement and not a vaccine, more parents are opting out of this simple and essential preventive measure for their babies.",
            "link": "https://www.markets.news/headlines/bcdff14f-f672-4931-a128-10b2e4d1a95d",
            "pub_date": "2026-02-27 07:06:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RF-SMART hits milestone with 2,800 NetSuite WMS customers in 40+ countries, offering scalable solutions.",
            "id": "b2fca115-2b9c-42c9-9438-aaa0115e8bf7",
            "description": "A top-ranked WMS SuiteApp by G2 and with highest reviews has achieved a significant milestone, introducing a native, adaptable architecture suitable for companies of any scale. Based in Jacksonville, Florida, RF-SMART, a key NetSuite warehouse management system (WMS) vendor, disclosed hitting the 2,800 mark on Feb. 26, 2026.",
            "link": "https://www.markets.news/headlines/b2fca115-2b9c-42c9-9438-aaa0115e8bf7",
            "pub_date": "2026-02-27 07:06:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "14885ec8-1d2d-4a61-9bae-68b6d7ec0537",
            "description": "US ENERGY SECRETARY WRIGHT SAYS HE EXPECTS VENEZUELAN OIL SALES TO INCREASE AS EXPORTS GO TO BUYERS IN INDIA, ASIA AND EUROPE",
            "link": "https://www.markets.news/headlines/14885ec8-1d2d-4a61-9bae-68b6d7ec0537",
            "pub_date": "2026-02-27 07:07:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kratos Defense (NASDAQ: KTOS) falls in after-hours trading following proposed offering of $1.15 billion in common stock.",
            "id": "3527808f-63e7-4d9d-a846-d2cd5f370bbf",
            "description": "Kratos Defense & Security Solutions Inc (NASDAQ: KTOS) witnessed a decline in after-hours trading following the announcement of a proposed offering. The company revealed its plan to offer $1 billion in shares of common stock through underwritten offerings, with an option for underwriters to purchase an additional $150 million within 30 days. All shares in the offering will be sold by Kratos, with the objective of utilizing the net proceeds for financing purposes. This development contributed to the downward trend in Kratos Defense & Security shares.",
            "link": "https://www.markets.news/headlines/3527808f-63e7-4d9d-a846-d2cd5f370bbf",
            "pub_date": "2026-02-27 07:08:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Payments company cuts workforce by 40%, leading to 4,000 job losses due to increased use of AI tools, says top executive.",
            "id": "3bd017be-d7e2-40f3-9c4f-d6301ee03b7e",
            "description": "The CEO of a payments company announced that approximately 4,000 employees will be laid off due to the implementation of new artificial intelligence technologies in their operations.",
            "link": "https://www.markets.news/headlines/3bd017be-d7e2-40f3-9c4f-d6301ee03b7e",
            "pub_date": "2026-02-27 07:09:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MCIC and PFI collaborate to address disinvestment in rural Maryland through New Market Tax Credits.",
            "id": "f7c977c0-f065-4dc0-83cd-4326c6ac3326",
            "description": "In Boston on February 26, 2026, the Maryland Community Investment Corporation (MCIC) and the Public Finance Initiative (PFI) collaborated to host a Rural Convening event. This event aimed to shed light on New Market Tax Credits and explore comprehensive strategies for securing capital. The event spanned multiple days and provided valuable insights, with attendees including industry experts, stakeholders, and key decision-makers. This gathering facilitated discussions on rural development opportunities and ways to leverage New Market Tax Credits effectively. The participation numbers exceeded expectations, with over 200 individuals present to engage in meaningful dialogue and knowledge exchange. The event successfully demystified the complexities of New Market Tax Credits, fostering a deeper understanding among attendees regarding capital integration approaches for rural development initiatives.",
            "link": "https://www.markets.news/headlines/f7c977c0-f065-4dc0-83cd-4326c6ac3326",
            "pub_date": "2026-02-27 07:01:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}