{
    "data": [
        {
            "title": "",
            "id": "e497cb49-9977-4fed-8cf7-1f4854e2fac3",
            "description": "Iranian TV: Signs indicate an agreement is imminent.",
            "link": "https://www.markets.news/headlines/e497cb49-9977-4fed-8cf7-1f4854e2fac3",
            "pub_date": "2026-02-27 02:58:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "United Therapeutics beat Q4 earnings estimate with $7.70 earnings per share. Sales were $790.200 million, missing estimate. CEO is optimistic about future clinical programs.",
            "id": "8a44790a-0c18-43b8-9503-3d53eed6131f",
            "description": "United Therapeutics Corp (NASDAQ: UTHR) exceeded expectations in their fourth-quarter earnings report, revealing earnings of $7.70 per share, surpassing the estimated $7.09 per share. However, the company fell short of the projected $813.077 million in quarterly sales with reported sales totaling $790.200 million. Martine Rothblatt, Ph.D., Chairperson and Chief Executive Officer of United Therapeutics, expressed gratitude towards the team for achieving record total revenue for the fourth consecutive year. The company is eagerly anticipating the results of their ADVANCE OUTCOMES and TETON-1 clinical programs which have the potential to introduce new treatment alternatives for patients.",
            "link": "https://www.markets.news/headlines/8a44790a-0c18-43b8-9503-3d53eed6131f",
            "pub_date": "2026-02-27 02:58:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Business travel surpasses leisure as main factor driving private aviation in 2026, marking stable growth post-pandemic.",
            "id": "2a814706-e85d-49cc-b29d-84950f4f57e9",
            "description": "ALTOUR, a company under Internova Travel Group, announced in New York on Feb. 26, 2026, that private aviation is transitioning into a steadier and more mature phase this year. Following the pandemic-induced fluctuations, the industry is now experiencing stabilization, with demand leveling off. Business travel, which had seen significant disruptions, is gradually returning to normal. This marks a shift from the previous years of rapid growth and unpredictability.",
            "link": "https://www.markets.news/headlines/2a814706-e85d-49cc-b29d-84950f4f57e9",
            "pub_date": "2026-02-27 03:00:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSX Corp increases quarterly dividend to $0.14 per share (8% increase) payable on March 13, 2026.",
            "id": "5996aaad-9682-4f0f-a2fb-f62c55562bc4",
            "description": "In Jacksonville, Florida, on February 26, 2026, CSX Corp. (NASDAQ: CSX) shared that their Board of Directors has sanctioned a quarterly dividend of $0.14 per share on the Company's common stock. This dividend is set to be paid out on March 13, 2026, to shareholders of record as of the end of business on February 27, 2026. The new dividend marks an 8% rise compared to the last payment of $0.13 per share.",
            "link": "https://www.markets.news/headlines/5996aaad-9682-4f0f-a2fb-f62c55562bc4",
            "pub_date": "2026-02-27 03:01:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0a3015fb-9358-477c-b837-edd2998fa37b",
            "description": "BANK OF MEXICO RAISES 2026 GDP GROWTH FORECAST TO 1.6% FROM 1.1%, SEES 2027 GROWTH AT 2.0%, SIGNALING A MODERATE ACCELERATION IN ECONOMIC EXPANSION.",
            "link": "https://www.markets.news/headlines/0a3015fb-9358-477c-b837-edd2998fa37b",
            "pub_date": "2026-02-27 02:53:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Medline Inc (MDLN) reported Q4 loss of 1 cent/share, missed earnings estimate, but beat sales estimate at $7.787B. CEO pleased with $2.4B new customer signings in 2025.",
            "id": "1394b5df-3cae-4aa7-ac9d-15bb64a4ef99",
            "description": "Medline Inc (NASDAQ: MDLN) released its fourth-quarter results recently, presenting a mixed report. The company recorded a loss of 1 cent per share, falling short of the expected earnings of 18 cents per share according to analysts. However, in terms of quarterly sales, Medline exceeded expectations by reporting $7.787 billion, surpassing the projected $7.547 billion. Jim Boyle, the CEO of Medline, expressed satisfaction with the results, highlighting the closure of a successful 2025 with $2.4 billion in new customer signings. This achievement signifies the trust customers have in the company's value proposition.",
            "link": "https://www.markets.news/headlines/1394b5df-3cae-4aa7-ac9d-15bb64a4ef99",
            "pub_date": "2026-02-27 02:53:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wu-Tang Clan's Business Architect Oliver Grant, key member since inception, passes away. His work included expanding the group's reach with a fashion line.",
            "id": "80821ddb-045b-4c32-9002-8a15ac6c337f",
            "description": "He played a crucial role in the development of the renowned New York rap group, Wu-Tang Clan, since its inception. Additionally, he was instrumental in broadening the group's influence by introducing a fashion line.",
            "link": "https://www.markets.news/headlines/80821ddb-045b-4c32-9002-8a15ac6c337f",
            "pub_date": "2026-02-27 02:53:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eaton raises dividend to $1.10/share, up 6%. Dividend payable March 27, 2026, to shareholders as of March 10, 2026.",
            "id": "9f0b8209-6cff-4ea3-83d8-290fd4c11976",
            "description": "In Dublin, the Board of Directors of Eaton, a leading intelligent power management company listed as NYSE:ETN, announced a 6% increase in their quarterly dividend to $1.10 per ordinary share. Shareholders of record as of March 10, 2026, will receive the dividend on March 27, 2026. Eaton has consistently paid dividends on its shares since 1923. The company focuses on sustainable practices to safeguard the environment while enhancing operational efficiency through innovative power management solutions.",
            "link": "https://www.markets.news/headlines/9f0b8209-6cff-4ea3-83d8-290fd4c11976",
            "pub_date": "2026-02-27 02:54:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dr. Marcus Coplin releases white paper on future wellness trends in 2026, outlining regenerative blueprint.",
            "id": "0259e424-1502-4b3c-b5ff-13f665f8ba51",
            "description": "Dr. Marcus Coplin, a naturopathic medical doctor and the medical director of The Springs Resort in Pagosa Springs, Colorado, and Murrieta Hot Springs Resort in Murrieta, California, recently presented a regenerative blueprint for the future of wellness. This announcement was made on February 26, 2026.",
            "link": "https://www.markets.news/headlines/0259e424-1502-4b3c-b5ff-13f665f8ba51",
            "pub_date": "2026-02-27 02:56:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c09fa495-cf49-48c7-b9b7-308213c65b78",
            "description": "US, IRAN TO CONTINUE TALKS NEXT WEEK AT TECHNICAL LEVEL: OMAN",
            "link": "https://www.markets.news/headlines/c09fa495-cf49-48c7-b9b7-308213c65b78",
            "pub_date": "2026-02-27 02:56:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ethan Allen's Mexico plant in Silao, Guanajuato, honored for 7th year for socially and environmentally responsible practices.",
            "id": "8efb0884-aa0a-4ed5-8e79-801272312246",
            "description": "In Danbury, Connecticut on February 26, 2026, Ethan Allen's upholstery manufacturing facility in Silao, Guanajuato, Mexico has received the \"Empresa Socialmente Responsable\" (Environmentally and Socially Responsible Company) designation for the seventh year in a row. This prestigious recognition is awarded by the Mexican Center for Corporate Philanthropy and the Alliance for Corporate Social Responsibility, highlighting the plant's ongoing commitment to environmental and social responsibility.",
            "link": "https://www.markets.news/headlines/8efb0884-aa0a-4ed5-8e79-801272312246",
            "pub_date": "2026-02-27 02:46:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EDF's successful senior green bond issue raises 2.75 billion euros.",
            "id": "3070f2d4-f7d4-4d90-a741-66a676812104",
            "description": "EDF has reported the accomplishment of its senior green multi-tranche bond issuance, totaling 2.75 billion euros in nominal value.",
            "link": "https://www.markets.news/headlines/3070f2d4-f7d4-4d90-a741-66a676812104",
            "pub_date": "2026-02-27 02:47:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IonQ (NYSE: IONQ) reported Q4 revenue of $61.9 million, up 429% YoY, surpassing expectations. Stock up 20% in response. Company hit $130 million for full year, signaling strong commercial growth in quantum computing sector. Investors optimistic about future.",
            "id": "0e2f3bcc-5e52-4ed7-820d-bbd8358890d9",
            "description": "IonQ Inc. (NYSE: IONQ) has reported impressive fourth-quarter results, marking a significant shift in the quantum computing sector from theoretical promise to tangible commercial growth. The company's stock is on the rise, reflecting investor confidence. In Q4, IonQ recorded a substantial revenue beat of $61.9 million, showcasing a remarkable 429% increase from the previous year and surpassing Wall Street's projections. This robust performance extended to the full year, with IonQ achieving $130 million in revenue, becoming the first pure-play quantum company to surpass the $100 million annual revenue milestone. As a result, shares surged by nearly 20% in a single trading session. IonQ's success not only benefitted the company but also boosted the entire quantum sector, demonstrating the increasing willingness of customers to invest in quantum services. This development signifies a promising start for quantum businesses as they move into a phase of commercial viability.",
            "link": "https://www.markets.news/headlines/0e2f3bcc-5e52-4ed7-820d-bbd8358890d9",
            "pub_date": "2026-02-27 02:48:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teladoc Health beats Q4 earnings, posts sales of $642.269M vs $635.235M estimates; FY2026 loss forecast cut to $(1.10)-$(0.70) vs $(0.76) estimates; expects sales of $2.47B-$2.587B vs $2.548B estimates.",
            "id": "e721c43b-e0a3-4426-954a-8999c336801d",
            "description": "Teladoc Health Inc (NYSE: TDOC) reported a strong performance for Q4 with a quarterly loss of 14 cents per share, surpassing market expectations of an 18 cents per share loss. The company's sales reached $642.269 million, exceeding estimates of $635.235 million. For FY2026, Teladoc Health anticipates a GAAP loss ranging between $(1.10)-$(0.70) compared to market projections of $(0.76). Revenue outlook for the year is between $2.470 billion-$2.587 billion, while estimates stood at $2.548 billion. The company's CEO expressed optimism about the results, highlighting achievements in various strategic areas.",
            "link": "https://www.markets.news/headlines/e721c43b-e0a3-4426-954a-8999c336801d",
            "pub_date": "2026-02-27 02:48:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FedEx may refund customers for tariffs after suing administration post Supreme Court ruling against duties.",
            "id": "595569d7-43ab-498b-81f1-1a9f6f94ec5e",
            "description": "The company took legal action against the administration a few days following the Supreme Court's decision against the president's responsibilities.",
            "link": "https://www.markets.news/headlines/595569d7-43ab-498b-81f1-1a9f6f94ec5e",
            "pub_date": "2026-02-27 02:48:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EventWorks 4D collaborates on Europe's first interactive AI Holocaust testimony theater, expanding immersive capabilities.",
            "id": "501b5da3-3b57-410e-ae50-1ede0da012c9",
            "description": "In Essen, Germany, on February 26, 2026, EventWorks 4D revealed their partnership in introducing Europe's pioneering interactive AI Holocaust testimony theater, known as the Holo-Voices Theater. This innovative project was created in conjunction with TU Dortmund University and received support from the Ministry of Culture and Science of the State. The Holo-Voices Theater promises to provide a unique experience, blending historical narratives with cutting-edge technology for educational purposes.",
            "link": "https://www.markets.news/headlines/501b5da3-3b57-410e-ae50-1ede0da012c9",
            "pub_date": "2026-02-27 02:50:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Daymond John to speak at WiresConnect conference in Seattle, March 11, 2026. Exclusive event for leaders in retail & technology. CEO Kimberly Carney hosts at The Rainier Club.",
            "id": "3d2ff0e8-2db8-4bc0-9d8b-20eb067b2967",
            "description": "In Seattle, WiresConnect is organizing its third conference on March 11, at The Rainier Club. The event, established by Kimberly Carney, CEO & Founder of The Wires, aims to unite leaders from retail, innovation, and technology sectors. This exclusive, by-invitation-only gathering focuses on discussions related to AI, leadership, and other pertinent topics. Previous events in New York saw significant attendance, marking a successful series of engagements. The upcoming conference anticipates participation from decision-makers in retail, technology, media, and culture industries for high-level exchanges.",
            "link": "https://www.markets.news/headlines/3d2ff0e8-2db8-4bc0-9d8b-20eb067b2967",
            "pub_date": "2026-02-27 02:50:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PatentVest report analyzes 1,200+ patent docs on Oral Small-Molecule GLP-1, highlighting exclusivity trends.",
            "id": "5371b4ee-94ea-4c7c-9a74-955c12b8b4e0",
            "description": "Examination of over 1,200 patent documents highlights the programs that are establishing long-lasting exclusivity rights, as well as those that may not be.",
            "link": "https://www.markets.news/headlines/5371b4ee-94ea-4c7c-9a74-955c12b8b4e0",
            "pub_date": "2026-02-27 02:37:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rider Jet Center at Hagerstown Regional Airport wins regional and national awards; recognized for excellence.",
            "id": "5fcdfed5-4fbc-42f3-8f9e-664b637fc3d1",
            "description": "In Hagerstown, Maryland on February 26, 2026, Rider Jet Center, a comprehensive Fixed Base Operator (FBO) located at Hagerstown Regional Airport, has received prestigious regional and national accolades. The center achieved victory in the 2026 Washington County Business Awards, affirming its commitment to excellence in its services...",
            "link": "https://www.markets.news/headlines/5fcdfed5-4fbc-42f3-8f9e-664b637fc3d1",
            "pub_date": "2026-02-27 02:37:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cancun All Inclusive unveils new resorts and exclusive deals for Spring Break 2026. All you need in one place.",
            "id": "da5ce6e3-e51b-4e07-8c25-f7baa5c5b97a",
            "description": "Get ready for an unforgettable Spring Break experience in Cancun, Mexico! Cancun All Inclusive offers a wide range of amenities including All Inclusive Resorts, Airport Transportation, and Tours. Visit their website at www.cancunallinclusive.com for more information. Plan your trip now for the upcoming Spring Break 2026!",
            "link": "https://www.markets.news/headlines/da5ce6e3-e51b-4e07-8c25-f7baa5c5b97a",
            "pub_date": "2026-02-27 02:39:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}