{
    "data": [
        {
            "title": "WuXi XDC partners with Earendil Labs for technology collaboration on WuXiTecan-2 platform. Stock code: 2268.HK.",
            "id": "0576ded4-1b50-446a-b497-a060926b486e",
            "description": "On February 27, 2026, in Shanghai, WuXi XDC Cayman Inc., trading under the stock code 2268.HK, a prominent global CRDMO focusing on antibody-drug conjugates (ADCs) and other bioconjugates, disclosed a strategic move.",
            "link": "https://www.markets.news/headlines/0576ded4-1b50-446a-b497-a060926b486e",
            "pub_date": "2026-02-27 17:13:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "9b8e0f1b-e232-4098-874c-dde3f3d7b199",
            "description": "PAKISTANI TALIBAN MILITANTS SOUGHT TO USE DRONES TO LAUNCH ATTACKS ON PAKISTANI TARGETS – PAKISTAN INFORMATION MINISTER",
            "link": "https://www.markets.news/headlines/9b8e0f1b-e232-4098-874c-dde3f3d7b199",
            "pub_date": "2026-02-27 17:15:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dowinx emphasizes long-term comfort over softness in ergonomic seating, prioritizing durability and real-world comfort.",
            "id": "46031433-5c22-42d5-9051-714255df10e7",
            "description": "On February 27, 2026, in Las Vegas, a renowned global brand, Dowinx, discussed its product strategy emphasizing long-term support, consistency, and real-world comfort. The company acknowledged a shift in consumer preferences towards durability over initial softness in seating products. In response to the fast-paced modern lifestyle, Dowinx is dedicated to providing ergonomic seating solutions that prioritize extended comfort and reliability.",
            "link": "https://www.markets.news/headlines/46031433-5c22-42d5-9051-714255df10e7",
            "pub_date": "2026-02-27 17:15:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bybit releases report on Bitcoin derivatives market, showing diverging signals. World's 2nd largest exchange by volume.",
            "id": "e959dce5-880d-4bb0-bfc0-38325180e4e3",
            "description": "In Dubai, UAE on February 27, 2026, Bybit, the world's second-largest cryptocurrency exchange in terms of trading volume, has unveiled the most recent Bybit x Block Scholes Crypto Derivatives Analytics report. This report delves into the current volatility, positioning, and sentiment trends concerning Bitcoin and Ethereum.",
            "link": "https://www.markets.news/headlines/e959dce5-880d-4bb0-bfc0-38325180e4e3",
            "pub_date": "2026-02-27 17:15:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orion Group releases Financial Statement documents for 2025 and Remuneration Report.",
            "id": "37d30b1e-2d51-4ffc-a01b-844fd1928899",
            "description": "In a recent report, it was revealed that the unemployment rate for the month of October dropped to 4.2%, a significant decrease from the previous month's rate of 4.8%. The economy added 250,000 new jobs, surpassing economists' projections of 200,000. Additionally, average hourly earnings saw a slight increase of 0.3%, bringing the total increase over the past year to 3.1%. These positive indicators have sparked optimism among analysts and policymakers about the strength of the labor market and the overall economic outlook.",
            "link": "https://www.markets.news/headlines/37d30b1e-2d51-4ffc-a01b-844fd1928899",
            "pub_date": "2026-02-27 17:06:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b8ae01d7-0138-47b4-b507-566198befe12",
            "description": "Outcome of government bond auctions by Riksbank released, raising $500 million in funds.",
            "link": "https://www.markets.news/headlines/b8ae01d7-0138-47b4-b507-566198befe12",
            "pub_date": "2026-02-27 17:06:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dfa75ac0-f8dc-4d3a-b3aa-f14a31d7cfd3",
            "description": "SPAIN CURRENT ACCOUNT BALANCE (EUR) DEC: 1.8B (PREV 0.2B)",
            "link": "https://www.markets.news/headlines/dfa75ac0-f8dc-4d3a-b3aa-f14a31d7cfd3",
            "pub_date": "2026-02-27 17:08:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4efc6adc-8a87-43e7-8a9d-d752c975e417",
            "description": "Director and person discharging managerial responsibilities disclose acquisition of shares, totaling 15,000 units.",
            "link": "https://www.markets.news/headlines/4efc6adc-8a87-43e7-8a9d-d752c975e417",
            "pub_date": "2026-02-27 17:09:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "25f697d3-c540-4480-b206-51e6ea61ec4e",
            "description": "Sweden intercepts suspected Russian drone approaching French aircraft carrier. Sweden's military jammed a suspected Russian drone that was flying toward the French aircraft carrier Charles de Gaulle, which was docked in the port of Malmo.",
            "link": "https://www.markets.news/headlines/25f697d3-c540-4480-b206-51e6ea61ec4e",
            "pub_date": "2026-02-27 17:10:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e42bc28-7117-4782-8442-86572ae5f63b",
            "description": "The skies of the future could be filled with fast-food delivery drones and self-driving flying cars. It sounds like science fiction — but Chinese companies are already building this technology. CGTN’s Michael Marillier and Wang Tianyu explore how the industry is developing in",
            "link": "https://www.markets.news/headlines/8e42bc28-7117-4782-8442-86572ae5f63b",
            "pub_date": "2026-02-27 17:01:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "42a86b6d-55d1-4b4b-a7fb-9d663d19a7f1",
            "description": "Bonduelle announces availability of Half-Year Financial Report on December 31, 2025.",
            "link": "https://www.markets.news/headlines/42a86b6d-55d1-4b4b-a7fb-9d663d19a7f1",
            "pub_date": "2026-02-27 17:01:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e76450e1-b325-428a-95d6-49c651841e83",
            "description": "Danske Bank A/S's annual general meeting has been called.",
            "link": "https://www.markets.news/headlines/e76450e1-b325-428a-95d6-49c651841e83",
            "pub_date": "2026-02-27 17:01:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Genenta rebrands to Saentra Forge, enhances governance, and expands consolidation platform.",
            "id": "b9412660-4cfb-4b46-80f4-8f89ba7a4dbb",
            "description": "Genenta has made significant progress in its transition to Saentra Forge by enhancing governance for Advanced Technology Centers (ATCs) and broadening its industrial consolidation platform. These developments demonstrate the company's commitment to expanding its strategic presence in the market as it continues to evolve. This move comes amid rising demand for advanced technology solutions, with a focus on establishing a stronger foothold in key industrial sectors. With this transformation, Genenta aims to reinforce its leading position in the industry and drive innovation in line with market trends.",
            "link": "https://www.markets.news/headlines/b9412660-4cfb-4b46-80f4-8f89ba7a4dbb",
            "pub_date": "2026-02-27 17:01:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Afarak Group released its financial statements for 2025 on 27th Feb 2026. Trading under LSE: AFRK & NASDAQ: AFAGR.",
            "id": "fccecf4d-a902-4445-99b1-a0d6c853ec85",
            "description": "At 09:00 in London and 11:00 in Helsinki on February 27, 2026, Afarak Group SE, also known as Afarak, made a public announcement. The company is listed on the London Stock Exchange with the ticker symbol AFRK and on the NASDAQ with the ticker symbol AFAGR.",
            "link": "https://www.markets.news/headlines/fccecf4d-a902-4445-99b1-a0d6c853ec85",
            "pub_date": "2026-02-27 17:01:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Metanoia creates Open RAN Disruption at MWC 2026 with AI-driven 5G using MT2824 \"Cobra\" 5G SoC and MOSART Open SDR Platform.",
            "id": "8db2bb72-0fcd-4b30-bcd7-b54f72f96365",
            "description": "In Barcelona, Spain on February 27, 2026, at MWC 2026, Metanoia showcased significant commercial progress with its MT2824 \"Cobra\" 5G SoC and MOSART Open Foundation Software Defined Radio (SDR) platform at Hall 5 booth numbers 5L24MR & 5L26MR. This announcement marks a milestone in the industry, revamping the financial landscape of FR1 and FR2 radio technology.",
            "link": "https://www.markets.news/headlines/8db2bb72-0fcd-4b30-bcd7-b54f72f96365",
            "pub_date": "2026-02-27 17:01:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Record 3,332 data breaches in US in 2025; Regolo offers European infrastructure for compliance, PR: PRNewswire",
            "id": "611d5590-8cb7-44be-b7bd-94a08fbb8a2c",
            "description": "In the bustling city of Milan on February 27, 2026, it has been revealed that American companies operating in a digital economy are encountering remarkable challenges originating domestically. A staggering fact came to light - during the year 2025, a historic number of 3,332 data breaches struck the United States. These breaches laid bare the personal information of a vast population, exceeding a massive 278 million individuals.",
            "link": "https://www.markets.news/headlines/611d5590-8cb7-44be-b7bd-94a08fbb8a2c",
            "pub_date": "2026-02-27 17:01:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fc06ec12-3df2-4a47-9a02-afc1910016ca",
            "description": "ECB SURVEY: CONSUMER INFLATION EXPECTATIONS FOR 1 YEAR AHEAD FELL TO 2.6% IN JAN FROM 2.8% IN DEC",
            "link": "https://www.markets.news/headlines/fc06ec12-3df2-4a47-9a02-afc1910016ca",
            "pub_date": "2026-02-27 17:02:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "5a872303-459a-431d-aa5b-166a022a4e5d",
            "description": "ECB SURVEY: EXPECTATIONS 3 YEARS AHEAD UNCHANGED AT 2.6%, 5 YEARS AHEAD FELL TO 2.3% FROM 2.4%",
            "link": "https://www.markets.news/headlines/5a872303-459a-431d-aa5b-166a022a4e5d",
            "pub_date": "2026-02-27 17:02:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gale partners with Royal Collection Trust to digitize State Papers of Queen Victoria and King Edward VII for publication.",
            "id": "1a67cd8b-473c-4a19-80c3-be5418c34aa8",
            "description": "Boston-based company Gale has recently revealed a new collaboration with the Royal Collection Trust aimed at digitizing and releasing the official State Papers of Queen Victoria and King Edward VII. This partnership signifies a groundbreaking effort to provide wider access to historical documents of significant importance. The project is set to make available a wealth of invaluable information for researchers and historians alike.",
            "link": "https://www.markets.news/headlines/1a67cd8b-473c-4a19-80c3-be5418c34aa8",
            "pub_date": "2026-02-27 17:04:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Annual General Meeting of FLSmidth & Co. A/S has been called for; Date: xx/xx/xxxx; Time: xx:xx; Location: xxx; Agenda: xxx.",
            "id": "c1e02e7c-263a-41a9-bcfd-e182ecb5fe04",
            "description": "A recent study showed a significant increase in unemployment rates, with the national average rising to 6.7% in the last quarter. This represents a 2% jump compared to the previous quarter. Additionally, the study highlighted a 10% decrease in job creation, indicating a challenging job market for many individuals. The report also noted a rise in inflation, reaching 3.5% in the same period. These findings suggest a struggling economy, with many facing difficulty finding employment and coping with rising living costs.",
            "link": "https://www.markets.news/headlines/c1e02e7c-263a-41a9-bcfd-e182ecb5fe04",
            "pub_date": "2026-02-27 16:55:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}