{
    "data": [
        {
            "title": "Novavax reports Q4 earnings of 11 cents per share, a shift from a loss of 51 cents last year, with revenue of $147 million, up by 67%. Moving forward, the company plans to reduce expenses with targets set at $325 million in 2026, $225 million in 2027, and $200 million in 2028. Management is optimistic about their progress and achievements in 2025.",
            "id": "1b5c6e5b-b917-4ace-964b-8f5008918991",
            "description": "Novavax Inc. (NASDAQ: NVAX) shares rose on Thursday after revealing its fourth-quarter and full-year 2025 financial results. The company reported fourth-quarter earnings of 11 cents per share, a notable improvement from a loss of 51 cents in the same period last year. Revenue for the quarter reached $147 million, reflecting a substantial 67% year-over-year increase. Novavax surpassed its 2025 cost-cutting targets in both GAAP and Non-GAAP R&D and SG&A spending and is now adjusting future expense goals. It anticipates Non-GAAP R&D and SG&A expenses of $325 million in 2026, $225 million in 2027, and $200 million or less in 2028 (a newly introduced target). The company's management highlighted progress made in 2025, including key milestones achieved under its Sanofi agreement and the signing of multiple MTAs with other parties to explore its Matrix-M adjuvant technology. For more details, access the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/1b5c6e5b-b917-4ace-964b-8f5008918991",
            "pub_date": "2026-02-27 03:22:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nano Banana 2 by Google overtakes as AI imaging champ, trumping with rapid world info processing. Seedream 5 by ByteDance challenges for the throne.",
            "id": "24270d93-f6e5-4e69-b7e4-aee0a42cf4da",
            "description": "Nano Banana 2 offers advanced global insights quickly, boasting exceptional text management and thematic coherence. However, Seedream 5 by ByteDance has entered the same arena with robust competition.",
            "link": "https://www.markets.news/headlines/24270d93-f6e5-4e69-b7e4-aee0a42cf4da",
            "pub_date": "2026-02-27 03:23:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dd72df19-55fa-41ca-a50f-36e1f7b5a88b",
            "description": "Taliban spox: ‘Along the so-called Durand Line, heavy retaliatory offensive operations have been launched against the enemy by the Islamic Emirate of Afghanistan through the 203 Mansouri Corps and the 201 Khalid bin Walid Corps at various points in the provinces of Paktia,",
            "link": "https://www.markets.news/headlines/dd72df19-55fa-41ca-a50f-36e1f7b5a88b",
            "pub_date": "2026-02-27 03:23:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8e51e387-e240-488d-ab4e-449a5f3d07a2",
            "description": "IDF Spokesperson: Earlier today (Thursday), combat team forces of the 'Iron Fist' Brigade (205) operating in the northern Gaza Strip identified several terrorists in the yellow line area who approached the forces in a manner that posed an immediate threat to them. Immediately",
            "link": "https://www.markets.news/headlines/8e51e387-e240-488d-ab4e-449a5f3d07a2",
            "pub_date": "2026-02-27 03:23:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lubrizol introduces LED chlorination tech in CPVC manufacturing, boosting resin quality and efficiency in Kentucky plant.",
            "id": "559e0aa5-e8e0-4e55-8c42-5e1579e74396",
            "description": "In a recent announcement, Lubrizol unveiled a significant development in its CPVC manufacturing by implementing LED reactor technology at its facility in Louisville, Kentucky. This cutting-edge manufacturing method marks a substantial enhancement in CPVC resin quality and processing efficiency. Through this innovation, Lubrizol enhances its position as a leader in technical resin production and gains increased operational versatility to respond to global market needs. The integration of LED reactor technology addresses a key performance factor of CPVC resin, thermal stability, and is poised to elevate production standards.",
            "link": "https://www.markets.news/headlines/559e0aa5-e8e0-4e55-8c42-5e1579e74396",
            "pub_date": "2026-02-27 03:13:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Glenfarne and TotalEnergies sign agreement for 2 MTPA LNG off Alaska LNG project.",
            "id": "32858cc8-ca20-4a3e-858e-b2b4c7c07642",
            "description": "In Washington, Glenfarne, the primary owner and developer of the Alaska LNG project, has partnered with TotalEnergies to secure an offtake agreement for the purchase of 2 million metric tons per annum (MTPA) of liquefied natural gas (LNG) from the Alaska LNG project.",
            "link": "https://www.markets.news/headlines/32858cc8-ca20-4a3e-858e-b2b4c7c07642",
            "pub_date": "2026-02-27 03:13:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Peoples Ltd. (OTC: PPLL) declares $0.34 per share first quarter dividend, payable on March 31, 2026.",
            "id": "fbc45bdd-ffed-4c30-9387-6353a1d4234c",
            "description": "In Wyalusing, Pennsylvania on February 26, 2026, Peoples Ltd. (OTC: PPLL) disclosed that their President and CEO, Anthony J. Gabello, revealed that the Board of Directors has sanctioned a cash dividend of $0.34 per share for the first quarter. This dividend is scheduled to be paid out on March 31, 2026.",
            "link": "https://www.markets.news/headlines/fbc45bdd-ffed-4c30-9387-6353a1d4234c",
            "pub_date": "2026-02-27 03:14:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3a0d5435-0854-4718-8c26-4a8bd3f8666b",
            "description": "UKRAINE'S ZELENSKIY SAYS NEXT TRILATERAL TALKS WILL LIKELY TAKE PLACE IN ABU DHABI IN EARLY MARCH",
            "link": "https://www.markets.news/headlines/3a0d5435-0854-4718-8c26-4a8bd3f8666b",
            "pub_date": "2026-02-27 03:14:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Socure named in Forbes Fintech 50 for 2nd time in 2026, leading identity and risk provider for digital economy.",
            "id": "ef33b88b-d61d-488f-9458-7ab7dc7748b9",
            "description": "Socure, a leading identity and risk platform in the AI realm, has been recognized on the 2026 Forbes Fintech 50 list. This marks the company’s second time on the esteemed list, showcasing its prominence as a provider of identity and risk infrastructure for the digital economy. The Forbes Fintech 50, now in its 11th year, highlights private fintech entities that exhibit robust revenue growth, product innovation, and overall market impact. This acknowledgment underscores Socure's continued success and importance in the industry.",
            "link": "https://www.markets.news/headlines/ef33b88b-d61d-488f-9458-7ab7dc7748b9",
            "pub_date": "2026-02-27 03:15:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Higginbotham partners with Monarch Solutions Inc. to enhance services for high-net-worth clients.",
            "id": "051dfa99-2605-4c6d-a281-88dd9a2ee5aa",
            "description": "Monarch has joined forces with Higginbotham, an employee-owned insurance and financial services firm based in Texas. The collaboration, effective as of February 26, 2026, brings specialized capabilities to Higginbotham while providing access to resources for both clients and the team. The partnership aims to combine their expertise to better serve their customers.",
            "link": "https://www.markets.news/headlines/051dfa99-2605-4c6d-a281-88dd9a2ee5aa",
            "pub_date": "2026-02-27 03:16:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "10bb65f8-4b7a-41f7-9f2f-a0180e18967b",
            "description": "Senior U.S. official: “The Geneva nuclear talks with Iran were positive\" - axios reporter",
            "link": "https://www.markets.news/headlines/10bb65f8-4b7a-41f7-9f2f-a0180e18967b",
            "pub_date": "2026-02-27 03:18:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Unox opens first U.S. plant in North Carolina, reinforcing commitment to NA market; celebrates with showcase.",
            "id": "21f72f12-64b2-4202-b4a7-c4000560d6b7",
            "description": "Unox has officially inaugurated its initial manufacturing facility in the United States, located in Denver, North Carolina. This step signifies Unox's strengthened dedication to the North American market.",
            "link": "https://www.markets.news/headlines/21f72f12-64b2-4202-b4a7-c4000560d6b7",
            "pub_date": "2026-02-27 03:20:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Beast Industries CEO lauds BitMine as Ethereum staking market leader, invests $200M. Ethackbone of stablecoin infrastructure.",
            "id": "bc2bd888-7016-4170-8917-03f77445b4b8",
            "description": "CEO Jeff Housenbold of Beast Industries recently referred to BitMine (NYSE: BMNR) as a key player in the Ethereum (CRYPTO: ETH) staking sector essential for stablecoin infrastructure, justifying their substantial $200 million investment. The investment was made earlier this year by Beast Industries, known for its association with MrBeast's media empire boasting 1.45 billion users. Housenbold elaborated on the reasoning behind this decision during an appearance on CNBC's Squawk Box, stating, \"Ethereum serves as the foundation for stablecoin and blockchain.\" He emphasized the significance of the DeFi (Decentralized Finance) trend for users, highlighting benefits such as increased accessibility, democratization, reduced capital costs, and secure global capital transfers. Beast Industries, backed by a massive user base, is actively broadening its reach beyond this investment.",
            "link": "https://www.markets.news/headlines/bc2bd888-7016-4170-8917-03f77445b4b8",
            "pub_date": "2026-02-27 03:07:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zoom reported strong Q4 results, with total revenues at $1.247 billion (5.3% YoY growth), exceeding estimates. Analyst maintains Buy rating and $115 price target, highlighting enterprise resilience and profitability.",
            "id": "6b66c3e6-b6c5-4b5a-8f32-b8c8ea1b524b",
            "description": "Zoom Communications Inc (NASDAQ: ZM) posted robust fourth-quarter and full-year figures, bolstered by enterprise resilience and displacement victories, as per Rosenblatt Securities. Analyst Catharine Trebnick maintained a Buy rating and $115 price target. The company's performance demonstrated modest revenue growth, strong enterprise trends, and exceptional profitability. Zoom's total revenues for Q4 rose by 5.3% YoY to $1.247 billion, surpassing Street predictions by around $12 million. For more details, refer to Benzinga.com.",
            "link": "https://www.markets.news/headlines/6b66c3e6-b6c5-4b5a-8f32-b8c8ea1b524b",
            "pub_date": "2026-02-27 03:07:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c6e465c-e15a-4ca7-9b27-8c0cb926958b",
            "description": "ECUADOR'S NATIONAL ASSEMBLY APPROVES MINING SECTOR REFORM",
            "link": "https://www.markets.news/headlines/1c6e465c-e15a-4ca7-9b27-8c0cb926958b",
            "pub_date": "2026-02-27 03:08:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f248fae0-b421-42b4-8c64-4c7df97dd374",
            "description": "Taliban spox: ‘In the Sarkano district of Kunar, three more posts have been captured. A large number of the enemy's soldiers have been killed and wounded, and some have been captured alive. Latest: In the Istiqlal district of Sarcano in Kunar, another enemy post was also",
            "link": "https://www.markets.news/headlines/f248fae0-b421-42b4-8c64-4c7df97dd374",
            "pub_date": "2026-02-27 03:09:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Polymarket user wins $400K on ZachXBT probe amidst scrutiny of prediction platforms by US regulators.Character count: 112",
            "id": "bbe66b12-21d0-4cdd-9589-9c4577e4a5c6",
            "description": "Numerous Polymarket users emerged as winners in bets placed on speculation concerning insider trading exposed by an online investigator as US policymakers investigate prediction markets platforms.",
            "link": "https://www.markets.news/headlines/bbe66b12-21d0-4cdd-9589-9c4577e4a5c6",
            "pub_date": "2026-02-27 03:09:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump brothers' American Bitcoin mining company, co-founded by Eric and Donald Trump Jr., records $59 million loss in Q4 2025 due to crypto price drop.",
            "id": "f55d4750-98ca-4c10-9a1d-b11f7fdc711d",
            "description": "During the fourth quarter of 2025, American Bitcoin reported a net loss of $59.45 million due to a decline in cryptocurrency prices. The company was co-founded by Eric Trump and Donald Trump Jr.",
            "link": "https://www.markets.news/headlines/f55d4750-98ca-4c10-9a1d-b11f7fdc711d",
            "pub_date": "2026-02-27 03:09:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Omnilogy will be at PowerUp 2026, the largest IBM i event, with a presentation on AI for IBM i. Booth #604, April 28th at 3:15 PM.",
            "id": "04371462-b29e-416a-9771-7a133a14df47",
            "description": "Omnilogy, an international tech developer specializing in the IBM i environment, is set to participate in PowerUp 2026, supported by Common.org. At the event, the Omnilogy team will be stationed at booth #604, offering insights during their presentation titled “AI-Driven Observability for IBM i: From Alerts to Predictive Insights” scheduled for 3:15 PM on Tuesday, April 28th. \"Presenting at the esteemed PowerUp event is a great privilege for IT Architect Maciej Wielgus and me,\" stated i-Rays General M. Attendees can engage with the team at their booth and gain valuable knowledge during the presentation.",
            "link": "https://www.markets.news/headlines/04371462-b29e-416a-9771-7a133a14df47",
            "pub_date": "2026-02-27 03:10:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Salesforce's Agentforce expected to drive positive estimate revisions, analyst maintains Buy rating with $281 price target. Stock trending up.",
            "id": "ece94283-7372-47d8-ba45-4abf36cad127",
            "description": "Salesforce Inc's platform, Agentforce, is expected to play a crucial role in boosting positive estimate revisions and rebutting negative outlooks, as per Goldman Sachs analysis. Salesforce stock is climbing, with an increase in value noted. Analyst Gabriela Borges has maintained a Buy rating on the stock but has decreased the price target from $330 to $281. In her assessment, Borges mentioned that the company's revenue, subscription revenue, and EBIT margin aligned with the expectations of Wall Street. For further details and additional analyst insights on Salesforce, please refer to the comprehensive article accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/ece94283-7372-47d8-ba45-4abf36cad127",
            "pub_date": "2026-02-27 03:02:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}