{
    "data": [
        {
            "title": "Neuberger Next Generation Connectivity Fund (NYSE: NBXG) declares $0.12/share distribution, payable on Mar 31, 2026.",
            "id": "dde7b805-6a09-42ef-870c-e3d1ced994e2",
            "description": "On February 27, 2026, Neuberger Next Generation Connectivity Fund Inc. (NYSE: NBXG) disclosed a distribution declaration of $0.12 per common stock share. This distribution will be paid on March 31, 2026, with a record date of March 16.",
            "link": "https://www.markets.news/headlines/dde7b805-6a09-42ef-870c-e3d1ced994e2",
            "pub_date": "2026-02-28 05:31:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Women entrepreneurs celebrated 3rd Anniversary of NYTS HERstory Unveiled in Times Square on International Women's Day.",
            "id": "becfbd8c-8a86-407e-8548-11ab4d36ceae",
            "description": "Entrepreneur Sharon Ringier commemorates the 3rd Anniversary of the NYTS HERstory Unveiled Billboard Experience in Times Square on International Women's Day. The event highlights women entrepreneurs and their leadership, providing a platform for visibility.",
            "link": "https://www.markets.news/headlines/becfbd8c-8a86-407e-8548-11ab4d36ceae",
            "pub_date": "2026-02-28 05:31:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuberger High Yield Strategies Fund (NYSE: NHS) declares $0.0905 per share distribution, payable on March 31, 2026.",
            "id": "f6015060-18d1-4506-a9a3-2b4e4182c790",
            "description": "On February 27, 2026, Neuberger High Yield Strategies Fund Inc. disclosed a distribution declaration of $0.0905 per common stock share (NYSE American: NHS). The payment is set for March 31, 2026, with a record date of March 16...",
            "link": "https://www.markets.news/headlines/f6015060-18d1-4506-a9a3-2b4e4182c790",
            "pub_date": "2026-02-28 05:31:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "In 2026, FDA waives fees for Innocan Pharma Corp for the third time. Company focused on pharmaceuticals.",
            "id": "ad189168-29c0-4ce3-b838-e6a9cc2dd054",
            "description": "Innocan Pharma Corporation, a leading company in the pharmaceutical and biotechnology sectors, recently disclosed exciting news. On February 27, 2026, they revealed that the FDA's Center for Veterinary has granted them a special authorization. Based in Herzliya, Israel, and Calgary, AB, Innocan operates under the ticker symbols CSE: INNO, FSE: IP40, and OTCQB: INNPD. This recognition marks a significant milestone for the innovative company, demonstrating its commitment to excellence and advancement in the field.",
            "link": "https://www.markets.news/headlines/ad189168-29c0-4ce3-b838-e6a9cc2dd054",
            "pub_date": "2026-02-28 05:31:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuberger Real Estate Securities Income Fund declares $0.0312/share distribution payable on March 31, 2026.",
            "id": "669dcb7d-ec04-4c7d-9fb3-843be8cab59e",
            "description": "On February 27, 2026, Neuberger Real Estate Securities Income Fund Inc. revealed that they declared a distribution of $0.0312 for each share of common stock. This distribution will be paid on March 31, 2026, with a record date that is yet to be announced.",
            "link": "https://www.markets.news/headlines/669dcb7d-ec04-4c7d-9fb3-843be8cab59e",
            "pub_date": "2026-02-28 05:31:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elong Power Holding Limited closes US$7.0 million public offering for battery tech for energy vehicles and storage systems.",
            "id": "98f04e32-d9c7-432b-9ca2-a186b9490334",
            "description": "In Beijing on February 27, 2026, Elong Power Holding Limited (NASDAQ: ELPW), a company specializing in high-power battery technologies for commercial and specialty alternative energy vehicles and energy storage systems, revealed the completion of its latest transaction.",
            "link": "https://www.markets.news/headlines/98f04e32-d9c7-432b-9ca2-a186b9490334",
            "pub_date": "2026-02-28 05:31:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SOLAI Limited (NYSE: SLAI) receives continued listing notice from NYSE on Jan 29, 2026, announces changes in the board of directors.",
            "id": "f8149bff-99aa-41d1-af64-ee8f9d409958",
            "description": "In Akron, Ohio on February 27, 2026, SOLAI Limited (NYSE: SLAI) formerly known as \"BTCM,\" a prominent technology-focused cryptocurrency infrastructure firm, revealed that on January 29, 2026, they were informed by the New York Stock Exchange.",
            "link": "https://www.markets.news/headlines/f8149bff-99aa-41d1-af64-ee8f9d409958",
            "pub_date": "2026-02-28 05:31:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quaker Houghton (NYSE: KWR) declares a $0.508 quarterly dividend, payable on April 30, 2026 to shareholders of record on April 16.",
            "id": "7aab12d6-8e9c-48d5-aade-cb4f7eccb4c8",
            "description": "On February 27, 2026, in Conshohocken, Pennsylvania, Quaker Houghton's Board of Directors announced a quarterly cash dividend of $0.508 per share. This dividend will be paid on April 30, 2026, to shareholders who are recorded as such by the end of business on April 16, 2026. Quaker Houghton, traded on the NYSE under the symbol KWR, is a reputable company known for...",
            "link": "https://www.markets.news/headlines/7aab12d6-8e9c-48d5-aade-cb4f7eccb4c8",
            "pub_date": "2026-02-28 05:31:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FMC Corp appoints Michael F. Barry to Board of Directors on Feb 27, 2026. He will serve on Audit and Compensation & Human.",
            "id": "5cbc27e5-3ad7-4307-856f-e65b6c349d42",
            "description": "In Philadelphia on February 27, 2026, FMC Corporation, a prominent global agricultural sciences enterprise, revealed the appointment of Michael F. Barry to its Board of Directors. This appointment, effective immediately, positions Barry to contribute to various aspects of the company, including serving on the Audit and Compensation and Human Relations committees. Barry’s addition to the board highlights FMC Corporation’s commitment to expanding its leadership team with notable expertise.",
            "link": "https://www.markets.news/headlines/5cbc27e5-3ad7-4307-856f-e65b6c349d42",
            "pub_date": "2026-02-28 05:31:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alimentation Couche-Tard to report Q3 FY2026 results on March 17, 2026. TSX: ATD. Conference call scheduled after release.",
            "id": "94153268-3a2d-47a4-85ea-1d6447c30afa",
            "description": "In Laval, Quebec, on February 27, 2026, Alimentation Couche-Tard Inc. will announce its financial results for the third quarter of fiscal year 2026 on March 17, 2026, following the closure of the TSX. The Corporation (TSX: ATD) will hold a conference call to analyze these results, offering stakeholders an opportunity to delve into the figures.",
            "link": "https://www.markets.news/headlines/94153268-3a2d-47a4-85ea-1d6447c30afa",
            "pub_date": "2026-02-28 05:31:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Great Elm Capital Corp (GECC) to release Q4 and full year 2025 earnings with conference call.",
            "id": "4667e317-72c0-402c-8949-6a0da78e9e1a",
            "description": "GECC has announced their plans to release their earnings report for the fourth quarter and full year of 2025. The company will be hosting a conference call alongside the release.",
            "link": "https://www.markets.news/headlines/4667e317-72c0-402c-8949-6a0da78e9e1a",
            "pub_date": "2026-02-28 05:25:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aberdeen Investments U.S. Closed-End Funds (NYSE: ASGI, THQ) announced distributions on Feb. 27, 2026.",
            "id": "2fdf2b40-1f78-4647-9e0f-a55fbc507e1b",
            "description": "On February 27, 2026, the Aberdeen Investments U.S. Closed-End Funds (NYSE: ASGI, THQ) disclosed the distributions made to investors. The Funds paid these distributions per share, with specific amounts outlined in a provided table.",
            "link": "https://www.markets.news/headlines/2fdf2b40-1f78-4647-9e0f-a55fbc507e1b",
            "pub_date": "2026-02-28 05:18:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FCS Foundation raises awareness for Familial Chylomicronemia Syndrome on Rare Disease Day, helping millions affected globally.",
            "id": "12f0a523-6ad5-4040-8e47-4c4a05ae6213",
            "description": "On February 27, 2026, in Boulder, Colorado, the FCS Foundation utilized Rare Disease Day, an annual global observance on the last day of February, to bring attention to the millions impacted by rare diseases. This is an opportunity to raise awareness about Familial Chylomicronemia Syndrome (FCS). This day is crucial for shedding light on rare conditions and the individuals affected by them worldwide.",
            "link": "https://www.markets.news/headlines/12f0a523-6ad5-4040-8e47-4c4a05ae6213",
            "pub_date": "2026-02-28 05:18:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "University of Phoenix College of Doctoral Studies released a white paper on autonomy-driven leadership reducing burnout.",
            "id": "5b9f6cc5-c9ee-4afc-a276-eac1e7a17310",
            "description": "A recent study conducted by Dr. Julie Overbey and Dr. Pamela Gordon has delved into the impact of autonomy-focused leadership approaches on mitigating workplace burnout and enhancing organizational effectiveness. The research, unveiled on Feb. 27, 2026, in Phoenix, suggests that autonomous leadership models can play a significant role in reducing burnout levels among employees, thereby bolstering overall performance within the organization. The study, released by the University of Phoenix College of Doctoral Studies, emphasizes the importance of autonomy in leadership and its potential to transform workplace dynamics. This research could provide valuable insights for organizations looking to improve employee well-being and productivity.",
            "link": "https://www.markets.news/headlines/5b9f6cc5-c9ee-4afc-a276-eac1e7a17310",
            "pub_date": "2026-02-28 05:18:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "da828b42-09bb-450f-870c-08fa6566f0aa",
            "description": "US bank deposits rose to $18.778 trln from $18.764 trln in prior week",
            "link": "https://www.markets.news/headlines/da828b42-09bb-450f-870c-08fa6566f0aa",
            "pub_date": "2026-02-28 05:18:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Keysight and MediaTek develop AI-driven uplink optimization for RANs, to be showcased at Mobile World Congress 2026.",
            "id": "70918bd7-ce8a-4ae8-ae33-c4957d30354b",
            "description": "In Santa Rosa, California, Keysight Technologies, Inc. (NYSE: KEYS) and MediaTek have unveiled a cutting-edge prototype at Mobile World Congress 2026. The prototype showcases advancements in AI-powered uplink optimization and model life cycle management for future radio access networks. This innovative technology, utilizing AI-enabled RAN-assisted intelligence, demonstrates real-time enhancements in uplink performance and ensures long-term effectiveness through practical model retraining and over-the-air (OTA) capabilities. This collaboration aims to revolutionize network capabilities, with the demonstration highlighting the potential benefits of integrating AI in next-generation RAN systems.",
            "link": "https://www.markets.news/headlines/70918bd7-ce8a-4ae8-ae33-c4957d30354b",
            "pub_date": "2026-02-28 05:18:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MAX Power starts drilling at new site to test natural hydrogen model; also advancing their platform, with a focus on system repeatability and scale. 325 km from initial concept.",
            "id": "e514c181-fa4d-4d77-9598-d7ffff4ab2dc",
            "description": "A new play concept located 325 kilometers from Lawson has been developed to showcase system reliability and scope, while also expediting the advancement of the MAXX LEMI predictive platform. The project aims to highlight the scalability of the system and drive innovation in the field.",
            "link": "https://www.markets.news/headlines/e514c181-fa4d-4d77-9598-d7ffff4ab2dc",
            "pub_date": "2026-02-28 05:19:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AvalonBay Communities, Inc. to participate in 2026 Citi Global Property CEO Conference on March 2 at 11:40am. CEO and team to discuss business update.",
            "id": "60784e7d-a484-4903-adf2-ae952a5d3719",
            "description": "A real estate company, AVALONBAY COMMUNITIES, INC. (NYSE: AVB), revealed that its CEO and President, Benjamin W. Schall, along with several management members, will take part in a roundtable talk at the 2026 Citi Global Property CEO Conference on March 2, 2026, at 11:40 AM ET. Topics for discussion may include the organization's operational status, trends, and strategies regarding development, redevelopment, sale, and acquisition.",
            "link": "https://www.markets.news/headlines/60784e7d-a484-4903-adf2-ae952a5d3719",
            "pub_date": "2026-02-28 05:20:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Acadia Realty Trust sets 2026 Annual Shareholder Meeting on May 13, 1:00 PM EST, to be held virtually. Visit website to attend and vote.",
            "id": "c9cad294-4b75-40f3-9ddf-87ef2c205842",
            "description": "In Rye, New York, Acadia Realty Trust (NYSE: AKR) disclosed the schedule for its 2026 Annual Shareholder Meeting. The meeting is slated for Wednesday, May 13, 2026, at 1:00 PM Eastern Time. It will be held virtually to enable shareholders to participate, vote, and ask questions through a live webcast accessible at www.virtualshareholdermeeting.com/AKR26. Prior to the meeting, shareholders will have the opportunity to cast their votes.",
            "link": "https://www.markets.news/headlines/c9cad294-4b75-40f3-9ddf-87ef2c205842",
            "pub_date": "2026-02-28 05:20:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Camden Property Trust joins Citi’s 2026 Global Property CEO Conference on March 3 at 1:30 PM, webcast live on camdenliving.com.",
            "id": "781e8d42-f5d2-42b9-8178-9143ac68300b",
            "description": "Houston-based real estate company Camden Property Trust, listed on NYSE as CPT, will be taking part in Citi’s 2026 Global Property CEO Conference. The company's roundtable discussion is set for March 3, 2026, at 1:30 PM ET. The event will be live webcast on camdenliving.com under the Investors section in a listen-only format. An audio recording will also be accessible on the company's website post-event. For further details, visit the Company's site.",
            "link": "https://www.markets.news/headlines/781e8d42-f5d2-42b9-8178-9143ac68300b",
            "pub_date": "2026-02-28 05:20:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}