{
    "data": [
        {
            "title": "",
            "id": "855ab3b1-b1cb-4cd1-8d79-21c6f4f02b9a",
            "description": "U.S. CRUDE OIL FUTURES SETTLE AT $67.02/BBL, UP $1.81, 2.78 PCT",
            "link": "https://www.markets.news/headlines/855ab3b1-b1cb-4cd1-8d79-21c6f4f02b9a",
            "pub_date": "2026-02-28 03:33:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zilliz Cloud BYOC now available on Microsoft Azure, expanding availability to major cloud platforms.",
            "id": "64609746-bacd-47e8-910b-54aecb513ffc",
            "description": "Zilliz, the tech company based in Redwood City, California, unveiled the availability of Zilliz Cloud BYOC on Microsoft Azure on February 27, 2026. The company is known for developing Milvus, the leading open-source vector database. Zilliz Cloud BYOC marks a significant milestone for Zilliz as it expands its services to one of the major cloud platforms in the industry. This move is anticipated to provide users with enhanced flexibility and scalability options. Zilliz Cloud BYOC allows users to bring their own cloud resources to leverage the services offered by Zilliz. The launch on Microsoft Azure opens up new opportunities for customers to utilize the capabilities of Zilliz Cloud BYOC. This announcement comes amidst a growing demand for cloud-based solutions, with Zilliz positioning itself as a key player in this space.",
            "link": "https://www.markets.news/headlines/64609746-bacd-47e8-910b-54aecb513ffc",
            "pub_date": "2026-02-28 03:33:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CobbleStone Software wins RepVue Reppy Award as top sales organization in Philadelphia. Feb 27, 2026.",
            "id": "862fe9cc-9b6e-442f-ad8b-925ec2b1925f",
            "description": "CobbleStone Software has recently been honored with a prestigious Reppy Award by RepVue for its exceptional performance as a leading sales organization in the Philadelphia region. The award was received on February 27, 2026, in Princeton, N.J. CobbleStone Software is well-known for its expertise in contract lifecycle management (CLM) and contract artificial intelligence.",
            "link": "https://www.markets.news/headlines/862fe9cc-9b6e-442f-ad8b-925ec2b1925f",
            "pub_date": "2026-02-28 03:33:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "360training acquires Canadian Food Safety Group, including SafeCheck Learning and SafeCheck Safety, expanding leadership in Canadian food safety.",
            "id": "c44d3735-2443-43ba-842e-d390b62b6060",
            "description": "In Austin, Texas on February 27, 2026, 360training.com, Inc., a prominent provider of online training and compliance solutions, revealed the purchase of specific assets from Canadian Food Safety Group. This acquisition encompassed SafeCheck® Learning and SafeCheck Safety®.",
            "link": "https://www.markets.news/headlines/c44d3735-2443-43ba-842e-d390b62b6060",
            "pub_date": "2026-02-28 03:33:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "f57ad915-1209-477f-b25b-e1fa3c31bdd5",
            "description": "NYMEX WTI crude April futures settle at $67.02 a barrel up $1.81, 2.78% NYMEX Nat Gas April futures settle at $2.8590/MMBTU NYMEX Gasoline March futures settle at $2.0779 a gallon NYMEX Diesel March futures settle at $2.6709 a gallon",
            "link": "https://www.markets.news/headlines/f57ad915-1209-477f-b25b-e1fa3c31bdd5",
            "pub_date": "2026-02-28 03:33:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin's rise to $69K halted, now at $65K as CoreWeave, BitMine stocks plunge in market decline; Gold gains.",
            "id": "a2dc9115-93b7-4513-9e9d-cf6d90ba7d05",
            "description": "The price of Bitcoin experienced a decline on Friday, dropping from its recent peak of over $69,000. Concurrently, shares of companies such as CoreWeave and BitMine also saw declines in value amidst a wider downturn in the market.",
            "link": "https://www.markets.news/headlines/a2dc9115-93b7-4513-9e9d-cf6d90ba7d05",
            "pub_date": "2026-02-28 03:35:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Beard Papa's to offer exclusive hololive English -Justice- tote bag with purchase of 12 collaboration cream puffs starting March 1.",
            "id": "506da0dd-eec6-4890-901c-ec27cb85805f",
            "description": "A special offer has been announced in Cerritos, California, starting from February 27, 2026. Customers can now receive a limited-edition tote bag with the purchase of 12 hololive Collaboration Cream Puffs from Beard Papa's. This offer is part of their popular hololive English -Justice- collaboration. This promotion is attracting attention as fans eagerly collect the exclusive items.",
            "link": "https://www.markets.news/headlines/506da0dd-eec6-4890-901c-ec27cb85805f",
            "pub_date": "2026-02-28 03:37:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novavax stock down Friday after reporting Q4 profit of 11 cents and $147 million revenue, short of expected $381.22 million. Short interest at 31.41% of float.",
            "id": "45311eb5-47c9-4b88-b747-0751fa94a8a5",
            "description": "Novavax Inc. (NASDAQ: NVAX) experienced a decline in its shares on Friday, potentially due to profit-taking after a jump in stock value on Thursday following the release of the company's fourth-quarter and full-year 2025 financial results. Notably, Novavax has a short interest of 31.41% of its float. In Q4, Novavax saw an earnings shift to a profit of 11 cents from a loss of 51 cents a year ago, with revenue reaching $147 million, marking a 67% increase year-over-year. However, the company's adjusted total revenue projection for 2026 lies between $230 million and $270 million, below the consensus estimate of $381.22 million. Moreover, Novavax anticipates Non-GAAP R&D and SG&A expenses of $325 million.",
            "link": "https://www.markets.news/headlines/45311eb5-47c9-4b88-b747-0751fa94a8a5",
            "pub_date": "2026-02-28 03:26:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tevogen considers acquiring a Contract Research Organization to boost clinical development capabilities and revenue growth.",
            "id": "d14577d4-e2bc-44ab-bd2b-7acfb0a8f088",
            "description": "In Warren, New Jersey on February 27, 2026, Tevogen Bio Holdings Inc. (Nasdaq: TVGN) disclosed its agreement to assess a potential transaction with a renowned global Contract Research Organization (CRO) through a signed non-exclusive, non-binding Letter of Intent (LoI). This move has the potential to broaden Tevogen's clinical development capacities, potentially transitioning the Company into a revenue-generating healthcare entity.",
            "link": "https://www.markets.news/headlines/d14577d4-e2bc-44ab-bd2b-7acfb0a8f088",
            "pub_date": "2026-02-28 03:21:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0ddb43c4-e505-47c3-a873-38e1333fb4df",
            "description": "PARAMOUNT LOOKS FORWARD TO CONSTRUCTIVE ENGAGEMENT WITH U.S. STATE ATTORNEYS GENERAL AND OTHER REGULATORS, SPOKESPERSON SAYS",
            "link": "https://www.markets.news/headlines/0ddb43c4-e505-47c3-a873-38e1333fb4df",
            "pub_date": "2026-02-28 03:23:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cc314050-6f19-412d-9d3a-adb44b173a28",
            "description": "GPA IN TALKS FOR BRL900M DEBT ROLLOVER WITH HOLDERS: VALOR",
            "link": "https://www.markets.news/headlines/cc314050-6f19-412d-9d3a-adb44b173a28",
            "pub_date": "2026-02-28 03:23:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d129d7ba-4624-4161-82a0-0bdd8b874671",
            "description": "GOP LAWMAKERS TELL TRUMP ADMIN. TO REJECT UK'S CHAGOS DEAL: WSJ",
            "link": "https://www.markets.news/headlines/d129d7ba-4624-4161-82a0-0bdd8b874671",
            "pub_date": "2026-02-28 03:25:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sportstech denies responsibility for TRNR reverse split, operations stable, unaffected. ",
            "id": "08a89db8-8143-4e0a-b26c-7dd8215df5ab",
            "description": "Sportstech has stated that it is not accountable for TRNR's reverse split and assures that its operations continue to be steady and unharmed.",
            "link": "https://www.markets.news/headlines/08a89db8-8143-4e0a-b26c-7dd8215df5ab",
            "pub_date": "2026-02-28 03:16:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tech and Bitcoin surge as markets rally ahead of Nvidia earnings. Nasdaq up 1.2% to 25,280, S&P 500 rises 0.7%, Dow up 0.6%. Software stocks top performer with Salesforce set to report. CAVA Group up 25.05%, Everus Construction up 31.58%. Technology and Financials lead gains. Energy and Consumer Staples lag. (Total characters: 300)",
            "id": "24340819-70dd-449e-bf6b-48333a519adf",
            "description": "Investor confidence rebounded on Wednesday as they flocked to stocks and cryptocurrencies ahead of Nvidia Corp.'s highly awaited earnings report after market close. The Nasdaq 100 surged by 1.2% to 25,280 points, driven by gains in large-cap tech and AI-related companies. The S&P 500 also saw a 0.7% increase, reaching 6,941.26, trading slightly below its all-time highs. The Dow Jones Industrial Average experienced a 0.6% rise, while small-cap stocks, represented by the Russell 2000, saw a more modest 0.2% gain. Software companies continued their recovery for a second consecutive day, emerging as the top-performing sector. Salesforce Inc., which has faced around a 25% decline year-to-date, was also scheduled to report its earnings post-market. As of 12:45 p.m. in New York, the market momentum predominantly favored growth stocks, with Technology and Financials leading the gains, while Energy and Consumer Staples lagged. Notable earnings performers included CAVA Group, Inc. leaping by 25.05%, and Everus Construction Group, Inc. advancing by 31.58%. Conversely, GoDaddy Inc. experienced a decline. For more details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/24340819-70dd-449e-bf6b-48333a519adf",
            "pub_date": "2026-02-28 03:16:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oligo Security integrates AI Security with AWS Security Hub Extended Plan for real-time AI protection on AWS.",
            "id": "8879aaa8-6605-4a53-88f0-4559fdda8845",
            "description": "Based in Tel Aviv, Israel, Oligo Security, a company specializing in runtime security solutions, recently revealed the integration of Oligo Runtime AI Security with the Extended plan in AWS Security Hub by Amazon Web Services. This partnership offers clients immediate visibility and active defense mechanisms for AI implementations on AWS. It presents a seamless experience under one vendor, simplifying processes with a unified contract, billing, support, and adaptable pricing through AWS. The integration aims to enhance security measures for AI deployments across AWS with real-time monitoring and protection.",
            "link": "https://www.markets.news/headlines/8879aaa8-6605-4a53-88f0-4559fdda8845",
            "pub_date": "2026-02-28 03:16:28",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Precision Drilling Corporation now dual-listed on NYSE Texas, expanding reach for common shares, effective February 27.",
            "id": "0d92a774-4d2e-45e7-b83f-86e265e08bc0",
            "description": "Precision Drilling Corporation, based in Calgary, Alberta, disclosed on February 27, 2026, that its common shares (TSX: PD; NYSE: PDS) have received authorization for dual listing on NYSE Texas. NYSE Texas is a digital equities exchange located in Dallas, Texas, established in March 2025.",
            "link": "https://www.markets.news/headlines/0d92a774-4d2e-45e7-b83f-86e265e08bc0",
            "pub_date": "2026-02-28 03:16:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "95e22d73-f29a-4ce7-8030-79b11fc7bbad",
            "description": "TRUMP: CUBA IS IN BIG TROUBLE",
            "link": "https://www.markets.news/headlines/95e22d73-f29a-4ce7-8030-79b11fc7bbad",
            "pub_date": "2026-02-28 03:17:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paley Museum partners with NYC Department of Social Services to offer free access to 1.4M New Yorkers.",
            "id": "c723246d-1ae0-4f34-be7d-34b5f950a011",
            "description": "The Paley Museum in partnership with the New York City Department of Social Services has launched a significant initiative offering free access to 1.4 million residents of New York City. This collaboration aims to provide the opportunity for individuals to explore the iconic museum which showcases a blend of media, sports, gaming, and entertainment. The announcement was made in New York on Feb. 27, 2026.",
            "link": "https://www.markets.news/headlines/c723246d-1ae0-4f34-be7d-34b5f950a011",
            "pub_date": "2026-02-28 03:17:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "e3429d2e-bfaa-4f0c-9cb0-279f08ca3858",
            "description": "US 2-YEAR YIELD FALLS BELOW 3.38% TO LOWEST SINCE OCT. 17",
            "link": "https://www.markets.news/headlines/e3429d2e-bfaa-4f0c-9cb0-279f08ca3858",
            "pub_date": "2026-02-28 03:18:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "32f78135-7067-4608-b294-67914784ecd3",
            "description": "2025's second half and full-year report show promising growth with revenue up by 15% to $500 million.",
            "link": "https://www.markets.news/headlines/32f78135-7067-4608-b294-67914784ecd3",
            "pub_date": "2026-02-28 03:15:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}