{
    "data": [
        {
            "title": "",
            "id": "6e469967-e28d-465c-941b-a3df1e844566",
            "description": "UK 20-YEAR GILT YIELDS FALL 4 BPS ON THE DAY TO 4.964%, LOWEST SINCE APRIL 2025",
            "link": "https://www.markets.news/headlines/6e469967-e28d-465c-941b-a3df1e844566",
            "pub_date": "2026-02-26 22:42:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "a0c9f9f5-93b0-4669-9521-de13f0be8881",
            "description": "GULF PETROSTATES RUSH TO EXPORT CRUDE AMID FEARS OF US STRIKE ON IRAN - FT",
            "link": "https://www.markets.news/headlines/a0c9f9f5-93b0-4669-9521-de13f0be8881",
            "pub_date": "2026-02-26 22:42:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Registration now open for 4th annual QSR Evolution Conference by WTWH Media, held on Sep 8-10, 2026 at Hyatt Regency Atlanta.",
            "id": "aa732b21-31e8-4847-a65b-23f8c0bb8647",
            "description": "Cleveland, 26th February 2026 - Registration is currently available for the QSR Evolution Conference's fourth edition. Scheduled for September 8-10, 2026, at the Hyatt Regency Atlanta, the event invites participants to a welcome reception before the main activities commence.",
            "link": "https://www.markets.news/headlines/aa732b21-31e8-4847-a65b-23f8c0bb8647",
            "pub_date": "2026-02-26 22:43:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investors of Kyndryl Holdings, Inc. (NYSE: KD) alerted of an April 13, 2026 deadline due to class action lawsuit.",
            "id": "b2a20ac7-bc48-49a3-a467-5d78f197443f",
            "description": "Philadelphia-based law firm Berger Montague PC has reported the filing of a class action lawsuit against Kyndryl Holdings, Inc. (NYSE: KD) on February 26, 2026. The lawsuit represents investors who bought or acquired shares of Kyndryl. The firm has not disclosed the specific details of the allegations. Kyndryl, the defendant in the case, is a publicly traded company on the New York Stock Exchange. The lawsuit, brought forth on behalf of affected investors, is seeking resolution through legal channels. Berger Montague PC, known for representing plaintiffs in significant legal matters, is spearheading the case against Kyndryl.",
            "link": "https://www.markets.news/headlines/b2a20ac7-bc48-49a3-a467-5d78f197443f",
            "pub_date": "2026-02-26 22:43:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "3D visualization boosts sales by 67% and improves in-store satisfaction, according to Provoke Insights study.",
            "id": "bb15f2d3-f457-45e0-a031-4432ae54ba71",
            "description": "A study conducted in 2026 by Provoke Insights revealed that shoppers who utilize 3D tools in-store, alongside assistance from a salesperson, exhibit a 67% increased likelihood of making high-ticket purchases. These individuals also reported considerably higher levels of satisfaction with their in-store experience. The research, released by 3D Cloud on February 26, 2026, in St. Petersburg, Florida, highlights the impact of incorporating advanced technology like 3D tools in retail settings.",
            "link": "https://www.markets.news/headlines/bb15f2d3-f457-45e0-a031-4432ae54ba71",
            "pub_date": "2026-02-26 22:43:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Auguste Escoffier Global Solutions partners with LDEI International to expand access to culinary & hospitality training.Chars: 100",
            "id": "f76cc6de-5781-4fc3-a642-1a8444fc4fab",
            "description": "In Schaumburg, Illinois, on February 26, 2026, Auguste Escoffier Global Solutions (AEGS), a prominent company offering culinary and hospitality workforce training, unveiled a fresh endeavor in partnership with Les Dames d'Escoffier International (LDEI). This initiative will bring together their expertise to create impactful solutions within the industry.",
            "link": "https://www.markets.news/headlines/f76cc6de-5781-4fc3-a642-1a8444fc4fab",
            "pub_date": "2026-02-26 22:43:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vista Gold Corp. prices public offering at US$2.50/share, raising US$39.0 million with 15,600,000 common shares.",
            "id": "2855c73d-bb63-495a-bc05-e9680d7b27d6",
            "description": "In Denver on February 26, 2026, Vista Gold Corp. (NYSE American and TSX: VGZ) disclosed the pricing details for its underwritten public offering of 15,600,000 common shares. Each share was priced at US$2.50, marking the total proceeds from the offering to be US$39 million. Vista Gold Corp. expressed satisfaction with the pricing and the response to the offering.",
            "link": "https://www.markets.news/headlines/2855c73d-bb63-495a-bc05-e9680d7b27d6",
            "pub_date": "2026-02-26 22:44:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Potential crisis if China takes over Taiwan, shuts down chip exports to US. Tech industry and economy at risk.",
            "id": "029fb828-bbc9-4ffc-9466-b71b0f76f3c1",
            "description": "If Taiwan is invaded by China and its chip exports to American companies are halted, it could severely impact the tech industry and the U.S. economy. The loss of these chip exports, which account for a significant portion of the technology sector, could lead to a substantial economic slowdown in the U.S. Increased tensions surrounding this issue have sparked concerns about the potential ramifications for global trade and economic stability. It is estimated that over $50 billion worth of chips are exported from Taiwan to the United States annually, highlighting the significant economic consequences of such a disruption.",
            "link": "https://www.markets.news/headlines/029fb828-bbc9-4ffc-9466-b71b0f76f3c1",
            "pub_date": "2026-02-26 22:40:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures fluctuated after Monday's sell-off. Trump's tariff threat impacted market sentiment. Futures of major benchmark indices were mixed. Whirlpool plunged 7.46% in premarket with $800 million offerings.alsy, Nasdaq 100 up 0.29% .",
            "id": "4c2acafd-755e-4b54-94d6-13e46b511ae8",
            "description": "U.S. stock futures fluctuated on Tuesday following a sell-off, partly due to fears raised by a report on a potential \"Global Intelligence Crisis\" sparking concerns of a deflationary depression caused by an AI revolution. Geopolitical tensions, including President Trump's proposal to increase global tariffs to 15% and friction with Iran, added to market uncertainty. The 10-year Treasury bond yielded 4.03%, with a 3.45% yield on the two-year bond. The CME Group's FedWatch tool projected a 95.9% likelihood of the Federal Reserve keeping interest rates unchanged in March. Index Performance showed small gains for major benchmarks. ETFs like SPDR S&P 500 (SPY) and Invesco QQQ Trust (QQQ) were mixed in premarket trading. Whirlpool Corp. (WHR) saw a 7.46% premarket plunge after announcing plans for public offerings to raise $800 million. WHR had weak price trends and a moderate quality ranking.",
            "link": "https://www.markets.news/headlines/4c2acafd-755e-4b54-94d6-13e46b511ae8",
            "pub_date": "2026-02-26 22:40:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OTC Markets Group welcomes Dryden Gold Corp. to OTCQX, a junior gold exploration company that upgraded from OTCQB.",
            "id": "4fe8a3b4-ca71-43aa-98d6-324100780f7c",
            "description": "On February 24, 2026, OTC Markets Group Inc. revealed that Dryden Gold Corp., a junior gold exploration company, has met the requirements to be listed on the OTCQX® Best Market. OTC Markets Group Inc. operates regulated trading platforms for 12,000 U.S. and international securities. Dryden Gold Corp. was previously listed on the OTCQB® Venture Market and now trades under the tickers TSX-V: DRY, FSE: X7W, and OTCQX: DRYGF. This advancement signifies the company's move up from the OTCQB® Venture Market to the OTCQX® Best Market for enhanced visibility and trading opportunities.",
            "link": "https://www.markets.news/headlines/4fe8a3b4-ca71-43aa-98d6-324100780f7c",
            "pub_date": "2026-02-26 22:40:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CyberBay 2026 Summit in Tampa, FL, to focus on closing cyber risk-to-business risk gap for senior cybersecurity leaders through CCLS program.",
            "id": "5c79e126-8bcd-413c-929f-eed48d75d55a",
            "description": "In Tampa, Florida, the importance of senior cybersecurity leaders effectively communicating risks, investments, and priorities to executives is emphasized. Despite this integral role, many security leaders find it challenging to articulate cyber risks in a manner that resonates with the C-suite, leading to difficulties in securing funding. The 2026 CyberBay Summit will showcase the Certified Cybersecurity Leadership Strategist (CCLS) program as a solution to bridge this communication gap. This three-day in-person event will focus on empowering leaders to translate cyber risks into tangible business risks that the C-suite can comprehend, prioritize, and support financially.",
            "link": "https://www.markets.news/headlines/5c79e126-8bcd-413c-929f-eed48d75d55a",
            "pub_date": "2026-02-26 22:40:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New play 'Mother Russia' by Lauren Yee is witty and clever. Features a talented cast- part of a series on the impacts of communism and capitalism in the 20th century.",
            "id": "c58f9afd-248c-4419-8f94-f99b312edb2b",
            "description": "A talented ensemble takes the lead in Lauren Yee's latest play, which is part of a series exploring the intersections of 20th-century communism, capitalism, and pop culture.",
            "link": "https://www.markets.news/headlines/c58f9afd-248c-4419-8f94-f99b312edb2b",
            "pub_date": "2026-02-26 22:40:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock market plunges as Dow Jones falls; EU initiates Trump tariff move. IBM drops due to AI threat; Novo stock also declines. Gold stocks perform well.",
            "id": "7ded3561-a9e5-49d3-9ec3-9bfb798b4b74",
            "description": "Today, stock market indexes, including the Dow Jones industrials, experienced a significant decline. The European Union took action regarding tariffs imposed by Trump. Novo's stock value decreased, while gold investments performed well. The market was impacted by the news of the Dow sinking due to the EU's tariff decision related to Trump's policies, and IBM faced challenges due to a threat posed by artificial intelligence.",
            "link": "https://www.markets.news/headlines/7ded3561-a9e5-49d3-9ec3-9bfb798b4b74",
            "pub_date": "2026-02-26 22:40:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vinci in Palo Alto, CA introduces thermo-mechanical simulation for predicting \"warpage\" in hardware designs.",
            "id": "fa212d04-7227-47ca-aeee-ca4c09fd0890",
            "description": "Vinci, based in Palo Alto, California, has recently introduced its latest core physics capability which focuses on thermo-mechanical simulation. This new feature allows for the prediction of potential \"warpage\" in hardware designs. This marks the second core physics capability offered by Vinci, aiming to enhance the overall design process.",
            "link": "https://www.markets.news/headlines/fa212d04-7227-47ca-aeee-ca4c09fd0890",
            "pub_date": "2026-02-26 22:40:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Despite Supreme Court rebuke, Trump persists with trade agenda, claiming success with tariffs, though evidence is lacking.",
            "id": "32c98af2-814f-4a47-8059-d83a764342c3",
            "description": "The president remains committed to tariffs and asserts that his trade plan is thriving, despite scant evidence backing this claim.",
            "link": "https://www.markets.news/headlines/32c98af2-814f-4a47-8059-d83a764342c3",
            "pub_date": "2026-02-26 22:40:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OTC Markets Group welcomes GR Silver Mining Ltd. to OTCQX, trading as GRSLF, from OTCQB; operates regulated markets for 12,000 securities.",
            "id": "0e531860-5785-4847-9246-9d6f9ad5d36d",
            "description": "On February 24, 2026, OTC Markets Group Inc. revealed that GR Silver Mining Ltd., a mineral exploration company based in Canada with a focus on Mexico, has qualified to trade on the OTCQX Best Market under the tickers TSX-V: GRSL and OTCQX: GRSLF. OTC Markets Group operates regulated markets for trading a total of 12,000 U.S. and international securities. The move marks GR Silver Mining Ltd.'s upgrade from the OTCQB Venture Market to the OTCQX Best Market.",
            "link": "https://www.markets.news/headlines/0e531860-5785-4847-9246-9d6f9ad5d36d",
            "pub_date": "2026-02-26 22:40:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cardano's co-founder defends project after 14% rebound in ADA price. Outlines billion-dollar project Midnight on Cardano.",
            "id": "37c07340-c4dc-4111-b308-87162d731f69",
            "description": "Cardano co-founder Charles Hoskinson has shown support for the project by stating that \"Cardano is still in the game, it's still fighting,\" following a 14% rebound of ADA on Wednesday. Hoskinson highlighted the success of Midnight, a billion-dollar project launched on Cardano with premier exchange listings and key partnerships, including Google. He underscored that this achievement sets Cardano apart from Ethereum and Solana. Emphasizing the ongoing perseverance of Cardano, Hoskinson urged people to recognize the project's resilience. The statement comes as ADA undergoes scrutiny to determine if the previous day's breakout will hold or if it was a false break. For more details, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/37c07340-c4dc-4111-b308-87162d731f69",
            "pub_date": "2026-02-26 22:42:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global talent shortage turning point: ManpowerGroup survey of 39,000 employers across 41 countries reveals 72% struggle to fill roles as demand for AI skills surpasses engineering and traditional IT skills.",
            "id": "e5a85c39-ef07-43de-8323-c22d198e09e7",
            "description": "A survey conducted by ManpowerGroup in 2026 involved 39,000 employers from 41 countries, indicating that 72% of them are facing challenges in filling job positions. This shortage is mainly due to the increasing demand for AI skills, which has surpassed the need for engineering and traditional IT abilities. The survey findings were released in Milwaukee on February 26, 2026.",
            "link": "https://www.markets.news/headlines/e5a85c39-ef07-43de-8323-c22d198e09e7",
            "pub_date": "2026-02-26 22:34:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NeuraLight to present new neuroprotection signal at AD/PD 2026, outperforming current biomarker in Parkinson's disease.",
            "id": "ec247b83-910a-457b-960c-704f508484a1",
            "description": "NeuraLight, a pioneer in precise brain function assessment, is set to unveil groundbreaking findings at the upcoming 2026 International Conference on Alzheimer's and Parkinson's Diseases in Copenhagen, starting on March 17. The company will showcase the initial consistent results of a neuroprogression biomarker that surpasses the current top method in monitoring neurodegenerative advancement in Parkinson's disease. These results have been replicated in various clinical trials and locations globally, indicating substantial progress in the field of neurodegenerative disease research.",
            "link": "https://www.markets.news/headlines/ec247b83-910a-457b-960c-704f508484a1",
            "pub_date": "2026-02-26 22:35:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AECC releases new blueprint for connected vehicle architecture, aims to shape future; provides a vendor-neutral guide for deployment.",
            "id": "f09b1178-56b5-42a4-adf8-da488e6fb35f",
            "description": "In Wakefield, Massachusetts, the Automotive Edge Computing Consortium (AECC) has unveiled a new white paper titled “AECC Industry Blueprint: Shaping the Future of Automotive Innovation.” This release marks a significant milestone for the industry, offering a comprehensive guide for deploying connected vehicle and mobility services at a large scale. The document, which serves as a shared, vendor-neutral reference for the automotive sector and the digital infrastructure ecosystem, covers key areas such as communications, computing, and software. This development comes at a crucial time as the automotive industry accelerates its transition towards software-driven technologies.",
            "link": "https://www.markets.news/headlines/f09b1178-56b5-42a4-adf8-da488e6fb35f",
            "pub_date": "2026-02-26 22:35:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}