{
    "data": [
        {
            "title": "Data Center World 2026 expands program lineup in Washington, D.C., April 20–23, with record-breaking expo floor and new conference experiences.",
            "id": "2881520b-e5e4-4ac4-9c80-ab50a507ffb2",
            "description": "A major event in the data center industry, Data Center World, has revealed its 2026 program lineup which is set to take place from April 20-23 at the Walter E. Washington Convention Center in Washington, D.C. The event will focus on positioning the industry in the midst of the AI era and will boast a larger expo floor than ever before. This edition of the event emphasizes \"Innovation at Scale\" and will showcase new conference experiences and executive forums, aiming to bring together data center experts and thought leaders. With a record-breaking expo floor, the event is expected to draw a significant number of participants and showcase the latest developments in the field.",
            "link": "https://www.markets.news/headlines/2881520b-e5e4-4ac4-9c80-ab50a507ffb2",
            "pub_date": "2026-02-26 21:10:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CRA Intl Q4 earnings: Misses estimates by 0.0% with $2.06 EPS, revenue up $20.53M. Past quarter beat on earnings.",
            "id": "9ad1d240-cfc2-4de5-8e4c-dea34661e7f8",
            "description": "CRA Intl (NASDAQ: CRAI) released its Q4 earnings on February 26, 2026, at 08:05 AM. The report revealed that the company missed estimated earnings by 0.0%, with an EPS of $2.06 compared to the estimated $2.06. Revenue showed a significant increase of $20.53 million from the prior year's same period. In the previous quarter, CRA Intl exceeded expectations. For further details, visit Benzinga.com.",
            "link": "https://www.markets.news/headlines/9ad1d240-cfc2-4de5-8e4c-dea34661e7f8",
            "pub_date": "2026-02-26 21:10:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTT DATA and Ericsson partner to boost enterprise use of private 5G & physical AI. Enables AI-driven transformation.",
            "id": "68c94c73-8fc5-49a3-ad32-0be449c37710",
            "description": "In London, NTT DATA, a prominent player in AI and technology services, along with Ericsson (NASDAQ: ERIC), revealed a long-term strategic collaboration to hasten the implementation of private 5G in businesses and unleash advanced edge AI and physical AI applications. This partnership aims to facilitate the integration of intelligence at the edge on a global scale, fostering transformative outcomes through AI-driven solutions. By merging Ericsson’s Private 5G and Edge platforms with NTT DATA's expertise, the collaboration is poised to revolutionize enterprise operations.",
            "link": "https://www.markets.news/headlines/68c94c73-8fc5-49a3-ad32-0be449c37710",
            "pub_date": "2026-02-26 21:10:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Skillsoft, a global company, recognized as a leader in IT training services by IDC MarketScape in North America and Europe.",
            "id": "06dc703d-6320-41fe-a82a-ccdef7418e2b",
            "description": "Skillsoft, a prominent AI-native skills management platform listed on NYSE as SKIL, has recently been recognized as a Leader in the field of IT Training Services in North America and Europe by IDC MarketScapes. This acknowledgment is significant as businesses are increasingly aiming to leverage their AI investments effectively. As per the IDC MarketScape report on North America Training Services, it is estimated that global economic losses due to skills shortages could potentially reach a significant amount by the end of next year.",
            "link": "https://www.markets.news/headlines/06dc703d-6320-41fe-a82a-ccdef7418e2b",
            "pub_date": "2026-02-26 21:10:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Energy executives in the US are optimistic about 2026 growth, according to Pathward's survey. Sioux Falls, S.D (BUSINESS WIRE)",
            "id": "55662e8c-d20b-41c4-9334-bb629d2ee2b8",
            "description": "A recent survey conducted by Pathward in Sioux Falls, South Dakota reveals that U.S. energy executives are highly optimistic about growth in 2026. The executives showed confidence in the industry's potential for expansion, with a majority expressing positive outlooks for the coming year. This survey provides valuable insights into the sentiments among key decision-makers, indicating a promising future for the energy sector.",
            "link": "https://www.markets.news/headlines/55662e8c-d20b-41c4-9334-bb629d2ee2b8",
            "pub_date": "2026-02-26 21:11:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia's strong earnings fail to boost markets as investor concerns persist amidst AI growth.",
            "id": "b5ea3bc9-2d58-4475-9aeb-e1a392e64b9f",
            "description": "The leading chip company in the artificial intelligence sector surpassed expectations once more. However, concerns from investors persisted despite their positive performance.",
            "link": "https://www.markets.news/headlines/b5ea3bc9-2d58-4475-9aeb-e1a392e64b9f",
            "pub_date": "2026-02-26 21:11:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Polyrizon Ltd. (PLRZ) confirms enhanced nasal deposition profile of its naloxone formulation compared to commercial reference product.",
            "id": "e139d577-0fbc-4972-88aa-a6ddec123249",
            "description": "An Israeli company, Polyrizon Ltd. (Nasdaq: PLRZ), recently released findings from a study comparing the nasal deposition profiles of its naloxone product and a competing commercial item. Polyrizon Ltd. specializes in pre-clinical biotechnology and focuses on intranasally administered solutions. The study examined how well the company's formulation of naloxone targeted specific nasal regions in comparison to the reference product. This study contributes to the ongoing research and development efforts of Polyrizon Ltd. in the field of nasal drug delivery.",
            "link": "https://www.markets.news/headlines/e139d577-0fbc-4972-88aa-a6ddec123249",
            "pub_date": "2026-02-26 21:13:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CrowdStrike offers FalconID for multi-factor authentication with real-time protection against phishing attacks.",
            "id": "ca7e19ff-6ed3-4618-9578-9acd86530608",
            "description": "In Austin, Texas, CrowdStrike (NASDAQ: CRWD) has launched FalconID, which is now widely accessible, expanding the Falcon® platform by adding zero-friction, phishing-resistant MFA. Recognizing the critical role of identity in contemporary attacks, this launch reinforces CrowdStrike’s position as a leader in Next-Gen Identity Security by offering real-time, risk-conscious defense against AI-driven phishing attacks and credential exploitation during authentication. Their intelligent security framework provides comprehensive protection, covering identity security challenges efficiently.",
            "link": "https://www.markets.news/headlines/ca7e19ff-6ed3-4618-9578-9acd86530608",
            "pub_date": "2026-02-26 21:14:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IEI highlights secure Edge Infrastructure at Embedded World 2026, combining Edge AI, cybersecurity, & resilience.",
            "id": "e5e22b39-6e87-4fbe-84d0-beffd14d66fb",
            "description": "Unveiling at Embedded World 2026 in TAIPEI on February 26, 2026, IEI Integration Corp. (IEI) reveals cutting-edge industrial platforms that prioritize security. These platforms seamlessly integrate Edge AI capabilities, robust lifecycle cybersecurity measures, and essential mission-critical resilience features. IEI's showcase at Hall 3 exemplifies their commitment to innovation in the industry.",
            "link": "https://www.markets.news/headlines/e5e22b39-6e87-4fbe-84d0-beffd14d66fb",
            "pub_date": "2026-02-26 21:14:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "dbe3cab0-65b1-4ec5-bd0a-7eebec2483df",
            "description": "WARNER BROS CEO SAYS CO HAS ENGAGED WITH 4 BIDDERS, WHICH LED TO 8 PRICE INCREASES AND HAVE THUS FAR ACHIEVED 63% INCREASE IN VALUE VERSUS FIRST OFFER RECEIVED IN SEPTEMBER",
            "link": "https://www.markets.news/headlines/dbe3cab0-65b1-4ec5-bd0a-7eebec2483df",
            "pub_date": "2026-02-26 21:15:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smarsh warns that governance, defensibility, and accountability are key for regulated enterprises in 2026 AI landscape.",
            "id": "b9af4641-cdbc-4e6d-b850-c58f849830c0",
            "description": "Smarsh, a leading company in communications data and intelligence based in Portland, Oregon, has recently unveiled its 2026 AI Insights Report. The report highlights a significant shift in the regulatory landscape, indicating that regulators are progressing from experimenting with AI to actively enforcing regulations. This transition emphasizes the crucial importance of governance, defensibility, and accountability for regulated businesses in the upcoming year. The report specifically focuses on financial institutions and other regulated entities, stressing that the key concern is no longer the decision of whether to embrace AI technology, but rather how to navigate the challenges of compliance amid evolving regulatory standards. Businesses in these sectors will need to prioritize establishing robust frameworks to ensure adherence to regulations and to effectively manage AI-related risks in order to thrive in the increasingly scrutinized regulatory environment.",
            "link": "https://www.markets.news/headlines/b9af4641-cdbc-4e6d-b850-c58f849830c0",
            "pub_date": "2026-02-26 21:10:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "i3 Broadband gets right-of-way approvals in Antioch, Grayslake, and Winthrop Harbor in Lake County, Illinois for FTTH network. The company also joins Lake County Municipal League for 2026.",
            "id": "b4aa5f53-4f29-4bbd-b875-129389da2d88",
            "description": "In East Peoria, Illinois, i3 Broadband, a regional fiber-optic internet company, revealed that it has obtained permissions to establish its fully fiber-to-the-home (FTTH) network in Lake County. This move signifies a notable expansion for the provider in Northern Illinois, specifically in communities such as Antioch, Grayslake, and Winthrop Harbor. Furthermore, i3 Broadband has become an associate member of the Lake County Municipal League for the year 2026, strengthening its presence in the region.",
            "link": "https://www.markets.news/headlines/b4aa5f53-4f29-4bbd-b875-129389da2d88",
            "pub_date": "2026-02-26 21:10:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sensus Healthcare introduces Sensus Link to enhance SRT-100™ system capabilities. Cloud-based software expands advanced operating.",
            "id": "672eafa4-dd97-4179-bb83-0ea05b0c8b18",
            "description": "Sensus Healthcare, Inc., a medical device company focusing on treatments for skin conditions, has unveiled Sensus Link, a cloud-based software for its SRT-100™ system users. Being traded on Nasdaq as SRTS, the company aims to enhance operating capabilities for oncological and non-oncological conditions. The software provides a cost-effective solution for improved connectivity, expanding the system's reach. This innovation showcases the company's commitment to advanced and efficient healthcare technologies.",
            "link": "https://www.markets.news/headlines/672eafa4-dd97-4179-bb83-0ea05b0c8b18",
            "pub_date": "2026-02-26 21:10:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banuba launches AI Talking Photo API in Dubai, turning static images into talking videos. #AILipSync",
            "id": "9b8bf6df-4fa2-40fc-9a49-626b637a774b",
            "description": "In Dubai, United Arab Emirates, Banuba has introduced a cutting-edge AI-powered tool capable of transforming still portraits into lifelike videos. This innovative technology, known as AILipSync, aims to revolutionize the way videos are created by utilizing artificial intelligence. This tool has caught the attention of many with its ability to generate realistic videos from static images. Its launch signifies a significant advancement in the field of video creation, drawing interest from various industries and professionals.",
            "link": "https://www.markets.news/headlines/9b8bf6df-4fa2-40fc-9a49-626b637a774b",
            "pub_date": "2026-02-26 21:10:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Weave ranked #2 in G2’s 2026 Best Healthcare Software Awards for software companies with 100+ million buyers.",
            "id": "eefd82dd-9afe-4e08-a288-1b06a5f51951",
            "description": "In Lehi, Utah, Weave (NYSE: WEAV) has been recognized as one of the top software platforms for small and medium-sized healthcare businesses. Weave was ranked #2 on G2’s 2026 Best Healthcare Software Products list, which is significant as G2 is a renowned software marketplace reaching over 100 million buyers each year. The annual Best Software Awards by G2 are highly respected for identifying the top software companies and products in the industry.",
            "link": "https://www.markets.news/headlines/eefd82dd-9afe-4e08-a288-1b06a5f51951",
            "pub_date": "2026-02-26 21:10:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Qure.ai gains 6 FDA-approved indications for chest X-ray, leading in radiology AI race.",
            "id": "ae4c5686-095b-4686-8cd6-c5f9cb7cb431",
            "description": "In New York, Qure.ai has achieved a significant milestone with the FDA approving six new indications for its chest X-ray technology. This success solidifies Qure.ai's position as a leader in the radiology AI sector. The approval highlights the efficacy and potential of the technology in revolutionizing healthcare.",
            "link": "https://www.markets.news/headlines/ae4c5686-095b-4686-8cd6-c5f9cb7cb431",
            "pub_date": "2026-02-26 21:10:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Varist introduces Hybrid Detection Engine™ to detect known and zero-day threats instantly at scale, scanning 500 billion files per day.",
            "id": "82c3347d-d226-4d22-91bb-d2dffe3679bf",
            "description": "Varist unveiled their Hybrid Detection Engine™ in Reykjavik, Iceland, marking the release of an innovative AI-powered malware detection solution. This new technology is capable of identifying both known and zero-day threats immediately on a large scale. Drawing from established methods that have facilitated over 500 billion daily file scans for clients worldwide, the Varist system outperforms conventional detection mechanisms by thoroughly scanning every file and emulating suspicious elements in real-time. Its unique approach amalgamates detection of unfamiliar threats with reduced expenses and elevated efficiency.",
            "link": "https://www.markets.news/headlines/82c3347d-d226-4d22-91bb-d2dffe3679bf",
            "pub_date": "2026-02-26 21:10:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "USA Today Co (NYSE: TDAY) Q4 earnings disappoint, EPS at $-0.21 vs $-0.12 estimate, revenue down $36.28M from last year.",
            "id": "93caec09-6f91-4684-b6bf-b95d019e2d56",
            "description": "On Thursday, February 26, 2026, at 07:00 AM, USA Today Co (NYSE: TDAY) released its Q4 earnings report. The company fell short of estimated earnings by -75.0%, revealing an EPS of $-0.21 compared to the expected $-0.12. Revenue for the quarter decreased by $36.28 million year-over-year. This latest announcement marked a disappointing performance for the company compared to prior quarters. For a detailed analysis, visit a financial news website.",
            "link": "https://www.markets.news/headlines/93caec09-6f91-4684-b6bf-b95d019e2d56",
            "pub_date": "2026-02-26 21:10:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maxell to ship samples of EMC countermeasure components for high-frequency bands from April 2026 for functionality evaluation.",
            "id": "8d899180-a4cc-4fa1-b48a-cdfa6e518221",
            "description": "In Tokyo, Maxell has announced the commencement of sample shipments for evaluation purposes of EMC countermeasure components for high-frequency bands. Interested parties can now receive samples to assess their functionality.",
            "link": "https://www.markets.news/headlines/8d899180-a4cc-4fa1-b48a-cdfa6e518221",
            "pub_date": "2026-02-26 21:10:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Autonomize AI appoints Jennifer Rouse as VP of Marketing and Gina Collins as Chief Regulatory Officer, accelerating adoption of governed AI platform.",
            "id": "c76b952a-cc27-42a0-b9f5-ed24aeb4bc54",
            "description": "In Austin, Texas, Autonomize AI has appointed Jennifer Rouse as VP of Marketing and Gina Collins as Chief Regulatory Officer. The company is leading the way in helping healthcare businesses transition into AI-native organizations. This move comes as Autonomize AI is rapidly implementing its governed AI platform, leading to significant cost savings. These appointments signal the company's dedication to growth, with millions of dollars in savings already delivered to numerous organizations.",
            "link": "https://www.markets.news/headlines/c76b952a-cc27-42a0-b9f5-ed24aeb4bc54",
            "pub_date": "2026-02-26 21:10:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}