{
    "data": [
        {
            "title": "",
            "id": "d9aa4fd6-9e6c-4eb8-8c97-7c42b4705886",
            "description": "MOC Imbalance S&P 500: +2720 mln Nasdaq 100: +364 mln Dow 30: +1054 mln Mag 7: -545 mln",
            "link": "https://www.markets.news/headlines/d9aa4fd6-9e6c-4eb8-8c97-7c42b4705886",
            "pub_date": "2026-02-28 04:52:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA approves Novo Nordisk's Sogroya®, a weekly growth hormone, for 3 new pediatric conditions, for kids 2.5+ years.",
            "id": "64804ecd-5341-4a66-85b3-d6ad497dea24",
            "description": "New treatment options have expanded for children aged 2.5 years and older with Idiopathic Short Stature (ISS), Small for Gestational Age (SGA) conditions, or Noonan Syndrome (NS). Sogroya® (somapacitan-beco) is a once-weekly treatment choice for these conditions. This provides an alternative for appropriate children in need of care, with benefits for approximately 1-3% of children experiencing these conditions.",
            "link": "https://www.markets.news/headlines/64804ecd-5341-4a66-85b3-d6ad497dea24",
            "pub_date": "2026-02-28 04:55:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NUNM receives $1.5M gift from alumnus to expand campus and support integrative medicine.",
            "id": "433d160d-d111-44c3-8e81-4ca0996cff8e",
            "description": "In Portland, Oregon, on February 27, 2026, the National University of Natural Medicine (NUNM) announced a generous donation of $1.5 million from Dr. Noel Peterson, an alumnus from the class of '78, and his wife Teresa Shelley. The donation is aimed at facilitating the expansion of the campus and advancing the field of integrative medical education and clinical practices.",
            "link": "https://www.markets.news/headlines/433d160d-d111-44c3-8e81-4ca0996cff8e",
            "pub_date": "2026-02-28 04:56:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enrollment is open for K12-powered virtual public schools in Missouri, serving students state-wide with full-time programs and state-certified teachers.",
            "id": "4501cb8c-f2d3-4efa-b67d-5077cb0e8993",
            "description": "Families in Missouri have the opportunity to enroll in full-time virtual public school programs that are powered by K12 and led by state-certified teachers. This initiative allows families in Missouri to access high-quality education from the comfort of their own homes. The program ensures that students receive instruction from qualified teachers while following the state curriculum. By enrolling in these virtual public school programs, families can have the flexibility to customize their education while maintaining the same standards as traditional schools. This provides families in Missouri with an innovative and accessible option for their children's education.",
            "link": "https://www.markets.news/headlines/4501cb8c-f2d3-4efa-b67d-5077cb0e8993",
            "pub_date": "2026-02-28 04:56:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Enrollment now open for K12-powered virtual public schools in Ohio. State-certified teachers leading programs.",
            "id": "01362be9-893f-4957-b25d-318bc22fd346",
            "description": "Families in Ohio now have the opportunity to enroll in full-time virtual public school programs facilitated by state-certified teachers. This initiative allows families to access education remotely through K12-powered programs. The virtual school option ensures that students receive guidance and instruction from qualified educators while learning from home. This program offers a flexible and personalized approach to education, catering to the individual needs of students. Families can enroll their children in full-time virtual schooling to provide a structured learning environment that meets state standards.",
            "link": "https://www.markets.news/headlines/01362be9-893f-4957-b25d-318bc22fd346",
            "pub_date": "2026-02-28 04:57:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nike announces it will release Q3 fiscal 2026 earnings on March 31, 2026, at 1:15 p.m. PT, with a conference call at 2:00 p.m. PT.",
            "id": "65636ed6-036f-4405-837f-b07bd6cad52e",
            "description": "In order to adjust for upcoming holidays, NIKE, Inc. (NYSE: NKE) has rescheduled the release of its third quarter fiscal 2026 financial results to Tuesday, March 31, 2026, at around 1:15 p.m. PT, after the regular stock market trading hours. Following the announcement, NIKE, Inc. management will conduct a conference call starting at 2:00 p.m. PT to discuss the results. The conference call will be streamed live online and is accessible at the given web address.",
            "link": "https://www.markets.news/headlines/65636ed6-036f-4405-837f-b07bd6cad52e",
            "pub_date": "2026-02-28 05:00:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "27c98cdc-1db9-4e35-bfa6-e04466877a63",
            "description": "ZELENSKIY: BRIEFED RUTTE ON MEETINGS WITH AMERICAN SIDE",
            "link": "https://www.markets.news/headlines/27c98cdc-1db9-4e35-bfa6-e04466877a63",
            "pub_date": "2026-02-28 04:46:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ac6bfa99-072d-458c-a3af-ae31637670ab",
            "description": "ZELENSKIY: SPOKE WITH NATO'S RUTTE",
            "link": "https://www.markets.news/headlines/ac6bfa99-072d-458c-a3af-ae31637670ab",
            "pub_date": "2026-02-28 04:46:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Generational Group advises JMPE Electrical Engineering's sale to Agathos AEC, a Hunter Forest Capital portfolio company.",
            "id": "77baa23d-4e63-4fa2-bfb5-bf039efad0e4",
            "description": "A mergers and acquisitions advisory firm, Generational Group, recently facilitated the sale of JMPE Electrical Engineering to Agathos AEC, a company under Hunter Forest Capital, for an undisclosed amount. The deal was finalized on February 2, 2026. JMPE Electrical Engineering, headquartered in Santa Barbara, California, is known for its comprehensive electrical engineering and lighting design services catering to various clients in the commercial, industrial, government, and residential sectors.",
            "link": "https://www.markets.news/headlines/77baa23d-4e63-4fa2-bfb5-bf039efad0e4",
            "pub_date": "2026-02-28 04:47:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c21093fe-a1f3-43d4-9842-bfaea8f7baf2",
            "description": "TRUMP: I AM DIRECTING EVERY FEDERAL AGENCY IN UNITED STATES GOVERNMENT TO IMMEDIATELY CEASE ALL USE OF ANTHROPIC'S TECHNOLOGY",
            "link": "https://www.markets.news/headlines/c21093fe-a1f3-43d4-9842-bfaea8f7baf2",
            "pub_date": "2026-02-28 04:49:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "243ed45e-07da-43ae-adca-9d770f95141d",
            "description": "TRUMP: THERE WILL BE A SIX MONTH PHASE OUT PERIOD FOR AGENCIES LIKE DEPARTMENT OF WAR WHO ARE USING ANTHROPIC'S PRODUCTS",
            "link": "https://www.markets.news/headlines/243ed45e-07da-43ae-adca-9d770f95141d",
            "pub_date": "2026-02-28 04:49:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FRC's Tony Perkins responds to scouting America's policy changes announced by U.S. Secretary of War Pete Hegseth on Feb. 27, 2026.",
            "id": "3d4b742f-2625-40de-a91d-375f9c68f517",
            "description": "On February 27, 2026, US Secretary of War Pete Hegseth released a video disclosing that Scouting America, previously named Boy Scouts of America, will be implementing policy alterations. These changes will primarily focus on guidelines concerning transgender individuals. The shift is aimed at ensuring the organization's continued relevance and inclusivity.",
            "link": "https://www.markets.news/headlines/3d4b742f-2625-40de-a91d-375f9c68f517",
            "pub_date": "2026-02-28 04:49:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0b18be41-76ce-4630-9803-e80159d78e50",
            "description": "Trump: Anthropic better get their act together, and be helpful during this phase out period, or I will use the full power of the presidency to make them comply - Truth Social.",
            "link": "https://www.markets.news/headlines/0b18be41-76ce-4630-9803-e80159d78e50",
            "pub_date": "2026-02-28 04:50:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fb22dead-c2e6-4286-95b4-8bd49bae3898",
            "description": "Blackstone plans public company for AI data-center buying spree.",
            "link": "https://www.markets.news/headlines/fb22dead-c2e6-4286-95b4-8bd49bae3898",
            "pub_date": "2026-02-28 04:43:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MATIC unveils Open Money Stack merging $2.3T infrastructure with Coinme buy, streamlining stablecoin payments. #Polygon #MATIC",
            "id": "2eac54ec-c15c-4125-85d6-220e832c5f97",
            "description": "Polygon Labs recently released details on the technical structure of Open Money Stack. This innovative system merges a massive $2.3 trillion settlement infrastructure with the acquisition of Coinme. The integration aims to establish comprehensive stablecoin rails, offering end-to-end solutions for users.",
            "link": "https://www.markets.news/headlines/2eac54ec-c15c-4125-85d6-220e832c5f97",
            "pub_date": "2026-02-28 04:44:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "If UBS' bearish view on US stocks materializes, traders may shift to Bitcoin due to overvaluation concerns.",
            "id": "b5f8e79c-d0c5-44df-9877-0d8ee546ca44",
            "description": "A recent UBS report highlighted that US stocks are considered to be \"overvalued,\" indicating that there may be more favorable investment prospects in markets outside of the US. This observation has raised speculation on whether this could potentially serve as a driving factor for the next surge in Bitcoin value.",
            "link": "https://www.markets.news/headlines/b5f8e79c-d0c5-44df-9877-0d8ee546ca44",
            "pub_date": "2026-02-28 04:27:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AV, Inc. to announce 3rd quarter fiscal year 2026 earnings on March 10, 2026, after market close. Conference call at 4:30 pm ET.",
            "id": "beb39d68-79d4-431a-aafb-208e3d973f26",
            "description": "Arlington-based company AeroVironment, Inc. (NASDAQ: AVAV) is set to release its financial results for the third quarter of fiscal year 2026, which concluded on January 31, 2026. The market anticipates this report after the closing bell on March 10, 2026. Following the release, a conference call and live audio webcast are scheduled at 4:30 p.m. Eastern Time on the same day to delve into the figures. The call will be headed by Wahid Nawabi, AV’s chairman, president, and CEO, alongside Kevin P. McDonnell, the firm's executive vice president and chief.",
            "link": "https://www.markets.news/headlines/beb39d68-79d4-431a-aafb-208e3d973f26",
            "pub_date": "2026-02-28 04:28:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d9368d8b-21d4-48b0-98eb-f9f9e402ca47",
            "description": "U.S. FEDERAL COMMUNICATIONS COMMISSION APPROVED CHARTER COMMUNICATIONS’ $34.5 BILLION ACQUISITION OF COX ENTERPRISES INC.’S RESIDENTIAL CABLE, COMMERCIAL FIBER, AND MANAGED IT AND CLOUD BUSINESSES -STATEMENT",
            "link": "https://www.markets.news/headlines/d9368d8b-21d4-48b0-98eb-f9f9e402ca47",
            "pub_date": "2026-02-28 04:28:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "7fab1d09-47c0-47ae-a065-6dde2b45738a",
            "description": "CFTC Positions in the Week of February 24th 2026",
            "link": "https://www.markets.news/headlines/7fab1d09-47c0-47ae-a065-6dde2b45738a",
            "pub_date": "2026-02-28 04:32:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teledyne Marine and M Subs collaborate for UK Royal Navy opportunities, signing MOU for strategic partnership.",
            "id": "e92b9c96-c928-40b5-8a7e-cd2c04ab9004",
            "description": "In NORTH FALMOUTH, Massachusetts, Teledyne Marine and M Subs have signed a Memorandum of Understanding (MOU) to collaborate on maritime unmanned underwater vehicles and marine technologies. Teledyne Marine, a renowned global leader in the industry, joins forces with M Subs, a UK-based innovator in marine unmanned systems and autonomy. The partnership's goal is to capitalize on each organization's strengths to pursue business opportunities linked to the UK Royal Navy. This strategic collaboration signifies a new chapter in the industry, combining Teledyne Marine's expertise with M Subs' innovation to drive growth and advancements in maritime technologies.",
            "link": "https://www.markets.news/headlines/e92b9c96-c928-40b5-8a7e-cd2c04ab9004",
            "pub_date": "2026-02-28 04:34:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}