{
    "data": [
        {
            "title": "Albany Engineered Composites President Chris Stone to discuss aerospace composites at event, March 2 at 3 p.m. PT.",
            "id": "01dcf0d8-3a1c-41d3-b634-09ad2e15cd1f",
            "description": "Albany Engineered Composites (AEC), renowned for its advanced composite solutions in aerospace and defense, reveals that President Chris Stone is set to participate in an executive panel at Aerolambda’s “The Aerospace Event” on March 2 at 3 p.m. PT. The panel, titled “C-Suite Views from Leading Aerospace Composites Companies,” will delve into demand trends, supply chain influences, and technological advancements impacting the aerospace composites sector. Stone's insights are anticipated to offer valuable perspectives on industry trends and opportunities.",
            "link": "https://www.markets.news/headlines/01dcf0d8-3a1c-41d3-b634-09ad2e15cd1f",
            "pub_date": "2026-02-27 03:52:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apollo.io named the top AI-Native Sales Intelligence Platform in G2's 2026 Best Software Awards, highlighting its global impact.",
            "id": "701d180e-ff17-4082-8b8d-ce2fd7fb545f",
            "description": "Apollo.io has solidified its status as the top agentic end-to-end GTM platform supporting revenue teams globally, according to the latest G2 rankings. The company based in San Francisco made the announcement on February 26, 2026. Apollo.io, renowned for its AI-native go-to-market solutions, has received high rankings in G2's 2026 Best, highlighting its dominance in the industry.",
            "link": "https://www.markets.news/headlines/701d180e-ff17-4082-8b8d-ce2fd7fb545f",
            "pub_date": "2026-02-27 03:52:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New luxury homes by Toll Brothers coming soon to Spartanburg, SC with personalization options and onsite amenities.",
            "id": "1bb77a1c-5459-4ea0-87a3-37c2a2036cb4",
            "description": "Toll Brothers will introduce new homes with customization choices and luxurious amenities within a meticulously designed community. The new homes will provide residents with the opportunity to personalize their living spaces according to their preferences. Additionally, the community will feature resort-style amenities that are conveniently located onsite for residents to enjoy. This development is part of a master-planned setting, bringing a new level of luxury living to the area.",
            "link": "https://www.markets.news/headlines/1bb77a1c-5459-4ea0-87a3-37c2a2036cb4",
            "pub_date": "2026-02-27 03:52:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OSC Technical Solutions (OSC-TS) is a new company specializing in federal IT, cybersecurity, and critical infrastructure services, operating within OSC Global. Based in Washington, they offer IT modernization and cyber engineering services for regulated environments.",
            "id": "a7ba5cfc-718e-4624-b349-ce4a730bf681",
            "description": "An Alaska-based cybersecurity firm, OSC Technical Solutions (OSC-TS), has been officially created as a standalone company under OSC Global, a subsidiary of Cook Inlet Region, Inc. The firm, headquartered in the Tri-Cities region of Washington, specializes in IT modernization, cybersecurity operations, and industrial control systems cybersecurity for critical and heavily regulated sectors. OSC-TS is dedicated to providing services to high-consequence environments, with a focus on enhancing technological infrastructure and safeguarding against cyber threats in these sectors.",
            "link": "https://www.markets.news/headlines/a7ba5cfc-718e-4624-b349-ce4a730bf681",
            "pub_date": "2026-02-27 03:53:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bloomberg and Kaiko expand financial data to $25B tokenized markets, integrating data on blockchain for Treasurys and repos.",
            "id": "dcde8b36-3319-4425-8fa1-fbf91a5d7feb",
            "description": "Bloomberg and Kaiko are working together to integrate authorized financial data directly onto blockchain networks. This collaboration is focused on serving institutional tokenized Treasurys and repo markets.",
            "link": "https://www.markets.news/headlines/dcde8b36-3319-4425-8fa1-fbf91a5d7feb",
            "pub_date": "2026-02-27 03:54:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nuvia Dental Implant Center named a Top 10 Best Company to Watch 2026 by BizTech Outlook.",
            "id": "e3e62a0b-554e-4693-8409-b286d25bd3d3",
            "description": "Baltimore-based Nuvia Dental Implant Center has recently been recognized as one of the \"10 Best Companies to Watch in 2026\" by BizTech Outlook. This prestigious acknowledgment highlights Nuvia Dental Implant Center's outstanding performance and potential in the industry. Being named among the top 10 best companies to watch in 2026 by BizTech Outlook is a significant achievement, emphasizing the company's promising future.",
            "link": "https://www.markets.news/headlines/e3e62a0b-554e-4693-8409-b286d25bd3d3",
            "pub_date": "2026-02-27 03:54:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Law firm investigating Ardent Health (ARDT) for $97M accounting shock and \"180-Day Cliff\" reserves. Lead plaintiff deadline March 9.",
            "id": "7c4589b4-213b-49cd-9b76-4f279e66e257",
            "description": "A leading law firm is currently examining reports regarding inadequate professional liability insurance disclosed by a company, in contradiction to its earlier statements. The firm has set a deadline of March 9 for potential lead plaintiffs to come forward. This notification is aimed at investors holding stock in Ardent Health, Inc. (NYSE:...). This information was shared on February 26, 2026, from San Francisco by the renowned national shareholder rights law firm, Hagens Berman.",
            "link": "https://www.markets.news/headlines/7c4589b4-213b-49cd-9b76-4f279e66e257",
            "pub_date": "2026-02-27 03:54:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "57de5a08-4c0f-40c2-8897-c0fa681d2842",
            "description": "TOP UKRAINIAN NEGOTIATOR UMEROV SAYS GENEVA TALKS PARTICIPANTS SPOKE WITH PRESIDENT ZELENSKIY; SAYS NEXT TRILATERAL MEETINGS AIM TO FINALISE SECURITY AND ECONOMIC ISSUES AND DISCUSSED UKRAINE’S POST-WAR RECOVERY",
            "link": "https://www.markets.news/headlines/57de5a08-4c0f-40c2-8897-c0fa681d2842",
            "pub_date": "2026-02-27 03:56:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Most popular Esri Press ebooks now offered in Esri Store at 20% off. Titles include The Power of Where, GIS Tutorial for ArcGIS Pro 3.4, Essential Skills for ArcGIS Experience Builder, Getting to Know ArcGIS Enterprise.",
            "id": "ad94aae6-021d-43f6-91f6-6200fa06f8a2",
            "description": "Esri, a leading provider of location intelligence based in Redlands, California, is now selling eleven of its best-selling Esri Press ebooks directly through the Esri Store for the first time. These popular titles, including \"The Power of Where,\" \"GIS Tutorial for ArcGIS Pro 3.4,\" \"Top 20 Essential Skills for ArcGIS Experience Builder,\" and \"Getting to Know ArcGIS Enterprise,\" are being offered at a 20% discount. ArcGIS users now have convenient access to these ebooks through the store.",
            "link": "https://www.markets.news/headlines/ad94aae6-021d-43f6-91f6-6200fa06f8a2",
            "pub_date": "2026-02-27 03:58:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1deb0b26-2a42-435c-b3a2-6bf776fab110",
            "description": "Fed's Goolsbee had concluded comments on Fox News",
            "link": "https://www.markets.news/headlines/1deb0b26-2a42-435c-b3a2-6bf776fab110",
            "pub_date": "2026-02-27 03:47:04",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "66d5cf52-343f-4c6e-9f25-ac23b5da1cb9",
            "description": "Brent crude futures settle at 70.75 dollars per barrel, down 10 cents, 0.14%.",
            "link": "https://www.markets.news/headlines/66d5cf52-343f-4c6e-9f25-ac23b5da1cb9",
            "pub_date": "2026-02-27 03:48:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6ac8ff78-111d-4770-a74d-0d6ba974573b",
            "description": "Fed's Goolsbee: Rates can come down, but don't want to front-load before inflation eases - Fox News",
            "link": "https://www.markets.news/headlines/6ac8ff78-111d-4770-a74d-0d6ba974573b",
            "pub_date": "2026-02-27 03:44:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ce8cee8a-61a0-4eaf-b4db-c580a88c9535",
            "description": "Fed's Goolsbee: The economy has been solid, and the job market is stable.",
            "link": "https://www.markets.news/headlines/ce8cee8a-61a0-4eaf-b4db-c580a88c9535",
            "pub_date": "2026-02-27 03:44:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "291d8109-d1e2-47f0-bc77-1885b3ee128a",
            "description": "Fed's Goolsbee: I am one of the more optimistic people on the Fed about rate cuts this year",
            "link": "https://www.markets.news/headlines/291d8109-d1e2-47f0-bc77-1885b3ee128a",
            "pub_date": "2026-02-27 03:44:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0413c31c-8a6c-48d3-ba8f-2decfca70103",
            "description": "Fed's Goolsbee: I want us to be careful.",
            "link": "https://www.markets.news/headlines/0413c31c-8a6c-48d3-ba8f-2decfca70103",
            "pub_date": "2026-02-27 03:44:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brandon Stanton named 2026 PRWeek Communicator of the Year for his Humans of New York project. Being honored at PRWeek Awards on March 12 in NYC.",
            "id": "b61d8998-6088-4a4a-ae71-b314bfe443c1",
            "description": "New York-based Brandon Stanton, renowned for the Humans of New York online project, has been named as the 2026 Communicator of the Year by PRWeek. The esteemed writer and photographer will receive this honor at the upcoming PRWeek Awards event in New York City on March 12th. Stanton has been a trailblazer in digital engagement since 2010, moving from street photography to conducting deep, unscripted interviews with individuals. With an impressive following of over 29 million, his approach has reshaped online storytelling.",
            "link": "https://www.markets.news/headlines/b61d8998-6088-4a4a-ae71-b314bfe443c1",
            "pub_date": "2026-02-27 03:45:18",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d3adb577-602c-43ab-befc-65080e6db74c",
            "description": "US STATE DEPT: UP TO $10 MLN IN REWARD OFFERS FOR INFORMATION LEADING TO ARRESTS AND/OR CONVICTIONS OF ALLEGED MEXICAN SINALOA CARTEL PLAZA BOSSES",
            "link": "https://www.markets.news/headlines/d3adb577-602c-43ab-befc-65080e6db74c",
            "pub_date": "2026-02-27 03:33:50",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Proofpoint integrates with AWS Security Hub Extended plan, providing advanced threat protection and AI innovation.",
            "id": "a15c05df-34db-490e-8dff-0af26932ebcc",
            "description": "A cybersecurity and compliance company based in Sunnyvale, California, Proofpoint, Inc., revealed the integration of Proofpoint Collaboration Protection with the Extended plan in AWS Security Hub. This integration allows customers to access Proofpoint's advanced threat protection and AI technology for email, messaging, and collaboration tools through a unified experience with streamlined contracting and billing. With this integration, users can benefit from enhanced security measures within the Amazon Web Services ecosystem.",
            "link": "https://www.markets.news/headlines/a15c05df-34db-490e-8dff-0af26932ebcc",
            "pub_date": "2026-02-27 03:33:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Upwind integrates CNAPP with AWS Security Hub Extended plan for real-time visibility; reduces alert noise.",
            "id": "4c67e552-b1ab-46a5-b3b8-229e6e9f3aa2",
            "description": "Today, in San Francisco, Upwind, a prominent cloud security company, revealed the integration of its cloud-native application protection platform (CNAPP) with the Extended plan in AWS Security Hub. This collaboration will allow customers to enhance their visibility into AWS workloads in real-time, minimizing alert distractions and prioritizing key risks. By merging AWS detection services with Upwind’s runtime technology, customers can now effectively manage security threats and vulnerabilities.",
            "link": "https://www.markets.news/headlines/4c67e552-b1ab-46a5-b3b8-229e6e9f3aa2",
            "pub_date": "2026-02-27 03:33:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "efb26b0a-b309-431b-a6d0-7a8ded5cee88",
            "description": "NYMEX Natural Gas April futures settle at $2.8270/MMBTU. NYMEX Gasoline March futures settle at $2.0323 a gallon. NYMEX Diesel March futures settle at $2.6125 a gallon. NYMEX WTI crude April futures settle at $65.21 a barrel, down 21 cents, 0.32%.",
            "link": "https://www.markets.news/headlines/efb26b0a-b309-431b-a6d0-7a8ded5cee88",
            "pub_date": "2026-02-27 03:34:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}