{
    "data": [
        {
            "title": "Portfolio BI secures significant multi-million dollar investment from Decathlon Capital Partners to enhance AI capabilities, benefiting shareholders.",
            "id": "32d41a21-ebc6-4c0f-bec7-975e0996f690",
            "description": "Portfolio BI, a company offering advanced data solutions for alternative investment managers, recently secured a substantial investment to enhance its offerings. The transaction, completed on February 26, 2026, involves a multi-million-dollar investment that will support the company's growth. This funding will allow Portfolio BI to improve its services and technology, providing more value to its clients. The investment includes flexible amortization terms and ensures that existing shareholders are protected from any potential dilution of their ownership.",
            "link": "https://www.markets.news/headlines/32d41a21-ebc6-4c0f-bec7-975e0996f690",
            "pub_date": "2026-02-27 08:01:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Immvira's oncolytic product MVR-T3011 now available to BCG-naïve bladder cancer patients; clinical data presented at 2026 ASCO GU Conference.",
            "id": "9509084f-7b6f-42de-a44e-263ca7c7eae2",
            "description": "In Suzhou, China on February 26, 2026, it was revealed that Intravesical Bacillus Calmette-Guérin (BCG) is the recommended treatment for BCG-naïve high-risk non-muscle-invasive bladder cancer (NMIBC) individuals. The shortage of BCG products has emerged as a worldwide issue, affecting the availability of this essential therapy. This scarcity, along with the potential side effects associated with BCG treatment, has become a significant concern for healthcare providers and patients worldwide.",
            "link": "https://www.markets.news/headlines/9509084f-7b6f-42de-a44e-263ca7c7eae2",
            "pub_date": "2026-02-27 08:01:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Caris Life Sciences corrects headline placement in PR Newswire about Achieve 1 Study interim readout on Feb. 26, 2026.",
            "id": "44461f8c-e4f2-4003-8799-fd49ff95b5c5",
            "description": "Caris Life Sciences has finished the interim analysis of their Achieve 1 Study as of February 26, 2026. The company announced that there was an error in the news release distribution, where the second line of the headline was mistakenly positioned as a sub-headline. This update comes after a significant milestone in the ongoing study, with key findings and data being analyzed. The Achieve 1 Study has now reached a crucial stage, with important results expected to be released soon. Stay tuned for further updates on this groundbreaking research.",
            "link": "https://www.markets.news/headlines/44461f8c-e4f2-4003-8799-fd49ff95b5c5",
            "pub_date": "2026-02-27 08:01:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global REMAX R4 Conference gathers attendees from 55+ countries, introducing new products and ideas for real estate success.",
            "id": "189fec56-b69d-4ddc-8d0b-7cfdafcadbbd",
            "description": "Representatives from more than 55 nations convened in Denver on February 26, 2026, for a collaborative gathering focused on exchanging knowledge, establishing connections, exploring innovative solutions, and gearing up for upcoming challenges. The event provided a platform for participants to enhance their prospects within a prominent worldwide enterprise that aims to assist them in securing additional property listings, maximizing efficiency, and capitalizing on potential income-boosting chances.",
            "link": "https://www.markets.news/headlines/189fec56-b69d-4ddc-8d0b-7cfdafcadbbd",
            "pub_date": "2026-02-27 08:01:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0b2ae7bf-f7ae-42bf-b27b-a39379ce0f7a",
            "description": "UNITED STATES DEPARTMENT OF DEFENSE THREATENS TO BAR ANTHROPIC FROM THE MILITARY SUPPLY CHAIN UNLESS IT GRANTS UNRESTRICTED USE OF ITS CLAUDE GOV AI, REJECTING SAFEGUARD LIMITS ON AUTONOMOUS WEAPONS AND SURVEILLANCE AND RAISING THE POSSIBILITY OF INVOKING THE DEFENSE PRODUCTION",
            "link": "https://www.markets.news/headlines/0b2ae7bf-f7ae-42bf-b27b-a39379ce0f7a",
            "pub_date": "2026-02-27 08:02:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "55b05ee6-c93d-4416-9a48-b1e6e7e1d7ba",
            "description": "Taliban spox: ‘After airstrikes in Kabul, Kandahar, and other provinces, widespread retaliation operations against Pakistani military bases in Kandahar and Helmand were launched once again.’",
            "link": "https://www.markets.news/headlines/55b05ee6-c93d-4416-9a48-b1e6e7e1d7ba",
            "pub_date": "2026-02-27 08:02:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Energy Fuels sees strong 2025 results with over 1M lbs of U.S. uranium production, $700M convertible senior notes, nearly $1B in working capital.",
            "id": "8a64e90d-f468-49c1-8bc0-114690ccf731",
            "description": "Uranium sales have seen a rise recently, with over 1 million pounds of low-cost U.S. uranium being produced. Additionally, a heavy rare earth pilot production is successfully ongoing. Moreover, an upsized $700 million 0.75% convertible senior notes offering has been completed, significantly boosting working capital to nearly $1 billion. These developments signal promising financial growth for the company.",
            "link": "https://www.markets.news/headlines/8a64e90d-f468-49c1-8bc0-114690ccf731",
            "pub_date": "2026-02-27 08:03:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Strong demand for cheaper Cybertruck; Tesla reduces price to $59,990 for 10 days; price may change after Feb. 28 based on demand.",
            "id": "0821e2e8-2c49-4eeb-ab15-567498dfa3a3",
            "description": "Tesla Inc (TSLA) has faced challenges in selling its Cybertrucks, but the unique electric pickup truck is now experiencing a surge in demand. To capitalize on this momentum, Tesla has initiated a limited-time price drop, reducing the starting price of the all-wheel drive Cybertruck to $59,990. This offer is only valid for a quick 10-day period, ending on Feb. 28. CEO Elon Musk has confirmed that the post-deadline price will be determined based on demand. Despite uncertainties about future pricing, Tesla is likely to maintain competitive rates to sustain high demand. This strategic move signals a shift in Tesla's sales approach and has generated renewed investor interest in TSLA stock.",
            "link": "https://www.markets.news/headlines/0821e2e8-2c49-4eeb-ab15-567498dfa3a3",
            "pub_date": "2026-02-27 08:03:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c9db586a-3616-4c69-9062-651011c54479",
            "description": "SOUTH KOREA'S LEE TO VISIT SINGAPORE AND PHILIPPINES FROM MARCH 1-4 - MEDIA",
            "link": "https://www.markets.news/headlines/c9db586a-3616-4c69-9062-651011c54479",
            "pub_date": "2026-02-27 08:04:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Copa Holdings (NYSE: CPA) files annual report Form 20-F for FY 2025 with SEC. Dec 31, 2025, year-end.",
            "id": "6b84eeae-c03d-4567-995b-9e2a3d1d5ab7",
            "description": "In Panama City on February 26, 2026, Copa Holdings, S.A. (NYSE: CPA) submitted its Form 20-F annual report for the fiscal year concluding on December 31, 2025, to the U.S. Securities and Exchange Commission.",
            "link": "https://www.markets.news/headlines/6b84eeae-c03d-4567-995b-9e2a3d1d5ab7",
            "pub_date": "2026-02-27 08:05:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3abc8ac8-5ecc-4568-afa4-16db07a70508",
            "description": "JAPAN JAN RETAIL SALES M/M +4.1% (EST +1.5%, PREV -2.0%); Y/Y +1.8% (EST +0.1%, PREV -0.9%); DEPT STORE, SUPERMARKET SALES Y/Y +2.6% (PREV -0.1%)",
            "link": "https://www.markets.news/headlines/3abc8ac8-5ecc-4568-afa4-16db07a70508",
            "pub_date": "2026-02-27 07:56:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "03c6ad66-0b64-438e-b33a-36fbddaa91e7",
            "description": "BENCHMARK 10-YEAR JGB FUTURES (MAR) UP 0.11 POINT IN EARLY TRADE",
            "link": "https://www.markets.news/headlines/03c6ad66-0b64-438e-b33a-36fbddaa91e7",
            "pub_date": "2026-02-27 07:57:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3c7a3665-1100-4fc6-9632-41a422b8f770",
            "description": "JAPAN’S NIKKEI AVERAGE FUTURES DOWN 0.63% IN EARLY TRADE",
            "link": "https://www.markets.news/headlines/3c7a3665-1100-4fc6-9632-41a422b8f770",
            "pub_date": "2026-02-27 07:57:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Steers Quality Income Realty Fund (RQI) informs shareholders of upcoming distribution sources on Feb. 27, 2026.",
            "id": "061ec8a9-b6ba-4aa3-beb5-8c74214e8e92",
            "description": "On February 26, 2026, shareholders of Cohen & Steers Quality Income Realty Fund, Inc. (NYSE: RQI) were informed about the upcoming distribution to be paid on February 27, 2026. The press release detailed the sources of the distribution and cumulative distributions paid in the fiscal period.",
            "link": "https://www.markets.news/headlines/061ec8a9-b6ba-4aa3-beb5-8c74214e8e92",
            "pub_date": "2026-02-27 07:57:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UTF will distribute dividends to shareholders on February 27, 2026, disclosing sources in this press release.",
            "id": "9203e4d7-f510-48f4-ab5b-11bd1ab532bb",
            "description": "On February 26, 2026, in New York, a press release announced details for shareholders of Cohen & Steers Infrastructure Fund, Inc. (NYSE: UTF) about the upcoming distribution to be paid on February 27, 2026. The release also included information about cumulative distributions paid fiscal year-to-date.",
            "link": "https://www.markets.news/headlines/9203e4d7-f510-48f4-ab5b-11bd1ab532bb",
            "pub_date": "2026-02-27 07:59:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1e9bd406-8dea-4173-9db7-90e27cd1c223",
            "description": "WARNER BROS. DISCOVERY INC. SAYS A REVISED $111 BILLION BID FROM PARAMOUNT SKYDANCE CORP. TOPS NETFLIX INC.’S OFFER, WITH NETFLIX GIVEN FOUR DAYS TO RAISE ITS BID OR RISK PAYING A $2.8 BILLION BREAKUP FEE AMID EXPECTED ANTITRUST SCRUTINY.",
            "link": "https://www.markets.news/headlines/1e9bd406-8dea-4173-9db7-90e27cd1c223",
            "pub_date": "2026-02-27 08:00:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Itaú Unibanco Holding S.A. approves BRL3.85 billion payment of interest on capital to stockholders, BRL0.34888 per share.",
            "id": "42484717-1055-49e7-b261-d76ed97d22df",
            "description": "Itaú Unibanco Holding S.A. announced on February 26, 2026, that its Board of Directors sanctioned the disbursement of interest on capital to stockholders (\"IoC\"). The approved payment totals BRL3.85 billion, equivalent to BRL0.34888 per share.",
            "link": "https://www.markets.news/headlines/42484717-1055-49e7-b261-d76ed97d22df",
            "pub_date": "2026-02-27 07:48:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RFI fund discloses distribution sources for shareholders, payment on Feb 27, 2026. (Numbers not provided in snippet).",
            "id": "e736826c-757a-468e-aabc-4ad72393d656",
            "description": "On February 26, 2026, a press release was issued for shareholders of Cohen & Steers Total Return Realty Fund, Inc. (NYSE: RFI) detailing the sources of the upcoming distribution scheduled for February 27, 2026. The release also included cumulative distributions paid during the fiscal year. This disclosure aims to inform stakeholders about the distribution information, enhancing transparency and accountability within the company.",
            "link": "https://www.markets.news/headlines/e736826c-757a-468e-aabc-4ad72393d656",
            "pub_date": "2026-02-27 07:48:40",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ancient Crunch's MASA sees strong performance with two retail-exclusive flavors, fueling premium snack rise. Los Angeles, Feb. 26, 2026.",
            "id": "e2e432bc-e396-4e7b-9e72-1ae06e2bc540",
            "description": "The parent company of MASA and Vandy, Ancient Crunch, revealed outstanding results on February 26, 2026, as a result of MASA introducing two unique retail-exclusive flavors. The premium retail expansion saw a significant boost in performance, with a surge in sales and customer interest. This successful move further fueled the company's growth in the retail sector, showcasing the demand for exclusive offerings in the market.",
            "link": "https://www.markets.news/headlines/e2e432bc-e396-4e7b-9e72-1ae06e2bc540",
            "pub_date": "2026-02-27 07:53:22",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stock market recovers as Dow and Nasdaq rise; AMD surges, energy sector shows strength. Online platform operator drops.",
            "id": "c29b0ebe-36e4-471e-bbc4-335df17a93b1",
            "description": "Today, the Dow Jones index experienced a rise after a sell-off on Monday. An online marketplace platform operator saw a decline. The Dow and Nasdaq closed in recovery mode, with the Dow gaining [specific number], while the Nasdaq rose by [specific number]. AMD showed significant growth, and energy companies also performed well. This news was covered by Investor's Business Daily.",
            "link": "https://www.markets.news/headlines/c29b0ebe-36e4-471e-bbc4-335df17a93b1",
            "pub_date": "2026-02-27 07:54:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}