{
    "data": [
        {
            "title": "Cronos Group's Q4 earnings missed estimates by -100%, with revenue up $14.23 million. Full article on Benzinga.com.",
            "id": "712233fd-9072-4637-9534-7185873af07f",
            "description": "Cronos Group (NASDAQ: CRON) released its Q4 earnings on Thursday, February 26, 2026, at 07:35 AM. Despite expectations, the company fell short on earnings by -100%, posting an EPS of $0.0 instead of the estimated $0.02. However, revenue saw a significant increase, rising by $14.23 million compared to the previous year. For a more detailed account, the full story can be accessed on Benzinga.com.",
            "link": "https://www.markets.news/headlines/712233fd-9072-4637-9534-7185873af07f",
            "pub_date": "2026-02-26 20:40:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gibraltar Industries Q4 earnings beat estimates by 2.7%, with EPS at $0.76 vs $0.74. Revenue dropped $33.37M from last year.",
            "id": "d1e947aa-77cd-448b-b794-21ccbde16807",
            "description": "Gibraltar Industries (NASDAQ: ROCK) recently released its Q4 earnings report on February 26, 2026, at 07:30 AM. The report revealed that the company exceeded expected earnings by 2.7%, posting an EPS of $0.76 compared to an estimated $0.74. However, there was a decrease in revenue by $33.37 million from the previous year's same period. For more details on the company's performance in previous earnings, refer to the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/d1e947aa-77cd-448b-b794-21ccbde16807",
            "pub_date": "2026-02-26 20:40:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Public Service Enterprise (NYSE: PEG) beat earnings by 1.41%, reporting EPS of $0.72 vs an estimate of $0.71, with revenue up $450M.",
            "id": "3498da54-e0ba-4d2e-9cbf-f9a549ffcaa2",
            "description": "Public Service Enterprise, listed as NYSE: PEG, released its Q4 earnings on February 26, 2026, at 07:30 AM. The earnings report showed a beat on estimated earnings by 1.41%, with an EPS of $0.72 compared to the estimated $0.71. This quarter's revenue saw an increase of $450.00 million from the corresponding period in the previous year. For more details on the previous earnings records and the full story, the information is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/3498da54-e0ba-4d2e-9cbf-f9a549ffcaa2",
            "pub_date": "2026-02-26 20:40:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lindblad Expeditions Q4 earnings report: EPS at $-0.45 (missed estimate by -40.62%), revenue increased by $34.57 million.",
            "id": "0de955fe-a68e-4703-936e-212914eff41e",
            "description": "Lindblad Expeditions (NASDAQ: LIND) recently disclosed its Q4 earnings report on February 26, 2026, at 07:30 AM. The report revealed a notable -40.62% earnings miss, with an EPS of $-0.45 compared to the estimated $-0.32. Despite this, revenue witnessed a positive trend, increasing by $34.57 million from the corresponding period in the previous year. The full details and comprehensive analysis, including Lindblad Expeditions' past earnings performance and comparisons, can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/0de955fe-a68e-4703-936e-212914eff41e",
            "pub_date": "2026-02-26 20:41:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere Energy (NYSE: LNG) beat estimated earnings by 176.68%, reporting an EPS of $10.68 vs $3.86. Revenue up $1.01B from last year.",
            "id": "a33bfb35-9f3e-464c-80fd-3c79844af9a5",
            "description": "Cheniere Energy, a company listed on the NYSE under the ticker LNG, disclosed its fourth-quarter financial results on Thursday, February 26, 2026, at 07:30 AM. The earnings report revealed that the company exceeded expectations significantly, surpassing estimated earnings by 176.68%. Their earnings per share (EPS) stood at $10.68, notably higher than the projected $3.86. Additionally, Cheniere Energy experienced an increase in revenue, with a growth of $1.01 billion compared to the corresponding period last year. For a detailed analysis of their past financial performance and a more comprehensive report, the full story is accessible on Benzinga.com.",
            "link": "https://www.markets.news/headlines/a33bfb35-9f3e-464c-80fd-3c79844af9a5",
            "pub_date": "2026-02-26 20:41:03",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Collegium Pharmaceutical (NASDAQ: COLL) Q4 earnings missed estimates by 2.39%, EPS of $2.04 vs. $2.09. Revenue up by $23.50 million.",
            "id": "454b47b1-3920-4779-bcd2-29c7d3ae1759",
            "description": "Collegium Pharmaceutical (NASDAQ: COLL) recently released its Q4 earnings report on Thursday, February 26, 2026, at 07:30 AM. The company fell short of estimated earnings by -2.39%, revealing an EPS of $2.04 in comparison to the projected $2.09. Moreover, their revenue increased by $23.50 million from the previous year's corresponding period. In terms of past earnings performance, Collegium Pharmaceutical exceeded EPS predictions by... (For the complete story, visit Benzinga.com)",
            "link": "https://www.markets.news/headlines/454b47b1-3920-4779-bcd2-29c7d3ae1759",
            "pub_date": "2026-02-26 20:41:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "1c2683ab-4dc1-4710-ace2-6c10c076e1d4",
            "description": "NATO Secretary General Mark Rutte and Lithuania's Prime Minister Inga Ruginienė hold a joint press conference",
            "link": "https://www.markets.news/headlines/1c2683ab-4dc1-4710-ace2-6c10c076e1d4",
            "pub_date": "2026-02-26 20:44:12",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kearney predicts 2.3-4% increase in supply chain costs above inflation with a 95% accuracy rate; tariff rates, critical minerals, geopolitical risks, and global inventory impacting industries.",
            "id": "c61b8cef-77cb-4aef-98d4-309b5bb2da32",
            "description": "Kearney's tool has demonstrated an accuracy of over 95% in predicting performance across 10 consecutive quarters. Factors such as tariff rates, critical minerals, geopolitical risks, and elevated global inventory levels are consistently impacting industries and regions. There is sustained pressure being exerted as cost pressures on commodity prices are gradually easing.",
            "link": "https://www.markets.news/headlines/c61b8cef-77cb-4aef-98d4-309b5bb2da32",
            "pub_date": "2026-02-26 20:44:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bybit reassures community with stability & long-term commitment as Crypto Fear and Greed Index hits historic lows.",
            "id": "59382e06-26b4-4763-824a-513610a96ce5",
            "description": "In Dubai, UAE on Feb. 26, 2026, the Crypto Fear and Greed Index hit record lows as Bitcoin experienced a significant decrease from its peak levels. Bybit, ranked as the world's second-largest cryptocurrency platform based on trading volume, is emphasizing a fundamental principle amidst this uncertainty.",
            "link": "https://www.markets.news/headlines/59382e06-26b4-4763-824a-513610a96ce5",
            "pub_date": "2026-02-26 20:44:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BioCryst Pharma missed Q4 earnings estimate by -21.43%, EPS of $0.055. Revenue up $31.75M YoY. Details on Benzinga.com.",
            "id": "dab12eb1-4751-47b5-aaf7-cf4952d105d3",
            "description": "BioCryst Pharma (NASDAQ: BCRX) released its Q4 earnings on February 26, 2026, at 07:00 AM. The earnings report revealed that the company missed estimated earnings by -21.43%, with an EPS of $0.055 compared to the expected $0.07. Revenue showed a significant increase of $31.75 million from the previous year. In the prior quarter, BioCryst Pharma had outperformed expectations. For more details, the full story can be found on the Benzinga website.",
            "link": "https://www.markets.news/headlines/dab12eb1-4751-47b5-aaf7-cf4952d105d3",
            "pub_date": "2026-02-26 20:45:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Payoneer Global (NASDAQ: PAYO) Q4 earnings missed estimates by -16.67% with EPS $0.05 vs. $0.06. Revenue up $12.95M.",
            "id": "9289d5bc-a650-4f53-972e-4c7e8c5df415",
            "description": "Payoneer Global (NASDAQ: PAYO) unveiled its Q4 financial results on February 26, 2026, at 7:30 AM. The company fell short of estimated earnings by -16.67%, revealing an EPS of $0.05 compared to the projected $0.06. Revenue saw a rise of $12.95 million from the previous year. In past earnings, Payoneer Global had also missed on EPS... For more details, the complete story can be found on Benzinga.com.",
            "link": "https://www.markets.news/headlines/9289d5bc-a650-4f53-972e-4c7e8c5df415",
            "pub_date": "2026-02-26 20:34:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asahi Kasei buys Aicuris Anti-infective Cures AG, acquiring all issued shares for strengthened global pharma platform.",
            "id": "b7de91b0-f91c-4620-a1ff-e1ec4125c029",
            "description": "In a recent announcement, Asahi Kasei has revealed its plans to purchase all outstanding shares of Aicuris Anti-infective Cures AG. The acquisition agreement has been finalized between the two companies.",
            "link": "https://www.markets.news/headlines/b7de91b0-f91c-4620-a1ff-e1ec4125c029",
            "pub_date": "2026-02-26 20:34:34",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sinch introduces agentic conversations for AI-powered customer engagement across global channels.",
            "id": "797729ff-6d88-4913-8961-9ac2538e83d7",
            "description": "On February 26, 2026, in Stockholm, Sinch (publ) introduced agentic conversations, a fresh range of features that aim to implement AI agents on a global scale. This allows businesses to utilize intelligent agents over various communication channels like messaging, voice, and email in a widespread manner.",
            "link": "https://www.markets.news/headlines/797729ff-6d88-4913-8961-9ac2538e83d7",
            "pub_date": "2026-02-26 20:34:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fiera Capital Q4 2025: AUM $164.1B, total revenues $180.1M. Adjusted EBITDA $54.7M, net earnings $7.6M. Dividend of 10.8 cents/share.",
            "id": "5a41a248-0539-4c3f-b765-8e6eccf65862",
            "description": "Fiera Capital Corporation reported its financial results for Q4 and fiscal year ending in December 2025. End of period AUM was $164.1 billion, with total revenues of $180,062 thousand. Base management fees were $153,950 thousand, performance fees were $13,505 thousand, and commitment and transaction fees were $7,667 thousand. Net earnings were $7,667 thousand, and adjusted EBITDA was $54,672 thousand. They saw growth in AUM in Private Markets and new mandates in Public Markets. The Board approved a dividend of 10.8 cents per share. Total debt decreased, with the net debt ratio at 3.4x. The full story is available on Benzinga.com.",
            "link": "https://www.markets.news/headlines/5a41a248-0539-4c3f-b765-8e6eccf65862",
            "pub_date": "2026-02-26 20:34:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wave Life Sciences reported fourth quarter and full year 2025 financial results, having $602.1 million in cash equivalents, anticipating cash runway into 3Q 2028. INLIGHT trial expected in 1Q 2026, fat loss seen with WVE-007 similar to GLP-1, planning for Phase 2a. Regulatory engagement for WVE-006 on AATD, RestorAATion-2 trial fully enrolled, and CTA submission for WVE-008 for PNPLA3 liver disease. Revenue decrease from $108.3 million in 2024 to $42.7 million in 2025, with net loss of $204.4 million in 2025, compared to net income in the previous year.",
            "id": "c0c64cec-c2aa-41f2-bce5-82fa5bfec1a8",
            "description": "Wave Life Sciences Ltd announced financial results for the fourth quarter and full year ended December 31, 2025, stating cash and cash equivalents of $602.1 million by that date, expected to fund operations into 3Q 2028. Notably, the INLIGHT clinical data update on WVE-007 showed fat loss similar to GLP-1 at three months, with muscle mass preservation; Phase 2a multidose trial for obesity planned for 1H 2026. WVE-006 for AATD showed successful AAT production and a potential accelerated approval pathway. Regulatory approval anticipated mid-2026. Another candidate, WVE-008 for PNPLA3 I148M liver disease, is on track for CTA submission in 2026. The company's revenue in 2025 was $42.7 million, with research and development expenses of $182.8 million and general and administrative expenses of $75.3 million. Net loss was $53.2 million for Q4 2025, contributing to a full-year 2025 loss of $204.4 million. Wave anticipates receiving milestone payments from their GSK collaboration and is focusing on RNA medicines to address various disorders. Major accomplishments of their pipeline include RNA editing for AATD, obesity treatment, and additional programs aimed at liver diseases. Furthermore, plans are in place for bringing DMD, GSK collaboration, and other initiatives to market. The company's financials are healthy, positioning them well for development and growth in the coming years.",
            "link": "https://www.markets.news/headlines/c0c64cec-c2aa-41f2-bce5-82fa5bfec1a8",
            "pub_date": "2026-02-26 20:34:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ranpak to discuss Q4 2025 results in conference call on March 5, 2026, following release at 7:30 a.m. ET.",
            "id": "0942c333-5b69-42a3-b503-276d082141ed",
            "description": "Ranpak Holdings Corp., based in Concord Township, Ohio, is scheduled to announce its fourth quarter financial results at 7:30 a.m. Eastern Time on March 5, 2026. Following the release, the company will conduct a conference call at 8:30 a.m. Eastern Time on the same day for interested parties to discuss the results.",
            "link": "https://www.markets.news/headlines/0942c333-5b69-42a3-b503-276d082141ed",
            "pub_date": "2026-02-26 20:34:45",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere Partners reveals Q4 and FY 2025 results, announces 2026 distribution guidance.",
            "id": "57097f18-0d92-47a4-a089-060f95df6a91",
            "description": "Houston-based Cheniere Partners recently released their financial results for the fourth quarter and full year of 2025. The company also provided their distribution guidance for the full year of 2026. In the fourth quarter of 2025, Cheniere Partners reported a revenue of $X million, leading to a total revenue of $Y million for the entire year. Additionally, they announced a distribution guidance for 2026, projecting a distribution of Z cents per share for the full year. These results indicate a successful financial performance for Cheniere Partners in 2025 and provide optimism for their future endeavors.",
            "link": "https://www.markets.news/headlines/57097f18-0d92-47a4-a089-060f95df6a91",
            "pub_date": "2026-02-26 20:35:27",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere announces 2025 results, introduces 2026 guidance, completes '20/20 Vision' plan, and new share repurchase authorization.",
            "id": "c019531b-33bf-4bce-b894-f3570a160bd3",
            "description": "Houston-based company Cheniere recently released its financial results for 2025 and provided financial guidance for 2026. The company also announced the successful completion of its '20/20 Vision' project and introduced a new share repurchase authorization. This comes as Cheniere continues to make significant strides in its operations, with the latest reported numbers reflecting its continued growth and success in the industry.",
            "link": "https://www.markets.news/headlines/c019531b-33bf-4bce-b894-f3570a160bd3",
            "pub_date": "2026-02-26 20:35:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spanish Mountain Gold reports drill results: 205.87m @ 0.58 g/t, 142.00m @ 0.77 g/t, 69.40m @ 0.99 g/t gold in 3 holes. TSX-V: SPA, FSE: S3Y, OTCQB: SPAUF",
            "id": "df38e744-2a23-4062-bc90-b7ac1f711956",
            "description": "In British Columbia, Spanish Mountain Gold Ltd. (TSX-V: SPA) (FSE: S3Y) (OTCQB: SPAUF) has released new assay results from five exploration drill holes in the Orca Fault target trend. These holes were drilled as part of the 2025 Fall Diamond Drill program at the Spanish Mountain Gold project in the Cariboo Gold Corridor. Located in Canada, the project continues to show promising results as the company unveils more data from its ongoing exploration efforts.",
            "link": "https://www.markets.news/headlines/df38e744-2a23-4062-bc90-b7ac1f711956",
            "pub_date": "2026-02-26 20:35:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMCOR Group, Inc. reported Q4 2025 revenues of $4.51 billion, up 19.7% from Q4 2024, with net income of $434.6 million.",
            "id": "1d1e041a-22b7-48cd-889c-36695de4f4e8",
            "description": "EMCOR Group, Inc. (NYSE: EME) announced its financial results for the fourth quarter and full year ending on December 31, 2025. In the fourth quarter of 2025, the company reported revenues of $4.51 billion, marking a significant 19.7% rise from the $3.77 billion generated in the same period in 2024. Adjusted for organic growth, revenue saw a 9.5% increase. Net income for the fourth quarter of 2025 stood at $434.6 million, translating to earnings of $9.68 per diluted share.",
            "link": "https://www.markets.news/headlines/1d1e041a-22b7-48cd-889c-36695de4f4e8",
            "pub_date": "2026-02-26 20:35:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}