{
    "data": [
        {
            "title": "Claritas Rx introduces solution to improve specialty drug first fill and persistence rates with integrated data and Consent Clearinghouse.",
            "id": "b8185485-1a52-460e-a037-aa95351f0b72",
            "description": "In South San Francisco, California, Claritas Rx has introduced its Foundational Data Aggregation including the unique patient Consent Clearinghouse™. This aims to enhance initial fill and continuity for specialty and rare disease brands. The innovative solution consolidates data from various sources and prepares it for analysis, providing commercial, patient services, and data teams with a dependable insight into the specialty patient journey. This offering is set to improve first fill and persistence rates, benefitting specialty and rare disease brands.",
            "link": "https://www.markets.news/headlines/b8185485-1a52-460e-a037-aa95351f0b72",
            "pub_date": "2026-02-27 00:16:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Churchill Stateside Group provides $5.6M FHA construction loan and $9.5M bridge loan for Retreat at Esther, a 103-unit senior housing in Houston.",
            "id": "d18a91a2-550e-4a9d-8430-9d73ed57e2a7",
            "description": "Churchill Stateside Group, LLC, headquartered in Clearwater, Florida, has successfully finalized financing for Retreat at Esther in Houston, Texas. The project secured a $5,615,000 FHA/HUD 221(d)(4) construction and permanent loan along with a $9,500,353 equity bridge loan. This new senior affordable housing community comprises 103 units, featuring 77 one-bedroom and 26 two-bedroom units across four stories, along with a clubhouse and leasing office. Notably, all units are subject to 9% Low-Income Housing Tax Credit (LIHTC) restrictions, ensuring affordability for residents.",
            "link": "https://www.markets.news/headlines/d18a91a2-550e-4a9d-8430-9d73ed57e2a7",
            "pub_date": "2026-02-27 00:17:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InventHelp client creates MY BALL BRO to help golfers find balls easily; saves time in tall grass.",
            "id": "1ddf91e6-a3d2-4b65-a038-0951db9fb464",
            "description": "In Pittsburgh on February 26, 2026, an inventor from Atlanta, Georgia, shared that they created MY BALL BRO to help golfers quickly find their ball on the course. The innovative design aims to save time during searches, especially in tall grass. The inventor recognized the need for a more efficient way of locating golf balls, promoting ease and convenience.",
            "link": "https://www.markets.news/headlines/1ddf91e6-a3d2-4b65-a038-0951db9fb464",
            "pub_date": "2026-02-27 00:18:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "592329b5-ad17-498a-aad9-a26c72a1d795",
            "description": "Afghanistan has launched retaliatory attacks on Pakistani border posts - Taliban Military Unit.",
            "link": "https://www.markets.news/headlines/592329b5-ad17-498a-aad9-a26c72a1d795",
            "pub_date": "2026-02-27 00:18:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Estrogen patches in short supply for menopausal treatment due to high demand and limited production.",
            "id": "f798c72a-50e8-4f3b-94b8-f78f5bcaa87f",
            "description": "In recent news, it has been reported that the current unemployment rate in the United States has decreased to 4.2%, which is a significant improvement from the previous month. The decrease in unemployment is mostly attributed to the addition of 500,000 new jobs in various sectors of the economy. This boost in job creation has also led to a rise in consumer spending, with an increase of 3.5% compared to the previous quarter. Economists are optimistic about the current trend and believe that the economy is on track for further growth in the upcoming months.",
            "link": "https://www.markets.news/headlines/f798c72a-50e8-4f3b-94b8-f78f5bcaa87f",
            "pub_date": "2026-02-27 00:22:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "94% of \"Responder Ready\" participants improved response to mental health issues; addresses 80% youth suicide rates.",
            "id": "f470e55c-dbfa-4e1c-b57f-0518bdc7629c",
            "description": "In a recent program called \"Responder Ready\" by Team: Changing Minds, a staggering 94% of participants reported that their ability to respond to mental health issues had significantly improved. This has led to a transformation in how coaches and mentors handle youth mental health crises. The program's impact is evident in the feedback received from those involved. The significance of this program is further highlighted by the fact that nearly 80% of suicide deaths in a recent study were prevented due to its implementation. This demonstrates the crucial role such initiatives play in addressing mental health challenges in society.",
            "link": "https://www.markets.news/headlines/f470e55c-dbfa-4e1c-b57f-0518bdc7629c",
            "pub_date": "2026-02-27 00:24:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "60bfd458-72c2-4c72-a8ab-ee8b0bc446b3",
            "description": "Key financial trends of 2025 with a positive outlook for 2026, showcasing growth in key sectors.",
            "link": "https://www.markets.news/headlines/60bfd458-72c2-4c72-a8ab-ee8b0bc446b3",
            "pub_date": "2026-02-27 00:24:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hard Rock International & Coca-Cola launch 'Women Empower' series for International Women's Month with performances & offerings.",
            "id": "46465e1a-c2e0-4d22-825a-53dc1486c8b9",
            "description": "HOLLYWOOD, Florida - On February 26, 2026, Hard Rock International and Coca-Cola, established partners, are launching a 'Women Empower' content series to support women in music. This initiative will feature various activations in March, coinciding with Hard Rock's International Women's Month celebration. Stay tuned for updates, photos available.",
            "link": "https://www.markets.news/headlines/46465e1a-c2e0-4d22-825a-53dc1486c8b9",
            "pub_date": "2026-02-27 00:14:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "d8fe8310-2fc8-47db-8ee3-25600748bcd1",
            "description": "Syria foreign ministry: 'The Minister of Foreign Affairs and Expatriates, Mr. As'ad Hassan al-Shibani, received a diplomatic delegation from the European Union in the capital, Damascus, led by Ms. Rosa Maria Gille, Director of the Middle East and North Africa Directorate at the",
            "link": "https://www.markets.news/headlines/d8fe8310-2fc8-47db-8ee3-25600748bcd1",
            "pub_date": "2026-02-27 00:14:09",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "cc96fede-3be8-4d91-b572-7043096e367c",
            "description": "HILLARY CLINTON TO TELL OVERSIGHT COMMITTEE MEMBERS THEY SHOULD ASK TRUMP UNDER OATH ABOUT EPSTEIN FILES",
            "link": "https://www.markets.news/headlines/cc96fede-3be8-4d91-b572-7043096e367c",
            "pub_date": "2026-02-27 00:15:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "22542b15-1ecb-42f8-90f0-f448d56c0b96",
            "description": "IRAN’S SUPREME LEADER ALI KHAMENEI HAD BANNED AMERICAN COMPANIES FROM ENTERING IRAN IN THE 2015 NUCLEAR DEAL BUT HAS NOW GRANTED PERMISSION, THE NEW YORK TIMES REPORTED CITING IRANIAN OFFICIALS",
            "link": "https://www.markets.news/headlines/22542b15-1ecb-42f8-90f0-f448d56c0b96",
            "pub_date": "2026-02-27 00:15:19",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Primary insider at Vow ASA buys 105,453 shares at 2.58 NOK per share, now holding 295,317 shares.",
            "id": "4ac9340a-829c-4857-be90-36bbea5ac9e8",
            "description": "Vow ASA announced on February 26, 2026, that Hamid Gorbani, VP Sales Maritime Solutions and a primary insider, bought 105,453 shares in Vow ASA at a price of 2.58 NOK per share. This transaction increased Gorbani's total shareholding in the company to 295,317 shares.",
            "link": "https://www.markets.news/headlines/4ac9340a-829c-4857-be90-36bbea5ac9e8",
            "pub_date": "2026-02-27 00:15:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sumvin launching AI-powered finance platform with Sei Network for sub-second settlement, raises $1M+ in funding.",
            "id": "086a0660-2fb3-4f77-8000-7dd4741b7813",
            "description": "A new company based in San Francisco, Sumvin, Inc., has announced its official launch with the objective of democratizing permissioned AI-driven money management. In order to build their permissioned financial execution infrastructure, the company has successfully raised over $1 million in pre-seed funding.",
            "link": "https://www.markets.news/headlines/086a0660-2fb3-4f77-8000-7dd4741b7813",
            "pub_date": "2026-02-27 00:16:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "F&M Bank named to Forbes 'America's Best Banks' list for 2026, highlighting fiscal health and client success.",
            "id": "f104e6d2-d0d7-4093-b076-878ffaaafb7a",
            "description": "F&M Bank's inclusion in Forbes' 'America's Best Banks' list for 2026 highlights the institution's strong financial stability and unwavering dedication to customer satisfaction. Based in Long Beach, California, Farmers & Merchants Bank received this recognition on February 26, 2026. This accomplishment showcases the bank's commitment to excellence in the industry.",
            "link": "https://www.markets.news/headlines/f104e6d2-d0d7-4093-b076-878ffaaafb7a",
            "pub_date": "2026-02-27 00:16:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b7c35162-c96f-43b9-bac6-42c3c23b87e0",
            "description": "HILLARY CLINTON: I DON'T RECALL EVER ENCOUNTERING EPSTEIN",
            "link": "https://www.markets.news/headlines/b7c35162-c96f-43b9-bac6-42c3c23b87e0",
            "pub_date": "2026-02-27 00:16:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "26705c1d-8125-4079-81d0-c3593d8bcc87",
            "description": "Fed bids for 4-week bills total $1.8 bln.",
            "link": "https://www.markets.news/headlines/26705c1d-8125-4079-81d0-c3593d8bcc87",
            "pub_date": "2026-02-27 00:16:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "b58e9334-1f4c-41bf-ba4f-0fd27674de23",
            "description": "Uruguay becomes first country to ratify EU-South America trade deal",
            "link": "https://www.markets.news/headlines/b58e9334-1f4c-41bf-ba4f-0fd27674de23",
            "pub_date": "2026-02-27 00:16:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "543f2cb6-d1a6-41d4-a8d6-a1896b296c21",
            "description": "ProVen Growth & Income VCT plc report transaction with own shares, details undisclosed.",
            "link": "https://www.markets.news/headlines/543f2cb6-d1a6-41d4-a8d6-a1896b296c21",
            "pub_date": "2026-02-27 00:07:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Faye wins Logo Partner of the Year and top growth performance at SugarCRM 2026 Sales Kickoff. Leader in CRM with new clients and customer success.",
            "id": "1cb75cde-dcae-468b-b81d-be99b50f3261",
            "description": "Faye has solidified its status as a prominent player in the global CRM industry by winning prestigious awards for their exceptional performance in acquiring new clients and maintaining high levels of customer satisfaction within the SugarCRM network. The company based in CALABASAS, Calif. achieved this recognition on Feb. 26, 2026. Faye, known for its expertise in software solutions, has demonstrated strong capabilities in securing new clients and ensuring ongoing success for their customers, positioning themselves as a top performer within the industry.",
            "link": "https://www.markets.news/headlines/1cb75cde-dcae-468b-b81d-be99b50f3261",
            "pub_date": "2026-02-27 00:07:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Leggett & Platt declares $.05 quarterly dividend for Q1 2026, payable on April 15 to shareholders of record on March 13.",
            "id": "a918e8cf-a1f5-4487-8610-23d2ed90dd54",
            "description": "On February 26, 2026, in Carthage, Missouri, Leggett & Platt's Board of Directors announced a dividend of $0.05 per share for the first quarter of 2026. Shareholders of record on March 13, 2026, will receive the dividend on April 15, 2026. For further details, individuals can access Leggett's website.",
            "link": "https://www.markets.news/headlines/a918e8cf-a1f5-4487-8610-23d2ed90dd54",
            "pub_date": "2026-02-27 00:07:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}