{
    "data": [
        {
            "title": "Navigara launches Performance Layer for Enterprise Engineering Teams with $2.5M funding to prove AI tools improve performance and ROI.",
            "id": "c16cf6c8-b774-48ef-a472-e920669a6c8c",
            "description": "In San Francisco on Feb. 28, 2026, a new performance layer for contemporary engineering is aiding leaders in verifying if AI tools genuinely enhance performance and return on investment. Despite engineering teams currently delivering a high volume of code, many leaders struggle to address critical queries on whether these improvements truly enhance performance and ROI.",
            "link": "https://www.markets.news/headlines/c16cf6c8-b774-48ef-a472-e920669a6c8c",
            "pub_date": "2026-02-28 13:54:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YOFC to unveil Hollow-Core Fibre solution at MWC Barcelona 2026, advancing optical connectivity with ultra-low latency technology. Strengthening global AI infrastructure.",
            "id": "9f223d24-0a79-491e-a7b7-85ad623e4486",
            "description": "In Barcelona, Spain on February 28, 2026, Yangtze Optical Fibre and Cable (YOFC) is set to present cutting-edge ultra-low latency optical communication technology, aiming to bolster the global AI network. This move reflects the company's commitment to advancing infrastructure for AI, with a focus on next-generation solutions. The event will feature YOFC's newest developments in optical technology, showcasing their dedication to innovation in the field.",
            "link": "https://www.markets.news/headlines/9f223d24-0a79-491e-a7b7-85ad623e4486",
            "pub_date": "2026-02-28 13:18:31",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ex-CEO of Mt. Gox proposes hard fork to retrieve 80K stolen Bitcoin after 12-year bankruptcy, calling it the final hurdle.",
            "id": "062ad568-067c-40a0-95de-ce6fab5ccb1a",
            "description": "Mark Karpelès recently mentioned that it has been 12 years since the commencement of Mt. Gox's bankruptcy proceedings, stating that this marks a significant milestone in the case. Karpelès expressed his belief that this could potentially be the final challenging aspect remaining to be resolved in relation to the case.",
            "link": "https://www.markets.news/headlines/062ad568-067c-40a0-95de-ce6fab5ccb1a",
            "pub_date": "2026-02-28 13:02:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cutting-edge geothermal tech to generate carbon-free power in Germany. Heading for environmental goals.",
            "id": "b492b3ed-fd57-45dd-b237-a778253b4456",
            "description": "In recent reports, it has been revealed that there has been a surge in unemployment rates, with a staggering increase of 2.3% in the last quarter. This rise has seen the total number of unemployed individuals reach a record high of 7.2 million. Additionally, the report highlights a concerning trend of job losses in various sectors, such as manufacturing and hospitality, with an estimated 300,000 jobs lost in these areas alone. The government has expressed their intentions to implement measures to address this concerning issue and provide support to those affected by the increase in unemployment.",
            "link": "https://www.markets.news/headlines/b492b3ed-fd57-45dd-b237-a778253b4456",
            "pub_date": "2026-02-28 13:04:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Futures drop below 50-day moving averages due to Trump's impact on market ETFs. S&P 500 shows strong stocks.",
            "id": "025d2a71-6917-4014-a29a-0a4cdcc421b7",
            "description": "Currently, the main stock market indexes are trading under their 50-day moving averages. Despite this, there is notable underlying strength in the market. President Trump's significant move has impacted market exchange-traded funds (ETFs), emphasizing the importance of keeping an eye on the hottest stocks in the S&P 500 index. The market conditions suggest a mixed trend, with key indexes pointing downward while individual stock performances may offer opportunities for investors.",
            "link": "https://www.markets.news/headlines/025d2a71-6917-4014-a29a-0a4cdcc421b7",
            "pub_date": "2026-02-28 12:49:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's path of democracy protects people's rights: CGTN report on Two Sessions highlights grassroots democracy and its impact.",
            "id": "a9b6264f-dbaa-4bed-b33c-24d423099ed9",
            "description": "Leading up to China's yearly significant political gatherings - the Two Sessions, a recent report discussed by CGTN details the functionality of China's full-scale participatory democracy at the local level and its role in protecting the rights and welfare of the citizens. This analysis offers in-depth insights into China's...",
            "link": "https://www.markets.news/headlines/a9b6264f-dbaa-4bed-b33c-24d423099ed9",
            "pub_date": "2026-02-28 12:12:24",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Monument Grills introduces Mesa II Gas Grill Series with innovative features at competitive prices, revolutionizing outdoor cooking.",
            "id": "2c337795-d81d-49ff-b6de-5242df37c122",
            "description": "Monument Grills, a renowned company in providing top-notch outdoor cooking equipment, revealed the introduction of the Mesa II Series on February 27, 2026, in Atlanta, Georgia. This new line stands out for its impressive features available at a competitive price point, notably including the exclusive Broil Zone™ searing technology.",
            "link": "https://www.markets.news/headlines/2c337795-d81d-49ff-b6de-5242df37c122",
            "pub_date": "2026-02-28 12:02:20",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DOJ attempts to delay legal fight for tariff refunds. President Trump hints at appealing to SCOTUS for tariff decision.",
            "id": "750364f3-42e3-401d-902c-9b445cc21fc1",
            "description": "Recently, President Trump took to social media to hint that he might make an effort to convince the Supreme Court to review and potentially overturn their decision against his tariffs.",
            "link": "https://www.markets.news/headlines/750364f3-42e3-401d-902c-9b445cc21fc1",
            "pub_date": "2026-02-28 11:56:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SQM's net income for 12 months ending Dec 31, 2025 is $588.1M ($2.06/share), compared to a $404.4M loss in 2024.",
            "id": "82a7351e-1f11-4fc1-ba85-be249a4c43f9",
            "description": "Chilean company Sociedad Química y Minera de Chile S.A. (SQM) disclosed its financial results for the twelve months up to December 31, 2025. The report indicated a net income of US$588.1 million, translating to US$2.06 per share. This marks a significant turnaround from the previous year's performance, where a loss of US$404.4 million, or US$1.42 per share, was reported for the same duration. SQM is listed on the NYSE under the ticker symbol SQM and on the Santiago Stock Exchange as SQM-B and SQM-A.",
            "link": "https://www.markets.news/headlines/82a7351e-1f11-4fc1-ba85-be249a4c43f9",
            "pub_date": "2026-02-28 11:56:06",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Investigation into Dream Finders Homes, Inc. Officers and Directors initiated by Kahn Swick & Foti, LLC. NY & NOLA. Feb 27, 2026.",
            "id": "179c4239-08a7-410f-9d18-0282cff964a2",
            "description": "A recent announcement on February 27, 2026, revealed that Kahn Swick & Foti, LLC (KSF) has launched a probe into Dream Finders Homes, Inc. (NYSE: DFH). The investigation is focusing on potential misconduct by Dream Finders' executives and board members, as well as its primary stockholder. KSF is examining allegations of wrongdoing within the company to ensure transparency and accountability.",
            "link": "https://www.markets.news/headlines/179c4239-08a7-410f-9d18-0282cff964a2",
            "pub_date": "2026-02-28 11:24:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trail Life USA praised Secretary Hegseth for recognizing its boy-focused program. CEO emphasizes character formation needs moral steadiness, not cultural reinvention. The Department of War to review youth organizations.",
            "id": "bbd699e3-2608-4c3f-95df-3c712bf43b14",
            "description": "Mark Hancock, the Chief Executive Officer, emphasized the necessity of moral consistency over societal transformation for character development. In Greenville, S.C. on February 27, 2026, he made this statement. Secretary Pete Hegseth's recent remarks suggested the Department of War's intention to meticulously assess youth groups to ensure adherence to guidelines.",
            "link": "https://www.markets.news/headlines/bbd699e3-2608-4c3f-95df-3c712bf43b14",
            "pub_date": "2026-02-28 10:58:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orvana Minerals reports Taguas exploration update, attending PDAC 2026 convention in Toronto at booth #2243.",
            "id": "ad1cd306-6d5f-4777-b9a4-b3a94d9fe568",
            "description": "Participating in the PDAC 2026 convention in Toronto from March 1-4, Orvana Minerals Corp. (TSX: ORV) will showcase its developments at booth #2243. The Company is excited to share exploration progress from Taguas, Argentina. The convention will be a platform for Orvana to present its latest achievements and engage with stakeholders.",
            "link": "https://www.markets.news/headlines/ad1cd306-6d5f-4777-b9a4-b3a94d9fe568",
            "pub_date": "2026-02-28 10:32:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Morgan Stanley seeks OCC bank charter to hold crypto assets; aims to debut Bitcoin, Ether, and Solana ETFs in January.",
            "id": "99003361-819c-4228-9469-dc4826ce97e4",
            "description": "In January, the prominent Wall Street bank has stepped up its expansion into the cryptocurrency sector by submitting applications to introduce exchange-traded funds (ETFs) for Bitcoin, Ether, and Solana.",
            "link": "https://www.markets.news/headlines/99003361-819c-4228-9469-dc4826ce97e4",
            "pub_date": "2026-02-28 10:07:17",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Cannabist Co. extends forbearance agreement with senior noteholders for 9.25% Sr. Secured Notes & 9.00% Sr. Secured Convertible Notes.",
            "id": "beb5b12a-5845-4a82-9cbf-ed801ecba45e",
            "description": "In Chelmsford, Massachusetts, The Cannabist Company Holdings Inc. revealed that the ad hoc group of noteholders of the Company’s 9.25% Senior Secured Notes due December 31, 2028 and the 9.00% Senior Secured Convertible Notes due December 31, 2028 (together known as the “Notes”), have made an announcement. The notes include $100 million of 9.25% Senior Secured Notes and $50 million of 9.00% Senior Secured Convertible Notes. The Cannabist Company is recognized as a prominent cultivator, manufacturer, and retailer of cannabis products in the US.",
            "link": "https://www.markets.news/headlines/beb5b12a-5845-4a82-9cbf-ed801ecba45e",
            "pub_date": "2026-02-28 09:58:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Purito Seoul launches 'From Soil to Seoul' slogan, 'Oat Latte Campaign' with major pop-up in NYC's West Village, date changed.",
            "id": "86395a9f-6282-4779-8a46-ebbde012c159",
            "description": "Purito Seoul has introduced its new brand slogan 'From Soil to Seoul' and initiated the 'Oat Latte Campaign.' The campaign includes a major pop-up event in New York's West Village. The announcement was made on 27-Feb-2026 by HINATURE INC. via PR Newswire. The company has updated the date for the pop-up event, indicating a shift in plans.",
            "link": "https://www.markets.news/headlines/86395a9f-6282-4779-8a46-ebbde012c159",
            "pub_date": "2026-02-28 09:53:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GoldMining Inc. files annual financial statements, MD&A, and Annual Information Form and Report on Form 40-F. TSX: GOLD, GLDG.",
            "id": "5fca8777-9cc6-47db-bef8-8302c92dc980",
            "description": "GoldMining Inc. (TSX: GOLD) (NYSE American: GLDG) based in Vancouver, BC, disclosed on Feb. 27, 2026, the submission of its yearly financial statements, management's discussion and analysis (\"MD&A\"), and annual information form (collectively referred to as \"Annual Filings\").",
            "link": "https://www.markets.news/headlines/5fca8777-9cc6-47db-bef8-8302c92dc980",
            "pub_date": "2026-02-28 09:41:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kirin Hyoketsu expands into US RTD market with 2 flavors - Strawberry and Pineapple. Launching in Hawaii, Tampa, FL, and EPCOT on March 2.",
            "id": "5a065e8a-b4bf-4a4a-b453-c69ebb01dd7d",
            "description": "New Belgium Brewing, a subsidiary of the Kirin Group focusing on alcoholic beverages in the U.S., is set to introduce two new flavors – KIRIN HYOKETSU STRAWBERRY and KIRIN HYOKETSU PINEAPPLE – as part of the KIRIN HYOKETSU (HYOKETSU) brand. These ready-to-drink cocktails will be produced and marketed by Kirin Brewery Company, Limited (Kirin Brewery). The launch is scheduled for March 2 in Hawaii, Tampa, FL, and The Japan Pavilion at EPCOT theme park, managed by Mitsukoshi (U.S.A.). The beverages have been crafted with a mix of American-inspired flavors.",
            "link": "https://www.markets.news/headlines/5a065e8a-b4bf-4a4a-b453-c69ebb01dd7d",
            "pub_date": "2026-02-28 09:33:21",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AgriBank reports strong financial results for Q4 2025 and full year, reflecting successful business model.",
            "id": "bf83ba49-a8d4-4c56-81f3-431d9f998da8",
            "description": "AgriBank, headquartered in St. Paul, Minnesota, revealed its financial outcomes for the final quarter and entire year of 2025, showcasing robust performance. The company's business model and the Association's accomplishments contributed to this success. The announcement was made on February 27, 2026, without specifying the exact figures.",
            "link": "https://www.markets.news/headlines/bf83ba49-a8d4-4c56-81f3-431d9f998da8",
            "pub_date": "2026-02-28 09:35:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FDA approves BioMarin's PALYNZIQ for adolescents 12+ with PKU, reduces blood Phe levels. Only approved enzyme substitution therapy.",
            "id": "4fec910e-34ca-42b7-a292-d8416253ba49",
            "description": "In the pivotal Phase 3 PEGASUS study, treatment using PALYNZIQ demonstrated a significant reduction in blood phenylalanine (Phe) levels compared to relying solely on dietary measures. This enzyme substitution therapy stands as the exclusive treatment approved for individuals with PKU. The study, conducted in SAN RAFAEL, Calif., unveiled these findings on February 27, 2026.",
            "link": "https://www.markets.news/headlines/4fec910e-34ca-42b7-a292-d8416253ba49",
            "pub_date": "2026-02-28 09:01:46",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8eea07ef-f689-4049-9016-0234c64dd4d8",
            "description": "Shareholders approve EQV Ventures Acquisition Corp.'s business combination with Presidio.",
            "link": "https://www.markets.news/headlines/8eea07ef-f689-4049-9016-0234c64dd4d8",
            "pub_date": "2026-02-28 09:02:05",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}