{
    "data": [
        {
            "title": "Cable One grants equity awards to new CEO James A. Holanda as an inducement for joining, per NYSE Rule 303A.08.",
            "id": "06c4ec35-9fa0-4027-a991-f8c8e95a05a6",
            "description": "In Phoenix, Cable One, Inc. revealed that it provided equity awards to James A. Holanda to secure his role as the Chief Executive Officer. The awards, granted as part of his employment agreement, align with the terms outlined in his offer letter. The Board of Directors and the Compensation and Talent Management Committee sanctioned these awards. Cable One, Inc. is listed on the NYSE under the ticker symbol CABO.",
            "link": "https://www.markets.news/headlines/06c4ec35-9fa0-4027-a991-f8c8e95a05a6",
            "pub_date": "2026-02-27 06:47:07",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix declines to raise offer for Warner Bros, despite Paramount Skydance's latest notice.",
            "id": "3aca71d6-2763-4203-9cb2-bbe549fc85fc",
            "description": "In Hollywood, California, on February 26, 2026, Netflix, Inc. revealed that it will not increase its bid for Warner Bros. This decision came after Warner Bros. Discovery informed Netflix that its Board of Directors had chosen not to pursue Paramount Skydance's latest offer. No specific numbers were provided regarding the bids or offers.",
            "link": "https://www.markets.news/headlines/3aca71d6-2763-4203-9cb2-bbe549fc85fc",
            "pub_date": "2026-02-27 06:47:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sirius XM Radio LLC prices a $1.25B offering of 5.875% Senior Notes due 2032, an increase from the initial amount.",
            "id": "a05f060c-7af5-42f3-8fda-7f3d5caf19cf",
            "description": "On February 26, 2026, Sirius XM Holdings Inc. (NASDAQ: SIRI) revealed that its subsidiary, Sirius XM Radio LLC, set the price for an offering of $1,250,000,000 of 5.875% Senior Notes due 2032. This marks a significant uptick in the company's financial activities.",
            "link": "https://www.markets.news/headlines/a05f060c-7af5-42f3-8fda-7f3d5caf19cf",
            "pub_date": "2026-02-27 06:47:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flutter Entertainment stock hits 52-week lows, with Q4 revenue at $4.74 billion, missing estimate. U.S. segment's market shares: 41% (online sportsbooks) and 28% (iGaming).",
            "id": "a8ab6d18-2729-4a7b-b2fd-3a8baa0d43c3",
            "description": "Flutter Entertainment, a sports betting and iGaming company listed on NYSE under the symbol FLUT, released its Q4 financial report after market closure. The highlights reveal that the company's Q4 revenue stood at $4.74 billion, marking a 25% increase from the previous year but falling short of the estimated $4.97 billion. Earnings per share for the quarter were reported at $1.74, also lower than the projected $1.99. Flutter recorded a 3% rise in average monthly players to 15.07 million year-over-year. In the U.S. market, Flutter's segment with FanDuel claimed a 41% and 28% market share for online sportsbooks and iGaming, respectively. The U.S. segment saw a 33% revenue increase in Q4, driven by a 35% surge in sportsbook revenue and 32% growth in iGaming revenue. Meanwhile, international revenue witnessed a 17% rise year-over-year, with a 6% increase in sportsbook revenue. Despite these figures, Flutter Entertainment's shares are notably approaching crucial lows, prompting concerns among investors.",
            "link": "https://www.markets.news/headlines/a8ab6d18-2729-4a7b-b2fd-3a8baa0d43c3",
            "pub_date": "2026-02-27 06:48:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nutrien Ltd. (TSX: NTR) approved to repurchase up to 5% of its common shares through NCIB program, per TSX.",
            "id": "0552d26c-02b9-4d7e-9660-b394f631bd4f",
            "description": "Nutrien Ltd. revealed in a statement today that it has gained approval from the Toronto Stock Exchange (TSX) to initiate a normal course issuer bid (NCIB). The bid allows the company to buy back up to five percent of its existing common shares. Nutrien will conduct purchases through the TSX, New York Stock Exchange, or alternative trading systems in Canada and the U.S. The company's common shares are listed on both the TSX and NYSE under the ticker symbol NTR.",
            "link": "https://www.markets.news/headlines/0552d26c-02b9-4d7e-9660-b394f631bd4f",
            "pub_date": "2026-02-27 06:50:37",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones futures decrease; Nvidia affects AI stocks, while S&P 500 maintains key support. Mixed session.",
            "id": "5afab4d4-73ca-4a1d-bc94-858f41cfd51f",
            "description": "Nvidia experienced a significant downturn on Thursday which had a negative impact on chip and AI stocks. Despite this, the S&P 500 managed to maintain crucial support levels in a session that reflected a mixture of outcomes. Dow Jones Futures also saw a decline, with Nvidia playing a significant role in the drop observed in AI stocks. However, the S&P 500's ability to retain key support levels highlighted a certain level of stability amidst the fluctuations in the market.",
            "link": "https://www.markets.news/headlines/5afab4d4-73ca-4a1d-bc94-858f41cfd51f",
            "pub_date": "2026-02-27 06:51:30",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq drops as Nvidia plunges post-earnings, chip spinoff soars. Stock indexes turn lower Thursday.",
            "id": "a9911dd6-4ee6-41b4-9f25-b56a29953e9b",
            "description": "On Thursday, stock indexes experienced a decline, primarily due to Nvidia stock retracting following an increase post-earnings. The Nasdaq dropped as Nvidia plunged, but a chip spinoff saw a significant rise.",
            "link": "https://www.markets.news/headlines/a9911dd6-4ee6-41b4-9f25-b56a29953e9b",
            "pub_date": "2026-02-27 06:51:32",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Criminal Defense Attorney Finn Skovdal advises on first-time DUI cases in Montgomery County, HelloNation reports.",
            "id": "9ce9e81b-034d-4f66-a5fd-11a417ce3bef",
            "description": "In Fort Washington, Pennsylvania, on February 26, 2026, PRNewswire shared details about understanding the implications of a first-time DUI offense in Montgomery County. Criminal Defense Attorney Finn Skovdal from Skovdal Law provided insights in a HelloNation article. When confronted with a first DUI in the county, individuals may experience uncertainty about the next steps. Skovdal outlined the potential consequences and legal process involved in such cases, shedding light on what individuals can anticipate when facing this situation for the first time.",
            "link": "https://www.markets.news/headlines/9ce9e81b-034d-4f66-a5fd-11a417ce3bef",
            "pub_date": "2026-02-27 06:41:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Red Dot Buildings in Athens, Texas, announces sales leadership changes to strengthen their leading position.",
            "id": "7fe58fe4-0ba1-450d-a0ad-d086922f2f6f",
            "description": "In a press release dated Feb. 26, 2026, based in Athens, Texas, Red Dot Buildings revealed changes to its sales leadership team in efforts to enhance its dominant market position after experiencing over ten years of substantial growth. The company aims to build on the momentum gained during this period.",
            "link": "https://www.markets.news/headlines/7fe58fe4-0ba1-450d-a0ad-d086922f2f6f",
            "pub_date": "2026-02-27 06:45:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NHC reported 2025 earnings of $1,517,781,000, a 16.1% increase from 2024. 8.4% increase in same-facility net operating revenues.",
            "id": "caeacbb7-9e2c-46aa-912b-3056e00f51d6",
            "description": "In Murfreesboro, Tennessee, National HealthCare Corporation revealed that their net operating revenues and grant income for the year ended December 31, 2025, reached $1,517,781,000, showing a notable increase from $1,307,382,000 in the previous year. This represents a significant growth of 16.1% year-over-year. The rise in net operating revenues in 2025 was primarily driven by an 8.4% surge in same-facility net operating revenues compared to the figures in 2024. National HealthCare Corporation is recognized as the oldest publicly traded senior health care company in the United States, trading on the NYSE American under the ticker symbol NHC.",
            "link": "https://www.markets.news/headlines/caeacbb7-9e2c-46aa-912b-3056e00f51d6",
            "pub_date": "2026-02-27 06:36:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Klarna Group plc reports Full Year 2025 results: GMV $127.9B, Revenue $3.5B, Operating Profit $65M, EPS $(0.79)FY, $(0.12)Q4.",
            "id": "2f54c19c-69ef-43c2-af95-a586b34ff792",
            "description": "In New York, Klarna Group plc (NYSE: KLAR) has released its full year 2025 financial results up to December 31, 2025. The detailed results are accessible on Klarna's Investor Relations site at https://investors.klarna.com/. Highlights of the full year 2025 include a Gross Merchandise Volume (GMV) of $127.9 billion, marking a 22% year-on-year increase. Total Revenue reached $3.5 billion, demonstrating a 25% year-on-year growth. The company reported an Adjusted Operating Profit of $65 million with an adjusted operating margin of 1.9%. For the fiscal year 2025, the Basic / Diluted Earnings Per Share (EPS) stood at $(0.79), while the Q4 EPS was $(0.12). Additionally, the report indicated the annual earnings per share were based on 118 million shares.",
            "link": "https://www.markets.news/headlines/2f54c19c-69ef-43c2-af95-a586b34ff792",
            "pub_date": "2026-02-27 06:36:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NuScale (NYSE: SMR) stock slips despite Q4 earnings beat. Losses narrowed to 8 cents/share, revenue at $1.81 million. More on Benzinga.com.",
            "id": "f3708273-b991-4959-8e55-65ecff17ec4e",
            "description": "Shares of NuScale Power Corp (NYSE: SMR) declined in after-hours trading on Thursday following the release of its fourth-quarter earnings report. The company reported a quarterly loss of eight cents per share, surpassing the estimated loss of 13 cents according to Benzinga Pro data. Quarterly revenue totaled $1.81 million. For the full year, NuScale reported revenue of... For a comprehensive outline, refer to the full story on Benzinga.com.",
            "link": "https://www.markets.news/headlines/f3708273-b991-4959-8e55-65ecff17ec4e",
            "pub_date": "2026-02-27 06:36:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MacroGenics, a biopharmaceutical company (Nasdaq: MGNX) will participate in investor conferences in March.",
            "id": "d8299f57-2b17-4b19-92fe-dc5effd4e5df",
            "description": "MacroGenics, Inc., a biopharmaceutical company concentrating on creating cutting-edge antibody-based therapeutics for cancer treatment, revealed today that its management team will be involved in upcoming investor conferences in March. The company, listed as Nasdaq: MGNX, is based in Rockville, MD, and made the announcement on Feb. 26, 2026.",
            "link": "https://www.markets.news/headlines/d8299f57-2b17-4b19-92fe-dc5effd4e5df",
            "pub_date": "2026-02-27 06:31:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Algoma Steel Group Inc. will reveal its 2025 Q4 and full year financial results on March 11, 2026; webcast follows on March 12 at 11 am ET.",
            "id": "29b88c08-7936-4ec2-8f26-e3af43eb87eb",
            "description": "Algoma Steel Group Inc., a major Canadian steel producer, will unveil its financial performance for the fourth quarter and full year of 2025 on March 11, 2026, post-market closure. The company's stocks ASTL on NASDAQ and TSX will likely be impacted. The results will be reviewed in a webcast and conference call on March 12, 2026, at 11:00 a.m. Eastern Time, where recent developments will be discussed, and a Q&A session will be conducted.",
            "link": "https://www.markets.news/headlines/29b88c08-7936-4ec2-8f26-e3af43eb87eb",
            "pub_date": "2026-02-27 06:31:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intuit Inc beats Q2 revenue estimates with $4.65 billion, adjusted earnings of $4.15 per share, leading to stock slide.",
            "id": "bb59c2ac-a2fd-4f90-8198-f009a8997340",
            "description": "Intuit Inc (NASDAQ: INTU) released its financial results for the second quarter of fiscal 2026 after the market closed on Thursday. The company reported second-quarter revenue of $4.65 billion, surpassing analyst expectations of $4.53 billion. Additionally, Intuit's adjusted earnings for the quarter were $4.15 per share, higher than the estimated $3.66 per share. This performance led to a 17% increase in total revenue. However, despite these positive results, Intuit stock is currently experiencing a decline. Visit Benzinga.com for the complete story.",
            "link": "https://www.markets.news/headlines/bb59c2ac-a2fd-4f90-8198-f009a8997340",
            "pub_date": "2026-02-27 06:32:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chondrosarcoma market projected to grow (2026-2036) due to better treatments, diagnosis, emerging therapies.",
            "id": "43e63e6c-d965-4856-91a8-ed7712efd963",
            "description": "The market for chondrosarcoma is projected to experience growth between 2026 and 2036 due to factors such as enhanced diagnostic methods, advancements in treatment options, heightened awareness, and the introduction of new therapies like Ozekibart (INBRX-109) by Inhibrx Biosciences and TIBSOVO (ivosidenib) by Servier. These developments are expected to drive the market forward, leading to increased opportunities and potential for advancements in the treatment of chondrosarcoma.",
            "link": "https://www.markets.news/headlines/43e63e6c-d965-4856-91a8-ed7712efd963",
            "pub_date": "2026-02-27 06:33:23",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "2aa92a64-8dee-4386-8dd1-2da5287ec728",
            "description": "ANTHROPIC REJECTS PENTAGON'S \"FINAL OFFER\" IN AI SAFEGUARDS FIGHT - AXIOS",
            "link": "https://www.markets.news/headlines/2aa92a64-8dee-4386-8dd1-2da5287ec728",
            "pub_date": "2026-02-27 06:33:25",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "42f09e80-4119-40c7-8a24-c02109e7661b",
            "description": "NICOLAS MADURO INTENDS TO FILE MOTION TO DISMISS US CRIMINAL CASE, CITING DUE PROCESS VIOLATIONS - FILING",
            "link": "https://www.markets.news/headlines/42f09e80-4119-40c7-8a24-c02109e7661b",
            "pub_date": "2026-02-27 06:35:14",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "bf8da125-e1f2-46f0-9db7-3f7afad0073b",
            "description": "ANTHROPIC CEO DARIO AMODEI ON THURSDAY SAID THERE HAS BEEN \"VIRTUALLY NO PROGRESS\" ON NEGOTIATIONS WITH THE PENTAGON - AXIOS",
            "link": "https://www.markets.news/headlines/bf8da125-e1f2-46f0-9db7-3f7afad0073b",
            "pub_date": "2026-02-27 06:35:15",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "73b25ff6-3d1e-46c8-9401-87c72d93ec13",
            "description": "U.S. HOUSE OVERSIGHT PANEL CHAIRMAN COMER: HILLARY CLINTON ANSWERED OUR QUESTIONS; WILL TRY TO GET VIDEO AND TRANSCRIPT OUT QUICKLY",
            "link": "https://www.markets.news/headlines/73b25ff6-3d1e-46c8-9401-87c72d93ec13",
            "pub_date": "2026-02-27 06:35:16",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}