{
    "data": [
        {
            "title": "",
            "id": "b68f8dcc-42e3-4f7b-9ff4-04734ce9b2c3",
            "description": "TRUMP OPEN TO TALKS WITH NORTH KOREA’S KIM AS AT LEAST ONE US CITIZEN IS KILLED IN CUBA BOAT SHOOTOUT INVOLVING STOLEN VESSEL – YONHAP, AXIOS",
            "link": "https://www.markets.news/headlines/b68f8dcc-42e3-4f7b-9ff4-04734ce9b2c3",
            "pub_date": "2026-02-27 04:56:58",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Centerline is designing pickleball-specific apparel for fast-paced play; caters to quick pivots, lateral movement, and stop-and-go action.",
            "id": "b104b6ab-e733-457d-9d5f-14ee6701d609",
            "description": "In San Diego on February 9, 2026, Centerline is developing apparel tailored for the high-paced nature of pickleball games. The sport demands more from clothing than commonly understood, with extended rallies, continuous lateral movements, rapid pivots, and frequent stop-and-go maneuvers. The focus is on designing gear that can sustain the demands of pickleball's fast-paced nature.",
            "link": "https://www.markets.news/headlines/b104b6ab-e733-457d-9d5f-14ee6701d609",
            "pub_date": "2026-02-27 04:57:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "225 Sysco drivers and warehouse workers in Montana secure 33% wage increase, better benefits in new five-year contract with Teamsters Local 2, 120, and 190.",
            "id": "aae10ce0-6727-4ff8-8f86-8fad1a063dc4",
            "description": "Over 225 drivers and warehouse employees at Sysco in Montana, who are represented by Teamsters Local 2, 120, and 190, have successfully negotiated a new five-year collective bargaining agreement. This agreement includes a substantial 33% wage increase and enhancements to their benefits package.",
            "link": "https://www.markets.news/headlines/aae10ce0-6727-4ff8-8f86-8fad1a063dc4",
            "pub_date": "2026-02-27 04:57:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Children’s Hospital LA launches 11th annual Make March Matter campaign to raise $1 million for children’s healthcare.",
            "id": "7d9dd9b8-3876-40ee-9725-ad2d6af1c62f",
            "description": "Los Angeles - Children’s Hospital Los Angeles (CHLA) has initiated its 11th annual Make March Matter campaign, starting off with an event supported by actor and CHLA advocate John Stamos. The goal of the month-long fundraising effort is to bring in $1 million or more during March to aid children’s health in Los Angeles. This campaign brings together local businesses and the community to raise awareness and funds for the cause. The collaborative effort aims to make a significant impact on children’s healthcare in the region.",
            "link": "https://www.markets.news/headlines/7d9dd9b8-3876-40ee-9725-ad2d6af1c62f",
            "pub_date": "2026-02-27 04:51:13",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "3a074840-c58b-4dc5-a750-54b35c20ad62",
            "description": "Nvidia CEO Huang on Fox Business: Nvidia is Micron's largest customer. $NVDA $MU",
            "link": "https://www.markets.news/headlines/3a074840-c58b-4dc5-a750-54b35c20ad62",
            "pub_date": "2026-02-27 04:53:42",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lineweaver Wealth Advisors hits $1 billion in assets under management, a milestone since its inception 25 years ago.",
            "id": "200d34c9-39a5-42f3-aa5c-27a06f5626cf",
            "description": "On February 26, 2026, Lineweaver Wealth Advisors revealed a major achievement by exceeding $1 billion in assets under management. Lineweaver Financial Group, established almost 25 years ago, serves as the enduring affiliate of Lineweaver.",
            "link": "https://www.markets.news/headlines/200d34c9-39a5-42f3-aa5c-27a06f5626cf",
            "pub_date": "2026-02-27 04:55:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ba658a33-5508-4373-b286-7aa806b66461",
            "description": "CUBAN FOREIGN MINISTRY OFFICIAL SAYS CUBA HAD BEEN IN CONTACT WITH US STATE DEPT AND COAST GUARD SINCE SPEEDBOAT INCIDENT",
            "link": "https://www.markets.news/headlines/ba658a33-5508-4373-b286-7aa806b66461",
            "pub_date": "2026-02-27 04:41:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "ac4d0f81-fa0e-4885-b7cc-f148918d818b",
            "description": "CUBA SAYS ANTI-CUBAN GROUPS IN US HAVE OPERATED WITH IMPUNITY",
            "link": "https://www.markets.news/headlines/ac4d0f81-fa0e-4885-b7cc-f148918d818b",
            "pub_date": "2026-02-27 04:41:56",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mollie Williams to lead National Mobile Health Policy Center at Mission Mobile Medical Group, advancing access nationwide.",
            "id": "23219beb-7635-4b89-b989-6e7a8601e7b6",
            "description": "In Kernersville, North Carolina, Mission Mobile Medical Group revealed the appointment of Mollie Williams, DrPH, MPH, to head the newly established National Mobile Health Policy Center. This initiative aims to promote policies facilitating mobile health programs in providing care nationwide. The Policy Center is set to be a central repository for knowledge and analysis, translating practical insights from mobile health initiatives into policy recommendations to enhance access.",
            "link": "https://www.markets.news/headlines/23219beb-7635-4b89-b989-6e7a8601e7b6",
            "pub_date": "2026-02-27 04:42:08",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "83221e1f-e1a3-4862-9fe7-a06b73ae3a5d",
            "description": "MEXICAN PRESIDENT SHEINBAUM SAYS COCA-COLA CEO INFORMED HER OF $6 BLN INVESTMENT IN MEXICO",
            "link": "https://www.markets.news/headlines/83221e1f-e1a3-4862-9fe7-a06b73ae3a5d",
            "pub_date": "2026-02-27 04:43:00",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "6c037e79-d9d2-484f-b117-06d27fca7b9a",
            "description": "Caesars considering sale amid takeover offers, including bid from Fertitta Entertainment. #businessnews",
            "link": "https://www.markets.news/headlines/6c037e79-d9d2-484f-b117-06d27fca7b9a",
            "pub_date": "2026-02-27 04:44:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Andakin Ventures invests in Hibachi Worldwide to expand in-home hibachi industry globally. #Vail #investment #AndakinVentures #HibachiWorldwide",
            "id": "0e760dc9-9e37-40aa-bbce-4d527ed74160",
            "description": "On February 26, 2026, a growth investment was made by Andakin Ventures towards Hibachi Worldwide, a company specializing in the consolidation and scaling of the in-home hibachi market. With a focus on global acquisitions and expansion, Hibachi Worldwide is strategically positioned to capitalize on the fast-growing private hibachi sector. For more information, visit www.AndakinVentures.com.",
            "link": "https://www.markets.news/headlines/0e760dc9-9e37-40aa-bbce-4d527ed74160",
            "pub_date": "2026-02-27 04:45:48",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anthem Foundation invests $12M in NY for health outcomes by 2025 through grants and community engagement.",
            "id": "6d77c34b-9dea-4b45-b277-a6df5d017def",
            "description": "The Anthem Blue Cross and Blue Shield Foundation allocated $12 million in funding to support initiatives in New York in 2025. This investment aimed to enhance health outcomes and bolster local communities through various strategies like grantmaking and engaging the community. According to Dr. Christy V, the focus in New York is on collaborating with local partners and backing solutions initiated by the community to address enduring health issues faced by families and individuals.",
            "link": "https://www.markets.news/headlines/6d77c34b-9dea-4b45-b277-a6df5d017def",
            "pub_date": "2026-02-27 04:48:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neurizon begins dosing NUZ-001 in HEALEY ALS Trial; first of 160 participants in 36-week trial evaluating drug for ALS.",
            "id": "9cdb47dd-d13b-4bac-a55e-23417eec4ca2",
            "description": "Key Points: The first individual has been enrolled and administered NUZ-001 in Regimen I of the HEALEY ALS Platform Trial, which assesses the drug's efficacy in treating ALS. Around 160 ALS patients are expected to participate in this 36-week randomized, double-blind, placebo-controlled Phase 2/3 trial. ",
            "link": "https://www.markets.news/headlines/9cdb47dd-d13b-4bac-a55e-23417eec4ca2",
            "pub_date": "2026-02-27 04:37:41",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Playa Bowls signs 3 multi-unit agreements, approaching 400 shops nationwide. Strong growth seen in 2026.",
            "id": "26d3c12b-8a0a-49f4-8394-84cfcb0e4b62",
            "description": "In 2026, Playa Bowls, the top superfruit bowl brand in the nation, is experiencing significant growth with a robust development pipeline and an expanding franchise network. Based in BELMAR, N.J., the company is accelerating its expansion with strong momentum. The brand specializes in superfruit and acai bowl offerings, positioning itself as a leader in the industry. This growth is evidenced by the increasing number of franchises and new locations being opened. With a focus on providing healthy and delicious options, Playa Bowls is poised for further success in the market.",
            "link": "https://www.markets.news/headlines/26d3c12b-8a0a-49f4-8394-84cfcb0e4b62",
            "pub_date": "2026-02-27 04:37:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dental.com and Voicify partner to provide 24/7 patient access for DSOs, offering integrated voice AI capabilities.",
            "id": "190806d6-83a4-41f6-b430-a7e8faeb2170",
            "description": "In Irvine, California, Dental.com, a virtual dental care platform by Virtual Dental Care, Inc., has partnered with Voicify, a voice AI platform for dental practices and DSOs. This collaboration aims to provide a comprehensive, round-the-clock patient acquisition and conversion solution for DSOs and multi-site dental groups. By integrating Dental.com's virtual care, patient acquisition, and AI-driven engagement tools with Voicify's direct and PMS-integrated voice AI system, the partnership seeks to enhance the operations of dental organizations. This strategic alliance will offer a seamless and advanced approach to acquiring and converting patients, ensuring a more efficient and effective process.",
            "link": "https://www.markets.news/headlines/190806d6-83a4-41f6-b430-a7e8faeb2170",
            "pub_date": "2026-02-27 04:40:59",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Media Trust creates Product Advisory Council to combat digital threats; Council includes leaders from Amazon, Microsoft, Disney, and more.",
            "id": "4c232aca-d54e-4098-a1c2-f9e75556b9bc",
            "description": "In McLean, Virginia, The Media Trust (TMT) recently hosted the first meeting of its Product Advisory Council, aimed at tackling rising digital threats. Senior leaders from various companies in the advertising technology sector, such as Microsoft, Amazon, Index Exchange, Freestar, BBC, Criteo, Simpli.fi, NewsUK, Disney, The Trade Desk, Mail Metro Media, and Future, gathered to strategize on combatting these threats. The council aims to coordinate efforts against digital threats and protect the online ecosystem.",
            "link": "https://www.markets.news/headlines/4c232aca-d54e-4098-a1c2-f9e75556b9bc",
            "pub_date": "2026-02-27 04:41:02",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Book \"Robert Goddard's Massachusetts\" released Mar 3 honors the centennial of the world's first modern rocket launch.",
            "id": "d62ac5be-4e1a-43a4-909d-710eee97b5d6",
            "description": "The book \"Robert Goddard's Massachusetts,\" written by Lowell Observatory Historian Kevin Schindler and Charles Slatkin, is set to be launched on March 3. This comes as Flagstaff, Arizona, prepares to mark the centenary of Robert H. Goddard's pioneering achievement in launching the world's inaugural liquid-fuel rocket. The date of release is February 26, 2026, and the landmark event was pivotal in pushing advancements in space exploration.",
            "link": "https://www.markets.news/headlines/d62ac5be-4e1a-43a4-909d-710eee97b5d6",
            "pub_date": "2026-02-27 04:31:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "American Water urges customers to update contact information for emergency alerts. Largest utility in U.S. (NYSE: AWK).",
            "id": "9aac3ca3-a655-4fbd-854d-2b5199c64847",
            "description": "American Water, the leading water and wastewater utility company in the U.S., advises customers to promptly update their contact details to receive crucial service alerts. It is essential for customers to ensure receipt of emergency notifications. The company, listed under the NYSE as AWK, emphasizes the importance of staying connected for their services.",
            "link": "https://www.markets.news/headlines/9aac3ca3-a655-4fbd-854d-2b5199c64847",
            "pub_date": "2026-02-27 04:31:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deltix platform now integrates with AX Perpetual Futures Exchange, correcting previous news. ",
            "id": "44b6d46f-63a1-4423-8bd6-62775a97a39d",
            "description": "On February 25, 2026, Architect Financial Technologies Inc announced the integration of Deltix Trading Platform with AX Perpetual Futures Exchange. The collaboration aims to enhance trading efficiency and provide advanced functionalities to users. The update in the headline of the news release indicates the strategic partnership between the two companies. This integration is set to revolutionize the trading experience for users by combining cutting-edge technology and financial expertise. Stay tuned for more updates on this promising collaboration.",
            "link": "https://www.markets.news/headlines/44b6d46f-63a1-4423-8bd6-62775a97a39d",
            "pub_date": "2026-02-27 04:33:38",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}