{
    "data": [
        {
            "title": "ERLY Skincare reaches milestone of one year, fueled by loyal customers and grassroots support in Austin.",
            "id": "3b47bc06-acc8-4e1e-b6d7-11d5c7ff22ad",
            "description": "ERLY Skincare, an acclaimed brand headquartered in Austin, has reached a significant milestone year due to its loyal customer base, strong grassroots support, and the introduction of innovative initiatives. As of February 27, 2026, the company commemorates its one-year anniversary, demonstrating a year's worth of revolutionary progress in redefining skincare standards.",
            "link": "https://www.markets.news/headlines/3b47bc06-acc8-4e1e-b6d7-11d5c7ff22ad",
            "pub_date": "2026-02-28 01:56:26",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BioArctic AB issued 78,000 Class B shares on Feb 27, 2026; total number of shares and votes.",
            "id": "68d70d43-6043-4d9c-8fa6-a17ad0cda265",
            "description": "Today, BioArctic AB (publ) (Nasdaq Stockholm: BIOA B) revealed that they had distributed 78,000 Class B shares in February as part of the 2019/2028 stock option program approved at the Annual General Meeting in May.",
            "link": "https://www.markets.news/headlines/68d70d43-6043-4d9c-8fa6-a17ad0cda265",
            "pub_date": "2026-02-28 01:58:29",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MARA stock rises 10% after $1.7B loss from Bitcoin writedowns; pivoting to AI infrastructure partnership. Q4 revenue down 6%.",
            "id": "8709a3a4-b4ac-4249-a647-52d93da575dc",
            "description": "MARA Holdings (NASDAQ: MARA) saw a remarkable 10% surge following the announcement of a partnership with Starwood Digital Ventures to convert mining sites for AI infrastructure. This surge comes in the wake of a Q4 loss of $1.7 billion due to Bitcoin (CRYPTO: BTC) writedowns. The $1.7 billion net loss for Q4 represents a significant drop from the $528.3 million net income reported a year earlier. A substantial decrease in the fair value of Bitcoin holdings by $1.5 billion negated any operating gains, coinciding with BTC's price drop from $114,068 at the end of Q3 to $87,498 by December 31. Revenue also took a hit in Q4, falling by 6% to $202.3 million from $214.4 million in Q4 2024, propelled by a 14% decline in the average price of Bitcoin mined during that period. Despite this, the full-year revenue experienced a notable 38% growth to $907.1 million. However, this positive full-year growth was overshadowed by the massive quarterly writedown. MARA currently holds 53,822 BTC with an estimated value of approximately $4.7 billion.",
            "link": "https://www.markets.news/headlines/8709a3a4-b4ac-4249-a647-52d93da575dc",
            "pub_date": "2026-02-28 01:58:35",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "8a4d3a39-75a1-4daa-8575-219faa888f35",
            "description": "Trump on Iran: Additional talks today.",
            "link": "https://www.markets.news/headlines/8a4d3a39-75a1-4daa-8575-219faa888f35",
            "pub_date": "2026-02-28 01:59:39",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "816530e9-eb51-4651-83bb-d210480503a5",
            "description": "TRUMP ON LUTNICK, EPSTEIN PROBE:HE'LL DO WHATEVER HE HAS TO SAY",
            "link": "https://www.markets.news/headlines/816530e9-eb51-4651-83bb-d210480503a5",
            "pub_date": "2026-02-28 02:00:43",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "4d9d2e08-5196-468b-a3f0-8b4bc66317ed",
            "description": "TRUMP: I GET ALONG WELL WITH IRAQI LEADERSHIP",
            "link": "https://www.markets.news/headlines/4d9d2e08-5196-468b-a3f0-8b4bc66317ed",
            "pub_date": "2026-02-28 02:00:44",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed cuts key rate to stem job losses; S&P 500 rises on 2026 projections. Chair Powell's news conference key.",
            "id": "98fe33bd-81a4-4f8a-a529-6f4499aaf134",
            "description": "In response to economic projections for 2026 and Chair Jerome Powell's news conference, the S&P 500 reacted positively despite the Federal Reserve's decision to cut its key interest rate. This move was aimed at curbing job losses in the market, signaling a potential boost in investor confidence.",
            "link": "https://www.markets.news/headlines/98fe33bd-81a4-4f8a-a529-6f4499aaf134",
            "pub_date": "2026-02-28 01:51:47",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed meeting: Job openings rise, potential 2026 rate cut. Context vital in interpreting Fed projections.",
            "id": "771166c2-56ed-45ac-9b1f-acaeb611a40c",
            "description": "The latest Federal Reserve projections indicate a potential single rate reduction in 2026. Despite this, it is crucial to consider the broader context. Following the Fed meeting, there has been a notable increase in job openings. However, experts advise against interpreting this as a significant hawkish policy shift. This update comes amidst ongoing market speculation and analysis.",
            "link": "https://www.markets.news/headlines/771166c2-56ed-45ac-9b1f-acaeb611a40c",
            "pub_date": "2026-02-28 01:51:49",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's inflation rate below forecast, leading to anticipated rate cut; S&P 500 rallies.",
            "id": "454fdae4-3f86-4aa4-8376-f67276c44cff",
            "description": "The current inflation rate is lower than what was projected by the Federal Reserve. This post suggests that the likelihood of a rate cut by the Fed has increased due to this trend. Additionally, following this news, the S&P 500 index experienced a rally.",
            "link": "https://www.markets.news/headlines/454fdae4-3f86-4aa4-8376-f67276c44cff",
            "pub_date": "2026-02-28 01:51:51",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ADP report: Private payrolls drop; official BLS report pending. S&P 500 uncertain. Fed meeting soon. via @IBDinvestors.",
            "id": "9da4174b-2e6b-4ad4-8144-5abfe89e854a",
            "description": "The official jobs report from the Bureau of Labor Statistics (BLS) is expected to be released after the Federal Reserve meeting. The recent ADP Jobs Report revealed a surprising decline in private payrolls. This news led to fluctuations in the S&P 500 index. The BLS report is highly anticipated to provide a comprehensive view of the current job market situation.",
            "link": "https://www.markets.news/headlines/9da4174b-2e6b-4ad4-8144-5abfe89e854a",
            "pub_date": "2026-02-28 01:51:52",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Consumer confidence decreases, employment falls, ADP report reflects job losses through early November, supporting potential Fed rate cut.",
            "id": "572790f0-d8fd-4767-b0d8-0e326d12fb96",
            "description": "According to recent data from ADP's weekly jobs report, the economy experienced a decline in employment numbers through the beginning of November. Concurrently, there has been a drop in consumer confidence. These factors have contributed to a decrease in employment levels, bolstering expectations for a potential cut by the Federal Reserve.",
            "link": "https://www.markets.news/headlines/572790f0-d8fd-4767-b0d8-0e326d12fb96",
            "pub_date": "2026-02-28 01:51:54",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jobless rate nears 4-year high, but hiring improves. Last jobs report before Fed meeting on Dec. 10 carries weight.",
            "id": "5ba2a213-d2b9-4b64-83e7-b7e25a4463d4",
            "description": "The upcoming jobs report, released just before the Federal Reserve's meeting on December 10, will be crucial in determining the likelihood of further rate cuts. Recent data shows that the jobless rate has reached a nearly 4-year high, reaching its highest level in quite some time. However, there is a silver lining as hiring has shown signs of improvement according to the latest figures. This information could heavily influence the Fed's decision-making process as they weigh the need for additional rate cuts during the upcoming meeting.",
            "link": "https://www.markets.news/headlines/5ba2a213-d2b9-4b64-83e7-b7e25a4463d4",
            "pub_date": "2026-02-28 01:51:57",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kyivstar prices secondary offering with 12,100,000 common shares by VEON Amsterdam B.V. at $10.50 per share, a 30-day option for 1,875,000 more shares.",
            "id": "e9aee888-7820-4ac8-b202-72a33d940fed",
            "description": "January 29, 2026- VEON Ltd. revealed that Kyivstar Group Ltd., a prominent digital operator in Ukraine, has declared the pricing of a public offering of 12,100,000 common shares by VEON Amsterdam B.V. and 400,000 common shares by other selling shareholders, at a rate of USD 10.50 per share. This offering includes a provision for the underwriters to buy an additional 1,875,000 common shares within 30 days at the same price, after deducting underwriting expenses.",
            "link": "https://www.markets.news/headlines/e9aee888-7820-4ac8-b202-72a33d940fed",
            "pub_date": "2026-02-28 01:52:01",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "c77101f1-8e75-46dc-9717-e0dde946b124",
            "description": "US NY FED GDPNOWCAST Q1: 2.38% (PREV 2.37%)",
            "link": "https://www.markets.news/headlines/c77101f1-8e75-46dc-9717-e0dde946b124",
            "pub_date": "2026-02-28 01:52:53",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sei Network support added by Ledger Enterprise for institutional custody as Giga upgrade nears, offering multi-signature options.",
            "id": "41e9a7d8-f763-45e2-9235-b212c69179aa",
            "description": "Ledger Enterprise now includes native support for Sei Network, facilitating multi-signature custody and audit-ready infrastructure for institutions in preparation for the upcoming Giga upgrade. This development ensures added security and compliance features for institutional users.",
            "link": "https://www.markets.news/headlines/41e9a7d8-f763-45e2-9235-b212c69179aa",
            "pub_date": "2026-02-28 01:54:33",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "0436f79f-d714-4f01-b005-80e8ec107a98",
            "description": "A lawmaker seeks records from US Commerce Secretary Lutnick over tariff refunds.",
            "link": "https://www.markets.news/headlines/0436f79f-d714-4f01-b005-80e8ec107a98",
            "pub_date": "2026-02-28 01:42:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "365516e3-ebc6-48b3-86a4-5230493f3fd1",
            "description": "TRUMP ON MORTGAGE RATES: GOING DOWN VERY RAPIDLY",
            "link": "https://www.markets.news/headlines/365516e3-ebc6-48b3-86a4-5230493f3fd1",
            "pub_date": "2026-02-28 01:42:10",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "fc8b168b-aae9-4f4d-88ce-9af92cd3c1ca",
            "description": "TRUMP: IRAN WOULD BE SMART TO MAKE A DEAL",
            "link": "https://www.markets.news/headlines/fc8b168b-aae9-4f4d-88ce-9af92cd3c1ca",
            "pub_date": "2026-02-28 01:42:11",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Median Technologies, AI developer for early cancer diagnosis, to present at TD Cowen Health Care Conference on March 2-4.",
            "id": "f59df3c8-dc81-44e6-b3d4-88d91688943d",
            "description": "Based in Sophia Antipolis, France, Median Technologies (FR0011049824, ALMDT) is a prominent developer of eyonis®, an artificial intelligence-driven Software as a Medical Device (SaMD) for early cancer detection. The company also offers AI-powered image analysis and central imaging services for oncology drug developers worldwide. They have revealed plans to attend TD Cowen’s 46th Annual Health Care Conference from March 2-4, 202*, showcasing their innovative solutions in the sector.",
            "link": "https://www.markets.news/headlines/f59df3c8-dc81-44e6-b3d4-88d91688943d",
            "pub_date": "2026-02-28 01:42:36",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "",
            "id": "af20127a-1249-43e2-8dfa-92a99d02338f",
            "description": "Trump to Homebuyers: Save money, wait a little longer.",
            "link": "https://www.markets.news/headlines/af20127a-1249-43e2-8dfa-92a99d02338f",
            "pub_date": "2026-02-28 01:42:55",
            "source": "unusualwhales",
            "kind": 1,
            "language": "en"
        }
    ]
}